{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 14,
  "verses": [
    {
      "pk": 23014001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 1,
      "text": "The fool says in his heart, \"There is no God.\" They are corrupt, they do detestable deeds; not one of them does good.",
      "links": "<a href='/AIV/19/53/1'>Ps. 53:1</a>; <a href='/AIV/20/1/22'>Prov. 1:22</a>; <a href='/AIV/45/3/10'>Rom. 3:10</a>",
      "comment": "This verse plainly declares the spiritual blindness of those who reject God. Notice the correlation with Romans 3:10, where Paul echoes the universal need for grace. The fool’s denial begins in the heart, showing that sin’s root is interior. From an apologetics perspective, this affirms the necessity of faith in our inner life rather than mere intellect. The description of corruption and evil acts alludes to the fallen state of humanity and the need for restoration—a theme that ultimately points to the necessity of divine intervention and communal worship."
    },
    {
      "pk": 23014002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 2,
      "text": "The LORD looks down from heaven on the children of men, to see if there are any who understand, who seek God.",
      "links": "<a href='/AIV/19/33/13'>Ps. 33:13</a>; <a href='/AIV/19/102/19'>Ps. 102:19</a>; <a href='/AIV/45/3/11'>Rom. 3:11</a>",
      "comment": "Here, God’s transcendence and active concern for humanity is shown. The language recalls Genesis 6:5 and highlights both God's omniscience and His desire for relationship with mankind. The seeking after God is foundational for spiritual life—a theme consistent with a sacramental worldview: seeking God together, not only privately but in communal worship and union."
    },
    {
      "pk": 23014003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 3,
      "text": "They have all turned aside; together they have become corrupt. No one does good, not even one.",
      "links": "<a href='/AIV/19/53/3'>Ps. 53:3</a>; <a href='/AIV/45/3/12'>Rom. 3:12</a>",
      "comment": "Universal depravity is at the heart here. Paul’s use of this verse in Romans 3 stresses that everyone is in need of redemption. It echoes the spiritual reality that no mere human effort suffices for righteousness, emphasizing the need for both faith and a living tradition to receive grace. This naturally pushes the reader toward the expectation of a mediating institution for grace."
    },
    {
      "pk": 23014004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 4,
      "text": "Do all the evildoers not know, who devour my people as they eat bread, and do not call upon the LORD?",
      "links": "<a href='/AIV/19/53/4'>Ps. 53:4</a>; <a href='/AIV/33/3/3'>Mic. 3:3</a>",
      "comment": "The analogy of ‘eating bread’ shows how natural, unthinking exploitation can become for those apart from God. ‘My people’ refers to a distinct, called community, hinting at a visible, worshiping assembly. The neglect of calling upon the LORD reveals the necessity of active prayer and liturgy in faith, connecting communal worship and intercession as essential aspects of true religion."
    },
    {
      "pk": 23014005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 5,
      "text": "There they are, in great fear, for God is with the generation of the righteous.",
      "links": "<a href='/AIV/19/53/5'>Ps. 53:5</a>; <a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "The fear of the ungodly contrasts with God’s protective presence among the righteous. The ‘generation’ implies continuity—a faith passed down, not chosen in isolation. Divine presence is tied to those who join in right worship and remain faithful, which subtly elevates the importance of belonging to the unified worshipping community as the safeguard of righteousness."
    },
    {
      "pk": 23014006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 6,
      "text": "You put to shame the plans of the poor, but the LORD is his refuge.",
      "links": "<a href='/AIV/19/9/9'>Ps. 9:9</a>; <a href='/AIV/19/37/40'>Ps. 37:40</a>; <a href='/AIV/19/53/6'>Ps. 53:6</a>",
      "comment": "The poor are uniquely cared for by God, highlighting a preference for the humble and marginalized. This reflects a core principle of serving others and relying on God as protector. The spiritual reading points to trusting God not only individually but as recipients of mercy offered through the means He established for protection and aid."
    },
    {
      "pk": 23014007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 14,
      "verse": 7,
      "text": "Oh, that salvation for Israel would come out of Zion! When the LORD restores his people, Jacob will rejoice, Israel will be glad.",
      "links": "<a href='/AIV/19/53/6'>Ps. 53:6</a>; <a href='/AIV/23/2/3'>Isa. 2:3</a>; <a href='/AIV/42/24/47'>Luke 24:47</a>",
      "comment": "Salvation ‘out of Zion’ foreshadows the fulfillment found in Christ, who brings salvation from the heart of God’s chosen dwelling place (cf. Luke 24:47, Isa. 2:3). The restoration of God’s people is both national and spiritual, pointing to a future time of joy and unity in worship. The longing for a restored people hints at a visible, sacramental, and united worship centered at the one place God chooses, fulfilled in the Messiah’s kingdom."
    }
  ],
  "translatedAt": "2025-12-24T06:02:55.072Z"
}