{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 99,
  "verses": [
    {
      "pk": 23099001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 1,
      "text": "The LORD reigns; let the peoples tremble. He sits enthroned above the cherubim; let the earth quake.",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/19/18/10'>Ps. 18:10</a>; <a href='/AIV/02/25/22'>Ex. 25:22</a>",
      "comment": "The LORD’s kingship is declared, and His dwelling is described in terms of the cherubim—symbolic guardians of God’s presence, especially in the tabernacle and temple. God’s reign inspires awe and reverence, anticipating Christ as the true King enthroned in glory (Rev. 4:2-6)."
    },
    {
      "pk": 23099002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 2,
      "text": "The LORD is great in Zion; He is exalted over all the peoples.",
      "links": "<a href='/AIV/19/48/1'>Ps. 48:1-2</a>; <a href='/AIV/19/97/9'>Ps. 97:9</a>",
      "comment": "Zion, the spiritual center of God’s people, signifies God’s presence among His people and His universal authority. There is both a local and universal dimension—Zion first a geographical place, then later a reference to the heavenly Jerusalem (Heb. 12:22)."
    },
    {
      "pk": 23099003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 3,
      "text": "Let them praise Your name, great and awesome; He is holy.",
      "links": "<a href='/AIV/19/111/9'>Ps. 111:9</a>; <a href='/AIV/19/22/3'>Ps. 22:3</a>",
      "comment": "Repeated emphasis that God is holy sets this psalm alongside Isaiah’s vision (Isa. 6:3)—the holiness of God is central to worship and is highlighted in the New Testament as belonging to Christ (Mark 1:24; Rev. 4:8)."
    },
    {
      "pk": 23099004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 4,
      "text": "The King’s strength loves justice. You have established equity; You have made justice and righteousness in Jacob.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>; <a href='/AIV/19/89/14'>Ps. 89:14</a>",
      "comment": "God’s reign is characterized by justice and uprightness. This anticipates the messianic king who will perfectly fulfill justice and righteousness (Jer. 23:5; Matt. 5:6)."
    },
    {
      "pk": 23099005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 5,
      "text": "Exalt the LORD our God; worship at His footstool! He is holy.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/19/132/7'>Ps. 132:7</a>",
      "comment": "God’s footstool points to the Ark and the temple, sites of sacrificial worship and God’s immediate presence. ‘Exalt’ and ‘worship’ highlight the profound reverence expected—this worship finds full expression in the New Testament worship of Christ (Heb. 1:6)."
    },
    {
      "pk": 23099006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 6,
      "text": "Moses and Aaron were among His priests, and Samuel among those who called on His name; they called to the LORD, and He answered them.",
      "links": "<a href='/AIV/19/105/26'>Ps. 105:26</a>; <a href='/AIV/09/07/9'>1 Sam. 7:9</a>",
      "comment": "The psalm points to the foundational leaders and mediators between God and His people, highlighting a visible priestly ministry. Access to God comes through appointed mediators, anticipating Jesus as the ultimate mediator (1 Tim. 2:5; Heb. 7:23-25)."
    },
    {
      "pk": 23099007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 7,
      "text": "He spoke to them in the pillar of cloud; they kept His testimonies and the decree He gave them.",
      "links": "<a href='/AIV/02/33/9'>Ex. 33:9</a>; <a href='/AIV/02/13/21'>Ex. 13:21</a>",
      "comment": "The pillar of cloud is a visible sign of God’s guidance and presence in the wilderness. The obedience of the leaders sets the precedent for submission to God’s law—spiritually, the New Testament shows God’s full revelation in Christ (John 1:14-17; Matt. 17:5)."
    },
    {
      "pk": 23099008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 8,
      "text": "LORD our God, You answered them; You were a forgiving God to them, yet an avenger of their misdeeds.",
      "links": "<a href='/AIV/02/34/6-7'>Ex. 34:6-7</a>; <a href='/AIV/19/78/38'>Ps. 78:38</a>",
      "comment": "God’s justice is shown in His willingness to forgive yet also discipline. God is both merciful and just. This balance finds its fulfillment in Christ’s atonement—mercy and justice met on the cross (Rom. 3:25-26; Eph. 2:4-5)."
    },
    {
      "pk": 23099009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 99,
      "verse": 9,
      "text": "Exalt the LORD our God; worship at His holy mountain, for the LORD our God is holy.",
      "links": "<a href='/AIV/19/48/1'>Ps. 48:1-2</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "The holy mountain refers to Zion, the center of divine worship and presence. The call to worship highlights the importance of both the location and the spiritual reality of communion with God—pointing forward to the heavenly Zion, a gathered people united in worship through Christ."
    }
  ],
  "translatedAt": "2025-12-24T06:33:55.330Z"
}