{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 127,
  "verses": [
    {
      "pk": 23127001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 127,
      "verse": 1,
      "text": "Unless the LORD builds the house, those who build it labor in vain. Unless the LORD guards the city, the watchman stays awake in vain.",
      "links": "<a href='/AIV/19/121/1'>Ps. 121:1</a>; <a href='/AIV/20/16/9'>Prov. 16:9</a>; <a href='/AIV/40/7/24-27'>Matt. 7:24-27</a>",
      "comment": "This verse emphasizes the absolute dependence on God's initiative and blessing in every endeavor. The references to 'house' and 'city' are often seen as both literal (families, communities) and metaphorical (the spiritual household of faith, the people of God). In the New Testament, Jesus speaks of building on the true foundation (Matt. 7:24-27), reinforcing that only God's plan stands firm. This verse also hints at the apostolic tradition of recognizing God's sovereignty in establishing His people and His Church."
    },
    {
      "pk": 23127002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 127,
      "verse": 2,
      "text": "It is in vain for you to rise up early and stay up late, eating the bread of anxious toil; for He gives sleep to His beloved.",
      "links": "<a href='/AIV/21/2/23'>Eccl. 2:23</a>; <a href='/AIV/40/6/25-34'>Matt. 6:25-34</a>",
      "comment": "Here, human effort apart from God's blessing leads to anxiety and futility. The 'bread of anxious toil' reflects a life consumed with worry. In the Gospels, Jesus teaches not to be anxious but to trust the Father's care (Matt. 6:25-34). The assurance that 'He gives sleep to His beloved' subtly calls to a spiritual rest found in trustful dependence, and in sacred tradition, hints at finding peace in God's provision, especially those set apart as His beloved."
    },
    {
      "pk": 23127003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 127,
      "verse": 3,
      "text": "Behold, children are a heritage from the LORD, the fruit of the womb a reward.",
      "links": "<a href='/AIV/01/33/5'>Gen. 33:5</a>; <a href='/AIV/19/113/9'>Ps. 113:9</a>",
      "comment": "This verse expresses the biblical view of children as a blessing and inheritance from God. In the original language, 'heritage' suggests a gift that continues the legacy of God's covenant people. The family is seen as central to God's plan, which reflects the importance of honoring the gift of life and the transmission of faith to the next generation—an enduring mark of the one faith passed down through the ages."
    },
    {
      "pk": 23127004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 127,
      "verse": 4,
      "text": "Like arrows in the hand of a warrior, so are the children of one’s youth.",
      "links": "<a href='/AIV/20/17/6'>Prov. 17:6</a>",
      "comment": "This vivid image reveals that children given by God strengthen and protect the family, just as arrows equip a warrior. The language suggests not merely individual blessing but the building up of a faithful people, extending God’s promise through generations, and highlighting the unity and purpose of the family within the spiritual household."
    },
    {
      "pk": 23127005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 127,
      "verse": 5,
      "text": "Blessed is the man who fills his quiver with them! He will not be put to shame when he speaks with his enemies at the gate.",
      "links": "<a href='/AIV/18/5/4'>Job 5:4</a>; <a href='/AIV/05/21/19'>Deut. 21:19</a>",
      "comment": "Children are not only a blessing but a source of honor and security for their parents. The 'gate' was the place of judgment and public life in ancient Israel. The blessing declared here points to the strength and unity found in a faithful household—a theme echoed throughout scripture in both literal family and the broader community of faith united under God’s protection and guidance."
    }
  ],
  "translatedAt": "2025-12-24T06:43:30.439Z"
}