{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 133,
  "verses": [
    {
      "pk": 23133001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 133,
      "verse": 1,
      "text": "Look, how good and how pleasant it is when brothers live together in unity!",
      "links": "<a href='/AIV/19/122/8'>Ps. 122:8</a>; <a href='/AIV/43/17/21-23'>John 17:21-23</a>",
      "comment": "This verse highlights the beauty of unity among God's people. The word 'brothers' in the Hebrew includes not just biological kin but all members of the faith community, pointing to the spiritual family. The unity mentioned here foreshadows Christ’s prayer in John 17 for all believers to be one, as He and the Father are one. True unity among believers is foundational to the witness of the Church and reflects the harmony intended by Christ."
    },
    {
      "pk": 23133002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 133,
      "verse": 2,
      "text": "It is like fine oil poured on the head, running down upon the beard, upon Aaron's beard, running down on the collar of his robes.",
      "links": "<a href='/AIV/02/30/25-30'>Ex. 30:25-30</a>; <a href='/AIV/03/08/12'>Lev. 8:12</a>",
      "comment": "The image of anointing oil flowing down Aaron’s beard refers to the consecration of the high priest, setting him apart for sacred service. In the New Testament, anointing often symbolizes the Holy Spirit and divine blessing. Aaron’s anointing is a symbol of spiritual leadership and unity, appointed and sanctified by God’s authority. This points spiritually to the unity established through Christ as High Priest and through those appointed to lead and preserve unity among God’s people (see Exodus 30 and John 17)."
    },
    {
      "pk": 23133003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 133,
      "verse": 3,
      "text": "It is like the dew of Hermon falling on the mountains of Zion. For there the LORD commanded the blessing—life forevermore.",
      "links": "<a href='/AIV/05/28/8'>Deut. 28:8</a>; <a href='/AIV/19/134/3'>Ps. 134:3</a>; <a href='/AIV/19/36/9'>Ps. 36:9</a>",
      "comment": "Hermon’s dew was known for its abundance and life-giving moisture, affecting even distant Zion. This illustrates how unity brings spiritual refreshment and blessing to God’s people. The 'commanded blessing' is not only material but points to eternal life, fulfilled through the New Covenant established by Christ. Just as the dew sanctifies the mountains, God’s blessing is poured out through the unity preserved by apostolic teaching and worship. This means that the fullness of life from God comes in and through the gathered, unified assembly of His people (see Ps. 36:9 and Deut. 28:8)."
    }
  ],
  "translatedAt": "2025-12-24T06:45:01.571Z"
}