{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 113,
  "verses": [
    {
      "pk": 23113001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 1,
      "text": "Praise the LORD! Praise, you servants of the LORD, praise the name of the LORD.",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>; <a href='/AIV/19/135/1-2'>Ps. 135:1-2</a>",
      "comment": "The call is addressed specifically to the 'servants of the LORD,' which in the Old Testament context often points to the ministers in the sanctuary, a type of priesthood (see Ps. 134:1). In a spiritual sense, all believers, as God's servants, are called into a constant act of praise and worship, which finds fuller meaning when worship is both communal and sacrificial."
    },
    {
      "pk": 23113002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 2,
      "text": "Blessed be the name of the LORD from this time forth and forevermore.",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>; <a href='/AIV/19/115/18'>Ps. 115:18</a>",
      "comment": "The phrase 'from this time forth and forevermore' highlights the everlasting nature of true worship. It subtly anticipates the perpetual praise offered by God's people through every age, which continues in heaven."
    },
    {
      "pk": 23113003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 3,
      "text": "From the rising of the sun to its setting, the name of the LORD is to be praised.",
      "links": "<a href='/AIV/19/50/1'>Ps. 50:1</a>; <a href='/AIV/39/1/11'>Mal. 1:11</a>",
      "comment": "'From the rising of the sun to its setting' indicates universality—God's praise is not limited by time or geography. This also foreshadows the spread of true worship across all nations (see Mal. 1:11), fulfilled in the worldwide people of God."
    },
    {
      "pk": 23113004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 4,
      "text": "The LORD is exalted above all nations, his glory is above the heavens.",
      "links": "<a href='/AIV/19/8/1'>Ps. 8:1</a>; <a href='/AIV/19/97/9'>Ps. 97:9</a>",
      "comment": "This verse affirms the absolute transcendence of God, whose glory surpasses not just the nations but the very heavens. In a deeper sense, this exaltation prefigures Christ's ascension (see Eph. 1:20-21), the fulfillment of God's glory above all creation."
    },
    {
      "pk": 23113005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 5,
      "text": "Who is like the LORD our God, who is seated on high,",
      "links": "<a href='/AIV/19/35/10'>Ps. 35:10</a>; <a href='/AIV/19/89/6'>Ps. 89:6</a>",
      "comment": "A rhetorical question that highlights God's incomparability. The image of God 'seated on high' anticipates the enthronement of the Messiah, who shares the Father's throne, a truth echoed in the New Testament's descriptions of Jesus (see Heb. 1:3)."
    },
    {
      "pk": 23113006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 6,
      "text": "who looks far down on the heavens and the earth?",
      "links": "<a href='/AIV/19/14/2'>Ps. 14:2</a>; <a href='/AIV/19/33/13'>Ps. 33:13-14</a>",
      "comment": "God's majesty is so great that even the heavens are 'low' compared to His throne. This connects to the idea of divine transcendence while also affirming God's immanence—He is not a distant deity but cares for creation with intimate attention."
    },
    {
      "pk": 23113007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 7,
      "text": "He raises the poor from the dust and lifts the needy from the ash heap,",
      "links": "<a href='/AIV/19/107/41'>Ps. 107:41</a>; <a href='/AIV/9/2/8'>1 Sam. 2:8</a>",
      "comment": "This verse echoes Hannah's song (1 Sam. 2:8) and shows God's special concern for the lowly. In spiritual interpretation, it prefigures the redemption of humanity in Christ and God’s preference for the humble and the poor in His kingdom (see Lk. 1:52-53)."
    },
    {
      "pk": 23113008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 8,
      "text": "to seat them with princes, with the princes of his people.",
      "links": "<a href='/AIV/19/107/41'>Ps. 107:41</a>; <a href='/AIV/42/22/30'>Lk. 22:30</a>",
      "comment": "God not only uplifts the humble but grants them a share in the dignity of the rulers of His people. Spiritually, this anticipates the participation of the saints in the glory of Christ, the King, especially as promised in the New Covenant (see Lk. 22:30; Rev. 3:21)."
    },
    {
      "pk": 23113009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 113,
      "verse": 9,
      "text": "He grants the barren woman a home, making her the joyful mother of children. Praise the LORD!",
      "links": "<a href='/AIV/9/1/20'>1 Sam 1:20</a>; <a href='/AIV/19/68/6'>Ps. 68:6</a>",
      "comment": "The blessing for the barren woman is a recurring biblical image (see 1 Sam. 1:20). Beyond the literal sense, it points to God's power to bring fruitfulness where there is none—anticipating the spiritual fruitfulness of God's people and the joy of belonging to God's family. The concluding call to 'Praise the LORD!' renews the invitation to join in unending worship, reflecting a life centered on God's grace and presence."
    }
  ],
  "translatedAt": "2025-12-24T06:39:55.476Z"
}