{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 22,
  "verses": [
    {
      "pk": 23022001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 1,
      "text": "My God, my God, why have you forsaken me? Why are you so far from saving me, from the words of my groaning?",
      "links": "<a href='/AIV/40/27/46'>Matt. 27:46</a>; <a href='/AIV/41/15/34'>Mark 15:34</a>",
      "comment": "These words are famously quoted by Jesus on the cross (see Matthew 27:46). This Psalm is a prophetic portrayal of suffering, reflecting both David’s distress and pointing to the suffering of the Messiah. The opening question expresses deep anguish but is steeped in faith, highlighting trust despite apparent abandonment."
    },
    {
      "pk": 23022002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 2,
      "text": "My God, I cry out by day, but you do not answer, and by night, but I find no rest.",
      "links": "<a href='/AIV/18/30/20'>Job 30:20</a>; <a href='/AIV/19/6/6'>Ps. 6:6</a>",
      "comment": "This verse emphasizes the intensity and persistence of prayer. Even when God seems distant, faith continues to seek Him. The experience of unanswered prayer is a universal human struggle, yet it often leads to deeper trust."
    },
    {
      "pk": 23022003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 3,
      "text": "Yet you are holy, enthroned on the praises of Israel.",
      "links": "<a href='/AIV/19/99/1'>Ps. 99:1</a>",
      "comment": "In suffering, the Psalmist affirms God's holiness and kingship. God's holiness is unwavering, and worship remains central—even in distress. This sets the stage for how true worship brings us into God’s presence."
    },
    {
      "pk": 23022004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 4,
      "text": "In you our ancestors trusted; they trusted, and you delivered them.",
      "links": "<a href='/AIV/19/78/5-7'>Ps. 78:5-7</a>",
      "comment": "The Psalmist recalls Israel’s historic faith and deliverance. Remembering God’s faithfulness to previous generations builds hope that He remains trustworthy—even when unseen."
    },
    {
      "pk": 23022005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 5,
      "text": "To you they cried and were rescued; in you they trusted and were not put to shame.",
      "links": "<a href='/AIV/19/25/3'>Ps. 25:3</a>",
      "comment": "The pattern of deliverance for those who trust in God points forward to the hope of all who seek refuge in Him. Trust and prayer are shown as the way to salvation."
    },
    {
      "pk": 23022006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 6,
      "text": "But I am a worm and not a man, scorned by mankind and despised by the people.",
      "links": "<a href='/AIV/23/53/3'>Isaiah 53:3</a>",
      "comment": "This depiction of deep humiliation and rejection closely mirrors the prophecies concerning the Suffering Servant (see Isaiah 53:3). It foreshadows the Messiah’s suffering, later fulfilled in Jesus."
    },
    {
      "pk": 23022007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 7,
      "text": "All who see me mock me; they make mouths at me; they shake their heads.",
      "links": "<a href='/AIV/40/27/39-40'>Matt. 27:39-40</a>; <a href='/AIV/19/109/25'>Ps. 109:25</a>",
      "comment": "Mockery and derision were fulfilled during Christ's crucifixion (Matthew 27:39-40). The Psalm foreshadows both literal persecution and spiritual alienation for believers who follow God’s path."
    },
    {
      "pk": 23022008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 8,
      "text": "\"He trusts in the LORD; let him deliver him; let him rescue him, for he delights in him!\"",
      "links": "<a href='/AIV/40/27/43'>Matt. 27:43</a>",
      "comment": "The taunt of Jesus' enemies at the cross directly quotes this verse (Matthew 27:43). Such prophecy demonstrates God’s sovereignty in history and prefigures the completion of salvation history through Christ."
    },
    {
      "pk": 23022009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 9,
      "text": "Yet you are the one who brought me out of the womb; you made me trust in you at my mother’s breasts.",
      "links": "<a href='/AIV/71/1/14'>Luke 1:14</a>",
      "comment": "Dependence on God begins from birth. Emphasizing trust from infancy aligns with a life wholly dedicated to God, highlighting the pattern of sanctification from life's earliest moments."
    },
    {
      "pk": 23022010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 10,
      "text": "From birth I was cast upon you; from my mother’s womb you have been my God.",
      "links": "<a href='/AIV/19/71/6'>Ps. 71:6</a>",
      "comment": "The Psalmist acknowledges God’s lifelong providence. This evokes the biblical idea of being set apart for God from the very beginning, foreshadowing the perpetual call to holiness."
    },
    {
      "pk": 23022011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 11,
      "text": "Do not be far from me, for trouble is near and there is no one to help.",
      "links": "<a href='/AIV/19/71/12'>Ps. 71:12</a>",
      "comment": "In moments of deepest distress, the Psalmist’s only helper is God. This theme finds its climax at the cross, where Jesus' isolation achieves universal redemption."
    },
    {
      "pk": 23022012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 12,
      "text": "Many bulls surround me; strong bulls of Bashan encircle me;",
      "links": "<a href='/AIV/19/68/30'>Ps. 68:30</a>",
      "comment": "Here, enemies are depicted as fierce animals. The imagery intensifies the sense of threat, illustrating spiritual warfare and foreshadowing evil forces surrounding Christ."
    },
    {
      "pk": 23022013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 13,
      "text": "they open wide their mouths at me, like a roaring and tearing lion.",
      "links": "<a href='/AIV/27/6/24'>Dan. 6:24</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "The enemy is likened to a lion—both fierce and relentless. This characterizes both literal threats and the spiritual adversary who seeks to devour (1 Peter 5:8)."
    },
    {
      "pk": 23022014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 14,
      "text": "I am poured out like water, and all my bones are out of joint; my heart has melted within me like wax.",
      "links": "<a href='/AIV/19/69/20'>Ps. 69:20</a>; <a href='/AIV/43/19/34'>John 19:34</a>",
      "comment": "A vivid description of suffering, fulfilled in the passion and death of Christ. The physical details parallel the crucifixion, particularly His side being pierced (John 19:34)."
    },
    {
      "pk": 23022015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 15,
      "text": "My mouth is dried up like broken pottery, and my tongue sticks to the roof of my mouth; you lay me in the dust of death.",
      "links": "<a href='/AIV/43/19/28'>John 19:28</a>",
      "comment": "Dehydration and nearing death’s door recall Jesus’ words “I thirst” on the cross (John 19:28). The Psalm reveals the total emptiness of self at the point of surrender to God’s will."
    },
    {
      "pk": 23022016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 16,
      "text": "Dogs surround me; a company of evildoers encircles me; they have pierced my hands and feet.",
      "links": "<a href='/AIV/43/20/25'>John 20:25</a>; <a href='/AIV/38/12/10'>Zech. 12:10</a>",
      "comment": "The explicit mention of 'pierced hands and feet' is a striking prophecy of crucifixion. This detail, fulfilled in Jesus’ passion, links the Old Testament expectation of a suffering redeemer with its New Testament fulfillment."
    },
    {
      "pk": 23022017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 17,
      "text": "I can count all my bones—people stare and gloat over me;",
      "links": "<a href='/AIV/19/38/17'>Ps. 38:17</a>; <a href='/AIV/43/19/36'>John 19:36</a>",
      "comment": "A further reference to the sufferer's exposure and humiliation. In Christ, none of His bones were broken (John 19:36), fulfilling this prophecy."
    },
    {
      "pk": 23022018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 18,
      "text": "They divide my garments among them and cast lots for my clothing.",
      "links": "<a href='/AIV/43/19/23-24'>John 19:23-24</a>",
      "comment": "Another specific fulfillment in the Passion—the soldiers gambled for Jesus’ clothes (John 19:23-24). These details highlight the supernatural accuracy and unity of Scripture."
    },
    {
      "pk": 23022019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 19,
      "text": "But you, O LORD, do not be far off! O my strength, come quickly to help me!",
      "links": "<a href='/AIV/19/35/2'>Ps. 35:2</a>",
      "comment": "A turn toward prayer for deliverance, affirming God's nearness even when He seems distant. The request for help echoes our need for continual dependence on God’s grace."
    },
    {
      "pk": 23022020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 20,
      "text": "Deliver my life from the sword, my precious life from the power of the dog;",
      "links": "<a href='/AIV/19/17/13'>Ps. 17:13</a>",
      "comment": "The Psalmist identifies his soul as precious, pleading for rescue from physical and spiritual dangers. This reflects a faith rooted in God’s ability to save even from the most severe threats."
    },
    {
      "pk": 23022021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 21,
      "text": "Save me from the mouth of the lion! From the horns of wild oxen, you have answered me!",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "This plea moves from desperate petition to confident hope, celebrating God’s response. Deliverance from evil is seen as both present and future—a pattern reflected in the life of Jesus and all the saints."
    },
    {
      "pk": 23022022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 22,
      "text": "I will declare your name to my brothers; in the midst of the congregation I will praise you.",
      "links": "<a href='/AIV/58/2/12'>Heb. 2:12</a>",
      "comment": "Quoting this verse, Hebrews applies it to Jesus—He proclaims God’s name among His brethren (Heb. 2:12). Public praise and communal worship are presented as central to life with God."
    },
    {
      "pk": 23022023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 23,
      "text": "You who fear the LORD, praise him! All you offspring of Jacob, glorify him; and fear him, all you offspring of Israel!",
      "links": "<a href='/AIV/19/135/19-20'>Ps. 135:19-20</a>",
      "comment": "The call to praise is not limited to the individual but directed to all of God’s people. Worship is depicted as both a personal and a communal act, essential to the faith."
    },
    {
      "pk": 23022024,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 24,
      "text": "For he has not despised or abhorred the suffering of the afflicted, nor has he hidden his face from him; but when he cried to him, he heard.",
      "links": "<a href='/AIV/19/9/12'>Ps. 9:12</a>",
      "comment": "Suffering is not ignored by God; He hears the cry of the afflicted. Assurance of God’s attentiveness offers hope and strength amid trials."
    },
    {
      "pk": 23022025,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 25,
      "text": "From you comes my praise in the great congregation; I will fulfill my vows before those who fear him.",
      "links": "<a href='/AIV/19/50/14'>Ps. 50:14</a>",
      "comment": "Vows and public thanksgiving reflect the biblical practice of offering completed acts of worship in the assembly. Fulfilled vows symbolize the covenant’s relational aspect and the necessity of liturgical celebration."
    },
    {
      "pk": 23022026,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 26,
      "text": "The poor will eat and be satisfied; those who seek him will praise the LORD—may your hearts live forever!",
      "links": "<a href='/AIV/19/69/32'>Ps. 69:32</a>; <a href='/AIV/40/5/6'>Matt. 5:6</a>",
      "comment": "Table fellowship and the satisfaction of the poor allude to spiritual and material mercy, foreshadowing the Eucharistic fulfillment of all who hunger and thirst for righteousness (Matthew 5:6)."
    },
    {
      "pk": 23022027,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 27,
      "text": "All the ends of the earth will remember and turn to the LORD, and all the families of the nations will bow down before him.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/23/45/22-23'>Isaiah 45:22-23</a>",
      "comment": "This universal vision points to God’s salvation extending to all nations. This is fulfilled in the mission of the Church to the whole world, foreshadowed in Isaiah 45:22-23 and echoed in Philippians 2:10."
    },
    {
      "pk": 23022028,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 28,
      "text": "For dominion belongs to the LORD, and he rules over the nations.",
      "links": "<a href='/AIV/19/47/8'>Ps. 47:8</a>",
      "comment": "Acknowledging the Lord’s universal kingship, the verse anticipates His reign over all peoples—a core hope fulfilled in Christ as the King of kings."
    },
    {
      "pk": 23022029,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 29,
      "text": "All the prosperous of the earth will eat and worship; all who go down to the dust will bow before him, even those who cannot keep themselves alive.",
      "links": "<a href='/AIV/19/72/9'>Ps. 72:9</a>",
      "comment": "Worship unites both rich and poor, living and dying, in the worship of the Lord. This absolute universality points to the all-encompassing salvation promised in the Messiah."
    },
    {
      "pk": 23022030,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 30,
      "text": "Posterity will serve him; future generations will be told about the Lord.",
      "links": "<a href='/AIV/19/102/18'>Ps. 102:18</a>",
      "comment": "Faith is transmitted through generations. The transmission of faith and tradition is vital to the people of God, and all future generations are called to be part of the one faith."
    },
    {
      "pk": 23022031,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 22,
      "verse": 31,
      "text": "They shall come and proclaim his righteousness to a people yet unborn, that he has done it.",
      "links": "<a href='/AIV/40/28/19-20'>Matt. 28:19-20</a>",
      "comment": "The Psalm ends with victorious proclamation—God’s saving work will be made known to all future generations. 'He has done it' echoes 'It is finished' (John 19:30), revealing Christ’s fulfillment of Scripture and the completion of God's plan of redemption."
    }
  ],
  "translatedAt": "2025-12-24T06:06:06.792Z"
}