{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 63,
  "verses": [
    {
      "pk": 23063001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 1,
      "text": "God, you are my God; I earnestly seek you. My soul thirsts for you, my flesh longs for you, as in a dry and weary land where there is no water.",
      "links": "<a href='/AIV/42/6/21'>Luke 6:21</a>; <a href='/AIV/19/42/2'>Ps. 42:2</a>",
      "comment": "David's intense longing for God is a metaphor for spiritual hunger, which echoes the blessedness of those who thirst for righteousness (Matthew 5:6). We see the soul and body both involved in seeking God, which subtly supports a holistic approach to worship and devotion—embracing both physical and spiritual means."
    },
    {
      "pk": 23063002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 2,
      "text": "So I have looked upon you in the sanctuary, beholding your power and your glory.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/19/68/24'>Ps. 68:24</a>",
      "comment": "The sanctuary refers to the place of God’s presence, indicating David’s early worship in the tabernacle. Recognizing God’s power and glory in a sacred space hints at the importance of worship within consecrated places."
    },
    {
      "pk": 23063003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 3,
      "text": "Because your steadfast love is better than life, my lips will praise you.",
      "links": "<a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/103/4'>Ps. 103:4</a>",
      "comment": "The Hebrew 'hesed' for steadfast love implies God’s mercy and covenant faithfulness, which exceeds all earthly blessings. Worship expressed by lips points to vocal prayer and praise as vital spiritual disciplines—early Christian tradition prioritized public, communal worship utilizing both word and sacrament."
    },
    {
      "pk": 23063004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 4,
      "text": "So I will bless you as long as I live; in your name I will lift up my hands.",
      "links": "<a href='/AIV/19/134/2'>Ps. 134:2</a>; <a href='/AIV/54/2/8'>1 Tim. 2:8</a>",
      "comment": "Lifting hands signifies prayer and surrender; it’s an ancient practice showing devotion and worship. Commitment to lifelong blessing of God reflects ongoing participation in worship and liturgy."
    },
    {
      "pk": 23063005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 5,
      "text": "My soul will be satisfied as with rich food; my mouth will praise you with joyful lips.",
      "links": "<a href='/AIV/19/36/8'>Ps. 36:8</a>; <a href='/AIV/43/6/35'>John 6:35</a>",
      "comment": "David likens spiritual satisfaction to the joy of a feast, pointing ahead to the promised fullness in Christ (‘I am the bread of life’—John 6:35). The connection of physical nourishment and spiritual contentment anticipates the spiritual feast offered through worship and communion."
    },
    {
      "pk": 23063006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 6,
      "text": "When I remember you on my bed, and meditate on you in the watches of the night.",
      "links": "<a href='/AIV/19/119/148'>Ps. 119:148</a>; <a href='/AIV/19/77/6'>Ps. 77:6</a>",
      "comment": "Meditation here means deep, contemplative prayer even at night, emphasizing ongoing relationship with God. Early Christian prayer traditions highlight deliberate, regular devotion as essential for spiritual growth."
    },
    {
      "pk": 23063007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 7,
      "text": "For you have been my help, and in the shadow of your wings I will sing for joy.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>",
      "comment": "‘Shadow of your wings’ is a reference to protection and closeness, like dwelling near the Ark’s cherubim. Song of joy in God’s protection is a hallmark of a vibrant spiritual life with trust in divine providence."
    },
    {
      "pk": 23063008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 8,
      "text": "My soul clings to you; your right hand upholds me.",
      "links": "<a href='/AIV/19/139/10'>Ps. 139:10</a>; <a href='/AIV/19/18/35'>Ps. 18:35</a>",
      "comment": "Clinging to God reflects both human dependence and God’s sustaining grace. The ‘right hand’ is a biblical symbol of authority and strength (cf. Christ seated at the right hand—Mark 16:19), showing divine protection and support."
    },
    {
      "pk": 23063009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 9,
      "text": "But those who seek to destroy my life will go down into the depths of the earth.",
      "links": "<a href='/AIV/19/55/23'>Ps. 55:23</a>; <a href='/AIV/19/57/3'>Ps. 57:3'>",
      "comment": "David contrasts his own fate with that of his enemies, expressing confidence that justice comes from God. ‘Depths of the earth’ was a poetic expression for Sheol or the grave, later understood as a separation from God’s presence."
    },
    {
      "pk": 23063010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 10,
      "text": "They will be delivered over to the power of the sword; they will become food for jackals.",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>; <a href='/AIV/19/22/16'>Ps. 22:16</a>",
      "comment": "Enemies are pictured as defeated and dishonored. This negative destiny is juxtaposed with the reward of the faithful—major biblical theme of judgment and mercy, evident throughout salvation history."
    },
    {
      "pk": 23063011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 63,
      "verse": 11,
      "text": "But the king will rejoice in God; everyone who swears by him will glory, but the mouths of liars will be stopped.",
      "links": "<a href='/AIV/19/5/11'>Ps. 5:11</a>; <a href='/AIV/19/107/42'>Ps. 107:42</a>",
      "comment": "David refers to himself as ‘king,’ foreshadowing Christ the King—the fulfillment of the Davidic covenant (cf. Luke 1:32-33). The contrast between true worshipers who glory and liars who are silenced points to a final vindication of truth and righteousness, echoed in the New Testament promise of judgment and reward. The mention of rejoicing in God by the king subtly affirms the centrality of leadership and unity in worship for the people of God."
    }
  ],
  "translatedAt": "2025-12-24T06:20:14.240Z"
}