{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 137,
  "verses": [
    {
      "pk": 23137001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 1,
      "text": "By the rivers of Babylon, there we sat down and wept when we remembered Zion.",
      "links": "<a href='/AIV/25/1/7'>Lam. 1:7</a>; <a href='/AIV/19/42/4'>Ps. 42:4</a>",
      "comment": "Israel's exile in Babylon evoked deep sorrow, recalling their lost homeland, Zion—often a symbol of God's dwelling and promise. The literal meaning highlights historical lament; spiritual interpretation sees longing for God's presence and restoration. The communal weeping suggests the importance of unity, worship, and remembrance within the covenant people."
    },
    {
      "pk": 23137002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 2,
      "text": "On the willows there we hung up our harps.",
      "links": "<a href='/AIV/19/33/2'>Ps. 33:2</a>; <a href='/AIV/19/81/2'>Ps. 81:2</a>",
      "comment": "Setting aside their musical instruments displays the depth of their mourning and inability to worship joyfully. Spiritually, this reflects seasons when praise is difficult, yet the memory of worship endures. Hanging the harps hints at hope of future restoration of worship, emphasizing its centrality in the life of God's people."
    },
    {
      "pk": 23137003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 3,
      "text": "For there our captors demanded songs of us, and our tormentors demanded joy, saying, 'Sing to us one of the songs of Zion!'",
      "links": "<a href='/AIV/19/126/1'>Ps. 126:1</a>; <a href='/AIV/25/5/12'>Lam. 5:12</a>",
      "comment": "The oppressors' demand mocks Israel's faith and worship. Their call for 'songs of Zion' underscores the distinctiveness of praise rooted in God's covenant. The experience anticipates suffering under persecution, but also the witness of faith maintained under trial, paralleling Christ's endurance (<a href='/AIV/40/27/29'>Matt. 27:29</a>)."
    },
    {
      "pk": 23137004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 4,
      "text": "How shall we sing the Lord's song in a foreign land?",
      "links": "<a href='/AIV/19/69/12'>Ps. 69:12</a>; <a href='/AIV/19/119/54'>Ps. 119:54</a>",
      "comment": "The question highlights the challenge of true worship outside the holy place, expressing the deep connection between God's presence and liturgical life. This verse invites reflection on the resilience of faith in exile and foreshadows Jesus sanctifying all places through His coming, enabling worship 'in spirit and in truth' (<a href='/AIV/43/4/21-24'>John 4:21-24</a>)."
    },
    {
      "pk": 23137005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 5,
      "text": "If I forget you, Jerusalem, let my right hand forget its skill.",
      "links": "<a href='/AIV/19/137/6'>Ps. 137:6</a>; <a href='/AIV/19/84/1'>Ps. 84:1</a>",
      "comment": "A vow links fidelity to Jerusalem with personal ability, signifying how identity and worship are tied to the holy city. Spiritually, Jerusalem prefigures the Church as both the present and future dwelling of God’s people (<a href='/AIV/66/21/2'>Rev. 21:2</a>). The pledge shows the importance of ordered worship and corporate memory."
    },
    {
      "pk": 23137006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 6,
      "text": "Let my tongue stick to the roof of my mouth if I do not remember you, if I do not set Jerusalem above my greatest joy.",
      "links": "<a href='/AIV/19/51/14'>Ps. 51:14</a>; <a href='/AIV/19/122/6'>Ps. 122:6</a>",
      "comment": "The psalmist desires lasting devotion to Jerusalem, elevating it above personal pleasures. On a spiritual level, prioritizing the gathered people of God and worship signals the order of Christian life. The connection echoes Christ’s love for His people and the call to set holy things first in one’s heart (<a href='/AIV/40/6/33'>Matt. 6:33</a>)."
    },
    {
      "pk": 23137007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 7,
      "text": "Remember, Lord, against the sons of Edom the day of Jerusalem, those who said, 'Tear it down, tear it down, down to its foundations!'",
      "links": "<a href='/AIV/25/4/21'>Lam. 4:21</a>; <a href='/AIV/31/1/10-14'>Obad. 1:10-14</a>",
      "comment": "The prayer appeals to God’s justice against Edom for their betrayal during Jerusalem’s destruction. This intercession highlights the longing for divine vindication and protection of God’s dwelling. Such pleas anticipate deliverance and restoration, ultimately fulfilled in Christ’s victory over His enemies (<a href='/AIV/66/19/15'>Rev. 19:15</a>)."
    },
    {
      "pk": 23137008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 8,
      "text": "O daughter of Babylon, doomed to destruction, blessed is the one who repays you as you have done to us.",
      "links": "<a href='/AIV/23/13/1'>Isa. 13:1</a>; <a href='/AIV/66/18/2'>Rev. 18:2</a>",
      "comment": "The cry for justice against Babylon reflects retributive righteousness, yet in light of the New Testament, Christ calls for mercy and forgiveness even for enemies (<a href='/AIV/40/5/44'>Matt. 5:44</a>). Babylon here represents the enemies of God's people; ultimate justice belongs to God, pointing to eschatological judgment."
    },
    {
      "pk": 23137009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 137,
      "verse": 9,
      "text": "Blessed is the one who takes your infants and dashes them against the rock.",
      "links": "<a href='/AIV/19/109/14'>Ps. 109:14</a>; <a href='/AIV/23/13/16'>Isa. 13:16</a>",
      "comment": "This difficult verse expresses the depth of pain and desire for justice after Babylon’s cruelty. While literal, the spiritual implication shifts in Christian interpretation: Christ transforms such cries for vengeance into calls for forgiveness and spiritual battle against evil (see <a href='/AIV/40/26/52'>Matt. 26:52</a>). The verse invites prayer for purification and an ultimate trust in God’s righteous judgment."
    }
  ],
  "translatedAt": "2025-12-24T06:46:13.564Z"
}