{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 36,
  "verses": [
    {
      "pk": 23036001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 1,
      "text": "Transgression speaks to the wicked deep in his heart; there is no fear of God before his eyes.",
      "links": "<a href='/AIV/45/3/18'>Rom. 3:18</a>; <a href='/AIV/20/8/13'>Prov. 8:13</a>",
      "comment": "The psalm begins with a profound insight into the nature of sin—a lack of reverence for God in the depths of the human heart. Paul cites this in Romans to describe the universal need for redemption. The 'fear of God' here means awe and submission, not mere dread, which is foundational for true faith and spiritual wisdom."
    },
    {
      "pk": 23036002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 2,
      "text": "For he flatters himself in his own eyes that his iniquity will not be found out and hated.",
      "links": "<a href='/AIV/20/12/15'>Prov. 12:15</a>; <a href='/AIV/19/49/18'>Ps. 49:18</a>",
      "comment": "Sin often involves self-deception—a blindness to our faults and consequences. This verse points to the inner pride that leads humanity away from God, an echo of the fall in Genesis 3."
    },
    {
      "pk": 23036003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 3,
      "text": "The words of his mouth are evil and deceitful; he has ceased to act wisely and do good.",
      "links": "<a href='/AIV/20/10/32'>Prov. 10:32</a>; <a href='/AIV/40/12/34'>Matt. 12:34</a>",
      "comment": "Speech reflects the heart. When someone forsakes wisdom and goodness, it shows in their words. Jesus teaches that what comes out of the mouth reveals the heart (Matt. 12:34). True renewal involves the healing of both heart and tongue."
    },
    {
      "pk": 23036004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 4,
      "text": "He plots wickedness on his bed; he sets himself on a path that is not good; he does not reject evil.",
      "links": "<a href='/AIV/20/4/16'>Prov. 4:16</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Sin is not just external but internal and habitual. Evil plans begin in secrecy and contemplation; without a turning away from evil, the path becomes entrenched."
    },
    {
      "pk": 23036005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 5,
      "text": "Your steadfast love, O LORD, extends to the heavens, your faithfulness reaches to the clouds.",
      "links": "<a href='/AIV/19/57/10'>Ps. 57:10</a>; <a href='/AIV/19/103/11'>Ps. 103:11</a>",
      "comment": "Here the psalm contrasts human unfaithfulness with God's infinite mercy and loyalty. The language implies a love that surpasses earthly bounds, foreshadowing the fullness of divine grace revealed in Christ and the unity of believers across the world."
    },
    {
      "pk": 23036006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 6,
      "text": "Your righteousness is like the mighty mountains; your judgments are like the great deep; LORD, you preserve man and beast.",
      "links": "<a href='/AIV/19/71/19'>Ps. 71:19</a>; <a href='/AIV/19/104/14'>Ps. 104:14</a>",
      "comment": "God’s justice and righteousness are unchanging and awe-inspiring as the mountains, deep as the oceans. His care embraces all creation—humans and animals alike—underscoring the wholeness of His providence."
    },
    {
      "pk": 23036007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 7,
      "text": "How precious is your steadfast love, O God! The children of mankind take refuge in the shadow of your wings.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "The metaphor of refuge under God’s wings is echoed by Jesus in Matthew 23:37, inviting humanity to shelter in His mercy. This illustrates both the personal and communal aspects of salvation—finding safety in God together as one people."
    },
    {
      "pk": 23036008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 8,
      "text": "They feast on the abundance of your house, and you give them drink from the river of your delights.",
      "links": "<a href='/AIV/19/65/4'>Ps. 65:4</a>; <a href='/AIV/43/7/37-39'>John 7:37-39</a>",
      "comment": "God’s 'house' points to sacred worship and communion, a spiritual feast foreshadowing the heavenly banquet and the sacramental life. The imagery of the river recalls Jesus’ promise of living water (John 7:37-39)."
    },
    {
      "pk": 23036009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 9,
      "text": "For with you is the fountain of life; in your light we see light.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "God is the source of all life and illumination, both physical and spiritual. Jesus claims to be 'the light of the world' (John 8:12), revealing the fullness of this truth and calling believers to walk in His light."
    },
    {
      "pk": 23036010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 10,
      "text": "Continue your steadfast love to those who know you, and your righteousness to the upright in heart.",
      "links": "<a href='/AIV/19/31/23'>Ps. 31:23</a>; <a href='/AIV/19/97/11'>Ps. 97:11</a>",
      "comment": "The psalmist prays for enduring grace and justice for those who truly know and love God. This relationship is marked by ongoing growth in holiness and unity."
    },
    {
      "pk": 23036011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 11,
      "text": "Let not the foot of arrogance come upon me, nor the hand of the wicked drive me away.",
      "links": "<a href='/AIV/19/119/133'>Ps. 119:133</a>; <a href='/AIV/19/18/48'>Ps. 18:48</a>",
      "comment": "The prayer for protection against pride and persecution emphasizes dependence on God’s grace and the humility required for true discipleship—qualities celebrated in the lives of the saints."
    },
    {
      "pk": 23036012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 36,
      "verse": 12,
      "text": "There the evildoers have fallen; they are thrown down and cannot rise.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/20/24/16'>Prov. 24:16</a>",
      "comment": "The destiny of those persisting in evil is ultimate defeat. The psalm finishes with a vision of final justice, which is assured for the faithful and points to the hope of resurrection and victory over sin."
    }
  ],
  "translatedAt": "2025-12-24T06:10:40.866Z"
}