{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 150,
  "verses": [
    {
      "pk": 23150001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 1,
      "text": "Praise the LORD! Praise God in his sanctuary; praise him in his mighty heavens!",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>; <a href='/AIV/19/29/9'>Ps. 29:9</a>; <a href='/AIV/19/148/1'>Ps. 148:1</a>",
      "comment": "The call to praise begins by commanding worship of the LORD (YHWH) both in the earthly sanctuary—symbolic of God's special dwelling among his people—and in the heavens, encompassing all creation. This dual location foreshadows the unity of worship both above and below, hinting at how worship on earth is mysteriously joined with the angels in heaven (cf. Hebrews 12:22-24; Revelation 5:11-14)."
    },
    {
      "pk": 23150002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 2,
      "text": "Praise him for his mighty acts; praise him according to his surpassing greatness!",
      "links": "<a href='/AIV/19/145/3'>Ps. 145:3</a>; <a href='/AIV/19/66/3'>Ps. 66:3</a>; <a href='/AIV/19/136/4'>Ps. 136:4</a>",
      "comment": "The psalmist highlights that God's actions—his mighty deeds in salvation history—and his very greatness, are the foundation of true praise. Both remember what God has done and who He is: transcendent, yet involved. The parallel recalls praise for the wonders of creation and redemption, connecting to the work of Christ as the ultimate act of God's greatness (see Ephesians 1:19-21)."
    },
    {
      "pk": 23150003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 3,
      "text": "Praise him with the sound of the trumpet; praise him with lute and harp!",
      "links": "<a href='/AIV/19/98/6'>Ps. 98:6</a>; <a href='/AIV/13/15/16'>1 Chr. 15:16</a>",
      "comment": "Different instruments are named, emphasizing the richness and variety of liturgical worship. Trumpet, lute, and harp were all used in Temple worship (see 2 Chronicles 5:12-14). Music here is not merely for performance, but a participation in the ordered worship of God, pointing to the dignity and beauty of reverent, structured praise."
    },
    {
      "pk": 23150004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 4,
      "text": "Praise him with tambourine and dance; praise him with strings and pipe!",
      "links": "<a href='/AIV/19/149/3'>Ps. 149:3</a>; <a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "Praise is not only with voice and instruments but in bodily movement—dance—as seen when Miriam led the Israelites in worship (Exodus 15:20). All of one's body and senses are invited into the act of praise. This reflects the understanding that worship is not just spiritual, but a full, embodied response, united in the assembly."
    },
    {
      "pk": 23150005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 5,
      "text": "Praise him with resounding cymbals; praise him with clashing cymbals!",
      "links": "<a href='/AIV/13/16/42'>1 Chr. 16:42</a>; <a href='/AIV/19/81/2'>Ps. 81:2</a>",
      "comment": "The mention of loud cymbals again points to communal, celebratory, and even dramatic worship. In Temple practice, these instruments marked solemn occasions, heightening the sense of awe and collective adoration. It calls worshippers to participate joyfully and with reverence in the liturgy."
    },
    {
      "pk": 23150006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 150,
      "verse": 6,
      "text": "Let everything that has breath praise the LORD! Praise the LORD!",
      "links": "<a href='/AIV/19/103/22'>Ps. 103:22</a>; <a href='/AIV/19/148/7-13'>Ps. 148:7-13</a>; <a href='/AIV/35/2/20'>Hab. 2:20</a>",
      "comment": "The closing command universalizes worship: every living creature is to praise God. This anticipates New Testament themes where all creation unites in glorifying God (see Romans 8:19-22; Revelation 5:13). The centrality of praise as an ongoing offering foreshadows liturgical practices where God's people join both heaven and earth in continuous worship centered on the presence of the Lord."
    }
  ],
  "translatedAt": "2025-12-24T06:50:07.553Z"
}