{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 130,
  "verses": [
    {
      "pk": 23130001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 1,
      "text": "Out of the depths I cry to you, O LORD.",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>; <a href='/AIV/25/3/55'>Lam. 3:55</a>",
      "comment": "This verse opens with a groaning from deep distress—a common theme in the Psalms. The soul’s cry from the 'depths' conveys not merely emotional anguish, but also a sense of alienation from God. Spiritual tradition sees this as the soul recognizing its need for divine mercy. Compare to Jonah’s cry from the depths (Jon. 2:2) and Christ's agony in Gethsemane (<a href='/AIV/40/26/39'>Matt. 26:39</a>), both pointing toward trust in God’s deliverance."
    },
    {
      "pk": 23130002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 2,
      "text": "Lord, hear my voice! Let your ears be attentive to the voice of my supplications.",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/19/86/6'>Ps. 86:6</a>",
      "comment": "The psalmist pleads for God’s attentive response. The structure reflects prayer as dialog and dependence, echoing God’s receptiveness to the humble. The phrase 'supplications' deepens the tone, suggesting intercessory prayer. This foreshadows later Christian practice of persistent prayer (<a href='/AIV/42/11/9-13'>Luke 11:9-13</a>)."
    },
    {
      "pk": 23130003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 3,
      "text": "If you, O LORD, should mark iniquities, Lord, who could stand?",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "A recognition of universal sinfulness and the impossibility of standing before God by one’s own merits. It manifests the conviction that all require mercy for salvation. This aligns with the doctrine that grace precedes any claim to righteousness (<a href='/AIV/49/2/8-9'>Eph. 2:8-9</a>), and evokes the need for confession and absolution, suggesting a pathway for reconciliation."
    },
    {
      "pk": 23130004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 4,
      "text": "But with you there is forgiveness, that you may be revered.",
      "links": "<a href='/AIV/19/86/5'>Ps. 86:5</a>; <a href='/AIV/41/2/5-7'>Mark 2:5-7</a>",
      "comment": "Divine forgiveness is presented as a reason for awe and reverence rather than presumption. This points forward to Christ’s authority to forgive sins (<a href='/AIV/40/9/2-6'>Matt. 9:2-6</a>) and implies God's mercy is mediated through faith, repentance, and participation in the life of grace. This verse is a cornerstone for doctrinal reflection on sacramental reconciliation, inviting a deeper experience of God's mercy."
    },
    {
      "pk": 23130005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 5,
      "text": "I wait for the LORD, my soul waits, and in his word I hope.",
      "links": "<a href='/AIV/19/62/1'>Ps. 62:1</a>; <a href='/AIV/19/119/81'>Ps. 119:81</a>",
      "comment": "Hope is centered in God’s faithfulness to His promises. The act of waiting is itself a spiritual discipline, mirroring the virtues of patience and trust. The idea of 'word' refers both to divine promise and, in Christian interpretation, to the Word made flesh (<a href='/AIV/43/1/14'>John 1:14</a>), suggesting both expectation and the means through which grace is received."
    },
    {
      "pk": 23130006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 6,
      "text": "My soul waits for the Lord more than watchmen for the morning, more than watchmen for the morning.",
      "links": "<a href='/AIV/19/5/3'>Ps. 5:3</a>; <a href='/AIV/19/63/6'>Ps. 63:6</a>",
      "comment": "The repetition indicates intense longing and urgency. The image of watchmen conveys vigilance, readiness, and anticipation for the coming light—a messianic motif fulfilled in Christ, the dawn from on high (<a href='/AIV/42/1/78-79'>Luke 1:78-79</a>). The psalmist models persevering faith, trusting in the Lord’s coming deliverance."
    },
    {
      "pk": 23130007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 7,
      "text": "O Israel, hope in the LORD! For with the LORD there is steadfast love, and with him is abundant redemption.",
      "links": "<a href='/AIV/19/131/3'>Ps. 131:3</a>; <a href='/AIV/23/44/22'>Isa. 44:22</a>",
      "comment": "Redemption here is both national and personal. The language anticipates the fullness of redemption accomplished in Christ (<a href='/AIV/45/3/24'>Rom. 3:24</a>). 'Steadfast love' (Hebrew: 'hesed') points to God’s covenantal faithfulness, which is made effective and manifest through the mediation of grace, a theme later crucial to understanding the unity and sanctity of the Church."
    },
    {
      "pk": 23130008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 130,
      "verse": 8,
      "text": "And he will redeem Israel from all his iniquities.",
      "links": "<a href='/AIV/19/25/22'>Ps. 25:22</a>; <a href='/AIV/42/1/77'>Luke 1:77</a>",
      "comment": "The promise of comprehensive redemption from sin foreshadows the complete salvation offered through Christ. In Christian reflection, this is realized through both personal and communal restoration—pointing to the final deliverance and purification of God’s people. The hope of being freed from all iniquities rests not on individual effort but on divine initiative and participation in the means of grace."
    }
  ],
  "translatedAt": "2025-12-24T06:44:11.419Z"
}