{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 19,
  "verses": [
    {
      "pk": 23019001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 1,
      "text": "The heavens declare the glory of God, and the sky proclaims the work of his hands.",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/18/36/24-26'>Job 36:24–26</a>; <a href='/AIV/19/8/3'>Ps. 8:3</a>; <a href='/AIV/45/1/20'>Rom. 1:20</a>",
      "comment": "The verse emphasizes that creation itself reveals the greatness of God, echoing Paul's teaching in Romans 1:20 that God's invisible qualities are clearly seen in what He has made. Here, creation points towards the existence and action of the one true God, a foundation for natural revelation."
    },
    {
      "pk": 23019002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 2,
      "text": "Day after day pours out speech, and night after night reveals knowledge.",
      "links": "<a href='/AIV/18/12/7-9'>Job 12:7–9</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "The constancy of creation’s testimony—every single day and night—shows that God is always revealing himself to humanity, suggesting a continual call to recognize and respond to His truth."
    },
    {
      "pk": 23019003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 3,
      "text": "There is no speech and there are no words; their voice is not heard.",
      "links": "<a href='/AIV/45/10/18'>Rom. 10:18</a>",
      "comment": "Though the heavens do not speak with human words, their message goes out universally. Paul later references this verse to affirm the proclamation of the gospel reaching all nations (Rom. 10:18), signifying the global call of God."
    },
    {
      "pk": 23019004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 4,
      "text": "Their measuring line has gone out through all the earth, and their words to the ends of the world. In them he has set a tent for the sun,",
      "links": "<a href='/AIV/19/104/2'>Ps. 104:2</a>; <a href='/AIV/45/10/18'>Rom. 10:18</a>",
      "comment": "The expression 'measuring line' can be rendered as 'voice' or 'sound,' meaning the message of creation reaches everyone. The universality of this proclamation can also allude to how the truth of God is handed down through the ages and among all peoples."
    },
    {
      "pk": 23019005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 5,
      "text": "which comes out like a bridegroom leaving his chamber, rejoicing like a strong man to run its course.",
      "links": "<a href='/AIV/19/45/1'>Ps. 45:1</a>; <a href='/AIV/19/104/19'>Ps. 104:19</a>",
      "comment": "The sun is compared to a bridegroom and an athlete, both images of vigor, joy, and splendor. The imagery often carries a messianic undertone, as the bridegroom in scripture can symbolize God’s unique relationship with His people (see Isa. 62:5, John 3:29)."
    },
    {
      "pk": 23019006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 6,
      "text": "Its rising is from one end of the heavens, and its circuit to the other end; nothing is hidden from its heat.",
      "links": "<a href='/AIV/19/104/19-23'>Ps. 104:19-23</a>; <a href='/AIV/39/4/2'>Mal. 4:2</a>",
      "comment": "The universality of the sun’s journey symbolizes God’s all-encompassing presence and knowledge. Malachi 4:2 uses the sun as an image for the coming Savior, linking natural revelation with the promise of the Messiah."
    },
    {
      "pk": 23019007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 7,
      "text": "The law of the LORD is perfect, restoring the soul; the testimony of the LORD is trustworthy, making wise the simple.",
      "links": "<a href='/AIV/19/119/1'>Ps. 119:1</a>; <a href='/AIV/2/20/1-17'>Ex. 20:1-17</a>; <a href='/AIV/19/119/130'>Ps. 119:130</a>",
      "comment": "Here, ‘law’ (torah) refers to all of God’s instruction. God’s revealed word completes and heals the soul—an effect seen in both reading Scripture and in faithfully participating in the fullness of God's instruction."
    },
    {
      "pk": 23019008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 8,
      "text": "The precepts of the LORD are right, rejoicing the heart; the commandment of the LORD is pure, enlightening the eyes.",
      "links": "<a href='/AIV/19/119/14'>Ps. 119:14</a>; <a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "God’s commandments are a source of true joy, clarity, and wisdom—a recurring theme in Psalm 119. Spiritual enlightenment and inner happiness come from aligning one’s life with God’s revealed will."
    },
    {
      "pk": 23019009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 9,
      "text": "The fear of the LORD is clean, enduring forever; the judgments of the LORD are true; they are righteous altogether.",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>; <a href='/AIV/19/119/160'>Ps. 119:160</a>",
      "comment": "‘Fear’ here is reverent awe, leading to a pure life; God’s commandments are eternally relevant. Notice the link between true worship, moral living, and right understanding of God’s enduring truth."
    },
    {
      "pk": 23019010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 10,
      "text": "More to be desired are they than gold, even much pure gold; sweeter also than honey and drippings from the honeycomb.",
      "links": "<a href='/AIV/19/119/72'>Ps. 119:72</a>; <a href='/AIV/19/119/103'>Ps. 119:103</a>",
      "comment": "God’s words surpass even the greatest treasures. Deep longing for God’s instruction is a central theme found throughout both Old and New Testaments."
    },
    {
      "pk": 23019011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 11,
      "text": "By them your servant is warned; in keeping them there is great reward.",
      "links": "<a href='/AIV/19/119/11'>Ps. 119:11</a>; <a href='/AIV/19/119/47'>Ps. 119:47</a>",
      "comment": "Obedience brings blessing. God’s commandments both protect from harm and lead to true reward, echoing the call to perseverance in doing good (see James 1:25)."
    },
    {
      "pk": 23019012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 12,
      "text": "Who can discern his own errors? Cleanse me from hidden faults.",
      "links": "<a href='/AIV/19/139/23-24'>Ps. 139:23-24</a>; <a href='/AIV/1/6/5'>Gen. 6:5</a>",
      "comment": "David acknowledges human inability to see all one’s sins. The desire for God’s cleansing points towards the need for both personal confession and God-ordained means of forgiveness."
    },
    {
      "pk": 23019013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 13,
      "text": "Keep your servant also from presumptuous sins; let them not have dominion over me. Then I shall be blameless, and innocent of great transgression.",
      "links": "<a href='/AIV/19/119/133'>Ps. 119:133</a>; <a href='/AIV/19/18/23'>Ps. 18:23</a>",
      "comment": "There’s recognition of the difference between deliberate (presumptuous) sin and hidden faults. To remain blameless, help from God and a humble, ongoing practice of seeking forgiveness are both needed, reflecting the pattern of confession and the spiritual discipline of regular self-examination."
    },
    {
      "pk": 23019014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 19,
      "verse": 14,
      "text": "Let the words of my mouth and the meditation of my heart be acceptable in your sight, O LORD, my rock and my redeemer.",
      "links": "<a href='/AIV/19/104/34'>Ps. 104:34</a>; <a href='/AIV/55/2/19'>2 Tim. 2:19</a>",
      "comment": "David desires both external actions and inner thoughts to be pleasing before God. The closing address points to God as both the unchanging foundation and the one who saves—not only in a physical, but ultimately in a spiritual sense—a title fulfilled perfectly in Christ, the Redeemer (see Eph. 1:7)."
    }
  ],
  "translatedAt": "2025-12-24T06:04:52.633Z"
}