{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 4,
  "verses": [
    {
      "pk": 23004001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 1,
      "text": "Answer me when I call, O God of my righteousness! You have relieved me in my distress; have mercy on me and hear my prayer.",
      "links": "<a href='/AIV/19/3/4'>Ps. 3:4</a>; <a href='/AIV/19/6/9'>Ps. 6:9</a>; <a href='/AIV/19/17/6'>Ps. 17:6</a>",
      "comment": "David calls upon God as the source of righteousness, asking for mercy and deliverance—a foreshadowing of the believer’s trust in God’s saving work. The prayer for mercy carries undertones pointing forward to the New Covenant, where God's mercy is fully revealed through Christ (see Romans 3:22-26). The concept of 'relieving distress' links to God's continual help and forgiveness, hinting at the ongoing grace available through prayer and sacramental life."
    },
    {
      "pk": 23004002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 2,
      "text": "O people, how long will my glory be turned into shame? How long will you love emptiness and seek after lies?",
      "links": "<a href='/AIV/19/3/2'>Ps. 3:2</a>; <a href='/AIV/19/62/10'>Ps. 62:10</a>",
      "comment": "David laments the people chasing vanity and falsehood, confronting their misplaced pursuits. This echoes warnings in the prophets against idolatry and worldliness (see Jeremiah 2:11-13), and the call for conversion from empty pursuits to true worship—something realized in the transformation of the heart promised in the New Testament (see Eph. 4:22-24)."
    },
    {
      "pk": 23004003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 3,
      "text": "But know that the LORD has set apart the faithful one for Himself; the LORD hears when I call to Him.",
      "links": "<a href='/AIV/19/17/6'>Ps. 17:6</a>; <a href='/AIV/19/135/4'>Ps. 135:4</a>",
      "comment": "The separation of the 'faithful one' signals God's election and special care for those who sincerely follow Him. This verse can be read messianically; the 'faithful one' hints at Christ (see Isaiah 42:1), and also at the call for believers to enter deeper relationship with God through prayer, obedience, and the grace that sets them apart (see 1 Peter 2:9)."
    },
    {
      "pk": 23004004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 4,
      "text": "Tremble, and do not sin; meditate in your heart upon your bed, and be silent.",
      "links": "<a href='/AIV/19/77/6'>Ps. 77:6</a>; <a href='/AIV/19/63/6'>Ps. 63:6</a>; <a href='/AIV/49/4/26'>Eph. 4:26</a>",
      "comment": "The call to 'tremble' urges reverence before God, paired with an exhortation to reflect quietly and not sin. Early Christians saw this as a call to examine conscience—a spiritual discipline likely practiced in prayer and reflection. The tradition of nighttime prayer and examination also foreshadows practices of ongoing repentance and seeking forgiveness, key for a mature spiritual life (cf. Eph. 4:26)."
    },
    {
      "pk": 23004005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 5,
      "text": "Offer right sacrifices, and trust in the LORD.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>",
      "comment": "Here David emphasizes both external action (sacrifice) and interior disposition (trust), echoing prophetic teaching that God desires 'right sacrifices'—purity of heart and true worship (see Hosea 6:6; Psalm 51:17). In the New Testament, spiritual worship and offering oneself (Romans 12:1) deepen this theme, subtly pointing toward the ongoing sacrificial offering of praise and self in worship."
    },
    {
      "pk": 23004006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 6,
      "text": "Many say, 'Who will show us any good?' Lift up the light of Your face upon us, O LORD!",
      "links": "<a href='/AIV/04/6/24-26'>Num. 6:24-26</a>; <a href='/AIV/19/80/7'>Ps. 80:7</a>",
      "comment": "Echoing the priestly blessing (Num. 6:24-26), this verse seeks God’s favor and presence as the highest good. The 'light of Your face' is a metaphor for divine grace and blessing, fulfilled ultimately in Christ, the true light (John 1:9; John 8:12). This longing parallels the believer’s yearning for communion with God and the transformative vision of His glory."
    },
    {
      "pk": 23004007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 7,
      "text": "You have put more joy in my heart than when their grain and new wine abound.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/19/17/15'>Ps. 17:15</a>",
      "comment": "The joy from God surpasses all earthly prosperity. This connects directly to New Testament themes of interior joy given by the Spirit (Gal 5:22), and the fulfillment found in communion with God rather than external blessings. Ancient commentators viewed this as the happiness found uniquely in union with God, prefiguring the fullness of joy promised by Christ (see John 15:11)."
    },
    {
      "pk": 23004008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 4,
      "verse": 8,
      "text": "In peace I will both lie down and sleep; for You alone, O LORD, make me dwell in safety.",
      "links": "<a href='/AIV/19/3/5'>Ps. 3:5</a>; <a href='/AIV/19/29/11'>Ps. 29:11</a>",
      "comment": "This closing verse expresses total trust and security in God, reminiscent of the peace Christ offers to his followers (John 14:27). The ability to rest in safety signifies deep faith and reliance on God’s providence—a peace that transcends circumstances, inviting deeper surrender and trust in God’s ongoing protection."
    }
  ],
  "translatedAt": "2025-12-24T06:00:01.027Z"
}