{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 67,
  "verses": [
    {
      "pk": 23067001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 1,
      "text": "May God be gracious to us and bless us; may he make his face shine upon us. Selah",
      "links": "<a href='/AIV/04/6/24-26'>Num. 6:24-26</a>; <a href='/AIV/80/1/2'>Jas. 1:17</a>",
      "comment": "This verse echoes the priestly blessing from Numbers 6, highlighting the mediating role of blessing from God through his appointed servants. The phrase 'make his face shine upon us' implies God's favor and presence, recalling the spiritual reality of God's presence among his people and looking forward to the fullness of blessing in Christ (cf. Jas. 1:17)."
    },
    {
      "pk": 23067002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 2,
      "text": "That your way may be known on earth, your salvation among all nations.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "The psalmist prays for God's blessing so that all nations may come to know his way and salvation. This Psalm looks toward the universal mission of God's people, later fulfilled in the commissioning of the Apostles (Matt. 28:19). The idea of salvation for all nations anticipates the worldwide unity of believers in Christ."
    },
    {
      "pk": 23067003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 3,
      "text": "Let the peoples praise you, O God; let all the peoples praise you.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/19/117/1'>Ps. 117:1</a>; <a href='/AIV/66/7/9-10'>Rev. 7:9-10</a>",
      "comment": "A repeated refrain, urging all nations to praise God. This expresses a hope for the inclusion of the Gentiles into the worship of the one true God, fulfilled in the church as described in Revelation 7:9-10, where people from every nation worship before God's throne."
    },
    {
      "pk": 23067004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 4,
      "text": "Let the nations be glad and sing for joy, for you judge the peoples with fairness and guide the nations on earth. Selah",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/45/2/11'>Rom. 2:11</a>",
      "comment": "God’s just rule and guidance of all nations brings joy and gladness. His impartial judgment is foundational for true unity. The mention of God guiding nations can be also seen spiritually as God shepherding all peoples through his leadership, later reflected in Christ as the universal ruler and shepherd."
    },
    {
      "pk": 23067005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 5,
      "text": "Let the peoples praise you, O God; let all the peoples praise you.",
      "links": "<a href='/AIV/19/67/3'>Ps. 67:3</a>; <a href='/AIV/19/117/1'>Ps. 117:1</a>",
      "comment": "Repeating verse 3 for emphasis, reinforcing the universal call for worship, which is seen fulfilled when Christ’s church spreads worldwide engaging all nations in one combined worship of the one God."
    },
    {
      "pk": 23067006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 6,
      "text": "The earth has yielded its increase; God, our God, blesses us.",
      "links": "<a href='/AIV/03/26/4'>Lev. 26:4</a>; <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "The fruitfulness of the earth is seen as a sign of God’s blessing upon his people. This earthly blessing can be understood as both physical abundance granted through God's providence and a sign of further spiritual blessings received through being united with God's people."
    },
    {
      "pk": 23067007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 67,
      "verse": 7,
      "text": "God blesses us, so that all the ends of the earth may fear him.",
      "links": "<a href='/AIV/01/18/18'>Gen. 18:18</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "God’s blessings are not for one nation alone but intended as a witness to all peoples, drawing them into awe and reverence before God. The psalm ends with a vision of a worldwide family united in the worship and fear of God—a theme fully realized in the one, visible, apostolic church established by Christ for all nations."
    }
  ],
  "translatedAt": "2025-12-24T06:21:23.448Z"
}