{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 58,
  "verses": [
    {
      "pk": 23058001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 1,
      "text": "Do you truly speak what is just, O rulers? Do you judge with uprightness, O sons of man?",
      "links": "<a href='/AIV/19/82/2'>Ps. 82:2</a>; <a href='/AIV/20/16/2'>Prov. 16:2</a>",
      "comment": "The Psalm opens addressing human leaders, questioning whether they render true judgment. This verse underscores the expectation of human authority reflecting God's justice. In the larger biblical narrative, just rulers are a sign of God's order (see Ps. 82:2), and their failure points to the need for a divinely guided authority."
    },
    {
      "pk": 23058002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 2,
      "text": "No, in your hearts you work unrighteousness; you weigh out the violence of your hands on the earth.",
      "links": "<a href='/AIV/19/94/20'>Ps. 94:20</a>; <a href='/AIV/23/59/4'>Isa. 59:4</a>",
      "comment": "The psalmist accuses the leaders of embracing injustice internally and acting it out in the world. The image of 'weighing out' violence suggests deliberation and responsibility for evil. This connects with the biblical theme of the heart as the center of moral action (cf. Jer. 17:9)."
    },
    {
      "pk": 23058003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 3,
      "text": "The wicked go astray from the womb; from birth, they speak lies.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>; <a href='/AIV/19/14/3'>Ps. 14:3</a>",
      "comment": "This verse highlights the deep-rootedness of sin, echoing original sin (Ps. 51:5) and humanity’s fallen nature. The early tendency to evil points to the need for grace and transformation, as taught in the broader Christian tradition."
    },
    {
      "pk": 23058004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 4,
      "text": "They have venom like the venom of a serpent, like a deaf viper that stops its ear,",
      "links": "<a href='/AIV/23/59/5'>Isa. 59:5</a>; <a href='/AIV/19/140/3'>Ps. 140:3</a>",
      "comment": "Sinful people are depicted with serpent imagery, linking to the enemy in Genesis 3. Their refusal to hear truth is likened to a viper's insensitivity—spiritually closed off and dangerous."
    },
    {
      "pk": 23058005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 5,
      "text": "that will not listen to the voice of charmers, no matter how skillful they are with their spells.",
      "links": "<a href='/AIV/21/10/11'>Eccl. 10:11</a>; <a href='/AIV/24/8/17'>Jer. 8:17</a>",
      "comment": "The hard-heartedness is so acute that not even skilled persuaders can turn them. This deep obstinacy indicates an opposition to God's word and grace, a recurring theme in the prophets."
    },
    {
      "pk": 23058006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 6,
      "text": "O God, break the teeth in their mouths; tear out the fangs of these young lions, O LORD.",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/19/10/15'>Ps. 10:15</a>",
      "comment": "This prayer for judgment uses graphic metaphor: disarming the wicked is asking God to render evil powerless. The 'fangs' refer to their power to harm—echoes of both divine justice and the need for God’s intervention to establish righteousness."
    },
    {
      "pk": 23058007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 7,
      "text": "Let them vanish like water that runs away; when he aims his arrows, let them be like blunted shafts.",
      "links": "<a href='/AIV/19/64/3-7'>Ps. 64:3-7</a>; <a href='/AIV/10/14/14'>2 Sam. 14:14</a>",
      "comment": "The psalmist longs for the wicked to become harmless—ineffective as blunted arrows and fleeting as spilled water. There is an implicit trust that God's just action will ultimately prevail."
    },
    {
      "pk": 23058008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 8,
      "text": "Let them be like a snail that dissolves as it moves, like a stillborn child who never sees the sun.",
      "links": "<a href='/AIV/19/73/18-20'>Ps. 73:18-20</a>; <a href='/AIV/18/3/16'>Job 3:16</a>",
      "comment": "A vivid image of the utter futility and transience of the wicked is given. These metaphors stress that evil, though seemingly strong for a time, is ultimately fleeting in the eyes of eternity."
    },
    {
      "pk": 23058009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 9,
      "text": "Before your pots can feel the heat of thorns, he will sweep them away alive, in his burning anger—whether green or dry.",
      "links": "<a href='/AIV/19/118/12'>Ps. 118:12</a>; <a href='/AIV/18/21/18'>Job 21:18</a>",
      "comment": "This proverb adds urgency: before any result or plan comes to fruition, God’s judgment intervenes. The swift action is linked to divine justice throughout Scripture."
    },
    {
      "pk": 23058010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 10,
      "text": "The righteous will rejoice when he sees vengeance; he will wash his feet in the blood of the wicked.",
      "links": "<a href='/AIV/19/68/23'>Ps. 68:23</a>; <a href='/AIV/66/19/2'>Rev. 19:2</a>",
      "comment": "This striking image describes righteous joy at the manifestation of God's justice. While vengeance is God’s alone (cf. Rom. 12:19), the faithful rejoice when wrongs are set right and evil is overcome—anticipating Christ’s ultimate victory (Rev. 19:2)."
    },
    {
      "pk": 23058011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 58,
      "verse": 11,
      "text": "Mankind will say, 'Surely there is a reward for the righteous; surely there is a God who judges on the earth.'",
      "links": "<a href='/AIV/19/7/11'>Ps. 7:11</a>; <a href='/AIV/20/24/12'>Prov. 24:12</a>",
      "comment": "This closing affirmation declares faith in divine justice and reward for those who follow God. This hope for true judgment and reward is fulfilled in the New Testament revelation, where ultimate justice is found in Christ as the true Judge (cf. Matt. 25:31-46)."
    }
  ],
  "translatedAt": "2025-12-24T06:18:54.185Z"
}