{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 112,
  "verses": [
    {
      "pk": 23112001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 1,
      "text": "Praise the LORD! Blessed is the man who fears the LORD, who greatly delights in His commandments.",
      "links": "<a href='/AIV/19/1/1-2'>Ps. 1:1-2</a>; <a href='/AIV/19/111/1'>Ps. 111:1</a>; <a href='/AIV/19/128/1'>Ps. 128:1</a>",
      "comment": "This opening declares true blessedness comes from a reverent awe of God and delighting in His commands. The commandment focus links to Jesus' teaching in John 14:15 ('If you love Me, keep My commands'). The spiritual sense here points us toward the deep love for Divine Law, a theme that unites the faithful across generations and traditions."
    },
    {
      "pk": 23112002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 2,
      "text": "His offspring will be mighty in the land; the generation of the upright will be blessed.",
      "links": "<a href='/AIV/19/25/13'>Ps. 25:13</a>; <a href='/AIV/19/102/28'>Ps. 102:28</a>; <a href='/AIV/19/37/26'>Ps. 37:26</a>",
      "comment": "Blessing flows generationally to those who are faithful, emphasizing the ancient promise of spiritual inheritance (cf. Deut. 7:9). This typologically anticipates spiritual fruitfulness promised to Christ’s followers (see John 15:5), and echoes the communal nature of holiness."
    },
    {
      "pk": 23112003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 3,
      "text": "Wealth and riches are in his house, and his righteousness endures forever.",
      "links": "<a href='/AIV/19/37/25-26'>Ps. 37:25-26</a>; <a href='/AIV/19/111/3'>Ps. 111:3</a>",
      "comment": "Material blessing is associated with spiritual fidelity, yet the enduring character is righteousness, not wealth. Compare with Christ’s teaching to seek first the kingdom and its righteousness (Matt. 6:33). The concept of righteousness enduring forever points to God’s own attributes becoming manifest in the faithful."
    },
    {
      "pk": 23112004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 4,
      "text": "Light rises in the darkness for the upright; he is gracious, compassionate, and righteous.",
      "links": "<a href='/AIV/19/97/11'>Ps. 97:11</a>; <a href='/AIV/19/36/9'>Ps. 36:9</a>; <a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "Imagery of light and darkness recalls Christ as the light of the world (John 8:12). The upright are conformed to God’s own character—gracious and merciful. Morally and spiritually, the faithful display attributes that were fully fulfilled in Christ."
    },
    {
      "pk": 23112005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 5,
      "text": "Good will come to the man who deals generously and lends; he conducts his affairs with justice.",
      "links": "<a href='/AIV/19/37/26'>Ps. 37:26</a>; <a href='/AIV/19/15/5'>Ps. 15:5</a>; <a href='/AIV/40/6/3'>Matt. 6:3</a>",
      "comment": "Generosity and justice are marks of genuine faith. Jesus teaches the importance of giving secretly and with a pure heart (see Matt. 6:3-4), underscoring the call to virtue not just in ritual but in action."
    },
    {
      "pk": 23112006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 6,
      "text": "Surely he will never be shaken; the righteous will be remembered forever.",
      "links": "<a href='/AIV/19/15/5'>Ps. 15:5</a>; <a href='/AIV/19/125/1'>Ps. 125:1</a>",
      "comment": "Unshakeable stability is promised to the faithful, echoing Jesus’ parable of building the house on the rock (Matt. 7:24-25). Remembrance foreshadows the doctrine of the communion of saints, connecting faithful memory to everlasting life."
    },
    {
      "pk": 23112007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 7,
      "text": "He is not afraid of bad news; his heart is firm, trusting in the LORD.",
      "links": "<a href='/AIV/19/56/3'>Ps. 56:3</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/19/62/2'>Ps. 62:2</a>",
      "comment": "Faith overcomes fear. Trust in God delivers interior peace, even amidst trials. See parallels to Jesus’ encouragement to not be anxious (Matt. 6:25-34) and to St. Paul’s assurance in Phil. 4:6-7."
    },
    {
      "pk": 23112008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 8,
      "text": "His heart is steady; he will not be afraid, until he looks in triumph on his adversaries.",
      "links": "<a href='/AIV/19/41/11'>Ps. 41:11</a>; <a href='/AIV/19/54/7'>Ps. 54:7</a>",
      "comment": "The righteous display steadfastness and eventual victory over adversity, foreshadowing the resurrection and final triumph of God over evil (see 1 Cor. 15:57)."
    },
    {
      "pk": 23112009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 9,
      "text": "He distributes freely; he gives to the poor; his righteousness endures forever; his horn will be exalted in honor.",
      "links": "<a href='/AIV/19/111/9'>Ps. 111:9</a>; <a href='/AIV/47/9/9'>2 Cor. 9:9</a>",
      "comment": "Free giving and enduring righteousness are marks of holiness. St. Paul cites this verse in Corinthians to show how charity and justice glorify God and raise the humble. The exalted 'horn' poetically symbolizes honor and strength, connecting with Mary's Magnificat (Luke 1:52-53) which celebrates the raising of the lowly."
    },
    {
      "pk": 23112010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 112,
      "verse": 10,
      "text": "The wicked man sees it and is angry; he gnashes his teeth and melts away; the desire of the wicked will perish.",
      "links": "<a href='/AIV/19/35/16'>Ps. 35:16</a>; <a href='/AIV/19/37/12'>Ps. 37:12</a>; <a href='/AIV/40/8/12'>Matt. 8:12</a>",
      "comment": "A stark contrast: the eventual defeat of wickedness and the vindication of the righteous. The imagery of gnashing teeth echoes Jesus’ warnings in Matthew about the final judgment upon evil (Matt. 8:12), reminding us of the urgency of conversion and faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T06:39:42.346Z"
}