{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 60,
  "verses": [
    {
      "pk": 23060001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 1,
      "text": "O God, you have rejected us, you have broken us; you have been angry—restore us again.",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/19/85/4'>Ps. 85:4</a>",
      "comment": "David opens with a cry for restoration, acknowledging both God's righteous anger and the hope for renewal. This teaches reliance on God's mercy, anticipating the restoration brought by Christ and the role of intercessory prayer in communal repentance."
    },
    {
      "pk": 23060002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 2,
      "text": "You have shaken the land and split it open; heal its fractures, for it trembles.",
      "links": "<a href='/AIV/19/46/2-3'>Ps. 46:2-3</a>; <a href='/AIV/23/24/19'>Isa. 24:19</a>",
      "comment": "David appeals for healing after judgment, recognizing God's authority over creation. The image of a fractured earth is symbolic of spiritual brokenness, foreshadowing ultimate healing that comes through Christ and the unity found in the one Church."
    },
    {
      "pk": 23060003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 3,
      "text": "You have made your people suffer hardship; you have given us wine that makes us stagger.",
      "links": "<a href='/AIV/19/71/20'>Ps. 71:20</a>; <a href='/AIV/23/51/17'>Isa. 51:17</a>",
      "comment": "Hardship and the cup of trembling are motifs found elsewhere in Scripture. It's a reminder of God's permissive will in suffering, which prepares His people for deeper faith and can refer spiritually to sharing in Christ's own sufferings before the promise of victory."
    },
    {
      "pk": 23060004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 4,
      "text": "You have given those who fear you a banner to be raised high because of the truth. Selah.",
      "links": "<a href='/AIV/19/20/5'>Ps. 20:5</a>; <a href='/AIV/23/11/10-12'>Isa. 11:10-12</a>",
      "comment": "The banner represents God's faithfulness, a sign of His victory and truth among His people. Spiritually, this prefigures Christ as the standard raised for all nations (cf. John 12:32). The idea of being gathered under one banner speaks to unity in authentic worship."
    },
    {
      "pk": 23060005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 5,
      "text": "Save us with your right hand and answer us, so those you love may be delivered.",
      "links": "<a href='/AIV/19/17/7'>Ps. 17:7</a>; <a href='/AIV/19/108/6'>Ps. 108:6</a>",
      "comment": "God's 'right hand' is a biblical image for might and salvation (cf. Ex. 15:6). This anticipates Christ as the one who sits at God's right hand and mediates for us. Intercessory prayer, represented here, is a crucial part of biblical tradition and practice."
    },
    {
      "pk": 23060006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 6,
      "text": "God has spoken in his holiness: 'I will exult, I will divide up Shechem and measure out the Valley of Succoth.'",
      "links": "<a href='/AIV/19/108/7'>Ps. 108:7</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "God's sovereignty and holiness are emphasized in His promise to distribute the land. This verse recalls God's covenantal fidelity and the idea of inheritance, which becomes spiritual inheritance in Christ (cf. Gal. 3:29)."
    },
    {
      "pk": 23060007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 7,
      "text": "Gilead is mine, and Manasseh is mine; Ephraim is the helmet for my head, Judah is my scepter.",
      "links": "<a href='/AIV/1/49/10'>Gen. 49:10</a>; <a href='/AIV/19/80/2'>Ps. 80:2</a>",
      "comment": "Judah as the scepter points to the messianic lineage (cf. Gen. 49:10). The division of the tribes here has deeper spiritual meaning: God gathers all, but assigns unique roles in His plan, culminating in the one kingdom established through the Messiah."
    },
    {
      "pk": 23060008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 8,
      "text": "Moab is my washbasin; upon Edom I cast my sandal; over Philistia I shout in triumph.",
      "links": "<a href='/AIV/19/108/9'>Ps. 108:9</a>; <a href='/AIV/19/83/6'>Ps. 83:6</a>",
      "comment": "Here God declares dominion over enemies. The imagery of the washbasin and sandal hints at ritual purity and authority, concepts developed in later worship traditions. Triumph over foes is prophetic of Christ's victory over death and sin."
    },
    {
      "pk": 23060009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 9,
      "text": "Who will bring me to the fortified city? Who will lead me to Edom?",
      "links": "<a href='/AIV/19/108/10'>Ps. 108:10</a>; <a href='/AIV/4/20/17'>Num. 20:17'>",
      "comment": "The question expresses dependence on God's guidance. Edom, often a symbol of enmity, also reflects obstacles only overcome through grace and divinely appointed leaders—a model reflected in spiritual authority and the guidance of the Church."
    },
    {
      "pk": 23060010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 10,
      "text": "Is it not you, O God, who have rejected us, and do not go out with our armies?",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "David recognizes God's withdrawal—as seen in times of discipline or testing. Yet, the plea redirects the people to seek God's presence in humble contrition, a pattern foundational for authentic worship and spiritual renewal."
    },
    {
      "pk": 23060011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 11,
      "text": "Give us help against the enemy, for human help is worthless.",
      "links": "<a href='/AIV/19/118/8'>Ps. 118:8</a>; <a href='/AIV/19/108/12'>Ps. 108:12</a>",
      "comment": "Dependence on God rather than human strength is a recurring biblical theme. This verse encourages a deep trust in divine providence, which finds its summit in the Church's teaching about God's sustaining grace."
    },
    {
      "pk": 23060012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 60,
      "verse": 12,
      "text": "With God we will gain victory, and he will trample down our enemies.",
      "links": "<a href='/AIV/19/44/5'>Ps. 44:5</a>; <a href='/AIV/19/108/13'>Ps. 108:13</a>; <a href='/AIV/45/16/20'>Rom. 16:20</a>",
      "comment": "Victory is assured only in partnership with God, foreshadowing Christ's triumph over sin and Satan (cf. Rom. 16:20). The psalm closes with confident hope rooted in faithfulness—a confidence lived out in worship, unity, and sacramental grace."
    }
  ],
  "translatedAt": "2025-12-24T06:19:33.494Z"
}