{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 27,
  "verses": [
    {
      "pk": 23027001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 1,
      "text": "The LORD is my light and my salvation—whom shall I fear? The LORD is the fortress of my life—of whom shall I be afraid?",
      "links": "<a href='/AIV/19/18/28'>Ps. 18:28</a>; <a href='/AIV/23/60/19'>Isa. 60:19</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "David acknowledges God as his light and deliverer, removing all fear. The image of 'light' is later fulfilled in Christ (John 8:12), connecting this Psalm to messianic prophecy and to the assurance believers have in the Lord's protection. The fortress image resonates with the security found in the people of God, anchored in His presence."
    },
    {
      "pk": 23027002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 2,
      "text": "When evil men rise up against me to devour my flesh—my adversaries and enemies—they will stumble and fall.",
      "links": "<a href='/AIV/19/3/6'>Ps. 3:6</a>; <a href='/AIV/19/118/12-13'>Ps. 118:12-13</a>",
      "comment": "The language is vivid—'devour my flesh'—implying intense opposition. Yet there's confidence that God will defeat such enemies. The image can be seen both historically (David's own life) and spiritually—as believers face spiritual battles, evil is ultimately conquered by God’s power."
    },
    {
      "pk": 23027003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 3,
      "text": "Though an army encamps against me, my heart will not fear; though war arises against me, even then I will remain confident.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "This verse amplifies the previous theme: unwavering trust, even in the face of overwhelming odds. The confidence here foreshadows the peace Christ offers His followers, who are not to fear those who threaten the body."
    },
    {
      "pk": 23027004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 4,
      "text": "One thing I have asked of the LORD, this is what I seek: that I may dwell in the house of the LORD all the days of my life, to gaze upon the beauty of the LORD and to seek Him in His temple.",
      "links": "<a href='/AIV/19/26/8'>Ps. 26:8</a>; <a href='/AIV/19/84/4'>Ps. 84:4</a>; <a href='/AIV/42/2/37'>Luke 2:37</a>",
      "comment": "Here David expresses a longing not just for physical safety but for ongoing communion with God. The 'house' and 'temple' refer to God's sanctuary, pointing toward the desire to remain in God's presence—prefiguring the abiding relationship with God made fully possible in Christ, and the importance of worship in God’s house."
    },
    {
      "pk": 23027005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 5,
      "text": "For in the day of trouble He will keep me safe in His shelter; He will hide me in the shelter of His tent; He will set me high upon a rock.",
      "links": "<a href='/AIV/19/31/20'>Ps. 31:20</a>; <a href='/AIV/19/40/2'>Ps. 40:2</a>",
      "comment": "'His tent' refers to the tabernacle—the physical dwelling place of God among His people. There is both a literal safety (David’s real-life enemies) and a spiritual safety for all who seek refuge in the Lord. The 'rock' imagery is connected to God as a foundation, a theme later applied to Christ (1 Corinthians 10:4)."
    },
    {
      "pk": 23027006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 6,
      "text": "Now my head will be lifted up above my enemies around me; I will offer sacrifices in His tent with shouts of joy; I will sing and make music to the LORD.",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/19/107/22'>Ps. 107:22</a>",
      "comment": "Being 'lifted up' denotes deliverance and honor from God. Sacrificial worship is tied to thanksgiving, showing the proper response to deliverance: gratitude expressed in tangible worship and song, anticipating the spiritual sacrifices of praise observed in the Christian liturgy."
    },
    {
      "pk": 23027007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 7,
      "text": "Hear, O LORD, when I cry with my voice; be gracious to me and answer me.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/19/69/16'>Ps. 69:16</a>",
      "comment": "David calls out for mercy, showing openness, humility, and dependence on God's grace—a theme vital to a healthy relationship with God, echoed throughout Scripture and especially in the Psalms."
    },
    {
      "pk": 23027008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 8,
      "text": "You said, 'Seek my face.' My heart says to you, 'Your face, O LORD, I will seek.'",
      "links": "<a href='/AIV/19/24/6'>Ps. 24:6</a>; <a href='/AIV/19/105/4'>Ps. 105:4</a>",
      "comment": "The invitation to 'seek my face' demonstrates God’s desire for relationship and intimacy with His people. David’s response models an interior openness to God’s will, a disposition that is foundational for true devotion."
    },
    {
      "pk": 23027009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 9,
      "text": "Do not hide your face from me; do not turn your servant away in anger, you who have been my help. Do not abandon me or forsake me, O God of my salvation!",
      "links": "<a href='/AIV/19/22/24'>Ps. 22:24</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "This is a plea for God’s continuing presence and faithfulness. The theme of 'not hiding' suggests the longing for union with God, which finds fulfillment in Christ, who makes access to God’s presence permanent for believers."
    },
    {
      "pk": 23027010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 10,
      "text": "For though my father and my mother forsake me, the LORD will receive me.",
      "links": "<a href='/AIV/23/49/15'>Isa. 49:15</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "Even if the closest human relationships break down, God’s commitment remains. God's unconditional acceptance prefigures the way Christ receives all who come to Him, and reflects the security found in belonging to God's chosen community."
    },
    {
      "pk": 23027011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 11,
      "text": "Teach me your way, O LORD, and lead me on a straight path because of my enemies.",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/19/119/35'>Ps. 119:35</a>",
      "comment": "David prays for guidance and instruction, recognizing the need for God’s law and direction. This acknowledges God as the ultimate source of moral teaching, which is preserved and handed down in the tradition of the faith."
    },
    {
      "pk": 23027012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 12,
      "text": "Do not deliver me to the will of my adversaries, for false witnesses have risen against me, breathing out violence.",
      "links": "<a href='/AIV/19/35/11'>Ps. 35:11</a>; <a href='/AIV/40/26/59-60'>Matt. 26:59-60</a>",
      "comment": "False witnesses are a common theme in both Old and New Testaments, ultimately fulfilled in Christ’s own experience before the Sanhedrin. This highlights the reality of suffering for the righteous and connects David’s prayer to the suffering of Christ and the saints."
    },
    {
      "pk": 23027013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 13,
      "text": "I remain confident of this: I will see the goodness of the LORD in the land of the living.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>; <a href='/AIV/19/116/9'>Ps. 116:9</a>",
      "comment": "David's declaration of hope points to his trust in God’s promises for both this life and the life to come. The phrase 'land of the living' traditionally refers to earthly life but suggests an undercurrent of resurrection hope, later fully revealed in Christ."
    },
    {
      "pk": 23027014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 27,
      "verse": 14,
      "text": "Wait for the LORD; be strong, and let your heart take courage; wait for the LORD.",
      "links": "<a href='/AIV/19/31/24'>Ps. 31:24</a>; <a href='/AIV/23/40/31'>Isa. 40:31</a>",
      "comment": "The Psalm ends with a call to patience and courage. Waiting on the Lord is not passive but active trust—an enduring theme throughout the Scriptures, urging God’s people to live in hopeful expectation, sustained by faith and participation in the community of believers."
    }
  ],
  "translatedAt": "2025-12-24T06:07:32.015Z"
}