{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 13,
  "verses": [
    {
      "pk": 23013001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 1,
      "text": "How long, LORD? Will you forget me forever? How long will you hide your face from me?",
      "links": "<a href='/AIV/19/10/1'>Ps. 10:1</a>; <a href='/AIV/18/13/24'>Job 13:24</a>",
      "comment": "The psalmist expresses a deep feeling of abandonment, crying out to God. The phrase 'hide your face' is often used to signify a perceived separation from God's presence—compare this to Numbers 6:25, where God's face shining is a blessing. This longing for God's presence foreshadows Christ's own words of abandonment on the cross (<a href='/AIV/40/27/46'>Matthew 27:46</a>), connecting the sufferings of David with the ultimate suffering of Christ for humanity."
    },
    {
      "pk": 23013002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 2,
      "text": "How long must I wrestle with my thoughts, and day after day have sorrow in my heart? How long will my enemy triumph over me?",
      "links": "<a href='/AIV/18/7/13-15'>Job 7:13-15</a>; <a href='/AIV/19/42/9'>Ps. 42:9</a>",
      "comment": "This verse highlights inner turmoil and the oppression faced by external enemies. The repetition of 'how long?' drives home the intensity of David’s suffering and anticipation of deliverance. Christians have often seen here a pattern for persistent prayer and trust even in moments of trial, recognizing that interior struggles can also be a means of purification and growth in faith."
    },
    {
      "pk": 23013003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 3,
      "text": "Look on me and answer, LORD my God. Give light to my eyes, or I will sleep in death;",
      "links": "<a href='/AIV/19/18/28'>Ps. 18:28</a>; <a href='/AIV/19/38/10'>Ps. 38:10</a>",
      "comment": "'Give light to my eyes' is a Hebrew idiom for reviving or restoring one’s strength (see 1 Samuel 14:27, 29). David pleads for God’s intervention, showing total dependence on divine grace. There is also a foreshadowing of spiritual death and the need for God’s light—a theme fully realized in Christ as the true light who gives life (see <a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 23013004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 4,
      "text": "lest my enemy say, 'I have overcome him,' and my foes rejoice when I fall.",
      "links": "<a href='/AIV/19/25/2'>Ps. 25:2</a>; <a href='/AIV/19/35/19,24'>Ps. 35:19,24</a>",
      "comment": "David appeals to God’s honor as well as his own survival, since God's defeat would seem implied if His anointed falls. This theme echoes throughout the Old Testament, where God's reputation among the nations is linked to His people's fate. For Christians, the defeat of evil is ultimately realized in Christ’s resurrection, ensuring victory over sin and death (<a href='/AIV/46/15/54-57'>1 Cor. 15:54-57</a>)."
    },
    {
      "pk": 23013005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 5,
      "text": "But I have trusted in your steadfast love; my heart will rejoice in your salvation.",
      "links": "<a href='/AIV/19/31/7'>Ps. 31:7</a>; <a href='/AIV/19/52/8-9'>Ps. 52:8-9</a>",
      "comment": "David declares trust in God’s covenant love ('steadfast love'—Hebrew: 'hesed'). Even before deliverance, faith leads to rejoicing. The certainty in salvation points ahead to the assurance believers have in Christ, who brings ultimate salvation—not just from physical enemies, but from spiritual death (<a href='/AIV/42/1/47'>Luke 1:47</a>). This steadfast confidence in God’s promises is emphasized throughout Christian tradition in both personal and communal prayer."
    },
    {
      "pk": 23013006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 13,
      "verse": 6,
      "text": "I will sing to the LORD, because he has dealt bountifully with me.",
      "links": "<a href='/AIV/19/116/7'>Ps. 116:7</a>; <a href='/AIV/19/103/2'>Ps. 103:2</a>",
      "comment": "'I will sing to the LORD' points toward grateful worship as a response to God’s blessings. Notice that praise is promised even before the visible answer arrives, showing faith in God’s faithfulness. Early Christians saw the psalms as foundational prayers in worship, forming the spiritual life of the Church through both private devotion and corporate liturgy (see <a href='/AIV/51/3/16'>Colossians 3:16</a>), reflecting the ongoing call to praise God in all circumstances."
    }
  ],
  "translatedAt": "2025-12-24T06:02:42.307Z"
}