{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 53,
  "verses": [
    {
      "pk": 23053001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 1,
      "text": "The fool says in his heart, “There is no God.” They are corrupt and commit evil injustice; there is no one who does good.",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/45/3/10-12'>Rom. 3:10-12</a>",
      "comment": "This verse highlights human sinfulness and the denial of God. The word 'fool' here reflects not just a lack of intelligence but moral failure and spiritual blindness. Similar language appears in Psalm 14:1, reaffirming the deep tradition of recognizing the universality of sin. Paul echoes this truth in Romans 3, showing the continuity between Old and New Testaments. The focus on 'heart' indicates the inner disposition toward God, an important aspect for later theological reflections about inner transformation through grace."
    },
    {
      "pk": 23053002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 2,
      "text": "God looks down from heaven on the children of man, to see if there is anyone who understands, who seeks after God.",
      "links": "<a href='/AIV/19/14/2'>Ps. 14:2</a>; <a href='/AIV/1/6/12'>Gen. 6:12</a>",
      "comment": "The image of God 'looking down' suggests His transcendence and omniscience, yet also His desire for humanity to seek Him. It resonates with Genesis 6:12, reinforcing the observation of corrupt human nature. The phrase 'seeks after God' is crucial—it implies that while knowledge of God is possible, human effort aided by divine initiative is necessary to attain it, a theme later fulfilled with the sending of the Holy Spirit."
    },
    {
      "pk": 23053003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 3,
      "text": "All have turned away; together they have become corrupt. There is none who does good, not even one.",
      "links": "<a href='/AIV/19/14/3'>Ps. 14:3</a>; <a href='/AIV/45/3/12'>Rom. 3:12</a>",
      "comment": "This verse is quoted directly by Paul in Romans 3:12 to show the universal need for redemption. The collective nature ('all...together') underlines not merely individual sin but also the solidarity of humanity in moral failure, emphasizing the need for grace mediated through God's appointed means for salvation. The strong statement—'not even one'—leaves no room for human boasting."
    },
    {
      "pk": 23053004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 4,
      "text": "Do all those who do evil never understand, who eat up my people as they eat bread and do not call upon God?",
      "links": "<a href='/AIV/19/14/4'>Ps. 14:4</a>; <a href='/AIV/33/3/3'>Mic. 3:3</a>",
      "comment": "The phrase 'eat up my people' symbolizes oppression and exploitation of God's chosen, a reality faced frequently throughout Israel's history and later fulfilled in the persecution of the Church. Not calling on God means refusing true worship and relationship, showing that outward actions reveal inner spiritual reality. The notion of a differentiated people implies the importance of belonging to the true assembly founded by God."
    },
    {
      "pk": 23053005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 5,
      "text": "There they are, overwhelmed with fear, where there was nothing to fear, for God scatters the bones of those who encamp against you; you put them to shame, for God has rejected them.",
      "links": "<a href='/AIV/19/14/5'>Ps. 14:5</a>; <a href='/AIV/24/8/1-2'>Jer. 8:1-2</a>",
      "comment": "Divine judgment brings supernatural fear upon the wicked, even when external circumstances give no reason. The imagery of 'scattering bones' implies complete defeat and disgrace, with echoes in prophetic warnings like Jeremiah 8. The concept of shame and rejection underscores the consequences of resisting God's appointed order, which is later expressed through the unity of God's people in the New Testament."
    },
    {
      "pk": 23053006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 53,
      "verse": 6,
      "text": "Oh, that salvation for Israel would come out of Zion! When God restores the fortunes of His people, let Jacob rejoice, let Israel be glad.",
      "links": "<a href='/AIV/19/14/7'>Ps. 14:7</a>; <a href='/AIV/45/11/26'>Rom. 11:26</a>; <a href='/AIV/23/2/3'>Isa. 2:3</a>",
      "comment": "Zion is symbolically associated with God's dwelling and the locus of true worship. This verse expresses longing for salvation coming from the place God has chosen. Christians see its fulfillment in Christ, who brings restoration and joy to all God's people (cf. Romans 11:26). The spiritual and eschatological reading is that the fullness of salvation and worship is gathered in the community God has established, with Christ at its center."
    }
  ],
  "translatedAt": "2025-12-24T06:17:11.602Z"
}