{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 59,
  "verses": [
    {
      "pk": 23059001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 1,
      "text": "Deliver me from my enemies, O God; protect me from those who rise up against me.",
      "links": "<a href='/AIV/19/18/48'>Ps. 18:48</a>; <a href='/AIV/19/17/13'>Ps. 17:13</a>",
      "comment": "The psalmist immediately appeals directly to God for rescue, affirming God's role as a personal deliverer. The language is a call for protection and echoes throughout other psalms and prayers (Ps. 18:2), prefiguring the consistent need for God's safeguarding in both Old and New Testament believers."
    },
    {
      "pk": 23059002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 2,
      "text": "Deliver me from those who do evil, and save me from bloodthirsty men.",
      "links": "<a href='/AIV/19/7/1'>Ps. 7:1</a>; <a href='/AIV/19/26/9-10'>Ps. 26:9-10</a>",
      "comment": "Here, the prayer broadens to all evildoers, not only those personally hostile to the psalmist. The word 'bloodthirsty' means men intent on violence, which may also be seen as representative of spiritual enemies, preparing the way for later Christian understanding of spiritual warfare (Eph. 6:12)."
    },
    {
      "pk": 23059003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 3,
      "text": "For see, they lie in wait for my life; fierce men assemble against me, not for my transgression or for my sin, O LORD.",
      "links": "<a href='/AIV/19/35/7'>Ps. 35:7</a>; <a href='/AIV/09/24/11'>1 Sam. 24:11</a>",
      "comment": "This verse mirrors David’s situation when Saul sent men to watch his house (see 1 Sam. 19:11). The psalmist protests his innocence, a theme that prefigures Christ’s own blamelessness before his accusers (John 18:38)."
    },
    {
      "pk": 23059004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 4,
      "text": "Without any fault of mine, they run and prepare themselves. Rise to help me and see!",
      "links": "<a href='/AIV/19/35/23'>Ps. 35:23</a>; <a href='/AIV/19/44/21'>Ps. 44:21</a>",
      "comment": "David’s plea highlights urgent innocence and calls God to act as an impartial judge. There is a double meaning, for just as David experiences false accusation, so does Christ, foreshadowing the value of innocent suffering."
    },
    {
      "pk": 23059005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 5,
      "text": "You, O LORD God of Hosts, the God of Israel, awake to punish all the nations; be merciful to none of those who treacherously plot evil. Selah.",
      "links": "<a href='/AIV/19/80/4'>Ps. 80:4</a>; <a href='/AIV/19/7/6'>Ps. 7:6</a>",
      "comment": "By invoking the LORD as 'God of Hosts,' the psalmist addresses God as ruler over angelic armies—a motif further embodied in Christ’s own teaching (Matt. 26:53). The prayer against nations hints at both immediate enemies and future universal judgment, resonating with a vision of global justice."
    },
    {
      "pk": 23059006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 6,
      "text": "They return at evening, snarling like dogs, and prowl around the city.",
      "links": "<a href='/AIV/19/22/16'>Ps. 22:16</a>; <a href='/AIV/19/59/14'>Ps. 59:14</a>",
      "comment": "Dogs in ancient Israel were seen as unclean and dangerous. The comparison here suggests the persistence and hostility of David's enemies—language that echoes in descriptions of Christ’s opponents (Ps. 22:16, a messianic psalm)."
    },
    {
      "pk": 23059007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 7,
      "text": "See how they pour out words with their mouths; swords are on their lips, for they say, 'Who hears?'",
      "links": "<a href='/AIV/19/64/3-4'>Ps. 64:3-4</a>; <a href='/AIV/19/10/11'>Ps. 10:11</a>",
      "comment": "Enemies use slander and mock God's awareness—themes picked up throughout Scripture, contrasting human arrogance with divine omniscience. This remains relevant for understanding both verbal persecution and the sin of presumption."
    },
    {
      "pk": 23059008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 8,
      "text": "But you, O LORD, laugh at them; you hold all the nations in derision.",
      "links": "<a href='/AIV/19/2/4'>Ps. 2:4</a>; <a href='/AIV/19/37/13'>Ps. 37:13</a>",
      "comment": "God’s laughter expresses His sovereignty and unthreatened power over rebellious nations and individuals alike. Ps. 2 is especially important here, given its messianic overtones and its use in the New Testament (Acts 4:25-28)."
    },
    {
      "pk": 23059009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 9,
      "text": "O my Strength, I will watch for you, for you, O God, are my fortress.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/62/2'>Ps. 62:2</a>",
      "comment": "The Psalmist expresses patient trust in God, calling Him 'my Strength,' an attribute used throughout the Psalms. The imagery anticipates Christ's own reliance on the Father, inviting believers into spiritual perseverance and trust."
    },
    {
      "pk": 23059010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 10,
      "text": "My God in his steadfast love will meet me; God will let me look in triumph on my enemies.",
      "links": "<a href='/AIV/19/21/13'>Ps. 21:13</a>; <a href='/AIV/19/23/6'>Ps. 23:6</a>",
      "comment": "The 'steadfast love' (Hebrew: hesed) signifies God’s covenant faithfulness, which is central throughout both Old and New Testament revelation (see Rom. 8:31-39 for the secure love of God in Christ). The assurance of victory anticipates ultimate vindication."
    },
    {
      "pk": 23059011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 11,
      "text": "Do not kill them, or my people may forget; make them wander by your power and bring them down, O Lord, our shield.",
      "links": "<a href='/AIV/19/59/13'>Ps. 59:13</a>; <a href='/AIV/02/9/16'>Ex. 9:16</a>",
      "comment": "There’s a call for proportion, not annihilation—so that God’s people observe the consequences of evil and remember divine justice. The theme of God as shield recurs in Psalms and in Pauline imagery (Eph. 6:16), encouraging ongoing trust."
    },
    {
      "pk": 23059012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 12,
      "text": "For the sin of their mouths, the words of their lips, let them be trapped in their pride. For the curses and lies they utter,",
      "links": "<a href='/AIV/19/7/16'>Ps. 7:16</a>; <a href='/AIV/19/140/9'>Ps. 140:9</a>",
      "comment": "Judgment is specifically connected to the misuse of speech, with pride, cursing, and deceit being especially offensive. Later teaching on the power of the tongue draws from these roots (James 3:6-10), highlighting the importance of humility and truth—and hinting at a fuller moral tradition regarding speech."
    },
    {
      "pk": 23059013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 13,
      "text": "consume them in wrath; consume them till they are no more. Then men will know that God rules over Jacob to the ends of the earth. Selah.",
      "links": "<a href='/AIV/19/83/17-18'>Ps. 83:17-18</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "The psalmist looks for a dramatic vindication that will result in universal acknowledgment of God’s sovereignty. This longing for global recognition of God’s reign points ahead to the Church as a visible sign to all nations (Matt. 28:19)."
    },
    {
      "pk": 23059014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 14,
      "text": "They return at evening, snarling like dogs and prowling around the city.",
      "links": "<a href='/AIV/19/59/6'>Ps. 59:6</a>",
      "comment": "This verse repeats verse 6 for emphasis, illustrating both the persistence of evil and the importance of vigilance and prayer at all times. Consider the connection to the vigilance recommended by Christ (Mark 13:33-37)."
    },
    {
      "pk": 23059015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 15,
      "text": "They wander about for food and growl if they are not satisfied.",
      "links": "<a href='/AIV/18/30/4-7'>Job 30:4-7</a>",
      "comment": "The image reinforces the futility of those acting in wickedness, recalling Proverbs’ warnings about the consequences of unrighteous living. There’s also a spiritual lesson—those who do not feast on God’s truth remain hungry."
    },
    {
      "pk": 23059016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 16,
      "text": "But I will sing of your strength; I will sing aloud of your steadfast love in the morning. For you have been my fortress and my refuge in days of trouble.",
      "links": "<a href='/AIV/19/89/1'>Ps. 89:1</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "The psalmist’s resolve to praise God contrasts the insecurity of his enemies. The focus on morning praise and God as refuge models a rhythm of prayer and trust, which became foundational to Christian communal worship and the call to pray at set hours (see Acts 3:1)."
    },
    {
      "pk": 23059017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 59,
      "verse": 17,
      "text": "O my Strength, to you I will sing praises, for you, O God, are my fortress, the God who shows me steadfast love.",
      "links": "<a href='/AIV/19/59/9'>Ps. 59:9</a>; <a href='/AIV/19/144/2'>Ps. 144:2</a>",
      "comment": "The closing verse reaffirms God’s protection and covenant love. The language of sanctuary and praise points toward a liturgical response: singing to God as evidence of faith, mirroring the continual worship practiced by the early Christians (Col. 3:16). The structure and repetition also encourage regular participation in both private and communal prayer."
    }
  ],
  "translatedAt": "2025-12-24T06:19:18.830Z"
}