{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 138,
  "verses": [
    {
      "pk": 23138001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 1,
      "text": "I will give you thanks with all my heart; before the gods I will sing praises to you.",
      "links": "<a href='/AIV/19/95/1-3'>Ps. 95:1-3</a>; <a href='/AIV/19/108/3'>Ps. 108:3</a>",
      "comment": "Here, the psalmist declares wholehearted praise to God, acknowledging His greatness over all other powers or idols. The use of 'gods' likely refers to rulers or false deities, emphasizing the sole supremacy of the LORD. The totality of the devotion mirrors New Testament calls to love God fully (see <a href='/AIV/40/22/37'>Matt. 22:37</a>)."
    },
    {
      "pk": 23138002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 2,
      "text": "I bow down toward your holy temple and give thanks to your name for your steadfast love and your faithfulness. For you have exalted your word and your name above all.",
      "links": "<a href='/AIV/19/5/7'>Ps. 5:7</a>; <a href='/AIV/19/89/1-2'>Ps. 89:1-2</a>; <a href='/AIV/19/97/12'>Ps. 97:12</a>",
      "comment": "The act of bowing toward the temple signifies reverence for God's chosen dwelling place and points to the importance of sacred space in worship. The language of 'steadfast love' and 'faithfulness' reflects God's covenantal nature. Exalting God's word above all highlights the power of His promises, echoing themes later seen in Christ as the Word made flesh (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 23138003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 3,
      "text": "On the day I called, you answered me; you increased the strength of my soul.",
      "links": "<a href='/AIV/19/18/6'>Ps. 18:6</a>; <a href='/AIV/19/27/14'>Ps. 27:14</a>",
      "comment": "God’s immediate response to prayer and inner strengthening points to the reality of grace. The phrase ‘increased my soul’s strength’ can be understood both literally and spiritually—God not only meets physical needs but also brings deep spiritual fortitude. Echoes can be found in New Testament times when believers receive strength in prayer (<a href='/AIV/50/4/6-7'>Phil. 4:6-7</a>)."
    },
    {
      "pk": 23138004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 4,
      "text": "All the kings of the earth will give you thanks, LORD, when they have heard the words you have spoken.",
      "links": "<a href='/AIV/19/102/15'>Ps. 102:15</a>; <a href='/AIV/19/72/11'>Ps. 72:11</a>",
      "comment": "This verse anticipates a time when all rulers recognize God’s supreme authority, foreshadowing the universal kingship found in Christ (<a href='/AIV/66/19/16'>Rev. 19:16</a>). This verse also aligns with the hope for global recognition of divine truth, a foundation for unity in worship throughout the world."
    },
    {
      "pk": 23138005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 5,
      "text": "Yes, they will sing of the ways of the LORD, for great is the glory of the LORD.",
      "links": "<a href='/AIV/19/145/3'>Ps. 145:3</a>; <a href='/AIV/19/96/1-3'>Ps. 96:1-3</a>",
      "comment": "All nations will acknowledge God’s glory and righteousness, which is ultimately revealed in the majesty of Jesus (<a href='/AIV/40/24/30'>Matt. 24:30</a>). The singing of the ways of the LORD reflects the unity of worship that surrounds God’s people, both spiritually and visibly."
    },
    {
      "pk": 23138006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 6,
      "text": "Though the LORD is exalted, he looks upon the lowly; but the proud he knows from afar.",
      "links": "<a href='/AIV/19/113/5-6'>Ps. 113:5-6</a>; <a href='/AIV/19/18/27'>Ps. 18:27</a>; <a href='/AIV/42/1/52'>Luke 1:52</a>",
      "comment": "God’s transcendence does not separate Him from those who are humble, but positions Him to resist the proud. This theme resonates with Christ’s teaching about humility and the exaltation of the meek (<a href='/AIV/40/5/3-5'>Matt. 5:3-5</a>). The spiritual principle here encourages humility as a pathway to divine favor."
    },
    {
      "pk": 23138007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 7,
      "text": "Though I walk in the midst of trouble, you preserve my life; you stretch out your hand against the anger of my enemies, and your right hand saves me.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/19/63/9-10'>Ps. 63:9-10</a>",
      "comment": "This verse expresses divine protection in the face of adversity. The mention of God’s right hand is a biblical symbol of power and salvation, prefiguring Christ’s victory and mighty works (<a href='/AIV/44/2/33'>Acts 2:33</a>; <a href='/AIV/41/16/19'>Mark 16:19</a>). It affirms trust in God’s intervention and mercy."
    },
    {
      "pk": 23138008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 138,
      "verse": 8,
      "text": "The LORD will fulfill his purpose for me; your steadfast love, LORD, endures forever. Do not forsake the work of your hands.",
      "links": "<a href='/AIV/19/57/2'>Ps. 57:2</a>; <a href='/AIV/19/100/5'>Ps. 100:5</a>",
      "comment": "The promise that God will accomplish His purpose reflects the doctrine of divine providence and assurance that God’s love is eternal. Asking God not to forsake the work of His hands highlights the permanence of God’s commitment to His people, anticipating the fullness of redemption in Christ (<a href='/AIV/50/1/6'>Phil. 1:6</a>). The spiritual sense is both personal and communal, providing hope that believers are part of a greater plan shaped by divine love."
    }
  ],
  "translatedAt": "2025-12-24T06:46:26.876Z"
}