{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 146,
  "verses": [
    {
      "pk": 23146001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 1,
      "text": "Praise the LORD! Praise the LORD, O my soul!",
      "links": "<a href='/AIV/19/103/1'>Ps. 103:1</a>; <a href='/AIV/19/104/1'>Ps. 104:1</a>",
      "comment": "The psalm opens with an emphatic call to personal worship, echoing similar introductions to praise throughout the Psalms. The focus is on the inner self's response to God, showing the depth of personal devotion expected from the faithful."
    },
    {
      "pk": 23146002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 2,
      "text": "I will praise the LORD as long as I live; I will sing praises to my God while I have being.",
      "links": "<a href='/AIV/19/63/4'>Ps. 63:4</a>; <a href='/AIV/19/104/33'>Ps. 104:33</a>",
      "comment": "This verse underlines lifelong commitment to worship, a theme that foreshadows continuous prayer and spiritual devotion encouraged throughout Scripture. The idea of praise enduring for one's whole existence hints toward the tradition of liturgical continuity and the call to lifelong fidelity."
    },
    {
      "pk": 23146003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 3,
      "text": "Do not put your trust in princes, in a son of man, in whom there is no salvation.",
      "links": "<a href='/AIV/19/118/8-9'>Ps. 118:8-9</a>; <a href='/AIV/24/17/5'>Jer. 17:5</a>",
      "comment": "The psalm warns against relying on earthly rulers for deliverance, directly linking salvation only to God. The reference to 'son of man' as powerless for salvation forms an Old Testament foundation for understanding the uniqueness of Christ, the 'Son of Man,' who alone brings true salvation."
    },
    {
      "pk": 23146004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 4,
      "text": "His breath departs, he returns to the earth; on that very day his plans perish.",
      "links": "<a href='/AIV/18/14/10'>Job 14:10</a>; <a href='/AIV/19/104/29'>Ps. 104:29</a>",
      "comment": "This presents the mortality of man, contrasting the passing nature of human plans with the enduring faithfulness of God. It subtly points to the doctrine of the immortality of the soul and the need for a hope grounded beyond earthly existence."
    },
    {
      "pk": 23146005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 5,
      "text": "Blessed is he whose help is the God of Jacob, whose hope is in the LORD his God.",
      "links": "<a href='/AIV/19/40/4'>Ps. 40:4</a>; <a href='/AIV/19/84/12'>Ps. 84:12</a>",
      "comment": "The blessing pronounced here shows that true happiness is found in trusting the God of Jacob, affirming the continuity of God’s covenant through generations – a theme central to biblical understanding of salvation history."
    },
    {
      "pk": 23146006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 6,
      "text": "Who made heaven and earth, the sea and all that is in them; who keeps faith forever;",
      "links": "<a href='/AIV/19/33/6-9'>Ps. 33:6-9</a>; <a href='/AIV/19/89/2'>Ps. 89:2</a>",
      "comment": "The creative power of God is stressed, along with His unwavering faithfulness. Creation ex nihilo and God’s ongoing fidelity forms a basis for trust and points towards the development of doctrine on God's providence throughout history."
    },
    {
      "pk": 23146007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 7,
      "text": "Who executes justice for the oppressed, who gives food to the hungry. The LORD sets the prisoners free;",
      "links": "<a href='/AIV/19/107/9'>Ps. 107:9</a>; <a href='/AIV/19/146/8'>Ps. 146:8</a>; <a href='/AIV/42/4/18'>Luke 4:18</a>",
      "comment": "God’s justice and concern for the needy are highlighted, echoing the prophetic vision of God's kingdom of mercy and righteousness. Jesus fulfills these promises, notably in His ministry, signaling the deeper spiritual liberation found in Him."
    },
    {
      "pk": 23146008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 8,
      "text": "The LORD opens the eyes of the blind. The LORD lifts up those who are bowed down; the LORD loves the righteous.",
      "links": "<a href='/AIV/23/35/5'>Isa. 35:5</a>; <a href='/AIV/42/7/22'>Luke 7:22</a>",
      "comment": "Physical and spiritual healing are central here, as seen in Jesus’s ministry where He literally opened the eyes of the blind. This verse prefigures the Messianic mission and the call to compassion, linking Old Testament hope with New Testament fulfillment."
    },
    {
      "pk": 23146009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 9,
      "text": "The LORD watches over the sojourners; He upholds the widow and the orphan, but He brings the way of the wicked to ruin.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/19/147/6'>Ps. 147:6</a>",
      "comment": "God's special care extends to strangers, widows, and orphans – those most vulnerable. The verse emphasizes God’s justice and mercy, which are perfectly realized in Christ and through visible, sacramental expressions of care for the poor."
    },
    {
      "pk": 23146010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 146,
      "verse": 10,
      "text": "The LORD will reign forever, your God, O Zion, for all generations. Praise the LORD!",
      "links": "<a href='/AIV/19/10/16'>Ps. 10:16</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "God’s eternal kingship is proclaimed, a theme echoing through the prophets and culminating in Christ’s reign. Zion, representing the gathering of God’s people, suggests both the literal city and the spiritual reality of God’s enduring, visible authority till the end of time."
    }
  ],
  "translatedAt": "2025-12-24T06:48:51.196Z"
}