{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 117,
  "verses": [
    {
      "pk": 23117001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 117,
      "verse": 1,
      "text": "Praise the LORD, all you nations; extol Him, all you peoples!",
      "links": "<a href='/AIV/19/66/8'>Ps. 66:8</a>; <a href='/AIV/19/100/1'>Ps. 100:1</a>; <a href='/AIV/45/15/11'>Rom. 15:11</a>",
      "comment": "This verse is a universal call to praise God, extending beyond Israel to all nations and peoples. The invitation for all peoples foreshadows the global mission of God's salvation (see Rom. 15:11) and anticipates the unity of believers from every nation in worship of the one true God. This points toward the inclusion of the Gentiles into the people of God through Christ, an early indication that God's covenant plan is for all humanity. Spiritually, it hints at the unity intended by God for all who call on His name together and share in His promises (see Eph. 2:14-19)."
    },
    {
      "pk": 23117002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 117,
      "verse": 2,
      "text": "For His steadfast love is mighty toward us, and the faithfulness of the LORD endures forever. Praise the LORD!",
      "links": "<a href='/AIV/19/100/5'>Ps. 100:5</a>; <a href='/AIV/19/118/1'>Ps. 118:1</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "This verse gives the reason for universal praise: God's steadfast love (Hebrew: hesed) and enduring faithfulness. 'Toward us' includes not only Israel but, by extension from verse 1, all who believe in His covenant promises. The fullness of this steadfast love is ultimately revealed in Jesus Christ (see John 3:16; Rom. 5:8), inviting all into God's family through His faithfulness. The repeated call to praise shows that worship is a perpetual response to God's loving and faithful nature—a worship that ideally unites all believers in one voice, in a bond that is both visible and spiritual (cf. Eph. 4:4-6)."
    }
  ],
  "translatedAt": "2025-12-24T06:40:57.867Z"
}