{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 126,
  "verses": [
    {
      "pk": 23126001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 1,
      "text": "When the LORD brought back the captives to Zion, we were like those who dream.",
      "links": "<a href='/AIV/23/85/1'>Ps. 85:1</a>; <a href='/AIV/15/1/3'>Ezra 1:3</a>",
      "comment": "The reference to 'brought back the captives' recalls the restoration from exile under Ezra and Nehemiah. 'Like those who dream' shows overwhelming joy and disbelief at God's power to restore His people, prefiguring the spiritual deliverance from sin found in Christ (cf. Luke 4:18-19). This verse hints at God's faithfulness to His covenant and the communal aspect of salvation."
    },
    {
      "pk": 23126002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 2,
      "text": "Then our mouth was filled with laughter, and our tongue with shouts of joy. Then they said among the nations, 'The LORD has done great things for them.'",
      "links": "<a href='/AIV/23/51/11'>Ps. 51:11</a>; <a href='/AIV/10/7/21'>2 Sam. 7:21</a>",
      "comment": "The restoration of Israel caused such joy that even surrounding nations recognized the work of God. In the New Testament, similar astonishment occurs with the spread of the Gospel to all nations (cf. Acts 2:11). The universality of the Church is anticipated here through the recognition by Gentiles of God's salvation."
    },
    {
      "pk": 23126003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 3,
      "text": "The LORD has done great things for us; we are filled with joy.",
      "links": "<a href='/AIV/23/71/19'>Ps. 71:19</a>; <a href='/AIV/42/1/49'>Luke 1:49</a>",
      "comment": "'We are filled with joy' echoes Mary’s Magnificat (Luke 1:49), where God’s mighty acts inspire personal and corporate rejoicing. God's redemptive works in history are an assurance for believers today that He continues to act for the good of His people both physically and spiritually."
    },
    {
      "pk": 23126004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 4,
      "text": "Restore our fortunes, O LORD, like streams in the Negev.",
      "links": "<a href='/AIV/23/14/7'>Ps. 14:7</a>; <a href='/AIV/23/85/6'>Ps. 85:6</a>",
      "comment": "The psalmist prays for complete restoration, using the sudden filling of dry riverbeds after a rain as an image. Spiritually, this points to revival and renewal, which is granted through God's grace, particularly in the sacraments (cf. John 7:38: 'rivers of living water')."
    },
    {
      "pk": 23126005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 5,
      "text": "Those who sow in tears will reap with shouts of joy.",
      "links": "<a href='/AIV/23/30/5'>Ps. 30:5</a>; <a href='/AIV/23/84/6'>Ps. 84:6</a>; <a href='/AIV/43/16/20'>John 16:20</a>",
      "comment": "Suffering and hope are united here: trials endured in faith lead to eventual rejoicing. Jesus speaks similarly in John 16:20 about sorrow turning to joy. The rhythm of penance followed by restoration underlines ongoing spiritual renewal through perseverance and trust in God’s promises."
    },
    {
      "pk": 23126006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 126,
      "verse": 6,
      "text": "He who goes out weeping, bearing the seed for sowing, shall come home with shouts of joy, carrying his sheaves with him.",
      "links": "<a href='/AIV/23/60/2'>Ps. 60:2</a>; <a href='/AIV/43/12/24'>John 12:24</a>; <a href='/AIV/59/5/7'>James 5:7</a>",
      "comment": "This verse amplifies the previous theme: patient faithfulness in hardship will be rewarded—pointing to the final harvest of souls. Jesus’ death and resurrection (John 12:24) is the supreme model; His 'seed' bears abundant fruit. The imagery also supports the value of cooperating with divine grace through perseverance and faithful works."
    }
  ],
  "translatedAt": "2025-12-24T06:43:20.615Z"
}