{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 149,
  "verses": [
    {
      "pk": 23149001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 1,
      "text": "Praise the LORD! Sing to the LORD a new song, his praise in the assembly of the faithful.",
      "links": "<a href='/AIV/19/40/3'>Ps. 40:3</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>; <a href='/AIV/66/5/9'>Rev. 5:9</a>",
      "comment": "Singing a new song indicates not only renewed thanksgiving for God's works but also prefigures the continual praise offered by the community of believers (see Rev. 5:9). The 'assembly of the faithful' alludes to the gathered worshipping people, emphasizing belief as a communal, not just individual, act—reflecting the visible unity God desires for His people."
    },
    {
      "pk": 23149002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 2,
      "text": "Let Israel rejoice in their Maker; let the children of Zion exult in their King.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/23/43/21'>Isa. 43:21</a>",
      "comment": "Refers to God as both Maker and King, which foreshadows Christ's kingship (see John 1:3 for Christ as Creator). The mention of Zion and kingship invites a spiritual reflection on the central role of Jerusalem and liturgy in the worshipping life of God's people."
    },
    {
      "pk": 23149003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 3,
      "text": "Let them praise his name with dancing; let them make music to him with tambourine and lyre.",
      "links": "<a href='/AIV/19/150/4'>Ps. 150:4</a>; <a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "Liturgical celebration with music and dance illustrates the bodily nature of worship, which involves all of the human person, reminiscent of Israel's worship after the Exodus (Ex. 15:20). True worship embraces both spirit and tangible traditions."
    },
    {
      "pk": 23149004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 4,
      "text": "For the LORD takes pleasure in his people; he adorns the humble with salvation.",
      "links": "<a href='/AIV/19/35/27'>Ps. 35:27</a>; <a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/40/5/3-5'>Matt. 5:3-5</a>",
      "comment": "God gives grace to the humble and exalts them, foreshadowing Christ's teaching on the Beatitudes (Matt. 5:3-5). Salvation here literally means 'victory' but also foreshadows the fullness of salvation in Christ—pointing to both physical deliverance and spiritual grace."
    },
    {
      "pk": 23149005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 5,
      "text": "Let the faithful rejoice in glory; let them sing for joy on their beds.",
      "links": "<a href='/AIV/19/63/6'>Ps. 63:6</a>; <a href='/AIV/19/4/4'>Ps. 4:4</a>",
      "comment": "Rejoicing 'on their beds' implies constant praise, not limited by location or circumstance—sacredness pervades all of life for the believer. The passage hints at the enduring joy and even rest experienced by those united in God's favor."
    },
    {
      "pk": 23149006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 6,
      "text": "May the high praises of God be in their mouths, and a double-edged sword in their hands,",
      "links": "<a href='/AIV/58/4/12'>Heb. 4:12</a>; <a href='/AIV/49/6/17'>Eph. 6:17</a>",
      "comment": "The 'double-edged sword' is later interpreted spiritually as the word of God (see Heb. 4:12) and as a weapon of righteousness (Eph. 6:17). This verse shows how praise and spiritual warfare go hand in hand."
    },
    {
      "pk": 23149007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 7,
      "text": "to execute vengeance on the nations and punishment on the peoples,",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/66/2/26-27'>Rev. 2:26-27</a>",
      "comment": "This reflects the just judgment of God on evil, echoed in messianic prophecies (Ps. 2:9; Rev. 2:26-27). Historically tied to Israel's mission, spiritually it points to the Church’s authority—always exercised in union with divine justice and mercy."
    },
    {
      "pk": 23149008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 8,
      "text": "to bind their kings with chains and their nobles with iron shackles,",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/19/18/50'>Ps. 18:50</a>",
      "comment": "Binding kings and nobles symbolizes victory over the world’s powers. This has been interpreted not only literally but as Christ’s victory and authority over all spiritual and earthly rulers, brought about through the faithfulness of God's people."
    },
    {
      "pk": 23149009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 149,
      "verse": 9,
      "text": "to carry out the written judgment against them—this honor is for all his faithful ones. Praise the LORD!",
      "links": "<a href='/AIV/19/97/8'>Ps. 97:8</a>; <a href='/AIV/40/19/28'>Matt. 19:28</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "The phrase 'written judgment' points to God’s established and revealed plan, already foretold in Scriptures. The honor shared by the faithful indicates participation in the fulfillment of God's promises—echoed in the New Testament, where believers are promised to reign with Christ (Matt. 19:28; Rev. 20:4)."
    }
  ],
  "translatedAt": "2025-12-24T06:49:57.036Z"
}