{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 7,
  "verses": [
    {
      "pk": 12007001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 1,
      "text": "Elisha said, 'Hear the word of the LORD: Thus says the LORD, \"Tomorrow about this time a seah of fine flour will be sold for a shekel, and two seahs of barley for a shekel, at the gate of Samaria.\"'",
      "links": "<a href='/AIV/01/18/14'>Gen. 18:14</a>; <a href='/AIV/12/4/43-44'>2 Kgs. 4:43-44</a>",
      "comment": "Elisha prophesies miraculous provision, echoing God's power to work beyond human expectation (see Gen. 18:14). The prophecy offers hope in desperate circumstances, suggesting God's providence is not limited by material lack."
    },
    {
      "pk": 12007002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 2,
      "text": "Then the royal officer on whose arm the king leaned answered the man of God, 'Look, even if the LORD opened windows in the sky, could this really happen?' But Elisha replied, 'You will see it with your own eyes, but you will not eat of it.'",
      "links": "<a href='/AIV/04/20/12'>Num. 20:12</a>; <a href='/AIV/27/6/20-22'>Dan. 6:20-22</a>",
      "comment": "The officer’s skepticism is met with a stern rebuke; unbelief is shown to exclude oneself from God’s blessings (cf. Num. 20:12). Faith is seen as a key to participation in God’s miracles, a principle that persists throughout both Old and New Testaments."
    },
    {
      "pk": 12007003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 3,
      "text": "Now four men with leprosy were at the entrance of the gate. They said to each other, 'Why are we sitting here until we die?'",
      "links": "<a href='/AIV/03/13/46'>Lev. 13:46</a>; <a href='/AIV/42/17/12'>Luke 17:12</a>",
      "comment": "The outcasts—lepers—are positioned at the edge but about to be the means of God's deliverance. Their condition evokes broader biblical themes of God's mercy toward the marginalized (Lev. 13:46; Luke 17:12)."
    },
    {
      "pk": 12007004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 4,
      "text": "'If we say, \"Let us enter the city,\" the famine is in the city, and we shall die there. If we stay here, we die also. So now, come, let us go over to the camp of the Arameans. If they spare our lives, we shall live; and if they kill us, we shall only die.'",
      "links": "<a href='/AIV/17/4/11'>Esth. 4:11</a>",
      "comment": "Desperation leads the outcasts to risk action. This reflects a biblical pattern—God often brings life out of human hopelessness, rewarding faith and obedience in difficult circumstances."
    },
    {
      "pk": 12007005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 5,
      "text": "So they rose at twilight to go to the camp of the Arameans. When they came to the edge of the Aramean camp, there was no one there.",
      "links": "<a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "God’s deliverance often arrives when least expected. The emptiness of the camp fulfills the suggestion of divine intervention—God acting on behalf of His people while they are unaware."
    },
    {
      "pk": 12007006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 6,
      "text": "For the LORD had made the army of the Arameans hear the sound of chariots and horses—an army great in number—so that they said to each other, 'Look, the king of Israel has hired against us the kings of the Hittites and the Egyptians to attack us!'",
      "links": "<a href='/AIV/10/5/24'>2 Sam. 5:24</a>; <a href='/AIV/12/6/17'>2 Kgs. 6:17</a>",
      "comment": "The Lord's sovereignty is depicted in causing confusion among Israel's enemies, as seen elsewhere (2 Sam. 5:24). The spiritual realm’s involvement in earthly affairs is noted—a recurring pattern suggesting God’s unseen providential care."
    },
    {
      "pk": 12007007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 7,
      "text": "So they arose and fled at twilight, abandoning their tents, horses, donkeys, and leaving the camp just as it was, and fled for their lives.",
      "links": "<a href='/AIV/14/20/23-25'>2 Chr. 20:23-25</a>",
      "comment": "God delivers abundantly: the Arameans abandon everything, echoing similar miraculous deliverances in Israel’s history (2 Chr. 20:23-25)."
    },
    {
      "pk": 12007008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 8,
      "text": "When these lepers came to the edge of the camp, they went into a tent, ate and drank, and carried away silver, gold, and clothing, and went and hid them. Then they returned and went into another tent and carried things from there also and hid them.",
      "links": "<a href='/AIV/02/12/35-36'>Ex. 12:35-36</a>",
      "comment": "This recalls Israel’s deliverance from Egypt, where the people received the wealth of their oppressors (Ex. 12:35-36). The abundance symbolizes the unexpected mercy and generosity of God’s salvation."
    },
    {
      "pk": 12007009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 9,
      "text": "Then they said to each other, 'We are not doing right. This day is a day of good news. If we keep silent and wait until morning light, punishment will overtake us. Now come, let us go and inform the king’s household.'",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/42/2/10'>Luke 2:10</a>",
      "comment": "The lepers realize the calling to share good news—like evangelists. Divine blessings are not meant to be hoarded (Isa. 52:7). Spiritually, this connects to the proclamation of the gospel in the New Testament (Luke 2:10)."
    },
    {
      "pk": 12007010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 10,
      "text": "So they came and called to the gatekeepers of the city and told them, 'We went to the camp of the Arameans, and there was no one there, nor the sound of a man—only horses tied up, donkeys tied up, and tents just as they were.'",
      "links": "<a href='/AIV/06/2/1'>Josh. 2:1</a>",
      "comment": "The report of the ‘emptied camp’ urges the city to respond in faith. This highlights the role of unlikely messengers in God’s plan, as in Rahab’s case (Josh. 2:1)."
    },
    {
      "pk": 12007011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 11,
      "text": "Then the gatekeepers called out, and it was told within the king’s house.",
      "links": "<a href='/AIV/12/5/2-3'>2 Kgs. 5:2-3</a>",
      "comment": "The message passes through trusted city officials, highlighting discernment and verification, as when Naaman heard of Israel’s prophet (2 Kgs. 5:2-3)."
    },
    {
      "pk": 12007012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 12,
      "text": "The king arose at night and said to his servants, 'Let me tell you what the Arameans have done to us. They know we are hungry. Therefore, they have gone out of the camp to hide themselves in the open country, thinking, \"When they come out of the city, we will capture them alive and get into the city.\"'",
      "links": "<a href='/AIV/07/6/35'>Judg. 6:35</a>",
      "comment": "The king’s suspicion exhibits the struggle to trust God’s promises, which is a recurring biblical theme. Slow acceptance of God’s work often delays experiencing the fullness of His blessings."
    },
    {
      "pk": 12007013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 13,
      "text": "One of his servants answered, 'Let some men take five of the remaining horses, since all the rest have perished in the city. Let us send them and see.'",
      "links": "<a href='/AIV/06/2/1'>Josh. 2:1</a>",
      "comment": "The servant encourages cautious investigation. Even a little faith, enacted in works, is shown to be effective—a theme amplified in later Christian teaching (see James 2:17)."
    },
    {
      "pk": 12007014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 14,
      "text": "So they took two chariots with horses, and the king sent them after the army of the Arameans, saying, 'Go and see.'",
      "links": "<a href='/AIV/06/2/1'>Josh. 2:1</a>; <a href='/AIV/12/5/14'>2 Kgs. 5:14</a>",
      "comment": "The king’s response—sending scouts—echoes biblical precedents for sending witnesses. Faith and prudence can coexist in God’s economy."
    },
    {
      "pk": 12007015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 15,
      "text": "They went after them as far as the Jordan. All the way was littered with clothes and equipment, which the Arameans had thrown away in their flight. The messengers returned and told the king.",
      "links": "<a href='/AIV/02/14/25'>Ex. 14:25</a>",
      "comment": "As in the Exodus, the fleeing enemy leaves behind plunder (Ex. 14:25). The deliverance is seen as wholly from God—not from Israel’s power."
    },
    {
      "pk": 12007016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 16,
      "text": "Then the people went out and plundered the camp of the Arameans. So a seah of fine flour sold for a shekel, and two seahs of barley for a shekel, according to the word of the LORD.",
      "links": "<a href='/AIV/12/7/1'>2 Kgs. 7:1</a>",
      "comment": "God’s prophecy is fulfilled exactly as spoken. This underscores the importance of heeding prophetic authority and the reliability of God’s promises—a pattern continued in salvation history."
    },
    {
      "pk": 12007017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 17,
      "text": "Now the king had appointed the officer on whose arm he leaned to be in charge at the gate, but when the people trampled him at the gate, he died, just as the man of God had spoken when the king came down to him.",
      "links": "<a href='/AIV/04/20/12'>Num. 20:12</a>; <a href='/AIV/12/7/2'>2 Kgs. 7:2</a>",
      "comment": "The officer’s fate illustrates the cost of unbelief. The fulfilled prophecy authenticates the divine foundation underlying prophetic teachings—emphasizing the consequences of doubt."
    },
    {
      "pk": 12007018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 18,
      "text": "Just as the man of God had spoken to the king, saying, 'Tomorrow about this time two seahs of barley shall be sold for a shekel, and a seah of fine flour for a shekel, at the gate of Samaria,'",
      "links": "<a href='/AIV/12/7/1'>2 Kgs. 7:1</a>",
      "comment": "This recapitulation stresses the total reliability of God’s word and its fulfillment through His chosen servants."
    },
    {
      "pk": 12007019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 19,
      "text": "the officer had answered the man of God, 'Look, even if the LORD should make windows in the sky, could such a thing be?' And he had said, 'You will see it with your own eyes, but you will not eat of it.'",
      "links": "<a href='/AIV/12/7/2'>2 Kgs. 7:2</a>",
      "comment": "The narrative’s repetition highlights the accountability of human words versus prophetic words and amplifies the lesson that true faith includes trust in God even when events seem impossible."
    },
    {
      "pk": 12007020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 7,
      "verse": 20,
      "text": "It happened to him exactly as the man of God had said to the king. For the people trampled him at the gate, and he died.",
      "links": "<a href='/AIV/12/7/17'>2 Kgs. 7:17</a>",
      "comment": "God’s word is unfailing, and His justice is demonstrated. The danger of rejecting Divine authority is made clear—a lesson also mirrored in the New Testament regarding Christ’s own words and ministry."
    }
  ],
  "translatedAt": "2025-12-24T03:49:18.985Z"
}