{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 3,
  "verses": [
    {
      "pk": 12003001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 1,
      "text": "Joram son of Ahab became king over Israel in Samaria in the eighteenth year of Jehoshaphat king of Judah, and he reigned twelve years.",
      "links": "<a href='/AIV/11/1/17'>1 Kings 1:17</a>; <a href='/AIV/12/1/17'>2 Kings 1:17</a>",
      "comment": "Joram, also called Jehoram, becomes king of Israel during the reign of Jehoshaphat in Judah. This overlap shows the division of the kingdoms but also their interwoven history, setting the stage for later unity through the line of David (cf. <a href='/AIV/40/1/1-16'>Matt 1:1-16</a>)."
    },
    {
      "pk": 12003002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 2,
      "text": "He did what was evil in the eyes of the LORD, but not like his father and mother. He removed the pillar of Baal that his father had made.",
      "links": "<a href='/AIV/11/16/30-33'>1 Kings 16:30–33</a>; <a href='/AIV/12/1/2'>2 Kings 1:2</a>",
      "comment": "Joram was less wicked than Ahab and Jezebel, showing partial reform. Removing the Baal pillar hints at imperfect repentance, yet not full covenant faithfulness as seen in past leaders. Moral complicity continues, pointing to Israel's ongoing need for true renewal."
    },
    {
      "pk": 12003003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 3,
      "text": "But he clung to the sins that Jeroboam son of Nebat had caused Israel to commit; he did not turn away from them.",
      "links": "<a href='/AIV/11/12/28-33'>1 Kings 12:28–33</a>",
      "comment": "Jeroboam's sin refers to the establishment of idolatrous worship at Bethel and Dan. Even partial reform without full conversion retains a legacy of disobedience. This prefigures the call for complete turning to God through a new covenant (cf. <a href='/AIV/40/26/28'>Matt 26:28</a>)."
    },
    {
      "pk": 12003004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 4,
      "text": "Now Mesha king of Moab was a sheep breeder. He regularly paid the king of Israel one hundred thousand lambs, and the wool of one hundred thousand rams.",
      "links": "<a href='/AIV/23/16/1'>Isa 16:1</a>",
      "comment": "Mesha's tribute indicates Israel's dominance over Moab. These tributes also foreshadow the sacrifices and offerings required under the covenant, which find fulfillment in the perfect Lamb offered once for all (<a href='/AIV/43/1/29'>John 1:29</a>)."
    },
    {
      "pk": 12003005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 5,
      "text": "But after Ahab died, the king of Moab rebelled against the king of Israel.",
      "links": "<a href='/AIV/12/1/1'>2 Kings 1:1</a>",
      "comment": "Mesha's rebellion after Ahab's death parallels the instability that follows unfaithful leadership. Faithful leadership brings peace, a theme developed in the New Testament regarding Christ's eternal kingship (cf. <a href='/AIV/42/1/33'>Luke 1:33</a>)."
    },
    {
      "pk": 12003006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 6,
      "text": "So King Joram marched out from Samaria at that time and mustered all Israel.",
      "links": "<a href='/AIV/11/20/27'>1 Kings 20:27</a>",
      "comment": "Joram’s rally of Israel for battle is a common motif, highlighting the need for unity in the face of threat. True unity is later fully realized only in the assembly of all believers under the new covenant."
    },
    {
      "pk": 12003007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 7,
      "text": "He also sent word to Jehoshaphat king of Judah: 'The king of Moab has rebelled against me. Will you go with me to fight against Moab?' And he answered, 'I will go; I am as you are, my people as your people, my horses as your horses.'",
      "links": "<a href='/AIV/11/22/4'>1 Kings 22:4</a>",
      "comment": "Jehoshaphat’s unity reflects the ideal cooperation among God’s people, foreshadowing deeper Christian unity. This verse highlights the principle of solidarity within God’s plan."
    },
    {
      "pk": 12003008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 8,
      "text": "Then he said, 'By which way shall we go up?' And he answered, 'By the way of the wilderness of Edom.'",
      "links": "<a href='/AIV/04/20/14-21'>Numbers 20:14–21</a>",
      "comment": "Choosing the route through Edom recalls Israel’s past journeyings. Israel’s history often involves movement through deserts—prefiguring spiritual trials and purification."
    },
    {
      "pk": 12003009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 9,
      "text": "So the king of Israel, the king of Judah, and the king of Edom set out, and after a roundabout march of seven days, there was no water for the army or for the animals that followed them.",
      "links": "<a href='/AIV/02/17/1'>Exodus 17:1</a>",
      "comment": "The lack of water emphasizes dependence on God’s providence. This also foreshadows the motif of spiritual thirst, ultimately quenched by Christ (see <a href='/AIV/43/4/10-14'>John 4:10–14</a>)."
    },
    {
      "pk": 12003010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 10,
      "text": "Then the king of Israel said, 'Alas! The LORD has called these three kings to give them into the hand of Moab.'",
      "links": "<a href='/AIV/12/6/33'>2 Kings 6:33</a>",
      "comment": "Joram mistakenly blames God for their predicament, a common misconception when faith wavers. True faith trusts God even in desolation—a principle elaborated in later teaching."
    },
    {
      "pk": 12003011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 11,
      "text": "But Jehoshaphat said, 'Is there no prophet of the LORD here, through whom we may inquire of the LORD?' Then one of the king of Israel’s servants answered, 'Elisha the son of Shaphat is here, who poured water on the hands of Elijah.'",
      "links": "<a href='/AIV/12/2/9'>2 Kings 2:9</a>; <a href='/AIV/11/19/16'>1 Kings 19:16</a>",
      "comment": "Jehoshaphat seeks a true prophet, emphasizing God’s guidance is provided through appointed mediators. Elisha, Elijah’s successor, demonstrates apostolic succession—a principle later developed fully in the unity, authority, and teaching office of the Church (cf. <a href='/AIV/40/16/18-19'>Matthew 16:18–19</a>)."
    },
    {
      "pk": 12003012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 12,
      "text": "Jehoshaphat said, 'The word of the LORD is with him.' So the king of Israel, Jehoshaphat, and the king of Edom went down to him.",
      "links": "<a href='/AIV/12/2/15'>2 Kings 2:15</a>",
      "comment": "True authority is recognized by the authentic transmission of God’s word. Jehoshaphat’s desire for God’s counsel models proper deference to spiritual authority."
    },
    {
      "pk": 12003013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 13,
      "text": "And Elisha said to the king of Israel, 'What have I to do with you? Go to the prophets of your father and your mother.' But the king of Israel said to him, 'No, for the LORD has called these three kings to give them into the hand of Moab.'",
      "links": "<a href='/AIV/11/18/19'>1 Kings 18:19</a>",
      "comment": "Elisha’s rebuke reflects God’s displeasure with idolatry. However, in true need, even those who have strayed may seek God through his chosen servants."
    },
    {
      "pk": 12003014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 14,
      "text": "Elisha said, 'As the LORD of hosts lives, before whom I stand, were it not that I respect Jehoshaphat king of Judah, I would not look at you nor see you.'",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/02/33/12-17'>Exodus 33:12–17</a>",
      "comment": "Elisha’s respect for Jehoshaphat reveals how God honors the faithfulness of his saints. The concept of intercession is present here, as blessing comes for the sake of the righteous."
    },
    {
      "pk": 12003015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 15,
      "text": "But now bring me a musician.' And as the musician played, the hand of the LORD came upon Elisha.",
      "links": "<a href='/AIV/09/10/5-10'>1 Samuel 10:5–10</a>; <a href='/AIV/13/25/1-6'>1 Chronicles 25:1–6</a>",
      "comment": "Music prepares Elisha to receive the Spirit of prophecy, showing how liturgy and worship help us to be receptive to God. This prefigures the sacramental nature of worship, where external means prompt internal grace."
    },
    {
      "pk": 12003016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 16,
      "text": "And he said, 'Thus says the LORD, “Make this valley full of trenches.”'",
      "links": "<a href='/AIV/07/7/16'>Judges 7:16</a>",
      "comment": "Digging trenches requires faith that God will fill them. Human cooperation with divine command is needed—an example of synergy between human effort and God’s grace."
    },
    {
      "pk": 12003017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 17,
      "text": "'For thus says the LORD, “You shall not see wind or rain, but that valley shall be filled with water, so that you, your livestock, and your animals may drink.”'",
      "links": "<a href='/AIV/02/17/6'>Exodus 17:6</a>; <a href='/AIV/04/20/11'>Numbers 20:11</a>",
      "comment": "God miraculously provides water in the desert, a motif seen throughout Scripture (cf. <a href='/AIV/43/7/37-38'>John 7:37–38</a>). This points to God’s supernatural provision for his people."
    },
    {
      "pk": 12003018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 18,
      "text": "'This is a light thing in the sight of the LORD. He will also deliver the Moabites into your hand.'",
      "links": "<a href='/AIV/01/18/14'>Genesis 18:14</a>; <a href='/AIV/10/7/18'>2 Samuel 7:18–19</a>",
      "comment": "The ease by which God accomplishes such wonders shows his sovereign power. No obstacle is too great for God, which should inspire trust in his promises."
    },
    {
      "pk": 12003019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 19,
      "text": "'And you shall attack every fortified city, every choice city, fell every good tree, stop up all springs of water, and ruin every good piece of land with stones.'",
      "links": "<a href='/AIV/05/20/19-20'>Deuteronomy 20:19–20</a>",
      "comment": "God commands total victory, but the destruction also points to divine justice. It is both a warning against rebellion and a precursor to the new era where mercy and justice meet in Christ."
    },
    {
      "pk": 12003020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 20,
      "text": "The next morning, about the time for offering the sacrifice, water came from the direction of Edom, and the country was filled with water.",
      "links": "<a href='/AIV/02/29/38-39'>Exodus 29:38–39</a>; <a href='/AIV/12/3/17'>2 Kings 3:17</a>",
      "comment": "The timing of God’s provision with the morning sacrifice foreshadows the liturgical principle that grace often accompanies acts of worship and sacrificial offering. The power of corporate prayer and liturgical action is emphasized here."
    },
    {
      "pk": 12003021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 21,
      "text": "When all Moab heard that the kings had come up to fight against them, all who were able to bear arms, young and old, were summoned and stood on the border.",
      "links": "<a href='/AIV/06/8/16'>Joshua 8:16</a>",
      "comment": "Moab’s total mobilization reflects the seriousness of the conflict. The gathering of all ages presents an image of total engagement, which can be viewed spiritually as the assembly of all God's people for spiritual battle."
    },
    {
      "pk": 12003022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 22,
      "text": "They rose up early in the morning, and the sun was shining on the water. The Moabites saw the water opposite them as red as blood.",
      "links": "<a href='/AIV/02/7/20'>Exodus 7:20</a>",
      "comment": "The red water appears like blood, evoking images of judgment and also anticipating the efficacious blood of sacrifice. Such imagery finds deeper fulfillment in the blood of the true Paschal Lamb."
    },
    {
      "pk": 12003023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 23,
      "text": "And they said, 'This is blood! The kings have surely fought together and killed one another. Now, Moab, to the spoil!'",
      "links": "<a href='/AIV/07/7/22'>Judges 7:22</a>",
      "comment": "The Moabites misinterpret what they see, acting on misconception. This points to the danger of false interpretation—a lesson for seeking the fullness of truth revealed through God’s chosen means."
    },
    {
      "pk": 12003024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 24,
      "text": "But when they came to the camp of Israel, the Israelites arose and struck the Moabites, so that they fled before them; and Israel pursued them, striking the Moabites as they went.",
      "links": "<a href='/AIV/06/8/21-24'>Joshua 8:21–24</a>",
      "comment": "Israel’s victory results from obedience to God’s word. This prefigures the triumph of the faithful over error through God’s guidance."
    },
    {
      "pk": 12003025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 25,
      "text": "They overthrew the cities, and on every good piece of land, each man threw a stone until it was covered. They stopped up all the springs of water and felled all the good trees. Only in Kir-hareseth did the stones remain, but the slingers surrounded and attacked it.",
      "links": "<a href='/AIV/23/16/7'>Isaiah 16:7</a>",
      "comment": "The total destruction matches God’s command. This severe judgment serves as a warning of the consequences of resisting God’s will."
    },
    {
      "pk": 12003026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 26,
      "text": "When the king of Moab saw that the battle was too fierce for him, he took with him seven hundred men who drew swords to break through to the king of Edom, but they could not.",
      "links": "<a href='/AIV/19/33/16'>Psalm 33:16</a>",
      "comment": "Human strength and desperate measures cannot prevail when God has decreed otherwise. Dependence on God's will is essential—a lesson present throughout both Old and New Testaments."
    },
    {
      "pk": 12003027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 3,
      "verse": 27,
      "text": "Then he took his firstborn son, who was to reign in his place, and offered him as a burnt offering on the wall. And there was great wrath against Israel, and they withdrew from him and returned to their own land.",
      "links": "<a href='/AIV/07/11/31'>Judges 11:31</a>; <a href='/AIV/12/21/6'>2 Kings 21:6</a>",
      "comment": "The horrific sacrifice by the king of Moab results in a mysterious wrath against Israel. Human sacrifices are condemned in the law (<a href='/AIV/03/18/21'>Leviticus 18:21</a>), yet this event warns of the grave consequences of idolatry and false worship, contrasting with the one perfect and unbloody sacrifice that brings reconciliation and peace. The withdrawal of Israel foreshadows how incomplete obedience or imperfect fidelity leads to setbacks in spiritual battle. Spiritually, it points to the necessity of true worship and reliance on God's means for grace."
    }
  ],
  "translatedAt": "2025-12-24T03:43:58.785Z"
}