{
  "book": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 20,
  "verses": [
    {
      "pk": 4012001,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 1,
      "text": "In those days Hezekiah became sick, to the point of death. And Isaiah the son of Amoz, the prophet, came to him and said, “This is what the Lord says: Set your house in order, for you are going to die; you will not recover.”",
      "links": "<a href='/AIV/23/38/1'>Isa. 38:1</a>; <a href='/AIV/14/32/24'>2 Chr. 32:24</a>",
      "comment": "Phrase 'set your house in order' translates the Hebrew literally, indicating making final arrangements before death."
    },
    {
      "pk": 4012002,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 2,
      "text": "Then Hezekiah turned his face to the wall and prayed to the Lord,",
      "links": "<a href='/AIV/19/102/24'>Ps. 102:24</a>",
      "comment": "Turning to the wall shows his earnest appeal to God, withdrawing from others."
    },
    {
      "pk": 4012003,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 3,
      "text": "\"O Lord, remember how I have walked before you faithfully and with a loyal heart, and have done what is good in your eyes.\" And Hezekiah wept bitterly.",
      "links": "<a href='/AIV/19/26/3'>Ps. 26:3</a>; <a href='/AIV/19/56/8'>Ps. 56:8</a>",
      "comment": "\"Loyal heart\" is a literal rendering of the Hebrew for 'wholeheartedly.'"
    },
    {
      "pk": 4012004,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 4,
      "text": "Before Isaiah had left the middle court, the word of the Lord came to him:",
      "links": "<a href='/AIV/23/38/4'>Isa. 38:4</a>",
      "comment": "‘Middle court’ is literal; some manuscripts say ‘city.’"
    },
    {
      "pk": 4012005,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 5,
      "text": "\"Go back and say to Hezekiah, the leader of my people, 'This is what the Lord, the God of David your father, says: I have heard your prayer, I have seen your tears; surely I will heal you. On the third day from now, you will go up to the house of the Lord.'\"",
      "links": "<a href='/AIV/19/39/12'>Ps. 39:12</a>; <a href='/AIV/23/38/5'>Isa. 38:5</a>",
      "comment": "The phrase 'third day you will go up' is a literal rendering, expressing precise timing."
    },
    {
      "pk": 4012006,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 6,
      "text": "\"I will add fifteen years to your life. And I will deliver you and this city from the hand of the king of Assyria. I will defend this city for my own sake, and for my servant David’s sake.\"",
      "links": "<a href='/AIV/12/19/34'>2 Kgs. 19:34</a>; <a href='/AIV/23/38/6'>Isa. 38:6</a>",
      "comment": "No significant departures in meaning. 'Fifteen years' is a numerically accurate translation."
    },
    {
      "pk": 4012007,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 7,
      "text": "Then Isaiah said, \"Take a cake of figs.\" So they took one and laid it on the boil, and he recovered.",
      "links": "<a href='/AIV/23/38/21'>Isa. 38:21</a>",
      "comment": "The Hebrew idiom 'cake of figs' is preserved; this was a natural remedy."
    },
    {
      "pk": 4012008,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 8,
      "text": "Hezekiah said to Isaiah, \"What will be the sign that the Lord will heal me, and that I shall go up to the house of the Lord on the third day?\"",
      "links": "<a href='/AIV/23/38/22'>Isa. 38:22</a>",
      "comment": "No significant variance."
    },
    {
      "pk": 4012009,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 9,
      "text": "Isaiah answered, \"This will be the sign from the Lord to you, that the Lord will do what he has promised: Shall the shadow go forward ten steps or go back ten steps?\"",
      "links": "<a href='/AIV/23/38/7-8'>Isa. 38:7–8</a>",
      "comment": "\"Ten steps\" is a literal rendering of the Hebrew, commonly understood as steps or degrees."
    },
    {
      "pk": 4012010,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 10,
      "text": "Hezekiah replied, \"It is an easy thing for the shadow to go forward ten steps; but let the shadow go back ten steps.\"",
      "links": "",
      "comment": "Retains literal language of the sign being more remarkable in reversal."
    },
    {
      "pk": 4012011,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 11,
      "text": "Then Isaiah the prophet called out to the Lord, and he made the shadow go back ten steps on the steps of Ahaz which it had gone down.",
      "links": "<a href='/AIV/23/38/8'>Isa. 38:8</a>",
      "comment": "'Steps of Ahaz' is a direct translation; possibly a stair-shaped sundial."
    },
    {
      "pk": 4012012,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 12,
      "text": "At that time Merodach-baladan, the son of Baladan, king of Babylon, sent letters and a gift to Hezekiah, for he had heard that Hezekiah had been sick.",
      "links": "<a href='/AIV/23/39/1'>Isa. 39:1</a>",
      "comment": "Name 'Merodach-baladan' is phonetically close to the Hebrew original."
    },
    {
      "pk": 4012013,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 13,
      "text": "And Hezekiah received the envoys and showed them all his treasure house—the silver, the gold, the spices, the precious oil, his armory, and all that was found among his treasuries. There was nothing in his house or in all his realm that Hezekiah did not show them.",
      "links": "<a href='/AIV/23/39/2'>Isa. 39:2</a>",
      "comment": "‘Precious oil’ likely refers to a valuable scented ointment or balm."
    },
    {
      "pk": 4012014,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 14,
      "text": "Then Isaiah the prophet came to King Hezekiah and asked him, “What did these men say? And from where did they come to you?” Hezekiah answered, “They came from a far country, from Babylon.”",
      "links": "<a href='/AIV/23/39/3'>Isa. 39:3</a>",
      "comment": "No significant changes."
    },
    {
      "pk": 4012015,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 15,
      "text": "He said, \"What have they seen in your house?\" Hezekiah answered, \"They have seen everything in my house. There is nothing among my treasuries that I did not show them.\"",
      "links": "<a href='/AIV/23/39/4'>Isa. 39:4</a>",
      "comment": "'Treasuries' is literal; no inclusive or explanatory changes."
    },
    {
      "pk": 4012016,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 16,
      "text": "Then Isaiah said to Hezekiah, \"Hear the word of the Lord:",
      "links": "<a href='/AIV/23/39/5'>Isa. 39:5</a>",
      "comment": "No significant differences."
    },
    {
      "pk": 4012017,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 17,
      "text": "\"The days are coming when everything in your house, and everything your ancestors have stored up to this day, will be carried off to Babylon. Nothing will be left, says the Lord.",
      "links": "<a href='/AIV/23/39/6'>Isa. 39:6</a>; <a href='/AIV/27/1/2'>Dan. 1:2</a>",
      "comment": "'Everything' and 'nothing' are literal, emphasizing total loss."
    },
    {
      "pk": 4012018,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 18,
      "text": "\"And some of your own descendants, who will come from you, whom you will father, will be taken away, and they will become eunuchs in the palace of the king of Babylon.\"",
      "links": "<a href='/AIV/23/39/7'>Isa. 39:7</a>; <a href='/AIV/27/1/3'>Dan. 1:3</a>",
      "comment": "‘Eunuchs’ is a literal translation of the Hebrew ‘sarisim’, meaning officials, often castrated."
    },
    {
      "pk": 4012019,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 19,
      "text": "Then Hezekiah said to Isaiah, \"The word of the Lord that you have spoken is good.\" For he thought, \"Why not, if there will be peace and truth in my days?\"",
      "links": "<a href='/AIV/23/39/8'>Isa. 39:8</a>",
      "comment": "'Peace and truth' is literal; ‘truth’ also means stability or security."
    },
    {
      "pk": 4012020,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 20,
      "text": "Now the rest of the acts of Hezekiah—all his power, and how he made the pool and the tunnel and brought water into the city—are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/32/32'>2 Chr. 32:32</a>",
      "comment": "'Book of the Chronicles of the Kings of Judah' is a literal title of the now-lost historical record."
    },
    {
      "pk": 4012021,
      "translation": "AIV",
      "book": 12,
      "chapter": 20,
      "verse": 21,
      "text": "And Hezekiah slept with his fathers, and Manasseh his son became king in his place.",
      "links": "<a href='/AIV/14/32/33'>2 Chr. 32:33</a>",
      "comment": "'Slept with his fathers' is a literal and traditional Hebrew idiom for death."
    }
  ],
  "translatedAt": "2025-12-22T10:42:42.915Z"
}