{
  "book": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 3,
  "verses": [
    {
      "pk": 2003201,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 1,
      "text": "Joram son of Ahab became king over Israel in Samaria in the eighteenth year of Jehoshaphat king of Judah, and he reigned twelve years.",
      "links": "<a href='/AIV/11/22/51'>1 Kings 22:51</a>; <a href='/AIV/14/20/31'>2 Chron. 20:31</a>",
      "comment": "Follows the typical formula for introducing a new king; Joram is another spelling of Jehoram."
    },
    {
      "pk": 2003202,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 2,
      "text": "He did what was evil in the sight of the LORD, but not like his father and mother; for he removed the pillar of Baal that his father had made.",
      "links": "<a href='/AIV/11/16/30-32'>1 Kings 16:30-32</a>; <a href='/AIV/11/21/25-26'>1 Kings 21:25-26</a>",
      "comment": "The text distinguishes Joram's evil from his parents', noting some limited reform."
    },
    {
      "pk": 2003203,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 3,
      "text": "Nevertheless, he clung to the sins of Jeroboam son of Nebat, which he made Israel commit; he did not turn away from them.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kings 12:28-30</a>; <a href='/AIV/12/10/29'>2 Kings 10:29</a>",
      "comment": "The reference is to continued idol worship set up by Jeroboam."
    },
    {
      "pk": 2003204,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 4,
      "text": "Now Mesha king of Moab was a sheep breeder. He would pay the king of Israel a hundred thousand lambs and the wool of a hundred thousand rams as tribute.",
      "links": "<a href='/AIV/23/16/1'>Isa. 16:1</a>; <a href='/AIV/12/1/1'>2 Kings 1:1</a>",
      "comment": "Mesha’s tribute is described in terms of livestock, reflecting the economy of the time."
    },
    {
      "pk": 2003205,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 5,
      "text": "But when Ahab died, the king of Moab rebelled against the king of Israel.",
      "links": "<a href='/AIV/12/1/1'>2 Kings 1:1</a>",
      "comment": "This sets the context for the conflict."
    },
    {
      "pk": 2003206,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 6,
      "text": "So King Joram went out from Samaria at that time and mustered all Israel.",
      "links": "<a href='/AIV/12/6/24'>2 Kings 6:24</a>",
      "comment": "‘Mustered all Israel’ means assembling the army."
    },
    {
      "pk": 2003207,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 7,
      "text": "Then he went and sent word to Jehoshaphat king of Judah, saying, “The king of Moab has rebelled against me. Will you go with me to fight against Moab?” He replied, “I will go. I am as you are, my people as your people, my horses as your horses.”",
      "links": "<a href='/AIV/11/22/4'>1 Kings 22:4</a>",
      "comment": "Jehoshaphat’s response expresses solidarity, echoing earlier cooperation."
    },
    {
      "pk": 2003208,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 8,
      "text": "Then he asked, “By which way shall we go up?” He answered, “By the way of the wilderness of Edom.”",
      "links": "<a href='/AIV/11/22/47'>1 Kings 22:47</a>",
      "comment": "The army would approach Moab from the south, through Edom."
    },
    {
      "pk": 2003209,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 9,
      "text": "So the king of Israel went, and the king of Judah, and the king of Edom; and they marched on that roundabout route seven days, but there was no water for the army or for the animals that followed them.",
      "links": "<a href='/AIV/12/3/18'>2 Kings 3:18</a>",
      "comment": "The Edomite king joins their coalition."
    },
    {
      "pk": 2003210,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 10,
      "text": "Then the king of Israel said, “Alas! The LORD has called these three kings to deliver them into the hand of Moab.”",
      "links": "<a href='/AIV/12/6/33'>2 Kings 6:33</a>",
      "comment": "Joram expresses despair, blaming God for their predicament."
    },
    {
      "pk": 2003211,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 11,
      "text": "But Jehoshaphat said, “Is there no prophet of the LORD here, through whom we may inquire of the LORD?” One of the king of Israel’s servants answered, “Elisha son of Shaphat is here, who used to pour water on the hands of Elijah.”",
      "links": "<a href='/AIV/12/2/25'>2 Kings 2:25</a>; <a href='/AIV/11/19/16'>1 Kings 19:16</a>",
      "comment": "‘Pour water on the hands’ means serving as Elijah’s assistant."
    },
    {
      "pk": 2003212,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 12,
      "text": "And Jehoshaphat said, “The word of the LORD is with him.” So the king of Israel, Jehoshaphat, and the king of Edom went down to him.",
      "links": "<a href='/AIV/12/2/14'>2 Kings 2:14-15</a>",
      "comment": "All three kings approach Elisha for guidance."
    },
    {
      "pk": 2003213,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 13,
      "text": "Elisha said to the king of Israel, “What have I to do with you? Go to the prophets of your father and mother.” But the king of Israel said to him, “No, for the LORD has called these three kings to deliver them into the hand of Moab.”",
      "links": "<a href='/AIV/12/1/2'>2 Kings 1:2</a>",
      "comment": "Elisha objects, referencing the idolatrous prophets of Ahab and Jezebel."
    },
    {
      "pk": 2003214,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 14,
      "text": "And Elisha said, “As the LORD of hosts lives, before whom I stand, were it not that I have regard for Jehoshaphat king of Judah, I would not look at you or see you.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/12/5/16'>2 Kings 5:16</a>",
      "comment": "Elisha’s respect for Jehoshaphat brings God’s word to them."
    },
    {
      "pk": 2003215,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 15,
      "text": "But now bring me a musician.” And when the musician played, the hand of the LORD came upon him.",
      "links": "<a href='/AIV/9/10/5'>1 Samuel 10:5-6</a>; <a href='/AIV/12/2/15'>2 Kings 2:15</a>",
      "comment": "Music accompanies prophetic inspiration."
    },
    {
      "pk": 2003216,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 16,
      "text": "He said, “Thus says the LORD: ‘Make this valley full of ditches.’",
      "links": "<a href='/AIV/12/4/3'>2 Kings 4:3</a>",
      "comment": "‘Ditches’ refers to trenches or pits to hold water."
    },
    {
      "pk": 2003217,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 17,
      "text": "For thus says the LORD: ‘You will not see wind or rain, yet this valley will be filled with water, so that you and your animals and your livestock may drink.’",
      "links": "<a href='/AIV/2/17/6'>Ex. 17:6</a>; <a href='/AIV/7/6/37-40'>Judg. 6:37-40</a>",
      "comment": "God promises a miraculous provision of water."
    },
    {
      "pk": 2003218,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 18,
      "text": "This is a light thing in the sight of the LORD. He will also give the Moabites into your hand.",
      "links": "<a href='/AIV/12/20/20'>2 Chron. 20:20</a>",
      "comment": "God affirms victory will be easy for Him."
    },
    {
      "pk": 2003219,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 19,
      "text": "You shall attack every fortified city and every choice city, and cut down every good tree, stop up all springs of water, and ruin every good piece of land with stones.”",
      "links": "<a href='/AIV/5/20/19-20'>Deut. 20:19-20</a>",
      "comment": "Note: Deut. 20:19 prohibits destroying fruit trees; here, total destruction is commanded in judgment."
    },
    {
      "pk": 2003220,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 20,
      "text": "And in the morning, about the time of the offering of the sacrifice, water came by the way of Edom, and the land was filled with water.",
      "links": "<a href='/AIV/2/29/39'>Ex. 29:39</a>",
      "comment": "‘The offering of the sacrifice’ refers to the regular morning sacrifice in Jerusalem."
    },
    {
      "pk": 2003221,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 21,
      "text": "When all the Moabites heard that the kings had come up to fight against them, all who were able to bear arms, both younger and older, were called up and stood on the border.",
      "links": "",
      "comment": "Moab mobilizes all available men for war."
    },
    {
      "pk": 2003222,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 22,
      "text": "But when they rose early in the morning and the sun shone on the water, the Moabites saw the water opposite them as red as blood.",
      "links": "",
      "comment": "The water appeared red, possibly due to sunrise or the color of the soil."
    },
    {
      "pk": 2003223,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 23,
      "text": "And they said, “This is blood! The kings have surely fought and killed one another. Now, Moab, to the spoil!”",
      "links": "",
      "comment": "The Moabites think the coalition armies have slaughtered each other."
    },
    {
      "pk": 2003224,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 24,
      "text": "But when they came to the camp of Israel, Israel rose up and struck down the Moabites, so that they fled before them. And they went forward, slaughtering the Moabites.",
      "links": "",
      "comment": "The Moabites are ambushed by Israel’s army."
    },
    {
      "pk": 2003225,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 25,
      "text": "They destroyed the cities, and each man threw a stone onto every good piece of land and filled it. They stopped up all the springs of water and cut down all the good trees. Only at Kir-hareseth did the stones remain, but the slingers surrounded it and attacked it.",
      "links": "<a href='/AIV/23/16/7'>Isaiah 16:7</a>",
      "comment": "Describes the fulfillment of the prophetic command for judgment on Moab."
    },
    {
      "pk": 2003226,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 26,
      "text": "When the king of Moab saw that the battle was too fierce for him, he took with him seven hundred men with swords to break through to the king of Edom, but they could not.",
      "links": "<a href='/AIV/7/7/16-22'>Judg. 7:16–22</a>",
      "comment": "Describes Moab’s failed attempt to escape or turn the battle."
    },
    {
      "pk": 2003227,
      "translation": "AIV",
      "book": 12,
      "chapter": 3,
      "verse": 27,
      "text": "Then he took his firstborn son, who was to reign in his place, and offered him as a burnt offering on the wall. And there was great wrath against Israel, so they withdrew from him and returned to their own land.",
      "links": "<a href='/AIV/5/18/10'>Deut. 18:10</a>; <a href='/AIV/12/16/3'>2 Kings 16:3</a>",
      "comment": "The meaning of ‘great wrath’ is debated: it may mean divine wrath or Moabite rage. The horror of child sacrifice is clear."
    }
  ],
  "translatedAt": "2025-12-22T10:10:35.943Z"
}