{
  "book": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 7,
  "verses": [
    {
      "pk": 270701,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 1,
      "text": "Elisha said, 'Hear the word of the LORD. This is what the LORD says: Tomorrow about this time, a seah of fine flour will be sold for a shekel, and two seahs of barley for a shekel, at the gate of Samaria.'",
      "links": "<a href='/ESV/10/12/9'>2 Sam. 12:9</a>; <a href='/ESV/12/6/25'>2 Kgs. 6:25</a>",
      "comment": "A seah is about 7 liters. This preserves biblical currency and measurement terms."
    },
    {
      "pk": 270702,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 2,
      "text": "Then the officer, on whose arm the king leaned, answered the man of God, 'Even if the LORD made windows in heaven, could this thing happen?' Elisha replied, 'Look, you will see it with your own eyes, but you will not eat any of it.'",
      "links": "<a href='/AIV/12/5/18'>2 Kgs. 5:18</a>; <a href='/ESV/14/7/13'>2 Chr. 7:13</a>",
      "comment": "Kept the idiom 'windows in heaven' as a literal rendering."
    },
    {
      "pk": 270703,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 3,
      "text": "Now there were four men with leprosy at the entrance of the city gate. They said to each other, 'Why stay here until we die?'",
      "links": "<a href='/AIV/3/13/46'>Lev. 13:46</a>; <a href='/ESV/12/15/5'>2 Kgs. 15:5</a>",
      "comment": "Leprosy refers to a range of skin diseases, as in the original Hebrew."
    },
    {
      "pk": 270704,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 4,
      "text": "'If we say, “Let’s go into the city,” the famine is there, and we will die. If we stay here, we will also die. So let’s go over to the camp of the Arameans and surrender. If they let us live, we’ll live; if they kill us, we’ll die.'",
      "links": "<a href='/AIV/12/6/25'>2 Kgs. 6:25</a>",
      "comment": "Arameans here translates the Hebrew term often rendered 'Syrians.'"
    },
    {
      "pk": 270705,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 5,
      "text": "So at twilight they got up to go to the camp of the Arameans. But when they reached the outskirts of the camp, there was no one there.",
      "links": "<a href='/AIV/12/19/35'>2 Kgs. 19:35</a>",
      "comment": "The time reference 'twilight' matches original intent and setting."
    },
    {
      "pk": 270706,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 6,
      "text": "For the LORD had caused the Aramean army to hear the sound of chariots and horses—the sound of a great army—so they said to each other, 'Look, the king of Israel has hired the kings of the Hittites and the kings of Egypt to attack us!'",
      "links": "<a href='/AIV/19/68/35'>Ps. 68:35</a>; <a href='/AIV/12/19/7'>2 Kgs. 19:7</a>",
      "comment": "Kept the listing of 'Hittites and Egypt' as in the Hebrew text."
    },
    {
      "pk": 270707,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 7,
      "text": "So they got up and fled at twilight, abandoning their tents, their horses, and their donkeys—the camp as it was—and ran for their lives.",
      "links": "<a href='/AIV/7/7/21'>Judg. 7:21</a>",
      "comment": "Preserved original order of items left behind by fleeing army."
    },
    {
      "pk": 270708,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 8,
      "text": "When these lepers came to the edge of the camp, they went into one tent and ate and drank. Then they took silver, gold, and clothes and went out and hid them. Then they came back, entered another tent, and took things from it and hid them also.",
      "links": "<a href='/AIV/6/7/21'>Josh. 7:21</a>",
      "comment": "Expanded 'they ate and drank' for clarity, rest consistent with the Hebrew."
    },
    {
      "pk": 270709,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 9,
      "text": "Then they said to each other, 'We are not doing what is right. This is a day of good news, and we are keeping it to ourselves. If we wait until morning light, we will be found guilty. Let’s go now and tell the king’s household.'",
      "links": "<a href='/AIV/12/5/26'>2 Kgs. 5:26</a>",
      "comment": "Good news here translates the Hebrew word for 'gospel' or 'news.'"
    },
    {
      "pk": 270710,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 10,
      "text": "So they went and called to the gatekeepers of the city and told them, 'We went to the camp of the Arameans, and no one was there—not a sound of anyone. Only the horses and donkeys were still tied up, and the tents left just as they were.'",
      "links": "<a href='/AIV/12/7/7'>2 Kgs. 7:7</a>",
      "comment": "Kept the sequence and wording close to the original narrative."
    },
    {
      "pk": 270711,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 11,
      "text": "The gatekeepers called out, and the message was reported inside the king’s house.",
      "links": "<a href='/AIV/12/6/30'>2 Kgs. 6:30</a>",
      "comment": "Simple rendering, matching succinctness of Hebrew."
    },
    {
      "pk": 270712,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 12,
      "text": "The king got up in the night and said to his servants, 'I will tell you what the Arameans have done to us. They know we are hungry, so they have left the camp to hide in the fields, thinking, “When they come out of the city, we will capture them alive and get into the city.”'",
      "links": "<a href='/AIV/12/6/31'>2 Kgs. 6:31</a>",
      "comment": "Kept the king speaking in direct speech as per original text."
    },
    {
      "pk": 270713,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 13,
      "text": "One of his servants answered, 'Let us take five of the remaining horses—those that are left here. See, they are just like all the multitude of Israel who are left here; and they are like all the multitude of Israel who have perished. Let us send them and see.'",
      "links": "<a href='/AIV/12/14/14'>2 Kgs. 14:14</a>",
      "comment": "Retained the somewhat convoluted language, as in original."
    },
    {
      "pk": 270714,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 14,
      "text": "So they took two chariots with horses, and the king sent them after the army of the Arameans, saying, 'Go and see.'",
      "links": "<a href='/AIV/12/8/9'>2 Kgs. 8:9</a>",
      "comment": "The text varies about the number of horses. Here, 'two chariots with horses' follows most manuscripts."
    },
    {
      "pk": 270715,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 15,
      "text": "They went after them as far as the Jordan, and all along the way were garments and equipment the Arameans had thrown away in their haste. The messengers returned and told the king.",
      "links": "<a href='/AIV/7/8/24-25'>Judg. 8:24–25</a>",
      "comment": "Jordan refers to the Jordan River."
    },
    {
      "pk": 270716,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 16,
      "text": "Then the people went out and plundered the camp of the Arameans. So a seah of fine flour was sold for a shekel, and two seahs of barley for a shekel, just as the LORD had said.",
      "links": "<a href='/AIV/12/7/1'>2 Kgs. 7:1</a>",
      "comment": "Affirms literal fulfillment of prophecy, matching first verse."
    },
    {
      "pk": 270717,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 17,
      "text": "Now the king had appointed the officer, on whose arm he leaned, to have charge of the gate. But the people trampled him in the gate, and he died, just as the man of God had spoken when the king came down to him.",
      "links": "<a href='/AIV/12/7/2'>2 Kgs. 7:2</a>",
      "comment": "Kept literal rendering of 'trampled,' as in the original."
    },
    {
      "pk": 270718,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 18,
      "text": "It happened just as the man of God had spoken to the king, 'Two seahs of barley shall be sold for a shekel, and a seah of fine flour for a shekel, tomorrow about this time at the gate of Samaria.'",
      "links": "<a href='/AIV/12/7/1'>2 Kgs. 7:1</a>",
      "comment": "Quoted prophecy links directly back to verse 1."
    },
    {
      "pk": 270719,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 19,
      "text": "The officer had replied to the man of God, 'Even if the LORD made windows in heaven, could such a thing be?' And the man of God had said, 'You will see it with your own eyes, but you will not eat any of it.'",
      "links": "<a href='/AIV/12/7/2'>2 Kgs. 7:2</a>",
      "comment": "Directs explicitly back to the earlier exchange for clarity."
    },
    {
      "pk": 270720,
      "translation": "AIV",
      "book": 12,
      "chapter": 7,
      "verse": 20,
      "text": "And so it happened to him, for the people trampled him in the gate, and he died.",
      "links": "<a href='/AIV/12/7/17'>2 Kgs. 7:17</a>",
      "comment": "Briefer summary, matching the abrupt close of the chapter in the original."
    }
  ],
  "translatedAt": "2025-12-22T10:12:25.686Z"
}