{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 21,
  "verses": [
    {
      "pk": 12021001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 1,
      "text": "Manasseh was twelve years old when he became king, and he reigned in Jerusalem fifty-five years. His mother’s name was Hephzibah.",
      "links": "<a href='/AIV/14/33/1'>2 Chron. 33:1</a>",
      "comment": "Manasseh’s lengthy reign marks one of the darkest periods in Judah’s spiritual history. His mother’s name being mentioned highlights the influence of royal mothers."
    },
    {
      "pk": 12021002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 2,
      "text": "He did what was evil in the eyes of the LORD, following the abominations of the nations whom the LORD drove out before the Israelites.",
      "links": "<a href='/AIV/03/18/3'>Lev. 18:3</a>; <a href='/AIV/12/17/8'>2 Kgs. 17:8</a>",
      "comment": "Manasseh’s actions are directly compared to the earlier pagan nations. Spiritual imitation of the world is repeatedly condemned throughout Scripture."
    },
    {
      "pk": 12021003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 3,
      "text": "He rebuilt the high places that his father Hezekiah had torn down, and he set up altars for Baal, made an Asherah pole as Ahab king of Israel had done, and worshiped all the host of heaven and served them.",
      "links": "<a href='/AIV/12/18/4'>2 Kgs. 18:4</a>; <a href='/AIV/11/16/33'>1 Kgs. 16:33</a>",
      "comment": "Manasseh undoes his father’s reforms, signaling a rejection of the covenant and a preference for syncretism, something condemned by biblical teaching."
    },
    {
      "pk": 12021004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 4,
      "text": "He built altars in the house of the LORD, of which the LORD had said, 'In Jerusalem I will put My name.'",
      "links": "<a href='/AIV/11/8/29'>1 Kgs. 8:29</a>; <a href='/AIV/05/12/5'>Deut. 12:5</a>",
      "comment": "Placing foreign altars in God's temple defiles the sanctuary—contrast with the consistent biblical message of God choosing a singular place for His Name and worship."
    },
    {
      "pk": 12021005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 5,
      "text": "For all the host of heaven he built altars in the two courts of the house of the LORD.",
      "links": "<a href='/AIV/05/4/19'>Deut. 4:19</a>; <a href='/AIV/12/23/4'>2 Kgs. 23:4</a>",
      "comment": "Turning from worship of the true God to the host of heaven (idolatry) is a recurring and serious sin in salvation history."
    },
    {
      "pk": 12021006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 6,
      "text": "He made his son pass through the fire, practiced witchcraft and divination, consulted mediums and spiritists. He did much evil in the sight of the LORD, provoking Him to anger.",
      "links": "<a href='/AIV/03/18/21'>Lev. 18:21</a>; <a href='/AIV/05/18/10-12'>Deut. 18:10-12</a>",
      "comment": "Child sacrifice and occult practices are direct violations of God's law, highlighting the seriousness of leading others into sin—see also later judgments."
    },
    {
      "pk": 12021007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 7,
      "text": "He set the carved image of Asherah that he had made in the house about which the LORD had said to David and Solomon his son: 'In this house and in Jerusalem, which I have chosen out of all the tribes of Israel, I will put My name forever.'",
      "links": "<a href='/AIV/11/9/3'>1 Kgs. 9:3</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "The defilement of the temple, the dwelling place of God, is again in focus. God’s promise of His Name enduring points to His faithfulness despite human failure."
    },
    {
      "pk": 12021008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 8,
      "text": "'And I will not again cause the feet of Israel to wander out of the land that I gave to their ancestors, if only they will be careful to do all that I have commanded them—according to all the law that My servant Moses commanded them.'",
      "links": "<a href='/AIV/05/11/22-23'>Deut. 11:22-23</a>",
      "comment": "Continued dwelling in the land is conditional on faithfulness to God’s commands, echoing the covenant blessings and curses explained in the Torah."
    },
    {
      "pk": 12021009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 9,
      "text": "But they did not listen, and Manasseh led them astray to do more evil than the nations whom the LORD had destroyed before the Israelites.",
      "links": "<a href='/AIV/05/12/30-31'>Deut. 12:30-31</a>",
      "comment": "The spiritual leadership of the nation is vital; when the leaders stray, the people follow. This underscores the biblical emphasis on authority and obedience."
    },
    {
      "pk": 12021010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 10,
      "text": "And the LORD spoke by His servants the prophets, saying,",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>",
      "comment": "God repeatedly sends prophets to warn and correct—a pattern seen throughout Scripture pointing to God’s patience and desire for repentance."
    },
    {
      "pk": 12021011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 11,
      "text": "'Because Manasseh king of Judah has committed these abominations—having done more evil than all that the Amorites did before him—and has made Judah also to sin with his idols,",
      "links": "<a href='/AIV/01/15/16'>Gen. 15:16</a>; <a href='/AIV/02/34/15'>Ex. 34:15</a>",
      "comment": "The judgment here is based on comparison with the Amorites (a symbol of previous wickedness). Sin is communal, as the king causes the nation to follow."
    },
    {
      "pk": 12021012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 12,
      "text": "therefore thus says the LORD, the God of Israel: Behold, I am bringing such disaster upon Jerusalem and Judah that the ears of everyone who hears of it will tingle.",
      "links": "<a href='/AIV/09/3/11'>1 Sam. 3:11</a>; <a href='/AIV/24/19/3'>Jer. 19:3</a>",
      "comment": "The 'tingling ears' phrase implies a judgment so shocking that it will be unforgettable—emphasizing both justice and future restoration themes."
    },
    {
      "pk": 12021013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 13,
      "text": "I will stretch over Jerusalem the measuring line of Samaria and the plumb line of the house of Ahab. I will wipe Jerusalem as one wipes a dish, wiping it and turning it upside down.",
      "links": "<a href='/AIV/23/34/11'>Isa. 34:11</a>; <a href='/AIV/12/17/6'>2 Kgs. 17:6</a>",
      "comment": "God’s judgment is measured and just. The graphic image of cleansing foreshadows the coming work of purification later found in the New Covenant."
    },
    {
      "pk": 12021014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 14,
      "text": "I will forsake the remnant of my inheritance and give them into the hand of their enemies; they will become plunder and spoil to all their enemies,",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>; <a href='/AIV/24/7/34'>Jer. 7:34</a>",
      "comment": "God’s discipline toward Israel is ultimately designed to call them back to faithfulness, not abandon them permanently. God’s justice and mercy are tightly interconnected."
    },
    {
      "pk": 12021015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 15,
      "text": "because they have done what is evil in my sight and have provoked me to anger from the day their ancestors came out of Egypt until this day.'",
      "links": "<a href='/AIV/05/9/7'>Deut. 9:7</a>",
      "comment": "A summary of Israel’s persistent rebellion. God’s patience is remarkable, and His judgments are always preceded by many opportunities to repent."
    },
    {
      "pk": 12021016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 16,
      "text": "Moreover, Manasseh shed very much innocent blood, till he filled Jerusalem from one end to another, besides leading Judah into sin by doing evil in the eyes of the LORD.",
      "links": "<a href='/AIV/24/2/34'>Jer. 2:34</a>; <a href='/AIV/19/106/38'>Ps. 106:38</a>",
      "comment": "Manasseh’s sins are both personal and social, breaking the commandments on idolatry and murder. This echoes biblical calls for both faith and fidelity to God’s law."
    },
    {
      "pk": 12021017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 17,
      "text": "The rest of the deeds of Manasseh, all that he did, and the sin that he committed, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/33/18-19'>2 Chron. 33:18-19</a>",
      "comment": "Reference is made to another historical record. In 2 Chronicles, Manasseh’s eventual repentance is described in more detail—highlighting God’s readiness to forgive even great sinners."
    },
    {
      "pk": 12021018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 18,
      "text": "Manasseh slept with his fathers and was buried in the garden of his own house, in the garden of Uzza. And his son Amon became king in his place.",
      "links": "<a href='/AIV/12/20/21'>2 Kgs. 20:21</a>; <a href='/AIV/14/33/20-21'>2 Chron. 33:20-21</a>",
      "comment": "Burial in the garden, rather than the royal tombs, may suggest some lingering disgrace. The transition to Amon continues the biblical theme of generational legacy."
    },
    {
      "pk": 12021019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 19,
      "text": "Amon was twenty-two years old when he began to reign, and he reigned two years in Jerusalem. His mother’s name was Meshullemeth, daughter of Haruz of Jotbah.",
      "links": "<a href='/AIV/14/33/21'>2 Chron. 33:21</a>",
      "comment": "Amon’s short reign is introduced. Again, the mother’s name is recorded—a detail that reflects the importance of familial roles in salvation history."
    },
    {
      "pk": 12021020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 20,
      "text": "He did what was evil in the sight of the LORD, as Manasseh his father had done.",
      "links": "<a href='/AIV/12/21/2'>2 Kgs. 21:2</a>",
      "comment": "Like his father’s early years, Amon repeats his evil; the biblical narrative underlines both the weight of tradition and the need for authentic faith and reform."
    },
    {
      "pk": 12021021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 21,
      "text": "He walked in all the ways that his father walked, and served the idols his father had served, and worshiped them.",
      "links": "<a href='/AIV/12/21/3'>2 Kgs. 21:3</a>",
      "comment": "Amon’s imitation of Manasseh’s sins demonstrates the generational consequences of spiritual decisions and the powerful need for conversion and turning to God."
    },
    {
      "pk": 12021022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 22,
      "text": "He abandoned the LORD, the God of his fathers, and did not walk in the way of the LORD.",
      "links": "<a href='/AIV/05/31/16-18'>Deut. 31:16-18</a>",
      "comment": "To abandon God is to abandon the covenant, again emphasizing the importance of perseverance and continuity in faith through the generations."
    },
    {
      "pk": 12021023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 23,
      "text": "And the servants of Amon conspired against him and killed the king in his own house.",
      "links": "<a href='/AIV/12/12/20'>2 Kgs. 12:20</a>",
      "comment": "The assassination of Amon shows the instability resulting from sin and unfaithfulness. Leadership is a grave responsibility in God’s unfolding plan."
    },
    {
      "pk": 12021024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 24,
      "text": "But the people of the land struck down all those who had conspired against King Amon, and they made Josiah his son king in his place.",
      "links": "<a href='/AIV/12/12/21'>2 Kgs. 12:21</a>; <a href='/AIV/14/33/25'>2 Chron. 33:25</a>",
      "comment": "The people’s decision to avenge Amon’s death and install Josiah prefigures the reform that is to come under Josiah. This demonstrates a role for the people in God’s providence."
    },
    {
      "pk": 12021025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 25,
      "text": "Now the rest of the acts of Amon that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/33/22-23'>2 Chron. 33:22-23</a>",
      "comment": "As before, the official annals are cited, suggesting that sacred history is part of a broader tradition, hand-in-hand with God’s inspired Scripture."
    },
    {
      "pk": 12021026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 21,
      "verse": 26,
      "text": "And he was buried in his tomb in the garden of Uzza, and Josiah his son became king in his place.",
      "links": "<a href='/AIV/12/22/1'>2 Kgs. 22:1</a>",
      "comment": "Josiah’s rise sets the stage for the most faithful king since David. Notice the repeated theme of inheritance and succession. God preserves a remnant through whom He will bring about renewal—ultimately fulfilled in Christ, the true and perfect King."
    }
  ],
  "translatedAt": "2025-12-24T04:00:02.786Z"
}