{
  "book": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 23,
  "verses": [
    {
      "pk": 1932301,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 1,
      "text": "Then the king sent, and all the elders of Judah and Jerusalem gathered to him.",
      "links": "<a href='/AIV/14/34/29'>2 Chr. 34:29</a>",
      "comment": "Josiah gathers the leaders, beginning his reforms."
    },
    {
      "pk": 1932302,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 2,
      "text": "The king went up to the house of the LORD, and all the men of Judah and all the inhabitants of Jerusalem went with him, along with the priests, the prophets, and all the people, both small and great. And he read in their hearing all the words of the Book of the Covenant that had been found in the house of the LORD.",
      "links": "<a href='/AIV/14/34/30'>2 Chr. 34:30</a>; <a href='/AIV/5/31/9-13'>Deut. 31:9–13</a>",
      "comment": "Josiah reads the law publicly like in Deuteronomy."
    },
    {
      "pk": 1932303,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 3,
      "text": "The king stood by the pillar and made a covenant before the LORD, to walk after the LORD and to keep his commandments, his testimonies, and his statutes with all his heart and all his soul, to establish the words of this covenant that were written in this book. And all the people joined in the covenant.",
      "links": "<a href='/AIV/14/34/31-32'>2 Chr. 34:31-32</a>; <a href='/AIV/5/6/5'>Deut. 6:5</a>",
      "comment": "Standing by the pillar likely refers to a designated place in the temple."
    },
    {
      "pk": 1932304,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 4,
      "text": "Then the king commanded Hilkiah the high priest, the priests of the second order, and the doorkeepers to bring out of the temple of the LORD all the vessels made for Baal, for Asherah, and for all the host of heaven. He burned them outside Jerusalem in the fields of the Kidron and carried their ashes to Bethel.",
      "links": "<a href='/AIV/14/34/3-5'>2 Chr. 34:3-5</a>; <a href='/AIV/12/21/3-5'>2 Kgs. 21:3-5</a>",
      "comment": "Josiah begins removing idolatry from the temple."
    },
    {
      "pk": 1932305,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 5,
      "text": "He deposed the priests whom the kings of Judah had appointed to burn incense on the high places in the cities of Judah and around Jerusalem—those who burned incense to Baal, to the sun, to the moon, to the constellations, and to all the host of heaven.",
      "links": "<a href='/AIV/36/1/4-5'>Zeph. 1:4-5</a>; <a href='/AIV/24/8/2'>Jer. 8:2</a>",
      "comment": "Idolatrous priests were removed, as well as false worship locations."
    },
    {
      "pk": 1932306,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 6,
      "text": "He brought out the Asherah from the house of the LORD, outside Jerusalem to the brook Kidron, and burned it at the brook Kidron, ground it to dust, and threw its dust on the graves of common people.",
      "links": "<a href='/AIV/12/21/7'>2 Kgs. 21:7</a>; <a href='/AIV/14/34/4'>2 Chr. 34:4</a>",
      "comment": "The Asherah was an idol; destroying it signified complete rejection of idolatry."
    },
    {
      "pk": 1932307,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 7,
      "text": "He broke down the houses of the male cult prostitutes that were in the house of the LORD, where the women wove hangings for the Asherah.",
      "links": "<a href='/AIV/14/34/33'>2 Chr. 34:33</a>; <a href='/AIV/5/23/17-18'>Deut. 23:17-18</a>",
      "comment": "The word translated 'male cult prostitutes' refers specifically to the pagan practice prohibited in Deuteronomy."
    },
    {
      "pk": 1932308,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 8,
      "text": "He brought all the priests from the cities of Judah and defiled the high places where the priests had burned incense, from Geba to Beersheba. He broke down the high places of the gates that were at the entrance of the gate of Joshua the governor of the city, which were on a person’s left at the city gate.",
      "links": "<a href='/AIV/6/8/22'>Joshua 8:22</a>",
      "comment": "‘Defiled’ means rendered unfit for worship by pagan means."
    },
    {
      "pk": 1932309,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 9,
      "text": "However, the priests of the high places did not come up to the altar of the LORD in Jerusalem, but they ate unleavened bread among their brothers.",
      "links": "<a href='/AIV/3/6/16-18'>Lev. 6:16-18</a>",
      "comment": "These priests were disqualified from temple service but ate the same food as other priests."
    },
    {
      "pk": 1932310,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 10,
      "text": "He defiled Topheth, which is in the Valley of the Son of Hinnom, so that no one would make his son or his daughter pass through the fire to Molech.",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>; <a href='/AIV/24/7/31'>Jer. 7:31</a>",
      "comment": "'Pass through the fire' refers to child sacrifice to Molech."
    },
    {
      "pk": 1932311,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 11,
      "text": "He removed the horses that the kings of Judah had dedicated to the sun at the entrance to the house of the LORD, by the chamber of Nathan-melech the officer, which was in the precincts; and he burned the chariots of the sun with fire.",
      "links": "<a href='/AIV/24/8/2'>Jer. 8:2</a>",
      "comment": "The sun had been worshipped as a deity; Josiah destroys sun chariots and horses."
    },
    {
      "pk": 1932312,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 12,
      "text": "He tore down the altars that were on the roof—the upper chamber of Ahaz, which the kings of Judah had made, and the altars that Manasseh had made in the two courts of the house of the LORD. He broke them in pieces and threw the dust into the brook Kidron.",
      "links": "<a href='/AIV/12/21/5'>2 Kgs. 21:5</a>; <a href='/AIV/12/16/12'>2 Kgs. 16:12</a>",
      "comment": "Idolatrous rooftop altars were destroyed, including those made by past kings."
    },
    {
      "pk": 1932313,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 13,
      "text": "The king defiled the high places that were east of Jerusalem, south of the Mount of Corruption, which Solomon king of Israel had built for Ashtoreth the abomination of the Sidonians, for Chemosh the abomination of Moab, and for Milcom the abomination of the Ammonites.",
      "links": "<a href='/AIV/11/11/7'>1 Kgs. 11:7</a>",
      "comment": "Mount of Corruption is the Mount of Olives. Solomon’s ancient idolatrous sites are destroyed."
    },
    {
      "pk": 1932314,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 14,
      "text": "He broke in pieces the pillars and cut down the Asherim and filled their places with the bones of men.",
      "links": "<a href='/AIV/12/23/16'>2 Kgs. 23:16</a>",
      "comment": "Placing bones there defiled the place, making it unfit for worship."
    },
    {
      "pk": 1932315,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 15,
      "text": "Moreover, even the altar at Bethel, the high place made by Jeroboam son of Nebat, who made Israel sin, that altar and the high place he tore down. He burned the high place and ground it to dust; he burned the Asherah also.",
      "links": "<a href='/AIV/11/12/32-33'>1 Kgs. 12:32-33</a>; <a href='/AIV/13/6/7'>2 Chr. 13:7</a>",
      "comment": "Bethel was Israel’s chief site of idolatry since Jeroboam."
    },
    {
      "pk": 1932316,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 16,
      "text": "As Josiah turned, he saw the tombs that were there on the mountain. He sent and took the bones from the tombs and burned them on the altar, defiling it according to the word of the LORD that the man of God proclaimed, who had announced these things.",
      "links": "<a href='/AIV/11/13/2'>1 Kgs. 13:2</a>",
      "comment": "Josiah fulfills a prophecy from 1 Kings 13:2."
    },
    {
      "pk": 1932317,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 17,
      "text": "Then he said, “What is that monument that I see?” The men of the city told him, “It is the tomb of the man of God who came from Judah and proclaimed these things that you have done against the altar at Bethel.”",
      "links": "<a href='/AIV/11/13/1-3'>1 Kgs. 13:1-3</a>",
      "comment": "Identifying the prophet who foretold the altar’s defilement."
    },
    {
      "pk": 1932318,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 18,
      "text": "He said, “Let him alone; let no one disturb his bones.” So they let his bones alone, along with the bones of the prophet who came out of Samaria.",
      "links": "<a href='/AIV/11/13/31-32'>1 Kgs. 13:31-32</a>",
      "comment": "Josiah spares the tomb of the Judahite prophet and his companion."
    },
    {
      "pk": 1932319,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 19,
      "text": "Josiah also removed all the shrines of the high places that were in the cities of Samaria, which the kings of Israel had made to provoke the LORD to anger. He did to them just as he had done at Bethel.",
      "links": "<a href='/AIV/13/34/6-7'>2 Chr. 34:6-7</a>",
      "comment": "Josiah extends his reforms to former northern Israel."
    },
    {
      "pk": 1932320,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 20,
      "text": "He sacrificed all the priests of the high places who were there on the altars and burned human bones on them. Then he returned to Jerusalem.",
      "links": "<a href='/AIV/12/23/16'>2 Kgs. 23:16</a>; <a href='/AIV/11/13/2'>1 Kgs. 13:2</a>",
      "comment": "'Sacrificed' here means executed, as in fulfilling divine judgment."
    },
    {
      "pk": 1932321,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 21,
      "text": "The king commanded all the people, saying, “Keep the Passover to the LORD your God, as it is written in this Book of the Covenant.”",
      "links": "<a href='/AIV/2/12/3-14'>Exod. 12:3-14</a>; <a href='/AIV/5/16/2-8'>Deut. 16:2-8</a>",
      "comment": "Josiah reinstates Passover according to the Law of Moses."
    },
    {
      "pk": 1932322,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 22,
      "text": "Surely such a Passover had not been kept since the days of the judges who judged Israel, or during all the days of the kings of Israel and the kings of Judah.",
      "links": "<a href='/AIV/14/35/18'>2 Chr. 35:18</a>",
      "comment": "The Passover was kept with a zeal not seen since the era of the Judges."
    },
    {
      "pk": 1932323,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 23,
      "text": "But in the eighteenth year of King Josiah, this Passover was kept to the LORD in Jerusalem.",
      "links": "<a href='/AIV/12/22/3'>2 Kgs. 22:3</a>",
      "comment": "Corresponds to Josiah’s eighteenth year (c. 622 BC)."
    },
    {
      "pk": 1932324,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 24,
      "text": "Moreover, Josiah removed the mediums, the spiritists, the household gods, the idols, and all the abominations that were seen in the land of Judah and in Jerusalem, so that he might establish the words of the law that were written in the book that Hilkiah the priest found in the house of the LORD.",
      "links": "<a href='/AIV/3/19/31'>Lev. 19:31</a>; <a href='/AIV/14/34/33'>2 Chr. 34:33</a>",
      "comment": "'Spiritists' are those who claim to speak to the dead; all forms of occultism are rejected."
    },
    {
      "pk": 1932325,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 25,
      "text": "Before him there was no king like him, who turned to the LORD with all his heart, with all his soul, and with all his strength, according to all the Law of Moses; nor did any arise after him like him.",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/14/34/33'>2 Chr. 34:33</a>",
      "comment": "Josiah's wholehearted devotion is highlighted with Deuteronomic language."
    },
    {
      "pk": 1932326,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 26,
      "text": "Yet the LORD did not turn from the fierceness of his great anger, which burned against Judah, because of all the provocations with which Manasseh had provoked him.",
      "links": "<a href='/AIV/12/21/11-15'>2 Kgs. 21:11-15</a>",
      "comment": "Judah’s fate was sealed by Manasseh’s sins (see 2 Kings 21)."
    },
    {
      "pk": 1932327,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 27,
      "text": "The LORD said, “I will remove Judah also out of my sight, as I have removed Israel. I will reject this city, Jerusalem, which I have chosen, and the house of which I said, ‘My name shall be there.’”",
      "links": "<a href='/AIV/12/17/18-23'>2 Kgs. 17:18-23</a>; <a href='/AIV/11/8/29'>1 Kgs. 8:29</a>",
      "comment": "Parallel to the exile of Israel, foreshadowing Judah’s coming exile."
    },
    {
      "pk": 1932328,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 28,
      "text": "Now the rest of the acts of Josiah and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/35/26-27'>2 Chr. 35:26-27</a>",
      "comment": "A standard formula referring readers to a lost annalistic source."
    },
    {
      "pk": 1932329,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 29,
      "text": "In his days Pharaoh Neco king of Egypt went up to help the king of Assyria at the river Euphrates. King Josiah went out to confront him, but when Pharaoh Neco saw him at Megiddo, he killed him.",
      "links": "<a href='/AIV/14/35/20-24'>2 Chr. 35:20-24</a>",
      "comment": "Josiah’s death comes unexpectedly at Megiddo; Chronicles gives more detail."
    },
    {
      "pk": 1932330,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 30,
      "text": "His servants carried his dead body from Megiddo, brought him to Jerusalem, and buried him in his own tomb. The people of the land took Jehoahaz the son of Josiah, anointed him, and made him king in his father’s place.",
      "links": "<a href='/AIV/14/36/1'>2 Chr. 36:1</a>",
      "comment": "Succession after Josiah’s death; Jehoahaz becomes king."
    },
    {
      "pk": 1932331,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 31,
      "text": "Jehoahaz was twenty-three years old when he began to reign, and he reigned three months in Jerusalem. His mother’s name was Hamutal daughter of Jeremiah of Libnah.",
      "links": "<a href='/AIV/24/22/11'>Jer. 22:11</a>; <a href='/AIV/25/4/20'>Lam. 4:20</a>",
      "comment": "Jehoahaz’s brief reign is described; ‘Jeremiah of Libnah’ is not the prophet Jeremiah."
    },
    {
      "pk": 1932332,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 32,
      "text": "He did what was evil in the sight of the LORD, as all his fathers had done.",
      "links": "<a href='/AIV/24/22/17'>Jer. 22:17</a>",
      "comment": "Despite Josiah’s reforms, Jehoahaz continues in evil."
    },
    {
      "pk": 1932333,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 33,
      "text": "Pharaoh Neco imprisoned him at Riblah in the land of Hamath, so that he might not reign in Jerusalem, and imposed on the land a tribute of a hundred talents of silver and a talent of gold.",
      "links": "<a href='/AIV/24/22/10-12'>Jer. 22:10-12</a>",
      "comment": "Jehoahaz is removed and tribute imposed; Hamath is in modern Syria."
    },
    {
      "pk": 1932334,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 34,
      "text": "Pharaoh Neco made Eliakim the son of Josiah king instead of Josiah his father, and changed his name to Jehoiakim. But he took Jehoahaz away, and he came to Egypt and died there.",
      "links": "<a href='/AIV/24/22/11-12'>Jer. 22:11-12</a>; <a href='/AIV/14/36/4'>2 Chr. 36:4</a>",
      "comment": "Neco installs Jehoiakim as vassal king after renaming him."
    },
    {
      "pk": 1932335,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 35,
      "text": "Jehoiakim gave the silver and gold to Pharaoh, but he taxed the land to give the money according to Pharaoh’s command. He exacted the silver and gold from the people of the land, from everyone according to his assessment, to give it to Pharaoh Neco.",
      "links": "<a href='/AIV/14/36/5'>2 Chr. 36:5</a>",
      "comment": "'Assessment' here means a set tax based on each person's means."
    },
    {
      "pk": 1932336,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 36,
      "text": "Jehoiakim was twenty-five years old when he began to reign, and he reigned eleven years in Jerusalem. His mother’s name was Zebidah daughter of Pedaiah of Rumah.",
      "links": "<a href='/AIV/24/26/1'>Jer. 26:1</a>",
      "comment": "Jehoiakim’s reign was much longer than his brother’s."
    },
    {
      "pk": 1932337,
      "translation": "AIV",
      "book": 12,
      "chapter": 23,
      "verse": 37,
      "text": "He did what was evil in the sight of the LORD, as all his fathers had done.",
      "links": "<a href='/AIV/12/23/32'>2 Kgs. 23:32</a>; <a href='/AIV/24/36/30-31'>Jer. 36:30-31</a>",
      "comment": "Jehoiakim, like his predecessors (except Josiah), continued in evil."
    }
  ],
  "translatedAt": "2025-12-22T10:44:20.624Z"
}