{
  "book": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 8,
  "verses": [
    {
      "pk": 1932801,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 1,
      "text": "Now Elisha spoke to the woman whose son he had restored to life, saying, \"Get up and go with your household, and live wherever you can, for the LORD has called for a famine; it will come upon the land for seven years.\"",
      "links": "<a href='/AIV/12/4/35'>2 Kings 4:35</a>; <a href='/AIV/12/4/38'>2 Kings 4:38</a>",
      "comment": "\"Restored to life\" refers back to 2 Kings 4:35, where Elisha raised her son."
    },
    {
      "pk": 1932802,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 2,
      "text": "So the woman got up and did according to the word of the man of God. She went with her household and lived as a foreigner in the land of the Philistines for seven years.",
      "links": "<a href='/AIV/09/29/1'>1 Samuel 29:1</a>",
      "comment": "\"Lived as a foreigner\" reflects the idea of being displaced during famine."
    },
    {
      "pk": 1932803,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 3,
      "text": "At the end of seven years, the woman returned from the land of the Philistines, and she went out to plead to the king for her house and her land.",
      "links": "<a href='/AIV/12/4/8'>2 Kings 4:8</a>",
      "comment": "\"Plead to the king\" means to make an official request for restoration of property."
    },
    {
      "pk": 1932804,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 4,
      "text": "Now the king was talking with Gehazi, the servant of the man of God, and said, \"Tell me all the great things Elisha has done.\"",
      "links": "<a href='/AIV/12/4/12'>2 Kings 4:12</a>; <a href='/AIV/12/5/20'>2 Kings 5:20</a>",
      "comment": "Gehazi is identified as Elisha's servant, previously punished for his greed in 2 Kings 5:27."
    },
    {
      "pk": 1932805,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 5,
      "text": "And as he was telling the king how Elisha had restored the dead to life, the woman whose son he had restored to life came to plead to the king for her house and her land. Gehazi said, \"My lord, O king, this is the woman, and this is her son whom Elisha restored to life.\"",
      "links": "<a href='/AIV/12/4/36'>2 Kings 4:36</a>",
      "comment": "The text emphasizes God's providence in the timing of her arrival."
    },
    {
      "pk": 1932806,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 6,
      "text": "And when the king asked the woman, she told him the story. So the king appointed an officer for her, saying, \"Restore all that was hers, together with all the income from the fields from the day that she left the land until now.\"",
      "links": "<a href='/AIV/12/8/3'>2 Kings 8:3</a>",
      "comment": "Income refers to the profits or harvests produced during her absence."
    },
    {
      "pk": 1932807,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 7,
      "text": "Then Elisha came to Damascus. Ben-hadad the king of Syria was sick, and it was told him, saying, \"The man of God has come here.\"",
      "links": "<a href='/AIV/11/19/15'>1 Kings 19:15</a>; <a href='/AIV/12/6/24'>2 Kings 6:24</a>",
      "comment": "Ben-hadad is a recurring royal name among Syrian kings."
    },
    {
      "pk": 1932808,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 8,
      "text": "So the king said to Hazael, \"Take a gift with you and go to meet the man of God. Inquire of the LORD through him, saying, 'Will I recover from this illness?'\"",
      "links": "<a href='/AIV/12/5/5'>2 Kings 5:5</a>",
      "comment": "\"Gift\" refers to a tribute or gift brought in hopes of favor."
    },
    {
      "pk": 1932809,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 9,
      "text": "So Hazael went to meet him, and took with him a gift—a camel's load of every good thing of Damascus. He came and stood before him, and said, \"Your son Ben-hadad king of Syria has sent me to you, saying, 'Shall I recover from this illness?'\"",
      "links": "<a href='/AIV/12/5/15'>2 Kings 5:15</a>",
      "comment": "\"Your son\" expresses respect; \"every good thing\" signifies valuable gifts."
    },
    {
      "pk": 1932810,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 10,
      "text": "Elisha said to him, \"Go, say to him, 'You will surely recover.' But the LORD has shown me that he will surely die.\"",
      "links": "<a href='/AIV/12/7/2'>2 Kings 7:2</a>",
      "comment": "Elisha's words hint at a coming death not from the illness but from other means."
    },
    {
      "pk": 1932811,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 11,
      "text": "He fixed his gaze steadily on him until Hazael was embarrassed. Then the man of God wept.",
      "links": "<a href='/AIV/12/13/14'>2 Kings 13:14</a>",
      "comment": "\"Embarrassed\" conveys Hazael's discomfort under Elisha's intense stare."
    },
    {
      "pk": 1932812,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 12,
      "text": "Hazael said, \"Why does my lord weep?\" He answered, \"Because I know the evil you will do to the Israelites. You will set their fortresses on fire, kill their young men with the sword, dash their little ones in pieces, and rip open their pregnant women.\"",
      "links": "<a href='/AIV/10/12/31'>2 Samuel 12:31</a>; <a href='/AIV/28/13/16'>Hosea 13:16</a>",
      "comment": "\"Dash their little ones\" and \"rip open their pregnant women\" are literal translations of the Hebrew."
    },
    {
      "pk": 1932813,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 13,
      "text": "Hazael said, \"But what is your servant, who is only a dog, that he could do this great thing?\" Elisha answered, \"The LORD has shown me that you will be king over Syria.\"",
      "links": "<a href='/AIV/11/19/15'>1 Kings 19:15</a>",
      "comment": "\"Who is only a dog\" is a phrase showing humility or surprise at such a future."
    },
    {
      "pk": 1932814,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 14,
      "text": "Then he departed from Elisha and came to his master, who said to him, \"What did Elisha say to you?\" He answered, \"He told me that you would surely recover.\"",
      "links": "<a href='/AIV/12/8/10'>2 Kings 8:10</a>",
      "comment": "Hazael reports only part of Elisha's message."
    },
    {
      "pk": 1932815,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 15,
      "text": "But the next day he took a cloth, dipped it in water, spread it on his face, and he died. So Hazael became king in his place.",
      "links": "<a href='/AIV/11/19/15'>1 Kings 19:15</a>; <a href='/AIV/12/13/24'>2 Kings 13:24</a>",
      "comment": "\"Cloth\" probably refers to an action of suffocation, leading to the king's death."
    },
    {
      "pk": 1932816,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 16,
      "text": "In the fifth year of Joram son of Ahab, king of Israel, while Jehoshaphat was king of Judah, Jehoram the son of Jehoshaphat, king of Judah, began to reign.",
      "links": "<a href='/AIV/12/1/17'>2 Kings 1:17</a>; <a href='/AIV/14/21/5'>2 Chronicles 21:5</a>",
      "comment": "The chronology is difficult but reflects co-regencies."
    },
    {
      "pk": 1932817,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 17,
      "text": "He was thirty-two years old when he became king, and he reigned eight years in Jerusalem.",
      "links": "<a href='/AIV/14/21/5'>2 Chronicles 21:5</a>",
      "comment": "Verse is nearly identical to 2 Chronicles 21:5."
    },
    {
      "pk": 1932818,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 18,
      "text": "He walked in the ways of the kings of Israel, as the house of Ahab had done, for the daughter of Ahab was his wife. He did what was evil in the sight of the LORD.",
      "links": "<a href='/AIV/14/21/6'>2 Chronicles 21:6</a>",
      "comment": "\"Walked in the ways\" is a Hebrew idiom for living after their example."
    },
    {
      "pk": 1932819,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 19,
      "text": "Yet the LORD was not willing to destroy Judah for the sake of David his servant, since he had promised to give a lamp to him and his sons forever.",
      "links": "<a href='/AIV/10/7/16'>2 Samuel 7:16</a>; <a href='/AIV/11/11/36'>1 Kings 11:36</a>",
      "comment": "\"Lamp\" is a symbol for a lasting dynasty."
    },
    {
      "pk": 1932820,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 20,
      "text": "In his days Edom revolted from the rule of Judah and set up a king of their own.",
      "links": "<a href='/AIV/14/21/8'>2 Chronicles 21:8</a>",
      "comment": "Edom had been under Judah's domination since David."
    },
    {
      "pk": 1932821,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 21,
      "text": "So Joram crossed over to Zair with all his chariots. He rose by night and struck the Edomites who surrounded him and the commanders of the chariots; but his troops fled to their tents.",
      "links": "<a href='/AIV/14/21/9'>2 Chronicles 21:9</a>",
      "comment": "\"Zair\" is probably the same as Seir, Edom's capital."
    },
    {
      "pk": 1932822,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 22,
      "text": "So Edom has been in rebellion against the rule of Judah to this day. Libnah also revolted at the same time.",
      "links": "<a href='/AIV/14/21/10'>2 Chronicles 21:10</a>",
      "comment": "\"To this day\" means at the time of the writing."
    },
    {
      "pk": 1932823,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 23,
      "text": "Now the rest of the acts of Joram, and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/21/11'>2 Chronicles 21:11</a>",
      "comment": "Refers to a lost court record."
    },
    {
      "pk": 1932824,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 24,
      "text": "So Joram slept with his fathers and was buried with his fathers in the city of David, and Ahaziah his son became king in his place.",
      "links": "<a href='/AIV/12/1/18'>2 Kings 1:18</a>",
      "comment": "\"Slept with his fathers\" is a Hebrew idiom for death."
    },
    {
      "pk": 1932825,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 25,
      "text": "In the twelfth year of Joram son of Ahab, king of Israel, Ahaziah the son of Jehoram, king of Judah, began to reign.",
      "links": "<a href='/AIV/14/22/1'>2 Chronicles 22:1</a>",
      "comment": "Dating is complex due to overlapping reigns."
    },
    {
      "pk": 1932826,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 26,
      "text": "Ahaziah was twenty-two years old when he became king; and he reigned one year in Jerusalem. His mother's name was Athaliah, the granddaughter of Omri king of Israel.",
      "links": "<a href='/AIV/14/22/2'>2 Chronicles 22:2</a>",
      "comment": "\"Granddaughter\" could also be \"daughter\" in Hebrew idiom."
    },
    {
      "pk": 1932827,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 27,
      "text": "He walked in the way of the house of Ahab, and did what was evil in the sight of the LORD, as the house of Ahab had done, for he was related by marriage to the house of Ahab.",
      "links": "<a href='/AIV/14/22/3'>2 Chronicles 22:3</a>",
      "comment": "\"Related by marriage\" specifically refers to his mother Athaliah."
    },
    {
      "pk": 1932828,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 28,
      "text": "He went with Joram the son of Ahab to wage war against Hazael king of Syria at Ramoth-Gilead, and the Syrians wounded Joram.",
      "links": "<a href='/AIV/12/9/15'>2 Kings 9:15</a>",
      "comment": "\"Wage war\" and the location, Ramoth-Gilead, is a key area of conflict."
    },
    {
      "pk": 1932829,
      "translation": "AIV",
      "book": 12,
      "chapter": 8,
      "verse": 29,
      "text": "King Joram returned to be healed at Jezreel of the wounds which the Syrians had given him at Ramah, when he fought against Hazael king of Syria. And Ahaziah the son of Jehoram, king of Judah, went down to see Joram the son of Ahab in Jezreel, because he was wounded.",
      "links": "<a href='/AIV/12/9/15'>2 Kings 9:15</a>",
      "comment": "\"Ramah\" used here is related to Ramoth-Gilead."
    }
  ],
  "translatedAt": "2025-12-22T10:12:54.117Z"
}