{
  "book": "Joel",
  "bookAbbreviation": "Joel",
  "chapter": 3,
  "verses": [
    {
      "pk": 2024001,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 1,
      "text": "For behold, in those days and at that time, when I restore the fortunes of Judah and Jerusalem,",
      "links": "<a href='/AIV/24/30/3'>Jer. 30:3</a>; <a href='/AIV/26/39/25'>Ezek. 39:25</a>",
      "comment": "God announces a future restoration for His people, referencing the return from exile but also suggesting a greater fulfillment."
    },
    {
      "pk": 2024002,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 2,
      "text": "I will gather all the nations and bring them down to the Valley of Jehoshaphat. And I will enter into judgment with them there over My people and My heritage Israel, whom they have scattered among the nations, and they have divided up My land.",
      "links": "<a href='/AIV/23/2/4'>Isa. 2:4</a>; <a href='/AIV/24/25/31'>Jer. 25:31</a>",
      "comment": "The 'Valley of Jehoshaphat' is likely symbolic, meaning 'Yahweh judges.' This is a prophecy of a future universal judgment, often interpreted both literally and as foreshadowing final judgment."
    },
    {
      "pk": 2024003,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 3,
      "text": "They have cast lots for My people, and given a boy for a prostitute, and sold a girl for wine, and have drunk it.",
      "links": "<a href='/AIV/24/50/11-12'>Jer. 50:11–12</a>",
      "comment": "This gruesome image underscores the depths of sin and injustice, pointing later to the need for redemption that Christ provides."
    },
    {
      "pk": 2024004,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 4,
      "text": "What are you to Me, O Tyre and Sidon, and all the regions of Philistia? Are you repaying Me for something? If you are paying Me back, I will swiftly and speedily return your recompense on your own head.",
      "links": "<a href='/AIV/23/34/8'>Isa. 34:8</a>",
      "comment": "God addresses the surrounding pagan nations, highlighting that human attempts to retaliate against God are futile."
    },
    {
      "pk": 2024005,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 5,
      "text": "For you have taken My silver and My gold, and have carried My precious treasures into your temples.",
      "links": "<a href='/AIV/14/21/16-17'>2 Chr. 21:16–17</a>",
      "comment": "The taking of sacred objects indicates profanation of what is holy. This ties into Christian teaching on proper reverence for things set apart for God."
    },
    {
      "pk": 2024006,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 6,
      "text": "You have sold the people of Judah and Jerusalem to the Greeks, to remove them far from their own border.",
      "links": "<a href='/AIV/30/1/6'>Amos 1:6</a>",
      "comment": "This verse references historical slave trade but also points to deeper themes of exile and restoration."
    },
    {
      "pk": 2024007,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 7,
      "text": "Look, I will stir them up from the place where you have sold them, and I will return your recompense on your own head.",
      "links": "<a href='/AIV/19/137/7-9'>Ps. 137:7–9</a>",
      "comment": "God's justice requires restoration and retribution, which foreshadows God's ultimate plan of justice in salvation history."
    },
    {
      "pk": 2024008,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 8,
      "text": "I will sell your sons and your daughters into the hand of the people of Judah, and they will sell them to the Sabeans, to a nation far away— for the LORD has spoken.",
      "links": "<a href='/AIV/23/43/3'>Isa. 43:3</a>",
      "comment": "This is a reversal of fortune—an instance of poetic justice. The text underscores the seriousness of covenant violations."
    },
    {
      "pk": 2024009,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 9,
      "text": "Proclaim this among the nations: Prepare for war! Stir up the mighty men. Let all the warriors draw near, let them come up.",
      "links": "<a href='/AIV/24/25/34'>Jer. 25:34</a>",
      "comment": "This call signals a universal judgment, often connected with eschatological images found in Revelation."
    },
    {
      "pk": 2024010,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 10,
      "text": "Beat your plowshares into swords, and your pruning hooks into spears; let the weak say, 'I am strong.'",
      "links": "<a href='/AIV/23/2/4'>Isa. 2:4</a>; <a href='/AIV/33/4/3'>Mic. 4:3</a>",
      "comment": "This is a reversal of Isaiah 2:4, where swords become plowshares. Here, even the weak are to prepare for God's judgment."
    },
    {
      "pk": 2024011,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 11,
      "text": "Hasten and come, all you surrounding nations, and gather yourselves there. Bring down, O LORD, Your mighty ones.",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>",
      "comment": "The gathering of the nations for judgment symbolizes the universality of God's reign."
    },
    {
      "pk": 2024012,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 12,
      "text": "Let the nations stir themselves up and come up to the Valley of Jehoshaphat; for there I will sit to judge all the surrounding nations.",
      "links": "<a href='/AIV/23/3/13'>Isa. 3:13</a>",
      "comment": "God as universal judge appears here—anticipating the Messiah's role as ultimate judge (see Matthew 25:31–32)."
    },
    {
      "pk": 2024013,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 13,
      "text": "Put in the sickle, for the harvest is ripe. Go in, tread, for the winepress is full. The vats overflow, for their wickedness is great.",
      "links": "<a href='/AIV/23/63/2-3'>Isa. 63:2–3</a>; <a href='/AIV/66/14/14-20'>Rev. 14:14–20</a>",
      "comment": "The imagery of harvest and winepress is used for judgment, echoed in Revelation concerning the final judgment."
    },
    {
      "pk": 2024014,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 14,
      "text": "Multitudes, multitudes, in the valley of decision! For the day of the LORD is near in the valley of decision.",
      "links": "<a href='/AIV/36/1/14'>Zeph. 1:14</a>",
      "comment": "The 'valley of decision' signifies a decisive moment in God's plan and reflects the urgency of repentance."
    },
    {
      "pk": 2024015,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 15,
      "text": "The sun and the moon grow dark, and the stars withdraw their shining.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/41/13/24-25'>Mark 13:24–25</a>",
      "comment": "Cosmic signs accompany God's intervention in history—a motif echoed in the apocalyptic discourse of Jesus."
    },
    {
      "pk": 2024016,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 16,
      "text": "The LORD will roar from Zion, and utter His voice from Jerusalem, and the heavens and the earth will shake. But the LORD will be a refuge for His people, a stronghold for the people of Israel.",
      "links": "<a href='/AIV/30/1/2'>Amos 1:2</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "God's special protection for His people is highlighted. This is a foreshadowing of the ongoing spiritual refuge provided in the Church."
    },
    {
      "pk": 2024017,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 17,
      "text": "So you shall know that I am the LORD your God, who dwells in Zion, My holy mountain. And Jerusalem will be holy, and strangers shall never again pass through it.",
      "links": "<a href='/AIV/26/43/7'>Ezek. 43:7</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "The holiness of the city reflects the call to be a distinct, set apart people—fulfilled ultimately in the new Jerusalem."
    },
    {
      "pk": 2024018,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 18,
      "text": "And on that day the mountains shall drip sweet wine, the hills shall flow with milk, and all the streams of Judah shall flow with water. And a fountain shall come forth from the house of the LORD and water the Valley of Shittim.",
      "links": "<a href='/AIV/26/47/1'>Ezek. 47:1</a>; <a href='/AIV/43/7/37-39'>John 7:37–39</a>",
      "comment": "Abundance and blessing flow from the worship of God. The fountain image is echoed by Jesus (John 7:37–39), who speaks of living water coming from the heart of the believer."
    },
    {
      "pk": 2024019,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 19,
      "text": "Egypt shall become a desolation and Edom a desolate wilderness, for the violence done to the people of Judah, because they have shed innocent blood in their land.",
      "links": "<a href='/AIV/23/34/9-10'>Isa. 34:9–10</a>",
      "comment": "Judgment on the enemies of God's people shows God's role as righteous judge who vindicates His own."
    },
    {
      "pk": 2024020,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 20,
      "text": "But Judah shall be inhabited forever, and Jerusalem to all generations.",
      "links": "<a href='/AIV/19/125/1'>Ps. 125:1</a>",
      "comment": "This speaks to the eternal security of God's people—a promise fulfilled spiritually in Christ’s everlasting kingdom (Luke 1:33)."
    },
    {
      "pk": 2024021,
      "translation": "AIV",
      "book": 29,
      "chapter": 3,
      "verse": 21,
      "text": "I will avenge their blood, blood I have not yet avenged, for the LORD dwells in Zion.",
      "links": "<a href='/AIV/66/6/9-11'>Rev. 6:9–11</a>",
      "comment": "God's presence with His people and His final justice are foundational truths, fulfilled ultimately in Christ, and expressed in the unity and endurance of God’s people throughout the ages."
    }
  ],
  "translatedAt": "2025-12-23T07:25:22.511Z"
}