{
  "book": "Joel",
  "bookAbbreviation": "Joel",
  "chapter": 1,
  "verses": [
    {
      "pk": 2301001,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 1,
      "text": "The word of the Lord that came to Joel the son of Pethuel.",
      "links": "<a href='/AIV/31/1/1'>Obadiah 1:1</a>",
      "comment": "This introduction follows the typical prophetic formula, establishing the prophetic authority of Joel as the recipient of God's message."
    },
    {
      "pk": 2301002,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 2,
      "text": "Hear this, you elders; listen, all inhabitants of the land! Has anything like this happened in your days, or in the days of your fathers?",
      "links": "<a href='/AIV/23/28/23'>Isa. 28:23</a>; <a href='/AIV/19/44/1'>Ps. 44:1</a>",
      "comment": "Joel calls for the attention of both leaders and all people, emphasizing the unprecedented nature of the coming calamity. The invocation of elders highlights the continuity and tradition of God’s people."
    },
    {
      "pk": 2301003,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 3,
      "text": "Tell your children about it, and let your children tell their children, and their children to the next generation.",
      "links": "<a href='/AIV/5/6/7'>Deut. 6:7</a>; <a href='/AIV/19/78/6'>Ps. 78:6</a>",
      "comment": "Transmission of God’s deeds and warnings to future generations is central to the faith, echoing the command to remember and teach the works of God (cf. Deut. 6:7). This tradition of passing down teaching resembles the way core beliefs are handed on through both scripture and established authority."
    },
    {
      "pk": 2301004,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 4,
      "text": "What the cutting locust has left, the swarming locust has eaten; what the swarming locust has left, the hopping locust has eaten; and what the hopping locust has left, the consuming locust has eaten.",
      "links": "<a href='/AIV/2/10/5'>Ex. 10:5</a>; <a href='/AIV/34/3/15'>Nah. 3:15</a>",
      "comment": "A four-fold destruction points to total devastation. This repeating wave hints at both literal plagues and, spiritually, judgments that come through different forms. Such completeness can be understood as God’s providential action in calling people to repentance."
    },
    {
      "pk": 2301005,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 5,
      "text": "Awake, you drunkards, and weep; wail, all you drinkers of wine, because the sweet wine is cut off from your mouth.",
      "links": "<a href='/AIV/23/24/7-11'>Isa. 24:7–11</a>",
      "comment": "Those who indulge in excess are warned, linking sin and judgment. The absence of wine represents both physical loss and spiritual judgment, reminiscent of the withdrawal of blessings when the covenant is broken."
    },
    {
      "pk": 2301006,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 6,
      "text": "For a nation has come up against my land, powerful and beyond number; its teeth are like lion’s teeth, and it has fangs of a lioness.",
      "links": "<a href='/AIV/23/5/26-30'>Isa. 5:26–30</a>; <a href='/AIV/34/2/11-13'>Nah. 2:11–13</a>",
      "comment": "The devastation of the locusts is described in military terms, evoking both literal and symbolic enemies. The land belongs to the Lord, emphasizing divine ownership and stewardship."
    },
    {
      "pk": 2301007,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 7,
      "text": "It has laid waste my vine and splintered my fig tree; it has stripped them bare and thrown them down; their branches are white.",
      "links": "<a href='/AIV/24/5/17'>Jer. 5:17</a>; <a href='/AIV/23/5/1-7'>Isa. 5:1–7</a>",
      "comment": "The vine and fig tree are symbols of Israel’s blessing (see Isa. 5:1-7). The loss points to judgment for unfaithfulness, but also the hope for future restoration when repentance occurs."
    },
    {
      "pk": 2301008,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 8,
      "text": "Mourn like a young woman clothed in sackcloth for the husband of her youth.",
      "links": "<a href='/AIV/28/2/2'>Hos. 2:2</a>; <a href='/AIV/25/2/10'>Lam. 2:10</a>",
      "comment": "The image of mourning a lost husband signifies intense grief. Spiritually, this echoes Israel’s relationship with the Lord—He is often portrayed as a husband to His people."
    },
    {
      "pk": 2301009,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 9,
      "text": "The grain offering and the drink offering are cut off from the house of the Lord. The priests mourn, those who minister before the Lord.",
      "links": "<a href='/AIV/24/14/12'>Jer. 14:12</a>; <a href='/AIV/28/9/4'>Hos. 9:4</a>",
      "comment": "The cessation of offerings shows how the destruction interrupts worship. Priestly intercession cannot continue without the necessary offerings, underscoring the centrality of both sacrifice and ordained ministry."
    },
    {
      "pk": 2301010,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 10,
      "text": "The field is ruined, the land mourns, because the grain is destroyed, the new wine is dried up, the oil fails.",
      "links": "<a href='/AIV/23/24/4-9'>Isa. 24:4–9</a>",
      "comment": "The land itself is described as mourning, emphasizing the holistic connection between creation, human sin, and God’s judgment. See Romans 8:22 for creation's groaning."
    },
    {
      "pk": 2301011,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 11,
      "text": "Be ashamed, O tillers of the soil; wail, O vine dressers, for the wheat and the barley, for the harvest of the field has perished.",
      "links": "<a href='/AIV/23/16/9'>Isa. 16:9</a>; <a href='/AIV/34/1/10'>Nah. 1:10</a>",
      "comment": "The call to mourn connects human failure and physical loss. The vocation of working the land is seen as both a profession and spiritual duty."
    },
    {
      "pk": 2301012,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 12,
      "text": "The vine is dried up, and the fig tree withered; pomegranate, palm, and apple—all the trees of the field are dried up, and joy is withdrawn from the sons of man.",
      "links": "<a href='/AIV/19/104/14-15'>Ps. 104:14–15</a>",
      "comment": "The loss of fruitfulness results in lost joy. Physical blessings and spiritual well-being are intertwined throughout scripture. The deprivation points forward to a greater restoration when God’s presence returns."
    },
    {
      "pk": 2301013,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 13,
      "text": "Dress yourselves and mourn, you priests; wail, you who minister before the altar. Come, spend the night in sackcloth, you ministers of my God, because the grain offering and drink offering are withheld from the house of your God.",
      "links": "<a href='/AIV/4/16/27'>Num. 16:27</a>; <a href='/AIV/25/2/10'>Lam. 2:10</a>",
      "comment": "Priests are instructed to lead in repentance, spending the night in prayer and fasting. This underscores the vital role of ordained leadership, continuous prayer, and intercessory ministry."
    },
    {
      "pk": 2301014,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 14,
      "text": "Consecrate a fast; call a solemn assembly. Gather the elders and all the inhabitants of the land to the house of the Lord your God, and cry out to the Lord.",
      "links": "<a href='/AIV/3/23/36'>Lev. 23:36</a>; <a href='/AIV/10/7/6'>1 Sam. 7:6</a>",
      "comment": "National repentance is shown to involve both fasting and formal assembly at the place of worship. This formal act points to the importance of both private and communal forms of worship and confession."
    },
    {
      "pk": 2301015,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 15,
      "text": "Alas for the day! For the day of the Lord is near, and as destruction from the Almighty it comes.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>; <a href='/AIV/30/5/18'>Amos 5:18</a>",
      "comment": "The 'Day of the Lord' theme signals both judgment and hope, a recurring motif throughout scripture ultimately fulfilled in Christ’s final coming."
    },
    {
      "pk": 2301016,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 16,
      "text": "Is not the food cut off before our eyes, joy and gladness from the house of our God?",
      "links": "<a href='/AIV/19/42/4'>Ps. 42:4</a>",
      "comment": "The connection between God's worship and joy is highlighted. Loss of worship leads to spiritual and emotional darkness, showing the centrality of gathered worship for the people."
    },
    {
      "pk": 2301017,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 17,
      "text": "The seeds shrivel under the clods; the storehouses are desolate; the granaries are broken down, because the grain has dried up.",
      "links": "<a href='/AIV/24/14/1-6'>Jer. 14:1–6</a>",
      "comment": "Every aspect of provision is affected, revealing how deeply human flourishing depends on God's ongoing providence."
    },
    {
      "pk": 2301018,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 18,
      "text": "How the beasts groan! The herds of cattle wander in confusion, because they have no pasture; even the flocks of sheep suffer.",
      "links": "<a href='/AIV/19/104/21'>Ps. 104:21</a>",
      "comment": "God’s judgment affects not only people but all creation. This reflects a cosmic scope of redemption, similar to Paul's teaching in Romans 8:19–22 on creation’s suffering and hope for liberation."
    },
    {
      "pk": 2301019,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 19,
      "text": "To you, O Lord, I cry, for fire has consumed the pastures of the wilderness, and flame has burned all the trees of the field.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>",
      "comment": "Joel himself turns to prayer, showing the proper response to calamity is turning to God with supplication. The image of fire recalls both purification and judgment."
    },
    {
      "pk": 2301020,
      "translation": "AIV",
      "book": 29,
      "chapter": 1,
      "verse": 20,
      "text": "Even the beasts of the field look up to you; for the watercourses are dried up, and fire has devoured the pastures of the wilderness.",
      "links": "<a href='/AIV/19/145/15'>Ps. 145:15</a>; <a href='/AIV/19/104/11'>Ps. 104:11</a>",
      "comment": "All creation looks to the Lord for sustenance, pointing to the Lord’s sovereignty over the whole created order and the universal longing for restoration. This points forward spiritually to Christ’s fulfillment as the source of living water and restorer of all things."
    }
  ],
  "translatedAt": "2025-12-23T07:24:23.687Z"
}