{
  "book": 67,
  "bookName": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 1,
  "verses": [
    {
      "pk": 67001001,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 1,
      "text": "Peter, an apostle of Jesus Christ, to the chosen exiles of the dispersion in Pontus, Galatia, Cappadocia, Asia, and Bithynia,",
      "links": "<a href='/AIV/44/2/9'>Acts 2:9</a>; <a href='/AIV/59/1/1'>James 1:1</a>",
      "comment": "Peter explicitly identifies himself as an apostle, reassuring the authority of this letter. Addressing Christians scattered throughout Asia Minor shows the universality and unity of the church led by the apostles."
    },
    {
      "pk": 67001002,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 2,
      "text": "chosen according to the foreknowledge of God the Father, in sanctification of the Spirit, for obedience and sprinkling with the blood of Jesus Christ: Grace and peace be multiplied to you.",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/58/9/13'>Heb. 9:13-14</a>",
      "comment": "The mention of the Father, Spirit, and Jesus Christ is a strong testimony to the Trinity. Sprinkling with blood recalls the Old Testament sacrifices (Exod. 24:8), now fulfilled spiritually in Christ."
    },
    {
      "pk": 67001003,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 3,
      "text": "Blessed be the God and Father of our Lord Jesus Christ! By his great mercy, he has caused us to be born again to a living hope through the resurrection of Jesus Christ from the dead,",
      "links": "<a href='/AIV/47/1/3'>2 Cor. 1:3</a>; <a href='/AIV/43/3/3'>John 3:3</a>; <a href='/AIV/46/15/20'>1 Cor. 15:20</a>",
      "comment": "Being 'born again' connects to the spiritual rebirth through the resurrection. This rebirth occurs in connection with Christ's resurrection—a theme deeply tied to the sacraments and new life in Christ."
    },
    {
      "pk": 67001004,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 4,
      "text": "into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you,",
      "links": "<a href='/AIV/51/1/5'>Col. 1:5</a>; <a href='/AIV/40/6/20'>Matt. 6:20</a>",
      "comment": "The use of 'inheritance' draws on Old Testament imagery of the promised land, now fulfilled in the eternal life promised to believers. The imperishability echoes the eternal nature of God's promises."
    },
    {
      "pk": 67001005,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 5,
      "text": "who by God’s power are being guarded through faith for a salvation ready to be revealed in the last time.",
      "links": "<a href='/AIV/55/4/18'>2 Tim. 4:18</a>; <a href='/AIV/65/1/24'>Jude 1:24</a>",
      "comment": "Salvation is both present and yet to be fully revealed. The safeguarding by God's power connects to assurance in the Christian life and hints at the ongoing role of divine preservation."
    },
    {
      "pk": 67001006,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 6,
      "text": "In this you rejoice, though now for a little while, if necessary, you are grieved by various trials,",
      "links": "<a href='/AIV/59/1/2'>James 1:2</a>; <a href='/AIV/45/5/3'>Rom. 5:3</a>",
      "comment": "Trials and suffering are expected in the Christian journey, but are a cause for rejoicing because of the greater hope that awaits—suggesting a spirituality of suffering sanctified by faith."
    },
    {
      "pk": 67001007,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 7,
      "text": "so that the tested genuineness of your faith—more precious than gold that perishes though it is tested by fire—may be found to result in praise and glory and honor at the revelation of Jesus Christ.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/46/3/13'>1 Cor. 3:13</a>",
      "comment": "The refining of faith through trials is likened to gold tested by fire, echoing purification themes. The 'revelation of Jesus Christ' points toward His future return, where faithfulness will be rewarded."
    },
    {
      "pk": 67001008,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 8,
      "text": "Though you have not seen him, you love him. Though you do not now see him, you believe in him and rejoice with joy that is inexpressible and filled with glory,",
      "links": "<a href='/AIV/43/20/29'>John 20:29</a>; <a href='/AIV/58/11/1'>Heb. 11:1</a>",
      "comment": "The faith of unseen love and belief mirrors Thomas’ confession, emphasizing the power and glory of faith even without physical sight of Christ."
    },
    {
      "pk": 67001009,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 9,
      "text": "obtaining the outcome of your faith, the salvation of your souls.",
      "links": "<a href='/AIV/45/6/22'>Rom. 6:22</a>",
      "comment": "The end purpose of faith is the salvation of our souls, which happens as a process, not an instant event—implying an ongoing transformation aligned with the teachings of the early church."
    },
    {
      "pk": 67001010,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 10,
      "text": "Concerning this salvation, the prophets who prophesied about the grace that was to be yours searched and inquired carefully,",
      "links": "<a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/27/9/24'>Dan. 9:24</a>",
      "comment": "The Old Testament prophets longed to understand the fullness of grace now revealed in Christ, showing the continuity of God’s plan through both Testaments."
    },
    {
      "pk": 67001011,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 11,
      "text": "inquiring what time or what manner the Spirit of Christ in them was indicating when he predicted the sufferings of Christ and the subsequent glories.",
      "links": "<a href='/AIV/42/24/26'>Luke 24:26</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "Peter identifies the 'Spirit of Christ' at work in the Old Testament prophets, connecting their writings to Christ’s suffering and glory, fulfilled in Jesus."
    },
    {
      "pk": 67001012,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 12,
      "text": "It was revealed to them that they were not serving themselves, but you, in the things that have now been announced to you through those who preached the good news to you by the Holy Spirit sent from heaven—things into which angels long to look.",
      "links": "<a href='/AIV/42/10/21'>Luke 10:21-24</a>; <a href='/AIV/49/3/10'>Eph. 3:10</a>",
      "comment": "The reference to preaching by the Holy Spirit affirms the divinely instituted ministry and the supernatural work of the Spirit in the proclamation of the good news."
    },
    {
      "pk": 67001013,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 13,
      "text": "Therefore, preparing your minds for action and being sober-minded, set your hope fully on the grace that will be brought to you at the revelation of Jesus Christ.",
      "links": "<a href='/AIV/42/12/35'>Luke 12:35</a>; <a href='/AIV/56/2/12'>Titus 2:12-13</a>",
      "comment": "Vigilant preparation and hope for the 'revelation of Jesus Christ' highlights the call to holiness and perseverance, themes central to apostolic teaching."
    },
    {
      "pk": 67001014,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 14,
      "text": "As obedient children, do not conform to the passions of your former ignorance,",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>; <a href='/AIV/49/4/22'>Eph. 4:22</a>",
      "comment": "The call to holiness requires leaving behind former sinful desires, echoing the transformation demanded in the new life in Christ."
    },
    {
      "pk": 67001015,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 15,
      "text": "but as he who called you is holy, you also be holy in all your conduct;",
      "links": "<a href='/AIV/03/19/2'>Lev. 19:2</a>; <a href='/AIV/40/5/48'>Matt. 5:48</a>",
      "comment": "Holiness is grounded in the very nature of God and is expressed in the lives of believers. This reflects divine imitation and an elevated calling for the church."
    },
    {
      "pk": 67001016,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 16,
      "text": "since it is written, 'You shall be holy, for I am holy.'",
      "links": "<a href='/AIV/03/11/44'>Lev. 11:44</a>",
      "comment": "Direct quotation from Leviticus. Reiterates continuity with the calling given to Israel, now extended to the new people of God."
    },
    {
      "pk": 67001017,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 17,
      "text": "And if you call on him as Father who judges impartially according to each one's work, conduct yourselves with fear throughout the time of your exile,",
      "links": "<a href='/AIV/44/10/34'>Acts 10:34</a>; <a href='/AIV/45/2/6'>Rom. 2:6</a>",
      "comment": "God is Judge as well as Father. Living in 'fear' reflects awe and reverence in the context of judgment by works—a balanced view that humbles and motivates obedience."
    },
    {
      "pk": 67001018,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 18,
      "text": "knowing that you were ransomed from the futile ways inherited from your forefathers, not with perishable things such as silver or gold,",
      "links": "<a href='/AIV/19/49/7'>Ps. 49:7-8</a>; <a href='/AIV/45/6/17'>Rom. 6:17</a>",
      "comment": "Redemption is spiritual, not material. The 'futile ways' refers to life without Christ, from which believers have been set free."
    },
    {
      "pk": 67001019,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 19,
      "text": "but with the precious blood of Christ, like that of a lamb without blemish or spot.",
      "links": "<a href='/AIV/02/12/5'>Ex. 12:5</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "Direct connection to the Passover Lamb of Exodus, fulfilled and superseded in Christ—the perfect sacrifice. Deep sacrificial and Eucharistic themes can be drawn here."
    },
    {
      "pk": 67001020,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 20,
      "text": "He was foreknown before the foundation of the world but made manifest in these last times for your sake,",
      "links": "<a href='/AIV/66/13/8'>Rev. 13:8</a>; <a href='/AIV/43/17/24'>John 17:24</a>",
      "comment": "Peter affirms the pre-existence and eternal plan of Christ, who was revealed at the appointed time for our salvation. This supports both the divinity and timeless mission of the Messiah."
    },
    {
      "pk": 67001021,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 21,
      "text": "who through him are believers in God, who raised him from the dead and gave him glory, so that your faith and hope are in God.",
      "links": "<a href='/AIV/44/2/24'>Acts 2:24</a>; <a href='/AIV/45/4/24'>Rom. 4:24</a>",
      "comment": "Our faith and hope are directed to God the Father, through the resurrection and glorification of Jesus, the mediator between God and man."
    },
    {
      "pk": 67001022,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 22,
      "text": "Having purified your souls by your obedience to the truth for a sincere brotherly love, love one another earnestly from a pure heart,",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/62/4/7'>1 John 4:7</a>",
      "comment": "Obedience to the truth purifies the soul and enables deep, sacrificial love—a fruit of genuine conversion and faith, not mere sentiment."
    },
    {
      "pk": 67001023,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 23,
      "text": "since you have been born again, not of perishable seed but of imperishable, through the living and abiding word of God;",
      "links": "<a href='/AIV/43/1/13'>John 1:13</a>; <a href='/AIV/59/1/18'>James 1:18</a>",
      "comment": "Spiritual rebirth is accomplished through the imperishable word of God—a clear teaching on regeneration and the effective work of God's word, which includes sacramental realities."
    },
    {
      "pk": 67001024,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 24,
      "text": "For, 'All flesh is like grass and all its glory like the flower of grass. The grass withers, and the flower falls,",
      "links": "<a href='/AIV/23/40/6'>Isa. 40:6-8</a>",
      "comment": "Direct quotation from Isaiah, emphasizing the temporary nature of earthly life and the lasting truth of God’s word."
    },
    {
      "pk": 67001025,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 1,
      "verse": 25,
      "text": "but the word of the Lord remains forever.' And this word is the good news that was preached to you.",
      "links": "<a href='/AIV/45/10/8'>Rom. 10:8</a>; <a href='/AIV/23/40/8'>Isa. 40:8</a>",
      "comment": "The eternal nature of God’s word forms the basis for the permanence of the gospel, now proclaimed authoritatively through the apostolic ministry."
    }
  ],
  "translatedAt": "2025-12-24T12:26:48.786Z"
}