{
  "book": 67,
  "bookName": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 2,
  "verses": [
    {
      "pk": 67002001,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 1,
      "text": "So, putting away all malice and all deceit and hypocrisy and envy and every kind of slander,",
      "links": "<a href='/AIV/49/4/31'>Eph. 4:31</a>; <a href='/AIV/59/3/14'>Jas. 3:14</a>",
      "comment": "Peter calls believers to set aside all wicked attitudes and actions. The words used echo apostolic teaching on moral purification as a preparation for God's service."
    },
    {
      "pk": 67002002,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 2,
      "text": "like newborn babies, crave the pure spiritual milk, so that by it you may grow up for salvation,",
      "links": "<a href='/AIV/58/5/12'>Heb. 5:12-13</a>; <a href='/AIV/46/3/2'>1 Cor. 3:2</a>",
      "comment": "Peter's metaphor urges a longing for the unadulterated message of Christ, which nourishes spiritual life. The growth 'for salvation' implies salvation as ongoing and maturing, not just a one-time event."
    },
    {
      "pk": 67002003,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 3,
      "text": "if you have tasted that the Lord is good.",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/58/6/5'>Heb. 6:5</a>",
      "comment": "Echoes the experience of God's goodness from the Old Testament. Spiritual maturity begins with encountering the goodness of God through Christ."
    },
    {
      "pk": 67002004,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 4,
      "text": "As you come to him, a living stone—rejected by people but chosen and precious in the sight of God—",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>",
      "comment": "Christ is pictured as the living stone. Though rejected by humanity (see the Passion narratives) he is chosen by God as the foundation for the Church."
    },
    {
      "pk": 67002005,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 5,
      "text": "you yourselves also, like living stones, are being built up as a spiritual house, to be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ.",
      "links": "<a href='/AIV/49/2/21'>Eph. 2:21-22</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Believers share in Christ's priesthood, offering sacrifices of praise and service. The spiritual house points to the unity and supernatural foundation of the Church, and the concept of priesthood of all believers—though with layers in leadership and liturgy as found in early Church communities."
    },
    {
      "pk": 67002006,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 6,
      "text": "For it stands in Scripture: 'Behold, I lay in Zion a chosen, precious cornerstone, and whoever believes in him will never be put to shame.'",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/45/9/33'>Rom. 9:33</a>",
      "comment": "Quotes Isaiah, linking Christ as the cornerstone to Old Testament prophecy. Belief in Christ is the basis for security and honor in God's Kingdom."
    },
    {
      "pk": 67002007,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 7,
      "text": "So, the honor is for you who believe; but for those who do not believe: 'The stone that the builders rejected has become the chief cornerstone,'",
      "links": "<a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>",
      "comment": "The cornerstone, rejected by many, becomes the essential foundation for the people of God. Jesus refers to Himself as this stone, underscoring His central role (see Matt. 21:42)."
    },
    {
      "pk": 67002008,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 8,
      "text": "and, 'A stone of stumbling and a rock of offense.' They stumble because they disobey the word, as they were destined to do.",
      "links": "<a href='/AIV/23/8/14'>Isa. 8:14</a>; <a href='/AIV/45/9/32'>Rom. 9:32'</a>",
      "comment": "Disobedience to Christ leads to spiritual ruin, as prophesied. The hints about 'destined' raise deep questions of divine providence and human response."
    },
    {
      "pk": 67002009,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 9,
      "text": "But you are a chosen race, a royal priesthood, a holy nation, a people set apart, so that you may proclaim the virtues of him who called you out of darkness into his marvelous light.",
      "links": "<a href='/AIV/2/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/23/43/20'>Isa. 43:20</a>",
      "comment": "Peter applies Old Testament terms for Israel to Christ's people, showing continuity between the covenants. The Church is seen as the true people of God, marked by holiness, royal dignity, and mission."
    },
    {
      "pk": 67002010,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 10,
      "text": "Once you were not a people, but now you are God's people; once you had not received mercy, but now you have received mercy.",
      "links": "<a href='/AIV/28/1/9-10'>Hos. 1:9-10</a>; <a href='/AIV/28/2/23'>Hos. 2:23</a>",
      "comment": "Drawing from Hosea, Peter reinforces the new identity and unity believers have through Christ, formed by God's mercy. This supports the concept of the Church as the fulfillment of God's promise for a united people."
    },
    {
      "pk": 67002011,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 11,
      "text": "Beloved, I urge you as sojourners and exiles to abstain from the desires of the flesh, which wage war against the soul.",
      "links": "<a href='/AIV/58/11/13'>Heb. 11:13</a>; <a href='/AIV/48/5/17'>Gal. 5:17</a>",
      "comment": "Believers are described as temporary residents on earth, called to spiritual discipline. The internal struggle is addressed, fostering growth in holiness and resistance to temptation through grace."
    },
    {
      "pk": 67002012,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 12,
      "text": "Keep your conduct among the Gentiles honorable, so that when they speak against you as evildoers, they may see your good works and give glory to God when he visits.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/49/5/8'>Eph. 5:8</a>",
      "comment": "Peter ties personal holiness to the wider mission: moral witness leads others to glorify God. Suggests that works have a role in the Christian witness and, indirectly, in salvation."
    },
    {
      "pk": 67002013,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 13,
      "text": "Submit yourselves for the Lord’s sake to every human authority: whether to the emperor as supreme,",
      "links": "<a href='/AIV/45/13/1'>Rom. 13:1</a>; <a href='/AIV/56/3/1'>Tit. 3:1</a>",
      "comment": "Peter stresses the importance of obedience to lawful authorities for the sake of honoring God, reflecting the Christian value of order and peaceful witness in society."
    },
    {
      "pk": 67002014,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 14,
      "text": "or to governors as those sent by him to punish evildoers and praise those who do right.",
      "links": "<a href='/AIV/45/13/3'>Rom. 13:3-4</a>",
      "comment": "Authority is meant for justice. The model for Church order, leadership, and discipline can be traced here: both civil and spiritual leaders are instruments of God’s justice and reward."
    },
    {
      "pk": 67002015,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 15,
      "text": "For this is God’s will: that by doing good you should silence the ignorance of foolish people.",
      "links": "<a href='/AIV/40/5/44-45'>Matt. 5:44-45</a>; <a href='/AIV/50/2/15'>Phil. 2:15</a>",
      "comment": "Living virtuously confounds hostility. Good works are more than evidence of faith—they fulfill God’s will for His people in the world."
    },
    {
      "pk": 67002016,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 16,
      "text": "Live as free people, but do not use your freedom as a cover-up for evil; rather, live as servants of God.",
      "links": "<a href='/AIV/48/5/13'>Gal. 5:13</a>; <a href='/AIV/43/8/36'>John 8:36</a>",
      "comment": "Freedom in Christ is not license for sin. True liberty leads to loving service, a theme prominent throughout the apostolic tradition."
    },
    {
      "pk": 67002017,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 17,
      "text": "Honor everyone. Love the brotherhood. Fear God. Honor the emperor.",
      "links": "<a href='/AIV/40/22/21'>Matt. 22:21</a>; <a href='/AIV/45/13/7'>Rom. 13:7</a>",
      "comment": "Four succinct commands summarize Christian duty: universal respect, special love for fellow believers, awe before God, and respect for those in power. This balance characterizes the way of holiness."
    },
    {
      "pk": 67002018,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 18,
      "text": "Servants, submit yourselves to your masters with all respect, not only to those who are good and gentle but also to those who are harsh.",
      "links": "<a href='/AIV/49/6/5'>Eph. 6:5</a>; <a href='/AIV/51/3/22'>Col. 3:22</a>",
      "comment": "Peter addresses social hierarchy, urging humility and obedience even in suffering, mirroring Christ's own humility—a profound example for all believers."
    },
    {
      "pk": 67002019,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 19,
      "text": "For this finds favor—if because of conscience toward God someone endures pain while suffering unjustly.",
      "links": "<a href='/AIV/40/5/10'>Matt. 5:10</a>; <a href='/AIV/45/12/14'>Rom. 12:14</a>",
      "comment": "Enduring injustice for God reflects Christ’s own suffering, and is spiritually praised. Shows the spiritual value of redemptive suffering."
    },
    {
      "pk": 67002020,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 20,
      "text": "For what credit is it if, when you sin and are beaten for it, you endure? But if when you do good and suffer for it you endure, this is commendable before God.",
      "links": "<a href='/AIV/40/5/46'>Matt. 5:46</a>; <a href='/AIV/50/1/29'>Phil. 1:29</a>",
      "comment": "True Christian virtue is to endure unjust suffering with patience and faith, following Jesus. This is held up as a model of sanctification."
    },
    {
      "pk": 67002021,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 21,
      "text": "For to this you were called, because Christ also suffered for you, leaving you an example, so that you might follow in his steps.",
      "links": "<a href='/AIV/43/13/15'>John 13:15</a>; <a href='/AIV/40/16/24'>Matt. 16:24</a>",
      "comment": "Jesus’ suffering is both redemptive and exemplary. Christians are called to pattern their lives according to the sacrificial love and obedience of Christ."
    },
    {
      "pk": 67002022,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 22,
      "text": "He committed no sin, and no deceit was found in his mouth.",
      "links": "<a href='/AIV/23/53/9'>Isa. 53:9</a>; <a href='/AIV/58/4/15'>Heb. 4:15</a>",
      "comment": "Peter cites the prophecy of the suffering servant in Isaiah. Jesus’ sinlessness is essential for His role as Redeemer, underscoring His divinity and perfection."
    },
    {
      "pk": 67002023,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 23,
      "text": "When he was insulted, he did not answer with insults; when he suffered, he did not threaten, but entrusted himself to the one who judges justly.",
      "links": "<a href='/AIV/23/53/7'>Isa. 53:7</a>; <a href='/AIV/42/23/46'>Luke 23:46</a>",
      "comment": "Christ entrusts Himself to the Father's justice. This models trust and humility for believers in suffering, prefiguring the path of saintly surrender."
    },
    {
      "pk": 67002024,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 24,
      "text": "He himself bore our sins in his body on the tree, so that we, having died to sins, might live to righteousness. By his wounds you have been healed.",
      "links": "<a href='/AIV/23/53/4-5'>Isa. 53:4-5</a>; <a href='/AIV/58/9/28'>Heb. 9:28</a>",
      "comment": "Peter affirms the substitutionary nature of Christ’s sacrifice, referencing Isaiah. The phrase links the cross to believer’s spiritual healing and sanctification, emphasizing the real transformation found in union with Christ."
    },
    {
      "pk": 67002025,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 2,
      "verse": 25,
      "text": "For you were like sheep going astray, but now you have returned to the Shepherd and Overseer of your souls.",
      "links": "<a href='/AIV/23/53/6'>Isa. 53:6</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Christ is both Shepherd and spiritual Bishop. The imagery stresses the need for one visible unity under Jesus’ oversight—applied early in the Church through apostolic leadership."
    }
  ],
  "translatedAt": "2025-12-24T12:27:12.953Z"
}