{
  "book": 67,
  "bookName": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 3,
  "verses": [
    {
      "pk": 67003001,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 1,
      "text": "In the same way, wives, submit yourselves to your own husbands so that, even if some do not obey the word, they may be won over without a word by the conduct of their wives,",
      "links": "<a href='/AIV/49/5/22'>Eph. 5:22</a>; <a href='/AIV/60/2/12'>1 Pet. 2:12</a>",
      "comment": "Peter continues his theme of submission from the previous chapter, applying it to wives. The purpose is evangelistic: godly conduct can lead unbelieving husbands to faith. The call to respectful submission reflects the order within the Christian household."
    },
    {
      "pk": 67003002,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 2,
      "text": "when they see your respectful and pure conduct.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "A wife's holy and respectful lifestyle serves as a witness of Christ's transformative power. Good works, seen by others, glorify God. Compare Jesus' teaching on light in <a href='/AIV/40/5/16'>Matthew 5:16</a>."
    },
    {
      "pk": 67003003,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 3,
      "text": "Do not let your beauty depend on outward things, such as braided hair and the wearing of gold jewelry or fine clothes,",
      "links": "<a href='/AIV/54/2/9'>1 Tim. 2:9</a>",
      "comment": "Peter is not forbidding external beauty but warns against making it the basis of worth. True adornment is inner virtue."
    },
    {
      "pk": 67003004,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 4,
      "text": "but rather let it be the hidden person of the heart, with the unfading beauty of a gentle and quiet spirit, which is very precious in God’s sight.",
      "links": "<a href='/AIV/19/51/6'>Ps. 51:6</a>",
      "comment": "Peter elevates inner spiritual beauty above external appearance. This reflects the biblical principle that God values the heart (<a href='/AIV/19/51/6'>Ps. 51:6</a>)."
    },
    {
      "pk": 67003005,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 5,
      "text": "For this is how the holy women of former times, who hoped in God, used to adorn themselves, submitting to their own husbands,",
      "links": "<a href='/AIV/01/18/12'>Gen. 18:12</a>; <a href='/AIV/23/54/5'>Isa. 54:5</a>",
      "comment": "Peter presents the matriarchs of Scripture as faith-filled examples, rooting Christian conduct in Old Testament precedent."
    },
    {
      "pk": 67003006,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 6,
      "text": "as Sarah obeyed Abraham, calling him lord. You are her children if you do what is good and do not fear any intimidation.",
      "links": "<a href='/AIV/01/18/12'>Gen. 18:12</a>; <a href='/AIV/48/4/28'>Gal. 4:28</a>",
      "comment": "Sarah is a model of respectful submission, referenced in Genesis. Being her spiritual children means walking in faith and courage, trusting God in difficult circumstances."
    },
    {
      "pk": 67003007,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 7,
      "text": "Husbands, in the same way, live with your wives with understanding, showing honor to the woman as the weaker vessel, since they also are heirs with you of the grace of life, so that your prayers may not be hindered.",
      "links": "<a href='/AIV/49/5/25'>Eph. 5:25</a>; <a href='/AIV/48/3/28'>Gal. 3:28</a>",
      "comment": "Husbands must show compassion and respect, recognizing women as co-heirs of grace. Failure to do so can block their spiritual life, implying the importance of relational peace and unity for prayer."
    },
    {
      "pk": 67003008,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 8,
      "text": "Finally, all of you, be like-minded, sympathetic, loving as brothers, tenderhearted, and humble in spirit.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "Peter calls for unity and love, summarizing the virtues of Christian community. Compare to Jesus’ commandment in <a href='/AIV/43/13/34'>John 13:34</a>. Such spiritual unity was later expressed organizationally in the growth of the universal apostolic Church."
    },
    {
      "pk": 67003009,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 9,
      "text": "Do not repay evil for evil or insult for insult, but on the contrary, bless, for to this you were called, so that you may inherit a blessing.",
      "links": "<a href='/AIV/40/5/44'>Matt. 5:44</a>; <a href='/AIV/45/12/14'>Rom. 12:14</a>",
      "comment": "Echoing Jesus’ teaching to bless enemies, Christians are called to forgive and respond with blessing, identifying them as heirs of a spiritual blessing."
    },
    {
      "pk": 67003010,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 10,
      "text": "For, 'Whoever desires to love life and see good days, let him keep his tongue from evil and his lips from deceitful speech;",
      "links": "<a href='/AIV/19/34/12'>Ps. 34:12-13</a>",
      "comment": "Peter quotes from the Psalms, showing the continuity between the Old and New Covenants and appealing to the wisdom tradition. Moral conduct is closely linked to God's blessing."
    },
    {
      "pk": 67003011,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 11,
      "text": "let him turn away from evil and do good; let him seek peace and pursue it.'",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>; <a href='/AIV/40/5/9'>Matt. 5:9</a>",
      "comment": "Continuing the Psalm quote, Peter points to the call to active goodness and peacemaking, themes strongly affirmed by Jesus in the Beatitudes."
    },
    {
      "pk": 67003012,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 12,
      "text": "For the eyes of the Lord are on the righteous, and his ears are open to their prayer. But the face of the Lord is against those who do evil.'",
      "links": "<a href='/AIV/19/34/15-16'>Ps. 34:15-16</a>",
      "comment": "God’s attentive favor to the righteous reflects the Old Testament teaching that true prayer is united to a holy life. The Church later emphasized this through the intercession of saints."
    },
    {
      "pk": 67003013,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 13,
      "text": "Who is there to harm you if you are zealous for what is good?",
      "links": "<a href='/AIV/19/56/4'>Ps. 56:4</a>",
      "comment": "Doing good generally results in favor, but Peter will next consider suffering for righteousness."
    },
    {
      "pk": 67003014,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 14,
      "text": "But even if you should suffer for righteousness’ sake, you are blessed. 'Do not fear what they fear, nor be troubled,'",
      "links": "<a href='/AIV/23/8/12'>Isa. 8:12</a>; <a href='/AIV/40/5/10'>Matt. 5:10</a>",
      "comment": "Peter draws on Isaiah and Jesus. Suffering for righteousness brings heavenly blessing, even if it means opposition from others."
    },
    {
      "pk": 67003015,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 15,
      "text": "but in your hearts honor Christ the Lord as holy, always being ready to make a defense to anyone who asks you for a reason for the hope that is in you, yet do it with gentleness and respect.",
      "links": "<a href='/AIV/23/29/23'>Isa. 29:23</a>; <a href='/AIV/51/4/6'>Col. 4:6</a>",
      "comment": "Peter instructs believers to set apart Christ as sacred in their hearts (a clear reference to Jesus' divinity) and be prepared for apologetics—explaining their faith firmly but with charity."
    },
    {
      "pk": 67003016,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 16,
      "text": "having a good conscience, so that, when you are slandered, those who speak evil against your good behavior in Christ may be put to shame.",
      "links": "<a href='/AIV/45/12/17'>Rom. 12:17</a>",
      "comment": "Holy living and a clear conscience silence the critics of faith. The Christian's conduct should be blameless even before opponents."
    },
    {
      "pk": 67003017,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 17,
      "text": "For it is better to suffer for doing good, if that should be God’s will, than for doing evil.",
      "links": "<a href='/AIV/40/5/39-45'>Matt. 5:39-45</a>",
      "comment": "Christian suffering is sometimes a part of God’s mysterious plan. The righteous may suffer, but always with the promise of vindication."
    },
    {
      "pk": 67003018,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 18,
      "text": "For Christ also suffered once for sins, the righteous for the unrighteous, that he might bring you to God. He was put to death in the flesh but made alive in the Spirit,",
      "links": "<a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/45/4/25'>Rom. 4:25</a>",
      "comment": "Christ’s suffering is the model for Christian endurance. His death and resurrection reconcile us to God, fulfilling the Suffering Servant prophecy. The language of 'made alive in the Spirit' has sacramental and resurrectional implications affirmed by the apostolic Church."
    },
    {
      "pk": 67003019,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 19,
      "text": "in which he also went and proclaimed to the spirits in prison,",
      "links": "<a href='/AIV/23/42/7'>Isa. 42:7</a>; <a href='/AIV/19/68/18'>Ps. 68:18</a>",
      "comment": "Christ’s proclamation to 'spirits in prison' alludes to His descent among the dead after the Crucifixion, a mystery interpreted by the early Church as liberation of the righteous from Hades. See the ancient understanding of Christ’s victory and descent."
    },
    {
      "pk": 67003020,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 20,
      "text": "who formerly disobeyed, when God’s patience waited in the days of Noah, while the ark was being built; in it, a few, that is, eight persons, were saved through water.",
      "links": "<a href='/AIV/01/7/23'>Gen. 7:23</a>; <a href='/AIV/58/11/7'>Heb. 11:7</a>",
      "comment": "The flood account of Noah prefigures salvation through water, with the ark as a type of the Church and baptism as an instrument of salvation."
    },
    {
      "pk": 67003021,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 21,
      "text": "Corresponding to this, baptism now saves you—not as a removal of dirt from the body but as an appeal to God for a good conscience, through the resurrection of Jesus Christ,",
      "links": "<a href='/AIV/41/16/16'>Mark 16:16</a>; <a href='/AIV/45/6/4'>Rom. 6:4</a>",
      "comment": "Baptism is explicitly said to save, not by external washing but by a sacramental appeal to God, united to Christ’s resurrection. This supports the early Church’s emphasis on sacramental grace as a means of salvation."
    },
    {
      "pk": 67003022,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 3,
      "verse": 22,
      "text": "who has gone into heaven and is at the right hand of God, with angels, authorities, and powers having been made subject to him.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/42/22/69'>Luke 22:69</a>",
      "comment": "Christ’s exaltation fulfills Psalm 110:1. His session at God's right hand establishes His authority over all spiritual powers—a strong teaching on the kingship and divinity of Jesus, forming the foundation of the apostolic confession."
    }
  ],
  "translatedAt": "2025-12-24T12:27:39.676Z"
}