{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 12,
  "verses": [
    {
      "pk": 21012001,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 1,
      "text": "Therefore, brothers, I urge you, by the mercies of God, to present your bodies as a living sacrifice, holy and pleasing to God, which is your spiritual worship.",
      "links": "<a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/45/6/13'>Rom. 6:13</a>",
      "comment": "Paul urges believers to offer themselves entirely to God, not in the old animal sacrifices but as a living, holy sacrifice. This spiritual act of worship recalls Old Testament offerings, but now fulfilled in Christ. Note the language of spiritual worship implies an ongoing, sacramental reality in the Christian life."
    },
    {
      "pk": 21012002,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 2,
      "text": "Do not be shaped by this world, but be transformed by the renewing of your mind, so that you may discern what is the good, pleasing, and perfect will of God.",
      "links": "<a href='/AIV/19/51/10'>Ps. 51:10</a>; <a href='/AIV/49/4/23'>Eph. 4:23</a>",
      "comment": "Paul instructs believers to resist conformity to worldly values, focusing on inner transformation. This ongoing renewal is a work of grace and speaks to growing in holiness, not simply a one-time event."
    },
    {
      "pk": 21012003,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 3,
      "text": "For by the grace given to me, I say to everyone among you not to think of himself more highly than he should, but to think with sober judgment, each according to the measure of faith God has assigned.",
      "links": "<a href='/AIV/46/4/7'>1 Cor. 4:7</a>; <a href='/AIV/45/1/5'>Rom. 1:5</a>",
      "comment": "Paul encourages humility, recognizing all gifts and abilities come from God's grace. The 'measure of faith' suggests differing roles and the unity found in diverse gifts, echoing themes of the Body."
    },
    {
      "pk": 21012004,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 4,
      "text": "For just as we have many parts in one body, and all the parts do not have the same function,",
      "links": "<a href='/AIV/46/12/12-27'>1 Cor. 12:12–27</a>",
      "comment": "Paul uses the imagery of the body, a key biblical metaphor for the Church, to illustrate unity in diversity among believers."
    },
    {
      "pk": 21012005,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 5,
      "text": "so we, who are many, are one body in Christ, and individually members of one another.",
      "links": "<a href='/AIV/49/4/25'>Eph. 4:25</a>; <a href='/AIV/45/12/4'>Rom. 12:4</a>",
      "comment": "This verse underscores the unity of believers as one body in Christ, emphasizing communal interdependence and the spiritual reality of being united in Christ."
    },
    {
      "pk": 21012006,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 6,
      "text": "Having gifts that differ according to the grace given to us, let us use them: if prophecy, in proportion to our faith;",
      "links": "<a href='/AIV/46/12/4-11'>1 Cor. 12:4–11</a>",
      "comment": "Paul teaches that spiritual gifts are diverse and must be exercised faithfully according to God's grace, highlighting the active role of service in the Christian life."
    },
    {
      "pk": 21012007,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 7,
      "text": "if service, in serving; if teaching, in teaching;",
      "links": "<a href='/AIV/54/3/2'>1 Tim. 3:2</a>",
      "comment": "Each gift, whether service or teaching, should be used faithfully and according to one's calling, showing the importance of both action and instruction in the life of the Church."
    },
    {
      "pk": 21012008,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 8,
      "text": "if exhortation, in exhorting; the one who gives, with generosity; the one who leads, with diligence; the one who shows mercy, with cheerfulness.",
      "links": "<a href='/AIV/52/5/12-13'>1 Thess. 5:12–13</a>",
      "comment": "Paul lists gifts for building up the community, stressing generosity, diligence, and joy as virtues, foreshadowing the abundant life found in serving God according to one's vocation."
    },
    {
      "pk": 21012009,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 9,
      "text": "Let love be without hypocrisy. Hate what is evil; hold fast to what is good.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>",
      "comment": "Love must be sincere, not merely outward. The call to reject evil and cling to the good reflects both moral and spiritual purity in following Christ."
    },
    {
      "pk": 21012010,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 10,
      "text": "Love one another deeply, with brotherly affection. Outdo one another in showing honor.",
      "links": "<a href='/AIV/60/1/22'>1 Pet. 1:22</a>; <a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "Paul highlights self-giving love and honor, echoing Jesus' command to love one another. This goes beyond feelings to sacrificial action, mirroring Christ's love."
    },
    {
      "pk": 21012011,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 11,
      "text": "Do not be slothful in zeal, be fervent in spirit, serve the Lord.",
      "links": "<a href='/AIV/66/3/15-16'>Rev. 3:15–16</a>",
      "comment": "Zeal and fervency are marks of authentic Christian discipleship, calling believers to passionate and persistent service."
    },
    {
      "pk": 21012012,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 12,
      "text": "Rejoice in hope, be patient in tribulation, be constant in prayer.",
      "links": "<a href='/AIV/52/5/17'>1 Thess. 5:17</a>; <a href='/AIV/45/5/2-5'>Rom. 5:2–5</a>",
      "comment": "Hope, endurance, and prayer are central virtues, modeled by Christ and the saints. Perpetual prayer is seen as vital to spiritual growth and perseverance."
    },
    {
      "pk": 21012013,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 13,
      "text": "Contribute to the needs of the saints and practice hospitality.",
      "links": "<a href='/AIV/58/13/2'>Heb. 13:2</a>; <a href='/AIV/60/4/9'>1 Pet. 4:9</a>",
      "comment": "Generosity and hospitality toward fellow believers is a mark of true discipleship. This recalls early Christian communal practice and the dignity of the poor and marginalized."
    },
    {
      "pk": 21012014,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 14,
      "text": "Bless those who persecute you; bless and do not curse them.",
      "links": "<a href='/AIV/40/5/44'>Matt. 5:44</a>; <a href='/AIV/60/3/9'>1 Pet. 3:9</a>",
      "comment": "Christ's teaching on loving enemies is reaffirmed. This radical forgiveness goes beyond justice, reflecting Christ’s own example and teaching on mercy."
    },
    {
      "pk": 21012015,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 15,
      "text": "Rejoice with those who rejoice, weep with those who weep.",
      "links": "<a href='/AIV/46/12/26'>1 Cor. 12:26</a>",
      "comment": "This verse points to the depth of Christian solidarity and compassion, echoing the communal nature of Christian life. All suffer and rejoice together, as members of one body."
    },
    {
      "pk": 21012016,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 16,
      "text": "Live in harmony with one another. Do not be proud, but associate with the humble. Do not be wise in your own eyes.",
      "links": "<a href='/AIV/20/3/7'>Prov. 3:7</a>; <a href='/AIV/45/11/25'>Rom. 11:25</a>",
      "comment": "Humility and harmony are promoted, countering pride and division. The call to associate with the humble reflects Christ's humility and servant leadership."
    },
    {
      "pk": 21012017,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 17,
      "text": "Repay no one evil for evil, but give thought to what is honorable in the sight of all.",
      "links": "<a href='/AIV/40/5/39'>Matt. 5:39</a>; <a href='/AIV/60/3/16'>1 Pet. 3:16</a>",
      "comment": "Paul restates Christ's teaching to reject vengeance. The pursuit of honor, rightly understood, affirms justice and public witness of Christian lives."
    },
    {
      "pk": 21012018,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 18,
      "text": "If possible, so far as it depends on you, live peaceably with all.",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>; <a href='/AIV/58/12/14'>Heb. 12:14</a>",
      "comment": "The Christian call to peace is universal but recognizes human limitations. Peace marks authentic participation in Christ’s mission and echoes his teaching on peace-making."
    },
    {
      "pk": 21012019,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 19,
      "text": "Beloved, never avenge yourselves, but leave room for God’s wrath, for it is written, “Vengeance is mine, I will repay, says the Lord.”",
      "links": "<a href='/AIV/5/32/35'>Deut. 32:35</a>; <a href='/AIV/19/94/1'>Ps. 94:1</a>",
      "comment": "Justice ultimately belongs to God, not individuals. This affirms God as judge and calls believers to entrust retribution and justice to Him, moving beyond human retaliation."
    },
    {
      "pk": 21012020,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 20,
      "text": "If your enemy is hungry, feed him; if he is thirsty, give him a drink; for by doing so, you will heap burning coals on his head.",
      "links": "<a href='/AIV/20/25/21-22'>Prov. 25:21–22</a>",
      "comment": "Paul quotes Proverbs, advocating practical love for enemies. Repaying evil with good reflects Christ’s transformative grace, leading to repentance and conversion."
    },
    {
      "pk": 21012021,
      "translation": "AIV",
      "book": 45,
      "chapter": 12,
      "verse": 21,
      "text": "Do not be overcome by evil, but overcome evil with good.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/60/3/9'>1 Pet. 3:9</a>",
      "comment": "The final admonition calls Christians to active goodness that conquers evil, echoing Christ’s victory over sin through love and self-sacrifice."
    }
  ],
  "translatedAt": "2025-12-23T03:36:13.032Z"
}