{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 3,
  "verses": [
    {
      "pk": 4500301,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 1,
      "text": "Then what advantage has the Jew? Or what is the value of circumcision?",
      "links": "<a href='/AIV/9/15/22'>1 Sam. 15:22</a>; <a href='/AIV/1/17/10'>Gen. 17:10</a>",
      "comment": "Paul opens by addressing the unique privileges of the Jewish people, particularly their covenant sign. This points to the idea that God prepares a people with special privileges for a purpose."
    },
    {
      "pk": 4500302,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 2,
      "text": "Much in every way. Firstly, because they were entrusted with the very words of God.",
      "links": "<a href='/AIV/19/147/19-20'>Ps. 147:19–20</a>; <a href='/AIV/5/4/7-8'>Deut. 4:7–8</a>",
      "comment": "Israel receiving God’s Word foreshadows the entrusted role of passing on divine revelation through history, which aligns with the idea of God establishing a visible, authoritative means for preserving truth."
    },
    {
      "pk": 4500303,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 3,
      "text": "What if some were unfaithful? Does their lack of faith make the faithfulness of God void?",
      "links": "<a href='/AIV/4/23/19'>Num. 23:19</a>; <a href='/AIV/19/89/33-34'>Ps. 89:33–34</a>",
      "comment": "Paul highlights that even when people fail, God remains faithful. This implicitly rebukes those who might judge God by human failings. In the Church era, this principle supports the reliability of God’s promises despite human shortcomings."
    },
    {
      "pk": 4500304,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 4,
      "text": "Absolutely not! Let God be true, even if every human is a liar. As it is written, 'so that you may be justified in your words, and prevail when you judge.'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Paul quotes David’s confession, stressing God’s righteousness above all. God’s faithfulness is the standard. The phrase supports the idea of judging history in light of God’s authority and not solely according to sinful humanity."
    },
    {
      "pk": 4500305,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 5,
      "text": "But if our unrighteousness demonstrates the righteousness of God, what shall we say? Is God unjust to inflict wrath? (I am speaking in human terms.)",
      "links": "<a href='/AIV/45/6/19'>Rom. 6:19</a>",
      "comment": "Paul anticipates objections, showing that God remains just even as He brings mercy from sin. This sets the stage for how divine justice and mercy interact—key to Christian understanding of justification."
    },
    {
      "pk": 4500306,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 6,
      "text": "Certainly not! For then how could God judge the world?",
      "links": "<a href='/AIV/01/18/25'>Gen. 18:25</a>",
      "comment": "Judgment is part of God’s authority and plan. This underlines a universal standard of justice that undergirds all of history."
    },
    {
      "pk": 4500307,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 7,
      "text": "But if through my lie God’s truth abounds to his glory, why am I still being judged as a sinner?",
      "links": "<a href='/AIV/45/6/1'>Rom. 6:1</a>",
      "comment": "Paul confronts those who abuse grace. The continual ethical responsibility of believers, even after receiving grace, is affirmed."
    },
    {
      "pk": 4500308,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 8,
      "text": "And why not say—as we are slanderously accused and as some claim we say—'Let us do evil, so that good may come'? Their condemnation is just.",
      "links": "<a href='/AIV/45/6/1-2'>Rom. 6:1–2</a>",
      "comment": "Paul distances himself from moral laxity. This affirms both the need for right doctrine and for a moral life—a foundational principle for Christian community."
    },
    {
      "pk": 4500309,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 9,
      "text": "What then? Are we Jews any better off? Not at all. For we have already charged that both Jews and Greeks are all under sin.",
      "links": "<a href='/AIV/45/1/18-32'>Rom. 1:18–32</a>; <a href='/AIV/45/2/1-29'>Rom. 2:1–29</a>",
      "comment": "All humanity, regardless of background or privilege, is under sin. This universalizes the need for God’s salvation."
    },
    {
      "pk": 4500310,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 10,
      "text": "As it is written: 'None is righteous, not even one.'",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "Paul compiles Old Testament texts demonstrating universal need for grace. See <a href='/AIV/19/143/2'>Ps. 143:2</a>."
    },
    {
      "pk": 4500311,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 11,
      "text": "'There is no one who understands; there is no one who seeks God.'",
      "links": "<a href='/AIV/19/14/2-3'>Ps. 14:2–3</a>",
      "comment": "Paul’s quotation shows not only universal guilt but the effect of sin in darkening reason and will."
    },
    {
      "pk": 4500312,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 12,
      "text": "'All have turned aside; together they have become worthless. No one does good, not even one.'",
      "links": "<a href='/AIV/19/53/3'>Ps. 53:3</a>",
      "comment": "This emphasizes collective sinfulness, a point echoing the biblical theme of humanity’s need for redemption."
    },
    {
      "pk": 4500313,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 13,
      "text": "'Their throats are open graves; with their tongues they deceive.' 'The poison of vipers is under their lips.'",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>; <a href='/AIV/19/140/3'>Ps. 140:3</a>",
      "comment": "Speech reveals the depth of sin. Notably, sin’s effects are shown in both thought and word."
    },
    {
      "pk": 4500314,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 14,
      "text": "'Their mouths are full of curses and bitterness.'",
      "links": "<a href='/AIV/19/10/7'>Ps. 10:7</a>",
      "comment": "This summary links inner corruption with outward fruit, connecting to Jesus’s own words in Matt. 12:34."
    },
    {
      "pk": 4500315,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 15,
      "text": "'Their feet are swift to shed blood;'",
      "links": "<a href='/AIV/23/59/7'>Isa. 59:7</a>",
      "comment": "Old Testament prophecy is quoted to reveal how violence is a result of the sin condition of all humanity."
    },
    {
      "pk": 4500316,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 16,
      "text": "'ruin and misery mark their paths,'",
      "links": "<a href='/AIV/23/59/7-8'>Isa. 59:7–8</a>",
      "comment": "Paul continues his citation, emphasizing the destructive social effects of sin."
    },
    {
      "pk": 4500317,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 17,
      "text": "'and the way of peace they have not known.'",
      "links": "<a href='/AIV/23/59/8'>Isa. 59:8</a>",
      "comment": "Apart from God, true peace is unattainable."
    },
    {
      "pk": 4500318,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 18,
      "text": "'There is no fear of God before their eyes.'",
      "links": "<a href='/AIV/19/36/1'>Ps. 36:1</a>",
      "comment": "Paul’s final Old Testament citation signals that true wisdom and righteousness begin with reverence for God."
    },
    {
      "pk": 4500319,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 19,
      "text": "Now we know that whatever the law says, it speaks to those who are under the law, so that every mouth may be silenced, and the whole world held accountable to God.",
      "links": "<a href='/AIV/19/107/42'>Ps. 107:42</a>; <a href='/AIV/45/2/12'>Rom. 2:12</a>",
      "comment": "The law convicts all, preparing for a universal need for mercy. The idea of a divinely ordained authority as teacher is implied."
    },
    {
      "pk": 4500320,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 20,
      "text": "For by works of the law no one will be justified in his sight, for through the law comes knowledge of sin.",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/48/2/16'>Gal. 2:16</a>",
      "comment": "This key verse shows the law reveals sin but cannot save. Justification is deeper than ritual observance and manual effort, it involves God’s grace."
    },
    {
      "pk": 4500321,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 21,
      "text": "But now the righteousness of God has been revealed apart from the law, though the Law and the Prophets bear witness to it—",
      "links": "<a href='/AIV/24/23/6'>Jer. 23:6</a>; <a href='/AIV/53/3/9'>2 Thes. 3:9</a>",
      "comment": "God’s saving action is both a fulfillment and a surpassing of what was foreshadowed in the Old Testament. The Law and Prophets were types pointing to Christ as the true righteousness."
    },
    {
      "pk": 4500322,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 22,
      "text": "the righteousness of God through faith in Jesus Christ for all who believe. For there is no distinction,",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/10/22/31'>2 Sam. 22:31</a>",
      "comment": "Salvation is for all who believe, through Christ’s mediation. Faith is personal, but always enters into God’s covenant family."
    },
    {
      "pk": 4500323,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 23,
      "text": "for all have sinned and fall short of the glory of God,",
      "links": "<a href='/AIV/62/1/8-10'>1 John 1:8–10</a>; <a href='/AIV/45/5/12'>Rom. 5:12</a>",
      "comment": "This universal declaration ties back to Adam (cf. Rom. 5:12). All require grace and cannot boast."
    },
    {
      "pk": 4500324,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 24,
      "text": "and are justified freely by his grace, through the redemption that is in Christ Jesus.",
      "links": "<a href='/AIV/49/1/7'>Eph. 1:7</a>; <a href='/AIV/46/1/30'>1 Cor. 1:30</a>",
      "comment": "Redemption and justification are gifts from God through Christ. The language evokes liturgical and sacramental ideas of grace applied to believers."
    },
    {
      "pk": 4500325,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 25,
      "text": "God presented him as a propitiation through faith in his blood, to demonstrate his righteousness, because in his forbearance he had passed over former sins.",
      "links": "<a href='/AIV/03/16/15'>Lev. 16:15</a>; <a href='/AIV/62/2/2'>1 John 2:2</a>",
      "comment": "Reference to 'propitiation' echoes the mercy seat (hilasterion) of the Old Testament (cf. Lev. 16:15). Christ fulfills the sacrificial system, offering atonement for sin. Faith is active trust in the power of this sacrifice, implying more than mental assent."
    },
    {
      "pk": 4500326,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 26,
      "text": "It was to demonstrate his righteousness at the present time, so that he might be just and the justifier of the one who has faith in Jesus.",
      "links": "<a href='/AIV/45/1/17'>Rom. 1:17</a>; <a href='/AIV/62/1/9'>1 John 1:9</a>",
      "comment": "God’s justice and mercy meet in Christ. Here is an early summary of how God’s grace is both totally unearned and yet truly transformative for those united with Christ."
    },
    {
      "pk": 4500327,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 27,
      "text": "Where then is boasting? It is excluded. By what kind of law? Of works? No, but by the law of faith.",
      "links": "<a href='/AIV/49/2/8-9'>Eph. 2:8–9</a>",
      "comment": "Pride is ended. Boasting in works or pedigree is silenced, reinforcing the shared community gathered by faith."
    },
    {
      "pk": 4500328,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 28,
      "text": "For we maintain that a person is justified by faith apart from works of the law.",
      "links": "<a href='/AIV/48/2/16'>Gal. 2:16</a>; <a href='/AIV/59/2/24'>James 2:24</a>",
      "comment": "Sola fide is affirmed, but see James 2:24 for the role of works as proof of living faith. Grace initiates, but cooperation and transformation follow."
    },
    {
      "pk": 4500329,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 29,
      "text": "Or is God the God of Jews only? Is he not also the God of Gentiles? Yes, of Gentiles also.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/45/10/12'>Rom. 10:12</a>",
      "comment": "God’s plan is inclusive by design, involving all peoples in one unified covenant."
    },
    {
      "pk": 4500330,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 30,
      "text": "Since God is one—he will justify the circumcised by faith and the uncircumcised through that same faith.",
      "links": "<a href='/AIV/05/6/4'>Deut. 6:4</a>; <a href='/AIV/48/3/6-8'>Gal. 3:6–8</a>",
      "comment": "The unity of God calls for a unified people, justified by faith but joined together by shared belief in Christ’s one sacrifice."
    },
    {
      "pk": 4500331,
      "translation": "AIV",
      "book": 45,
      "chapter": 3,
      "verse": 31,
      "text": "Do we then make the law void through faith? Absolutely not! Instead, we uphold the law.",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>; <a href='/AIV/45/7/12'>Rom. 7:12</a>",
      "comment": "Faith does not nullify the Law's purpose, but fulfills it in a richer way through Christ. The moral law is still upheld but transformed and deepened, not abandoned. Tradition and continuity are key to understanding God’s plan."
    }
  ],
  "translatedAt": "2025-12-23T03:31:52.605Z"
}