{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 2,
  "verses": [
    {
      "pk": 3002001,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 1,
      "text": "Therefore you have no excuse, O man, whoever you are who judges. For in passing judgment on another, you condemn yourself, because you who judge practice the same things.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1-2</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Paul reminds us that hypocrisy in judging others brings condemnation on ourselves, echoing Jesus’ teaching (Matthew 7:1-2). The emphasis is on humility and self-awareness before God’s standards."
    },
    {
      "pk": 3002002,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 2,
      "text": "But we know that the judgment of God rightly falls upon those who practice such things.",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>; <a href='/AIV/45/1/32'>Rom. 1:32</a>",
      "comment": "God’s judgment is just and impartial, based not on human opinion but divine truth (Psalm 96:13)."
    },
    {
      "pk": 3002003,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 3,
      "text": "Do you suppose, O man—you who judge those who practice such things and yet do them yourself—that you will escape the judgment of God?",
      "links": "<a href='/AIV/19/50/21'>Ps. 50:21</a>; <a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "Paul warns against presumption; we cannot hide our sins by merely condemning others. True repentance is required."
    },
    {
      "pk": 3002004,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 4,
      "text": "Or do you disregard the riches of his kindness and tolerance and patience, not knowing that God’s kindness is meant to lead you to repentance?",
      "links": "<a href='/AIV/19/86/15'>Ps. 86:15</a>; <a href='/AIV/60/3/9'>2 Pet. 3:9</a>",
      "comment": "God’s patience is not approval, but an invitation to repent (2 Peter 3:9). Repentance is central to receiving mercy and grace."
    },
    {
      "pk": 3002005,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 5,
      "text": "But because of your stubbornness and unrepentant heart, you are storing up wrath for yourself on the day of wrath, when God’s righteous judgment will be revealed.",
      "links": "<a href='/AIV/36/1/15'>Zeph. 1:15</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "Unrepentance results in accumulating wrath for the final judgment (cf. Revelation 20:12). This verse highlights the necessity of ongoing repentance."
    },
    {
      "pk": 3002006,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 6,
      "text": "He will repay each person according to his deeds.",
      "links": "<a href='/AIV/19/62/12'>Ps. 62:12</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>",
      "comment": "Scripture consistently teaches that God will judge each person’s works (Matthew 16:27; Psalm 62:12). Faith works through love in the life of the believer."
    },
    {
      "pk": 3002007,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 7,
      "text": "To those who by perseverance in doing good seek glory, honor, and immortality, he will give eternal life.",
      "links": "<a href='/AIV/48/6/8'>Gal. 6:8-9</a>; <a href='/AIV/43/5/29'>John 5:29</a>",
      "comment": "Endurance in good works is linked to the hope of eternal life, showing salvation involves a lived response to God’s grace (cf. Galatians 6:8-9)."
    },
    {
      "pk": 3002008,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 8,
      "text": "But for those who are self-seeking and do not obey the truth but obey unrighteousness, there will be wrath and fury.",
      "links": "<a href='/AIV/50/2/21'>Phil. 2:21</a>; <a href='/AIV/53/1/8'>2 Thess. 1:8</a>",
      "comment": "Judgment comes upon those who reject truth and persist in sin. The spiritual life involves ongoing obedience to God’s truth."
    },
    {
      "pk": 3002009,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 9,
      "text": "There will be tribulation and distress for every human being who does evil, to the Jew first and also to the Greek.",
      "links": "<a href='/AIV/45/1/16'>Rom. 1:16</a>; <a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "God’s judgment is impartial, coming first to those who received greater revelation (the Jew), then to all others (the Greek)."
    },
    {
      "pk": 3002010,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 10,
      "text": "But glory, honor, and peace for everyone who does good, for the Jew first and also for the Greek.",
      "links": "<a href='/AIV/45/1/16'>Rom. 1:16</a>; <a href='/AIV/19/37/37'>Ps. 37:37</a>",
      "comment": "The blessings of covenant faithfulness are available to all who respond to God with obedience, whether Jew or Gentile."
    },
    {
      "pk": 3002011,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 11,
      "text": "For there is no partiality with God.",
      "links": "<a href='/AIV/05/10/17'>Deut. 10:17</a>; <a href='/AIV/44/10/34'>Acts 10:34</a>",
      "comment": "God’s justice is universal and fair—no one is exempt, and no one is favored unjustly (Deuteronomy 10:17)."
    },
    {
      "pk": 3002012,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 12,
      "text": "For all who sinned without the Law will also perish without the Law, and all who sinned under the Law will be judged by the Law.",
      "links": "<a href='/AIV/45/4/15'>Rom. 4:15</a>; <a href='/AIV/51/3/25'>Col. 3:25</a>",
      "comment": "Everyone is accountable; those without the Law (Gentiles) perish apart from it, but those with it (Jews) are held to it."
    },
    {
      "pk": 3002013,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 13,
      "text": "For it is not the hearers of the Law who are righteous before God, but the doers of the Law who will be justified.",
      "links": "<a href='/AIV/59/1/22'>James 1:22</a>; <a href='/AIV/40/7/21'>Matt. 7:21</a>",
      "comment": "Justification is not by knowledge alone but by living out the law in faith (James 1:22). Works spring from true faith."
    },
    {
      "pk": 3002014,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 14,
      "text": "For when Gentiles, who do not have the Law, by nature do what the Law requires, they are a law to themselves, even though they do not have the Law.",
      "links": "<a href='/AIV/45/1/19'>Rom. 1:19</a>; <a href='/AIV/43/1/9'>John 1:9</a>",
      "comment": "Gentiles show the moral law is written on the human heart (see John 1:9—“true light” that enlightens everyone)."
    },
    {
      "pk": 3002015,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 15,
      "text": "They show that the work of the Law is written on their hearts, while their conscience also bears witness, and their thoughts sometimes accusing them and at other times defending them.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/62/3/19-20'>1 John 3:19-20</a>",
      "comment": "The heart’s conscience reflects God’s moral code (see Jeremiah 31:33). This foreshadows what is promised in the new covenant—the law written on the heart."
    },
    {
      "pk": 3002016,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 16,
      "text": "On that day, according to my gospel, God will judge the secrets of men by Christ Jesus.",
      "links": "<a href='/AIV/19/44/21'>Ps. 44:21</a>; <a href='/AIV/62/2/28'>1 John 2:28</a>",
      "comment": "Final judgment is through Jesus Christ, who reveals even what is hidden (cf. Psalm 44:21, 1 John 2:28). Christ’s divine authority is emphasized here."
    },
    {
      "pk": 3002017,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 17,
      "text": "But if you call yourself a Jew and rely on the Law and boast in God",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>",
      "comment": "Paul addresses those who find security in heritage or law, highlighting the necessity of genuine obedience."
    },
    {
      "pk": 3002018,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 18,
      "text": "and know his will and approve what is excellent because you are instructed from the Law,",
      "links": "<a href='/AIV/19/119/66'>Ps. 119:66</a>",
      "comment": "Knowing God’s will is a privilege, but it must be lived out, not merely understood intellectually."
    },
    {
      "pk": 3002019,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 19,
      "text": "and if you are convinced that you are a guide to the blind, a light to those in darkness,",
      "links": "<a href='/AIV/23/42/6-7'>Isa. 42:6-7</a>",
      "comment": "Israel was called to be a light to the nations (see Isaiah 42:6-7), but must be inwardly transformed first."
    },
    {
      "pk": 3002020,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 20,
      "text": "an instructor of the foolish, a teacher of children, having in the Law the embodiment of knowledge and truth—",
      "links": "<a href='/AIV/55/3/15'>2 Tim. 3:15</a>",
      "comment": "The Mosaic Law contains knowledge and truth, but living the truth fully means embracing its fulfillment in Christ."
    },
    {
      "pk": 3002021,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 21,
      "text": "you then who teach others, do you not teach yourself? While you preach against stealing, do you steal?",
      "links": "<a href='/AIV/40/23/3'>Matt. 23:3</a>",
      "comment": "Paul exposes hypocrisy, paralleling Jesus’ warnings about teachers who do not practice what they preach (Matthew 23:3)."
    },
    {
      "pk": 3002022,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 22,
      "text": "You who say that one must not commit adultery, do you commit adultery? You who abhor idols, do you rob temples?",
      "links": "<a href='/AIV/62/3/4'>1 John 3:4</a>; <a href='/AIV/40/5/27-28'>Matt. 5:27-28</a>",
      "comment": "True righteousness moves beyond external obedience to inner purity (cf. Matthew 5:27-28), showing a spiritual and literal call to holiness."
    },
    {
      "pk": 3002023,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 23,
      "text": "You who boast in the Law dishonor God by breaking the Law.",
      "links": "<a href='/AIV/26/36/20-21'>Ezek. 36:20-21</a>",
      "comment": "Breaking the Law while boasting in it brings dishonor to God’s name; the faith must be lived, not just professed."
    },
    {
      "pk": 3002024,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 24,
      "text": "For, as it is written, 'The name of God is blasphemed among the Gentiles because of you.'",
      "links": "<a href='/AIV/23/52/5'>Isa. 52:5</a>; <a href='/AIV/26/36/22'>Ezek. 36:22</a>",
      "comment": "Quoting Isaiah 52:5, Paul points to how hypocrisy among God’s people causes others to blaspheme God's name. True holiness is a witness."
    },
    {
      "pk": 3002025,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 25,
      "text": "For circumcision is indeed of value if you keep the Law, but if you break the Law, your circumcision becomes uncircumcision.",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/48/5/6'>Gal. 5:6</a>",
      "comment": "Outward signs point to an inward reality. True belonging to God is demonstrated by faithful life, not mere ritual."
    },
    {
      "pk": 3002026,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 26,
      "text": "So if a man who is uncircumcised keeps the requirements of the Law, will not his uncircumcision be counted as circumcision?",
      "links": "<a href='/AIV/40/8/11-12'>Matt. 8:11-12</a>; <a href='/AIV/62/2/29'>1 John 2:29</a>",
      "comment": "Obedience of faith matters more than outward identity. The new covenant opens God’s people to all who live according to His commands."
    },
    {
      "pk": 3002027,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 27,
      "text": "Then he who is physically uncircumcised but keeps the Law will condemn you who have the written code and circumcision but break the Law.",
      "links": "<a href='/AIV/40/21/43'>Matt. 21:43</a>",
      "comment": "Faithfulness counts before God, not external signs alone. Those outside may judge those inside by their actions."
    },
    {
      "pk": 3002028,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 28,
      "text": "For one is not a Jew who is merely outwardly so, nor is circumcision only outward and physical.",
      "links": "<a href='/AIV/24/9/25-26'>Jer. 9:25-26</a>",
      "comment": "True covenant membership is a matter of the heart, not just ritual. This points to the promise of an interior renewal."
    },
    {
      "pk": 3002029,
      "translation": "AIV",
      "book": 45,
      "chapter": 2,
      "verse": 29,
      "text": "But a Jew is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the letter; and his praise is not from man but from God.",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/50/3/3'>Phil. 3:3</a>",
      "comment": "Paul refers to the transformation of the heart by the Spirit. The Spirit’s renewal fulfills the promises of a new heart and demonstrates genuine membership in the new people of God."
    }
  ],
  "translatedAt": "2025-12-23T03:30:59.028Z"
}