{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 7,
  "verses": [
    {
      "pk": 790701,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 1,
      "text": "Or do you not know, brothers—for I am speaking to those who know the law—that the law rules over a person only as long as he lives?",
      "links": "<a href='/AIV/48/4/1-7'>Gal. 4:1–7</a>",
      "comment": "Paul begins by addressing believers familiar with Mosaic law, laying groundwork for the main argument that the law is not eternally binding on a person after death. This sets up the discussion on freedom in Christ."
    },
    {
      "pk": 790702,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 2,
      "text": "For a married woman is bound by law to her husband while he lives, but if her husband dies, she is released from the law of marriage.",
      "links": "<a href='/AIV/1/2/24'>Gen. 2:24</a>",
      "comment": "Paul uses marriage as an analogy for the law’s binding effect, drawing on the Torah’s definition of marital law (cf. Genesis 2:24)."
    },
    {
      "pk": 790703,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 3,
      "text": "So then, if she joins another man while her husband is alive, she will be called an adulteress. But if her husband dies, she is free from that law, so that she is not an adulteress if she marries another man.",
      "links": "<a href='/AIV/3/20/10'>Ex. 20:10</a>",
      "comment": "Paul extends the analogy to show lawful remarriage only after death releases the first bond, emphasizing the authority of the law until death."
    },
    {
      "pk": 790704,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 4,
      "text": "Therefore, my brothers, you also have died to the law through the body of Christ so that you might belong to another, to him who has been raised from the dead, in order that we may bear fruit for God.",
      "links": "<a href='/AIV/48/2/19-20'>Gal. 2:19–20</a>; <a href='/AIV/43/15/5'>John 15:5</a>",
      "comment": "Here, Paul draws a parallel to spiritual union with Christ through death to the law. The fruitfulness referenced echoes Christ’s teaching in John 15 on abiding in Him—spiritual union produces divine fruit."
    },
    {
      "pk": 790705,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 5,
      "text": "For while we were living in the flesh, our sinful passions stirred up by the law were at work in our bodies to bear fruit for death.",
      "links": "<a href='/AIV/48/5/19-21'>Gal. 5:19–21</a>",
      "comment": "Paul says that the law makes people aware of sin, which leads to sinful actions and ultimately to death, contrasting the ‘fruit for death’ with fruit for God."
    },
    {
      "pk": 790706,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 6,
      "text": "But now we are released from the law, having died to that by which we were held captive, so that we serve in the new way of the Spirit, and not in the old way of the written code.",
      "links": "<a href='/AIV/47/3/6'>2 Cor. 3:6</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "Paul contrasts serving ‘in the new way of the Spirit’ against ‘the old way of the written code’, referencing Jeremiah’s prophecy of the law written on the heart—a spiritual fulfillment. The new way points to the transforming work of the Spirit through grace and the sacramental life."
    },
    {
      "pk": 790707,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 7,
      "text": "What then shall we say? That the law is sin? By no means! On the contrary, I would not have known sin except through the law. For I would not have known what it is to covet if the law had not said, 'You shall not covet.'",
      "links": "<a href='/AIV/2/20/17'>Ex. 20:17</a>; <a href='/AIV/19/19/7'>Ps. 19:7</a>",
      "comment": "Paul clarifies the law itself isn’t sinful, using coveting as an example. The law exposes sin but isn’t the cause."
    },
    {
      "pk": 790708,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 8,
      "text": "But sin, taking opportunity through the commandment, produced in me all kinds of coveting. For apart from the law, sin lies dead.",
      "links": "<a href='/AIV/46/15/56'>1 Cor. 15:56</a>",
      "comment": "Sin becomes active when the law is present; it awakens sinful desires through the commandment. Paul exposes the paradox of law provoking sinful behavior."
    },
    {
      "pk": 790709,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 9,
      "text": "I was alive once apart from the law, but when the commandment came, sin came alive and I died.",
      "links": "<a href='/AIV/1/2/17'>Gen. 2:17</a>",
      "comment": "Echoes the Fall—Adam’s initial innocence before the commandment and subsequent spiritual death."
    },
    {
      "pk": 790710,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 10,
      "text": "And the very commandment that was meant for life proved to be death for me.",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>",
      "comment": "Leviticus 18:5 offers life for keeping the law, but fallen humanity can’t fulfill it, resulting in condemnation."
    },
    {
      "pk": 790711,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 11,
      "text": "For sin, seizing the opportunity through the commandment, deceived me and through it killed me.",
      "links": "<a href='/AIV/1/3/13'>Gen. 3:13</a>",
      "comment": "As in Genesis, deception leads to spiritual death. Paul highlights sin’s power to twist good things for evil ends."
    },
    {
      "pk": 790712,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 12,
      "text": "So then, the law is holy, and the commandment is holy and righteous and good.",
      "links": "<a href='/AIV/19/19/8'>Ps. 19:8</a>",
      "comment": "Affirms the Mosaic law as good and holy, reflecting God’s nature."
    },
    {
      "pk": 790713,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 13,
      "text": "Did that which is good, then, become death to me? Never! But sin, that it might be shown to be sin, produces death through what is good, so that through the commandment sin might be exceedingly sinful.",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "The law exposes the gravity of sin; death comes from sin, not from the law."
    },
    {
      "pk": 790714,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 14,
      "text": "For we know that the law is spiritual, but I am fleshly, sold under sin.",
      "links": "<a href='/AIV/19/119/77'>Ps. 119:77</a>",
      "comment": "The law has spiritual origins from God, but Paul identifies human nature as enslaved to sin. This sets up the theme of needing deliverance beyond human effort."
    },
    {
      "pk": 790715,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 15,
      "text": "For I do not understand my own actions. For I do not do what I want, but I do the very thing I hate.",
      "links": "<a href='/AIV/50/2/13'>Phil. 2:13</a>",
      "comment": "Paul’s description matches the paradox of fallen free will: we struggle to do what is right without divine help."
    },
    {
      "pk": 790716,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 16,
      "text": "If I do what I do not want, I agree that the law is good.",
      "links": "<a href='/AIV/19/119/97'>Ps. 119:97</a>",
      "comment": "Acknowledges human inability, but recognizes the goodness of the law."
    },
    {
      "pk": 790717,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 17,
      "text": "So now it is no longer I who do it, but sin that dwells within me.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>",
      "comment": "Paul personifies sin’s power, distinguishing the redeemed self from indwelling sin."
    },
    {
      "pk": 790718,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 18,
      "text": "For I know that nothing good dwells in me, that is, in my flesh. For I have the desire to do what is right, but not the ability to carry it out.",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>",
      "comment": "Admits human incapacity, underscoring the need for a supernatural solution."
    },
    {
      "pk": 790719,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 19,
      "text": "For I do not do the good I want, but the evil I do not want, that I keep on doing.",
      "links": "<a href='/AIV/23/64/6'>Isa. 64:6</a>",
      "comment": "Paul reiterates the ongoing struggle with sin, showing the limits of willpower and self-reliance."
    },
    {
      "pk": 790720,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 20,
      "text": "Now if I do what I do not want, it is no longer I who do it, but sin that dwells within me.",
      "links": "<a href='/AIV/19/31/10'>Ps. 31:10</a>",
      "comment": "Repeated for emphasis; highlights the need for deliverance from sin’s indwelling power, not just forgiveness."
    },
    {
      "pk": 790721,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 21,
      "text": "So I find this law at work: when I want to do good, evil lies close at hand.",
      "links": "<a href='/AIV/19/36/1'>Ps. 36:1</a>",
      "comment": "A principle Paul observes universally—sin’s proximity to human effort."
    },
    {
      "pk": 790722,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 22,
      "text": "For I delight in the law of God in my inner being.",
      "links": "<a href='/AIV/19/40/8'>Ps. 40:8</a>",
      "comment": "True discipleship involves an inner delight in God’s law, pointing to a transformation that goes beyond mere external obedience."
    },
    {
      "pk": 790723,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 23,
      "text": "But I see another law at work in my members, waging war against the law of my mind and making me captive to the law of sin that dwells in my members.",
      "links": "<a href='/AIV/19/119/133'>Ps. 119:133</a>",
      "comment": "Paul references an ongoing internal battle, echoing spiritual warfare imagery from Psalms."
    },
    {
      "pk": 790724,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 24,
      "text": "Wretched man that I am! Who will deliver me from this body of death?",
      "links": "<a href='/AIV/19/38/4'>Ps. 38:4</a>",
      "comment": "This desperate cry is the climax of the chapter, expressing human powerlessness and the necessity for a divine savior, foreshadowing the need for both forgiveness and transformation through sacraments and grace."
    },
    {
      "pk": 790725,
      "translation": "AIV",
      "book": 45,
      "chapter": 7,
      "verse": 25,
      "text": "Thanks be to God through Jesus Christ our Lord! So then, I myself serve the law of God with my mind, but with my flesh I serve the law of sin.",
      "links": "<a href='/AIV/46/15/57'>1 Cor. 15:57</a>; <a href='/AIV/19/119/34'>Ps. 119:34</a>",
      "comment": "Concludes with hope in Jesus Christ—He is the deliverer from sin’s power. The tension between flesh and spirit urges believers toward ongoing conversion and reliance on divine grace, highlighting the need for communal worship, spiritual formation, and a sacramental life rooted in union with Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:33:43.462Z"
}