{
  "book": 52,
  "bookName": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 10,
  "verses": [
    {
      "pk": 52010001,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 1,
      "text": "Brothers, my heart's desire and prayer to God for them is that they might be saved.",
      "links": "<a href='/AIV/51/9/3'>Rom. 9:3</a>; <a href='/AIV/52/10/9-13'>Rom. 10:9-13</a>",
      "comment": "Paul begins this chapter expressing deep concern for the salvation of his fellow Israelites, emphasizing the universality of God’s desire to save all men. The theme of intercessory prayer for others is highlighted (see 1 Tim. 2:1-4)."
    },
    {
      "pk": 52010002,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 2,
      "text": "For I testify about them that they have a zeal for God, but not according to knowledge.",
      "links": "<a href='/AIV/44/22/3'>Acts 22:3</a>; <a href='/AIV/51/8/7'>Rom. 8:7</a>",
      "comment": "Paul recognizes the zealous devotion of Israel, yet points out it lacks true, saving understanding. A reminder that faith and relationship with God require both zeal and right teaching (see Prov. 19:2)."
    },
    {
      "pk": 52010003,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 3,
      "text": "For, being ignorant of God's righteousness and seeking to establish their own, they did not submit to the righteousness of God.",
      "links": "<a href='/AIV/50/3/9'>Phil. 3:9</a>; <a href='/AIV/19/71/16'>Ps. 71:16</a>",
      "comment": "Self-righteousness contrasts with receiving the gift of true righteousness from God. This echoes Paul’s earlier point that righteousness is received through faith and not by human effort alone (see Gal. 2:21)."
    },
    {
      "pk": 52010004,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 4,
      "text": "For Christ is the end of the law for righteousness to everyone who believes.",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>; <a href='/AIV/48/3/24'>Gal. 3:24</a>",
      "comment": "‘End’ (Greek: telos) means fulfillment—Christ completes and perfects the law. True righteousness is found in Him, requiring faith and not merely works. This points to how the Christian life is united to Christ through faith and obedience."
    },
    {
      "pk": 52010005,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 5,
      "text": "For Moses writes about the righteousness based on the law: 'The person who does these things shall live by them.'",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>; <a href='/AIV/48/3/12'>Gal. 3:12</a>",
      "comment": "Paul quotes Moses to show that the law required complete obedience (see Lev. 18:5). True life, however, comes through faith, not law-keeping alone (see Hab. 2:4)."
    },
    {
      "pk": 52010006,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 6,
      "text": "But the righteousness based on faith says, 'Do not say in your heart, “Who will ascend into heaven?”' (that is, to bring Christ down),",
      "links": "<a href='/AIV/5/30/12'>Deut. 30:12</a>; <a href='/AIV/43/3/13'>John 3:13</a>",
      "comment": "Paul alludes to Deuteronomy, showing that faith is accessible. We cannot attain or bring down Christ by our efforts; salvation is not far off or beyond our reach."
    },
    {
      "pk": 52010007,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 7,
      "text": "'or “Who will descend into the abyss?”' (that is, to bring Christ up from the dead).",
      "links": "<a href='/AIV/5/30/13'>Deut. 30:13</a>; <a href='/AIV/40/12/40'>Matt. 12:40</a>",
      "comment": "Christ’s resurrection has already occurred—we do not need to perform extraordinary acts. Christ is present and accessible through faith in Him, echoing the spiritual and sacramental union with Him."
    },
    {
      "pk": 52010008,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 8,
      "text": "But what does it say? 'The word is near you, in your mouth and in your heart'; that is, the word of faith that we proclaim.",
      "links": "<a href='/AIV/5/30/14'>Deut. 30:14</a>; <a href='/AIV/58/4/2'>Heb. 4:2</a>",
      "comment": "Paul shows that the salvation message is not distant but present—received in faith through hearing, confessing, and believing. This highlights the importance of the proclaimed word and the necessity of both internal faith and external confession."
    },
    {
      "pk": 52010009,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 9,
      "text": "Because if you confess with your mouth 'Jesus is Lord' and believe in your heart that God raised him from the dead, you will be saved.",
      "links": "<a href='/AIV/46/12/3'>1 Cor. 12:3</a>; <a href='/AIV/43/20/28'>John 20:28</a>",
      "comment": "Salvation involves both belief (faith of the heart) and confession (public testimony). ‘Jesus is Lord’ is a high Christological statement, affirming Jesus’ divinity (see Phil. 2:11)."
    },
    {
      "pk": 52010010,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 10,
      "text": "For with the heart a person believes and is justified, and with the mouth one confesses and is saved.",
      "links": "<a href='/AIV/51/3/28'>Rom. 3:28</a>; <a href='/AIV/45/8/37'>Acts 8:37</a>",
      "comment": "Justification is connected to faith in the heart, while confession relates to salvation in a public and communal context, showing that faith must reach both inward conviction and outward expression—reflecting the importance of both personal faith and formal profession."
    },
    {
      "pk": 52010011,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 11,
      "text": "For the Scripture says, 'Everyone who believes in him will not be put to shame.'",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/60/2/6'>1 Pet. 2:6</a>",
      "comment": "Quoting Isaiah, Paul affirms the reliability of faith in Christ for all people. Believers are assured they will not be abandoned or disappointed. This promise applies universally, prefiguring the unity of all God’s people in faith."
    },
    {
      "pk": 52010012,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 12,
      "text": "For there is no difference between Jew and Greek; for the same Lord is Lord of all, richly blessing all who call upon him.",
      "links": "<a href='/AIV/51/3/29'>Rom. 3:29</a>; <a href='/AIV/44/10/34-36'>Acts 10:34-36</a>",
      "comment": "Salvation is universally offered by the one Lord to all nations, a central truth for the faith community. This points to the essential unity and universality of God’s plan of salvation."
    },
    {
      "pk": 52010013,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 13,
      "text": "For 'everyone who calls on the name of the Lord will be saved.'",
      "links": "<a href='/AIV/29/2/32'>Joel 2:32</a>; <a href='/AIV/44/2/21'>Acts 2:21</a>",
      "comment": "Paul quotes Joel, applying a prophecy about the Lord to Jesus, showing Jesus as the divine Savior. This verse affirms the necessity to call upon the Lord, both inwardly and in communal worship (see Acts 2:21)."
    },
    {
      "pk": 52010014,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 14,
      "text": "How then will they call on him in whom they have not believed? And how will they believe in him of whom they have not heard? And how will they hear without a preacher?",
      "links": "<a href='/AIV/41/16/15'>Mark 16:15</a>; <a href='/AIV/52/1/16'>Rom. 1:16</a>",
      "comment": "Paul shows the necessity of apostolic preaching. The order—sending, preaching, hearing, believing, and calling—forms the basis of how faith is transmitted (see Matt. 28:19-20; 1 Cor. 1:21)."
    },
    {
      "pk": 52010015,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 15,
      "text": "And how are they to preach unless they are sent? As it is written, 'How beautiful are the feet of those who proclaim good news!'",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/52/15/20'>Rom. 15:20</a>",
      "comment": "The need for authorized sending (mission) is emphasized—faith comes through the message delivered by those officially sent. This points to the foundational role of apostolic ministry and the ongoing, visible church."
    },
    {
      "pk": 52010016,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 16,
      "text": "But they have not all obeyed the gospel. For Isaiah says, 'Lord, who has believed what he has heard from us?'",
      "links": "<a href='/AIV/23/53/1'>Isa. 53:1</a>; <a href='/AIV/43/12/38'>John 12:38</a>",
      "comment": "Paul notes not everyone accepts the gospel, quoting the Suffering Servant passage in Isaiah. The pattern of rejection is seen throughout salvation history (see John 12:37–38)."
    },
    {
      "pk": 52010017,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 17,
      "text": "So faith comes from hearing, and hearing through the word of Christ.",
      "links": "<a href='/AIV/52/1/8'>Rom. 1:8</a>; <a href='/AIV/43/17/20'>John 17:20</a>",
      "comment": "Faith is produced through hearing the proclamation of Christ’s word. This highlights the necessity of revealed and preached faith, particularly as transmitted through the apostolic tradition and the church."
    },
    {
      "pk": 52010018,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 18,
      "text": "But I say, have they not heard? Indeed they have, for 'Their voice has gone out to all the earth, and their words to the ends of the world.'",
      "links": "<a href='/AIV/19/19/4'>Ps. 19:4</a>; <a href='/AIV/45/1/8'>Acts 1:8</a>",
      "comment": "Paul cites Psalm 19 to show the universal spread of the gospel—faith is available to all. The worldwide mission of the church echoes this, indicating God’s revelation isn’t limited to one people."
    },
    {
      "pk": 52010019,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 19,
      "text": "But I ask, did Israel not understand? First Moses says, 'I will make you jealous of those who are not a nation; I will make you angry with a foolish nation.'",
      "links": "<a href='/AIV/5/32/21'>Deut. 32:21</a>; <a href='/AIV/45/11/11'>Rom. 11:11</a>",
      "comment": "Paul points out Israel’s rejection of God was foretold, and that gentiles coming to faith would provoke Israel to reconsider. God’s mysterious plan even uses jealousy for salvation’s sake."
    },
    {
      "pk": 52010020,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 20,
      "text": "And Isaiah is so bold as to say, 'I was found by those who did not seek me; I revealed myself to those who did not ask for me.'",
      "links": "<a href='/AIV/23/65/1'>Isa. 65:1</a>; <a href='/AIV/45/9/30'>Rom. 9:30</a>",
      "comment": "This affirms God’s outreach to the gentiles, showing a plan for all nations to be brought into His one family. God’s grace often surprises by reaching outside expected boundaries."
    },
    {
      "pk": 52010021,
      "translation": "AIV",
      "book": 52,
      "bookName": "Romans",
      "bookAbbreviation": "Rom",
      "chapter": 10,
      "verse": 21,
      "text": "But concerning Israel he says, 'All day long I have held out my hands to a disobedient and contrary people.'",
      "links": "<a href='/AIV/23/65/2'>Isa. 65:2</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "God’s patient love and persistent call to Israel is evident; yet despite ongoing rebellion, He continually invites His people back. This points to God’s mercy and the ongoing invitation to all, mediated through the unity and structure of the one people of God."
    }
  ],
  "translatedAt": "2025-12-24T11:40:39.790Z"
}