{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 10,
  "verses": [
    {
      "pk": 2940010,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 1,
      "text": "Brothers, my heart’s desire and prayer to God for Israel is for their salvation.",
      "links": "<a href='/AIV/45/9/3'>Rom. 9:3</a>; <a href='/AIV/11/8/28-29'>1 Kings 8:28-29</a>",
      "comment": "Paul begins with deep compassion and prayer for Israel, desiring their salvation. The emphasis on interceding for others’ salvation reflects the communal nature of Christian prayer and the importance of praying for the conversion of others."
    },
    {
      "pk": 2940011,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 2,
      "text": "For I testify about them that they have zeal for God, but not according to knowledge.",
      "links": "<a href='/AIV/44/22/3'>Acts 22:3</a>; <a href='/AIV/45/9/31'>Rom. 9:31</a>",
      "comment": "Zeal without true knowledge is not enough for salvation. Proper formation in faith and understanding is needed, showing the value of sound teaching and tradition guided by God."
    },
    {
      "pk": 2940012,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 3,
      "text": "For, being ignorant of God’s righteousness and seeking to establish their own, they did not submit to the righteousness of God.",
      "links": "<a href='/AIV/45/1/17'>Rom. 1:17</a>; <a href='/AIV/50/3/9'>Phil. 3:9</a>",
      "comment": "Paul contrasts human attempts at free-standing righteousness with submission to the righteousness revealed by God. True righteousness is received through faith and obedience, not invented individually."
    },
    {
      "pk": 2940013,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 4,
      "text": "For Christ is the end of the law for righteousness to everyone who believes.",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>; <a href='/AIV/48/3/24'>Gal. 3:24</a>",
      "comment": "Christ fulfills and completes the law, making Him the culmination and true interpreter of God’s covenant. The law points to Christ, who brings its purpose to fulfillment in the new covenant."
    },
    {
      "pk": 2940014,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 5,
      "text": "For Moses writes about the righteousness that comes from the law: ‘The person who does these things shall live by them.’",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>; <a href='/AIV/48/3/12'>Gal. 3:12</a>",
      "comment": "Paul quotes Leviticus, showing the requirement of total obedience for righteousness by the law. This lays the groundwork for understanding why salvation through works of the law alone is impossible."
    },
    {
      "pk": 2940015,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 6,
      "text": "But the righteousness based on faith says, ‘Do not say in your heart, “Who will ascend into heaven?”’ (that is, to bring Christ down),",
      "links": "<a href='/AIV/5/30/12'>Deut. 30:12</a>; <a href='/AIV/43/3/13'>John 3:13</a>",
      "comment": "Paul refers to Deuteronomy, showing that salvation is not by impossible human striving. Faith places trust in God’s initiative in the incarnation and revelation of Christ."
    },
    {
      "pk": 2940016,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 7,
      "text": "Or, ‘Who will descend into the abyss?’ (that is, to bring Christ up from the dead).",
      "links": "<a href='/AIV/5/30/13'>Deut. 30:13</a>; <a href='/AIV/66/1/18'>Rev. 1:18</a>",
      "comment": "No one can bring Christ up from the dead by their own power. The focus is on God’s power and the assurance of Christ’s resurrection, which brings salvation near to believers."
    },
    {
      "pk": 2940017,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 8,
      "text": "But what does it say? ‘The word is near you, in your mouth and in your heart’ (that is, the word of faith that we proclaim):",
      "links": "<a href='/AIV/5/30/14'>Deut. 30:14</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "The Gospel message is immediately accessible; it is present in believers’ own speech and hearts. Faith is not distant but graciously offered here and now."
    },
    {
      "pk": 2940018,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 9,
      "text": "Because if you confess with your mouth that Jesus is Lord, and believe in your heart that God raised Him from the dead, you will be saved.",
      "links": "<a href='/AIV/43/20/28'>John 20:28</a>; <a href='/AIV/45/4/24'>Rom. 4:24</a>",
      "comment": "Salvation is tied to belief and public confession that Jesus is Lord—a key Christological statement of His divinity and authority. This aligns with the early practice of confession of faith before entry into the Christian community."
    },
    {
      "pk": 2940019,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 10,
      "text": "For with the heart one believes and is justified, and with the mouth one confesses and is saved.",
      "links": "<a href='/AIV/40/10/32'>Matt. 10:32</a>; <a href='/AIV/45/5/1'>Rom. 5:1</a>",
      "comment": "True conversion involves both inward faith and outward confession. This models the practice of publicly confessing faith and participating in the life of the Church."
    },
    {
      "pk": 2940020,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 11,
      "text": "For the Scripture says, ‘Everyone who believes in Him will not be put to shame.’",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/45/9/33'>Rom. 9:33</a>",
      "comment": "Paul affirms the universal reach of God’s promise. This verse highlights the faithfulness of God and can recall baptismal formulas marking entry into the Church."
    },
    {
      "pk": 2940021,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 12,
      "text": "For there is no distinction between Jew and Greek; for the same Lord is Lord of all, richly blessing all who call on Him.",
      "links": "<a href='/AIV/45/3/29'>Rom. 3:29</a>; <a href='/AIV/29/2/32'>Joel 2:32</a>",
      "comment": "God’s saving promise extends to all peoples. The emphasis on universality reflects the unity of believers around the one true Lord, breaking down old barriers through the new covenant."
    },
    {
      "pk": 2940022,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 13,
      "text": "For, ‘Everyone who calls on the name of the Lord will be saved.’",
      "links": "<a href='/AIV/29/2/32'>Joel 2:32</a>; <a href='/AIV/45/2/4'>Rom. 2:4</a>",
      "comment": "Paul quotes the Old Testament to show that salvation has always been offered to those who call upon God sincerely. Early Christians saw calling on the Lord as both prayer and as participation in sacramental life."
    },
    {
      "pk": 2940023,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 14,
      "text": "How then will they call on Him in whom they have not believed? And how are they to believe in Him of whom they have never heard? And how are they to hear without someone preaching?",
      "links": "<a href='/AIV/45/15/18-21'>Rom. 15:18–21</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "The necessity of preaching the Gospel is emphasized. God uses humans as instruments to bring others to faith—a clear teaching about the vital role of apostolic preaching and mission."
    },
    {
      "pk": 2940024,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 15,
      "text": "And how are they to preach unless they are sent? As it is written, ‘How beautiful are the feet of those who bring good news!’",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/52/2/4'>1 Thess. 2:4</a>",
      "comment": "Only those who are sent with authority can preach. This points to the importance of a divinely instituted mission and the continuity of authority from Christ through His chosen messengers."
    },
    {
      "pk": 2940025,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 16,
      "text": "But not all have obeyed the gospel. For Isaiah says, ‘Lord, who has believed what he has heard from us?’",
      "links": "<a href='/AIV/23/53/1'>Isa. 53:1</a>; <a href='/AIV/43/12/38'>John 12:38</a>",
      "comment": "Even when the message is faithfully preached, not everyone responds. This echoes Isaiah's prophecy of rejection of the Servant, fulfilled in Christ, and mirrors the ongoing resistance to apostolic teaching."
    },
    {
      "pk": 2940026,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 17,
      "text": "So faith comes from hearing, and hearing through the word of Christ.",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>; <a href='/AIV/62/1/1-3'>1 John 1:1-3</a>",
      "comment": "Faith is received by hearing the word of Christ as it is authoritatively preached. This underscores the importance of listening to the legitimate teaching ministry established by Christ."
    },
    {
      "pk": 2940027,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 18,
      "text": "But I ask, have they not heard? Indeed they have, for ‘Their voice has gone out to all the earth, and their words to the ends of the world.’",
      "links": "<a href='/AIV/19/19/4'>Psalm 19:4</a>; <a href='/AIV/51/1/6'>Col. 1:6</a>",
      "comment": "Paul uses Psalm 19 to show the worldwide scope of the Gospel proclamation by the apostles. This echoes the universal mission of the Church to reach all nations."
    },
    {
      "pk": 2940028,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 19,
      "text": "But I ask, did Israel not understand? First Moses says, ‘I will make you jealous of those who are not a nation; with a foolish nation I will make you angry.’",
      "links": "<a href='/AIV/5/32/21'>Deut. 32:21</a>; <a href='/AIV/45/11/11'>Rom. 11:11</a>",
      "comment": "Moses foretells that Israel would become jealous as salvation extends to the Gentiles. This introduces a spiritual dynamic in God’s plan to provoke a return through Israel’s response."
    },
    {
      "pk": 2940029,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 20,
      "text": "Then Isaiah is bold and says, ‘I was found by those who did not seek Me; I revealed Myself to those who did not ask for Me.’",
      "links": "<a href='/AIV/23/65/1'>Isa. 65:1</a>; <a href='/AIV/45/9/30'>Rom. 9:30</a>",
      "comment": "Paul notes that God reaches out to the Gentiles—those who were not looking for Him—further affirming the mercy and universal openness of the covenant."
    },
    {
      "pk": 2940030,
      "translation": "AIV",
      "book": 45,
      "chapter": 10,
      "verse": 21,
      "text": "But to Israel he says, ‘All day long I have held out My hands to a disobedient and contrary people.’",
      "links": "<a href='/AIV/23/65/2'>Isa. 65:2</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "God’s faithfulness endures despite Israel’s resistance. His patient outreach parallels the perpetual invitation into the community of the faithful and the hope for all to return to Him."
    }
  ],
  "translatedAt": "2025-12-23T03:35:26.231Z"
}