{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 4,
  "verses": [
    {
      "pk": 400401,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 1,
      "text": "What then shall we say that Abraham, our ancestor according to the flesh, has found?",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/45/3/27'>Rom. 3:27</a>",
      "comment": "Paul begins by appealing to Abraham, emphasizing the continuity between Old and New Covenants—key for understanding salvation history."
    },
    {
      "pk": 400402,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 2,
      "text": "For if Abraham was justified by works, he has something to boast about, but not before God.",
      "links": "<a href='/AIV/49/2/8-9'>Eph. 2:8-9</a>; <a href='/AIV/1/17/10'>Gen. 17:10</a>",
      "comment": "Paul differentiates between boasting before men and righteousness before God, emphasizing God's initiative in justification."
    },
    {
      "pk": 400403,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 3,
      "text": "For what does the Scripture say? 'Abraham believed God, and it was counted to him as righteousness.'",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/48/3/6'>Gal. 3:6</a>",
      "comment": "Paul quotes Genesis 15:6, establishing the principle that faith receives righteousness. The importance of believing in God’s promise foreshadows the necessity of personal trust yet within the faith handed down."
    },
    {
      "pk": 400404,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 4,
      "text": "Now to the one who works, his wages are not counted as a gift but as what is due.",
      "links": "<a href='/AIV/11/17/10-22'>1 Kings 17:10–22</a>",
      "comment": "Paul presents a key contrast—salvation as a gift, not as the result of merit, conveying the primacy of grace in true faith."
    },
    {
      "pk": 400405,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 5,
      "text": "But to the one who does not work but believes in him who justifies the ungodly, his faith is counted as righteousness.",
      "links": "<a href='/AIV/45/3/22'>Rom. 3:22</a>",
      "comment": "Justification is extended to the ungodly through faith—God’s action takes precedence, but the response of faith includes trust and active following."
    },
    {
      "pk": 400406,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 6,
      "text": "Just as David also speaks of the blessing of the person to whom God counts righteousness apart from works:",
      "links": "<a href='/AIV/19/32/1-2'>Ps. 32:1-2</a>",
      "comment": "Paul uses David to show the continuity of this teaching with Israel’s Scriptures, inviting the reader to see God’s plan through both Old and New Testaments."
    },
    {
      "pk": 400407,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 7,
      "text": "'Blessed are those whose lawless deeds are forgiven, and whose sins are covered;",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1</a>",
      "comment": "Forgiveness is not merely for past actions. It implies reconciliation, a spiritual restoration that points to the ongoing need for confession and contrition."
    },
    {
      "pk": 400408,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 8,
      "text": "blessed is the person against whom the Lord will not count his sin.'",
      "links": "<a href='/AIV/19/32/2'>Ps. 32:2</a>",
      "comment": "Paul repeats David to emphasize the certainty and completeness of God’s mercy when sins are not imputed—a teaching fulfilled in Christ."
    },
    {
      "pk": 400409,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 9,
      "text": "Is this blessing then only for the circumcised, or also for the uncircumcised? For we say that faith was counted to Abraham as righteousness.",
      "links": "<a href='/AIV/1/17/11'>Gen. 17:11</a>",
      "comment": "Paul expands the promise beyond Israel, foreshadowing the unity of all believers. The faith of Abraham precedes the sign of circumcision—suggesting a universal community."
    },
    {
      "pk": 400410,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 10,
      "text": "How then was it counted? Was it before or after he was circumcised? It was not after, but before he was circumcised.",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/1/17/24'>Gen. 17:24</a>",
      "comment": "Paul notes that faith comes before external signs, but this does not minimize the value of sacramental signs that confirm spiritual realities."
    },
    {
      "pk": 400411,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 11,
      "text": "He received the sign of circumcision as a seal of the righteousness he had by faith while he was still uncircumcised. This was to make him the father of all who believe without being circumcised, so that righteousness could be counted to them also,",
      "links": "<a href='/AIV/1/17/10-11'>Gen. 17:10-11</a>; <a href='/AIV/48/3/7'>Gal. 3:7</a>",
      "comment": "Physical signs act as seals and visible testimonies of grace—a theme continued in the new covenant’s sacramental life."
    },
    {
      "pk": 400412,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 12,
      "text": "and to make him the father of the circumcised who are not only circumcised but also walk in the footsteps of the faith that our father Abraham had before he was circumcised.",
      "links": "<a href='/AIV/48/3/29'>Gal. 3:29</a>",
      "comment": "Paul stresses not just the external sign but the necessity of obedient faith, foreshadowing the importance of persevering in faith and actions."
    },
    {
      "pk": 400413,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 13,
      "text": "For the promise to Abraham and his offspring that he would be the heir of the world did not come through the law but through the righteousness of faith.",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/1/22/18'>Gen. 22:18</a>",
      "comment": "The promise precedes the Mosaic Law, suggesting that God’s plan was always intended for all nations through a faith that is living and transformative."
    },
    {
      "pk": 400414,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 14,
      "text": "For if those who are of the law are to be heirs, faith is empty and the promise is void.",
      "links": "<a href='/AIV/48/2/21'>Gal. 2:21</a>",
      "comment": "Paul insists that trusting solely in the law nullifies the promise, reaffirming that faith takes primacy—but this faith is not isolated from a larger tradition."
    },
    {
      "pk": 400415,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 15,
      "text": "For the law brings wrath, but where there is no law, there is no transgression.",
      "links": "<a href='/AIV/45/5/13'>Rom. 5:13</a>",
      "comment": "The law reveals sin and holds people accountable; without revelation, sin is unknown. The larger teaching office of the community interprets the law."
    },
    {
      "pk": 400416,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 16,
      "text": "That is why it depends on faith, so that the promise may rest on grace and be guaranteed to all his offspring—not only to those of the law but also to those who share the faith of Abraham, who is the father of us all,",
      "links": "<a href='/AIV/48/3/14'>Gal. 3:14</a>",
      "comment": "The universality of the promise—fulfilled in Christ—extends to all who walk like Abraham. The faith community is gathered and united in one."
    },
    {
      "pk": 400417,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 17,
      "text": "As it is written, 'I have made you the father of many nations'—in the presence of the God in whom he believed, who gives life to the dead and calls into being what does not exist.",
      "links": "<a href='/AIV/1/17/5'>Gen. 17:5</a>; <a href='/AIV/58/11/12'>Heb. 11:12</a>",
      "comment": "The God of Abraham is the Creator—calling forth life and fulfilling promises. This foreshadows resurrection, a central tenet of Christian hope."
    },
    {
      "pk": 400418,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 18,
      "text": "In hope he believed against hope, so that he should become the father of many nations, as he had been told, 'So shall your offspring be.'",
      "links": "<a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "Abraham’s faith was unwavering even when fulfillment seemed impossible, modeling the perseverance needed for discipleship."
    },
    {
      "pk": 400419,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 19,
      "text": "He did not weaken in faith when he considered his own body, which was as good as dead (since he was about a hundred years old), or when he considered the deadness of Sarah’s womb.",
      "links": "<a href='/AIV/1/17/17'>Gen. 17:17</a>",
      "comment": "Abraham’s trust in God’s creative power—despite apparent impossibilities—mirrors the faith required to believe in the resurrection and God’s ongoing intervention."
    },
    {
      "pk": 400420,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 20,
      "text": "He did not waver through unbelief in regard to the promise of God, but grew strong in his faith as he gave glory to God,",
      "links": "<a href='/AIV/58/11/11'>Heb. 11:11</a>",
      "comment": "Genuine faith grows through trials. Adoration and worship strengthen trust in God—a pattern continued in regular communal worship."
    },
    {
      "pk": 400421,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 21,
      "text": "fully convinced that God was able to do what he had promised.",
      "links": "<a href='/AIV/1/18/14'>Gen. 18:14</a>; <a href='/AIV/42/1/37'>Luke 1:37</a>",
      "comment": "God’s faithfulness is absolute. This serves as a foundation for faith in the new covenant—especially trust in the power of sacramental graces."
    },
    {
      "pk": 400422,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 22,
      "text": "That is why his faith was 'counted to him as righteousness.'",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>",
      "comment": "Righteousness comes by faith that trusts and acts upon God’s word, a harmony of belief and obedience foundational to authentic discipleship."
    },
    {
      "pk": 400423,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 23,
      "text": "But the words 'it was counted to him' were not written for his sake alone,",
      "links": "<a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "Scripture’s word is living and directed to future generations as well, inviting all to be part of one faithful community."
    },
    {
      "pk": 400424,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 24,
      "text": "but for ours also. It will be counted to us who believe in him who raised Jesus our Lord from the dead,",
      "links": "<a href='/AIV/44/13/30'>Acts 13:30</a>; <a href='/AIV/46/15/4'>1 Cor. 15:4</a>",
      "comment": "The righteousness of faith now comes through faith in Jesus, whose resurrection confirms him as Lord and Messiah—fulfilling prophecy and founding a new people."
    },
    {
      "pk": 400425,
      "translation": "AIV",
      "book": 45,
      "chapter": 4,
      "verse": 25,
      "text": "who was delivered up for our transgressions and was raised for our justification.",
      "links": "<a href='/AIV/23/53/5'>Isa. 53:5</a>; <a href='/AIV/45/5/16'>Rom. 5:16</a>",
      "comment": "Christ’s death and resurrection achieve both forgiveness of sins and securing our righteous standing—fulfilling the Law, prophets, and all spiritual requirements. The work of Christ is perfect, but appropriation of this gift is through continual faith, worship, and repentance within the community."
    }
  ],
  "translatedAt": "2025-12-23T03:32:23.122Z"
}