{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 1,
  "verses": [
    {
      "pk": 900001,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, a servant of Jesus Christ, called to be an apostle, set apart for the gospel of God,",
      "links": "<a href='/AIV/46/9/1'>1 Cor. 9:1</a>; <a href='/AIV/48/1/15'>Gal. 1:15</a>",
      "comment": "Paul introduces himself as both servant and apostle, showing submission and authority. 'Set apart' recalls the idea of divine calling and consecration (cf. Jeremiah 1:5)."
    },
    {
      "pk": 900002,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 2,
      "text": "Which He promised beforehand through His prophets in the Holy Scriptures,",
      "links": "<a href='/AIV/23/53/1-12'>Isaiah 53</a>; <a href='/AIV/26/36/26-27'>Ezekiel 36:26–27</a>",
      "comment": "Paul affirms that the gospel is rooted in Old Testament prophecy, signaling continuity between God's promises and their fulfillment in Christ."
    },
    {
      "pk": 900003,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 3,
      "text": "Concerning His Son, who was descended from David according to the flesh,",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>",
      "comment": "Jesus' Davidic lineage fulfills messianic prophecy (cf. 2 Sam. 7:13), affirming the humanity and royal mission of Christ."
    },
    {
      "pk": 900004,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 4,
      "text": "And was declared to be the Son of God in power according to the Spirit of holiness by His resurrection from the dead, Jesus Christ our Lord.",
      "links": "<a href='/AIV/19/2/7'>Psalm 2:7</a>; <a href='/AIV/40/28/6'>Matt. 28:6</a>",
      "comment": "Christ's resurrection confirms His divine Sonship and messianic authority; 'Spirit of holiness' may imply both the Holy Spirit and Christ's sinlessness."
    },
    {
      "pk": 900005,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 5,
      "text": "Through whom we have received grace and apostleship to bring about the obedience of faith among all the nations, for His name’s sake,",
      "links": "<a href='/AIV/44/26/17-18'>Acts 26:17–18</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "'Obedience of faith' combines belief and action—suggesting faith is lived out, not just intellectual assent. Universal scope echoes Psalm 22:27."
    },
    {
      "pk": 900006,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 6,
      "text": "Including you who are called to belong to Jesus Christ,",
      "links": "<a href='/AIV/44/2/39'>Acts 2:39</a>",
      "comment": "‘Called to belong’ depicts Christians as being chosen out of the world for Christ, echoing Old Testament election themes."
    },
    {
      "pk": 900007,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 7,
      "text": "To all who are in Rome, loved by God and called to be saints: Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/46/1/2'>1 Cor. 1:2</a>; <a href='/AIV/03/19/2'>Lev. 19:2</a>",
      "comment": "‘Called to be saints’ implies holiness is a vocation for all believers, not just a moral status. The greeting uses a formula reinforcing unity and participation in divine life."
    },
    {
      "pk": 900008,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 8,
      "text": "First, I thank my God through Jesus Christ for all of you, because your faith is proclaimed throughout the whole world.",
      "links": "<a href='/AIV/46/4/17'>1 Cor. 4:17</a>; <a href='/AIV/19/98/3'>Ps. 98:3</a>",
      "comment": "Paul’s gratitude and praise reflect both personal and communal aspects of Christian life. Faith’s propagation emphasizes the mission and visibility of the Church."
    },
    {
      "pk": 900009,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 9,
      "text": "For God is my witness, whom I serve in my spirit in the gospel of His Son, that without ceasing I mention you in my prayers,",
      "links": "<a href='/AIV/47/1/24'>2 Cor. 1:24</a>",
      "comment": "Service 'in spirit' hints at worship that is both inward and outward, and highlights a life of continual intercession."
    },
    {
      "pk": 900010,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 10,
      "text": "Always asking in my prayers that somehow by God’s will I may now at last succeed in coming to you.",
      "links": "<a href='/AIV/52/3/11'>1 Thess. 3:11</a>",
      "comment": "Paul’s travel and ministry are subject to God’s providence, demonstrating trust in divine guidance."
    },
    {
      "pk": 900011,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 11,
      "text": "For I long to see you so that I may impart to you some spiritual gift, so that you may be strengthened—",
      "links": "<a href='/AIV/46/12/7'>1 Cor. 12:7</a>",
      "comment": "Paul desires to give a 'spiritual gift', which may refer to charisms but also to strengthening through teaching and sacramental presence."
    },
    {
      "pk": 900012,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 12,
      "text": "That is, that we may be mutually encouraged by each other's faith, both yours and mine.",
      "links": "<a href='/AIV/52/5/11'>1 Thess. 5:11</a>",
      "comment": "Mutual encouragement indicates faith is lived and shared communally, highlighting the importance of fellowship."
    },
    {
      "pk": 900013,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 13,
      "text": "I do not want you to be unaware, brothers, that I have often planned to come to you (but have so far been prevented), in order that I may have some fruit among you, as I have among the other nations.",
      "links": "<a href='/AIV/44/16/6-7'>Acts 16:6–7</a>",
      "comment": "Paul’s intent to bear 'fruit' refers to spiritual gains—converts, growth, or mature faith. Divine timing sometimes intervenes in his plans."
    },
    {
      "pk": 900014,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 14,
      "text": "I am under obligation both to Greeks and to non-Greeks, both to the wise and to the foolish.",
      "links": "<a href='/AIV/46/9/16'>1 Cor. 9:16</a>",
      "comment": "Universal obligation underlines the global scope of the gospel—beyond cultural, ethnic, or intellectual boundaries."
    },
    {
      "pk": 900015,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 15,
      "text": "So, for my part, I am eager to proclaim the gospel to you also who are in Rome.",
      "links": "<a href='/AIV/47/2/17'>2 Cor. 2:17</a>",
      "comment": "Paul's unique eagerness to preach in Rome emphasizes the importance of the faith being actively and personally transmitted."
    },
    {
      "pk": 900016,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 16,
      "text": "For I am not ashamed of the gospel, because it is the power of God for salvation to everyone who believes, to the Jew first and also to the Greek.",
      "links": "<a href='/AIV/23/49/6'>Isaiah 49:6</a>; <a href='/AIV/40/10/32'>Matt. 10:32</a>",
      "comment": "Salvation is now universal, yet retains its origins in Israel. The gospel is not mere words, but divine power enacted in lives."
    },
    {
      "pk": 900017,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 17,
      "text": "For in it the righteousness of God is revealed from faith to faith, as it is written: \"The righteous shall live by faith.\"",
      "links": "<a href='/AIV/35/2/4'>Hab. 2:4</a>; <a href='/AIV/48/3/11'>Gal. 3:11</a>",
      "comment": "Paul draws from Habakkuk, presenting faith as the basis for life and righteousness. 'From faith to faith' can suggest growth in faith or transmission."
    },
    {
      "pk": 900018,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 18,
      "text": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of those who suppress the truth by their unrighteousness.",
      "links": "<a href='/AIV/19/7/11'>Psalm 7:11</a>",
      "comment": "Divine wrath is seen as just and real against those who willfully reject revealed truth—a sobering reminder of accountability."
    },
    {
      "pk": 900019,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 19,
      "text": "Because what can be known about God is plain to them, for God has shown it to them.",
      "links": "<a href='/AIV/19/19/1'>Psalm 19:1</a>",
      "comment": "God’s general revelation through creation makes knowledge of Him accessible, leaving humanity without excuse."
    },
    {
      "pk": 900020,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 20,
      "text": "For His invisible attributes—His eternal power and divine nature—have been clearly seen ever since the creation of the world, being understood through what has been made, so that they are without excuse.",
      "links": "<a href='/AIV/19/104/24'>Psalm 104:24</a>",
      "comment": "Paul roots accountability in the clarity of natural revelation, showing that contemplation of creation points towards divine reality."
    },
    {
      "pk": 900021,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 21,
      "text": "For although they knew God, they did not honor Him as God or give thanks, but they became futile in their thinking, and their foolish hearts were darkened.",
      "links": "<a href='/AIV/24/2/5'>Jer. 2:5</a>",
      "comment": "Not honoring God leads to spiritual blindness—darkened hearts mirror Old Testament teachings about idolatry and its consequences."
    },
    {
      "pk": 900022,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 22,
      "text": "Claiming to be wise, they became fools,",
      "links": "<a href='/AIV/19/14/1'>Psalm 14:1</a>",
      "comment": "False wisdom apart from God leads to foolishness—a recurring biblical theme."
    },
    {
      "pk": 900023,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 23,
      "text": "And exchanged the glory of the immortal God for images resembling mortal man and birds and animals and creeping things.",
      "links": "<a href='/AIV/02/20/4'>Ex. 20:4</a>; <a href='/AIV/19/106/20'>Ps. 106:20</a>",
      "comment": "Idolatry distorts true worship, trading everlasting glory for created things—echoes the warnings of the Ten Commandments."
    },
    {
      "pk": 900024,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 24,
      "text": "Therefore God gave them up in the desires of their hearts to impurity, to dishonoring their bodies among themselves.",
      "links": "<a href='/AIV/19/81/12'>Psalm 81:12</a>",
      "comment": "'God gave them up' expresses divine judgment through allowance, not direct causation—an important theological distinction."
    },
    {
      "pk": 900025,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 25,
      "text": "Because they exchanged the truth of God for a lie and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.",
      "links": "<a href='/AIV/23/44/20'>Isa. 44:20</a>",
      "comment": "Paul contrasts proper worship (of the Creator) with idolatry. The doxology affirms God’s eternal blessedness."
    },
    {
      "pk": 900026,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 26,
      "text": "For this reason God gave them up to dishonorable passions. For their women exchanged natural relations for those that are contrary to nature.",
      "links": "<a href='/AIV/03/18/22'>Lev. 18:22</a>",
      "comment": "Paul uses clear moral categories drawn from the Law, teaching that sin involves both spiritual and bodily disorder."
    },
    {
      "pk": 900027,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 27,
      "text": "And likewise the men abandoned natural relations with women and were inflamed with passion for one another, men committing shameless acts with men and receiving in themselves the penalty of their error.",
      "links": "<a href='/AIV/03/20/13'>Lev. 20:13</a>",
      "comment": "Paul draws from the Law, viewing human sexuality as established by God’s order; deviation is both a moral and theological transgression."
    },
    {
      "pk": 900028,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 28,
      "text": "And since they did not see fit to acknowledge God, God gave them up to a debased mind to do what ought not to be done.",
      "links": "<a href='/AIV/19/81/12'>Ps. 81:12</a>",
      "comment": "Repeated giving up by God highlights persistent refusal of grace, and the mind’s degeneration is linked to abandonment of the truth."
    },
    {
      "pk": 900029,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 29,
      "text": "They were filled with all manner of unrighteousness, evil, covetousness, malice. They are full of envy, murder, strife, deceit, maliciousness.",
      "links": "<a href='/AIV/19/14/3'>Psalm 14:3</a>",
      "comment": "Paul’s catalogue of vices shows sin's pervasive reach, aligning closely with descriptions of humanity’s fallenness found elsewhere in Scripture."
    },
    {
      "pk": 900030,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 30,
      "text": "They are gossips, slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents,",
      "links": "<a href='/AIV/20/30/11'>Proverbs 30:11</a>",
      "comment": "The list continues, incorporating social and familial breakdown as signs of moral disorder."
    },
    {
      "pk": 900031,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 31,
      "text": "Foolish, faithless, heartless, ruthless.",
      "links": "",
      "comment": "Describes consequences of rejecting God’s law—spiritual and moral deprivation."
    },
    {
      "pk": 900032,
      "translation": "AIV",
      "book": 45,
      "chapter": 1,
      "verse": 32,
      "text": "Though they know God’s righteous decree that those who practice such things deserve death, they not only do them but also approve of those who practice them.",
      "links": "<a href='/AIV/19/50/18'>Psalm 50:18</a>; <a href='/AIV/03/18/5'>Lev. 18:5</a>",
      "comment": "Knowing God’s law yet choosing rebellion underscores human responsibility and the seriousness of endorsing sin, pointing to the need for grace and sacramental transformation."
    }
  ],
  "translatedAt": "2025-12-23T03:30:26.671Z"
}