{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 11,
  "verses": [
    {
      "pk": 2011301,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 1,
      "text": "So I ask: Has God rejected His people? Absolutely not! For I myself am an Israelite, a descendant of Abraham, from the tribe of Benjamin.",
      "links": "<a href='/AIV/10/12/22'>1 Sam. 12:22</a>; <a href='/AIV/24/33/25-26'>Jer. 33:25-26</a>",
      "comment": "Paul affirms that God has not rejected Israel. His personal heritage emphasizes God's ongoing faithfulness. See Old Testament promises of God's covenantal loyalty."
    },
    {
      "pk": 2011302,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 2,
      "text": "God did not reject His people, whom He foreknew. Don’t you know what Scripture says about Elijah—how he appealed to God against Israel?",
      "links": "<a href='/AIV/11/19/10-18'>1 Kings 19:10-18</a>",
      "comment": "Paul refers to God's foreknowledge and faithful election, referencing Elijah for an example of a faithful remnant."
    },
    {
      "pk": 2011303,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 3,
      "text": "‘Lord, they have killed Your prophets, and they have torn down Your altars. I alone am left, and they seek my life.’",
      "links": "<a href='/AIV/11/19/10'>1 Kings 19:10</a>",
      "comment": "Direct quotation of Elijah's complaint. Paul is highlighting persecution of the faithful."
    },
    {
      "pk": 2011304,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 4,
      "text": "But what was God’s answer to him? ‘I have reserved for Myself seven thousand men who have not bowed the knee to Baal.’",
      "links": "<a href='/AIV/11/19/18'>1 Kings 19:18</a>",
      "comment": "God maintains a hidden remnant—those faithful by His grace, not by works."
    },
    {
      "pk": 2011305,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 5,
      "text": "So at this present time, there is a remnant chosen by grace.",
      "links": "<a href='/AIV/23/1/9'>Isa. 1:9</a>; <a href='/AIV/45/9/27'>Rom. 9:27</a>",
      "comment": "The concept of a remnant is central to both Old Testament and New Testament theology, revealing continuity in God's plan."
    },
    {
      "pk": 2011306,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 6,
      "text": "And if by grace, then it is no longer by works; otherwise, grace would no longer be grace.",
      "links": "<a href='/AIV/48/2/21'>Gal. 2:21</a>; <a href='/AIV/45/4/4-5'>Rom. 4:4-5</a>",
      "comment": "Paul clarifies that salvation is always by grace, never earned by works, consistent with covenantal faithfulness."
    },
    {
      "pk": 2011307,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 7,
      "text": "What then? Israel failed to obtain what it was seeking. The elect obtained it, but the rest were hardened.",
      "links": "<a href='/AIV/45/9/31-32'>Rom. 9:31–32</a>",
      "comment": "The elect receive mercy, while others become hardened—a theme relating to divine initiative and human responsibility."
    },
    {
      "pk": 2011308,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 8,
      "text": "As it is written, ‘God gave them a spirit of stupor, eyes that do not see and ears that do not hear, down to this very day.’",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/5/29/4'>Deut. 29:4</a>",
      "comment": "Paul references Old Testament language of divine hardening as judgment for unbelief, yet always leaving room for mercy."
    },
    {
      "pk": 2011309,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 9,
      "text": "And David says, ‘Let their table become a trap and a snare, a stumbling block and a retribution to them.’",
      "links": "<a href='/AIV/19/69/22-23'>Ps. 69:22-23</a>",
      "comment": "Paul applies Davidic psalm to Israel, highlighting spiritual consequences of rejecting God's gift."
    },
    {
      "pk": 2011310,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 10,
      "text": "‘Let their eyes be darkened so they cannot see, and make their backs continually bent.’",
      "links": "<a href='/AIV/19/69/23'>Ps. 69:23</a>",
      "comment": "Blindness and judgment come upon those who persistently reject God, yet God's mercy always holds out hope."
    },
    {
      "pk": 2011311,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 11,
      "text": "So I ask: Did they stumble so that they might fall beyond recovery? Absolutely not! Instead, through their trespass salvation has come to the Gentiles, to make Israel jealous.",
      "links": "<a href='/AIV/44/13/46-48'>Acts 13:46–48</a>",
      "comment": "Paul insists Israel's fall is not final but providential, so Gentiles are included and Israel’s jealousy will one day restore them."
    },
    {
      "pk": 2011312,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 12,
      "text": "If their failure brought riches to the world, and their loss riches to the Gentiles, how much greater their fullness will be!",
      "links": "<a href='/AIV/45/15/27'>Rom. 15:27</a>",
      "comment": "Paul anticipates a future restoration of Israel, suggesting a greater blessing awaits."
    },
    {
      "pk": 2011313,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 13,
      "text": "I am speaking to you Gentiles. Inasmuch as I am an apostle to the Gentiles, I magnify my ministry,",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/48/2/8'>Gal. 2:8</a>",
      "comment": "Paul’s mission to the Gentiles is central, showing God’s plan to unite all nations through Christ."
    },
    {
      "pk": 2011314,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 14,
      "text": "If by any means I can provoke my own people to jealousy and save some of them.",
      "links": "<a href='/AIV/45/10/19'>Rom. 10:19</a>",
      "comment": "Paul desires that Gentile faith will spark conversion among the Jews, a theme of communal faith leading others to God."
    },
    {
      "pk": 2011315,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 15,
      "text": "For if their rejection meant reconciliation for the world, what will their acceptance mean but life from the dead?",
      "links": "<a href='/AIV/44/3/26'>Acts 3:26</a>; <a href='/AIV/45/6/11'>Rom. 6:11</a>",
      "comment": "Paul frames Israel’s eventual acceptance as a turning point, hinting at a resurrection motif—spiritual and literal."
    },
    {
      "pk": 2011316,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 16,
      "text": "If the firstfruits are holy, then the whole batch is holy; and if the root is holy, so are the branches.",
      "links": "<a href='/AIV/3/23/10'>Lev. 23:10</a>; <a href='/AIV/24/2/2'>Jer. 2:2</a>",
      "comment": "Paul uses sacrificial and agricultural imagery, showing continuity from Abraham (the root) and firstfruits to all believers."
    },
    {
      "pk": 2011317,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 17,
      "text": "But if some of the branches were broken off, and you, a wild olive shoot, were grafted in among them and share in the nourishing root of the olive tree,",
      "links": "<a href='/AIV/24/11/16'>Jer. 11:16</a>; <a href='/AIV/28/14/6'>Hos. 14:6</a>",
      "comment": "Paul’s grafting image implies unity in the people of God, with Gentiles incorporated into historic faith via grace."
    },
    {
      "pk": 2011318,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 18,
      "text": "do not boast against the branches. But if you do, remember it is not you who support the root, but the root supports you.",
      "links": "<a href='/AIV/45/3/27'>Rom. 3:27</a>",
      "comment": "Gentiles must not be arrogant toward Israel—the faith comes from the heritage and promises begun with Abraham."
    },
    {
      "pk": 2011319,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 19,
      "text": "Then you will say, ‘Branches were broken off so that I might be grafted in.’",
      "links": "<a href='/AIV/45/11/11'>Rom. 11:11</a>",
      "comment": "Paul anticipates Gentile pride and warns against presuming on the mystery of salvation history."
    },
    {
      "pk": 2011320,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 20,
      "text": "True enough. They were broken off because of unbelief, but you stand by faith. Do not be arrogant, but be fearful.",
      "links": "<a href='/AIV/46/10/12'>1 Cor. 10:12</a>",
      "comment": "Faith is the key to standing firm, not personal merit. ‘Fear’ here is reverence, not terror."
    },
    {
      "pk": 2011321,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 21,
      "text": "For if God did not spare the original branches, He will not spare you either.",
      "links": "<a href='/AIV/61/2/4'>2 Pet. 2:4</a>",
      "comment": "Human presumption is dangerous; God’s discipline falls equally on all who disbelieve."
    },
    {
      "pk": 2011322,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 22,
      "text": "Consider then the kindness and severity of God: severity toward those who fell, but kindness to you, provided you continue in His kindness. Otherwise, you too will be cut off.",
      "links": "<a href='/AIV/42/13/28'>Luke 13:28</a>; <a href='/AIV/43/15/6'>John 15:6</a>",
      "comment": "Paul holds in tension God’s mercy and justice, and warns the Gentiles to persevere in faith and obedience."
    },
    {
      "pk": 2011323,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 23,
      "text": "And they also, if they do not remain in unbelief, will be grafted in, for God is able to graft them in again.",
      "links": "<a href='/AIV/26/36/24-28'>Ezek. 36:24-28</a>",
      "comment": "God’s power and desire to save extends to all, showing His plan to unite Jew and Gentile in faith."
    },
    {
      "pk": 2011324,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 24,
      "text": "For if you were cut from what is by nature a wild olive tree, and grafted, contrary to nature, into a cultivated olive tree, how much more will these, the natural branches, be grafted into their own olive tree!",
      "links": "<a href='/AIV/28/14/6'>Hos. 14:6</a>",
      "comment": "Paul emphasizes the hope for Israel’s restoration and the logic of God’s inclusive mercy."
    },
    {
      "pk": 2011325,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 25,
      "text": "For I do not want you to be ignorant of this mystery, brothers and sisters, so that you are not wise in your own eyes: a partial hardening has come upon Israel, until the fullness of the Gentiles comes in.",
      "links": "<a href='/AIV/45/16/25'>Rom. 16:25</a>; <a href='/AIV/42/21/24'>Luke 21:24</a>",
      "comment": "The ‘mystery’ reveals God’s sovereign timing. Full inclusion of the Gentiles is part of His redemptive plan."
    },
    {
      "pk": 2011326,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 26,
      "text": "And so all Israel will be saved, as it is written: ‘The Deliverer will come from Zion, He will remove ungodliness from Jacob.’",
      "links": "<a href='/AIV/23/59/20'>Isa. 59:20</a>; <a href='/AIV/19/14/7'>Ps. 14:7</a>",
      "comment": "Messiah’s coming fulfills prophecy. ‘All Israel’ likely points to the corporate restoration through the Messiah."
    },
    {
      "pk": 2011327,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 27,
      "text": "‘And this will be My covenant with them, when I remove their sins.’",
      "links": "<a href='/AIV/24/31/33-34'>Jer. 31:33-34</a>",
      "comment": "Prophecy of the new covenant fulfilled in Christ. Removal of sins is both forensic and transformative."
    },
    {
      "pk": 2011328,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 28,
      "text": "As regards the gospel, they are enemies for your sake. But as regards election, they are beloved, for the sake of the fathers.",
      "links": "<a href='/AIV/1/21/12'>Gen. 21:12</a>; <a href='/AIV/45/9/5'>Rom. 9:5</a>",
      "comment": "Dual perspective: opposition now, but enduring promise to the patriarchs. God’s election remains active in history."
    },
    {
      "pk": 2011329,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 29,
      "text": "For the gifts and calling of God are irrevocable.",
      "links": "<a href='/AIV/4/23/19'>Num. 23:19</a>; <a href='/AIV/19/89/34'>Ps. 89:34</a>",
      "comment": "God’s faithfulness and promises cannot be broken, even in the midst of human failure."
    },
    {
      "pk": 2011330,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 30,
      "text": "For just as you once were disobedient to God, but now have received mercy because of their disobedience,",
      "links": "<a href='/AIV/45/3/10'>Rom. 3:10</a>",
      "comment": "Paul shows mercy is granted in the context of sin and reversal, revealing God’s wisdom and providence."
    },
    {
      "pk": 2011331,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 31,
      "text": "So these also have now been disobedient, so that through the mercy shown to you they also may now receive mercy.",
      "links": "<a href='/AIV/45/15/9'>Rom. 15:9</a>",
      "comment": "Corporate solidarity in mercy—Gentiles receive mercy, which enables Israel’s future restoration."
    },
    {
      "pk": 2011332,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 32,
      "text": "For God has consigned all to disobedience, so that He may have mercy on all.",
      "links": "<a href='/AIV/45/3/23'>Rom. 3:23</a>; <a href='/AIV/19/130/3-4'>Ps. 130:3-4</a>",
      "comment": "God’s judgment leads directly to mercy for all who turn in faith. No one can boast—mercy is universal in scope."
    },
    {
      "pk": 2011333,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 33,
      "text": "Oh, the depth of the riches and wisdom and knowledge of God! How unsearchable are His judgments and His paths beyond tracing out!",
      "links": "<a href='/AIV/18/11/7-9'>Job 11:7–9</a>; <a href='/AIV/23/55/8-9'>Isa. 55:8–9</a>",
      "comment": "Paul’s doxology stands in awe at God’s mysterious plan—His wisdom exceeds human understanding."
    },
    {
      "pk": 2011334,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 34,
      "text": "‘Who has known the mind of the Lord? Or who has been His counselor?’",
      "links": "<a href='/AIV/23/40/13-14'>Isa. 40:13–14</a>",
      "comment": "Paul quotes Isaiah to affirm God’s complete sovereignty and freedom in His redemptive purposes."
    },
    {
      "pk": 2011335,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 35,
      "text": "‘Who has ever given to Him, that He should repay?’",
      "links": "<a href='/AIV/18/41/11'>Job 41:11</a>",
      "comment": "No human effort or gift obligates God. All is from His mercy and initiative."
    },
    {
      "pk": 2011336,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 36,
      "text": "For from Him and through Him and to Him are all things. To Him be glory forever. Amen.",
      "links": "<a href='/AIV/51/1/16'>Col. 1:16</a>; <a href='/AIV/19/106/48'>Ps. 106:48</a>",
      "comment": "Christological implication: Christ embodies the fullness of divine action. All things culminate in God—worship is the proper response."
    }
  ],
  "translatedAt": "2025-12-23T03:35:55.978Z"
}