{
  "book": "Romans",
  "bookAbbreviation": "Rom",
  "chapter": 13,
  "verses": [
    {
      "pk": 2001301,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 1,
      "text": "Let every person be subject to the governing authorities. For there is no authority except from God, and those that exist have been established by God.",
      "links": "<a href='/AIV/27/4/17'>Dan. 4:17</a>; <a href='/AIV/43/19/11'>John 19:11</a>",
      "comment": "Paul here affirms that all legitimate authority is ultimately grounded in God’s sovereignty. This reflects Old Testament tradition (see Daniel 4:17) and connects to Jesus’ words before Pilate. The implication is a divine order and an obedience that resembles submission to spiritual authority, hinting at unity and hierarchy within the faith."
    },
    {
      "pk": 2001302,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 2,
      "text": "Therefore whoever resists the authority resists what God has appointed, and those who resist will incur judgment.",
      "links": "<a href='/AIV/04/16/30'>Num. 16:30</a>; <a href='/AIV/54/2/2'>1 Tim. 2:2</a>",
      "comment": "Disobedience to lawful authority is seen as defiance against God’s order. This mirrors the rebellion of Korah (Num. 16:30) and Paul’s exhortation for peaceful living, reinforcing the connection between obeying civil and spiritual authorities."
    },
    {
      "pk": 2001303,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 3,
      "text": "For rulers are not a terror to good conduct, but to evil. Would you have no fear of the one in authority? Then do what is good, and you will receive approval;",
      "links": "<a href='/AIV/60/2/14'>1 Pet. 2:14</a>",
      "comment": "Rulers ideally serve justice. Paul aligns with Peter’s teaching, showing the consistency and value of obedience for right living and affirming the peace that comes from honoring the order God has provided."
    },
    {
      "pk": 2001304,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 4,
      "text": "For he is God’s servant for your good. But if you do wrong, be afraid, for he does not bear the sword in vain. He is a servant of God, an avenger who carries out wrath on the wrongdoer.",
      "links": "<a href='/AIV/01/9/6'>Gen. 9:6</a>; <a href='/AIV/19/101/8'>Ps. 101:8</a>",
      "comment": "Rulers are described as God’s ministers, indicating a sense of spiritual service. The reference to the sword echoes Genesis 9:6 and the psalms, connecting justice, discipline, and the divinely appointed role of leaders in maintaining order, both temporal and spiritual."
    },
    {
      "pk": 2001305,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 5,
      "text": "Therefore you must be subject, not only because of fear of punishment, but also for the sake of conscience.",
      "links": "<a href='/AIV/60/2/19'>1 Pet. 2:19</a>",
      "comment": "Paul raises the standard of obedience from mere fear to conscience, linking it to internal conversion and rightness before God. Christian submission to legitimate authority bears a deeper moral foundation and spiritual resonance."
    },
    {
      "pk": 2001306,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 6,
      "text": "For this reason you also pay taxes, for authorities are ministers of God, attending to this very thing.",
      "links": "<a href='/AIV/40/22/21'>Matt. 22:21</a>",
      "comment": "Taxes, like obedience, are part of honoring God’s ordained order. Jesus affirms this principle, underlining the legitimacy of civil authority and the spiritual dimension of fulfilling one’s duty to society."
    },
    {
      "pk": 2001307,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 7,
      "text": "Pay to all what is owed to them: taxes to whom taxes are due, revenue to whom revenue is due, respect to whom respect is due, and honor to whom honor is due.",
      "links": "<a href='/AIV/40/22/21'>Matt. 22:21</a>",
      "comment": "Paul summarizes with a call to justice and virtue. The echo of Jesus’ teaching suggests divine wisdom in rendering each his due, encouraging Christians to practice both justice and humility."
    },
    {
      "pk": 2001308,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 8,
      "text": "Owe no one anything, except to love one another; for whoever loves another has fulfilled the law.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/03/19/18'>Lev. 19:18</a>",
      "comment": "Paul centers Christian life on love, directly referencing Jesus’ new commandment and the heart of the Mosaic Law. The fulfillment of the law through love connects the teachings of Moses and Christ, inviting deeper reflection on how communal love completes God’s law."
    },
    {
      "pk": 2001309,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 9,
      "text": "For the commandments, 'You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,' and any other commandment can be summed up in this: 'You shall love your neighbor as yourself.'",
      "links": "<a href='/AIV/02/20/13-17'>Exod. 20:13–17</a>; <a href='/AIV/03/19/18'>Lev. 19:18</a>",
      "comment": "Paul draws directly from the Decalogue and Leviticus, showing the unity and continuity between Old and New Testament ethics. The spiritual interpretation sees all commandments leading to charity, a virtue at the heart of the Gospel and apostolic tradition."
    },
    {
      "pk": 2001310,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 10,
      "text": "Love does no harm to a neighbor; therefore love is the fulfillment of the law.",
      "links": "<a href='/AIV/40/22/39-40'>Matt. 22:39–40</a>",
      "comment": "Both literal and spiritual sense: Love transcends and fulfills every negative command by establishing authentic, sacrificial care for others. The teaching of Jesus about the greatest commandment is underlined here."
    },
    {
      "pk": 2001311,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 11,
      "text": "And do this, knowing the time, that now it is the hour for you to wake from sleep. For now our salvation is nearer than when we first believed.",
      "links": "<a href='/AIV/49/5/14'>Eph. 5:14</a>; <a href='/AIV/42/21/28'>Luke 21:28</a>",
      "comment": "Paul urges watchfulness. The spiritual meaning connects to Christ’s second coming, calling for moral vigilance and spiritual renewal, hallmarks of apostolic exhortation."
    },
    {
      "pk": 2001312,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 12,
      "text": "The night is far gone, and the day is near. So let us cast off the works of darkness and put on the armor of light.",
      "links": "<a href='/AIV/49/6/11-13'>Eph. 6:11–13</a>; <a href='/AIV/52/5/5'>1 Thess. 5:5</a>",
      "comment": "Day and night represent the spiritual battle between sin and holiness. The armor metaphor is echoed in Ephesians and Thessalonians, inviting believers to practice sanctification, which is a spiritual discipline rooted in tradition."
    },
    {
      "pk": 2001313,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 13,
      "text": "Let us walk properly, as in the daytime, not in drunkenness and partying, not in sexual immorality and debauchery, not in quarrels and jealousy.",
      "links": "<a href='/AIV/48/5/19-21'>Gal. 5:19–21</a>",
      "comment": "Paul lists vices in opposition to living in the light. Connections to Galatians emphasize the importance of moral discipline and self-control, virtues fostered in the life of the church through prayer and guidance."
    },
    {
      "pk": 2001314,
      "translation": "AIV",
      "book": 45,
      "chapter": 13,
      "verse": 14,
      "text": "But put on the Lord Jesus Christ, and make no provision for the desires of the flesh.",
      "links": "<a href='/AIV/48/3/27'>Gal. 3:27</a>; <a href='/AIV/56/2/12'>Titus 2:12</a>",
      "comment": "Putting on Christ evokes baptismal language (Gal 3:27), pointing toward participation in Christ’s life and the sacramental mystery. The spiritual interpretation highlights how union with Christ equips believers to resist sin, a continuous process in the journey of faith."
    }
  ],
  "translatedAt": "2025-12-23T03:36:28.347Z"
}