{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 18,
  "verses": [
    {
      "pk": 73018001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 1,
      "text": "After these things I saw another angel coming down from heaven, having great authority, and the earth was illuminated by his glory.",
      "links": "<a href='/AIV/26/43/2'>Ezek. 43:2</a>; <a href='/AIV/66/10/1'>Rev. 10:1</a>",
      "comment": "This angel is portrayed with divine authority and glory, similar to majestic angelic appearances in Ezekiel and Revelation 10. The illumination hints at the angel's role as a divine messenger and the unfolding of God’s judgment."
    },
    {
      "pk": 73018002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 2,
      "text": "He cried out with a mighty voice, saying, 'Fallen, fallen is Babylon the great! She has become a dwelling place for demons, a prison for every unclean spirit, and a cage for every unclean and hateful bird.'",
      "links": "<a href='/AIV/23/21/9'>Isa. 21:9</a>; <a href='/AIV/24/50/39'>Jer. 50:39</a>; <a href='/AIV/66/14/8'>Rev. 14:8</a>",
      "comment": "Babylon is symbolic of a powerful and corrupt system opposed to God. The repetition of 'fallen' emphasizes finality. The descriptions echo Old Testament judgments, linking spiritual and physical ruin."
    },
    {
      "pk": 73018003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 3,
      "text": "For all the nations have drunk the wine of the fury of her sexual immorality, and the kings of the earth have committed adultery with her, and the merchants of the earth have grown rich from the power of her luxurious living.",
      "links": "<a href='/AIV/24/51/7'>Jer. 51:7</a>; <a href='/AIV/28/4/11-13'>Hos. 4:11-13</a>; <a href='/AIV/66/17/2'>Rev. 17:2</a>",
      "comment": "The imagery of drinking symbolizes sharing in Babylon’s sinful ways. Both spiritual and economic corruption are highlighted, warning believers about partnership with worldly powers."
    },
    {
      "pk": 73018004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 4,
      "text": "Then I heard another voice from heaven, saying, 'Come out of her, my people, so that you do not share in her sins and so that you do not receive any of her plagues.'",
      "links": "<a href='/AIV/23/52/11'>Isa. 52:11</a>; <a href='/AIV/24/51/45'>Jer. 51:45</a>; <a href='/AIV/47/6/17'>2 Cor. 6:17</a>",
      "comment": "A call for God’s people to remain holy and separate from corrupt influences echoes themes of spiritual purity and the need for the Church to be set apart for God’s purposes."
    },
    {
      "pk": 73018005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 5,
      "text": "For her sins are heaped up as high as heaven, and God has remembered her iniquities.",
      "links": "<a href='/AIV/24/51/9'>Jer. 51:9</a>; <a href='/AIV/19/109/14'>Ps. 109:14</a>",
      "comment": "Sin reaching 'as high as heaven' shows the seriousness of rebellion against God. Divine justice is certain, and nothing escapes God’s awareness."
    },
    {
      "pk": 73018006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 6,
      "text": "Reward her as she herself has rewarded, and pay her back double for her deeds; mix a double portion for her in the cup which she has mixed.",
      "links": "<a href='/AIV/19/137/8'>Ps. 137:8</a>; <a href='/AIV/24/50/29'>Jer. 50:29</a>",
      "comment": "This verse expresses God’s perfect justice. The concept of double repayment aligns with biblical principles of proportionate retribution for sin."
    },
    {
      "pk": 73018007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 7,
      "text": "As much as she glorified herself and lived in luxury, give her just as much torment and misery; for in her heart she says, 'I sit as a queen, I am no widow, and I will never see sorrow.'",
      "links": "<a href='/AIV/23/47/7-8'>Isa. 47:7-8</a>; <a href='/AIV/66/17/4'>Rev. 17:4</a>",
      "comment": "Babylon’s self-confidence and pride make her judgment deserved. Her boastfulness contrasts sharply with the humility expected of the faithful Church."
    },
    {
      "pk": 73018008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 8,
      "text": "Therefore in one day her plagues will come—death, mourning, and famine; and she will be burned with fire, for the Lord God who judges her is mighty.",
      "links": "<a href='/AIV/23/47/9'>Isa. 47:9</a>; <a href='/AIV/24/50/32'>Jer. 50:32</a>",
      "comment": "The suddenness of her destruction shows the sovereignty and power of God. Righteous judgment comes swiftly, echoing Old Testament models."
    },
    {
      "pk": 73018009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 9,
      "text": "The kings of the earth, who committed adultery with her and shared her luxury, will weep and mourn over her when they see the smoke of her burning.",
      "links": "<a href='/AIV/66/17/2'>Rev. 17:2</a>; <a href='/AIV/23/34/9-10'>Isa. 34:9-10</a>",
      "comment": "Earthly rulers mourn not for righteousness, but for their own loss. Their spiritual infidelity and partnership with Babylon parallels Israel’s unfaithfulness in the prophets."
    },
    {
      "pk": 73018010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 10,
      "text": "They will stand far off, in fear of her torment, saying, 'Woe, woe, the great city, Babylon, the mighty city! Because in one hour your judgment has come.'",
      "links": "<a href='/AIV/66/17/18'>Rev. 17:18</a>; <a href='/AIV/23/47/11'>Isa. 47:11</a>",
      "comment": "The lament emphasizes the complete destruction and the suddenness of divine judgment. The repetition of 'woe' highlights the seriousness of the event."
    },
    {
      "pk": 73018011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 11,
      "text": "The merchants of the earth weep and mourn over her, because no one buys their cargo anymore—",
      "links": "<a href='/AIV/26/27/27-36'>Ezek. 27:27-36</a>",
      "comment": "The economic power of Babylon collapses, indicating a close relationship between spiritual decline and material excess."
    },
    {
      "pk": 73018012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 12,
      "text": "cargo of gold, silver, precious stones and pearls, fine linen, purple, silk, and scarlet cloth; every kind of citron wood, every kind of object made of ivory and costly wood, bronze, iron, and marble;",
      "links": "<a href='/AIV/11/10/18-22'>1 Kings 10:18-22</a>; <a href='/AIV/26/27/16-22'>Ezek. 27:16-22</a>",
      "comment": "The detailed list underscores the immense wealth and luxury of Babylon, reminiscent of descriptions of Solomon’s wealth and Tyre’s riches."
    },
    {
      "pk": 73018013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 13,
      "text": "cinnamon, incense, myrrh, frankincense, wine, oil, fine flour, wheat, cattle and sheep, horses and chariots, and slaves, that is, human souls.",
      "links": "<a href='/AIV/26/27/17-19'>Ezek. 27:17-19</a>; <a href='/AIV/02/30/23-24'>Ex. 30:23-24</a>",
      "comment": "This list shows both luxury goods and human trafficking, highlighting the moral depravity of Babylon. The inclusion of 'human souls' demonstrates the ultimate price of materialism."
    },
    {
      "pk": 73018014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 14,
      "text": "The fruit your soul longed for has gone from you, and all the rich and splendid things are lost to you, never to be found again.",
      "links": "<a href='/AIV/23/34/10'>Isa. 34:10</a>",
      "comment": "Worldly desires and pleasure ultimately disappear, echoing biblical warnings against trusting in material wealth. Eternal satisfaction is not found in earthly possessions."
    },
    {
      "pk": 73018015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 15,
      "text": "The merchants who became rich by her will stand far off for fear of her torment, weeping and mourning,",
      "links": "<a href='/AIV/26/27/31-36'>Ezek. 27:31-36</a>",
      "comment": "Even those who prospered by her fall do not intervene, showing the emptiness of alliances based solely on material advantage."
    },
    {
      "pk": 73018016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 16,
      "text": "saying, 'Woe, woe, the great city, clothed in fine linen, purple and scarlet, adorned with gold, precious stones, and pearls!'",
      "links": "<a href='/AIV/66/17/4'>Rev. 17:4</a>",
      "comment": "Luxury, power, and beauty of Babylon are lamented, but the focus is on outward appearance and wealth, not inner virtue or righteousness."
    },
    {
      "pk": 73018017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 17,
      "text": "For in one hour such great wealth has been laid waste.' And every ship captain, everyone who sailed anywhere, sailors, and all who trade by sea, stood at a distance",
      "links": "<a href='/AIV/26/27/25-26'>Ezek. 27:25-26</a>",
      "comment": "'One hour' highlights the sudden destruction. Global commerce, represented by the sea-traders, is devastated, warning against overreliance on worldly security."
    },
    {
      "pk": 73018018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 18,
      "text": "and cried out as they saw the smoke of her burning, saying, 'What city is like the great city?'",
      "links": "<a href='/AIV/66/13/13'>Rev. 13:13</a>; <a href='/AIV/24/51/41-43'>Jer. 51:41-43</a>",
      "comment": "The lament is one of disbelief and shock at the destruction of a seemingly invincible power, reflecting the fleeting nature of earthly empires."
    },
    {
      "pk": 73018019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 19,
      "text": "They threw dust on their heads and cried out, weeping and mourning, saying, 'Woe, woe, the great city, by which all who had ships on the sea grew rich by her wealth! For in one hour she has been laid waste.'",
      "links": "<a href='/AIV/26/27/30'>Ezek. 27:30</a>; <a href='/AIV/66/18/10'>Rev. 18:10</a>",
      "comment": "Throwing dust is a sign of mourning. The sorrow is self-centered: it is for lost profit, not for righteousness or justice. True hope should not be rooted in wealth."
    },
    {
      "pk": 73018020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 20,
      "text": "Rejoice over her, O heaven, and you saints and apostles and prophets, for God has judged her for you.",
      "links": "<a href='/AIV/66/6/9-11'>Rev. 6:9-11</a>; <a href='/AIV/66/19/1-2'>Rev. 19:1-2</a>",
      "comment": "While the world mourns, heaven rejoices because God’s justice prevails. The mention of saints, apostles, and prophets highlights the continuity of God’s people across the ages and the importance of their prayers."
    },
    {
      "pk": 73018021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 21,
      "text": "Then a mighty angel picked up a stone like a great millstone and threw it into the sea, saying, 'Thus with violence will Babylon the great city be thrown down, and will never be found again.'",
      "links": "<a href='/AIV/24/51/63-64'>Jer. 51:63-64</a>; <a href='/AIV/40/18/6'>Matt. 18:6</a>",
      "comment": "The millstone image signifies irrevocable judgment. The finality of Babylon’s fall is clear—an illustration that what opposes God will ultimately be removed."
    },
    {
      "pk": 73018022,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 22,
      "text": "The sound of harpists and musicians, flutists and trumpeters, will never be heard in you again. No craftsman of any trade will ever be found in you, and the sound of the millstone will never be heard in you again.",
      "links": "<a href='/AIV/24/25/10'>Jer. 25:10</a>; <a href='/AIV/23/24/8'>Isa. 24:8</a>",
      "comment": "All human activity—culture, music, industry—ceases, symbolizing the total and irreversible judgment on a corrupt society cut off from true worship."
    },
    {
      "pk": 73018023,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 23,
      "text": "The light of a lamp will never shine in you again, and the voice of bridegroom and bride will never be heard in you again. For your merchants were the great men of the earth, and all nations were deceived by your sorcery.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/23/47/9'>Isa. 47:9</a>",
      "comment": "The imagery of darkness and silence stresses utter desolation. The reference to sorcery suggests deceptive spiritual corruption, while the lost marital joy contrasts with the vision of the Church as the pure Bride of Christ."
    },
    {
      "pk": 73018024,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 18,
      "verse": 24,
      "text": "And in her was found the blood of prophets and saints, and of all who have been slain on the earth.",
      "links": "<a href='/AIV/40/23/35'>Matt. 23:35</a>; <a href='/AIV/66/6/9-10'>Rev. 6:9-10</a>",
      "comment": "Babylon is held accountable for persecuting the righteous. This underlines the importance of the visible, confessing Church, apostolic leadership, and the unity of believers who faithfully witness to Christ, even to the point of martyrdom."
    }
  ],
  "translatedAt": "2025-12-24T12:40:23.220Z"
}