{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 4,
  "verses": [
    {
      "pk": 73004001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 1,
      "text": "After this, I looked, and there was a door opened in heaven. The first voice I had heard speaking to me like a trumpet said, 'Come up here, and I will show you what must take place after this.'",
      "links": "<a href='/AIV/66/1/51'>John 10:9</a>; <a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/66/1/10'>Rev. 1:10</a>",
      "comment": "The open door symbolizes access to the heavenly realm granted by divine invitation, reminiscent of the way Christ himself invites believers to enter into communion with God (see John 10:9). This sets the stage for apocalyptic revelation, echoing Old Testament visions (Ezekiel 1)."
    },
    {
      "pk": 73004002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 2,
      "text": "Immediately I was in the Spirit, and behold, a throne was set in heaven, and One sat on the throne.",
      "links": "<a href='/AIV/26/1/26'>Ezek. 1:26</a>; <a href='/AIV/19/47/8'>Ps. 47:8</a>; <a href='/AIV/66/1/10'>Rev. 1:10</a>",
      "comment": "John’s being 'in the Spirit' points to a spiritually transformative experience, as seen with the prophets. The throne highlights God's sovereign rule. The imagery echoes Ezekiel’s vision, reinforcing the continuity of God’s revelation through history."
    },
    {
      "pk": 73004003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 3,
      "text": "He who sat there looked like jasper and carnelian, and a rainbow encircled the throne, resembling an emerald.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/19/104/2'>Ps. 104:2</a>; <a href='/AIV/1/9/13'>Gen. 9:13</a>",
      "comment": "The precious stones emphasize the majesty and purity of the divine presence. The rainbow recalls God’s covenant with humanity (Genesis 9:13), while also representing mercy encircling judgment. Such imagery suggests both majesty and compassion."
    },
    {
      "pk": 73004004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 4,
      "text": "Surrounding the throne were twenty-four thrones, and seated on them were twenty-four elders clothed in white garments, with golden crowns on their heads.",
      "links": "<a href='/AIV/13/24/4'>1 Chr. 24:4</a>; <a href='/AIV/19/132/9'>Ps. 132:9</a>; <a href='/AIV/66/19/8'>Rev. 19:8</a>",
      "comment": "The twenty-four elders represent the fullness of God’s people—twelve tribes of Israel and twelve apostles—united in worship. White garments and crowns imply both purity and the reward of faithfulness. This symbolizes the unity of Old and New Covenant believers."
    },
    {
      "pk": 73004005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 5,
      "text": "From the throne came flashes of lightning, rumblings, and peals of thunder. Before the throne were seven burning lamps of fire, which are the seven spirits of God.",
      "links": "<a href='/AIV/2/19/16'>Ex. 19:16</a>; <a href='/AIV/38/4/2'>Zech. 4:2</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "The lightning and thunder convey God’s awesome power and authority, echoing Sinai (Exodus 19). The seven spirits, depicted as lamps, indicate the fullness and perfection of the Holy Spirit, emphasizing His role in God's heavenly liturgy."
    },
    {
      "pk": 73004006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 6,
      "text": "In front of the throne was something like a sea of glass, clear as crystal. Around the throne, on each side, were four living creatures full of eyes in front and behind.",
      "links": "<a href='/AIV/26/1/22'>Ezek. 1:22</a>; <a href='/AIV/1/1/2'>Gen. 1:2</a>; <a href='/AIV/66/15/2'>Rev. 15:2</a>",
      "comment": "The sea of glass recalls the purity and transcendence before God’s throne, while the four living creatures parallel the heavenly beings in Ezekiel’s vision. These beings represent creation’s attentive worship and service to God."
    },
    {
      "pk": 73004007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 7,
      "text": "The first creature was like a lion, the second like an ox, the third had a face like a man, and the fourth was like a flying eagle.",
      "links": "<a href='/AIV/26/1/10'>Ezek. 1:10</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "Each of the four living creatures symbolizes aspects of creation with distinct roles: strength (lion), service (ox), reason (man), and swiftness (eagle). In traditional interpretation, these foreshadow the fourfold witness of the Gospels."
    },
    {
      "pk": 73004008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 8,
      "text": "Each of the four creatures had six wings and was full of eyes all around and within. Day and night they never stop saying: 'Holy, holy, holy is the Lord God Almighty, who was, who is, and who is to come.'",
      "links": "<a href='/AIV/23/6/2-3'>Isa. 6:2-3</a>; <a href='/AIV/19/111/9'>Ps. 111:9</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "The triple 'holy' reflects complete holiness; their ceaseless worship mirrors the seraphim of Isaiah 6. The phrase 'who was, is, and is to come' points to God’s eternal nature. Liturgical worship in heaven anticipates the worship of God’s people on earth."
    },
    {
      "pk": 73004009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 9,
      "text": "Whenever the living creatures give glory, honor, and thanks to Him who sits on the throne, who lives forever and ever,",
      "links": "<a href='/AIV/19/29/9'>Ps. 29:9-10</a>; <a href='/AIV/66/5/13'>Rev. 5:13</a>",
      "comment": "The praise of God by creation highlights reverence and gratitude as the center of divine worship. This verse anticipates the choir of all creation exalting their Creator eternally."
    },
    {
      "pk": 73004010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 10,
      "text": "the twenty-four elders fall down before Him who sits on the throne and worship Him who lives forever. They cast their crowns before the throne, saying:",
      "links": "<a href='/AIV/19/72/11'>Ps. 72:11</a>; <a href='/AIV/46/24/24'>1 Cor. 24:24</a>; <a href='/AIV/66/5/14'>Rev. 5:14</a>",
      "comment": "Casting crowns represents surrendering all honor and authority to God. Their worship reflects the complete submission of the Church to the eternal sovereignty of God; see also the continuous practice of prostration in ancient worship."
    },
    {
      "pk": 73004011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 4,
      "verse": 11,
      "text": "'Worthy are You, our Lord and God, to receive glory and honor and power, for You created all things, and by Your will they existed and were created.'",
      "links": "<a href='/AIV/19/148/5-6'>Ps. 148:5-6</a>; <a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/66/5/12'>Rev. 5:12</a>",
      "comment": "This majestic hymn acknowledges God as Creator and sustainer. He is worthy to receive worship, with all creation rendering praise. The recognition of God's creative will is foundational for Christian faith and doctrine; it is also key for understanding cosmic liturgy, where heavenly and earthly worship are joined."
    }
  ],
  "translatedAt": "2025-12-24T12:34:51.407Z"
}