{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 22,
  "verses": [
    {
      "pk": 73022001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 1,
      "text": "Then the angel showed me a river of the water of life, bright as crystal, flowing from the throne of God and of the Lamb.",
      "links": "<a href='/AIV/26/47/1'>Ezek. 47:1</a>; <a href='/AIV/43/4/14'>John 4:14</a>; <a href='/AIV/19/46/4'>Psalm 46:4</a>",
      "comment": "The image of the river echoes Ezekiel's vision of a river flowing from the temple (Ezek. 47:1), now coming from the throne of God and the Lamb—indicating the intimate union between God and Christ. The 'water of life' recalls Jesus' offer to the Samaritan woman (John 4:14), emphasizing that ultimate life comes only from God through Christ. This also points towards the abundance of grace and sacramental life flowing from the heavenly throne."
    },
    {
      "pk": 73022002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 2,
      "text": "In the middle of the city's street and on either side of the river was the tree of life, bearing twelve kinds of fruit, yielding its fruit every month. And the leaves of the tree are for the healing of the nations.",
      "links": "<a href='/AIV/01/2/9'>Gen. 2:9</a>; <a href='/AIV/26/47/12'>Ezek. 47:12</a>; <a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "This scene returns the reader to the promise of the tree of life in Eden (Gen. 2:9), now restored in the new creation. Its fruit and leaves symbolize perpetual spiritual nourishment and healing—a sign of God's ongoing provision. Twelve kinds of fruit may signify the fullness of God’s people (cf. 12 tribes, 12 apostles), who are continually nourished. This perpetual fruitfulness suggests the ongoing work of God's grace through visible and accessible means."
    },
    {
      "pk": 73022003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 3,
      "text": "No longer will there be any curse; but the throne of God and of the Lamb will be in it, and His servants will worship Him.",
      "links": "<a href='/AIV/01/3/17'>Gen. 3:17</a>; <a href='/AIV/23/60/21'>Isa. 60:21</a>",
      "comment": "This verse signals the reversal of the curse from Genesis 3—restoration and unbroken communion with God are accomplished. Worship is central, highlighting not only adoration but direct, ongoing service to God. The emphasis on the presence of the throne affirms Christ’s full divinity and union with the Father."
    },
    {
      "pk": 73022004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 4,
      "text": "They will see His face, and His name will be on their foreheads.",
      "links": "<a href='/AIV/02/33/20'>Exod. 33:20</a>; <a href='/AIV/66/3/12'>Rev. 3:12</a>",
      "comment": "Seeing God's face was impossible under the old covenant (Exod. 33:20), but here it is a promise fulfilled. The name on their foreheads marks divine ownership and intimacy (Rev. 3:12), an allusion to priestly consecration, indicating a special, set-apart relationship for all the redeemed."
    },
    {
      "pk": 73022005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 5,
      "text": "And night will be no more. They will have no need for the light of a lamp nor the light of the sun, for the Lord God will shine on them, and they will reign forever and ever.",
      "links": "<a href='/AIV/23/60/19'>Isa. 60:19</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "The eradication of night signifies the end of all evil and darkness (Isa. 60:19). The Lord’s presence provides perpetual light—an image fulfilled in Christ, the 'light of the world' (John 8:12). 'They will reign forever' teaches the eternal destiny of the redeemed to share in Christ's victory and kingship."
    },
    {
      "pk": 73022006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 6,
      "text": "Then he said to me, 'These words are trustworthy and true. The Lord, the God of the spirits of the prophets, has sent His angel to show His servants what must soon take place.'",
      "links": "<a href='/AIV/04/27/16'>Num. 27:16</a>; <a href='/AIV/01/41/32'>Gen. 41:32</a>",
      "comment": "The revelation’s authenticity is affirmed—trustworthy and true. God’s authority over the prophets is invoked, indicating continuity with all previous revelation and the reliability of the vision."
    },
    {
      "pk": 73022007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 7,
      "text": "'And behold, I am coming soon! Blessed is the one who keeps the words of the prophecy of this book.'",
      "links": "<a href='/AIV/66/1/3'>Rev. 1:3</a>; <a href='/AIV/66/3/11'>Rev. 3:11</a>",
      "comment": "The words of Christ Himself, affirming His imminent return. The blessing upon those who 'keep' the prophecy alludes not only to belief, but to faithful obedience and living out God’s commands within a worshipping community."
    },
    {
      "pk": 73022008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 8,
      "text": "I, John, am the one who heard and saw these things. When I heard and saw them, I fell down to worship at the feet of the angel who showed them to me.",
      "links": "<a href='/AIV/44/10/25'>Acts 10:25-26</a>; <a href='/AIV/66/19/10'>Rev. 19:10</a>",
      "comment": "John’s impulse to worship the angel matches human awe before divine revelation. Compare with Cornelius’ similar reaction before Peter (Acts 10:25), which emphasizes the necessity to direct all worship to God alone."
    },
    {
      "pk": 73022009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 9,
      "text": "But he said to me, 'Do not do that! I am a fellow servant with you and your brothers the prophets, and with those who keep the words of this book. Worship God!'",
      "links": "<a href='/AIV/66/19/10'>Rev. 19:10</a>; <a href='/AIV/05/6/13'>Deut. 6:13</a>",
      "comment": "The angel affirms only God is to be worshiped (Deut. 6:13). The reference to 'fellow servant with the prophets' highlights the unity of God's servants through the ages, across the visible and invisible Church."
    },
    {
      "pk": 73022010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 10,
      "text": "And he said to me, 'Do not seal up the words of the prophecy of this book, for the time is near.'",
      "links": "<a href='/AIV/27/8/26'>Dan. 8:26</a>; <a href='/AIV/66/1/3'>Rev. 1:3</a>",
      "comment": "Contrary to Daniel, who was told to seal his prophecy for the distant future (Dan. 8:26), John's revelation is to be made known—the Church is to proclaim and meditate on these words, as they are urgent and relevant."
    },
    {
      "pk": 73022011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 11,
      "text": "Let the evildoer still do evil, and the filthy still be filthy, and the righteous still do right, and the holy still be holy.",
      "links": "<a href='/AIV/27/12/10'>Dan. 12:10</a>",
      "comment": "A warning that at the end, people's responses to God will define their destiny (see Dan. 12:10). This is both prophetic inevitability and a call to perseverance for those striving for righteousness and holiness within the faith community."
    },
    {
      "pk": 73022012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 12,
      "text": "'Behold, I am coming soon, bringing my reward with me, to repay each one according to what he has done.'",
      "links": "<a href='/AIV/23/40/10'>Isa. 40:10</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>",
      "comment": "Jesus’ promise to judge everyone according to their deeds (Matt. 16:27) emphasizes the reality of divine judgment and the necessity of perseverance in good works as a sign of true faith—works that flow from a living relationship with Christ."
    },
    {
      "pk": 73022013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 13,
      "text": "'I am the Alpha and the Omega, the First and the Last, the Beginning and the End.'",
      "links": "<a href='/AIV/66/1/8'>Rev. 1:8</a>; <a href='/AIV/23/44/6'>Isa. 44:6</a>",
      "comment": "Jesus claims divine titles used for God in Isaiah (Isa. 44:6), showing His full divinity as eternal Lord—the source and goal of all things."
    },
    {
      "pk": 73022014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 14,
      "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by the gates.",
      "links": "<a href='/AIV/66/7/14'>Rev. 7:14</a>; <a href='/AIV/01/3/22'>Gen. 3:22</a>",
      "comment": "Washing robes, particularly in the context of earlier visions (Rev. 7:14), refers to being cleansed by the blood of Christ. This sacrifice restores access to the tree of life lost at the Fall (Gen. 3:22) and readmits the purified into the eternal city—suggestive of the ongoing need for active participation in God’s means of grace."
    },
    {
      "pk": 73022015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 15,
      "text": "Outside are the dogs and the sorcerers, and the sexually immoral, and the murderers and idolaters, and everyone who loves and practices falsehood.",
      "links": "<a href='/AIV/05/23/18'>Deut. 23:18</a>; <a href='/AIV/66/21/8'>Rev. 21:8</a>",
      "comment": "A stark warning: persistent sinners are excluded from the city. 'Dogs' in ancient context referred to impurity or heresy (see Deut. 23:18), emphasizing the seriousness of not just actions, but also of remaining outside the fellowship and truth of the Church."
    },
    {
      "pk": 73022016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 16,
      "text": "'I, Jesus, have sent my angel to testify to you about these things for the churches. I am the Root and the Offspring of David, the bright Morning Star.'",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/04/24/17'>Num. 24:17</a>",
      "comment": "Jesus identifies Himself as both David's descendant and his source (Isa. 11:1; Matt. 22:41-45), fulfilling Messianic prophecy. The 'Morning Star' (Num. 24:17) is a sign of new creation and eternal kingship. The message is transmitted for the universal family of the faithful."
    },
    {
      "pk": 73022017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 17,
      "text": "The Spirit and the Bride say, 'Come.' And let the one who hears say, 'Come.' And let the thirsty come; let the one who desires take the water of life freely.",
      "links": "<a href='/AIV/23/55/1'>Isa. 55:1</a>; <a href='/AIV/43/7/37'>John 7:37</a>",
      "comment": "Both the Spirit and the Bride (the redeemed people of God) call for Christ’s coming and invite all to receive life-giving water (Isa. 55:1; John 7:37). The calling Bride is a model of the Church’s perpetual mission to offer grace to all, under the guidance of the Spirit."
    },
    {
      "pk": 73022018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 18,
      "text": "I testify to everyone who hears the words of the prophecy of this book: If anyone adds to them, God will add to him the plagues described in this book.",
      "links": "<a href='/AIV/05/4/2'>Deut. 4:2</a>; <a href='/AIV/66/9/18'>Rev. 9:18</a>",
      "comment": "An authoritative warning reminiscent of Deut. 4:2—not to alter the divine revelation. This has been taken as a command to carefully preserve authentic teaching and not fracture it or change what has been revealed."
    },
    {
      "pk": 73022019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 19,
      "text": "And if anyone takes away from the words of the book of this prophecy, God will take away his share in the tree of life and in the holy city, which are described in this book.",
      "links": "<a href='/AIV/05/4/2'>Deut. 4:2</a>; <a href='/AIV/01/2/9'>Gen. 2:9</a>",
      "comment": "A parallel warning to not remove from the revelation—full participation in God's kingdom is contingent on remaining united to the fullness of the faith as handed down to the Church."
    },
    {
      "pk": 73022020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 20,
      "text": "He who testifies to these things says, 'Surely I am coming soon.' Amen. Come, Lord Jesus!",
      "links": "<a href='/AIV/46/16/22'>1 Cor. 16:22</a>; <a href='/AIV/66/1/7'>Rev. 1:7</a>",
      "comment": "The book ends with a confident affirmation of Jesus’ imminent return and the heartfelt response of the Church. The expectation of Christ’s return has always fueled both hope and the resolve to remain faithful."
    },
    {
      "pk": 73022021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 22,
      "verse": 21,
      "text": "The grace of the Lord Jesus be with all the saints. Amen.",
      "links": "<a href='/AIV/45/16/24'>Rom. 16:24</a>; <a href='/AIV/54/6/21'>1 Tim. 6:21</a>",
      "comment": "A final blessing of grace for all the saints, which has echoes in Paul’s epistles. It highlights the shared blessing of being united in Christ’s body—the communion of saints—which will endure until He comes."
    }
  ],
  "translatedAt": "2025-12-24T12:42:35.624Z"
}