{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 3,
  "verses": [
    {
      "pk": 73003001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 1,
      "text": "Write to the angel of the church in Sardis: Thus says the one who has the seven spirits of God and the seven stars: I know your works. You have a reputation for being alive, but you are dead.",
      "links": "<a href='/AIV/66/5/6'>Rev. 1:4</a>; <a href='/AIV/66/1/16'>Rev. 1:16</a>; <a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "The 'seven spirits' likely represents the fullness of the Holy Spirit. Jesus' opening judgment is that outward reputation (appearance of life) is not enough if inward reality (spiritual life) is lacking. This calls to mind the importance of authentic faith, not just outward profession (see also James 2:17)."
    },
    {
      "pk": 73003002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 2,
      "text": "Be watchful, and strengthen what remains and is about to die, for I have not found your works complete before my God.",
      "links": "<a href='/AIV/40/24/42'>Matt. 24:42</a>; <a href='/AIV/41/13/33'>Mark 13:33</a>",
      "comment": "There is still hope for repentance and renewal. The call to 'be watchful' echoes Jesus’ commands in the Gospels to stay vigilant. The mention of works being incomplete hints at the necessity of perseverance in faith and deeds (Phil 2:12, Matt 24:13)."
    },
    {
      "pk": 73003003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 3,
      "text": "So remember how you have received and heard. Hold fast and repent. If you do not wake up, I will come like a thief, and you will not know what hour I will come against you.",
      "links": "<a href='/AIV/40/24/43'>Matt. 24:43</a>; <a href='/AIV/52/5/2'>1 Thess. 5:2</a>; <a href='/AIV/66/16/15'>Rev. 16:15</a>",
      "comment": "Vigilance and repentance are necessary. Jesus warns that his coming can be sudden and unexpected, a theme common in the Gospels. This also alludes to the unpredictable arrival of the Lord in judgment."
    },
    {
      "pk": 73003004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 4,
      "text": "Yet you have a few people in Sardis who have not soiled their garments, and they will walk with me in white, for they are worthy.",
      "links": "<a href='/AIV/66/7/14'>Rev. 7:14</a>; <a href='/AIV/66/19/8'>Rev. 19:8</a>",
      "comment": "‘Garments’ symbolize purity, referring to personal holiness. The promise to walk ‘in white’ indicates acceptance by Christ. The concept of worthiness here implies that living faith produces fruits, aligning with the call to holiness."
    },
    {
      "pk": 73003005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 5,
      "text": "He who conquers will be clothed in white garments, and I will never erase his name from the book of life; rather, I will confess his name before my Father and before his angels.",
      "links": "<a href='/AIV/66/13/8'>Rev. 13:8</a>; <a href='/AIV/42/12/8'>Luke 12:8</a>; <a href='/AIV/19/69/28'>Ps. 69:28</a>",
      "comment": "Jesus promises assurance and eternal security to those who overcome, but only so long as faithfulness persists. Confessing names before the Father recalls Jesus’ words in the Gospels (Matt 10:32). The 'book of life' is a consistent biblical symbol for those who remain faithful (see also Dan 12:1)."
    },
    {
      "pk": 73003006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 6,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>; <a href='/AIV/24/7/23'>Jer. 7:23</a>",
      "comment": "This refrain emphasizes listening and obedience to God’s Spirit, not only individually but communally, showing the importance of guidance by the Spirit for the entire church."
    },
    {
      "pk": 73003007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 7,
      "text": "Write to the angel of the church in Philadelphia: Thus says the Holy One, the True One, who holds the key of David, who opens and no one will shut, who shuts and no one will open:",
      "links": "<a href='/AIV/23/22/22'>Isa. 22:22</a>; <a href='/AIV/66/1/18'>Rev. 1:18</a>",
      "comment": "Jesus is described with messianic titles, signifying his authority. The 'key of David' symbolizes Christ as possessing supreme authority over God’s Kingdom—fulfilling Old Testament prophecy (see Isa. 22:22)."
    },
    {
      "pk": 73003008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 8,
      "text": "I know your works. Look, I have set before you an open door which no one is able to shut. I know that you have little power, yet you have kept my word and have not denied my name.",
      "links": "<a href='/AIV/44/14/27'>Acts 14:27</a>; <a href='/AIV/46/16/9'>1 Cor. 16:9</a>",
      "comment": "The ‘open door’ points to opportunities for mission and faithfulness, even in weakness. Perseverance in faith and loyalty is what matters, and Christ provides the means for his people to prevail."
    },
    {
      "pk": 73003009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 9,
      "text": "Behold, I will make those of the synagogue of Satan, who claim to be Jews but are not, but lie—behold, I will make them come and bow down before your feet, and they will know that I have loved you.",
      "links": "<a href='/AIV/66/2/9'>Rev. 2:9</a>; <a href='/AIV/23/60/14'>Isa. 60:14</a>",
      "comment": "This verse reflects both spiritual and physical opposition to true believers, but victory is promised in the end. The language echoes Old Testament motifs of vindication (Isa 60:14), reflecting fulfillment of promises to God’s faithful people."
    },
    {
      "pk": 73003010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 10,
      "text": "Because you have kept my command to endure with patience, I will also keep you from the hour of trial that is coming upon the whole world, to test those who dwell on the earth.",
      "links": "<a href='/AIV/40/24/13'>Matt. 24:13</a>; <a href='/AIV/43/17/15'>John 17:15</a>",
      "comment": "Christ promises preservation to those who patiently endure. This does not necessarily reflect a physical escape, but a spiritual protection through coming tribulation—a theme consistent with Christ’s prayer for his followers in John 17:15."
    },
    {
      "pk": 73003011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 11,
      "text": "I am coming soon. Hold on to what you have, so that no one may take your crown.",
      "links": "<a href='/AIV/66/22/7'>Rev. 22:7</a>; <a href='/AIV/46/9/25'>1 Cor. 9:25</a>",
      "comment": "The ‘crown’ symbolizes the reward for faithfulness. Jesus’ imminent return is a call to persevere to the end, echoing Paul’s athletic metaphor for perseverance in 1 Cor. 9:25."
    },
    {
      "pk": 73003012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 12,
      "text": "The one who conquers, I will make a pillar in the temple of my God. Never shall he go out of it. I will write on him the name of my God, the name of the city of my God—the new Jerusalem which comes down out of heaven from my God—and my own new name.",
      "links": "<a href='/AIV/66/21/2'>Rev. 21:2</a>; <a href='/AIV/38/6/12-15'>Zech. 6:12-15</a>",
      "comment": "The promise of permanence in God’s presence (‘temple’) and receiving a new name are ancient biblical symbols of belonging and identity. This points toward deep union with Christ and the heavenly Jerusalem (see Rev. 21:2), suggesting the reality of God’s people sharing in Christ’s victory and dwelling."
    },
    {
      "pk": 73003013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 13,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "Again, all believers are urged to discern and heed the voice of the Holy Spirit. This is corporate as well as individual—hinting at the communal nature of the church’s guidance."
    },
    {
      "pk": 73003014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 14,
      "text": "Write to the angel of the church in Laodicea: Thus says the Amen, the faithful and true witness, the origin of God’s creation:",
      "links": "<a href='/AIV/41/14/36'>Mark 14:36</a>; <a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/51/1/15-18'>Col. 1:15-18</a>",
      "comment": "‘The Amen’ is a title indicating ultimate truth and faithfulness (2 Cor 1:20). ‘The origin of God’s creation’ means Jesus is the source and ruler of all creation (see John 1:3, Col 1:16-18), affirming his divinity."
    },
    {
      "pk": 73003015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 15,
      "text": "I know your works, that you are neither cold nor hot. I wish you were either cold or hot.",
      "links": "<a href='/AIV/40/6/24'>Matt. 6:24</a>",
      "comment": "Lukewarmness signifies spiritual complacency. Jesus desires wholehearted commitment and will not settle for minimal faith (see also Matt 6:24 on serving two masters)."
    },
    {
      "pk": 73003016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 16,
      "text": "So, because you are lukewarm, and neither hot nor cold, I am about to spit you out of my mouth.",
      "links": "<a href='/AIV/19/81/11-12'>Ps. 81:11-12</a>",
      "comment": "The shocking threat of ‘spitting out’ is a warning against spiritual indifference; it underscores the seriousness with which Christ expects real, lived faith."
    },
    {
      "pk": 73003017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 17,
      "text": "Because you say, ‘I am rich, I have prospered, and I need nothing,’ but you do not realize that you are wretched, miserable, poor, blind, and naked.",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>; <a href='/AIV/42/18/22'>Luke 18:22</a>",
      "comment": "Spiritual self-sufficiency is condemned here. True life requires recognizing our need for grace and healing, further connecting to the Beatitudes (Matt. 5:3—‘blessed are the poor in spirit’)."
    },
    {
      "pk": 73003018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 18,
      "text": "I counsel you to buy from me gold refined by fire so that you may be rich, and white garments so that you may be clothed and the shame of your nakedness may not be revealed, and salve to anoint your eyes so that you may see.",
      "links": "<a href='/AIV/66/19/8'>Rev. 19:8</a>; <a href='/AIV/23/55/1'>Isa. 55:1</a>",
      "comment": "True riches, righteousness, and spiritual sight are found only in Christ, echoing Isa. 55:1 (‘Come, buy without money...’). The white garments reinforce the call to a lived, visible, and active faith."
    },
    {
      "pk": 73003019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 19,
      "text": "Those whom I love, I reprove and discipline. So be zealous and repent.",
      "links": "<a href='/AIV/20/3/12'>Prov. 3:12</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "Discipline is proof of Christ’s love. The command to repent points not just to a one-time act, but a continual readiness to turn back to God. This aligns well with the recurring biblical theme of God’s fatherly correction."
    },
    {
      "pk": 73003020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 20,
      "text": "Behold, I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and eat with him, and he with me.",
      "links": "<a href='/AIV/42/12/36'>Luke 12:36</a>; <a href='/AIV/43/14/23'>John 14:23</a>",
      "comment": "The invitation represents Christ’s desire for deep communion. The imagery of eating together has both a literal and spiritual meaning, often evoking the Eucharistic table and foreshadowing the marriage supper of the Lamb in Rev. 19:9. Responding is necessary for true communion with Christ."
    },
    {
      "pk": 73003021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 21,
      "text": "To the one who conquers, I will grant to sit with me on my throne, as I also conquered and sat down with my Father on his throne.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/42/22/29-30'>Luke 22:29-30</a>",
      "comment": "Sharing Christ’s throne signifies participation in his victory and authority (see Luke 22:30; Ps. 110:1). This is a high calling for all who faithfully persevere."
    },
    {
      "pk": 73003022,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 3,
      "verse": 22,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "The message concludes with a universal call to listen. Believers are to remain attentive to the Spirit’s guidance, staying united in faith, doctrine, and practice."
    }
  ],
  "translatedAt": "2025-12-24T12:34:35.199Z"
}