{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 8,
  "verses": [
    {
      "pk": 73008001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 1,
      "text": "When He opened the seventh seal, there was silence in heaven for about half an hour.",
      "links": "<a href='/AIV/73/6/1'>Rev. 6:1</a>; <a href='/AIV/36/1/7'>Zeph. 1:7</a>; <a href='/AIV/19/76/8'>Ps. 76:8</a>",
      "comment": "The seventh seal’s opening marks a dramatic pause, symbolizing both awe and expectancy before God’s next act. This silence recalls times in Scripture when God’s presence evokes reverent stillness (Zephaniah 1:7; Psalm 76:8), emphasizing both the gravity and sacredness of divine action."
    },
    {
      "pk": 73008002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 2,
      "text": "Then I saw the seven angels who stand before God, and seven trumpets were given to them.",
      "links": "<a href='/AIV/15/2/3'>Tobit 12:15</a>; <a href='/AIV/07/6/16'>Judg. 6:16</a>; <a href='/AIV/04/10/2'>Num. 10:2-10</a>",
      "comment": "The seven angels recall imagery from Jewish tradition where they serve in the heavenly presence. Trumpets in biblical usage often announce God’s actions (Num. 10:2-10), reinforcing these events’ ritual and cosmic significance. Angelic mediation at this scale points to a structured, hierarchical approach to divine judgment."
    },
    {
      "pk": 73008003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 3,
      "text": "Another angel came and stood at the altar, holding a golden censer; and much incense was given to him to offer up, with the prayers of all the saints, on the golden altar before the throne.",
      "links": "<a href='/AIV/02/30/1'>Ex. 30:1-10</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>; <a href='/AIV/73/5/8'>Rev. 5:8</a>",
      "comment": "The golden censer and altar mirror Old Testament tabernacle worship (Exodus 30), identifying heavenly worship as liturgical and sacrificial. Incense symbolizes the prayers of the faithful rising to God (Psalm 141:2), suggesting a sacramental union and intercessory practice reflected in ongoing worship throughout history."
    },
    {
      "pk": 73008004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 4,
      "text": "The smoke of the incense, together with the prayers of the saints, went up before God from the angel’s hand.",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>; <a href='/AIV/73/5/8'>Rev. 5:8</a>",
      "comment": "Here, prayer is depicted as something tangible and pleasing, carried by an angel to God. This underscores the value given to the prayers of God’s people and the continuing role of heavenly intercession."
    },
    {
      "pk": 73008005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 5,
      "text": "Then the angel took the censer, filled it with fire from the altar, and threw it onto the earth. And there came thunder, rumblings, lightning, and an earthquake.",
      "links": "<a href='/AIV/02/19/16'>Ex. 19:16-19</a>; <a href='/AIV/19/18/7-15'>Ps. 18:7-15</a>; <a href='/AIV/73/16/18'>Rev. 16:18</a>",
      "comment": "The act of casting fire to earth interprets prayer as intertwined with divine judgment. The elements—thunder, lightning, earthquake—signal God’s presence, reminiscent of Sinai (Exodus 19) and reinforce themes of covenant and liturgical worship leading to transformation."
    },
    {
      "pk": 73008006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 6,
      "text": "And the seven angels who had the seven trumpets prepared to sound them.",
      "links": "<a href='/AIV/06/6/20'>Josh. 6:20</a>; <a href='/AIV/19/98/6'>Ps. 98:6</a>",
      "comment": "Trumpets in Israelite history signaled vital moments—such as Jericho’s fall (Joshua 6:20)—and here they anticipate an even greater outpouring of divine activity. This prepares readers for a series of intensified judgments."
    },
    {
      "pk": 73008007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 7,
      "text": "The first angel sounded his trumpet, and there came hail and fire mixed with blood, and these were thrown down on the earth. A third of the earth was burned up, a third of the trees were burned up, and all green grass was burned up.",
      "links": "<a href='/AIV/02/9/24'>Ex. 9:24</a>; <a href='/AIV/26/5/2'>Ezek. 5:2-12</a>; <a href='/AIV/73/11/19'>Rev. 11:19</a>",
      "comment": "This judgment recalls the Exodus plagues (Exodus 9), reinforcing theological continuity. The repeated quantities—‘a third’—imply mercy within judgment, sparing some for repentance and restoration."
    },
    {
      "pk": 73008008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 8,
      "text": "The second angel sounded his trumpet, and something like a great mountain burning with fire was thrown into the sea, and a third of the sea became blood.",
      "links": "<a href='/AIV/02/7/17-21'>Ex. 7:17-21</a>; <a href='/AIV/34/1/5-6'>Nah. 1:5-6</a>; <a href='/AIV/73/16/3'>Rev. 16:3</a>",
      "comment": "Again echoing the Exodus, the sea turning to blood denotes cosmic upheaval as a sign of God’s sovereignty over creation. The burning mountain invokes prophetic imagery (Nahum 1:5-6), alluding to judgment on pride and idolatry."
    },
    {
      "pk": 73008009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 9,
      "text": "A third of the living creatures in the sea died, and a third of the ships were destroyed.",
      "links": "<a href='/AIV/02/7/21'>Ex. 7:21</a>; <a href='/AIV/19/104/25-29'>Ps. 104:25-29</a>",
      "comment": "This verse continues with themes of partial judgment, highlighting how creation itself is affected by human sin. It draws attention to stewardship of creation and the consequence of disorder."
    },
    {
      "pk": 73008010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 10,
      "text": "The third angel sounded his trumpet, and a great star, blazing like a torch, fell from heaven on a third of the rivers and on the springs of water.",
      "links": "<a href='/AIV/23/14/12'>Isa. 14:12</a>; <a href='/AIV/24/9/15'>Jer. 9:15</a>; <a href='/AIV/73/9/1'>Rev. 9:1</a>",
      "comment": "The falling star recalls Isa. 14:12’s prophetic references to exile, pride, and rebellion. Water sources being afflicted parallels warnings of spiritual impurity and necessitates faithfulness to tradition for purity."
    },
    {
      "pk": 73008011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 11,
      "text": "The name of the star is Wormwood. A third of the waters became bitter, and many people died from the waters because they were made bitter.",
      "links": "<a href='/AIV/24/9/15'>Jer. 9:15</a>; <a href='/AIV/24/23/15'>Jer. 23:15</a>; <a href='/AIV/02/15/23-24'>Ex. 15:23-24</a>",
      "comment": "Wormwood is an Old Testament symbol for judgment and suffering (Jeremiah 9:15; 23:15), showing the physical and spiritual effects of infidelity. The bitterness warns against falling away from sound teaching."
    },
    {
      "pk": 73008012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 12,
      "text": "The fourth angel sounded his trumpet, and a third of the sun, a third of the moon, and a third of the stars were struck, so that a third of them were darkened. A third of the day was prevented from shining, and likewise the night.",
      "links": "<a href='/AIV/02/10/21-23'>Ex. 10:21-23</a>; <a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/40/24/29'>Matt. 24:29</a>",
      "comment": "The dimming of lights references both Exodus and prophetic warnings (Isaiah, Matthew 24:29), highlighting how cosmic disruption reflects spiritual blindness. Light is repeatedly linked in Scripture with truth and revelation, implying the need for staying united to apostolic teaching to avoid darkness."
    },
    {
      "pk": 73008013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 8,
      "verse": 13,
      "text": "Then I looked, and I heard an eagle flying high overhead, crying with a loud voice, 'Woe, woe, woe to those who live on the earth, because of the blasts of the other trumpets which the three angels are about to sound!'",
      "links": "<a href='/AIV/26/10/14'>Ezek. 10:14</a>; <a href='/AIV/23/6/2'>Isa. 6:2-3</a>; <a href='/AIV/73/9/12'>Rev. 9:12</a>",
      "comment": "The triple ‘woe’ intensifies what is to come, marking a transition in heavenly revelation. The eagle often symbolizes both prophetic warning and divine messenger (Ezekiel 10:14). This call to repentance is urgent, implying a further need for sacramental grace and steadfastness in the sacred tradition to be preserved from coming judgments."
    }
  ],
  "translatedAt": "2025-12-24T12:36:16.022Z"
}