{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 1,
  "verses": [
    {
      "pk": 73001001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 1,
      "text": "The revelation of Jesus Christ, which God gave Him to show to His servants what must soon take place. He made it known by sending His angel to His servant John,",
      "links": "<a href='/AIV/40/24/30'>Matt. 24:30</a>; <a href='/AIV/27/2/28'>Dan. 2:28</a>",
      "comment": "This opening affirms the divine origin of the message, given by God through Jesus and delivered by an angel. The emphasis on prophecy echoes Old Testament patterns of God revealing mysteries (Daniel 2:28). The mediation through angels highlights God's ordered means of communication, underscoring the importance of apostolic authority."
    },
    {
      "pk": 73001002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 2,
      "text": "who bore witness to the word of God and to the testimony of Jesus Christ, to everything he saw.",
      "links": "<a href='/AIV/43/21/24'>John 21:24</a>; <a href='/AIV/46/1/6'>1 Cor. 1:6</a>",
      "comment": "John’s testimony is both spiritual and eyewitness, reinforcing the reliability and authority of this revelation (see John 21:24). This points to the foundational witness of those entrusted with transmitting the faith."
    },
    {
      "pk": 73001003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 3,
      "text": "Blessed is the one who reads aloud, and those who hear the words of this prophecy, and keep what is written in it. For the time is near.",
      "links": "<a href='/AIV/42/11/28'>Luke 11:28</a>; <a href='/AIV/66/22/7'>Rev. 22:7</a>",
      "comment": "A blessing comes not only for reading but also for hearing and keeping these words, suggesting a communal and liturgical context. The call to 'keep' hints at the enduring nature of sacred tradition and obedience, a mark of authentic discipleship (Luke 11:28, Rev. 22:7)."
    },
    {
      "pk": 73001004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 4,
      "text": "John, to the seven churches that are in Asia: Grace to you and peace from Him who is, and who was, and who is to come, and from the seven spirits who are before His throne,",
      "links": "<a href='/AIV/02/3/14'>Ex. 3:14</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>",
      "comment": "The greeting echoes Paul's letters. The title 'who is, who was, who is to come' alludes to God's eternal nature (Ex. 3:14). The seven spirits likely symbolize the fullness of the Holy Spirit (Isa. 11:2), hinting at a heavenly liturgy and Trinitarian presence."
    },
    {
      "pk": 73001005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 5,
      "text": "and from Jesus Christ—the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth. To Him who loves us and has freed us from our sins by His blood,",
      "links": "<a href='/AIV/19/89/27'>Ps. 89:27</a>; <a href='/AIV/51/1/18'>Col. 1:18</a>",
      "comment": "Jesus’ titles reflect His divinity, resurrection, and kingship (Ps. 89:27; Col. 1:18). Salvation is accomplished through His blood, indicating both redemptive sacrifice and the ongoing efficacy of Christ’s self-offering."
    },
    {
      "pk": 73001006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 6,
      "text": "and made us a kingdom, priests to His God and Father—to Him be glory and dominion forever and ever. Amen.",
      "links": "<a href='/AIV/02/19/6'>Ex. 19:6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "The priestly identity of the faithful echoes the vocation of Israel (Ex. 19:6; 1 Pet. 2:9). This points to both a spiritual priesthood and a visible community set apart for worship, service, and sacrificial offering."
    },
    {
      "pk": 73001007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 7,
      "text": "Look, He is coming with the clouds, and every eye will see Him, even those who pierced Him. And all the tribes of the earth will mourn because of Him. So shall it be. Amen.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/38/12/10'>Zech. 12:10</a>",
      "comment": "This verse foretells Christ's visible return and universal recognition, fulfilling Daniel 7:13 and Zechariah 12:10. The mourning suggests a call to repentance and links Jesus’ death and resurrection to the hope of His glorious coming."
    },
    {
      "pk": 73001008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 8,
      "text": "I am the Alpha and the Omega, says the Lord God, who is and who was and who is to come, the Almighty.",
      "links": "<a href='/AIV/23/44/6'>Isa. 44:6</a>; <a href='/AIV/22/1/8'>Rev. 22:13</a>",
      "comment": "The divine title claims absolute sovereignty and eternity, echoing God’s self-revelation in Isaiah 44:6. This underlines the unity and divinity of Christ and the Father, inviting both a literal and mystical interpretation."
    },
    {
      "pk": 73001009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 9,
      "text": "I, John, your brother and partner in the tribulation and the kingdom and the endurance that are in Jesus, was on the island called Patmos because of the word of God and the testimony of Jesus.",
      "links": "<a href='/AIV/44/14/22'>Acts 14:22</a>; <a href='/AIV/61/1/7'>2 Pet. 1:7</a>",
      "comment": "John connects his suffering to the community’s, linking tribulation to sharing in Christ's endurance and kingdom—a theme central to apostolic teaching (Acts 14:22). The reference to Patmos grounds the prophecy in historical reality and apostolic witness."
    },
    {
      "pk": 73001010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 10,
      "text": "I was in the Spirit on the Lord’s Day, and I heard behind me a loud voice like a trumpet,",
      "links": "<a href='/AIV/23/58/13'>Isa. 58:13</a>; <a href='/AIV/02/19/16'>Ex. 19:16</a>",
      "comment": "John's prophetic experience occurs 'on the Lord's Day,' understood as Sunday, the day of resurrection and communal worship. The powerful voice recalls God’s manifestation in Exodus 19:16, linking Christian worship to the pattern of revelation and sacred time."
    },
    {
      "pk": 73001011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 11,
      "text": "saying, 'Write what you see in a book and send it to the seven churches—Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea.'",
      "links": "<a href='/AIV/24/30/2'>Jer. 30:2</a>; <a href='/AIV/02/17/14'>Ex. 17:14</a>",
      "comment": "The command to write echoes prophetic commissions (Jer. 30:2) and underscores the authority of written revelation, addressed to specific church communities for instruction and correction."
    },
    {
      "pk": 73001012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 12,
      "text": "Then I turned to see the voice that was speaking to me, and when I turned, I saw seven golden lampstands.",
      "links": "<a href='/AIV/02/25/31'>Ex. 25:31</a>; <a href='/AIV/38/4/2'>Zech. 4:2</a>",
      "comment": "The seven lampstands evoke the menorah of Exodus 25:31 and Zechariah 4:2, representing the fullness of the church in its divine calling to bear light. The vision is both literal and symbolically rich."
    },
    {
      "pk": 73001013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 13,
      "text": "And in the midst of the lampstands was one like a Son of Man, clothed in a long robe with a golden sash around His chest.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/03/8/7'>Lev. 8:7</a>",
      "comment": "The title 'Son of Man' is a direct claim to divinity (Dan. 7:13). The priestly vestments (Lev. 8:7) highlight the eternal priesthood and mediation of Christ, who stands among His people as both judge and intercessor."
    },
    {
      "pk": 73001014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 14,
      "text": "His head and hair were white like wool, as white as snow, and His eyes were like a flame of fire.",
      "links": "<a href='/AIV/27/7/9'>Dan. 7:9</a>; <a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "The imagery echoes Daniel 7:9 and signifies wisdom, purity, and divine authority. The fiery eyes symbolize all-seeing judgment and the Holy Spirit’s zeal (Ps. 104:4)."
    },
    {
      "pk": 73001015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 15,
      "text": "His feet were like burnished bronze, refined in a furnace, and His voice was like the sound of many waters.",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>; <a href='/AIV/19/93/4'>Ps. 93:4</a>",
      "comment": "Bronze feet hint at purity and strength, while the voice resembles Ezekiel’s vision (Ezek. 1:24) and signals both majesty and the call to worship."
    },
    {
      "pk": 73001016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 16,
      "text": "In His right hand He held seven stars, and from His mouth came a sharp two-edged sword, and His face was shining like the sun in its full power.",
      "links": "<a href='/AIV/19/45/3'>Ps. 45:3</a>; <a href='/AIV/40/17/2'>Matt. 17:2</a>",
      "comment": "The seven stars represent the spiritual leaders (see v. 20). The sword signifies the divine Word (Heb. 4:12), and the radiant face parallels the Transfiguration, affirming Christ's divinity and glory."
    },
    {
      "pk": 73001017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 17,
      "text": "When I saw Him, I fell at His feet as though dead. But He placed His right hand on me, saying: 'Do not be afraid. I am the First and the Last,'",
      "links": "<a href='/AIV/23/44/6'>Isa. 44:6</a>; <a href='/AIV/40/17/6-7'>Matt. 17:6-7</a>",
      "comment": "John’s response echoes visions in the Old Testament, where divine encounters elicit awe and humility. Christ’s reassurance and titles confirm His eternal existence and sovereignty, inviting both reverence and trust."
    },
    {
      "pk": 73001018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 18,
      "text": "'the Living One. I died, but look—I am alive forevermore! And I have the keys of Death and Hades.'",
      "links": "<a href='/AIV/45/6/9'>Rom. 6:9</a>; <a href='/AIV/49/4/10'>Eph. 4:10</a>",
      "comment": "Jesus affirms His victory over death and His unique authority—death could not hold Him (Rom. 6:9). His possession of the keys reflects a divine prerogative to offer resurrection and judgment."
    },
    {
      "pk": 73001019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 19,
      "text": "'Write, therefore, what you have seen—the things that are and those that will take place after this.'",
      "links": "<a href='/AIV/27/10/14'>Dan. 10:14</a>; <a href='/AIV/44/1/1'>Acts 1:1</a>",
      "comment": "John is commissioned to record past, present, and future realities, anchoring this revelation in historical continuity and enduring relevance (Dan. 10:14)."
    },
    {
      "pk": 73001020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 1,
      "verse": 20,
      "text": "'The mystery of the seven stars that you saw in My right hand and the seven golden lampstands: the seven stars are the messengers of the seven churches, and the seven lampstands are the seven churches.'",
      "links": "<a href='/AIV/38/4/2'>Zech. 4:2</a>; <a href='/AIV/40/5/14'>Matt. 5:14</a>",
      "comment": "Christ Himself interprets the symbols, affirming the spiritual hierarchy and visible church structure. The imagery of lampstands and stars underscores both a literal and mystical reality of the church’s mission to bear light and uphold apostolic succession."
    }
  ],
  "translatedAt": "2025-12-24T12:33:27.521Z"
}