{
  "book": 68,
  "bookName": "2 Peter",
  "bookAbbreviation": "2Pet",
  "chapter": 2,
  "verses": [
    {
      "pk": 68002001,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 1,
      "text": "But there were also false prophets among the people, just as there will be false teachers among you. They will secretly bring in destructive heresies, even denying the Master who bought them, bringing swift destruction on themselves.",
      "links": "<a href='/AIV/24/23/16'>Jer. 23:16</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>; <a href='/AIV/45/16/18'>Rom. 16:18</a>",
      "comment": "Peter reminds the church that false teachers are a constant danger, just as false prophets were in Israel. There is a spiritual continuity here warning believers to remain vigilant against distortions of the faith, particularly those that deny the Lordship of Christ, who redeemed them. 'Bought' language is closely linked to Christ's sacrificial death (cf. 1 Cor. 6:20)."
    },
    {
      "pk": 68002002,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 2,
      "text": "Many will follow their depraved ways, and because of them the way of truth will be maligned.",
      "links": "<a href='/AIV/45/2/24'>Rom. 2:24</a>; <a href='/AIV/44/19/9'>Acts 19:9</a>",
      "comment": "Peter warns that error will be widespread and that the reputation of the faith will suffer because of the actions of these false teachers. This has often happened in church history when heresies and scandals have led to criticism of believers. The 'way of truth' is a subtle pointer to an established rule of faith."
    },
    {
      "pk": 68002003,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 3,
      "text": "In their greed they will exploit you with deceptive words. Their condemnation has long been hanging over them, and their destruction is not sleeping.",
      "links": "<a href='/AIV/54/6/5'>1 Tim. 6:5</a>; <a href='/AIV/65/1/4'>Jude 4</a>",
      "comment": "Greed and manipulation for personal gain characterize these false teachers. Judgment, though it may seem delayed, is assured. God’s justice, seen throughout Scripture, will not fail (cf. Psalm 73:18-20)."
    },
    {
      "pk": 68002004,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 4,
      "text": "For if God did not spare the angels when they sinned, but cast them into gloomy pits of darkness, keeping them for judgment;",
      "links": "<a href='/AIV/01/6/4'>Gen. 6:4</a>; <a href='/AIV/65/1/6'>Jude 6</a>",
      "comment": "Peter draws on traditions concerning fallen angels to illustrate that both spiritual beings and humans are subject to divine judgment. This sets the tone for a strong doctrine of accountability under God’s unchanging justice."
    },
    {
      "pk": 68002005,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 5,
      "text": "And if He did not spare the ancient world, but protected Noah, a preacher of righteousness, along with seven others, when He brought a flood upon the world of the ungodly;",
      "links": "<a href='/AIV/01/7/23'>Gen. 7:23</a>; <a href='/AIV/01/6/9'>Gen. 6:9</a>",
      "comment": "God's judgment in the days of Noah is a precedent for His justice and His preservation of the righteous through tribulation. The mention of Noah 'preaching' implies the importance of proclaiming truth in a fallen world, as part of the mission given to all believers."
    },
    {
      "pk": 68002006,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 6,
      "text": "And if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes, making them an example to those who would live ungodly lives in the future;",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/65/1/7'>Jude 7</a>",
      "comment": "Sodom and Gomorrah serve as vivid illustrations of the seriousness of sin and God’s willingness to act decisively. By referencing these cities, Peter underlines the reality of judgment as a warning for all generations. Historically, this story was used to support clear moral boundaries."
    },
    {
      "pk": 68002007,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 7,
      "text": "And if He rescued righteous Lot, who was distressed by the filthy conduct of lawless men,",
      "links": "<a href='/AIV/01/19/16'>Gen. 19:16</a>; <a href='/AIV/61/1/9'>2 Pet. 1:9</a>",
      "comment": "Lot’s rescue shows God’s concern for the righteous even amidst overwhelming corruption. The preservation of the faithful, even when isolated, is a recurring theme pointing to God’s grace and the importance of personal holiness."
    },
    {
      "pk": 68002008,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 8,
      "text": "(for that righteous man, living among them, was tormented day after day in his soul by their lawless deeds),",
      "links": "<a href='/AIV/01/13/13'>Gen. 13:13</a>",
      "comment": "Lot’s interior suffering highlights how sin grieves the righteous, emphasizing the spiritual struggle of believers living in a fallen world. This ‘torment’ points to the moral sensitivity that comes from genuine faith—a key mark of discipleship."
    },
    {
      "pk": 68002009,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 9,
      "text": "then the Lord knows how to rescue the godly from trials and to keep the unrighteous under punishment for the day of judgment,",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/40/13/41-42'>Matt. 13:41-42</a>",
      "comment": "God’s providence ensures both deliverance for the righteous and judgment for the wicked. This verse underlines God’s sovereign ability to preserve believers, which has strong implications for trusting in the authority and guidance of the Church founded by Christ."
    },
    {
      "pk": 68002010,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 10,
      "text": "especially those who follow the corrupt desires of the flesh and despise authority. Bold and arrogant, they are not afraid to insult glorious beings.",
      "links": "<a href='/AIV/65/1/8'>Jude 8</a>; <a href='/AIV/45/13/1-2'>Rom. 13:1-2</a>",
      "comment": "Defiance of authority and indulgence of fleshly desires are grave errors. Peter’s warning against those who reject all forms of spiritual authority carries subtle implications for the importance of following apostolic tradition, safeguarded in the visible church structure."
    },
    {
      "pk": 68002011,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 11,
      "text": "Yet even angels, though greater in strength and power, do not bring abusive judgment against them before the Lord.",
      "links": "<a href='/AIV/19/103/20'>Ps. 103:20</a>; <a href='/AIV/65/1/9'>Jude 9</a>",
      "comment": "Peter outlines the humility and reverence proper to spiritual beings. Even angels defer judgment to God, underscoring the necessity for believers to exercise humility and respect toward spiritual realities and ecclesial authority."
    },
    {
      "pk": 68002012,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 12,
      "text": "But these people, like irrational animals born to be caught and destroyed, slander what they do not understand, and in their destruction they will also perish.",
      "links": "<a href='/AIV/65/1/10'>Jude 10</a>; <a href='/AIV/20/10/21'>Prov. 10:21</a>",
      "comment": "Peter likens false teachers to animals, emphasizing their lack of spiritual discernment. Their ignorance leads to ruin—a reminder that genuine faith seeks understanding, preserved through the teaching authority established by Christ."
    },
    {
      "pk": 68002013,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 13,
      "text": "They will be paid back with harm for the harm they have done. They consider it pleasure to carouse during the daytime. They are stains and blemishes, reveling in their deception while they feast with you.",
      "links": "<a href='/AIV/65/1/12'>Jude 12</a>; <a href='/AIV/46/11/20-22'>1 Cor. 11:20-22</a>",
      "comment": "Their indulgence even at communal meals—a reference to early Church gatherings—compromises holiness. This suggests an emphasis on purity in worship and communion, carried out faithfully under apostolic authority, with hints toward the high value placed on the sacramental life."
    },
    {
      "pk": 68002014,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 14,
      "text": "With eyes full of adultery, they never stop sinning; they seduce unstable souls. Their hearts are trained in greed. They are accursed children.",
      "links": "<a href='/AIV/40/5/28'>Matt. 5:28</a>; <a href='/AIV/61/3/16'>2 Pet. 3:16</a>",
      "comment": "False teachers prey on the vulnerable and embody unchecked desire and greed, making them cursed. The Church is called to protect its flock with sound teaching and discipline, echoing Christ’s warnings against leading others astray."
    },
    {
      "pk": 68002015,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 15,
      "text": "They have abandoned the right way and gone astray, following the way of Balaam son of Beor, who loved the wages of wickedness.",
      "links": "<a href='/AIV/04/22/7'>Num. 22:7</a>; <a href='/AIV/65/1/11'>Jude 11</a>",
      "comment": "Balaam symbolizes those corrupted by material interests. Abandoning the 'right way' implies leaving true doctrine—underscoring the importance of fidelity to apostolic teaching and the dangers of pragmatism in spiritual leadership."
    },
    {
      "pk": 68002016,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 16,
      "text": "But Balaam was rebuked for his wrongdoing by a mute donkey speaking with a human voice, which restrained the prophet’s madness.",
      "links": "<a href='/AIV/04/22/28-30'>Num. 22:28-30</a>",
      "comment": "The miraculous rebuke of Balaam stands as proof of God’s sovereignty, even using the humble to correct the proud. Divine intervention in safeguarding authentic teaching continues as a theme in scripture (cf. Matt. 16:17)."
    },
    {
      "pk": 68002017,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 17,
      "text": "These people are springs without water and mists driven by a storm. The deepest darkness has been reserved for them.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/65/1/13'>Jude 13</a>",
      "comment": "Images of emptiness stress the futility of their teaching. The ‘deepest darkness’ suggests both spiritual blindness and ultimate separation, contrasting with the light given to those who remain in the truth handed down through apostolic succession."
    },
    {
      "pk": 68002018,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 18,
      "text": "For they boast with empty, arrogant words, and by sensuous desires of the flesh they entice those who are barely escaping from those who live in error.",
      "links": "<a href='/AIV/65/1/16'>Jude 16</a>; <a href='/AIV/45/16/18'>Rom. 16:18</a>",
      "comment": "False teachers lure new converts through enticing language and carnal impulses, often targeting the spiritually immature. The enduring solution is steadfast formation rooted deeply in the apostolic confession of faith."
    },
    {
      "pk": 68002019,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 19,
      "text": "They promise them freedom, but they themselves are slaves of corruption. For a person is a slave to whatever has mastered them.",
      "links": "<a href='/AIV/43/8/34'>John 8:34</a>; <a href='/AIV/45/6/16'>Rom. 6:16</a>",
      "comment": "True freedom is only found in Christ and authentic obedience. Freedom promised apart from God’s order becomes a snare. Transformation requires ongoing conversion and renewal—continuing Christ’s liberating work in His Church."
    },
    {
      "pk": 68002020,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 20,
      "text": "For if, after escaping the corruptions of the world through knowing our Lord and Savior Jesus Christ, they are again entangled and overcome, their final state is worse than the first.",
      "links": "<a href='/AIV/40/12/43-45'>Matt. 12:43-45</a>; <a href='/AIV/58/6/4-6'>Heb. 6:4-6</a>",
      "comment": "Peter warns that apostasy after receiving the truth leads to a worse spiritual condition. Initially knowing Christ gives new life, but perseverance and remaining within the fold is crucial. This echoes the need for ongoing sanctification and spiritual formation."
    },
    {
      "pk": 68002021,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 21,
      "text": "For it would have been better for them not to have known the way of righteousness than, having known it, to turn away from the holy command delivered to them.",
      "links": "<a href='/AIV/40/11/24'>Matt. 11:24</a>; <a href='/AIV/61/1/3'>2 Pet. 1:3</a>",
      "comment": "Turning away from the path after receiving the ‘holy command’ incurs greater responsibility. The safeguarding of the faith handed down in the community is key, and the seriousness of apostasy is repeatedly underscored throughout Scripture."
    },
    {
      "pk": 68002022,
      "translation": "AIV",
      "book": 68,
      "bookName": "2 Peter",
      "bookAbbreviation": "2Pet",
      "chapter": 2,
      "verse": 22,
      "text": "But what has happened to them confirms the truth of this proverb: \"A dog returns to its own vomit,\" and, \"A washed pig returns to wallowing in the mud.\"",
      "links": "<a href='/AIV/20/26/11'>Prov. 26:11</a>; <a href='/AIV/40/7/6'>Matt. 7:6</a>",
      "comment": "Peter closes with vivid Proverbs to show the tragic repetition of sin. This illustrates the depth of the human condition and the urgent necessity of striving for holiness and remaining steadfast in the community established by Christ."
    }
  ],
  "translatedAt": "2025-12-24T12:29:16.133Z"
}