{
  "book": "2 Peter",
  "bookAbbreviation": "2Pet",
  "chapter": 3,
  "verses": [
    {
      "pk": 1932301,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 1,
      "text": "Beloved, this is now the second letter I am writing to you. In both of them, I am stirring up your sincere mind by way of reminder,",
      "links": "<a href='/AIV/61/1/13'>2 Pet. 1:13</a>; <a href='/AIV/65/1/17'>Jude 1:17</a>",
      "comment": "Peter emphasizes the importance of remembering the Apostolic teaching, showing the authority and continuity of the apostolic witness."
    },
    {
      "pk": 1932302,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 2,
      "text": "that you should remember the words spoken in the past by the holy prophets, and the commandment of the Lord and Savior spoken through your apostles.",
      "links": "<a href='/AIV/42/24/44'>Luke 24:44</a>; <a href='/AIV/45/16/26'>Rom. 16:26</a>",
      "comment": "Mentions the unity between the prophets and apostles, highlighting the need to heed apostolic commands, which supports the idea of an ongoing, authoritative teaching office in the Church."
    },
    {
      "pk": 1932303,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 3,
      "text": "Above all, know this: In the last days, scoffers will come, mocking and following their own evil desires.",
      "links": "<a href='/AIV/65/1/18'>Jude 1:18</a>; <a href='/AIV/55/3/1-4'>2 Tim. 3:1–4</a>",
      "comment": "A warning about false teachers reflects Jesus’ own warnings and shows the ongoing need for faithful interpretation and transmission of faith."
    },
    {
      "pk": 1932304,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 4,
      "text": "They will say, 'Where is the promise of his coming? For ever since the fathers fell asleep, all things continue as they were from the beginning of creation.'",
      "links": "<a href='/AIV/40/24/48'>Matt. 24:48</a>; <a href='/AIV/01/2/21'>Gen. 2:21</a>",
      "comment": "The delay in Christ’s return is a test of faith. This question was relevant in the early Church, clarifying that God’s timing differs from human expectations."
    },
    {
      "pk": 1932305,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 5,
      "text": "For they deliberately overlook this: that by the word of God the heavens existed long ago, and the earth was formed out of water and through water by the word of God.",
      "links": "<a href='/AIV/01/1/9'>Gen. 1:9</a>; <a href='/AIV/58/11/3'>Heb. 11:3</a>",
      "comment": "The power of God’s word is creative and sustaining, pointing to the authority of God’s spoken declaration—both in creation and in revelation."
    },
    {
      "pk": 1932306,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 6,
      "text": "And by these means, the world that then existed was deluged with water and perished.",
      "links": "<a href='/AIV/01/7/21'>Gen. 7:21</a>; <a href='/AIV/42/17/27'>Luke 17:27</a>",
      "comment": "Peter references the flood as historical, underscoring the seriousness of God’s past judgments as a warning for future accountability."
    },
    {
      "pk": 1932307,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 7,
      "text": "But by the same word, the present heavens and earth are being kept for fire, stored up until the day of judgment and destruction of the ungodly.",
      "links": "<a href='/AIV/45/2/5'>Rom. 2:5</a>; <a href='/AIV/66/20/11-15'>Rev. 20:11–15</a>",
      "comment": "God’s word upholds the world toward final judgment, implying that divine authority and sacraments have an enduring reality."
    },
    {
      "pk": 1932308,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 8,
      "text": "But do not overlook this one thing, beloved, that with the Lord one day is as a thousand years, and a thousand years as one day.",
      "links": "<a href='/AIV/19/90/4'>Ps. 90:4</a>",
      "comment": "Peter quotes Psalm 90:4, reminding readers that God stands outside time. The spiritual meaning emphasizes patience and trust in divine providence."
    },
    {
      "pk": 1932309,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 9,
      "text": "The Lord is not slow to fulfill his promise, as some count slowness, but is patient toward you, not wishing for any to perish but for all to come to repentance.",
      "links": "<a href='/AIV/26/18/23'>Ezek. 18:23</a>; <a href='/AIV/54/2/4'>1 Tim. 2:4</a>",
      "comment": "God desires the salvation of all, underscoring the need for continued repentance, a process that involves ongoing participation in God’s grace."
    },
    {
      "pk": 1932310,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 10,
      "text": "But the day of the Lord will come like a thief. On that day, the heavens will pass away with a roar, the elements will be dissolved by fire, and the earth and everything done on it will be exposed.",
      "links": "<a href='/AIV/53/5/2'>1 Thess. 5:2</a>; <a href='/AIV/66/16/15'>Rev. 16:15</a>",
      "comment": "The suddenness of judgment calls believers to constant readiness and holiness, echoing Jesus’ warnings and the call to live virtuously."
    },
    {
      "pk": 1932311,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 11,
      "text": "Since all these things are to be dissolved in this way, what sort of people ought you to be in holy conduct and godliness,",
      "links": "<a href='/AIV/60/1/15-16'>1 Pet. 1:15–16</a>",
      "comment": "Directs the readers to respond with lives of holiness, not merely internal belief but outward piety and action."
    },
    {
      "pk": 1932312,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 12,
      "text": "as you wait for and hasten the coming of the day of God, because of which the heavens will be set ablaze and dissolved, and the elements will melt with fire?",
      "links": "<a href='/AIV/23/34/4'>Isa. 34:4</a>; <a href='/AIV/60/4/7'>1 Pet. 4:7</a>",
      "comment": "Implying that human actions—especially lives of holiness, prayer, and sacrificial love—somehow participate in God’s plan and hasten its fulfillment."
    },
    {
      "pk": 1932313,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 13,
      "text": "But according to his promise, we are waiting for new heavens and a new earth where righteousness dwells.",
      "links": "<a href='/AIV/23/65/17'>Isa. 65:17</a>; <a href='/AIV/66/21/1'>Rev. 21:1</a>",
      "comment": "Anticipation of a renewed creation fulfilled in Christ—this ultimate hope shapes Christian life and worship."
    },
    {
      "pk": 1932314,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 14,
      "text": "Therefore, beloved, since you are waiting for these things, strive to be found by him in peace, spotless and blameless.",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/60/1/19'>1 Pet. 1:19</a>",
      "comment": "This is a call to devotion and a state of grace, living out the faith with visible purity and reconciliation."
    },
    {
      "pk": 1932315,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 15,
      "text": "And count the patience of our Lord as salvation, just as our beloved brother Paul also wrote to you according to the wisdom given him,",
      "links": "<a href='/AIV/45/2/4'>Rom. 2:4</a>; <a href='/AIV/61/1/1'>2 Pet. 1:1</a>",
      "comment": "Peter affirms Paul's letters as scripture, emphasizing the unity of apostolic teaching and the authority of the living tradition."
    },
    {
      "pk": 1932316,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 16,
      "text": "as he does in all his letters when he speaks in them of these matters. There are some things in them that are hard to understand, which the ignorant and unstable twist to their own destruction, as they do the other Scriptures.",
      "links": "<a href='/AIV/55/2/14'>2 Tim. 2:14</a>; <a href='/AIV/45/3/8'>Rom. 3:8</a>",
      "comment": "Affirms Paul's writings as 'Scripture' and warns against private interpretation apart from the apostolic teaching."
    },
    {
      "pk": 1932317,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 17,
      "text": "Therefore, beloved, knowing this beforehand, take care that you are not carried away by the error of lawless people and lose your own stability.",
      "links": "<a href='/AIV/48/5/4'>Gal. 5:4</a>; <a href='/AIV/66/2/5'>Rev. 2:5</a>",
      "comment": "Stability comes from adhering to the full received teaching, not following novel or lawless doctrines."
    },
    {
      "pk": 1932318,
      "translation": "AIV",
      "book": 61,
      "chapter": 3,
      "verse": 18,
      "text": "But grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be glory both now and to the day of eternity. Amen.",
      "links": "<a href='/AIV/43/1/14-17'>John 1:14–17</a>; <a href='/AIV/45/16/27'>Rom. 16:27</a>",
      "comment": "Spiritual growth is a continual process that involves both faith and participation in God's grace, culminating in the worship of Christ as Lord and Savior."
    }
  ],
  "translatedAt": "2025-12-23T04:17:27.201Z"
}