{
  "book": "2 Peter",
  "bookAbbreviation": "2Pet",
  "chapter": 2,
  "verses": [
    {
      "pk": 2402001,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 1,
      "text": "But just as there were false prophets among the people, so there will also be false teachers among you, who will secretly introduce destructive heresies—even denying the Master who bought them—bringing swift destruction upon themselves.",
      "links": "<a href='/AIV/24/23/16'>Jer. 23:16</a>; <a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/65/1/4'>Jude 4</a>",
      "comment": "Peter warns of false teachers within the community, drawing a direct parallel to the false prophets of Israel. The phrase 'denying the Master' highlights the gravity of such apostasy, resembling the ultimate rejection of Christ's lordship. Denying Christ is not only doctrinal error but is portrayed as a betrayal similar to Judas (see <a href='/AIV/40/26/24-25'>Matt. 26:24-25</a>)."
    },
    {
      "pk": 2402002,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 2,
      "text": "Many will follow their depraved ways, and because of them, the way of truth will be blasphemed.",
      "links": "<a href='/AIV/45/2/24'>Rom. 2:24</a>",
      "comment": "The influence of heresy leads others astray and brings reproach upon the faith, fulfilling Old Testament warnings about the damage false teaching brings."
    },
    {
      "pk": 2402003,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 3,
      "text": "In their greed they will exploit you with fabricated words. Their judgment from long ago is not idle, and their destruction is not asleep.",
      "links": "<a href='/AIV/65/1/16'>Jude 16</a>; <a href='/AIV/23/56/11'>Isa. 56:11</a>",
      "comment": "Peter highlights both the material motivation of false teachers and the certainty of judgment. This verse reflects the apostolic concern for the purity and protection of the Church."
    },
    {
      "pk": 2402004,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 4,
      "text": "For if God did not spare the angels when they sinned, but cast them into pits of darkness, confining them until judgment;",
      "links": "<a href='/AIV/01/6/1-4'>Gen. 6:1-4</a>; <a href='/AIV/65/1/6'>Jude 6</a>",
      "comment": "Angelic rebellion receives immediate punishment, showing that no created being is exempt from God's justice. This analogy emphasizes that spiritual beings, just like humans, remain under divine authority. Some traditions see these angels as a reference to Genesis 6, tying New Testament interpretation to the Old (<a href='/AIV/01/6/1-4'>Gen. 6:1-4</a>)."
    },
    {
      "pk": 2402005,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 5,
      "text": "and if He did not spare the ancient world, but preserved Noah—a preacher of righteousness—along with seven others, when He brought the flood upon the world of the ungodly;",
      "links": "<a href='/AIV/01/7/23'>Gen. 7:23</a>; <a href='/AIV/58/11/7'>Heb. 11:7</a>",
      "comment": "Noah's salvation through the flood is an archetype of deliverance through faithful obedience. The 'eight in all' alludes to the foundational use of water for both judgment and salvation, a theme echoed in baptism (see <a href='/AIV/60/3/20-21'>1 Peter 3:20-21</a>)."
    },
    {
      "pk": 2402006,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 6,
      "text": "and if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes and making them an example of what is coming to the ungodly;",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/65/1/7'>Jude 7</a>",
      "comment": "Sodom and Gomorrah are perennial symbols of divine retribution. Peter uses their fate as a warning against unrepentant wickedness."
    },
    {
      "pk": 2402007,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 7,
      "text": "and if He rescued righteous Lot, oppressed by the depraved behavior of the lawless—",
      "links": "<a href='/AIV/01/19/16'>Gen. 19:16</a>",
      "comment": "Lot's deliverance amid widespread corruption emphasizes God's ability to save the righteous even among the wicked."
    },
    {
      "pk": 2402008,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 8,
      "text": "for as that righteous man lived among them day after day, he was tormented in his righteous soul by the lawless deeds he saw and heard—",
      "links": "<a href='/AIV/01/19/7-9'>Gen. 19:7-9</a>",
      "comment": "Lot’s suffering points to the suffering of the saints in a world hostile to godliness. This also anticipates the Christian experience of living as a pilgrim in a fallen world (<a href='/AIV/58/11/13'>Heb. 11:13</a>)."
    },
    {
      "pk": 2402009,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 9,
      "text": "then the Lord knows how to rescue the godly from temptation and keep the unrighteous under punishment for the day of judgment,",
      "links": "<a href='/AIV/60/1/5-7'>1 Pet. 1:5-7</a>",
      "comment": "A key encouragement—God’s providence for the righteous and the eventual justice upon the wicked. The text underlines divine sovereignty in salvation and judgment."
    },
    {
      "pk": 2402010,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 10,
      "text": "especially those who follow the corrupt desires of the flesh and despise authority. Bold and arrogant, they are not afraid to blaspheme glorious beings.",
      "links": "<a href='/AIV/65/1/8-10'>Jude 8-10</a>",
      "comment": "A distinction is made of those who openly rebel against authority, human and divine. The warning against blaspheming 'glorious beings' connects spiritual realities with the visible order of the Church (see <a href='/AIV/45/13/1-7'>Rom. 13:1-7</a> for authority)."
    },
    {
      "pk": 2402011,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 11,
      "text": "Yet angels, though greater in strength and power, do not bring a slanderous charge against them before the Lord.",
      "links": "<a href='/AIV/65/1/9'>Jude 9</a>",
      "comment": "Angels act with reverent humility even in judgment, contrasting with human arrogance."
    },
    {
      "pk": 2402012,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 12,
      "text": "But these people, like irrational animals, creatures of instinct born to be caught and destroyed, blaspheme in matters they do not understand; they will perish in their own corruption.",
      "links": "<a href='/AIV/65/1/10'>Jude 10</a>",
      "comment": "Peter uses vivid language, showing the self-destructive nature of sin and ignorance. The comparison to animals is strong, denoting the degradation that sin brings."
    },
    {
      "pk": 2402013,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 13,
      "text": "They will be paid back with harm for the harm they have done. They consider it pleasure to carouse in broad daylight. They are stains and blemishes, reveling in their deceit while they feast with you.",
      "links": "<a href='/AIV/46/11/20-22'>1 Cor. 11:20-22</a>",
      "comment": "‘Feasting with you’ likely refers to the communal sacred meals of the early Church, possibly the Eucharist. The presence of unrepentant sinners at these feasts is condemned (<a href='/AIV/46/5/11'>1 Cor. 5:11</a>)."
    },
    {
      "pk": 2402014,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 14,
      "text": "With eyes full of adultery, never ceasing from sin, enticing unstable souls. They have hearts trained in greed. Accursed children!",
      "links": "<a href='/AIV/58/6/4-6'>Heb. 6:4-6</a>",
      "comment": "Relentless sin is paired with the corruption of others, especially the spiritually immature. The warning about ‘accursed children’ echoes Jesus’ warnings against leading others into sin (<a href='/AIV/40/18/6'>Matt. 18:6</a>)."
    },
    {
      "pk": 2402015,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 15,
      "text": "They have abandoned the straight path and strayed, following the way of Balaam son of Beor, who loved the rewards of wrongdoing,",
      "links": "<a href='/AIV/04/22/7-12'>Num. 22:7-12</a>; <a href='/AIV/65/1/11'>Jude 11</a>",
      "comment": "Balaam is a biblical symbol for those who betray God for material gain, a warning repeatedly used in the New Testament."
    },
    {
      "pk": 2402016,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 16,
      "text": "but he was rebuked for his own transgression: a speechless donkey spoke with a man’s voice and restrained the prophet’s madness.",
      "links": "<a href='/AIV/04/22/28'>Num. 22:28</a>",
      "comment": "The supernatural rebuke of Balaam through the donkey’s speech demonstrates that God can use any means—even animals—to reveal the truth and prevent apostasy."
    },
    {
      "pk": 2402017,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 17,
      "text": "These people are springs without water and mists driven by a storm. The deepest darkness has been reserved for them.",
      "links": "<a href='/AIV/65/1/12-13'>Jude 12-13</a>",
      "comment": "Empty promises of false teachers are a tragic contrast to the living water Christ gives (<a href='/AIV/43/4/14'>John 4:14</a>)."
    },
    {
      "pk": 2402018,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 18,
      "text": "For by speaking arrogant and empty words, they entice, through the desires of the flesh, those who are barely escaping from those who live in error.",
      "links": "<a href='/AIV/60/1/14'>1 Pet. 1:14</a>",
      "comment": "False teachers target the spiritually inexperienced, exploiting weakness and confusion."
    },
    {
      "pk": 2402019,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 19,
      "text": "They promise freedom while they themselves are slaves of corruption; for people are slaves to whatever has mastered them.",
      "links": "<a href='/AIV/43/8/34'>John 8:34</a>; <a href='/AIV/45/6/16'>Rom. 6:16</a>",
      "comment": "True spiritual freedom is only found through union with Christ—freedom from sin, not merely from external rules. This verse directly recalls Jesus’ teaching on slavery to sin."
    },
    {
      "pk": 2402020,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 20,
      "text": "For if, after escaping the defilements of the world through the knowledge of our Lord and Savior Jesus Christ, they are entangled again and overcome, the last state has become worse for them than the first.",
      "links": "<a href='/AIV/40/12/45'>Matt. 12:45</a>; <a href='/AIV/58/6/4-6'>Heb. 6:4-6</a>",
      "comment": "The possibility of falling away after coming to faith demonstrates the seriousness of remaining steadfast, aligning with Jesus’ own warnings about apostasy and the 'end worse than the beginning.'"
    },
    {
      "pk": 2402021,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 21,
      "text": "For it would have been better for them never to have known the way of righteousness than, after knowing it, to turn away from the holy commandment handed down to them.",
      "links": "<a href='/AIV/41/14/21'>Mark 14:21</a>",
      "comment": "'The holy commandment handed down' highlights the apostolic tradition and authority passed on through leaders in the early Church. The implication is that rejecting apostolic teaching carries grave spiritual consequences."
    },
    {
      "pk": 2402022,
      "translation": "AIV",
      "book": 61,
      "chapter": 2,
      "verse": 22,
      "text": "What has happened to them fulfills the true proverb: 'A dog returns to its own vomit,' and 'A washed pig returns to wallowing in the mud.'",
      "links": "<a href='/AIV/20/26/11'>Prov. 26:11</a>",
      "comment": "These proverbs underscore the foolishness and tragedy of turning back to sin after receiving grace. The washing metaphor can be associated with baptism, a rebirth which, if rejected, brings greater condemnation (see <a href='/AIV/58/10/26-27'>Heb. 10:26-27</a>)."
    }
  ],
  "translatedAt": "2025-12-23T04:17:02.416Z"
}