{
  "book": "2 Peter",
  "bookAbbreviation": "2Pet",
  "chapter": 1,
  "verses": [
    {
      "pk": 2102001,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 1,
      "text": "Simon Peter, a servant and apostle of Jesus Christ, to those who have obtained a faith just as precious as ours, through the righteousness of our God and Savior Jesus Christ:",
      "links": "<a href='/AIV/45/1/5'>Rom. 1:5</a>; <a href='/AIV/56/1/4'>Titus 1:4</a>",
      "comment": "Peter directly calls Jesus both 'God' and 'Savior,' a clear high christology and a strong affirmation of Jesus’ divinity. The greeting reminds us that faith is a gift obtained by God’s righteousness, not our own achievement."
    },
    {
      "pk": 2102002,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 2,
      "text": "Grace and peace be multiplied to you in the knowledge of God and of Jesus our Lord.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/60/1/2'>1 Pet. 1:2</a>",
      "comment": "Peter places the knowledge (experiential and relational, not just intellectual) of God and Jesus as the source of multiplied grace and peace. 'Jesus our Lord' further links Christ’s lordship with the Old Testament use of 'Lord' for God."
    },
    {
      "pk": 2102003,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 3,
      "text": "His divine power has given us everything we need for life and godliness, through the knowledge of Him who called us by His own glory and excellence.",
      "links": "<a href='/AIV/49/1/19'>Eph. 1:19</a>; <a href='/AIV/54/6/12'>1 Tim. 6:12</a>",
      "comment": "God’s power, not our efforts, equips us for living a holy life. The phrase 'called us by His own glory' points to the divine initiative in salvation—God’s glory attracts, not merely His commands."
    },
    {
      "pk": 2102004,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 4,
      "text": "By these He has given us His very great and precious promises, so that through them you may share in the divine nature, having escaped the corruption that is in the world because of desire.",
      "links": "<a href='/AIV/45/8/29-30'>Rom. 8:29-30</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "'Share in the divine nature' is a profound phrase suggesting transformative participation in God’s life. This is more than moral improvement—it's a real change worked by grace, anticipated in the Old Testament promise of a new heart (<a href='/AIV/26/36/26'>Ezek. 36:26</a>)."
    },
    {
      "pk": 2102005,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 5,
      "text": "For this very reason, make every effort to supplement your faith with virtue, virtue with knowledge,",
      "links": "<a href='/AIV/48/5/6'>Gal. 5:6</a>",
      "comment": "Though salvation is by grace, Peter exhorts believers to actively develop virtue. Faith must grow and is not static; effort and cooperation with grace are emphasized here."
    },
    {
      "pk": 2102006,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 6,
      "text": "and knowledge with self-control, self-control with endurance, and endurance with godliness,",
      "links": "<a href='/AIV/54/6/11'>1 Tim. 6:11</a>; <a href='/AIV/45/5/3-5'>Rom. 5:3–5</a>",
      "comment": "This spiritual progression shows a harmony between faith and works. The virtues listed are the fruit of a life transformed by God’s promises and grace."
    },
    {
      "pk": 2102007,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 7,
      "text": "and godliness with brotherly affection, and brotherly affection with love.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/45/12/10'>Rom. 12:10</a>",
      "comment": "Brotherly affection (philadelphia) leads to unconditional love (agape), reflecting the highest commandment to love. Growth in love is the ultimate completion of the Christian life."
    },
    {
      "pk": 2102008,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 8,
      "text": "For if these qualities are yours and are increasing, they will keep you from being ineffective or unfruitful in the knowledge of our Lord Jesus Christ.",
      "links": "<a href='/AIV/40/7/19'>Matt. 7:19</a>; <a href='/AIV/43/15/2'>John 15:2</a>",
      "comment": "Continual growth in virtue ensures fruitfulness in Christ, echoing Jesus’ teaching about fruit-bearing disciples. The implication is that growth is a life-long journey."
    },
    {
      "pk": 2102009,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 9,
      "text": "But whoever lacks these qualities is nearsighted and blind, forgetting that he was cleansed from his past sins.",
      "links": "<a href='/AIV/58/9/14'>Heb. 9:14</a>",
      "comment": "A warning to Christians not to take spiritual cleansing for granted. Ongoing conversion of life is needed—not a single event of forgiveness."
    },
    {
      "pk": 2102010,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 10,
      "text": "Therefore, brothers, be all the more diligent to confirm your calling and election, for if you do these things, you will never stumble.",
      "links": "<a href='/AIV/46/9/27'>1 Cor. 9:27</a>; <a href='/AIV/50/2/12'>Phil. 2:12</a>",
      "comment": "Peter calls believers to diligence in living out their faith to confirm their calling—holiness is both a gift and a responsibility. This highlights the role of perseverance."
    },
    {
      "pk": 2102011,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 11,
      "text": "For in this way there will be richly provided for you an entrance into the eternal kingdom of our Lord and Savior Jesus Christ.",
      "links": "<a href='/AIV/40/25/34'>Matt. 25:34</a>; <a href='/AIV/44/14/22'>Acts 14:22</a>",
      "comment": "Entrance into the eternal kingdom is both present and future—the fullness of God’s reign. The phrase ‘richly provided’ suggests an abundant reward for perseverance."
    },
    {
      "pk": 2102012,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 12,
      "text": "Therefore I intend always to remind you of these things, though you know them and are established in the truth you have.",
      "links": "<a href='/AIV/46/15/1'>1 Cor. 15:1</a>",
      "comment": "Peter’s repeated reminders reveal the importance of continuous teaching and tradition in preserving the faith, ensuring believers remain grounded in the truth."
    },
    {
      "pk": 2102013,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 13,
      "text": "I think it right, as long as I am in this body, to stir you up by way of reminder,",
      "links": "<a href='/AIV/55/1/6'>2 Tim. 1:6</a>",
      "comment": "Peter sees his role as ongoing encouragement—reminding the Church is a model of apostolic teaching, entrusted to faithful men, ensuring doctrine endures through generations."
    },
    {
      "pk": 2102014,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 14,
      "text": "since I know that the putting off of my body will come soon, as our Lord Jesus Christ has made clear to me.",
      "links": "<a href='/AIV/43/21/18-19'>John 21:18-19</a>",
      "comment": "Peter references Jesus’ prophecy about his death. This unique apostolic authority comes from Christ’s commission and personal interaction."
    },
    {
      "pk": 2102015,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 15,
      "text": "And I will make every effort so that after my departure you may be able at any time to recall these things.",
      "links": "<a href='/AIV/55/2/2'>2 Tim. 2:2</a>",
      "comment": "Peter’s concern for passing on the faith after his death shows the importance of apostolic succession and authoritative teaching, ensuring the Church’s continuity."
    },
    {
      "pk": 2102016,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 16,
      "text": "For we did not follow cleverly invented stories when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of His majesty.",
      "links": "<a href='/AIV/40/17/1-5'>Matt. 17:1–5</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "Peter insists the apostolic witness is based on real events he personally experienced, not myth or legend. This grounds Christian faith in objective, historical reality."
    },
    {
      "pk": 2102017,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 17,
      "text": "For He received honor and glory from God the Father when a voice such as this was spoken to Him by the Majestic Glory: 'This is my beloved Son, with whom I am well pleased.'",
      "links": "<a href='/AIV/40/17/5'>Matt. 17:5</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "Peter echoes the Transfiguration, affirming Jesus' unique Sonship and fulfillment of Psalm 2’s messianic prophecy, emphasizing the revelation of Jesus’ divinity."
    },
    {
      "pk": 2102018,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 18,
      "text": "And we ourselves heard this very voice borne from heaven, for we were with Him on the holy mountain.",
      "links": "<a href='/AIV/40/17/6'>Matt. 17:6</a>",
      "comment": "Peter’s testimony underscores apostolic authority as eyewitnesses, a unique foundation for the faith and for the Church’s living memory of Christ."
    },
    {
      "pk": 2102019,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 19,
      "text": "And we have something even more sure—the prophetic word—to which you would do well to pay attention as to a lamp shining in a dark place, until the day dawns and the morning star rises in your hearts.",
      "links": "<a href='/AIV/19/119/105'>Ps. 119:105</a>; <a href='/AIV/66/22/16'>Rev. 22:16</a>",
      "comment": "Prophetic Scripture is reliable and authoritative, guiding Christians until Christ’s return ('morning star'). The Church’s tradition of interpreting Scripture is implied as essential for understanding its fullness and safeguard against error."
    },
    {
      "pk": 2102020,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 20,
      "text": "Above all, you must know this: no prophecy of Scripture comes from someone’s own interpretation.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/54/3/15'>1 Tim. 3:15</a>",
      "comment": "Scripture’s meaning is not subject to private interpretation. It requires authoritative guidance, hinting at the necessity of a teaching office within the Church to authentically interpret Scripture."
    },
    {
      "pk": 2102021,
      "translation": "AIV",
      "book": 61,
      "chapter": 1,
      "verse": 21,
      "text": "For prophecy never came by human will; instead, men spoke from God as they were carried along by the Holy Spirit.",
      "links": "<a href='/AIV/10/23/2'>2 Sam. 23:2</a>; <a href='/AIV/53/2/13'>2 Thess. 2:13</a>",
      "comment": "Prophecy’s divine origin underscores the work of the Holy Spirit through chosen men, preserving the truth throughout generations. This hints at the ongoing, Spirit-led preservation of correct doctrine and interpretation in the one Church Christ established."
    }
  ],
  "translatedAt": "2025-12-23T04:16:33.453Z"
}