{
  "book": 61,
  "bookName": "1 Timothy",
  "bookAbbreviation": "1Tim",
  "chapter": 1,
  "verses": [
    {
      "pk": 61001001,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the command of God our Savior and Christ Jesus our hope,",
      "links": "<a href='/AIV/45/1/1'>Rom. 1:1</a>; <a href='/AIV/56/1/3'>Titus 1:3</a>",
      "comment": "Paul affirms his apostolic authority, explicitly noting both God as Savior and Christ Jesus as hope – a subtle emphasis on unity of God’s saving work. Apostleship here is by divine command, not merely human choice."
    },
    {
      "pk": 61001002,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 2,
      "text": "To Timothy, my true child in the faith: Grace, mercy, and peace from God the Father and Christ Jesus our Lord.",
      "links": "<a href='/AIV/54/1/2'>2 Tim. 1:2</a>; <a href='/AIV/56/1/4'>Titus 1:4</a>",
      "comment": "Paul’s address to Timothy emphasizes spiritual fatherhood and the transmission of faith. ‘Grace, mercy, and peace’ carries an expanded blessing typical of pastoral epistles, reflecting the fullness available through both Father and Son."
    },
    {
      "pk": 61001003,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 3,
      "text": "As I urged you when I went to Macedonia, stay in Ephesus so you may command certain people not to teach false doctrines,",
      "links": "<a href='/AIV/44/20/1'>Acts 20:1</a>; <a href='/AIV/56/1/11'>Titus 1:11</a>",
      "comment": "Paul instructs Timothy to exercise authority – not merely suggest – regarding doctrine, showing a concern for preserving correct teaching in the local church, and highlighting early need for oversight and guardianship."
    },
    {
      "pk": 61001004,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 4,
      "text": "and not to occupy themselves with myths and endless genealogies, which lead to speculations rather than the stewardship from God that is by faith.",
      "links": "<a href='/AIV/56/1/14'>Titus 1:14</a>; <a href='/AIV/56/3/9'>Titus 3:9</a>",
      "comment": "The focus is on guarding against distracting, speculative teachings that obscure the essentials of faith and proper 'stewardship' – a term emphasizing entrusted responsibility within the Church."
    },
    {
      "pk": 61001005,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 5,
      "text": "Now the aim of this instruction is love that comes from a pure heart, a good conscience, and sincere faith.",
      "links": "<a href='/AIV/45/13/10'>Rom. 13:10</a>; <a href='/AIV/54/1/19'>1 Tim. 1:19</a>",
      "comment": "Instruction’s goal is not mere knowledge but transformative love, rooted in purity, right conscience, and authentic faith. The triple focus connects interior spiritual reality with visible Church life."
    },
    {
      "pk": 61001006,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 6,
      "text": "Some have swerved from these, turning aside to meaningless talk.",
      "links": "<a href='/AIV/54/6/20'>1 Tim. 6:20</a>; <a href='/AIV/56/1/10'>Titus 1:10</a>",
      "comment": "A warning about abandoning foundational virtues, leading to empty words. This emphasizes the danger of departing from Apostolic teaching for speculative philosophies or traditions not handed down."
    },
    {
      "pk": 61001007,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 7,
      "text": "They desire to be teachers of the law, but they do not understand what they say or the things they so confidently affirm.",
      "links": "<a href='/AIV/40/23/2-3'>Matt. 23:2-3</a>; <a href='/AIV/45/2/21'>Rom. 2:21</a>",
      "comment": "The passage criticizes those presuming to teach without authentic understanding, recalling Jesus' rebuke to false teachers. It stresses the necessity of being properly formed before instructing others in faith."
    },
    {
      "pk": 61001008,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 8,
      "text": "Now we know that the law is good, if one uses it lawfully.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/45/7/12'>Rom. 7:12</a>",
      "comment": "The law’s purpose is affirmed as good, but requires correct application. This is consistent with both Old Testament wisdom and Paul’s teaching, bridging moral law and Christ’s fulfillment of the law."
    },
    {
      "pk": 61001009,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 9,
      "text": "Understanding this, that the law is not laid down for the righteous, but for the lawless and disobedient, for the ungodly and sinners, for the unholy and profane, for those who kill their fathers or mothers, for murderers,",
      "links": "<a href='/AIV/45/3/19-20'>Rom. 3:19-20</a>; <a href='/AIV/16/13/15'>Neh. 13:15</a>",
      "comment": "The law’s primary function is to expose and restrain sin, not to justify the righteous. It lists grave sin reflecting the Decalogue’s outline, and showcases the seriousness of violating the moral commandments."
    },
    {
      "pk": 61001010,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 10,
      "text": "the sexually immoral, those practicing homosexuality, slave traders, liars, perjurers, and whatever else is against sound doctrine,",
      "links": "<a href='/AIV/46/6/9-10'>1 Cor. 6:9-10</a>; <a href='/AIV/2/20/14-16'>Ex. 20:14-16</a>",
      "comment": "Paul’s list reflects a range of prohibited acts as outlined in Mosaic law. ‘Sound doctrine’ implies a standard against which all actions must be measured, presupposing a preserved teaching."
    },
    {
      "pk": 61001011,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 11,
      "text": "in accordance with the gospel of the glory of the blessed God, which I have been entrusted with.",
      "links": "<a href='/AIV/45/16/25'>Rom. 16:25</a>; <a href='/AIV/54/6/20'>1 Tim. 6:20</a>",
      "comment": "Paul refers to a transmission of the Gospel as a stewardship, linking it with the glory of God. The ‘entrusting’ language supports the idea of apostolic succession and preservation of doctrine."
    },
    {
      "pk": 61001012,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 12,
      "text": "I give thanks to Christ Jesus our Lord, who has strengthened me, because He considered me faithful, appointing me to service,",
      "links": "<a href='/AIV/45/15/17'>Rom. 15:17</a>; <a href='/AIV/46/7/25'>1 Cor. 7:25</a>",
      "comment": "Paul credits Christ for his calling and strength, stressing divine initiative and the dignity of ministry as service appointed, not self-attained."
    },
    {
      "pk": 61001013,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 13,
      "text": "though formerly I was a blasphemer, persecutor, and insolent opponent. Yet I received mercy because I acted ignorantly in unbelief.",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>; <a href='/AIV/45/11/30-32'>Rom. 11:30-32</a>",
      "comment": "Paul’s testimony highlights undeserved mercy, with engagement of ignorance as a mitigating factor. Divine mercy is central, with regeneration and transformation made possible in Christ."
    },
    {
      "pk": 61001014,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 14,
      "text": "And the grace of our Lord overflowed for me with the faith and love that are in Christ Jesus.",
      "links": "<a href='/AIV/45/5/20'>Rom. 5:20</a>; <a href='/AIV/49/2/8'>Eph. 2:8</a>",
      "comment": "The superabundance of grace in Christ is stressed, with faith and love as intrinsic to this new life. Overflow implies more than sufficiency – a spiritual reality that is poured out generously."
    },
    {
      "pk": 61001015,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 15,
      "text": "This saying is trustworthy and deserving full acceptance: that Christ Jesus came into the world to save sinners—of whom I am foremost.",
      "links": "<a href='/AIV/43/3/17'>John 3:17</a>; <a href='/AIV/45/5/8'>Rom. 5:8</a>",
      "comment": "Paul summarizes the Gospel's central purpose: Jesus' mission is to save sinners, not merely instruct or exhort. Use of ‘trustworthy saying’ reminds readers of fixed, reliable teaching traditions in the Church."
    },
    {
      "pk": 61001016,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 16,
      "text": "But I received mercy for this reason, that in me as the foremost, Christ Jesus might display his complete patience as an example to those who would believe in Him for eternal life.",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/45/2/4'>Rom. 2:4</a>",
      "comment": "Paul’s own transformation becomes an exemplar for those who would turn from sin. The text points to the transformative power of grace and highlights Christ’s patience as a divine attribute."
    },
    {
      "pk": 61001017,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 17,
      "text": "To the King of the ages, immortal, invisible, the only God, be honor and glory forever and ever. Amen.",
      "links": "<a href='/AIV/19/145/13'>Ps. 145:13</a>; <a href='/AIV/46/15/28'>1 Cor. 15:28</a>",
      "comment": "Paul’s doxology ascribes divine attributes (eternity, immortality, invisibility, uniqueness) to God, connecting Old Testament praise with New Testament revelation, and forming a liturgical formula for Christian worship."
    },
    {
      "pk": 61001018,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 18,
      "text": "This charge I entrust to you, Timothy, my child, according to the prophecies previously made about you, that by them you may wage the good warfare,",
      "links": "<a href='/AIV/54/4/14'>1 Tim. 4:14</a>; <a href='/AIV/46/9/7'>1 Cor. 9:7</a>",
      "comment": "Paul refers to transmitted authority given through prophecy, suggesting more than individual spiritual gifts – it reveals a continuity and safeguarding of the faith through ordered leadership."
    },
    {
      "pk": 61001019,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 19,
      "text": "holding faith and a good conscience. By rejecting these, some have suffered shipwreck with regard to their faith.",
      "links": "<a href='/AIV/54/3/9'>1 Tim. 3:9</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Faith and conscience are paired as bulwark of spiritual life. Shipwreck connotes total loss, emphasizing grave consequences when foundational teachings passed down are abandoned."
    },
    {
      "pk": 61001020,
      "translation": "AIV",
      "book": 61,
      "bookName": "1 Timothy",
      "bookAbbreviation": "1Tim",
      "chapter": 1,
      "verse": 20,
      "text": "Among them are Hymenaeus and Alexander, whom I have handed over to Satan so they may learn not to blaspheme.",
      "links": "<a href='/AIV/46/5/5'>1 Cor. 5:5</a>; <a href='/AIV/54/2/17'>2 Tim. 2:17</a>",
      "comment": "Paul’s action employs disciplinary exclusion as practiced in the early Church, for corrective, redemptive purposes – emphasizing accountability and the need for order and visible unity within the Church."
    }
  ],
  "translatedAt": "2025-12-24T12:10:45.827Z"
}