{
  "book": 41,
  "bookName": "Nahum",
  "bookAbbreviation": "Nah",
  "chapter": 2,
  "verses": [
    {
      "pk": 41002001,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 1,
      "text": "A scatterer has come up against you. Guard the fortress, watch the road, strengthen your loins, reinforce your power greatly.",
      "links": "<a href='/AIV/23/21/6'>Isa. 21:6</a>; <a href='/AIV/34/3/14'>Nah. 3:14</a>",
      "comment": "Nahum prophesies the impending invasion of Nineveh. The command to 'guard the fortress' reveals an imminent attack, prompting defense readiness. The military imagery anticipates the thorough defeat of evil, echoing God’s just judgment against oppressors."
    },
    {
      "pk": 41002002,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 2,
      "text": "For the LORD restores the majesty of Jacob as the majesty of Israel, for destroyers have laid them waste and ruined their vines.",
      "links": "<a href='/AIV/24/30/18'>Jer. 30:18</a>; <a href='/AIV/29/3/2'>Joel 3:2</a>",
      "comment": "This verse contrasts the destruction of Jacob-Israel by foreign powers with the Lord’s promise to restore their greatness. The reference to vines alludes to God’s covenant people as a vineyard (Isa. 5:7), symbolizing both judgment and hope of restoration with deep ecclesial connotations; God’s people are to be restored to unity and splendor."
    },
    {
      "pk": 41002003,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 3,
      "text": "The shields of his mighty men are red, the warriors are clothed in scarlet. The chariots flash with steel on the day of battle, and the lances are brandished.",
      "links": "<a href='/AIV/23/63/2-3'>Isa. 63:2-3</a>",
      "comment": "The vivid colors evoke bloodshed and royal power. The scarlet and flashing chariots portray the terror facing Nineveh. This passage hints at the theme of holy war—where the Lord uses even pagan armies for his purpose, much like he uses flawed instruments for righteousness within the Church."
    },
    {
      "pk": 41002004,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 4,
      "text": "The chariots race madly through the streets; they rush to and fro through the squares. Their appearance is like torches; they dart like lightning.",
      "links": "<a href='/AIV/34/3/2'>Nah. 3:2</a>",
      "comment": "This battle imagery intensifies the sense of chaos and speed. The chariots like torches prefigure the swift and inescapable judgment of God—a reminder that human pride falls before divine sovereignty, underscoring God’s power over even the greatest empires."
    },
    {
      "pk": 41002005,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 5,
      "text": "He calls his nobles; they stumble as they go. They hasten to the wall, and the defense is prepared.",
      "links": "<a href='/AIV/23/19/14'>Isa. 19:14</a>",
      "comment": "The nobles’ stumbling underscores the confusion and panic attacking Nineveh. Human authorities, however exalted, are powerless in the day of God’s retribution. Spiritual application: even the strongest leaders must rely on more than earthly might—divine grace is essential in true defense."
    },
    {
      "pk": 41002006,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 6,
      "text": "The river gates are opened, and the palace melts away.",
      "links": "<a href='/AIV/27/5/30-31'>Dan. 5:30-31</a>",
      "comment": "Historical note: Nineveh’s destruction involved the flooding of the city, fulfilling prophecy. The melting palace is both literal and symbolic; ultimate security comes only from God’s protection and the water imagery subtly recalls the waters of judgment (Gen. 7)."
    },
    {
      "pk": 41002007,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 7,
      "text": "It is decreed: she is stripped, carried away; her maidservants moan like doves, beating their breasts.",
      "links": "<a href='/AIV/23/38/14'>Isa. 38:14</a>; <a href='/AIV/42/23/27'>Luke 23:27</a>",
      "comment": "Nineveh is personified as a woman enslaved—her defeat is inevitable by the divine decree. The lament recalls the mourning for Jerusalem at the Passion (Luke 23:27), drawing subtle connections between God’s justice and redemptive suffering."
    },
    {
      "pk": 41002008,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 8,
      "text": "Nineveh is like a pool whose waters run away. 'Stop! Stop!' they cry, but none turns back.",
      "links": "<a href='/AIV/19/114/3'>Ps. 114:3</a>",
      "comment": "As waters pour out of a breached pool, Nineveh’s people scatter. The call to stop echoes the futility of resisting divine judgment—another sign that repentance and unity are found only in God’s enduring institution."
    },
    {
      "pk": 41002009,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 9,
      "text": "Plunder the silver! Plunder the gold! There is no end of the treasure, or of the wealth of all precious things.",
      "links": "<a href='/AIV/18/20/15'>Job 20:15</a>",
      "comment": "Here we see the fleeting nature of earthly riches. Nineveh’s treasures are left for the conquerors. Spiritual reading: material wealth perishes, but the spiritual inheritance passed to the faithful endures (Matt. 6:19-21)."
    },
    {
      "pk": 41002010,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 10,
      "text": "Desolate! Devastated! Destroyed! Hearts melt and knees tremble; anguish is in all loins, all faces grow pale.",
      "links": "<a href='/AIV/26/7/17'>Ezek. 7:17</a>; <a href='/AIV/42/21/26'>Luke 21:26</a>",
      "comment": "This triple pronouncement expresses utter defeat and terror. The emotional devastation has apocalyptic echoes, culminating in the final judgment. Compare Luke 21:26 for eschatological resonance with Christ’s own teaching."
    },
    {
      "pk": 41002011,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 11,
      "text": "Where is the lions’ den, the feeding place of the young lions, where the lion and lioness went, where none made them afraid?",
      "links": "<a href='/AIV/26/19/2'>Ezek. 19:2</a>",
      "comment": "Nineveh is compared to a den of lions—once feared, now gone. The question highlights the collapse of earthly power, reminding us that even the mightiest empires fall. Symbolically, the steadfastness found within God’s house remains even when worldly kingdoms perish."
    },
    {
      "pk": 41002012,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 12,
      "text": "The lion tore enough for his cubs and strangled prey for his lionesses; he filled his caves with prey and his dens with torn flesh.",
      "links": "<a href='/AIV/35/1/8'>Hab. 1:8</a>",
      "comment": "The way Nineveh plundered for its own gain is symbolized in the lion’s violence. The imagery reveals the corrupt nature of unjust rulers. Ultimately, justice prevails; the one institution reserved and protected by God is not built on conquest but on service and sacrifice."
    },
    {
      "pk": 41002013,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 2,
      "verse": 13,
      "text": "'Behold, I am against you,' declares the LORD of hosts, 'and I will burn your chariots in smoke, and the sword shall devour your young lions. I will cut off your prey from the earth, and the voice of your messengers shall no longer be heard.'",
      "links": "<a href='/AIV/24/21/13'>Jer. 21:13</a>; <a href='/AIV/23/47/1'>Isa. 47:1</a>",
      "comment": "God’s judgment is emphatic and final. Those who trust in violence and pride face destruction. The silence of the messengers and the cessation of messages serve as a reminder that God’s word endures above all human institutions. Christologically, the true King and His message will never be silenced, establishing an everlasting kingdom built on unity and authority."
    }
  ],
  "translatedAt": "2025-12-24T09:50:16.479Z"
}