{
  "book": "Nahum",
  "bookAbbreviation": "Nah",
  "chapter": 1,
  "verses": [
    {
      "pk": 940011,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 1,
      "text": "An oracle concerning Nineveh. The book of the vision of Nahum of Elkosh.",
      "links": "<a href='/AIV/36/2/13'>Zeph. 2:13</a>; <a href='/AIV/32/1/1'>Jonah 1:1–2</a>",
      "comment": "Nineveh is the capital of Assyria. This introduction sets the context for the prophecy."
    },
    {
      "pk": 940012,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 2,
      "text": "The LORD is a jealous and avenging God; the LORD takes vengeance and is filled with wrath. The LORD takes vengeance on His adversaries and stores up fury for His enemies.",
      "links": "<a href='/AIV/2/20/5'>Exod. 20:5</a>; <a href='/AIV/5/32/35'>Deut. 32:35</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "The text underscores God's justice and zeal for righteousness. Jealousy here refers to divine possessiveness for His people. See also Hebrews 10:30 for New Testament application."
    },
    {
      "pk": 940013,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 3,
      "text": "The LORD is slow to anger and great in power, yet He will by no means clear the guilty. His way is in the whirlwind and the storm, and the clouds are the dust of His feet.",
      "links": "<a href='/AIV/2/34/6-7'>Exod. 34:6–7</a>; <a href='/AIV/19/104/3'>Ps. 104:3</a>",
      "comment": "God is patient and merciful but still holds the guilty accountable—demonstrating both perfect mercy and perfect justice. Compare with Romans 2:4 for the New Testament view of God's patience."
    },
    {
      "pk": 940014,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 4,
      "text": "He rebukes the sea and makes it dry; He dries up all the rivers. Bashan and Carmel wither, and the blossom of Lebanon fades.",
      "links": "<a href='/AIV/2/14/21'>Exod. 14:21</a>; <a href='/AIV/6/3/15-17'>Josh. 3:15–17</a>",
      "comment": "This shows God's supremacy over nature and the land. Bashan, Carmel, and Lebanon were known for their fertileness, emphasizing that nothing is beyond God's power."
    },
    {
      "pk": 940015,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 5,
      "text": "The mountains quake before Him; the hills melt away. The earth trembles at His presence, the world and all who dwell in it.",
      "links": "<a href='/AIV/19/97/5'>Ps. 97:5</a>; <a href='/AIV/19/114/7'>Ps. 114:7</a>",
      "comment": "A theophany—God's manifest presence—undermines even the strongest elements of creation. This imagery is also present at Sinai (Exodus 19:18)."
    },
    {
      "pk": 940016,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 6,
      "text": "Who can stand before His anger? Who can withstand the heat of His fury? His wrath is poured out like fire, and the rocks are shattered by Him.",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>; <a href='/AIV/66/6/17'>Rev. 6:17</a>",
      "comment": "This verse raises rhetorical questions to stress the overwhelming power of God's judgment. Also see Revelation 6:17, connecting God’s wrath to the final judgment."
    },
    {
      "pk": 940017,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 7,
      "text": "The LORD is good, a stronghold in the day of trouble; He knows those who take refuge in Him.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>; <a href='/AIV/19/34/8'>Ps. 34:8</a>",
      "comment": "A note of comfort: The Lord's nature is both just and benevolent. 'Knows' suggests intimate, covenantal relationship—a theme running from Genesis to Jesus’ description of His sheep in John 10:14."
    },
    {
      "pk": 940018,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 8,
      "text": "But with an overflowing flood, He will make a complete end of His adversaries, and will pursue His enemies into darkness.",
      "links": "<a href='/AIV/1/7/11-12'>Gen. 7:11–12</a>; <a href='/AIV/19/18/9'>Ps. 18:9</a>",
      "comment": "The 'overflowing flood' may symbolize both literal judgment and a spiritual purging. The total defeat of evil is anticipated, echoed in Revelation 20:10."
    },
    {
      "pk": 940019,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 9,
      "text": "What do you plot against the LORD? He will make a complete end; trouble will not rise up a second time.",
      "links": "<a href='/AIV/23/14/27'>Isa. 14:27</a>; <a href='/AIV/38/1/6'>Zech. 1:6</a>",
      "comment": "This is an assurance that God's enemies cannot oppose Him. The permanence of God's judgment—'trouble will not rise a second time'—underscores the completeness of His victory."
    },
    {
      "pk": 940020,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 10,
      "text": "For they are entangled like thorns, and drunk as with their drink; they are consumed like stubble fully dry.",
      "links": "<a href='/AIV/19/58/9'>Ps. 58:9</a>; <a href='/AIV/23/5/24'>Isa. 5:24</a>",
      "comment": "Use of agricultural images (thorns, stubble) denotes the swiftness and certainty of divine destruction, a familiar image in both Old and New Testaments."
    },
    {
      "pk": 940021,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 11,
      "text": "From you came one who plotted evil against the LORD, a worthless counselor.",
      "links": "<a href='/AIV/23/10/7'>Isa. 10:7</a>; <a href='/AIV/42/23/12'>Luke 23:12</a>",
      "comment": "Refers to a specific leader of Assyria but foreshadows figures opposed to God’s plan throughout salvation history, with echoes of the 'man of sin' in 2 Thessalonians 2:3-4."
    },
    {
      "pk": 940022,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 12,
      "text": "This is what the LORD says: Though they are at full strength and many, they will be cut down and pass away. Though I have afflicted you, I will not afflict you again.",
      "links": "<a href='/AIV/23/37/36-38'>Isa. 37:36–38</a>; <a href='/AIV/19/94/13'>Ps. 94:13</a>",
      "comment": "God assures His people of deliverance. Temporarily permitting affliction, God brings ultimate relief—suggestive of spiritual purification and discipline, not loosed from His sovereign plan."
    },
    {
      "pk": 940023,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 13,
      "text": "Now I will break his yoke from upon you and burst your bonds apart.",
      "links": "<a href='/AIV/23/9/4'>Isa. 9:4</a>; <a href='/AIV/40/11/29-30'>Matt. 11:29–30</a>",
      "comment": "Freedom is given by God alone. Jesus’ words in Matthew 11 echo this promise of breaking oppressive yokes, pointing to both physical and spiritual liberation."
    },
    {
      "pk": 940024,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 14,
      "text": "The LORD has commanded concerning you: 'No more descendants shall bear your name; I will cut off the carved image and the cast idol from the house of your gods. I will prepare your grave, for you are vile.'",
      "links": "<a href='/AIV/23/37/38'>Isa. 37:38</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4–8</a>",
      "comment": "The destruction of idolatry and the end of the enemy’s lineage is decreed. The Lord is uncompromising about pure worship. This theme is deepened in Christ, who fulfills and surpasses the Old Testament law."
    },
    {
      "pk": 940025,
      "translation": "AIV",
      "book": 34,
      "chapter": 1,
      "verse": 15,
      "text": "Behold, on the mountains, the feet of him who brings good news, who proclaims peace! Keep your feasts, O Judah; fulfill your vows. For never again shall the wicked pass through you; he is cut off completely.",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/45/10/15'>Rom. 10:15</a>",
      "comment": "This verse is cited by Paul in Romans as foretelling the gospel’s arrival. The command to keep the feasts and vows points to the ongoing importance of both communal worship and sacramental life, inviting reflection on the way Christ continues God's saving work and establishes lasting peace."
    }
  ],
  "translatedAt": "2025-12-23T07:32:55.098Z"
}