{
  "book": "Nahum",
  "bookAbbreviation": "Nah",
  "chapter": 3,
  "verses": [
    {
      "pk": 340301,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 1,
      "text": "Woe to the city of blood—full of lies, full of plunder—never ending is the prey.",
      "links": "<a href='/AIV/23/1/21'>Isaiah 1:21</a>; <a href='/AIV/26/24/6'>Ezek. 24:6</a>",
      "comment": "Nineveh is called the 'city of blood,' emphasizing its violence and treachery. The lament echoes prophetic language used for other wicked cities."
    },
    {
      "pk": 340302,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 2,
      "text": "The sound of the whip, and the rumble of wheels! Galloping horses and jolting chariots!",
      "links": "<a href='/AIV/12/9/20'>2 Kings 9:20</a>",
      "comment": "Describes the battle and the chaos that is about to come upon Nineveh."
    },
    {
      "pk": 340303,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 3,
      "text": "Charging horsemen, flashing swords, and glittering spears—a multitude of slain, heaps of bodies, endless corpses—they stumble over the dead.",
      "links": "<a href='/AIV/23/37/36'>Isaiah 37:36</a>",
      "comment": "A vivid image of devastation and divine judgment, reminiscent of other moments where destruction falls suddenly on those who oppose God."
    },
    {
      "pk": 340304,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 4,
      "text": "All because of the countless acts of prostitution of the seductive mistress, the master of sorceries, who enslaved nations with her prostitution, and tribes with her sorceries.",
      "links": "<a href='/AIV/23/47/9-12'>Isa. 47:9–12</a>; <a href='/AIV/66/17/1-6'>Rev. 17:1–6</a>",
      "comment": "Nineveh is personified as a prostitute, a common prophetic image for idolatry and spiritual corruption. This language foreshadows later apocalyptic warnings about the corrupting influence of worldly powers."
    },
    {
      "pk": 340305,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 5,
      "text": "Behold, I am against you, declares the LORD of hosts; I will lift up your skirts over your face and show the nations your nakedness and the kingdoms your shame.",
      "links": "<a href='/AIV/23/20/4'>Isa. 20:4</a>; <a href='/AIV/24/13/26'>Jer. 13:26</a>",
      "comment": "God’s judgment results in humiliation and exposure before the world. God is the just judge who reveals the hidden sins of the proud."
    },
    {
      "pk": 340306,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 6,
      "text": "I will fling filth at you, treat you with contempt, and make you a spectacle.",
      "links": "<a href='/AIV/23/25/3'>Isaiah 25:3</a>; <a href='/AIV/26/28/17'>Ezek. 28:17</a>",
      "comment": "The language intensifies to show the depth of judgment; disgrace and shame reflect God’s righteous anger."
    },
    {
      "pk": 340307,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 7,
      "text": "All who see you will shrink from you and say, ‘Nineveh is laid waste! Who will mourn for her?’ Where can I find anyone to comfort you?",
      "links": "<a href='/AIV/24/15/5'>Jer. 15:5</a>; <a href='/AIV/23/51/19'>Isa. 51:19</a>",
      "comment": "The rhetorical question implies that Nineveh’s destruction is so deserved that she will find no friends or comforters. Compare the abandonment Christ experienced (cf. John 16:32)."
    },
    {
      "pk": 340308,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 8,
      "text": "Are you better than Thebes, that sat by the Nile, surrounded by waters, whose rampart was the sea and whose wall was water?",
      "links": "<a href='/AIV/24/46/25'>Jer. 46:25</a>",
      "comment": "References the destruction of No-Amon (Thebes), indicating that even the greatest strongholds are not exempt from God’s judgment. This humbles human pride—universal themes fulfilled in the submission of all to Christ (Phil. 2:10)."
    },
    {
      "pk": 340309,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 9,
      "text": "Cush was her strength, Egypt as well, and it was without limit; Put and the Libyans were her helpers.",
      "links": "<a href='/AIV/24/46/8-9'>Jer. 46:8–9</a>",
      "comment": "Thebes’ alliances did not save her. Political and military support cannot guarantee security apart from God."
    },
    {
      "pk": 340310,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 10,
      "text": "Yet she was taken into exile; she went into captivity. Her infants were dashed to pieces at the head of every street; lots were cast for her nobles, and all her great men were bound in chains.",
      "links": "<a href='/AIV/19/137/8-9'>Ps. 137:8-9</a>; <a href='/AIV/23/47/6'>Isa. 47:6</a>",
      "comment": "The tragic end of Thebes is a warning and a prophecy of Nineveh’s fate. The scattering and exile motif foreshadows Israel’s restoration through the Messiah who gathers the nations (cf. John 11:52)."
    },
    {
      "pk": 340311,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 11,
      "text": "You too will become drunk; you will hide yourself; you too will seek refuge from the enemy.",
      "links": "<a href='/AIV/23/19/14'>Isa. 19:14</a>; <a href='/AIV/24/25/15'>Jer. 25:15</a>",
      "comment": "Drunkenness symbolizes disorientation and powerlessness, frequent prophetic images for the unraveling of proud nations. Christ reverses this in Gethsemane, drinking the cup for humanity (Matt. 26:39)."
    },
    {
      "pk": 340312,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 12,
      "text": "All your fortresses are like fig trees with first-ripe figs: if shaken, they fall into the mouth of the eater.",
      "links": "<a href='/AIV/24/24/2'>Jer. 24:2</a>; <a href='/AIV/28/9/10'>Hos. 9:10</a>",
      "comment": "Easily falling figs represent the utter vulnerability of Nineveh’s defenses. This highlights the fruitlessness of resisting God’s will. Fruit imagery is common throughout Scripture (cf. Matt. 21:19)."
    },
    {
      "pk": 340313,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 13,
      "text": "Behold, your troops are women in your midst. The gates of your land are wide open to your enemies; fire has consumed the bars of your gates.",
      "links": "<a href='/AIV/23/19/16'>Isa. 19:16</a>; <a href='/AIV/24/51/30'>Jer. 51:30</a>",
      "comment": "The comparison reflects the utter collapse of morale and strength in Nineveh’s warriors. Gates opened and burned symbolize total defeat."
    },
    {
      "pk": 340314,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 14,
      "text": "Draw water for the siege! Strengthen your forts! Go into the clay and tread the mortar; take hold of the brick mold!",
      "links": "<a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "The call is ironically futile; even frenzied preparation cannot withstand God’s judgment. This theme foreshadows the futility of works apart from grace."
    },
    {
      "pk": 340315,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 15,
      "text": "There the fire will devour you; the sword will cut you off. It will consume you like the locust. Multiply yourselves like the locust; multiply like the grasshopper!",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>; <a href='/AIV/07/7/12'>Judg. 7:12</a>",
      "comment": "Invokes past plagues and judgments connected to the Exodus (see Exod. 10:4–6). The locust as a symbol recalls cycles of sin and judgment, with fulfillment ultimately in Christ who conquers evil."
    },
    {
      "pk": 340316,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 16,
      "text": "You have multiplied your merchants more than the stars of the heavens. The locust spreads out and flies away.",
      "links": "<a href='/AIV/01/15/5'>Gen. 15:5</a>; <a href='/AIV/66/18/11'>Rev. 18:11</a>",
      "comment": "Economic prosperity is fleeting and unreliable in the face of God’s justice. Echoes divine promises and warnings about true riches and dependence on God alone."
    },
    {
      "pk": 340317,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 17,
      "text": "Your princes are like grasshoppers, your scribes like swarms of locusts settling on the fences on a cold day—when the sun rises, they fly away; no one knows where they are.",
      "links": "<a href='/AIV/23/40/6-8'>Isa. 40:6-8</a>",
      "comment": "Even rulers and counselors disappear like locusts, highlighting the fleeting nature of worldly authority. The imagery warns against prideful reliance on earthly leaders."
    },
    {
      "pk": 340318,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 18,
      "text": "Your shepherds are asleep, O king of Assyria; your nobles slumber. Your people are scattered on the mountains, with no one to gather them.",
      "links": "<a href='/AIV/26/34/5'>Ezek. 34:5</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "The failure of Nineveh’s leaders is compared to shepherds who neglect their flock. Christ, the Good Shepherd, is the fulfillment of what human rulers fail to embody (John 10:11–16). Gathering the scattered is a recurring redemptive motif."
    },
    {
      "pk": 340319,
      "translation": "AIV",
      "book": 34,
      "chapter": 3,
      "verse": 19,
      "text": "There is no healing for your wound; your injury is mortal. All who hear of your fate clap their hands over you, for upon whom has not your evil passed continually?",
      "links": "<a href='/AIV/24/46/11'>Jer. 46:11</a>; <a href='/AIV/23/14/20'>Isa. 14:20</a>",
      "comment": "Nineveh’s wound is incurable, emphasizing the finality of God’s judgment. The reaction of the nations underscores the justice of God. This fulfills the principle that God opposes the proud but gives grace to the humble (James 4:6)."
    }
  ],
  "translatedAt": "2025-12-23T07:33:39.500Z"
}