{
  "book": 41,
  "bookName": "Nahum",
  "bookAbbreviation": "Nah",
  "chapter": 3,
  "verses": [
    {
      "pk": 41003001,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 1,
      "text": "Woe to the city of blood, full of lies, full of plunder—never without victims!",
      "links": "<a href='/AIV/19/55/23'>Ps. 55:23</a>; <a href='/AIV/34/2/12'>Nah. 2:12</a>",
      "comment": "The phrase 'city of blood' refers to Nineveh (see Nah. 1:1), notorious for its violence and cruelty. Biblically, cities are often symbolic of entire cultures in rebellion against God, much like Babylon (Rev. 18:2). Spiritually, the judgment is a warning against societies rooted in persistent injustice."
    },
    {
      "pk": 41003002,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 2,
      "text": "The crack of whips, the rumble of wheels, galloping horses and charging chariots.",
      "links": "<a href='/AIV/34/2/4'>Nah. 2:4</a>",
      "comment": "The vivid imagery of warfare here recalls the rapid advance of enemy armies. This judgment connects to prophecies against other pagan cities (see Jer. 46:9). The repetition communicates the inescapable nature of retribution."
    },
    {
      "pk": 41003003,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 3,
      "text": "Horsemen charging, swords flashing and spears gleaming; many fallen, heaps of corpses, countless dead bodies—they stumble over the bodies.",
      "links": "<a href='/AIV/26/39/11'>Ezek. 39:11</a>; <a href='/AIV/24/25/33'>Jer. 25:33</a>",
      "comment": "Describes carnage after the siege. This connects to themes of judgment throughout Scripture, where disregard for justice is met with divine retribution (e.g., Amos 5:12-13)."
    },
    {
      "pk": 41003004,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 4,
      "text": "All this because of the countless acts of prostitution by the prostitute, alluring and skilled in sorcery, who enslaves nations with her prostitution and peoples by her witchcraft.",
      "links": "<a href='/AIV/23/47/9'>Isa. 47:9</a>; <a href='/AIV/66/17/2'>Rev. 17:2</a>",
      "comment": "Nineveh’s idolatry is likened to prostitution, common imagery for spiritual unfaithfulness (Hosea 4:12). Sorcery here suggests seeking power outside of God. Spiritually, it calls to fidelity and holiness."
    },
    {
      "pk": 41003005,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 5,
      "text": "\"I am against you,\" declares the LORD of Armies, \"I will lift your skirts over your face; I will show the nations your nakedness and the kingdoms your shame.\"",
      "links": "<a href='/AIV/23/47/3'>Isa. 47:3</a>; <a href='/AIV/34/2/13'>Nah. 2:13</a>",
      "comment": "Exposing nakedness signifies total humiliation (Isa. 20:4). The Lord's direct opposition signals decisive judgment. This is reminiscent of God's zeal for righteousness and justice."
    },
    {
      "pk": 41003006,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 6,
      "text": "I will throw filth on you, treat you with contempt, and make you a spectacle.",
      "links": "<a href='/AIV/17/6/12'>Esther 6:12</a>; <a href='/AIV/36/3/6'>Zeph. 3:6</a>",
      "comment": "To 'make you a spectacle' recalls public shaming. This prefigures the idea of the consequences of sin becoming visible to all (cf. 2 Cor. 2:14)."
    },
    {
      "pk": 41003007,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 7,
      "text": "All who see you will flee from you and say, 'Nineveh is devastated. Who will mourn for her?' Where can I find anyone to comfort you?",
      "links": "<a href='/AIV/24/16/5'>Jer. 16:5</a>; <a href='/AIV/23/51/19'>Isa. 51:19</a>",
      "comment": "Nineveh will be abandoned, echoing how only true communion with God’s people brings comfort in times of distress (cf. 2 Cor. 1:3–4)."
    },
    {
      "pk": 41003008,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 8,
      "text": "Are you better than No-Amon, which was situated among the rivers, surrounded by waters, with the river as her rampart, whose wall was the water?",
      "links": "<a href='/AIV/24/46/25'>Jer. 46:25</a>; <a href='/AIV/26/30/14-16'>Ezek. 30:14–16</a>",
      "comment": "No-Amon (Thebes in Egypt) was thought impregnable, yet it fell. This serves as a reminder that earthly defenses cannot stand against God’s judgment."
    },
    {
      "pk": 41003009,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 9,
      "text": "Cush and Egypt were her strength—without limit; Put and the Libyans were her allies.",
      "links": "<a href='/AIV/23/20/3-5'>Isa. 20:3–5</a>; <a href='/AIV/26/30/5'>Ezek. 30:5</a>",
      "comment": "No human alliance was enough for Thebes when God’s hand moved. Spiritual safety is only found in reliance upon God, not worldly alliances."
    },
    {
      "pk": 41003010,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 10,
      "text": "Yet she was exiled, she went into captivity; her infants were dashed to pieces at every street corner. Lots were cast for her nobles, and all her great ones were bound in chains.",
      "links": "<a href='/AIV/19/137/9'>Ps. 137:9</a>; <a href='/AIV/24/51/20'>Jer. 51:20</a>",
      "comment": "This echoes horrifying scenes of other judged cities (cf. Ps. 137:9). The seriousness of divine justice calls for ongoing repentance and humility."
    },
    {
      "pk": 41003011,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 11,
      "text": "You too will become drunk; you will go into hiding and seek refuge from the enemy.",
      "links": "<a href='/AIV/23/19/14'>Isa. 19:14</a>; <a href='/AIV/24/25/27'>Jer. 25:27</a>",
      "comment": "Drunkenness often symbolizes confusion and helplessness in the face of God’s judgment. Hiddenness contrasts with God’s call to light and truth."
    },
    {
      "pk": 41003012,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 12,
      "text": "All your fortresses are like fig trees with the first ripe figs; when shaken, they fall into the mouth of the eater.",
      "links": "<a href='/AIV/24/24/2'>Jer. 24:2</a>",
      "comment": "Trust in worldly strength is fleeting (cf. Mk. 11:13; Jesus curses the fig tree as a symbol of fruitless religion). Christ fulfills the promise of ultimate security for God's people."
    },
    {
      "pk": 41003013,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 13,
      "text": "Look at your troops—they are all women! The gates of your land are wide open to your enemies; fire devours the bars of your gates.",
      "links": "<a href='/AIV/23/1/31'>Isa. 1:31</a>",
      "comment": "This is an ancient way of describing utter weakness and vulnerability. The only sure refuge is the strength that comes from remaining in God’s order and design."
    },
    {
      "pk": 41003014,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 14,
      "text": "Draw water for the siege! Strengthen your defenses! Work with clay, tread the mortar; repair the brickwork!",
      "links": "<a href='/AIV/23/22/10'>Isa. 22:10</a>; <a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "Efforts to resist judgment are ultimately in vain without repentance. Outward works only profit when they flow from true conversion of heart."
    },
    {
      "pk": 41003015,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 15,
      "text": "There the fire will consume you; the sword will cut you down. It will devour you like locusts. Multiply like grasshoppers, multiply like locusts!",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>; <a href='/AIV/07/6/5'>Judg. 6:5</a>",
      "comment": "Fire and sword echo broader biblical images of destruction (e.g., Sodom, Gen. 19:24). The call to repentance should stir us to deeper conversion and dependence on Christ alone."
    },
    {
      "pk": 41003016,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 16,
      "text": "You have increased your merchants more than the stars of the heavens—yet the locusts strip all and fly away.",
      "links": "<a href='/AIV/01/15/5'>Gen. 15:5</a>; <a href='/AIV/20/23/5'>Prov. 23:5</a>",
      "comment": "Worldly prosperity cannot ultimately protect from God’s justice. The spiritual lesson is to seek treasures that last (see Matt. 6:19–20)."
    },
    {
      "pk": 41003017,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 17,
      "text": "Your guards are like locusts, your officials like swarms of grasshoppers settling on the walls on a cold day—when the sun rises, they fly away, and no one knows where they have gone.",
      "links": "<a href='/AIV/29/2/25'>Joel 2:25</a>",
      "comment": "All human defenses will vanish in the face of divine visitation. This is why Scripture continually calls the faithful to seek their rest in God's presence, ultimately fulfilled in Christ."
    },
    {
      "pk": 41003018,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 18,
      "text": "King of Assyria, your shepherds slumber; your nobles rest. Your people are scattered on the mountains with no one to gather them.",
      "links": "<a href='/AIV/11/22/17'>1 Kgs. 22:17</a>; <a href='/AIV/26/34/5'>Ezek. 34:5</a>",
      "comment": "False shepherds lead to scattering (cf. Jn. 10:12). Christ, the Good Shepherd, gathers the flock into one fold, echoing the theme of unity and visible leadership among God’s people."
    },
    {
      "pk": 41003019,
      "translation": "AIV",
      "book": 41,
      "bookName": "Nahum",
      "bookAbbreviation": "Nah",
      "chapter": 3,
      "verse": 19,
      "text": "There is no healing for your wound; your injury is fatal. All who hear the news about you will clap their hands over you, for upon whom has not your wickedness passed continually?",
      "links": "<a href='/AIV/24/51/64'>Jer. 51:64</a>; <a href='/AIV/23/14/7'>Isa. 14:7</a>",
      "comment": "The doom of Nineveh stands as a sobering reminder of the wages of persistent sin. But God's justice is ultimately united with mercy for all who repent and seek Him in truth and order."
    }
  ],
  "translatedAt": "2025-12-24T09:50:44.713Z"
}