{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 2,
  "verses": [
    {
      "pk": 45002001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 1,
      "text": "I lifted my eyes and saw, and behold, a man with a measuring line in his hand.",
      "links": "<a href='/AIV/26/40/3'>Ezek. 40:3</a>; <a href='/AIV/66/11/1'>Rev. 11:1</a>",
      "comment": "The vision of the man with a measuring line recalls Ezekiel’s vision, symbolizing divine assessment and preparation of Jerusalem for restoration. Measuring implies intention to build, prefiguring the New Jerusalem (Rev. 21:15), and subtly hints at God’s ongoing authority over the spiritual temple."
    },
    {
      "pk": 45002002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 2,
      "text": "Then I asked, 'Where are you going?' And he said to me, 'To measure Jerusalem, to see what is its width and what is its length.'",
      "links": "<a href='/AIV/26/48/16'>Ezek. 48:16</a>; <a href='/AIV/66/21/16'>Rev. 21:16</a>",
      "comment": "Measuring Jerusalem anticipates its expansion and protection, and spiritually points forward to the establishment of the Church as the dwelling place of God among His people. Note connections to Revelation where the city has heavenly dimensions."
    },
    {
      "pk": 45002003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 3,
      "text": "Then, behold, the angel who spoke with me went out, and another angel went out to meet him.",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>; <a href='/AIV/38/1/19'>Zech. 1:19</a>",
      "comment": "Two angels are involved in this vision, suggesting heavenly cooperation. Throughout Scripture, angels often serve as messengers and mediators of God’s will, foreshadowing the ongoing ministry of heavenly beings in guiding God's people."
    },
    {
      "pk": 45002004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 4,
      "text": "And he said to him, 'Run, speak to that young man, saying, Jerusalem will be inhabited as villages without walls, because of the multitude of people and livestock within it.'",
      "links": "<a href='/AIV/19/147/13'>Ps. 147:13-14</a>; <a href='/AIV/26/38/11'>Ezek. 38:11</a>",
      "comment": "Jerusalem’s expansion beyond physical walls points to its spiritual destiny: a city open to all nations, echoing God's universal call. The lack of walls signals security provided directly by God rather than by human means."
    },
    {
      "pk": 45002005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 5,
      "text": "For I will be a wall of fire around her,' declares the LORD, 'and I will be the glory in her midst.'",
      "links": "<a href='/AIV/02/13/21'>Exod. 13:21</a>; <a href='/AIV/19/46/5'>Ps. 46:5</a>; <a href='/AIV/66/21/23'>Rev. 21:23</a>",
      "comment": "God Himself promises protection and indwelling glory, reminiscent of the pillar of fire in Exodus. This foreshadows God’s abiding presence in the Church and images of the glory of God dwelling among His people in the New Covenant."
    },
    {
      "pk": 45002006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 6,
      "text": "'Up! Up! Flee from the land of the north,' declares the LORD. 'For I have scattered you like the four winds of heaven,' declares the LORD.",
      "links": "<a href='/AIV/01/28/14'>Gen. 28:14</a>; <a href='/AIV/24/3/18'>Jer. 3:18</a>",
      "comment": "The call to leave Babylon and return home anticipates the spiritual gathering of God’s people from every direction. The scattering and regathering imply both literal return and the ultimate unity under one divine shepherd."
    },
    {
      "pk": 45002007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 7,
      "text": "Deliver yourself, O Zion, you who dwell with the daughter of Babylon.",
      "links": "<a href='/AIV/19/137/1'>Ps. 137:1</a>; <a href='/AIV/23/48/20'>Isa. 48:20</a>",
      "comment": "This verse directly urges the people to abandon spiritual compromise and return fully to God. It mirrors the ongoing step of leaving behind worldly captivity to dwell in the holiness of God’s promise."
    },
    {
      "pk": 45002008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 8,
      "text": "For this is what the LORD of hosts says: 'After the glory sent me to the nations which plundered you—for he who touches you touches the apple of his eye—'",
      "links": "<a href='/AIV/05/32/10'>Deut. 32:10</a>; <a href='/AIV/19/17/8'>Ps. 17:8</a>",
      "comment": "The phrase 'apple of his eye' shows God’s tender, personal care for His people. The sending 'after glory' hints at the sending of the Messiah ‘after’ the glory is revealed—suggesting a deeper fulfillment in the mission of Christ."
    },
    {
      "pk": 45002009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 9,
      "text": "'I will surely raise my hand against them, and they shall become plunder for their servants. Then you will know that the LORD of hosts has sent me.'",
      "links": "<a href='/AIV/02/7/5'>Exod. 7:5</a>; <a href='/AIV/38/4/9'>Zech. 4:9</a>",
      "comment": "Divine vindication is promised. The repeated reference to ‘sent me’ anticipates later messianic texts—hinting at the concept of being sent by God, as we see in John 17:21 where Christ is also sent."
    },
    {
      "pk": 45002010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 10,
      "text": "'Sing and rejoice, O daughter of Zion! For behold, I am coming, and I will dwell in your midst,' declares the LORD.",
      "links": "<a href='/AIV/01/49/10'>Gen. 49:10</a>; <a href='/AIV/40/1/23'>Matt. 1:23</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "God’s promise to 'dwell in your midst' directly points to the incarnation of Christ (Matt. 1:23; John 1:14), and ultimately to God’s indwelling presence with His people throughout history. This prefigures Emmanuel—'God with us.'"
    },
    {
      "pk": 45002011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 11,
      "text": "'And many nations shall join themselves to the LORD in that day, and shall be my people. And I will dwell in your midst, and you shall know that the LORD of hosts has sent me to you.'",
      "links": "<a href='/AIV/23/2/2-3'>Isa. 2:2-3</a>; <a href='/AIV/60/2/10'>1 Pet. 2:10</a>; <a href='/AIV/66/21/24'>Rev. 21:24</a>",
      "comment": "The joining of many nations is fulfilled in the Gentile inclusion into God’s people (Eph. 2:19). The recurrent promise of Christ’s indwelling presence in the community subtly points toward the visible Church as the family of God for all nations."
    },
    {
      "pk": 45002012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 12,
      "text": "And the LORD will inherit Judah as his portion in the holy land, and will once again choose Jerusalem.",
      "links": "<a href='/AIV/05/32/9'>Deut. 32:9</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>; <a href='/AIV/54/3/15'>1 Tim. 3:15</a>",
      "comment": "God’s renewed choice of Jerusalem points both to the physical city and the spiritual reality of the Church as His dwelling. The inheritance motif implies lasting possession, connecting to themes of election and visible representation of God’s kingdom."
    },
    {
      "pk": 45002013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 2,
      "verse": 13,
      "text": "Be silent, all flesh, before the LORD, for he has roused himself from his holy dwelling.",
      "links": "<a href='/AIV/19/76/8'>Ps. 76:8</a>; <a href='/AIV/35/2/20'>Hab. 2:20</a>",
      "comment": "The final call to silence is an invitation to reverent worship before God’s manifest presence. God’s action from His 'holy dwelling' foreshadows the dramatic intervention of God in history and the seriousness with which we must seek His presence. The verse invites contemplative prayer and awe before the mystery of God’s nearness."
    }
  ],
  "translatedAt": "2025-12-24T09:55:11.974Z"
}