{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 6,
  "verses": [
    {
      "pk": 45006001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 1,
      "text": "Again I looked up and saw four chariots coming out from between two mountains, and the mountains were of bronze.",
      "links": "<a href='/AIV/38/1/8'>Zech. 1:8</a>; <a href='/AIV/27/2/32-45'>Dan. 2:32-45</a>",
      "comment": "The mountains of bronze symbolize stability and strength—possibly the unshakeable purposes of God. The connection to Zechariah 1:8 shows a continuation of the vision motif. The chariots often signify divine judgment going out over the earth."
    },
    {
      "pk": 45006002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 2,
      "text": "The first chariot had red horses, the second chariot black horses,",
      "links": "<a href='/AIV/38/1/8'>Zech. 1:8</a>; <a href='/AIV/66/6/4-5'>Rev. 6:4-5</a>",
      "comment": "Much like the four horsemen in Revelation 6, these horses represent different aspects of God's sovereignty and judgment. The symbolism builds on earlier prophetic imagery."
    },
    {
      "pk": 45006003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 3,
      "text": "the third chariot white horses, and the fourth chariot dappled horses—all strong.",
      "links": "<a href='/AIV/66/6/2-8'>Rev. 6:2-8</a>",
      "comment": "Each color has theological meaning: red (war), black (famine or mourning), white (victory or purity), dappled (mixed judgments). The strength suggests the complete authority of these divine agents."
    },
    {
      "pk": 45006004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 4,
      "text": "Then I answered and said to the angel who talked with me, 'What are these, my lord?'",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>",
      "comment": "Zechariah asks the interpreting angel for clarity, a pattern seen throughout prophetic visions. This openness helps the reader understand deeper mysteries slowly."
    },
    {
      "pk": 45006005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 5,
      "text": "The angel answered and said to me, 'These are the four spirits of heaven, going out from standing before the Lord of all the earth.'",
      "links": "<a href='/AIV/38/4/14'>Zech. 4:14</a>; <a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "The use of 'spirits' (literally 'winds' or 'ruachs') sent from God references Psalm 104:4, connecting the chariots to divine agents or angelic beings. Their mission is universal, reflecting God's governance over all nations."
    },
    {
      "pk": 45006006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 6,
      "text": "The chariot with the black horses goes toward the north country, the white go after them, and the dappled go toward the south country.",
      "links": "<a href='/AIV/24/1/13-14'>Jer. 1:13-14</a>; <a href='/AIV/38/2/6'>Zech. 2:6</a>",
      "comment": "Historically, invasions into Israel came from the north; the 'north country' often represented Israel’s enemies. The movements of the chariots symbolize God’s judgment extending over all lands."
    },
    {
      "pk": 45006007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 7,
      "text": "When the strong horses went out, they were eager to go and patrol the earth. And he said, 'Go! Patrol the earth.' So they patrolled the earth.",
      "links": "<a href='/AIV/38/1/10-11'>Zech. 1:10-11</a>",
      "comment": "The command echoes Zechariah 1, where horses patrol the earth to report God's judgment and peace. It demonstrates complete obedience to God's will."
    },
    {
      "pk": 45006008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 8,
      "text": "Then he called to me, 'Look, those who go toward the north country have given my Spirit rest in the north country.'",
      "links": "<a href='/AIV/38/1/15'>Zech. 1:15</a>",
      "comment": "God’s ‘Spirit’ finding rest conveys that His righteous judgment has been satisfied for a time. The imagery suggests a providence overarching geographic and political realities."
    },
    {
      "pk": 45006009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 9,
      "text": "The word of the Lord came to me, saying,",
      "links": "<a href='/AIV/38/4/8'>Zech. 4:8</a>",
      "comment": "A new prophetic message signals a significant shift—from vision to direct instruction."
    },
    {
      "pk": 45006010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 10,
      "text": "'Take from the exiles Heldai, Tobijah, and Jedaiah, who have arrived from Babylon, and go the same day to the house of Josiah, the son of Zephaniah.'",
      "links": "<a href='/AIV/15/2/1-2'>Ezra 2:1-2</a>",
      "comment": "Returning exiles represent the restoration of the nation and foreshadow a renewed unity of God’s people."
    },
    {
      "pk": 45006011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 11,
      "text": "'Take silver and gold, and make a crown, and set it on the head of Joshua the son of Jehozadak, the high priest.'",
      "links": "<a href='/AIV/38/3/1'>Zech. 3:1</a>; <a href='/AIV/02/28/2'>Ex. 28:2</a>",
      "comment": "Here the high priest is crowned, which is unusual—normally only kings are crowned. This merging of priestly and royal roles foreshadows the coming Messiah, who will be both King and Priest (cf. Psalm 110:4; Hebrews 7:1-3). This combines spiritual and temporal authority in one person."
    },
    {
      "pk": 45006012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 12,
      "text": "And say to him, 'Thus says the Lord of hosts: Behold, the man whose name is the Branch; from his place he will branch out, and he will build the temple of the Lord.'",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/38/3/8'>Zech. 3:8</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "The ‘Branch’ is a messianic title (cf. Isaiah 11:1), pointing to someone who will extend God’s presence and build a true temple—not just of stone but of God’s people. This foreshadows Christ, who unites kingly and priestly roles and builds the spiritual temple, the Church."
    },
    {
      "pk": 45006013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 13,
      "text": "Yes, it is he who will build the temple of the Lord, and he will bear the royal honor, and will sit and rule on his throne. And there will be a priest on his throne, and peaceful counsel will be between the two of them.'",
      "links": "<a href='/AIV/19/110/1-4'>Ps. 110:1-4</a>; <a href='/AIV/58/7/1-28'>Heb. 7:1-28</a>",
      "comment": "The uniting of royal and priestly authority in one person signifies the fullness of God’s plan. The Messiah’s temple (the Church) is led both by authority and by priestly intercession, guiding God’s people in truth and peace."
    },
    {
      "pk": 45006014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 14,
      "text": "And the crown will be kept in the temple of the Lord as a memorial to Helem, Tobijah, Jedaiah, and Hen the son of Zephaniah.",
      "links": "<a href='/AIV/02/28/36-38'>Ex. 28:36-38</a>",
      "comment": "The memorializing of the crown points to ongoing remembrance and the lasting role of leaders within the temple—signs of an enduring spiritual institution."
    },
    {
      "pk": 45006015,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 6,
      "verse": 15,
      "text": "Those who are far away will come and help to build the temple of the Lord. And you will know that the Lord of hosts has sent me to you. And this will happen if you diligently obey the voice of the Lord your God.",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6-7</a>; <a href='/AIV/45/1/5-6'>Rom. 1:5-6</a>",
      "comment": "The involvement of outsiders foreshadows the ingathering of the nations into the true worship of God. Full realization of these blessings depends on obedience, showing the need for perseverance in faith and practice."
    }
  ],
  "translatedAt": "2025-12-24T09:56:29.903Z"
}