{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 11,
  "verses": [
    {
      "pk": 45011001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 1,
      "text": "Open your doors, O Lebanon, that fire may consume your cedars.",
      "links": "<a href='/AIV/23/10/34'>Isa. 10:34</a>; <a href='/AIV/26/19/12'>Ezek. 19:12</a>",
      "comment": "Lebanon symbolizes the rulers, and the cedar trees are often interpreted as symbols of glory or pride being judged (see Isa. 2:13). This prepares for the prophetic warning of destruction."
    },
    {
      "pk": 45011002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 2,
      "text": "Wail, O cypress, for the cedar has fallen—because the glorious trees are ruined! Wail, oaks of Bashan, for the dense forest has come down!",
      "links": "<a href='/AIV/23/2/13'>Isa. 2:13</a>; <a href='/AIV/26/27/6'>Ezek. 27:6</a>",
      "comment": "The fall of the cedar and cypress stands for the judgment that comes even upon the mighty and powerful. Bashan’s oaks represent strength in worldly kingdoms, now toppled."
    },
    {
      "pk": 45011003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 3,
      "text": "Listen! The shepherds wail, for their glory is ruined. Listen! The lions’ roar, for the thicket of the Jordan is destroyed.",
      "links": "<a href='/AIV/24/12/5'>Jer. 12:5</a>; <a href='/AIV/24/25/36'>Jer. 25:36</a>",
      "comment": "The shepherds here probably refer to leaders and kings; their despair reflects Israel’s coming judgment. The roaring lions emphasize the loss hitting even the strongest (compare Jer. 25:36)."
    },
    {
      "pk": 45011004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 4,
      "text": "Thus says the LORD my God: ‘Shepherd the flock doomed for slaughter.’",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/40/15/24'>Matt. 15:24</a>",
      "comment": "God commands the prophet to shepherd the doomed flock—a prophetic image often understood as Israel itself, primed for judgment. Jesus later refers to Himself as the Good Shepherd tasked with the lost sheep of Israel (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 45011005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 5,
      "text": "Those who buy them slaughter them and are not held guilty; those who sell them say, 'Blessed be the LORD, I have become rich,' and their own shepherds do not spare them.",
      "links": "<a href='/AIV/24/50/7'>Jer. 50:7</a>; <a href='/AIV/40/21/13'>Matt. 21:13</a>",
      "comment": "This indictment targets rulers and leaders who unjustly exploit their people. Notice the irony: religious language covers up injustice. The spirit of this point is echoed by Jesus’ cleansing of the temple, highlighting the misuse of spiritual authority."
    },
    {
      "pk": 45011006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 6,
      "text": "For I will no longer have pity on the inhabitants of the land, declares the LORD. Behold, I will give every man into the hand of his neighbor and into the hand of his king; they will crush the land, and I will not deliver them from their hand.",
      "links": "<a href='/AIV/28/13/14'>Hos. 13:14</a>; <a href='/AIV/40/24/7-10'>Matt. 24:7-10</a>",
      "comment": "This verse shows God permitting consequences to come upon a rebellious people. This pattern is seen in salvation history whenever Israel rejects God’s appointed shepherds. Jesus predicts similar abandonment when Jerusalem does not recognize her visitation."
    },
    {
      "pk": 45011007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 7,
      "text": "So I became the shepherd of the flock doomed to be slaughtered by the sheep traders. And I took two staffs—one I named Favor, and the other I named Union. And I shepherded the flock.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/26/20/37'>Ezek. 20:37</a>",
      "comment": "The two staffs, Favor (often also 'Grace') and Union (or 'Bonds'), symbolize God’s blessings and His unity among the tribes of Israel. The image prefigures the authority given to true shepherds over God’s people (see <a href='/AIV/40/16/19'>Matt. 16:19</a>)."
    },
    {
      "pk": 45011008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 8,
      "text": "In one month I destroyed the three shepherds. But I became impatient with them, and they also began to loathe me.",
      "links": "<a href='/AIV/24/2/8'>Jer. 2:8</a>; <a href='/AIV/26/34/10'>Ezek. 34:10</a>",
      "comment": "Interpretations vary on who the three shepherds represent—often understood as failed leaders (priests, prophets, kings). Their rejection of the True Shepherd foreshadows later rejection of Christ, who is the final and faithful shepherd (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 45011009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 9,
      "text": "Then I said, 'I will not shepherd you. Let what is dying die. Let what is being destroyed be destroyed. And those who are left can devour the flesh of one another.'",
      "links": "<a href='/AIV/28/4/17'>Hos. 4:17</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "Withdrawing the shepherding role, God allows the flock to suffer the consequences of their rejection, hinting at periods of spiritual famine. Jesus’ lament over Jerusalem (<a href='/AIV/42/19/41-44'>Luke 19:41-44</a>) echoes this tragic outcome."
    },
    {
      "pk": 45011010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 10,
      "text": "And I took my staff Favor and broke it, annulling the covenant I had made with all the peoples.",
      "links": "<a href='/AIV/02/24/8'>Exod. 24:8</a>; <a href='/AIV/58/8/13'>Heb. 8:13</a>",
      "comment": "Breaking the staff, Favor, is a powerful image of the end of God’s special blessing or covenant. This anticipates the new, better covenant prophesied in Jeremiah and fulfilled in Christ’s work (<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>)."
    },
    {
      "pk": 45011011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 11,
      "text": "So it was annulled on that day, and the sheep traders who were watching me knew it was the word of the LORD.",
      "links": "<a href='/AIV/26/33/33'>Ezek. 33:33</a>; <a href='/AIV/58/10/9'>Heb. 10:9</a>",
      "comment": "The direct acknowledgment by the sheep traders marks the message as truly from the LORD—emphasizing prophetic authority and the seriousness of the broken covenant."
    },
    {
      "pk": 45011012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 12,
      "text": "Then I said to them, 'If it seems good to you, give me my wages; but if not, keep them.' And they weighed out as my wages thirty pieces of silver.",
      "links": "<a href='/AIV/02/21/32'>Exod. 21:32</a>; <a href='/AIV/40/26/15'>Matt. 26:15</a>",
      "comment": "Thirty pieces of silver is the price of a slave (Exod. 21:32), and this prophecy is fulfilled literally in Judas betraying Jesus for this price (<a href='/AIV/40/26/15'>Matt. 26:15</a>). The link to Christ’s betrayal is a profound instance of prophecy directly tying to the New Testament."
    },
    {
      "pk": 45011013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 13,
      "text": "Then the LORD said to me, 'Throw it to the potter'—the lordly price at which I was valued by them. So I took the thirty pieces of silver and threw them into the house of the LORD, to the potter.",
      "links": "<a href='/AIV/40/27/9-10'>Matt. 27:9-10</a>; <a href='/AIV/24/18/2'>Jer. 18:2</a>",
      "comment": "The thirty pieces of silver, thrown into the temple and used for the potter, is literally fulfilled in how Judas' blood money is used (Matt. 27:9-10). The self-reference of God as ultimately valued so little has deep implications for understanding Christ’s humble and divine mission."
    },
    {
      "pk": 45011014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 14,
      "text": "Then I broke my second staff, Union, breaking the bond between Judah and Israel.",
      "links": "<a href='/AIV/11/12/16'>1 Kings 12:16</a>; <a href='/AIV/24/3/8'>Jer. 3:8</a>",
      "comment": "This division refers to the split of God’s people (Israel and Judah), which historically began with the reign of Rehoboam (1 Kings 12:16). In the context of the new covenant, unity is restored spiritually in Christ’s one people."
    },
    {
      "pk": 45011015,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 15,
      "text": "Then the LORD said to me, 'Take again the gear of a foolish shepherd.'",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/43/10/12'>John 10:12</a>",
      "comment": "This begins the symbolic act of taking up the role of a false shepherd, representing leaders who lead the people into destruction. Jesus later contrasts Himself as the Good Shepherd as opposed to these false shepherds."
    },
    {
      "pk": 45011016,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 16,
      "text": "For behold, I am raising up in the land a shepherd who will not care for those being destroyed, nor seek the young, nor heal the injured, nor feed the healthy, but devour the flesh of the fat sheep and tear off their hooves.",
      "links": "<a href='/AIV/26/34/4'>Ezek. 34:4</a>; <a href='/AIV/43/10/13'>John 10:13</a>",
      "comment": "God warns of a future leader who abandons his responsibilities, feeding off the people. Spiritually, this is a warning about following leaders who do not act as true shepherds. Christ’s sacrificial leadership stands in direct contrast."
    },
    {
      "pk": 45011017,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 11,
      "verse": 17,
      "text": "Woe to the worthless shepherd, who abandons the flock! May the sword strike his arm and his right eye! May his arm be completely withered, and his right eye utterly blinded!",
      "links": "<a href='/AIV/26/34/10'>Ezek. 34:10</a>; <a href='/AIV/19/37/17'>Ps. 37:17</a>",
      "comment": "The prophecy ends with a curse on the false shepherd. Spiritually, this points to the importance of apostolic leadership—those truly set apart to shepherd the people, a principle that continues in the structure of the church."
    }
  ],
  "translatedAt": "2025-12-24T09:58:39.503Z"
}