{
  "book": 44,
  "bookName": "Haggai",
  "bookAbbreviation": "Hag",
  "chapter": 1,
  "verses": [
    {
      "pk": 44001001,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 1,
      "text": "In the second year of King Darius, on the first day of the sixth month, the word of the LORD came through the prophet Haggai to Zerubbabel son of Shealtiel, governor of Judah, and to Joshua son of Jehozadak, the high priest:",
      "links": "<a href='/AIV/15/1/1-2'>Ezra 1:1-2</a>; <a href='/AIV/38/3/1'>Zech. 3:1</a>",
      "comment": "This verse establishes the historical setting: after the Babylonian exile, during the rule of Darius of Persia. Haggai’s message is addressed specifically to the Davidic governor (Zerubbabel) and the high priest (Joshua), highlighting the continuing importance of both royal and priestly leadership in the community. Note the explicit mention of both civil and religious authority, showing God's concern for the unity of spiritual and temporal leadership."
    },
    {
      "pk": 44001002,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 2,
      "text": "The LORD of Hosts says this: These people say, 'The time has not yet come to rebuild the house of the LORD.'",
      "links": "<a href='/AIV/15/4/23-24'>Ezra 4:23-24</a>",
      "comment": "God addresses the people's reluctance to rebuild the Temple. The phrase 'house of the LORD' refers to the central place of worship for Israel. Neglecting its reconstruction reveals a lack of proper spiritual priorities—something spiritually dangerous for any faith community."
    },
    {
      "pk": 44001003,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 3,
      "text": "Then the word of the LORD came by Haggai the prophet:",
      "links": "<a href='/AIV/38/8/1'>Zech. 8:1</a>",
      "comment": "The prophet acts as a mediator of God’s word, reaffirming the ongoing need for prophetic leadership in guiding the people. It subtly points to the importance of tradition and teaching authority in rightly discerning God's will."
    },
    {
      "pk": 44001004,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 4,
      "text": "\"Is it a time for you yourselves to dwell in your paneled houses, while this house lies in ruins?\"",
      "links": "<a href='/AIV/10/7/2'>2 Sam. 7:2</a>",
      "comment": "Haggai rebukes the people for prioritizing their own comfort over God’s house. The contrast between their 'paneled houses' and the ruined Temple highlights the call to put God’s worship first. This is a reminder that material cares should not overshadow the worship and reverence owed to God alone."
    },
    {
      "pk": 44001005,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 5,
      "text": "So now, the LORD of Hosts says this: Set your heart on your ways.",
      "links": "<a href='/AIV/24/7/3'>Jer. 7:3</a>",
      "comment": "A call to self-examination and repentance. 'Set your heart on your ways' is a Hebrew idiom meaning to carefully consider your life. It implies that spiritual prosperity is tied to obedience and the right ordering of one’s priorities."
    },
    {
      "pk": 44001006,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 6,
      "text": "You have sown much, but harvested little. You eat, but you are not satisfied; you drink, but you are not filled; you clothe yourselves, but no one is warm. And the one who earns wages puts them into a bag with holes.\"",
      "links": "<a href='/AIV/05/28/38-40'>Deut. 28:38-40</a>; <a href='/AIV/28/4/10'>Hos. 4:10</a>",
      "comment": "The people's physical needs are not being met despite their efforts, a sign of divine discipline (see Deut. 28:38-40). This verse reminds us that blessings and true fulfillment come from putting God first. There is a spiritual law at work: neglecting what belongs to God ultimately leads to loss."
    },
    {
      "pk": 44001007,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 7,
      "text": "Thus says the LORD of Hosts: Set your heart on your ways.",
      "links": "<a href='/AIV/44/1/5'>Hag. 1:5</a>; <a href='/AIV/24/7/3'>Jer. 7:3</a>",
      "comment": "God repeats the call for self-examination, emphasizing the need for interior conversion. This insistence foreshadows the need for continual self-examination and repentance, essential themes within Christian spirituality."
    },
    {
      "pk": 44001008,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 8,
      "text": "\"Go up into the hills, bring wood, and build the house, that I may take pleasure in it and be glorified,\" says the LORD.",
      "links": "<a href='/AIV/11/6/7'>1 Kgs. 6:7</a>; <a href='/AIV/19/50/23'>Ps. 50:23</a>",
      "comment": "God commands practical action—gathering materials to rebuild the Temple. Obedience to this call gives glory to God. Worship is not merely inner feeling, but requires concrete acts of sacrifice, foreshadowing the later Christian emphasis on both faith and works (cf. Jas. 2:14-26)."
    },
    {
      "pk": 44001009,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 9,
      "text": "\"You looked for much, but see, it came to little. And when you brought it home, I blew it away. Why?\" declares the LORD of Hosts. \"Because my house lies in ruins, while each of you busies himself with his own house.\"",
      "links": "<a href='/AIV/24/5/25'>Jer. 5:25</a>; <a href='/AIV/05/28/23-24'>Deut. 28:23-24</a>",
      "comment": "Selfish neglect leads to divine frustration of human efforts. The Temple’s ruined state brings negative consequences for all. This verse underlines the concept that blessings flow from faithful worship and right order in community life."
    },
    {
      "pk": 44001010,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 10,
      "text": "Therefore, because of you the heavens have withheld their dew, and the earth has withheld its crops.",
      "links": "<a href='/AIV/03/26/19-20'>Lev. 26:19-20</a>; <a href='/AIV/11/17/1'>1 Kgs. 17:1</a>",
      "comment": "The disruption of nature reflects God’s judgment. This recalls the covenant curses from Leviticus 26, demonstrating the deep link between faithfulness to God and the flourishing of creation itself."
    },
    {
      "pk": 44001011,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 11,
      "text": "\"I called for a drought on the land and the hills, on the grain, the new wine, the oil, on what the ground produces, on men and calves, and on all the labor of your hands.\"",
      "links": "<a href='/AIV/29/1/10-12'>Joel 1:10-12</a>; <a href='/AIV/30/4/7-9'>Amos 4:7-9</a>",
      "comment": "All of creation is impacted by the people's spiritual state. This connection between material reality and spiritual fidelity points to the incarnational principle: what happens spiritually affects the material world, prefiguring the unity of body and soul in Christian teaching."
    },
    {
      "pk": 44001012,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 12,
      "text": "Then Zerubbabel son of Shealtiel, Joshua son of Jehozadak, the high priest, and all the remnant of the people obeyed the voice of the LORD their God and the words of Haggai the prophet, as the LORD their God had sent him. And the people feared the LORD.",
      "links": "<a href='/AIV/44/1/1'>Hag. 1:1</a>; <a href='/AIV/15/3/8'>Ezra 3:8</a>",
      "comment": "The leaders and people respond in obedience and reverence ('feared the LORD'), showing the importance of unified response to God's word mediated through chosen leadership. This harmony between civil authority, priesthood, and people is an ideal structure for the community of God."
    },
    {
      "pk": 44001013,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 13,
      "text": "Then Haggai, the messenger of the LORD, delivered the LORD’s message to the people: \"I am with you,\" declares the LORD.",
      "links": "<a href='/AIV/02/3/12'>Ex. 3:12</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God promises His presence among them as a result of their response. This assurance of God's presence among His people looks forward to Christ's promise to be with His Church always (Matt. 28:20), indicating a continuing and tangible presence through the ages."
    },
    {
      "pk": 44001014,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 14,
      "text": "So the LORD stirred up the spirit of Zerubbabel son of Shealtiel, governor of Judah, and the spirit of Joshua son of Jehozadak, the high priest, and the spirit of all the remnant of the people. They came and worked on the house of the LORD of Hosts, their God,",
      "links": "<a href='/AIV/15/1/5'>Ezra 1:5</a>",
      "comment": "God is the initiator, stirring up the hearts of both leaders and laity. The whole community, under divinely appointed leadership, works together for the restoration of God’s house. This cooperation among all members of the people of God reflects a model of the Church as both hierarchical and communal."
    },
    {
      "pk": 44001015,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 1,
      "verse": 15,
      "text": "on the twenty-fourth day of the sixth month, in the second year of King Darius.",
      "links": "<a href='/AIV/44/1/1'>Hag. 1:1</a>",
      "comment": "The specific date marks when the community responded in faith. Biblical history is grounded in specific times and places, demonstrating God's faithfulness in the unfolding of salvation history."
    }
  ],
  "translatedAt": "2025-12-24T09:53:57.757Z"
}