{
  "book": 69,
  "bookName": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 3,
  "verses": [
    {
      "pk": 69003001,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 1,
      "text": "See what kind of love the Father has given to us, that we should be called children of God—and that is what we are! The reason the world does not know us is that it did not know Him.",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/45/8/14-16'>Rom. 8:14-16</a>",
      "comment": "John emphasizes God's fatherly love that adopts us as His children. This adoption comes through grace. The world's ignorance points to spiritual blindness. Spiritual adoption implies an intimate relationship mediated by God's action. See also Rom. 8:14-16 for the Spirit's role in this adoption."
    },
    {
      "pk": 69003002,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 2,
      "text": "Beloved, now we are children of God, and what we will be has not yet been revealed. But we know that when He appears, we will be like Him, because we shall see Him as He is.",
      "links": "<a href='/AIV/50/3/21'>Phil. 3:21</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "John looks forward to the full revelation of our glorified state at Christ’s return. The transformation to be 'like Him' refers to our ultimate sanctification and participation in God's own life (cf. 2 Pet. 1:4). The promise of seeing Christ 'as He is' alludes to the 'beatific vision'—the direct vision of God, a hope for all Christians."
    },
    {
      "pk": 69003003,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 3,
      "text": "Everyone who has this hope in Him purifies himself, just as He is pure.",
      "links": "<a href='/AIV/58/12/14'>Heb. 12:14</a>; <a href='/AIV/40/5/48'>Matt. 5:48</a>",
      "comment": "The call to purity is rooted in our hope for holiness and union with God. Sanctification is a process involving cooperation with grace, striving for holiness in daily life."
    },
    {
      "pk": 69003004,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 4,
      "text": "Everyone who commits sin practices lawlessness; sin is lawlessness.",
      "links": "<a href='/AIV/45/6/19'>Rom. 6:19</a>",
      "comment": "Sin is described as rebellion against God's order. This helps clarify that sin is not just a mistake but a serious rupture of relationship with God. See also Rom. 6:19 for the language of slavery to sin."
    },
    {
      "pk": 69003005,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 5,
      "text": "You know that He appeared to take away sins, and in Him there is no sin.",
      "links": "<a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/58/4/15'>Heb. 4:15</a>",
      "comment": "Christ came specifically to deal with the problem of sin. His sinlessness is essential for His role as redeemer and sacrifice, connecting to Old Testament imagery of the spotless Lamb (Ex. 12:5; John 1:29)."
    },
    {
      "pk": 69003006,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 6,
      "text": "No one who remains in Him keeps on sinning; no one who keeps on sinning has seen Him or known Him.",
      "links": "<a href='/AIV/43/15/4'>John 15:4</a>; <a href='/AIV/40/7/23'>Matt. 7:23</a>",
      "comment": "To 'remain in Him' involves real, ongoing union with Christ, meaning that habitual sin is incompatible with true knowledge of Christ. This points to the seriousness of ongoing sanctification and confession."
    },
    {
      "pk": 69003007,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 7,
      "text": "Children, let no one deceive you. Whoever practices righteousness is righteous, just as He is righteous.",
      "links": "<a href='/AIV/40/7/16-20'>Matt. 7:16-20</a>",
      "comment": "Righteousness is not just declared but lived out. The necessity of living righteously echoes Jesus' teaching about knowing people by their fruits (Matthew 7:16-20)."
    },
    {
      "pk": 69003008,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 8,
      "text": "Whoever makes a practice of sinning is of the devil, for the devil has been sinning from the beginning. The Son of God appeared for this reason: to destroy the works of the devil.",
      "links": "<a href='/AIV/01/3/1-6'>Gen. 3:1-6</a>; <a href='/AIV/43/8/44'>John 8:44</a>",
      "comment": "Committing sin aligns one with the devil’s rebellion. Christ's mission is described as conquering the devil's works, connecting to the promise of Gen. 3:15 about the serpent’s defeat."
    },
    {
      "pk": 69003009,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 9,
      "text": "No one born of God makes a practice of sinning, because God’s seed remains in him; he cannot keep on sinning, because he has been born of God.",
      "links": "<a href='/AIV/43/3/3-6'>John 3:3-6</a>",
      "comment": "Being 'born of God' indicates a profound transformation. 'God’s seed' might refer to the Holy Spirit or the Word (cf. 1 Pet. 1:23). This new birth empowers resistance to habitual sin."
    },
    {
      "pk": 69003010,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 10,
      "text": "By this it is clear who are children of God, and who are children of the devil: whoever does not practice righteousness is not of God, nor is the one who does not love his brother.",
      "links": "<a href='/AIV/40/5/22-24'>Matt. 5:22-24</a>",
      "comment": "John summarizes the evidence of new spiritual birth: righteousness and love. Love for one's brother is set as a non-negotiable sign of true faith."
    },
    {
      "pk": 69003011,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 11,
      "text": "For this is the message you have heard from the beginning: that we should love one another.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>;<a href='/AIV/03/19/18'>Lev. 19:18</a>",
      "comment": "Love is emphasized as a foundational command. This echoes Jesus' new commandment in John 13:34 but also roots it in the long tradition of God's revelation (Lev. 19:18)."
    },
    {
      "pk": 69003012,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 12,
      "text": "We must not be like Cain, who was of the evil one and murdered his brother. And why did he murder him? Because his own deeds were evil and his brother’s were righteous.",
      "links": "<a href='/AIV/01/4/8'>Gen. 4:8</a>",
      "comment": "Cain’s story warns against envy and hatred among believers. Righteous actions provoke the envy of those who do evil."
    },
    {
      "pk": 69003013,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 13,
      "text": "Do not be surprised, brothers, that the world hates you.",
      "links": "<a href='/AIV/43/15/18-19'>John 15:18-19</a>",
      "comment": "Hostility from the world is expected for those who follow Christ, reflecting His teaching to His disciples."
    },
    {
      "pk": 69003014,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 14,
      "text": "We know that we have passed from death into life, because we love the brothers. Whoever does not love remains in death.",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>",
      "comment": "Love is again shown as the distinguishing mark of spiritual life, with echoes of Jesus’ teaching on passing from death to life by hearing and believing the word (John 5:24)."
    },
    {
      "pk": 69003015,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 15,
      "text": "Everyone who hates his brother is a murderer, and you know that no murderer has eternal life remaining in him.",
      "links": "<a href='/AIV/40/5/21-22'>Matt. 5:21-22</a>",
      "comment": "Hatred in the heart is equated to murder, reflecting Jesus' expansion of the law in the Sermon on the Mount."
    },
    {
      "pk": 69003016,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 16,
      "text": "By this we know love: that He laid down His life for us, and we ought to lay down our lives for the brothers.",
      "links": "<a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Imitating Christ's sacrificial love is the ultimate standard for believers. Christ’s voluntary sacrifice is the model for self-giving."
    },
    {
      "pk": 69003017,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 17,
      "text": "But if anyone has the world’s goods and sees his brother in need, yet closes his heart against him, how does the love of God remain in him?",
      "links": "<a href='/AIV/59/2/15-17'>James 2:15-17</a>",
      "comment": "Practical charity is a test of genuine love. Acts of mercy are necessary expressions of faith (cf. James 2:15-17)."
    },
    {
      "pk": 69003018,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 18,
      "text": "Little children, let us not love in word or speech only, but in action and in truth.",
      "links": "<a href='/AIV/59/2/18'>James 2:18</a>",
      "comment": "John exhorts believers to authentic love—love backed by works as well as words, highlighting the necessity for faith that works through love."
    },
    {
      "pk": 69003019,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 19,
      "text": "By this we shall know that we are of the truth and assure our heart before Him;",
      "links": "<a href='/AIV/43/18/37'>John 18:37</a>",
      "comment": "A life of truth and genuine love gives us confidence before God. Assurance comes through our lived conformity to Christ, rather than just mental assent."
    },
    {
      "pk": 69003020,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 20,
      "text": "for if our heart condemns us, God is greater than our heart, and He knows everything.",
      "links": "<a href='/AIV/19/139/1-2'>Ps. 139:1-2</a>",
      "comment": "God's knowledge of us is absolute. Even when our conscience is troubled, God’s mercy and understanding surpass our self-condemnation. This points to the need for confidently seeking forgiveness."
    },
    {
      "pk": 69003021,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 21,
      "text": "Beloved, if our heart does not condemn us, we have confidence before God;",
      "links": "<a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "A clear conscience brings boldness in approaching God, reminiscent of the confidence described in Hebrews 10:22. Such assurance is tied to a genuine life of faith and love."
    },
    {
      "pk": 69003022,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 22,
      "text": "and whatever we ask we receive from Him, because we keep His commandments and do what is pleasing in His sight.",
      "links": "<a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Answered prayer is associated with obedience and righteousness. Obeying God's commandments is presented as integral to fruitful prayer."
    },
    {
      "pk": 69003023,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 23,
      "text": "And this is His commandment: that we should believe in the name of His Son Jesus Christ, and love one another, just as He has commanded us.",
      "links": "<a href='/AIV/43/6/29'>John 6:29</a>; <a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "The essence of God’s command is faith and love—faith in the Incarnate Son and mutual love among believers."
    },
    {
      "pk": 69003024,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 3,
      "verse": 24,
      "text": "And whoever keeps His commandments abides in Him, and He in them. And by this we know that He abides in us: by the Spirit whom He has given us.",
      "links": "<a href='/AIV/43/14/23'>John 14:23</a>; <a href='/AIV/45/8/9'>Rom. 8:9</a>",
      "comment": "Final emphasis is on reciprocal abiding—believers in God and God in believers. The Holy Spirit’s indwelling is the sign and means of this abiding presence. Faith, obedience, and the gift of the Spirit are united in the life of a Christian."
    }
  ],
  "translatedAt": "2025-12-24T12:31:03.335Z"
}