{
  "book": 69,
  "bookName": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 2,
  "verses": [
    {
      "pk": 69002001,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 1,
      "text": "My little children, I am writing these things to you so that you may not sin. And if anyone does sin, we have an advocate with the Father—Jesus Christ, the Righteous One.",
      "links": "<a href='/AIV/45/8/34'>Rom. 8:34</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>; <a href='/AIV/43/14/16'>John 14:16</a>",
      "comment": "John encourages believers not to sin, but also reassures them of Christ's intercessory role. The word 'advocate' (Greek: parakletos) parallels Christ’s ongoing mediation, connecting to Jesus' title as Intercessor."
    },
    {
      "pk": 69002002,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 2,
      "text": "He is the atoning sacrifice for our sins—and not only for ours, but also for those of the whole world.",
      "links": "<a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/45/3/25'>Rom. 3:25</a>; <a href='/AIV/58/2/17'>Heb. 2:17</a>",
      "comment": "The word 'atoning sacrifice' (Greek: hilasmos) refers to Christ’s substitutionary death for all humanity. Notice the universal scope—His death extends beyond just believers, fulfilling the universal redemption promised in Isaiah 53."
    },
    {
      "pk": 69002003,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 3,
      "text": "And by this we know that we have come to know him, if we keep his commandments.",
      "links": "<a href='/AIV/43/14/15'>John 14:15</a>; <a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Genuine knowledge of God is seen through obedience to His commands—this is a key sign of true faith. Note the direct connection between love for Christ and following His commandments (see John 14:15)."
    },
    {
      "pk": 69002004,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 4,
      "text": "Whoever says, 'I have come to know him,' but does not keep his commandments, is a liar, and the truth is not in him.",
      "links": "<a href='/AIV/43/14/24'>John 14:24</a>; <a href='/AIV/40/7/21-23'>Matt. 7:21-23</a>",
      "comment": "John is clear: profession without obedience is empty. Christ stressed the danger of claiming to know Him without doing the will of the Father."
    },
    {
      "pk": 69002005,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 5,
      "text": "But whoever keeps his word, truly in him the love of God is perfected. By this we know that we are in him:",
      "links": "<a href='/AIV/43/14/21-23'>John 14:21-23</a>; <a href='/AIV/62/4/12'>1 John 4:12</a>",
      "comment": "Obedience matures the love of God within believers, leading to perfect union with God. This points to a dynamic, living relationship with God, deepened through practical faithfulness."
    },
    {
      "pk": 69002006,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 6,
      "text": "Whoever says he remains in him should walk just as he walked.",
      "links": "<a href='/AIV/43/13/15'>John 13:15</a>; <a href='/AIV/60/2/21'>1 Pet. 2:21</a>",
      "comment": "Christians are called to closely imitate Christ, living lives that reflect His example of love, humility, and obedience."
    },
    {
      "pk": 69002007,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 7,
      "text": "Beloved, I am not writing you a new commandment, but an old commandment—a commandment you have had from the beginning. The old commandment is the word which you have heard.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/3/19/18'>Lev. 19:18</a>",
      "comment": "The command to love one another is old (from the Law), but renewed in Christ’s teaching. John’s use of 'from the beginning' links back to the original teaching received by the Church."
    },
    {
      "pk": 69002008,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 8,
      "text": "Yet I am writing you a new commandment, which is true in him and in you, because the darkness is passing away, and the true light is already shining.",
      "links": "<a href='/AIV/43/1/5'>John 1:5</a>; <a href='/AIV/49/5/8'>Eph. 5:8</a>",
      "comment": "The commandment is new because its fullness is revealed in Christ ('true in Him'). The darkness of sin is banished as Christ, the Light, shines in and through believers—a reality renewed in the life of the Church."
    },
    {
      "pk": 69002009,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 9,
      "text": "Whoever says he is in the light and hates his brother is still in darkness even now.",
      "links": "<a href='/AIV/40/5/22-24'>Matt. 5:22-24</a>; <a href='/AIV/43/13/35'>John 13:35</a>",
      "comment": "Love for others is the evidence of truly walking in the light. There can be no real fellowship with Christ while harboring hatred."
    },
    {
      "pk": 69002010,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 10,
      "text": "Whoever loves his brother remains in the light, and there is no cause for stumbling in him.",
      "links": "<a href='/AIV/19/119/165'>Ps. 119:165</a>; <a href='/AIV/43/12/35-36'>John 12:35-36</a>",
      "comment": "Walking in love leads to spiritual firmness and clarity, protecting from moral stumbling. This reflects the unity and peace that Christ brings to His followers."
    },
    {
      "pk": 69002011,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 11,
      "text": "But whoever hates his brother is in darkness and walks in darkness, and does not know where he is going, because the darkness has blinded his eyes.",
      "links": "<a href='/AIV/43/9/41'>John 9:41</a>; <a href='/AIV/20/4/19'>Prov. 4:19</a>",
      "comment": "Hatred blinds the heart and mind, leading away from the truth. Spiritual blindness prevents true communion with God."
    },
    {
      "pk": 69002012,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 12,
      "text": "I am writing to you, little children, because your sins have been forgiven for his name’s sake.",
      "links": "<a href='/AIV/43/20/31'>John 20:31</a>; <a href='/AIV/44/10/43'>Acts 10:43</a>",
      "comment": "John affirms the forgiveness of sins through Christ's name. This assurance of pardon is foundational for the Christian life and received through faith."
    },
    {
      "pk": 69002013,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 13,
      "text": "I am writing to you, fathers, because you have known him who is from the beginning. I am writing to you, young men, because you have overcome the evil one.",
      "links": "<a href='/AIV/43/1/1'>John 1:1</a>; <a href='/AIV/66/12/11'>Rev. 12:11</a>",
      "comment": "Different spiritual generations are addressed. Knowing 'him who is from the beginning' signifies knowing Christ, the eternal Word. Overcoming the evil one echoes Christ’s victory shared by the faithful."
    },
    {
      "pk": 69002014,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 14,
      "text": "I have written to you, children, because you know the Father. I have written to you, fathers, because you know him who is from the beginning. I have written to you, young men, because you are strong, and the word of God remains in you, and you have overcome the evil one.",
      "links": "<a href='/AIV/43/17/3'>John 17:3</a>; <a href='/AIV/49/6/10-17'>Eph. 6:10-17</a>",
      "comment": "John highlights spiritual stages and the strength that comes from God's word indwelling the believer. This inner abiding of the word enables victory over evil."
    },
    {
      "pk": 69002015,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 15,
      "text": "Do not love the world or the things in the world. If anyone loves the world, the love of the Father is not in him.",
      "links": "<a href='/AIV/40/6/24'>Matt. 6:24</a>; <a href='/AIV/59/4/4'>Jas. 4:4</a>",
      "comment": "Worldly desires and attachments crowd out the love of God. The spiritual life requires detachment from sinful pleasure and materialism."
    },
    {
      "pk": 69002016,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 16,
      "text": "For all that is in the world—the lust of the flesh, and the lust of the eyes, and the pride of life—is not from the Father, but is from the world.",
      "links": "<a href='/AIV/1/3/6'>Gen. 3:6</a>; <a href='/AIV/40/4/1-11'>Matt. 4:1-11</a>",
      "comment": "John lists the threefold fall of humanity—echoing the temptation of Eve (Gen. 3:6) and Jesus' temptations in the wilderness. The spiritual battle involves resisting these (internal and external) temptations."
    },
    {
      "pk": 69002017,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 17,
      "text": "And the world is passing away with its desires, but the one who does the will of God remains forever.",
      "links": "<a href='/AIV/40/24/35'>Matt. 24:35</a>; <a href='/AIV/19/102/26-28'>Ps. 102:26-28</a>",
      "comment": "Earthly things are temporary, but doing God's will leads to eternal life. Spiritual endurance is encouraged for lasting reward."
    },
    {
      "pk": 69002018,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 18,
      "text": "Children, it is the last hour. Just as you heard that the antichrist is coming, even now many antichrists have appeared. From this we know that it is the last hour.",
      "links": "<a href='/AIV/53/2/3-7'>2 Thess. 2:3-7</a>; <a href='/AIV/62/4/3'>1 John 4:3</a>",
      "comment": "John refers to both an individual and a spirit of opposition to Christ—'antichrists.' The presence of false teachers is a sign of the times between Christ's first and second comings."
    },
    {
      "pk": 69002019,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 19,
      "text": "They went out from us, but they were not really of us; for if they had been of us, they would have remained with us. But they went out so it might be made clear that none of them belonged to us.",
      "links": "<a href='/AIV/44/20/30'>Acts 20:30</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "Departures from the apostolic community expose those not truly part of the faith—the enduring, visible unity of the Church is a mark of true Christianity."
    },
    {
      "pk": 69002020,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 20,
      "text": "But you have an anointing from the Holy One, and all of you know the truth.",
      "links": "<a href='/AIV/43/14/26'>John 14:26</a>; <a href='/AIV/44/2/17'>Acts 2:17</a>",
      "comment": "'Anointing' refers to the Holy Spirit's indwelling presence, which imparts truth and knowledge. This points to a real, continuing participation in divine life."
    },
    {
      "pk": 69002021,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 21,
      "text": "I have not written to you because you do not know the truth, but because you do know it and because no lie is of the truth.",
      "links": "<a href='/AIV/43/18/37'>John 18:37</a>; <a href='/AIV/62/1/8'>1 John 1:8</a>",
      "comment": "John reassures the faithful of their grounding in truth. Authentic Christian life is marked by fidelity to the truth delivered by Christ and the apostles."
    },
    {
      "pk": 69002022,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 22,
      "text": "Who is the liar but the one who denies that Jesus is the Christ? This is the antichrist—the one who denies the Father and the Son.",
      "links": "<a href='/AIV/43/8/24'>John 8:24</a>; <a href='/AIV/62/4/3'>1 John 4:3</a>",
      "comment": "To deny Jesus’ true identity is to reject both Him and the Father. High christology is clear here: union with the Son is union with God Himself (see John 14:6-9)."
    },
    {
      "pk": 69002023,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 23,
      "text": "No one who denies the Son has the Father; whoever acknowledges the Son has the Father also.",
      "links": "<a href='/AIV/43/5/23'>John 5:23</a>; <a href='/AIV/43/14/9-11'>John 14:9-11</a>",
      "comment": "The inseparable relationship between Son and Father highlights the unity of God. Emphasizes the necessity of confession of faith in Jesus for true communion with God."
    },
    {
      "pk": 69002024,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 24,
      "text": "Let what you heard from the beginning remain in you. If what you heard from the beginning remains in you, you also will remain in the Son and in the Father.",
      "links": "<a href='/AIV/62/1/1'>1 John 1:1</a>; <a href='/AIV/43/15/4-7'>John 15:4-7</a>",
      "comment": "Faithfulness to the handed-down teaching is essential for remaining in fellowship with Christ and the Father—a strong endorsement of apostolic tradition."
    },
    {
      "pk": 69002025,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 25,
      "text": "And this is the promise that he himself promised us—eternal life.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/43/10/28'>John 10:28</a>",
      "comment": "God’s definitive promise is eternal life, realized through ongoing union with Christ, begun already in the believer’s present relationship with Him."
    },
    {
      "pk": 69002026,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 26,
      "text": "I have written these things to you about those who are trying to deceive you.",
      "links": "<a href='/AIV/40/24/24'>Matt. 24:24</a>; <a href='/AIV/44/20/30'>Acts 20:30</a>",
      "comment": "Vigilance is needed against false teaching—John urges steadfastness in the faith, echoing the warnings of Jesus and Paul about deception in the last days."
    },
    {
      "pk": 69002027,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 27,
      "text": "But as for you, the anointing that you received from him remains in you, and you do not need anyone to teach you; but as his anointing teaches you about all things—and is true and is not a lie—just as it has taught you, remain in him.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/24/31/33-34'>Jer. 31:33-34</a>",
      "comment": "The participatory, guiding role of the Holy Spirit is emphasized. The Spirit leads individuals and the community to truth, ensuring continuity with what has been handed down."
    },
    {
      "pk": 69002028,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 28,
      "text": "And now, little children, remain in him, so that when he appears, we may have confidence and not shrink from him in shame at his coming.",
      "links": "<a href='/AIV/43/15/4'>John 15:4</a>; <a href='/AIV/66/22/20'>Rev. 22:20</a>",
      "comment": "Remaining in Christ now prepares believers for confidence at His second coming. Perseverance within the communion of faith is key to assurance."
    },
    {
      "pk": 69002029,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 2,
      "verse": 29,
      "text": "If you know that he is righteous, you know that everyone who practices righteousness has been born of him.",
      "links": "<a href='/AIV/40/7/16-20'>Matt. 7:16-20</a>; <a href='/AIV/62/3/7-10'>1 John 3:7-10</a>",
      "comment": "Living righteously is the fruit of a true spiritual rebirth. Righteous deeds demonstrate an authentic relationship with Christ, the source of righteousness."
    }
  ],
  "translatedAt": "2025-12-24T12:30:35.173Z"
}