{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 6,
  "verses": [
    {
      "pk": 47006001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 1,
      "text": "Be careful not to do your acts of righteousness before others in order to be seen by them. If you do, you will have no reward from your Father in heaven.",
      "links": "<a href='/AIV/40/23/5'>Matt. 23:5</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Jesus warns against seeking the approval of people rather than God, echoing the theme of pure motives found throughout Scripture. Righteous acts are meant to please the Father, not to gain human praise."
    },
    {
      "pk": 47006002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 2,
      "text": "So whenever you give to the poor, do not sound a trumpet before you, as the hypocrites do in the synagogues and in the streets, that they may be honored by others. Truly I tell you, they have received their reward.",
      "links": "<a href='/AIV/40/23/6'>Matt. 23:6</a>; <a href='/AIV/20/21/13'>Prov. 21:13</a>",
      "comment": "Jesus contrasts outward show with inward devotion, calling for humility in giving. He exposes the pride of public religious display common among some of the religious leaders of the time."
    },
    {
      "pk": 47006003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 3,
      "text": "But when you give to the poor, do not let your left hand know what your right hand is doing,",
      "links": "<a href='/AIV/05/15/10'>Deut. 15:10</a>",
      "comment": "Acts of charity should be done with such secrecy that even the giver hardly notices. This reflects a heart purified by grace, serving God's will rather than seeking merit from people."
    },
    {
      "pk": 47006004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 4,
      "text": "so that your giving may be in secret; and your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/19/139/12'>Ps. 139:12</a>; <a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "God sees all things, even those hidden from human eyes. The Father’s reward is inward and spiritual, often related to sanctification as much as temporal blessings."
    },
    {
      "pk": 47006005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 5,
      "text": "And when you pray, do not be like the hypocrites. For they love to stand and pray in the synagogues and at the street corners, so that they may be seen by others. Truly I tell you, they have received their reward.",
      "links": "<a href='/AIV/42/18/11'>Luke 18:11</a>; <a href='/AIV/40/23/14'>Matt. 23:14</a>",
      "comment": "This verse highlights the problem of prideful prayer. Jesus calls us to true devotion—prayer is an intimate act toward God, not a performance for people."
    },
    {
      "pk": 47006006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 6,
      "text": "But when you pray, go into your inner room, shut the door, and pray to your Father who is in secret. And your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/12/4/33'>2 Kgs. 4:33</a>; <a href='/AIV/19/91/1'>Ps. 91:1</a>",
      "comment": "Private prayer is highlighted here. The 'inner room' can also be understood as the heart. Authentic encounters with God often happen in hiddenness—an encouragement to deep, regular personal prayer habits."
    },
    {
      "pk": 47006007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 7,
      "text": "And when you pray, do not babble on like the Gentiles do, for they think they will be heard because of their many words.",
      "links": "<a href='/AIV/11/18/26'>1 Kgs. 18:26</a>",
      "comment": "Jesus warns against vain repetition. Effective prayer is not about formulaic words but about sincerity and trust in God’s goodness."
    },
    {
      "pk": 47006008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 8,
      "text": "Do not be like them, for your Father knows what you need before you ask him.",
      "links": "<a href='/AIV/19/139/4'>Ps. 139:4</a>; <a href='/AIV/23/65/24'>Isa. 65:24</a>",
      "comment": "God’s omniscience assures believers that lengthy or elaborate prayers are unnecessary for Him to know our needs. This trust forms the foundation for confidence in prayer."
    },
    {
      "pk": 47006009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 9,
      "text": "Pray then like this: 'Our Father in heaven, hallowed be Your name.'",
      "links": "<a href='/AIV/42/11/2'>Luke 11:2</a>; <a href='/AIV/19/103/13'>Ps. 103:13</a>",
      "comment": "Jesus offers a model prayer that emphasizes God's holiness and fatherhood—a pattern for communal and individual prayer. Roman tradition retains this form as the basis of liturgical prayer."
    },
    {
      "pk": 47006010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 10,
      "text": "'Your kingdom come, Your will be done, on earth as it is in heaven.'",
      "links": "<a href='/AIV/19/103/19'>Ps. 103:19</a>; <a href='/AIV/40/4/17'>Matt. 4:17</a>",
      "comment": "Praying for God’s kingdom and will on earth expresses a longing for God’s reign established both spiritually and physically among humanity. Early Christian practice saw this as tied to Christ’s enduring presence in the worship of the faithful."
    },
    {
      "pk": 47006011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 11,
      "text": "'Give us today our daily bread.'",
      "links": "<a href='/AIV/02/16/4'>Ex. 16:4</a>; <a href='/AIV/19/104/15'>Ps. 104:15</a>",
      "comment": "Bread here refers to daily sustenance but also carries spiritual meaning—a reference connected later in John 6:35 to Jesus as the Bread of Life. Many early Christians saw this as a foreshadowing of the spiritual nourishment found in the Eucharist."
    },
    {
      "pk": 47006012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 12,
      "text": "'And forgive us our debts, as we also forgive our debtors.'",
      "links": "<a href='/AIV/03/19/18'>Lev. 19:18</a>; <a href='/AIV/40/18/21-35'>Matt. 18:21-35</a>",
      "comment": "Debts here symbolize sins. Forgiving others is crucial for receiving God’s forgiveness—a recurring lesson pointing to the need for reconciliation through both personal acts and the means of grace God provides."
    },
    {
      "pk": 47006013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 13,
      "text": "'And do not lead us into temptation, but deliver us from evil.'",
      "links": "<a href='/AIV/19/141/4'>Ps. 141:4</a>; <a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "This prayer acknowledges our dependence on God’s protection amidst spiritual trials. Liturgical traditions have always preserved this plea within daily worship, recognizing humanity’s constant need for God’s sustaining grace."
    },
    {
      "pk": 47006014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 14,
      "text": "For if you forgive others their transgressions, your heavenly Father will also forgive you.",
      "links": "<a href='/AIV/41/11/25'>Mark 11:25</a>; <a href='/AIV/19/32/1'>Ps. 32:1</a>",
      "comment": "God’s forgiveness is connected to our willingness to forgive. This mutuality hints at a community ordered by charity and grace, which is foundational for Christian living."
    },
    {
      "pk": 47006015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 15,
      "text": "But if you do not forgive others, neither will your Father forgive your transgressions.",
      "links": "<a href='/AIV/51/3/13'>Col. 3:13</a>; <a href='/AIV/59/2/13'>Jas. 2:13</a>",
      "comment": "The necessity of forgiving others highlights the interplay between divine and human mercy. Relational restoration is repeatedly emphasized in both the law and teaching of Jesus."
    },
    {
      "pk": 47006016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 16,
      "text": "And when you fast, do not look gloomy like the hypocrites, for they disfigure their faces so that others will notice their fasting. Truly I tell you, they have received their reward.",
      "links": "<a href='/AIV/23/58/5'>Isa. 58:5</a>; <a href='/AIV/40/9/14-15'>Matt. 9:14–15</a>",
      "comment": "Jesus lays out another spiritual discipline—fasting. This is to be done sincerely and joyfully, suggesting that private practices of faith are highly valued."
    },
    {
      "pk": 47006017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 17,
      "text": "But when you fast, anoint your head and wash your face,",
      "links": "<a href='/AIV/27/10/3'>Dan. 10:3</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "Jesus instructs to maintain a normal appearance when fasting, reinforcing that spiritual discipline is for God’s eyes, not man’s. It also subtly references the scriptural pattern of outward anointing with inward holiness."
    },
    {
      "pk": 47006018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 18,
      "text": "so that your fasting will not be seen by others but by your Father who is in secret; and your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "Spiritual disciplines such as fasting are for God's glory, not human admiration. Hidden faithfulness is a recurring emphasis that shapes Christian virtue."
    },
    {
      "pk": 47006019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 19,
      "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal.",
      "links": "<a href='/AIV/21/5/13-14'>Eccl. 5:13-14</a>; <a href='/AIV/54/6/9-10'>1 Tim. 6:9-10</a>",
      "comment": "Jesus shifts to teachings on wealth. Earthly treasures are temporary and insecure, highlighting the need for a focus on heavenly rewards."
    },
    {
      "pk": 47006020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 20,
      "text": "But store up for yourselves treasures in heaven, where neither moth nor rust destroys, and where thieves do not break in or steal.",
      "links": "<a href='/AIV/42/12/33'>Luke 12:33</a>; <a href='/AIV/19/49/16-17'>Ps. 49:16-17</a>",
      "comment": "Heavenly treasures refer to spiritual rewards, lasting beyond this life. Early Church tradition connected almsgiving, prayer, and fasting with accumulating eternal reward."
    },
    {
      "pk": 47006021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 21,
      "text": "For where your treasure is, there your heart will be also.",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>; <a href='/AIV/51/3/1-2'>Col. 3:1-2</a>",
      "comment": "What we value reveals the condition of our heart. Jesus calls believers to orient their deepest desires toward the kingdom of God."
    },
    {
      "pk": 47006022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 22,
      "text": "The eye is the lamp of the body. So if your eye is healthy, your whole body will be full of light.",
      "links": "<a href='/AIV/42/11/34'>Luke 11:34</a>; <a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "The eye represents our focus and intent. If our values are rightly ordered, our lives will reflect God’s light—purity of heart leads to clarity of vision."
    },
    {
      "pk": 47006023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 23,
      "text": "But if your eye is bad, your whole body will be full of darkness. If then the light in you is darkness, how great is that darkness!",
      "links": "<a href='/AIV/40/15/14'>Matt. 15:14</a>; <a href='/AIV/23/5/20'>Isa. 5:20</a>",
      "comment": "Evil intent corrupts the whole person. Without right spiritual orientation, it is easy to become blind to the truth and grace God offers."
    },
    {
      "pk": 47006024,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 24,
      "text": "No one can serve two masters, for either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve God and mammon.",
      "links": "<a href='/AIV/42/16/13'>Luke 16:13</a>; <a href='/AIV/02/20/3'>Ex. 20:3</a>",
      "comment": "Mammon is a term for wealth or possessions. Jesus insists on total allegiance, echoing the first commandment. Single-hearted devotion is necessary for Christian discipleship."
    },
    {
      "pk": 47006025,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 25,
      "text": "Therefore I tell you, do not be anxious about your life, what you will eat or what you will drink; nor about your body, what you will wear. Is not life more than food and the body more than clothing?",
      "links": "<a href='/AIV/19/37/3-5'>Ps. 37:3-5</a>; <a href='/AIV/50/4/6'>Phil. 4:6</a>",
      "comment": "Jesus assures us of God’s providence, teaching trust over anxiety. This teaching frames dependence on God as a path to spiritual freedom."
    },
    {
      "pk": 47006026,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 26,
      "text": "Look at the birds of the air: they do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not of more value than they?",
      "links": "<a href='/AIV/18/38/41'>Job 38:41</a>; <a href='/AIV/19/145/15-16'>Ps. 145:15-16</a>",
      "comment": "God’s care for creation points to His greater care for His children. The value of humanity, as image-bearers of God, is especially pronounced."
    },
    {
      "pk": 47006027,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 27,
      "text": "And which of you by being anxious can add a single hour to his span of life?",
      "links": "<a href='/AIV/19/39/5-6'>Ps. 39:5-6</a>; <a href='/AIV/42/12/25'>Luke 12:25</a>",
      "comment": "Anxiety cannot lengthen our lives, but trust in God’s sovereignty brings peace. The futility of worry is a recurring biblical lesson."
    },
    {
      "pk": 47006028,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 28,
      "text": "And why are you anxious about clothing? Consider the lilies of the field, how they grow; they do not labor or spin,",
      "links": "<a href='/AIV/28/14/5'>Hos. 14:5</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "Jesus uses nature to teach God’s provision. The lilies’ effortless beauty is a symbol of divine providence, inviting believers to childlike trust."
    },
    {
      "pk": 47006029,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 29,
      "text": "yet I tell you, even Solomon in all his glory was not clothed like one of these.",
      "links": "<a href='/AIV/11/10/4-5'>1 Kgs. 10:4-5</a>; <a href='/AIV/19/132/9'>Ps. 132:9</a>",
      "comment": "Jesus references Solomon as the height of earthly splendor, surpassed even by God’s adornment of nature. This points to a divine generosity and order surpassing human achievement."
    },
    {
      "pk": 47006030,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 30,
      "text": "But if God so clothes the grass of the field, which today is alive and tomorrow is thrown into the oven, will He not much more clothe you—you of little faith?",
      "links": "<a href='/AIV/23/40/6-8'>Isa. 40:6-8</a>; <a href='/AIV/13/29/14-16'>1 Chr. 29:14-16</a>",
      "comment": "Jesus challenges weak faith. His teaching here prepares the way for trust in God’s lasting promises, recalling the Old Testament’s assurances and foreshadowing the security found in Christ."
    },
    {
      "pk": 47006031,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 31,
      "text": "Therefore do not be anxious, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’",
      "links": "<a href='/AIV/42/12/29'>Luke 12:29</a>; <a href='/AIV/02/16/15'>Ex. 16:15</a>",
      "comment": "Jesus repeats the command against anxiety. Christians are called to approach life with serenity, grounded in faith."
    },
    {
      "pk": 47006032,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 32,
      "text": "For the Gentiles seek after all these things, and your heavenly Father knows that you need them all.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>; <a href='/AIV/43/16/23'>John 16:23</a>",
      "comment": "Pagans are characterized by restless striving. Believers, by contrast, are children who entrust their needs to a loving Father. The familial language here speaks to God’s close and sustaining relationship with His people."
    },
    {
      "pk": 47006033,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 33,
      "text": "But seek first the kingdom of God and His righteousness, and all these things will be added to you.",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>; <a href='/AIV/45/14/17'>Rom. 14:17</a>",
      "comment": "Righteousness and the kingdom are the first priorities. When these shape our lives, God provides for all else. The early church interpreted this as an encouragement to prioritize holy living and participation in the life of the Christian community."
    },
    {
      "pk": 47006034,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 6,
      "verse": 34,
      "text": "Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself. Each day has enough trouble of its own.",
      "links": "<a href='/AIV/19/55/22'>Ps. 55:22</a>; <a href='/AIV/20/27/1'>Prov. 27:1</a>",
      "comment": "Jesus commands present trust, not future worry. Christian hope is rooted in daily dependence on God’s grace, rather than in securing our own future—a call to spiritual rest and surrender."
    }
  ],
  "translatedAt": "2025-12-24T10:04:42.019Z"
}