{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 2,
  "verses": [
    {
      "pk": 47002001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 1,
      "text": "After Jesus was born in Bethlehem of Judea, during the days of King Herod, wise men from the east arrived in Jerusalem,",
      "links": "<a href='/AIV/33/5/2'>Mic. 5:2</a>; <a href='/AIV/42/2/4-7'>Luke 2:4-7</a>",
      "comment": "The mention of Bethlehem fulfills Messianic prophecy (Micah 5:2), pointing to the divine plan for Christ's birth. The wise men, or Magi, signal that Christ's kingship is recognized even by those outside Israel."
    },
    {
      "pk": 47002002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 2,
      "text": "saying, \"Where is the one who has been born King of the Jews? For we saw his star in the east and have come to worship him.\"",
      "links": "<a href='/AIV/04/24/17'>Num. 24:17</a>; <a href='/AIV/19/72/10-11'>Ps. 72:10-11</a>",
      "comment": "Their intent to worship the child is a recognition of Jesus' unique status and divinity. The star references Balaam's prophecy of a coming ruler (Num. 24:17), showing a fulfillment of Old Testament expectation."
    },
    {
      "pk": 47002003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 3,
      "text": "When King Herod heard this, he was deeply troubled, and all Jerusalem with him.",
      "links": "",
      "comment": "Herod's anxiety is due to the threat to his reign, but Jerusalem's disturbance shows that the news of the Messiah had deep social implications, revealing political and spiritual expectations."
    },
    {
      "pk": 47002004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 4,
      "text": "He gathered all the chief priests and scribes of the people and asked them where the Messiah was to be born.",
      "links": "<a href='/AIV/33/5/2'>Mic. 5:2</a>; <a href='/AIV/42/2/4'>Luke 2:4</a>",
      "comment": "Herod consults religious authorities, recognizing that the Messiah’s coming is rooted in scripture and tradition. It also highlights the authority structure of the faith community, centered around leadership."
    },
    {
      "pk": 47002005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 5,
      "text": "They replied, \"In Bethlehem of Judea, because this is what was written by the prophet:",
      "links": "<a href='/AIV/33/5/2'>Mic. 5:2</a>",
      "comment": "Scriptural prophecy guides the interpretation of present events, showing God's plan revealed through prophets is fulfilled in Christ."
    },
    {
      "pk": 47002006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 6,
      "text": "\"And you, Bethlehem, land of Judah, are by no means least among the rulers of Judah; for out of you will come a ruler who will shepherd my people Israel.\"",
      "links": "<a href='/AIV/33/5/2'>Mic. 5:2</a>; <a href='/AIV/26/34/23'>Ezek. 34:23</a>",
      "comment": "This prophecy identifies the Messiah not only as a king but as a shepherd, an image of spiritual leadership and guidance."
    },
    {
      "pk": 47002007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 7,
      "text": "Then Herod secretly called the wise men and learned from them the exact time the star had appeared.",
      "links": "",
      "comment": "Herod’s secrecy exposes his intent to manipulate God’s plan. The time of the star’s appearance helps date Jesus’ birth, showing God’s intervention in history."
    },
    {
      "pk": 47002008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 8,
      "text": "He sent them to Bethlehem and said, \"Go and search carefully for the child. When you have found him, report to me, so that I may also go and worship him.\"",
      "links": "",
      "comment": "Herod’s claim to want to worship is deceptive, contrasting authentic worship offered by the wise men. True worship involves sincere submission to Christ."
    },
    {
      "pk": 47002009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 9,
      "text": "After they had heard the king, they went their way. The star that they had seen in the east went ahead of them, until it stopped over the place where the child was.",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>",
      "comment": "Just as God led Israel by a pillar of fire, He guides the Magi with a star. This shows divine guidance by miraculous signs."
    },
    {
      "pk": 47002010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 10,
      "text": "When they saw the star, they rejoiced with great joy.",
      "links": "",
      "comment": "The Magi’s joy indicates the inner response to a genuine encounter with God's revelation (see Ps. 118:24), suggesting the need for a joyful and obedient approach to revelation."
    },
    {
      "pk": 47002011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 11,
      "text": "Entering the house, they saw the child with Mary, his mother, and they bowed down and worshiped him. They opened their treasures and presented gifts of gold, frankincense, and myrrh.",
      "links": "<a href='/AIV/19/72/10'>Ps. 72:10</a>; <a href='/AIV/23/60/6'>Isa. 60:6</a>",
      "comment": "The gifts have spiritual meaning—gold for kingship, frankincense for divinity, myrrh for sacrificial death. Their worship recognizes Jesus’ divine nature even as a child, and the mention of Mary with Jesus highlights her unique role in salvation history."
    },
    {
      "pk": 47002012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 12,
      "text": "And being warned in a dream not to return to Herod, they departed for their own country by another route.",
      "links": "<a href='/AIV/01/20/3'>Gen. 20:3</a>; <a href='/AIV/40/1/20'>Matt. 1:20</a>",
      "comment": "God communicates through dreams, protecting His plan. God’s direct intervention teaches trust in divine guidance through appointed means."
    },
    {
      "pk": 47002013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 13,
      "text": "After they departed, an angel of the Lord appeared to Joseph in a dream and said, \"Get up, take the child and his mother, and flee to Egypt. Stay there until I tell you, for Herod is about to search for the child to destroy him.\"",
      "links": "<a href='/AIV/02/3/7'>Ex. 3:7</a>; <a href='/AIV/28/11/1'>Hos. 11:1</a>",
      "comment": "Joseph’s obedience to revelation prefigures the protection and guidance of the faithful. Egypt as a refuge echoes the history of Israel and serves as a prophetic fulfillment (Hos. 11:1)."
    },
    {
      "pk": 47002014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 14,
      "text": "So he got up, took the child and his mother by night, and departed to Egypt.",
      "links": "<a href='/AIV/02/12/42'>Ex. 12:42</a>",
      "comment": "Joseph’s prompt action in protecting Jesus and Mary highlights the importance of obedience. The flight by night recalls Israel’s Exodus, paralleling collective deliverance with individual protection in God’s plan."
    },
    {
      "pk": 47002015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 15,
      "text": "He stayed there until the death of Herod. This was to fulfill what the Lord had spoken through the prophet: \"Out of Egypt I called my son.\"",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>",
      "comment": "Matthew applies Hosea’s prophecy to Jesus, showing that Christ embodies the story of God’s people. ‘My son’ here is not only a reference to Israel but also to Jesus—the Son of God, revealing high christology."
    },
    {
      "pk": 47002016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 16,
      "text": "When Herod realized he had been deceived by the wise men, he became furious. He sent and killed all the boys in Bethlehem and all the surrounding area who were two years old and under, according to the time he had learned from the wise men.",
      "links": "<a href='/AIV/02/1/22'>Ex. 1:22</a>",
      "comment": "The massacre recalls Pharaoh’s violence against Israelite children. Jesus, as the new Moses, survives the violence, underscoring His role as a saving deliverer."
    },
    {
      "pk": 47002017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 17,
      "text": "Then what was spoken by Jeremiah the prophet was fulfilled:",
      "links": "<a href='/AIV/24/31/15'>Jer. 31:15</a>",
      "comment": "Matthew continually connects events to Old Testament prophecy, stressing continuity between old and new revelation and identifying Jesus as the fulfillment of scripture."
    },
    {
      "pk": 47002018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 18,
      "text": "\"A voice was heard in Ramah, weeping and great mourning, Rachel weeping for her children; she refused to be comforted, because they are no more.\"",
      "links": "<a href='/AIV/24/31/15'>Jer. 31:15</a>",
      "comment": "The lament of Rachel evokes the suffering of God’s people and anticipates the comfort that Christ will bring through redemption and resurrection."
    },
    {
      "pk": 47002019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 19,
      "text": "But when Herod died, an angel of the Lord appeared in a dream to Joseph in Egypt,",
      "links": "<a href='/AIV/40/1/20'>Matt. 1:20</a>; <a href='/AIV/02/4/19'>Ex. 4:19</a>",
      "comment": "God’s timing and communication by angels again guide Joseph. The parallel to Exodus continues, showing Jesus recapitulates key moments in the chosen lineage’s journey."
    },
    {
      "pk": 47002020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 20,
      "text": "saying, \"Get up, take the child and his mother, and go to the land of Israel. For those who sought the child’s life are dead.\"",
      "links": "<a href='/AIV/02/4/19'>Ex. 4:19</a>",
      "comment": "The instruction mirrors God's command to Moses, emphasizing obedience and the protection of the Messiah for his future mission."
    },
    {
      "pk": 47002021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 21,
      "text": "So he got up, took the child and his mother, and entered the land of Israel.",
      "links": "",
      "comment": "Joseph's careful guardianship underlines the need for listening to divine guidance and the responsible use of authority within the family, reminiscent of biblical headship."
    },
    {
      "pk": 47002022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 22,
      "text": "But when he heard that Archelaus was ruling over Judea in place of his father Herod, he was afraid to go there. Having been warned in a dream, he withdrew to the region of Galilee.",
      "links": "",
      "comment": "Again, divine direction through dreams protects the holy family and brings them to Galilee, which will be pivotal in Jesus’ ministry and fulfillment of prophecy (see Isa. 9:1-2)."
    },
    {
      "pk": 47002023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 2,
      "verse": 23,
      "text": "He went and lived in a town called Nazareth, so that what was spoken through the prophets might be fulfilled: \"He will be called a Nazarene.\"",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/43/1/45-46'>John 1:45-46</a>",
      "comment": "Nazareth’s lowly status fulfills the prophets’ message that the Messiah would be humble and despised, yet divinely chosen (‘branch’–Heb. netzer, Isa. 11:1). Christ’s upbringing in Nazareth sets the stage for his universal mission and connects to the prophetic tradition of the coming king from David’s line."
    }
  ],
  "translatedAt": "2025-12-24T10:02:23.021Z"
}