{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 15,
  "verses": [
    {
      "pk": 47015001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 1,
      "text": "Then some Pharisees and scribes came to Jesus from Jerusalem and said,",
      "links": "<a href='/AIV/41/7/1'>Mark 7:1</a>",
      "comment": "The Pharisees and scribes were religious leaders known for their strict observation of ancestral traditions. Their journey from Jerusalem illustrates the seriousness with which they approach Jesus, seeing Him as a significant figure to be questioned."
    },
    {
      "pk": 47015002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 2,
      "text": "\"Why do your disciples break the tradition of the elders? For they do not wash their hands when they eat bread.\"",
      "links": "<a href='/AIV/41/7/5'>Mark 7:5</a>",
      "comment": "The tradition in question refers to ritual handwashing before meals, a custom added by elders beyond what the Law required. This sets up the distinction Jesus will make between God's commandments and human traditions."
    },
    {
      "pk": 47015003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 3,
      "text": "But He answered them, \"And why do you break the commandment of God for the sake of your tradition?",
      "links": "<a href='/AIV/41/7/6-9'>Mark 7:6-9</a>",
      "comment": "Jesus responds by raising the authority of God's commandments above human traditions. This is a key principle: divine law supersedes mere customs."
    },
    {
      "pk": 47015004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 4,
      "text": "For God said, 'Honor your father and mother,' and, 'He who curses father or mother must be put to death.'",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/3/20/9'>Lev. 20:9</a>",
      "comment": "Jesus quotes the fifth commandment and its consequences, demonstrating the seriousness of disobeying God's direct instructions regarding family."
    },
    {
      "pk": 47015005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 5,
      "text": "But you say, 'Whoever tells his father or mother, \"Whatever benefit you might have received from me is given to God,\"'",
      "links": "<a href='/AIV/41/7/11'>Mark 7:11</a>",
      "comment": "Jesus exposes a loophole the religious leaders allowed—declaring resources 'dedicated to God' so they could avoid their familial responsibilities. This illustrates prioritizing ritual over moral obligation."
    },
    {
      "pk": 47015006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 6,
      "text": "he need not honor his father or mother.' In this way you have made the word of God empty by your tradition.",
      "links": "<a href='/AIV/41/7/13'>Mark 7:13</a>",
      "comment": "Here Jesus criticizes how human tradition can nullify God’s command. There is a warning not to let customs or innovations override the core of divine teaching, inviting reflection on the preservation and safeguarding of true doctrine."
    },
    {
      "pk": 47015007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 7,
      "text": "You hypocrites! Isaiah prophesied rightly about you, saying:",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "By calling them 'hypocrites,' Jesus aligns Himself with prophetic authority, directly applying Isaiah’s words to His audience. This strongly claims Christ’s right to judge religious practice."
    },
    {
      "pk": 47015008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 8,
      "text": "'This people honors Me with their lips, but their heart is far from Me.'",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/19/78/36-37'>Ps. 78:36-37</a>",
      "comment": "Jesus highlights the need for interior transformation, implying that true worship involves both words and heart—indicating the unity of faith and practice, and calling attention to the importance of right disposition."
    },
    {
      "pk": 47015009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 9,
      "text": "\"In vain do they worship Me, teaching as doctrines human commands.\"",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/51/2/22'>Col. 2:22</a>",
      "comment": "God requires heart-felt, sincere worship, not merely outward conformity or human invention. This sharp distinction between divine and human teaching foreshadows the need for both authoritative interpretation and faithful preservation of divine doctrine."
    },
    {
      "pk": 47015010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 10,
      "text": "Then He called the crowd to Him and said, \"Listen and understand:",
      "links": "<a href='/AIV/41/7/14'>Mark 7:14</a>",
      "comment": "Jesus now addresses all the people, emphasizing the importance of His teaching by saying 'understand'. This indicates a new and authoritative interpretation, centralizing His role as ultimate teacher."
    },
    {
      "pk": 47015011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 11,
      "text": "\"It is not what goes into the mouth that defiles a person, but what comes out of the mouth, this defiles a person.\"",
      "links": "<a href='/AIV/41/7/15'>Mark 7:15</a>; <a href='/AIV/40/12/34'>Matt. 12:34</a>",
      "comment": "Christ is elevating moral and spiritual purity over ritual cleanliness. This reorientation has profound implications for understanding what is central in obedience to God—a principle pointing to the heart and spoken word."
    },
    {
      "pk": 47015012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 12,
      "text": "Then the disciples came and said to Him, \"Do you know that the Pharisees were offended when they heard this saying?\"",
      "links": "<a href='/AIV/41/7/17-18'>Mark 7:17-18</a>",
      "comment": "The disciples note the offensive nature of Jesus’ teaching to the Pharisees, demonstrating how radically Jesus departed from prevailing religious customs."
    },
    {
      "pk": 47015013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 13,
      "text": "But He answered, \"Every plant that My heavenly Father has not planted will be uprooted.\"",
      "links": "<a href='/AIV/40/13/24-30'>Matt. 13:24-30</a>; <a href='/AIV/23/60/21'>Isa. 60:21</a>",
      "comment": "Jesus alludes to the theme of the wheat and tares, signifying that teachings and institutions not established by God will not endure. This hints at the enduring, divinely-planted community that He establishes."
    },
    {
      "pk": 47015014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 14,
      "text": "\"Let them alone; they are blind guides of the blind. And if the blind lead the blind, both will fall into a pit.\"",
      "links": "<a href='/AIV/40/23/16-24'>Matt. 23:16-24</a>; <a href='/AIV/19/82/5'>Ps. 82:5</a>",
      "comment": "Jesus declares that those not grounded in true doctrine are blind guides. This stresses the need for a trustworthy, divinely-guided interpretive authority to protect against error."
    },
    {
      "pk": 47015015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 15,
      "text": "Peter said to Him, \"Explain this parable to us.\"",
      "links": "<a href='/AIV/41/7/17'>Mark 7:17</a>",
      "comment": "Peter, acting as the spokesperson, asks for clarification. His leadership role among the disciples is hinted at again here, emphasizing the place of a chief apostle."
    },
    {
      "pk": 47015016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 16,
      "text": "And Jesus said, \"Are you also still without understanding?\"",
      "links": "<a href='/AIV/41/7/18'>Mark 7:18</a>",
      "comment": "Jesus highlights the slowness of even His closest followers to grasp deeper spiritual truths, showing the need for patient guidance and teaching."
    },
    {
      "pk": 47015017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 17,
      "text": "\"Do you not understand that whatever enters the mouth goes into the stomach and is expelled into the latrine?",
      "links": "<a href='/AIV/41/7/18-19'>Mark 7:18-19</a>",
      "comment": "Jesus appeals to natural reasoning to show that food has no impact on spiritual purity; He is distinguishing truly moral issues from neutral physical ones."
    },
    {
      "pk": 47015018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 18,
      "text": "But what comes out of the mouth comes from the heart, and this defiles a person.",
      "links": "<a href='/AIV/40/12/34'>Matt. 12:34</a>; <a href='/AIV/19/51/10'>Ps. 51:10</a>",
      "comment": "Christ focuses on the heart as central, teaching that inward disposition (from which words flow) is what counts before God."
    },
    {
      "pk": 47015019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 19,
      "text": "For out of the heart come evil thoughts—murders, adulteries, sexual immoralities, thefts, false testimonies, and slanders.",
      "links": "<a href='/AIV/2/20/13-16'>Ex. 20:13-16</a>; <a href='/AIV/41/7/21-22'>Mark 7:21-22</a>",
      "comment": "These sins echo the Decalogue (Ten Commandments), calling to mind that both internal and external actions are subject to God's law."
    },
    {
      "pk": 47015020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 20,
      "text": "These are what defile a person; but to eat with unwashed hands does not defile anyone.\"",
      "links": "<a href='/AIV/41/7/23'>Mark 7:23</a>",
      "comment": "Emphasizes Jesus’s authority to declare which actions have moral weight, further establishing His role as the revealer and interpreter of God’s will."
    },
    {
      "pk": 47015021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 21,
      "text": "Then Jesus left there and withdrew to the region of Tyre and Sidon.",
      "links": "<a href='/AIV/41/7/24'>Mark 7:24</a>",
      "comment": "Tyre and Sidon lie outside Jewish territory, demonstrating that Jesus’s mission anticipates a wider reach to the nations."
    },
    {
      "pk": 47015022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 22,
      "text": "And behold, a Canaanite woman from that region came and was crying out, saying, \"Have mercy on me, Lord, Son of David! My daughter is severely tormented by a demon.\"",
      "links": "<a href='/AIV/41/7/25-26'>Mark 7:25-26</a>; <a href='/AIV/10/7/14'>2 Sam. 7:14</a>",
      "comment": "She addresses Jesus by His Messianic title, 'Son of David,' demonstrating unexpected faith from a Gentile. This points to the eventual inclusion of all peoples into God’s promises."
    },
    {
      "pk": 47015023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 23,
      "text": "But He did not answer her a word. And His disciples came and begged Him, saying, \"Send her away, for she keeps crying out after us.\"",
      "links": "<a href='/AIV/41/7/27'>Mark 7:27</a>",
      "comment": "Jesus’s initial silence is a test of faith, while the disciples’ response highlights their initial misunderstanding of Jesus’s universal mission."
    },
    {
      "pk": 47015024,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 24,
      "text": "He answered, \"I was sent only to the lost sheep of the house of Israel.\"",
      "links": "<a href='/AIV/40/10/5-6'>Matt. 10:5-6</a>; <a href='/AIV/26/34/6'>Ezek. 34:6</a>",
      "comment": "Jesus restates His primary mission to Israel, but His actions will demonstrate the opening of God’s mercy to the nations through faith."
    },
    {
      "pk": 47015025,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 25,
      "text": "But she came and bowed down before Him, saying, \"Lord, help me!\"",
      "links": "<a href='/AIV/40/8/2'>Matt. 8:2</a>",
      "comment": "The woman’s humility and persistence in prayer exemplify the faith and devotion, which are key aspects of fruitful petition."
    },
    {
      "pk": 47015026,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 26,
      "text": "And He answered, \"It is not right to take the children's bread and throw it to the dogs.\"",
      "links": "<a href='/AIV/41/7/27'>Mark 7:27</a>",
      "comment": "Jesus uses a common metaphor of Jews and Gentiles—children and dogs—not as insult, but as a test highlighting her faith’s extraordinary nature."
    },
    {
      "pk": 47015027,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 27,
      "text": "But she said, \"Yes, Lord, yet even the dogs eat the crumbs that fall from their masters' table.\"",
      "links": "<a href='/AIV/41/7/28'>Mark 7:28</a>",
      "comment": "Her answer demonstrates faith, humility, and trust in God’s goodness—offering an example of persistent, humble prayer rewarded by divine grace."
    },
    {
      "pk": 47015028,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 28,
      "text": "Then Jesus answered her, \"O woman, great is your faith! Let it be done for you as you wish.\" And her daughter was healed instantly.",
      "links": "<a href='/AIV/40/8/10-13'>Matt. 8:10-13</a>",
      "comment": "Jesus commends the woman’s faith, and acts immediately. His response demonstrates that faith transcends ethnic boundaries, offering hope to all nations. The healing is instantaneous, showing Christ’s divine power and authority."
    },
    {
      "pk": 47015029,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 29,
      "text": "Jesus went on from there and walked beside the Sea of Galilee. And He went up on the mountain and sat down there.",
      "links": "<a href='/AIV/40/5/1'>Matt. 5:1</a>; <a href='/AIV/41/7/31'>Mark 7:31</a>",
      "comment": "Jesus's ascent to the mountain recalls Moses, who mediated God's covenant from the mountain, suggesting Jesus as the new and greater lawgiver."
    },
    {
      "pk": 47015030,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 30,
      "text": "Great crowds came to Him, bringing with them the lame, the blind, the crippled, the mute, and many others, and they laid them at His feet, and He healed them.",
      "links": "<a href='/AIV/40/4/24'>Matt. 4:24</a>; <a href='/AIV/23/35/5-6'>Isa. 35:5-6</a>",
      "comment": "Jesus's healings fulfill messianic prophecies (Isaiah 35), confirming His divine mission. The people's act of laying the sick at His feet expresses faith and reverence."
    },
    {
      "pk": 47015031,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 31,
      "text": "So the crowd marveled when they saw the mute speaking, the crippled made whole, the lame walking, and the blind seeing. And they glorified the God of Israel.",
      "links": "<a href='/AIV/40/9/33'>Matt. 9:33</a>; <a href='/AIV/42/7/16'>Luke 7:16</a>",
      "comment": "The miracles point to a restoration expected at the arrival of God's Kingdom. Glorifying the God of Israel shows these acts manifest divine glory—and are signs of God’s unifying and universal plan."
    },
    {
      "pk": 47015032,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 32,
      "text": "Then Jesus called His disciples and said, \"I have compassion on the crowd because they have been with Me now three days and have nothing to eat; and I do not want to send them away hungry, lest they faint on the way.\"",
      "links": "<a href='/AIV/40/14/14-15'>Matt. 14:14-15</a>",
      "comment": "Compassion leads to practical concern for bodily needs, displaying Christ's both spiritual and physical care for His people. The three days echo themes of preparation for divine encounter."
    },
    {
      "pk": 47015033,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 33,
      "text": "And the disciples said to Him, \"Where are we to get enough bread in such a remote place to feed so great a crowd?\"",
      "links": "<a href='/AIV/4/11/13'>Num. 11:13</a>; <a href='/AIV/40/14/17'>Matt. 14:17</a>",
      "comment": "The disciples’ worry echoes the Israelites’ wilderness concerns, preparing the way for Jesus to show divine provision in the miracle of bread."
    },
    {
      "pk": 47015034,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 34,
      "text": "And Jesus said to them, \"How many loaves do you have?\" They said, \"Seven, and a few small fish.\"",
      "links": "<a href='/AIV/40/14/17'>Matt. 14:17</a>; <a href='/AIV/41/8/5-7'>Mark 8:5-7</a>",
      "comment": "Jesus uses what little is available. Seven, a number symbolizing fullness, and the fish hint towards the Eucharistic overtones of God transforming simple food into miraculous abundance."
    },
    {
      "pk": 47015035,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 35,
      "text": "He commanded the crowd to sit down on the ground.",
      "links": "<a href='/AIV/40/14/19'>Matt. 14:19</a>",
      "comment": "The orderliness of the seating recalls prior feedings and suggests a communal meal under Christ’s direction, an image with liturgical resonance."
    },
    {
      "pk": 47015036,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 36,
      "text": "And He took the seven loaves and the fish, and after giving thanks He broke them and gave them to the disciples, and the disciples gave them to the crowd.",
      "links": "<a href='/AIV/40/14/19'>Matt. 14:19</a>; <a href='/AIV/41/8/6-7'>Mark 8:6-7</a>",
      "comment": "The sequence—taking, giving thanks, breaking, giving—parallels the actions at the Last Supper (Matt. 26:26). This gesture anticipates the ongoing provision of spiritual food to the faithful through a sacred meal instituted by Jesus."
    },
    {
      "pk": 47015037,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 37,
      "text": "And they all ate and were satisfied. And they took up seven baskets full of the leftover pieces.",
      "links": "<a href='/AIV/40/14/20'>Matt. 14:20</a>; <a href='/AIV/41/8/8'>Mark 8:8</a>",
      "comment": "There is more left over than what they started with, signifying the superabundance of God’s grace and pointing to an inexhaustible spiritual nourishment, which is preserved and collected—symbolizing care for what is holy and provision for all."
    },
    {
      "pk": 47015038,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 38,
      "text": "Those who ate were four thousand men, besides women and children.",
      "links": "<a href='/AIV/41/8/9'>Mark 8:9</a>",
      "comment": "The miracle affected a large, diverse crowd, indicating the breadth of Jesus's outreach and foreshadowing a fullness yet to come—a gathering of all into God's family."
    },
    {
      "pk": 47015039,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 15,
      "verse": 39,
      "text": "And after sending away the crowds, He got into the boat and went to the region of Magadan.",
      "links": "<a href='/AIV/41/8/10'>Mark 8:10</a>",
      "comment": "Jesus’s movement signals the continuing spread of His mission. He departs, but leaves behind abundant signs and a community fed and gathered, hinting at the continual shepherding and leadership provided for the faithful."
    }
  ],
  "translatedAt": "2025-12-24T10:10:57.471Z"
}