{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 11,
  "verses": [
    {
      "pk": 47011001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 1,
      "text": "When Jesus had finished instructing his twelve disciples, he went on from there to teach and preach in their cities.",
      "links": "<a href='/AIV/41/6/6'>Mark 6:6</a>; <a href='/AIV/40/9/35'>Matt. 9:35</a>",
      "comment": "Jesus continues his public ministry after sending out the Twelve, showing the ongoing mission of teaching and preaching. The pattern of instructing disciples and then reaching out to all communities hints at the enduring method of apostolic succession and mission in the Church."
    },
    {
      "pk": 47011002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 2,
      "text": "Now when John heard in prison about the works of Christ, he sent his disciples",
      "links": "<a href='/AIV/42/7/18'>Luke 7:18-19</a>; <a href='/AIV/40/4/12'>Matt. 4:12</a>",
      "comment": "John the Baptist is in prison (see Matt. 4:12). His sending of disciples to Jesus emphasizes the continuity between the Old Testament prophets and Jesus, the Messiah."
    },
    {
      "pk": 47011003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 3,
      "text": "and said to him, 'Are you the one who is to come, or should we look for another?'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/23/35/4'>Isa. 35:4-6</a>",
      "comment": "John's question echoes Old Testament expectations of the Messiah (Isaiah 35:4-6). His uncertainty allows Jesus to clarify his identity and mission, hinting at a deeper fulfillment of prophecy."
    },
    {
      "pk": 47011004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 4,
      "text": "Jesus answered them, 'Go and tell John what you hear and see:",
      "links": "<a href='/AIV/42/7/22'>Luke 7:22</a>; <a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Rather than give a direct answer, Jesus points to his works as evidence. This affirms his fulfillment of Messianic prophecy and the visible signs associated with the Redeemer."
    },
    {
      "pk": 47011005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 5,
      "text": "'The blind receive their sight and the lame walk, lepers are cleansed and the deaf hear, the dead are raised up and the poor have good news preached to them.'",
      "links": "<a href='/AIV/23/29/18'>Isa. 29:18-19</a>; <a href='/AIV/40/9/35'>Matt. 9:35</a>",
      "comment": "Jesus fulfills Isaiah’s Messianic expectations (Isaiah 29:18-19; 35:5-6). The physical miracles point to Jesus’ divine authority, while preaching to the poor foreshadows the inclusive nature and sacramental outreach of his Church."
    },
    {
      "pk": 47011006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 6,
      "text": "'And blessed is the one who is not offended by me.'",
      "links": "<a href='/AIV/60/2/8'>1 Pet. 2:8</a>",
      "comment": "Jesus asserts that there will be challenges to believing in him. This statement invites all to deeper faith, through obedience even when understanding is incomplete."
    },
    {
      "pk": 47011007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 7,
      "text": "As they went away, Jesus began to speak to the crowds about John: 'What did you go out into the wilderness to see? A reed shaken by the wind?'",
      "links": "<a href='/AIV/42/7/24'>Luke 7:24</a>",
      "comment": "Jesus testifies to John’s steadfastness—he was not a weak or uncertain prophet. This implicitly validates the Old Testament prophetic tradition, fulfilled in the new era."
    },
    {
      "pk": 47011008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 8,
      "text": "'Then what did you go out to see? A man dressed in soft clothing? Behold, those who wear soft clothing are in kings' houses.'",
      "links": "<a href='/AIV/42/7/25'>Luke 7:25</a>",
      "comment": "John was not part of elite society or comfort, but a man set apart, dedicated entirely to preparing the way for the Messiah."
    },
    {
      "pk": 47011009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 9,
      "text": "'Then what did you go out to see? A prophet? Yes, I tell you, and more than a prophet.'",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>",
      "comment": "Jesus declares John to be the final and greatest prophet, transitioning from the old order to the new. He prepares the way for Christ, the fulfillment of prophecy."
    },
    {
      "pk": 47011010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 10,
      "text": "'This is he of whom it is written, \"Behold, I send my messenger before your face, who will prepare your way before you.\"'",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>; <a href='/AIV/40/3/3'>Matt. 3:3</a>",
      "comment": "Jesus cites Malachi 3:1, underlining the fulfillment of Old Testament prophecy. The transition from prophecy to its fulfillment requires a living, visible faith guided by God."
    },
    {
      "pk": 47011011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 11,
      "text": "'Truly, I say to you, among those born of women there has arisen no one greater than John the Baptist. Yet the one who is least in the kingdom of heaven is greater than he.'",
      "links": "<a href='/AIV/42/7/28'>Luke 7:28</a>",
      "comment": "John’s greatness points to the unique dignity of belonging to the kingdom of heaven. This highlights the supernatural grace imparted by participation in Christ, including the gifts of the sacraments."
    },
    {
      "pk": 47011012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 12,
      "text": "'From the days of John the Baptist until now the kingdom of heaven has suffered violence, and the violent take it by force.'",
      "links": "<a href='/AIV/40/23/13'>Matt. 23:13</a>",
      "comment": "The 'violence' refers to opposition the kingdom faces and the zeal needed to enter. Entry into Christ's kingdom is costly and requires determination, signifying an active, persevering faith."
    },
    {
      "pk": 47011013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 13,
      "text": "'For all the prophets and the Law prophesied until John,'",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "Jesus teaches that the era of the old covenant reaches its climax with John. He prepares the way for the new covenant, inaugurated by Jesus."
    },
    {
      "pk": 47011014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 14,
      "text": "'and if you are willing to accept it, he is Elijah who is to come.'",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>; <a href='/AIV/40/17/10-13'>Matt. 17:10-13</a>",
      "comment": "John the Baptist fulfills the role of Elijah (Mal. 4:5), heralding the Messiah. This shows God’s faithfulness in keeping his promises through a visible, apostolic witness."
    },
    {
      "pk": 47011015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 15,
      "text": "'He who has ears to hear, let him hear.'",
      "links": "<a href='/AIV/40/13/9'>Matt. 13:9</a>; <a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "A call to spiritual discernment. Jesus repeatedly invites both a literal and spiritual understanding, urging openness to God’s revelation as it unfolds in history and sacrament."
    },
    {
      "pk": 47011016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 16,
      "text": "'But to what shall I compare this generation? It is like children sitting in the marketplaces and calling to others,",
      "links": "<a href='/AIV/42/7/31'>Luke 7:31'>Luke 7:31</a>",
      "comment": "Jesus criticizes the spiritual immaturity of those who refuse every invitation. They neither accept John’s asceticism nor Jesus’ graciousness."
    },
    {
      "pk": 47011017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 17,
      "text": "'\"We played the flute for you, and you did not dance; we sang a dirge, and you did not mourn.\"'",
      "links": "<a href='/AIV/40/9/11'>Matt. 9:11</a>",
      "comment": "Both joyful and mournful calls were rejected. This underlines the resistance to both repentance and grace among those unwilling to receive God’s full revelation."
    },
    {
      "pk": 47011018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 18,
      "text": "'For John came neither eating nor drinking, and they say, \"He has a demon.\"'",
      "links": "<a href='/AIV/40/3/4'>Matt. 3:4</a>",
      "comment": "John’s austere life brought false accusations. Even holy asceticism is misunderstood by the world, pointing to the need for discernment and reverence for holy offices."
    },
    {
      "pk": 47011019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 19,
      "text": "'The Son of Man came eating and drinking, and they say, \"Look at him! A glutton and a drunkard, a friend of tax collectors and sinners!\" Yet wisdom is justified by her deeds.'",
      "links": "<a href='/AIV/40/9/10-13'>Matt. 9:10-13</a>; <a href='/AIV/42/7/34-35'>Luke 7:34-35</a>",
      "comment": "Jesus, by identifying as the 'Son of Man', alludes to Daniel 7:13 (a Messianic and divine title). Rejection of both John and Jesus exposes the blindness of God’s critics. True wisdom is seen in holy works done through the Spirit."
    },
    {
      "pk": 47011020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 20,
      "text": "Then he began to denounce the cities where most of his mighty works had been done, because they did not repent.",
      "links": "<a href='/AIV/40/12/41'>Matt. 12:41</a>",
      "comment": "Even witnessing miracles, these cities rejected the call to repentance. Responding to God’s grace requires both faith and action."
    },
    {
      "pk": 47011021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 21,
      "text": "'Woe to you, Chorazin! Woe to you, Bethsaida! For if the mighty works done in you had been done in Tyre and Sidon, they would have repented long ago in sackcloth and ashes.'",
      "links": "<a href='/AIV/42/10/13'>Luke 10:13</a>; <a href='/AIV/26/3/6'>Ezek. 3:6'</a>",
      "comment": "Jesus emphasizes the seriousness of not responding to God’s intervention. 'Sackcloth and ashes' evokes the biblical imagery of deep repentance."
    },
    {
      "pk": 47011022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 22,
      "text": "'But I say to you, it will be more bearable on the day of judgment for Tyre and Sidon than for you.'",
      "links": "<a href='/AIV/10/12/13'>2 Sam. 12:13</a>; <a href='/AIV/40/25/31-46'>Matt. 25:31-46</a>",
      "comment": "Degrees of judgment reveal God’s justice. Knowledge brings responsibility; repentance is essential in response to grace."
    },
    {
      "pk": 47011023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 23,
      "text": "'And you, Capernaum, will you be exalted to heaven? You will be brought down to Hades. For if the mighty works done in you had been done in Sodom, it would have remained until this day.'",
      "links": "<a href='/AIV/23/14/13-15'>Isa. 14:13-15</a>; <a href='/AIV/40/10/15'>Matt. 10:15</a>",
      "comment": "Capernaum’s pride is judged. Familiarity with God’s miracles does not guarantee faithfulness; humility and repentance are always necessary."
    },
    {
      "pk": 47011024,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 24,
      "text": "'But I say to you that it will be more tolerable on the day of judgment for the land of Sodom than for you.'",
      "links": "<a href='/AIV/40/10/15'>Matt. 10:15</a>",
      "comment": "Sodom, a symbol of sin, receives a lesser punishment than those who reject Christ after seeing his mighty works. Final judgment corresponds to how one responds to the fullness of revealed truth."
    },
    {
      "pk": 47011025,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 25,
      "text": "At that time Jesus declared, 'I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children.'",
      "links": "<a href='/AIV/42/10/21'>Luke 10:21</a>; <a href='/AIV/19/8/2'>Ps. 8:2</a>",
      "comment": "Jesus' prayer reveals the intimacy within the Trinity: the Son addressing the Father. God bestows grace especially on the humble who approach in faith, a principle foundational to the sacramental life and spiritual childhood."
    },
    {
      "pk": 47011026,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 26,
      "text": "'Yes, Father, for such was your gracious will.'",
      "links": "<a href='/AIV/49/1/5'>Eph. 1:5</a>",
      "comment": "Divine revelation is a matter of God’s will and grace, not human achievement. This invokes the doctrine of grace as necessary for salvation."
    },
    {
      "pk": 47011027,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 27,
      "text": "'All things have been handed over to me by my Father, and no one knows the Son except the Father, and no one knows the Father except the Son and anyone to whom the Son chooses to reveal him.'",
      "links": "<a href='/AIV/43/3/35'>John 3:35</a>; <a href='/AIV/43/10/15'>John 10:15</a>",
      "comment": "Jesus’ claim to exclusive knowledge of the Father and authority over all things is a declaration of his divinity (see John 10:15). True knowledge of God comes only through Jesus and those whom he authorizes."
    },
    {
      "pk": 47011028,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 28,
      "text": "'Come to me, all who labor and are heavy laden, and I will give you rest.'",
      "links": "<a href='/AIV/40/23/4'>Matt. 23:4</a>; <a href='/AIV/58/4/9-11'>Heb. 4:9-11</a>",
      "comment": "Jesus personally offers rest, echoing Sabbath rest and fulfillment of God’s promise. Spiritual rest is found in him, pointing to grace mediated through his presence and sacraments."
    },
    {
      "pk": 47011029,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 29,
      "text": "'Take my yoke upon you, and learn from me, for I am gentle and lowly in heart, and you will find rest for your souls.'",
      "links": "<a href='/AIV/24/6/16'>Jer. 6:16</a>; <a href='/AIV/63/1/3'>2 John 1:3</a>",
      "comment": "Jesus invites believers to accept his guidance and teaching. In following him, one discovers gentle discipline and deep spiritual peace—a holy rest accessible within a sacramentally ordered faith."
    },
    {
      "pk": 47011030,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 11,
      "verse": 30,
      "text": "'For my yoke is easy, and my burden is light.'",
      "links": "<a href='/AIV/62/5/3'>1 John 5:3</a>; <a href='/AIV/19/55/22'>Ps. 55:22</a>",
      "comment": "The way of Jesus brings joy and true freedom; it is not a burdensome law but a path of grace. Divine help makes discipleship possible, especially through the ongoing guidance of the visible Church."
    }
  ],
  "translatedAt": "2025-12-24T10:08:08.366Z"
}