{
  "book": 48,
  "bookName": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 16,
  "verses": [
    {
      "pk": 48016001,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 1,
      "text": "When the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices, so they could go and anoint Him.",
      "links": "<a href='/AIV/42/24/1'>Luke 24:1</a>; <a href='/AIV/40/28/1'>Matt. 28:1</a>",
      "comment": "The act of women anointing Jesus' body reflects deep reverence and discipleship, connecting with the tradition of honoring the body, similar to Old Testament practices (Gen. 50:2). The inclusion of women highlights their faithful witness to the Resurrection."
    },
    {
      "pk": 48016002,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 2,
      "text": "Very early on the first day of the week, just after sunrise, they went to the tomb.",
      "links": "<a href='/AIV/43/20/1'>John 20:1</a>",
      "comment": "The timing—'the first day of the week'—is significant as it marks the beginning of a new creation, foreshadowing the Lord's Day, which became central for Christian worship."
    },
    {
      "pk": 48016003,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 3,
      "text": "They were saying to one another, 'Who will roll away the stone from the entrance of the tomb for us?'",
      "links": "<a href='/AIV/40/27/60'>Matt. 27:60</a>",
      "comment": "The large stone was a practical barrier, but also symbolizes the obstacles humans face. Divine intervention is about to be shown."
    },
    {
      "pk": 48016004,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 4,
      "text": "But when they looked up, they saw that the stone, which was very large, had been rolled away.",
      "links": "<a href='/AIV/42/24/2'>Luke 24:2</a>",
      "comment": "God's power removes obstacles; the rolling away of the stone points to the Resurrection as a divine act rather than a mere human or symbolic event."
    },
    {
      "pk": 48016005,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 5,
      "text": "And as they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were startled.",
      "links": "<a href='/AIV/40/28/3'>Matt. 28:3</a>; <a href='/AIV/42/24/4'>Luke 24:4</a>",
      "comment": "The 'young man' is traditionally interpreted as an angel (cf. Matt. 28:3), emphasizing God's messengers in key moments of salvation history. White garments symbolize purity and resurrection glory."
    },
    {
      "pk": 48016006,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 6,
      "text": "He said to them, 'Do not be afraid. You seek Jesus of Nazareth, who was crucified. He has risen! He is not here. See the place where they laid him.'",
      "links": "<a href='/AIV/41/8/31'>Mark 8:31</a>; <a href='/AIV/40/28/5-6'>Matt. 28:5-6</a>",
      "comment": "The angel’s message declares both the reality of Jesus’ crucifixion and resurrection. This fulfills Jesus' prior predictions (Mark 8:31). Both the literal emptiness of the tomb and the proclamation, 'He has risen,' affirm Christ's divinity and victory over death."
    },
    {
      "pk": 48016007,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 7,
      "text": "But go, tell His disciples and Peter, 'He is going ahead of you to Galilee. There you will see Him, just as He told you.'",
      "links": "<a href='/AIV/41/14/28'>Mark 14:28</a>; <a href='/AIV/42/24/9-10'>Luke 24:9-10</a>",
      "comment": "Peter is singled out, suggesting restoration and leadership among the disciples. Jesus’ going ahead recalls Him as Shepherd leading His flock (Ezek. 34:23)."
    },
    {
      "pk": 48016008,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 8,
      "text": "And they went out and fled from the tomb, for trembling and astonishment had seized them; and they said nothing to anyone, for they were afraid.",
      "links": "<a href='/AIV/42/24/5'>Luke 24:5</a>",
      "comment": "The fear and amazement reflect the awe of encountering the divine mystery. Human weakness contrasts with God's faithfulness in fulfilling His promises."
    },
    {
      "pk": 48016009,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 9,
      "text": "Now after He rose early on the first day of the week, He appeared first to Mary Magdalene, from whom He had cast out seven demons.",
      "links": "<a href='/AIV/42/8/2'>Luke 8:2</a>; <a href='/AIV/43/20/14-16'>John 20:14-16</a>",
      "comment": "This encounter highlights Mary Magdalene's important role as the first witness to the risen Lord, evidence of Jesus’ mercy and His restoring power."
    },
    {
      "pk": 48016010,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 10,
      "text": "She went and told those who had been with Him, as they mourned and wept.",
      "links": "<a href='/AIV/43/20/18'>John 20:18</a>",
      "comment": "Mary becomes the bearer of the Good News, highlighting the role of witness in divine revelation. Sorrow is turned to joy in light of the Resurrection."
    },
    {
      "pk": 48016011,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 11,
      "text": "When they heard that He was alive and had been seen by her, they did not believe it.",
      "links": "<a href='/AIV/42/24/11'>Luke 24:11</a>",
      "comment": "Doubt among the disciples points to the unexpected nature of the Resurrection and the need for faith rooted in apostolic testimony."
    },
    {
      "pk": 48016012,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 12,
      "text": "After this, He appeared in a different form to two of them, as they were walking into the country.",
      "links": "<a href='/AIV/42/24/13-16'>Luke 24:13-16</a>",
      "comment": "This parallel to the Emmaus road story demonstrates Jesus’ glorified body and His freedom from earthly limitations (see 1 Cor. 15:44; Luke 24:31)."
    },
    {
      "pk": 48016013,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 13,
      "text": "They went back and told the rest, but they did not believe them either.",
      "links": "<a href='/AIV/42/24/35'>Luke 24:35</a>",
      "comment": "Persistent disbelief sets the stage for Jesus’ personal appearance to all, underlining the need for the community’s unity in faith."
    },
    {
      "pk": 48016014,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 14,
      "text": "Later, He appeared to the Eleven as they were reclining at table; and He rebuked them for their lack of faith and stubbornness, because they had not believed those who had seen Him after He had risen.",
      "links": "<a href='/AIV/42/24/36-38'>Luke 24:36-38</a>; <a href='/AIV/43/20/19-29'>John 20:19-29</a>",
      "comment": "Jesus’ appearance to the Eleven validates the meaning and necessity of apostolic faith, handed on through chosen witnesses."
    },
    {
      "pk": 48016015,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 15,
      "text": "And He said to them, 'Go into all the world and preach the gospel to all creation.'",
      "links": "<a href='/AIV/40/28/19-20'>Matt. 28:19-20</a>",
      "comment": "The Great Commission tasks the apostles with universal mission, emphasizing the one Church’s calling to evangelize every nation. The authority given here becomes a foundation for the apostolic mission."
    },
    {
      "pk": 48016016,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 16,
      "text": "Whoever believes and is baptized will be saved, but whoever does not believe will be condemned.",
      "links": "<a href='/AIV/43/3/5'>John 3:5</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Faith and baptism are both required for salvation, pointing to baptism as more than a symbol—it's a necessary means of grace (see John 3:5)."
    },
    {
      "pk": 48016017,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 17,
      "text": "And these signs will follow those who believe: In My name they will cast out demons; they will speak in new tongues;",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/44/16/18'>Acts 16:18</a>",
      "comment": "Miraculous signs authenticate the apostolic message. 'In My name' shows the authority Christ has delegated to His followers, confirming His divine mission."
    },
    {
      "pk": 48016018,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 18,
      "text": "they will pick up serpents with their hands; and if they drink any deadly thing, it will not harm them; they will lay their hands on the sick, and they will recover.",
      "links": "<a href='/AIV/44/28/5'>Acts 28:5</a>; <a href='/AIV/59/5/14'>James 5:14</a>",
      "comment": "These signs testify to continued divine protection and healing through the ministry of the apostles and their successors. Laying on of hands connects to spiritual authority and healing practices."
    },
    {
      "pk": 48016019,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 19,
      "text": "So then the Lord Jesus, after He had spoken to them, was taken up into heaven and sat down at the right hand of God.",
      "links": "<a href='/AIV/42/24/51'>Luke 24:51</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/58/1/3'>Heb. 1:3</a>",
      "comment": "The Ascension fulfills Psalm 110:1, affirming Jesus' divine kingship and ongoing priestly intercession (see Heb. 7:25). Sitting at God's right hand denotes full authority."
    },
    {
      "pk": 48016020,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 16,
      "verse": 20,
      "text": "They went out and preached everywhere, while the Lord worked with them and confirmed the message by the signs that accompanied them.",
      "links": "<a href='/AIV/44/5/12'>Acts 5:12</a>; <a href='/AIV/58/2/4'>Heb. 2:4</a>",
      "comment": "The close cooperation between the Lord and His messengers points to God continuously affirming the truth of the apostolic preaching through miracles, laying the foundation of the one, holy, apostolic faith."
    }
  ],
  "translatedAt": "2025-12-24T10:35:05.195Z"
}