{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 5,
  "verses": [
    {
      "pk": 13005001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 1,
      "text": "The sons of Reuben, the firstborn of Israel—he was the firstborn, but because he defiled his father’s bed, his birthright was given to the sons of Joseph, the son of Israel; so Reuben is not listed in the genealogy according to the firstborn right.",
      "links": "<a href='/AIV/01/35/22'>Gen. 35:22</a>; <a href='/AIV/01/49/3-4'>Gen. 49:3-4</a>; <a href='/AIV/01/48/5'>Gen. 48:5</a>",
      "comment": "Reuben forfeited his privileged position because of immorality (see Gen. 35:22). The right of the firstborn, typically involving leadership and a double portion, was transferred to Joseph's sons. This has typological echoes in the New Testament of those who, despite human weakness, are chosen by God for leadership (see Rom. 9:10-13)."
    },
    {
      "pk": 13005002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 2,
      "text": "For though Judah became strong among his brothers and a chief came from him, the birthright belonged to Joseph.",
      "links": "<a href='/AIV/01/49/8-10'>Gen. 49:8-10</a>; <a href='/AIV/01/48/19-20'>Gen. 48:19-20</a>",
      "comment": "Judah is honored because leadership, and eventually the Messiah (see Matt. 1:1-3; Rev. 5:5), comes from his line. But the privileges of the firstborn were given to Joseph, showing a separation between physical leadership and spiritual blessing—setting a pattern for God's economy of grace over lineage."
    },
    {
      "pk": 13005003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 3,
      "text": "The sons of Reuben, the firstborn of Israel: Hanoch, Pallu, Hezron, and Carmi.",
      "links": "<a href='/AIV/04/26/5'>Num. 26:5-6</a>",
      "comment": "These four sons established the clans of Reuben. Their enumeration occurs frequently in the genealogies of Israel (see Num. 26:5-6; Ex. 6:14)."
    },
    {
      "pk": 13005004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 4,
      "text": "The descendants of Joel: Shemaiah his son, Gog his son, Shimei his son,",
      "links": "",
      "comment": "This genealogy continues to show the importance of tracing lineage and belonging to the people of God—a principle later fulfilled spiritually in belonging to Christ (see Rom. 8:16-17)."
    },
    {
      "pk": 13005005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 5,
      "text": "Micah his son, Reaiah his son, Baal his son,",
      "links": "",
      "comment": "The genealogy here not only preserves family lines but also underlines continuity in the covenant people—a reality heightened by later concepts of spiritual inheritance in Christ (Gal. 3:29)."
    },
    {
      "pk": 13005006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 6,
      "text": "Beerah his son, whom Tiglath-Pileser, king of Assyria, took into exile; he was chief of the Reubenites.",
      "links": "<a href='/AIV/12/15/29'>2 Kings 15:29</a>; <a href='/AIV/23/10/9'>Isa. 10:9</a>",
      "comment": "The exile under Tiglath-Pileser III (c. 734 BC; see 2 Kings 15:29) marks the consequences of unfaithfulness by Israel's tribes. Exile is a central theme in Scripture, later reversed in Christ’s restoration (see Luke 15:17-24)."
    },
    {
      "pk": 13005007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 7,
      "text": "His relatives by their clans, as listed in their genealogies, by the heads of their families: Jeiel the chief, Zechariah,",
      "links": "",
      "comment": "Listing heads of families shows order and unity under authoritative leadership—a model of structure for the people of God."
    },
    {
      "pk": 13005008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 8,
      "text": "and Bela son of Azaz, son of Shema, son of Joel, who lived in Aroer, as far as Nebo and Baal-meon.",
      "links": "<a href='/AIV/04/32/34-38'>Num. 32:34-38</a>",
      "comment": "Aroer, Nebo, and Baal-meon were towns east of the Jordan. Possession of land ties back to the covenant promise to Abraham (Gen. 12:7), fulfilled spiritually through Christ’s inheritance."
    },
    {
      "pk": 13005009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 9,
      "text": "He settled eastward as far as the edge of the wilderness that extends to the Euphrates River, because their livestock had increased in the land of Gilead.",
      "links": "<a href='/AIV/04/32/1'>Num. 32:1</a>",
      "comment": "The Reubenites' possession grew because of God’s provision, a sign of divine blessing connected to the patriarchal promises. The borders given echo the original promise of the land (see Josh. 1:4)."
    },
    {
      "pk": 13005010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 10,
      "text": "In the days of Saul they waged war against the Hagrites, who were defeated at their hand; so they dwelled in their tents throughout the entire region east of Gilead.",
      "links": "<a href='/AIV/19/83/6'>Ps. 83:6</a>",
      "comment": "The conquest over the Hagrites demonstrates how God gives victory to His people when faithful. This prefigures the ultimate deliverance for believers accomplished by Christ (see 1 Cor. 15:57)."
    },
    {
      "pk": 13005011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 11,
      "text": "The sons of Gad lived next to them in the land of Bashan as far as Salekah.",
      "links": "<a href='/AIV/06/13/11-13'>Josh. 13:11-13</a>",
      "comment": "The tribe of Gad shared the Transjordan territory with Reuben and half-Manasseh. The inheritance of land maintained God’s order within the people."
    },
    {
      "pk": 13005012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 12,
      "text": "Joel was the chief, Shapham the second, then Jaanai and Shaphat in Bashan.",
      "links": "",
      "comment": "Leadership among the Gadites is listed—the importance of ordered leadership is carried on throughout God’s people and seen prominently among the apostles (see Acts 6:2-6)."
    },
    {
      "pk": 13005013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 13,
      "text": "Their brothers by their families were Michael, Meshullam, Sheba, Jorai, Jacan, Zia, and Eber, seven in all.",
      "links": "",
      "comment": "The pattern of listing significant family members highlights the communal aspect of God’s people, not only individual faith but corporate identity."
    },
    {
      "pk": 13005014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 14,
      "text": "These were the descendants of Abihail son of Huri, son of Jaroah, son of Gilead, son of Michael, son of Jeshishai, son of Jahdo, son of Buz.",
      "links": "",
      "comment": "Linking generations together signifies the ongoing fulfillment of God’s promise to Abraham’s seed (see Gal. 3:16)."
    },
    {
      "pk": 13005015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 15,
      "text": "Ahi son of Abdiel, son of Guni, was chief of their fathers' families.",
      "links": "",
      "comment": "The title 'chief' or 'head' shows the principle of authority ordained for the good order of the people—an idea echoed in New Testament church oversight (see 1 Tim. 3:1-5)."
    },
    {
      "pk": 13005016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 16,
      "text": "They lived in Gilead, in Bashan, and in its towns, and in all the pasturelands of Sharon to their farthest limits.",
      "links": "<a href='/AIV/06/13/29-31'>Josh. 13:29-31</a>",
      "comment": "Their dwelling places reveal both God's provision and the fulfillment of the gift of land, prefiguring the ultimate inheritance of God's people in the age to come (Heb. 11:10)."
    },
    {
      "pk": 13005017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 17,
      "text": "All these were recorded in the genealogies during the days of Jotham king of Judah and Jeroboam king of Israel.",
      "links": "<a href='/AIV/12/14/23-29'>2 Kings 14:23-29</a>; <a href='/AIV/12/15/32'>2 Kings 15:32</a>",
      "comment": "Genealogical records were vital for Israel’s organization and continuity, reinforcing the importance of remembering God’s work through history."
    },
    {
      "pk": 13005018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 18,
      "text": "The sons of Reuben, Gad, and the half-tribe of Manasseh—men of valor, men ready for war, able to bear shield and sword, to draw the bow, skillful in war—were 44,760, fit for military service.",
      "links": "<a href='/AIV/04/26/7'>Num. 26:7</a>; <a href='/AIV/04/32/25-27'>Num. 32:25-27</a>",
      "comment": "Their military strength is a testament to God’s blessing, but also a warning that reliance must remain on God (see Ps. 33:16-17)."
    },
    {
      "pk": 13005019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 19,
      "text": "They waged war against the Hagrites, Jetur, Naphish, and Nodab.",
      "links": "<a href='/AIV/01/25/15'>Gen. 25:15</a>; <a href='/AIV/19/83/6'>Ps. 83:6</a>",
      "comment": "These groups were descendants of Ishmael (Gen. 25:15; 1 Chr. 1:31), representing those outside the covenant community."
    },
    {
      "pk": 13005020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 20,
      "text": "They received help against them, and the Hagrites and all who were with them were handed over to them; for they cried out to God in the battle, and He answered their prayer, because they trusted in Him.",
      "links": "<a href='/AIV/09/07/8-12'>1 Sam. 7:8-12</a>; <a href='/AIV/19/50/15'>Ps. 50:15</a>",
      "comment": "Victory was not by numbers, but by faith and prayer—consistent with God honoring reliance on Him (see 2 Chr. 20:20-22; Heb. 11:33-34). This foreshadows the primacy of prayer and trust in God's power for the Church."
    },
    {
      "pk": 13005021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 21,
      "text": "They took away their livestock: fifty thousand camels, two hundred fifty thousand sheep, two thousand donkeys, and one hundred thousand persons.",
      "links": "",
      "comment": "The vastness of the spoils signifies the blessing upon obedience, but also hints at God's justice upon the faithless (see Deut. 28:1-14, 15-68)."
    },
    {
      "pk": 13005022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 22,
      "text": "Many fell slain, because the conflict was from God. And they lived in their place until the exile.",
      "links": "<a href='/AIV/23/10/6'>Isa. 10:6</a>",
      "comment": "The narrator explicitly attributes judgment and victory to God. The ultimate exile, foretold here, is a consequence of corporate sin—a theme binding the Old and New Testaments and which underscores the necessity of faithfulness to God's covenant."
    },
    {
      "pk": 13005023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 23,
      "text": "The half-tribe of Manasseh lived in the land from Bashan to Baal-hermon, Senir, and Mount Hermon, and they multiplied greatly.",
      "links": "<a href='/AIV/06/13/29-31'>Josh. 13:29-31</a>",
      "comment": "Their multiplication recalls God's command to ‘be fruitful and multiply’ (Gen. 1:28), a sign of blessing tied to obedience."
    },
    {
      "pk": 13005024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 24,
      "text": "Their heads of fathers’ houses were Epher, Ishi, Eliel, Azriel, Jeremiah, Hodaviah, and Jahdiel, mighty men of valor, famous men, heads of their fathers’ houses.",
      "links": "",
      "comment": "Those listed here are honored not solely for might but also for faithfulness and leadership, prefiguring the apostolic foundation of the Church."
    },
    {
      "pk": 13005025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 25,
      "text": "But they were unfaithful to the God of their fathers and played the prostitute after the gods of the peoples of the land, whom God had destroyed before them.",
      "links": "<a href='/AIV/02/34/15-16'>Ex. 34:15-16</a>; <a href='/AIV/07/02/17'>Judg. 2:17</a>",
      "comment": "Unfaithfulness is likened to spiritual adultery (see Jer. 3:6-9; James 4:4). The people forsook the exclusive worship of the one true God—a warning repeated throughout Scripture and a call to undivided devotion."
    },
    {
      "pk": 13005026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 5,
      "verse": 26,
      "text": "So the God of Israel stirred up the spirit of Pul king of Assyria (that is, Tiglath-Pileser king of Assyria), and he carried the Reubenites, Gadites, and the half-tribe of Manasseh into exile. He brought them to Halah, Habor, Hara, and the river of Gozan—there they remain to this day.",
      "links": "<a href='/AIV/12/15/29'>2 Kings 15:29</a>; <a href='/AIV/23/10/6'>Isa. 10:6</a>",
      "comment": "God sovereignly uses nations for judgment. The exile emphasizes both God’s justice and the hope of eventual restoration—a theme fulfilled in Christ, who brings the true return and gathering of God’s people (see Luke 1:68-75; Eph. 2:13-19)."
    }
  ],
  "translatedAt": "2025-12-24T04:06:49.056Z"
}