{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 19,
  "verses": [
    {
      "pk": 13019001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 1,
      "text": "Some time later, Nahash the king of the Ammonites died, and his son became king in his place.",
      "links": "<a href='/AIV/10/10/2'>2 Sam. 10:2</a>",
      "comment": "This opening sets the political context for the chapter, highlighting the transition of power. The relationship between David and Nahash is remembered for kindness—a recurring biblical theme of honoring covenant and loyalty."
    },
    {
      "pk": 13019002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 2,
      "text": "David said, 'I will show kindness to Hanun son of Nahash, just as his father showed kindness to me.' So David sent messengers to comfort him concerning his father. When David’s servants arrived in the land of the Ammonites to comfort Hanun,",
      "links": "<a href='/AIV/10/10/2'>2 Sam. 10:2</a>; <a href='/AIV/09/20/14'>1 Sam. 20:14</a>",
      "comment": "Showing comfort and mercy to rivals reflects a Christlike pattern of mercy, anticipating the way Christ offers consolation and peace even to those who seem distant or opposed."
    },
    {
      "pk": 13019003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 3,
      "text": "the officials of the Ammonites said to Hanun, 'Do you think David is really honoring your father by sending men to comfort you? Aren’t his servants coming to explore the land and spy it out, so they can overthrow it?'",
      "links": "<a href='/AIV/01/42/9'>Gen. 42:9</a>; <a href='/AIV/04/13/32'>Num. 13:32</a>",
      "comment": "Suspicion and cynicism arise even in acts of apparent goodness. This echoes humanity's frequent misunderstanding of divine intentions—just as Christ's true mission was misunderstood by His rivals."
    },
    {
      "pk": 13019004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 4,
      "text": "So Hanun seized David’s servants, shaved them, cut off their garments at the hips, and sent them away.",
      "links": "<a href='/AIV/10/10/4'>2 Sam. 10:4</a>; <a href='/AIV/03/19/27'>Lev. 19:27</a>",
      "comment": "Shaving and humiliating David's messengers was a severe insult—public shame often represented deeper spiritual rejection. Compare with the shame suffered by Christ before His crucifixion (<a href='/AIV/40/27/28-30'>Matt. 27:28-30</a>)."
    },
    {
      "pk": 13019005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 5,
      "text": "When they returned, the men were greatly ashamed. David heard about this and sent messengers to meet them, because the men were deeply humiliated. The king said, 'Stay at Jericho until your beards have grown, and then come back.'",
      "links": "<a href='/AIV/06/06/25'>Josh. 6:25</a>; <a href='/AIV/10/10/5'>2 Sam. 10:5</a>",
      "comment": "David's compassion for his servants underscores the shepherd-like care often associated with Christ (see <a href='/AIV/43/10/11'>John 10:11</a>). Restoration and waiting relate to the process of healing after disgrace."
    },
    {
      "pk": 13019006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 6,
      "text": "When the people of Ammon realized they had made themselves offensive to David, Hanun and the Ammonites sent a thousand talents of silver to hire chariots and horsemen from Aram Naharaim, Aram Maacah, and Zobah.",
      "links": "<a href='/AIV/10/10/6'>2 Sam. 10:6</a>; <a href='/AIV/11/10/29'>1 Kgs. 10:29</a>",
      "comment": "Attempting to buy military support reflects a trust in worldly power rather than God's providence. Spiritual warfare calls for reliance on heavenly, not earthly, strength (<a href='/AIV/49/6/12'>Eph. 6:12</a>)."
    },
    {
      "pk": 13019007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 7,
      "text": "They hired thirty-two thousand chariots, as well as the king of Maacah and his army, who came and camped near Medeba. The Ammonites drew up their forces from their own towns and marched out to battle.",
      "links": "<a href='/AIV/10/10/6'>2 Sam. 10:6</a>; <a href='/AIV/06/13/9'>Josh. 13:9</a>",
      "comment": "The preparation for battle stresses the gravity of conflict. Numbers and alliances can seem impressive, but throughout Scripture, victory truly comes when aligned with God's will (<a href='/AIV/09/17/45-47'>1 Sam. 17:45-47</a>)."
    },
    {
      "pk": 13019008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 8,
      "text": "When David heard this, he sent Joab and all the army of mighty men.",
      "links": "<a href='/AIV/10/10/7'>2 Sam. 10:7</a>",
      "comment": "David's strategic deployment of his best warriors parallels the New Testament call to readiness for spiritual battle (<a href='/AIV/46/16/13'>1 Cor. 16:13</a>). The 'mighty men' model the value of faithful, virtuous followers."
    },
    {
      "pk": 13019009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 9,
      "text": "The Ammonites came out and drew up in battle formation at the entrance of the city, while the kings who had come were drawn up in the field apart.",
      "links": "<a href='/AIV/10/10/8'>2 Sam. 10:8</a>",
      "comment": "The separation of forces emphasizes the threat from multiple fronts—a reminder of the adversities the Church faces from various sources and the necessity of unity."
    },
    {
      "pk": 13019010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 10,
      "text": "Joab saw that the battle lines were both in front of him and behind him. So he chose some from the best troops of Israel and put them in formation against the Arameans.",
      "links": "<a href='/AIV/10/10/9'>2 Sam. 10:9</a>; <a href='/AIV/09/14/47'>1 Sam. 14:47</a>",
      "comment": "Joab’s strategy recalls wise leadership, prudent division of labor, and the critical role of choosing the best to defend essential interests—parallels with apostolic leadership and collective discernment."
    },
    {
      "pk": 13019011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 11,
      "text": "The rest of the army he put under the command of Abishai his brother, and they were to stand against the Ammonites.",
      "links": "<a href='/AIV/10/10/10'>2 Sam. 10:10</a>",
      "comment": "Joab and Abishai, working together, mirror the cooperative leadership found among the apostles and early church leaders, emphasizing teamwork and shared responsibility for God’s people (<a href='/AIV/44/6/2-6'>Acts 6:2-6</a>)."
    },
    {
      "pk": 13019012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 12,
      "text": "And he said, 'If the Arameans are too strong for me, then you will help me; but if the Ammonites are too strong for you, I will help you. Be strong and let us show courage for our people and for the cities of our God. The Lord will do what is good in His sight.'",
      "links": "<a href='/AIV/10/10/11-12'>2 Sam. 10:11-12</a>; <a href='/AIV/06/01/9'>Josh. 1:9</a>; <a href='/AIV/19/31/24'>Ps. 31:24</a>",
      "comment": "Joab’s speech expresses faith, mutual support, and trust in God’s sovereignty. The call to courageous service and reliance on divine providence is echoed in the New Testament mission (<a href='/AIV/45/8/28'>Rom. 8:28</a>)."
    },
    {
      "pk": 13019013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 13,
      "text": "So Joab and the people with him advanced against the Arameans for battle, and the Arameans fled before him.",
      "links": "<a href='/AIV/10/10/13'>2 Sam. 10:13</a>; <a href='/AIV/02/14/25'>Ex. 14:25</a>",
      "comment": "The enemy’s retreat echoes the biblical promise that when God’s people stand firm, adversaries cannot withstand them—reflecting the confidence and courage that come from faith."
    },
    {
      "pk": 13019014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 14,
      "text": "When the Ammonites saw that the Arameans had fled, they also fled from Abishai and entered the city. Then Joab returned from fighting the Ammonites and came to Jerusalem.",
      "links": "<a href='/AIV/10/10/14'>2 Sam. 10:14</a>",
      "comment": "Victory is achieved not solely from human strength, but through God-directed action. The return to Jerusalem hints at restoration and fulfillment, echoing Christ’s own entry and triumph in Jerusalem (<a href='/AIV/40/21/9-11'>Matt. 21:9-11</a>)."
    },
    {
      "pk": 13019015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 15,
      "text": "When the Arameans saw that they had been defeated by Israel, they sent messengers and brought out the Arameans who were beyond the river, with Shophach the commander of Hadadezer’s army leading them.",
      "links": "<a href='/AIV/10/10/15-16'>2 Sam. 10:15-16</a>; <a href='/AIV/06/24/2'>Josh. 24:2</a>",
      "comment": "Persistent opposition shows that evil often regroups and resists, but God’s people are called to perseverance. Leadership like Shophach’s witnesses to the importance of authority and hierarchy in spiritual and practical matters."
    },
    {
      "pk": 13019016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 16,
      "text": "When David was told about it, he gathered all Israel, crossed the Jordan, and came against them. He drew up in battle formation against them.",
      "links": "<a href='/AIV/10/10/17'>2 Sam. 10:17</a>; <a href='/AIV/07/03/28'>Judg. 3:28</a>",
      "comment": "David’s role as leader of all Israel reflects his position as a shepherd and protector. Crossing the Jordan has deep spiritual symbolism—transcending boundaries and entering into promised fulfillment (see <a href='/AIV/06/04/23'>Josh. 4:23</a>)."
    },
    {
      "pk": 13019017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 17,
      "text": "David lined up his army against the Arameans, and they fought him. The Arameans fled before Israel, and David killed seven thousand Aramean chariot drivers and forty thousand foot soldiers. He also killed Shophach, the commander of the army.",
      "links": "<a href='/AIV/10/10/18'>2 Sam. 10:18</a>; <a href='/AIV/09/18/7'>1 Sam. 18:7</a>",
      "comment": "The scale of victory attributed to David points to the blessings poured out when God’s anointed leads the faithful—a theme fulfilled in the New Testament by the victorious kingship of Christ."
    },
    {
      "pk": 13019018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 18,
      "text": "When the servants of Hadadezer saw they were defeated by Israel, they made peace with David and became subject to him. The Arameans were no longer willing to help the Ammonites.",
      "links": "<a href='/AIV/19/110/1-2'>Ps. 110:1-2</a>; <a href='/AIV/10/8/6'>2 Sam. 8:6</a>",
      "comment": "Peace and submission to God's chosen king is a recurring biblical theme, prefiguring the submission of all creation to Christ’s reign (see <a href='/AIV/46/15/28'>1 Cor. 15:28</a>). Note also the establishment of lasting order and hierarchy."
    },
    {
      "pk": 13019019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 19,
      "verse": 19,
      "text": "So when all the kings who were servants of Hadadezer saw that they were defeated by Israel, they made peace with David and became subject to him. After that, the Arameans were not willing to help the people of Ammon anymore.",
      "links": "<a href='/AIV/10/10/19'>2 Sam. 10:19</a>; <a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>",
      "comment": "The chapter closes with global submission to God’s anointed king—a motif developed throughout salvation history, foreshadowing the universal reign of Christ as the ultimate fulfillment of the Scriptures."
    }
  ],
  "translatedAt": "2025-12-24T04:15:41.725Z"
}