{
  "book": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 28,
  "verses": [
    {
      "pk": 2802801,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 1,
      "text": "David assembled all the leaders of Israel—the commanders of the tribes, the officers in charge of the divisions that served the king, the commanders of thousands and hundreds, the officials in charge of all the property and livestock belonging to the king and his sons, together with the palace officials, mighty men, and all the warriors.",
      "links": "<a href='/AIV/14/23/2'>1 Chr. 23:2</a>; <a href='/AIV/10/8/15'>2 Sam. 8:15–18</a>",
      "comment": "Expanded description of the gathered leaders is clarified for modern readers."
    },
    {
      "pk": 2802802,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 2,
      "text": "Then King David stood and said: 'Listen to me, my brothers and my people. I had it in my heart to build a house as a place for the Ark of the Covenant of the LORD and for the footstool of our God, and I made preparations to build it.'",
      "links": "<a href='/AIV/11/8/13'>1 Kgs. 8:13</a>; <a href='/AIV/19/132/7'>Ps. 132:7</a>",
      "comment": "‘Footstool of our God’ maintains wording from MT and LXX. ‘Had it in my heart’ modernizes ‘with my heart.’"
    },
    {
      "pk": 2802803,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 3,
      "text": "But God said to me, “You will not build a house for My name, because you are a man of war and have shed blood.”",
      "links": "<a href='/AIV/13/22/8'>1 Chr. 22:8</a>",
      "comment": "‘You are a man of war and have shed blood’ is faithful to the original reason given in Hebrew."
    },
    {
      "pk": 2802804,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 4,
      "text": "Yet the LORD, the God of Israel, chose me from all my father’s house to be king over Israel forever. He chose Judah as leader, and from the house of Judah, my father's house; among my father's sons, he took pleasure in making me king over all Israel.",
      "links": "<a href='/AIV/09/16/1'>1 Sam. 16:1</a>; <a href='/AIV/10/7/8'>2 Sam. 7:8–16</a>",
      "comment": "‘He took pleasure in making me king’ follows Hebrew, expressing God’s delight in David."
    },
    {
      "pk": 2802805,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 5,
      "text": "And of all my sons—for the LORD has given me many sons—He has chosen my son Solomon to sit on the throne of the kingdom of the LORD over Israel.",
      "links": "<a href='/AIV/13/23/1'>1 Chr. 23:1</a>; <a href='/AIV/10/12/24'>2 Sam. 12:24–25</a>",
      "comment": "‘Many sons’ clarifies the phrase’s meaning. ‘Kingdom of the LORD’ echoes original Hebrew."
    },
    {
      "pk": 2802806,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 6,
      "text": "He said to me, ‘Your son Solomon is the one who will build My house and My courts, for I have chosen him to be My son, and I will be his father.’",
      "links": "<a href='/AIV/13/17/11'>1 Chr. 17:11–14</a>",
      "comment": "Direct quote from God; ‘My house and My courts’ reflects temple and its precincts."
    },
    {
      "pk": 2802807,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 7,
      "text": "I will establish his kingdom forever if he remains firm in keeping My commandments and My statutes, as he does today.’",
      "links": "<a href='/AIV/13/17/12'>1 Chr. 17:12</a>; <a href='/AIV/10/7/13'>2 Sam. 7:13–16</a>",
      "comment": "‘Remains firm’ is modern for ‘be constant’ or ‘steadfast.’"
    },
    {
      "pk": 2802808,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 8,
      "text": "Now therefore, in the sight of all Israel, the assembly of the LORD, and in the hearing of our God, pursue and keep all the commandments of the LORD your God, so that you may possess this good land and leave it as an inheritance to your descendants forever.",
      "links": "<a href='/AIV/05/4/1'>Deut. 4:1</a>; <a href='/AIV/13/22/13'>1 Chr. 22:13</a>",
      "comment": "‘Pursue and keep’ uses active language to capture original imperative."
    },
    {
      "pk": 2802809,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 9,
      "text": "And you, Solomon my son, know the God of your father and serve Him with a devoted heart and a willing mind. For the LORD searches all hearts and understands every thought and intention. If you seek Him, He will be found by you; but if you forsake Him, He will reject you forever.",
      "links": "<a href='/AIV/09/16/7'>1 Sam. 16:7</a>; <a href='/AIV/05/4/29'>Deut. 4:29–31</a>",
      "comment": "‘Devoted heart and a willing mind’ updated for modern language, faithful to ‘perfect heart and willing mind.’"
    },
    {
      "pk": 2802810,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 10,
      "text": "Consider now, for the LORD has chosen you to build a house for the sanctuary; be strong and do it.",
      "links": "<a href='/AIV/13/22/16'>1 Chr. 22:16</a>",
      "comment": "‘Be strong and do it’ retains original Hebrew imperative."
    },
    {
      "pk": 2802811,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 11,
      "text": "Then David gave Solomon his son the design for the vestibule and its buildings, the storerooms, the upper rooms, the inner rooms, and the place of the mercy seat.",
      "links": "<a href='/AIV/13/28/19'>1 Chr. 28:19</a>; <a href='/AIV/02/25/17'>Ex. 25:17–22</a>",
      "comment": "‘Design’ is from Hebrew ‘tavnit’; ‘mercy seat’ for ‘cover of the Ark.’"
    },
    {
      "pk": 2802812,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 12,
      "text": "And the plan for all that he had by the Spirit, for the courts of the house of the LORD, all the surrounding rooms, the treasuries of the house of God, and the treasuries for dedicated gifts;",
      "links": "<a href='/AIV/02/31/3'>Ex. 31:3</a>",
      "comment": "‘Plan...by the Spirit’ notes Hebrew ‘ruach.’ ‘Dedicated gifts’ updates ‘holy items.’"
    },
    {
      "pk": 2802813,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 13,
      "text": "for the divisions of the priests and the Levites, for all the work of service of the house of the LORD, and for all the vessels used in the service of the house of the LORD;",
      "links": "<a href='/AIV/13/24/1'>1 Chr. 24:1–6</a>; <a href='/AIV/04/3/6'>Num. 3:6–9</a>",
      "comment": "‘Vessels used in the service’ renders Hebrew ‘vessels of service.’"
    },
    {
      "pk": 2802814,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 14,
      "text": "He gave gold by weight for things made of gold, for all the items of every kind of service; silver by weight for things made of silver, for all items of every kind of service;",
      "links": "<a href='/AIV/02/25/39'>Ex. 25:39–40</a>",
      "comment": "‘By weight’ preserves the detail about exact measurement."
    },
    {
      "pk": 2802815,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 15,
      "text": "and the weight for the golden lampstands and their lamps, gold by weight for each lampstand and its lamps; and for the silver lampstands and their lamps, by weight for each lampstand and its lamps, according to the use of each lampstand;",
      "links": "<a href='/AIV/02/25/31'>Ex. 25:31–40</a>",
      "comment": "Expanded for clarity; ‘according to the use’ reflects Hebrew."
    },
    {
      "pk": 2802816,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 16,
      "text": "and the weight of the gold for each table for the bread of the presence; and the weight of silver for the silver tables;",
      "links": "<a href='/AIV/02/25/23'>Ex. 25:23–30</a>",
      "comment": "‘Bread of the presence’ is faithful rendering of Hebrew ‘lechem panim.’"
    },
    {
      "pk": 2802817,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 17,
      "text": "and the pure gold for the forks, basins, pitchers, and cups; and the weight for each gold dish; and the weight for each silver dish;",
      "links": "<a href='/AIV/04/7/13'>Num. 7:13–14</a>",
      "comment": "‘Forks, basins, pitchers, and cups’ updates the list for clarity."
    },
    {
      "pk": 2802818,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 18,
      "text": "and the weight for the altar of incense made of refined gold; and the plan for the chariot, that is, the cherubim that spread out their wings and cover the Ark of the Covenant of the LORD.",
      "links": "<a href='/AIV/02/25/18'>Ex. 25:18–22</a>; <a href='/AIV/11/6/23'>1 Kgs 6:23–30</a>",
      "comment": "‘Plan for the chariot, that is, the cherubim’ makes the metaphor clear."
    },
    {
      "pk": 2802819,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 19,
      "text": "All this, David said, 'the LORD made clear to me in writing, by His hand upon me, all the details of the plan.'",
      "links": "<a href='/AIV/02/25/40'>Ex. 25:40</a>",
      "comment": "‘Made clear to me in writing’ modernizes ‘made me understand in writing.’"
    },
    {
      "pk": 2802820,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 20,
      "text": "David said to Solomon his son, 'Be strong and courageous, and do it. Do not be afraid or discouraged, for the LORD God, my God, is with you. He will not leave you or abandon you, until all the work for the service of the house of the LORD is finished.'",
      "links": "<a href='/AIV/06/1/5'>Josh. 1:5–9</a>; <a href='/AIV/13/22/13'>1 Chr. 22:13'</a>",
      "comment": "Phrase ‘strong and courageous’ uses OT formula; ‘will not leave you or abandon you’ echoes Deut. 31:6."
    },
    {
      "pk": 2802821,
      "translation": "AIV",
      "book": 13,
      "chapter": 28,
      "verse": 21,
      "text": "'And here are the divisions of the priests and Levites for all the service of the house of God, and every willing man skilled in any work will be with you for all the service; both the leaders and all the people will be at your command.'",
      "links": "<a href='/AIV/13/23/4'>1 Chr. 23:4–5</a>",
      "comment": "‘Every willing man skilled in any work’ expands Hebrew idiom; last sentence is a more readable rendering."
    }
  ],
  "translatedAt": "2025-12-22T10:57:58.406Z"
}