{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 26,
  "verses": [
    {
      "pk": 13026001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 1,
      "text": "The divisions of the gatekeepers: of the Korahites, Meshelemiah son of Kore, from the descendants of Asaph.",
      "links": "<a href='/AIV/13/9/19'>1Chr 9:19</a>; <a href='/AIV/4/26/1'>Num 26:1</a>",
      "comment": "Gatekeepers held a sacred role, protecting the entry to God's house. Their service foreshadows the role of leaders safeguarding doctrinal purity and reverence (see Acts 20:28)."
    },
    {
      "pk": 13026002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 2,
      "text": "Meshelemiah’s sons: Zechariah the firstborn, Jediael the second, Zebadiah the third, Jathniel the fourth,",
      "links": "<a href='/AIV/13/23/6'>1Chr 23:6</a>",
      "comment": "The detailed listing of sons establishes order and hereditary office. This practice of tradition underscores how faith is meant to be passed down generation to generation (Deut 6:7)."
    },
    {
      "pk": 13026003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 3,
      "text": "Elam the fifth, Jehohanan the sixth, Eliehoenai the seventh.",
      "links": "<a href='/AIV/13/9/21'>1Chr 9:21</a>",
      "comment": "The household's completeness—seven sons—symbolizes fullness and perfection (cf. Genesis 2:2; Rev 1:4)."
    },
    {
      "pk": 13026004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 4,
      "text": "Obed-edom also had sons: Shemaiah the firstborn, Jehozabad the second, Joah the third, Sacar the fourth, Nethanel the fifth,",
      "links": "<a href='/AIV/13/15/18'>1Chr 15:18</a>",
      "comment": "Obed-edom’s service (1Chr 13:14) brought blessing to his household, which emphasizes the overflow of grace when one dedicates their house to God's service."
    },
    {
      "pk": 13026005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 5,
      "text": "Ammiel the sixth, Issachar the seventh, Peullethai the eighth. For God had blessed Obed-edom.",
      "links": "<a href='/AIV/13/13/14'>1Chr 13:14</a>",
      "comment": "God's blessing is tied to faithful service. The abundance of children is seen as a reward for faithfulness (Ps 127:3-5)."
    },
    {
      "pk": 13026006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 6,
      "text": "To his son Shemaiah were born sons who were leaders of their father's house, for they were strong men of ability.",
      "links": "<a href='/AIV/13/26/8'>1Chr 26:8</a>",
      "comment": "Leadership qualities are noted as gifts given from God, necessary for guiding the congregation (cf. 1 Tim 3:1-7)."
    },
    {
      "pk": 13026007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 7,
      "text": "The sons of Shemaiah: Othni, Rephael, Obed, Elzabad; his brothers were able men, Elihu and Semachiah.",
      "links": "<a href='/AIV/13/9/21'>1Chr 9:21</a>;",
      "comment": "The term 'able men' shows the importance of spiritual and practical readiness for the service of God."
    },
    {
      "pk": 13026008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 8,
      "text": "All these were the sons of Obed-edom. They and their sons and their relatives were able men, strong for service—sixty-two descendants of Obed-edom.",
      "links": "<a href='/AIV/13/15/18'>1Chr 15:18</a>",
      "comment": "The multiplication of servant-leaders highlights God’s intention for a visible, organized household of faith, not a scattered or formless community."
    },
    {
      "pk": 13026009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 9,
      "text": "Meshelemiah had sons and relatives, eighteen able men.",
      "links": "<a href='/AIV/13/26/2'>1Chr 26:2</a>",
      "comment": "Eighteen, a number representing 'life' in Hebrew culture, given to the gatekeepers—those who protect the entry to worship."
    },
    {
      "pk": 13026010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 10,
      "text": "Hosah, of the Merarites, had sons: Shimri the chief (though he was not the firstborn, his father made him chief),",
      "links": "<a href='/AIV/13/16/38'>1Chr 16:38</a>",
      "comment": "Leadership was sometimes assigned by merit rather than birth order—a foretaste of the Gospel teaching that God chooses by calling, not by external qualifications (1 Cor 1:27)."
    },
    {
      "pk": 13026011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 11,
      "text": "Hilkiah the second, Tebaliah the third, Zechariah the fourth. All the sons and relatives of Hosah were thirteen.",
      "links": "<a href='/AIV/13/9/18'>1Chr 9:18</a>",
      "comment": "The number thirteen may seem unusual; but it signifies a holy calling despite the association with imperfection, again pointing to grace over strict lineage."
    },
    {
      "pk": 13026012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 12,
      "text": "These divisions of gatekeepers, through their leaders, had duties for serving in the house of the LORD, just as their relatives",
      "links": "<a href='/AIV/13/23/28'>1Chr 23:28</a>",
      "comment": "Gatekeepers' ministries were established through clear order—a sign of God’s desire for visible structure, reflective of Christ organizing his community with apostles (Matt 16:18-19; John 20:21-23)."
    },
    {
      "pk": 13026013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 13,
      "text": "Each group, large and small alike, cast lots for their gate, according to their fathers’ houses.",
      "links": "<a href='/AIV/4/26/55'>Num 26:55</a>",
      "comment": "Casting lots shows God’s sovereignty in appointing roles (Prov 16:33), and was later used even by the apostles to select Matthias (Acts 1:26)—indicating trust in God's leading through visible means."
    },
    {
      "pk": 13026014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 14,
      "text": "The lot for the east gate fell to Shelemiah. Then for his son Zechariah, a wise counselor, when casting lots, they assigned the north gate.",
      "links": "<a href='/AIV/13/26/2'>1Chr 26:2</a>",
      "comment": "Designating gates to wise counselors is another symbol of instruction—wisdom is needed to guard the place of worship (cf. Prov 2:6-8; James 1:5)."
    },
    {
      "pk": 13026015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 15,
      "text": "For Obed-edom, the lot fell to the south gate; for his sons, the storehouse.",
      "links": "<a href='/AIV/13/26/4-8'>1Chr 26:4-8</a>",
      "comment": "The storehouse represents not only material provisions but a spiritual treasury, prefiguring Christ's call to store up treasures in heaven (Matt 6:20)."
    },
    {
      "pk": 13026016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 16,
      "text": "For Shuppim and Hosah, the lot fell to the west gate, with Shallecheth Gate on the ascending highway. Each had their appointed daily duties.",
      "links": "<a href='/AIV/13/9/19'>1Chr 9:19</a>",
      "comment": "Each section of the Temple had specific oversight, mirroring the order maintained in apostolic times in organizing church life (1 Cor 12:28)."
    },
    {
      "pk": 13026017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 17,
      "text": "On the east, six Levites each day; on the north, four each day; on the south, four each day; at the storehouse, two each day;",
      "links": "<a href='/AIV/13/23/32'>1Chr 23:32</a>",
      "comment": "Vigilance and order—symbolized by assigned numbers—convey God’s desire for continual, regulated worship."
    },
    {
      "pk": 13026018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 18,
      "text": "at the court to the west, four at the highway and two at the court itself.",
      "links": "<a href='/AIV/13/26/16'>1Chr 26:16</a>",
      "comment": "Even lesser courts had their keepers, showing all parts of the sanctuary, great and small, are worthy of reverence and order."
    },
    {
      "pk": 13026019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 19,
      "text": "These were the divisions of the gatekeepers among the sons of the Korahites and the Merarites.",
      "links": "<a href='/AIV/13/9/19'>1Chr 9:19</a>",
      "comment": "Gatekeeping carries a priestly tone, symbolic of Christ as the 'Door' to the Father (John 10:7), and of the perpetual oversight He gives to His Church."
    },
    {
      "pk": 13026020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 20,
      "text": "Of the Levites, Ahijah was over the treasuries of the house of God and the treasuries of the dedicated gifts.",
      "links": "<a href='/AIV/13/26/22'>1Chr 26:22</a>",
      "comment": "Treasury keepers foreshadow the sacramental stewardship of spiritual goods, a visible sacramental order (cf. Matt 16:19; 2 Tim 2:2)."
    },
    {
      "pk": 13026021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 21,
      "text": "The sons of Ladan, sons of the Gershonites through Ladan, the heads of the fathers' houses belonging to Ladan the Gershonite: Jehieli,",
      "links": "<a href='/AIV/13/6/17'>1Chr 6:17</a>",
      "comment": "Genealogical lines document succession, anticipating the doctrine of passing on ministry from one generation to the next (cf. Acts 1:20-26)."
    },
    {
      "pk": 13026022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 22,
      "text": "The sons of Jehieli: Zetham and his brother Joel were over the treasuries of the house of the LORD.",
      "links": "<a href='/AIV/13/26/20'>1Chr 26:20</a>",
      "comment": "Continuity and shared stewardship of worship's treasures echoes the idea that spiritual riches are not just individual but communal and visible."
    },
    {
      "pk": 13026023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 23,
      "text": "Of the Amramites, the Izharites, the Hebronites and the Uzzielites:",
      "links": "<a href='/AIV/2/6/18'>Exod 6:18-22</a>",
      "comment": "Tribal divisions point to God’s deliberate ordering of priestly offices—every tribe and role set apart."
    },
    {
      "pk": 13026024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 24,
      "text": "Shebuel, a descendant of Gershom, the son of Moses, was ruler over the treasuries.",
      "links": "<a href='/AIV/2/2/22'>Exod 2:22</a>",
      "comment": "Moses’ descendants passed on stewardship roles, prefiguring both priestly and spiritual inheritance through orderly succession."
    },
    {
      "pk": 13026025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 25,
      "text": "His relatives, through Eliezer: Rehabiah his son, Jeshaiah his son, Joram his son, Zichri his son, and Shelomoth his son.",
      "links": "<a href='/AIV/13/23/15-17'>1Chr 23:15-17</a>",
      "comment": "This genealogy emphasizes the preservation and continuity of leadership, which stands as a model for spiritual governance."
    },
    {
      "pk": 13026026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 26,
      "text": "This Shelomoth and his relatives were over all the treasuries of the dedicated gifts, which King David, the heads of the fathers’ houses, the commanders of thousands and of hundreds, and the army commanders had dedicated.",
      "links": "<a href='/AIV/13/18/11'>1Chr 18:11</a>",
      "comment": "The dedication of gifts by all leaders, civil and religious, suggests the inseparability of worship and the community’s real life—a vision Christ fulfills in uniting spiritual and earthly concerns."
    },
    {
      "pk": 13026027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 27,
      "text": "They dedicated some of the plunder won in battle to maintain the house of the LORD.",
      "links": "<a href='/AIV/13/26/26'>1Chr 26:26</a>",
      "comment": "Material resources from military success sustained worship, implying that all aspects of life—including victory—are consecrated for God's glory (1 Cor 10:31)."
    },
    {
      "pk": 13026028,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 28,
      "text": "Everything Samuel the seer, Saul the son of Kish, Abner son of Ner, Joab son of Zeruiah had dedicated, and anyone else who dedicated anything—it was under the supervision of Shelomoth and his relatives.",
      "links": "<a href='/AIV/9/9/21'>1Sam 9:21</a>",
      "comment": "Both priests and kings contribute to the Lord's house, showing how worship belongs to the whole people as a visible community, not just to isolated leaders."
    },
    {
      "pk": 13026029,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 29,
      "text": "From the Izharites: Chenaniah and his sons were assigned duties outside the house of God, as officers and judges.",
      "links": "<a href='/AIV/13/15/22'>1Chr 15:22</a>",
      "comment": "This distribution of judges indicates the integration of faith and civil order, a calling to administer justice rooted in God's law."
    },
    {
      "pk": 13026030,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 30,
      "text": "Of the Hebronites: Hashabiah and his relatives, seventeen hundred able men, were in charge of all the affairs of the LORD and the king's service west of the Jordan.",
      "links": "<a href='/AIV/13/23/19'>1Chr 23:19</a>",
      "comment": "Serving both God and king prefigures the dual citizenship of believers, with responsibilities in the visible church and the world (cf. Phil 3:20)."
    },
    {
      "pk": 13026031,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 31,
      "text": "Jerijah was chief of the Hebronites. In the fortieth year of David's reign, a search was made according to genealogy, and fathers' houses among the Hebronites were found to have mighty men at Jazer of Gilead.",
      "links": "<a href='/AIV/13/29/27'>1Chr 29:27</a>",
      "comment": "Genealogical order emphasized unity, continuity, and strength, a visible bond for members throughout the Lord’s people."
    },
    {
      "pk": 13026032,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 26,
      "verse": 32,
      "text": "His relatives, capable men—two thousand seven hundred heads of fathers' houses—were placed by King David over the Reubenites, the Gadites, and the half-tribe of Manasseh, for every matter of God and the affairs of the king.",
      "links": "<a href='/AIV/13/12/31'>1Chr 12:31</a>",
      "comment": "Oversight entrusted to capable leaders displays the biblical principle that God appoints shepherds for his people (Jer 3:15; Acts 20:28), with visible unity and guidance for the entire people."
    }
  ],
  "translatedAt": "2025-12-24T04:19:36.292Z"
}