{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 27,
  "verses": [
    {
      "pk": 13027001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 1,
      "text": "These are the leaders of the Israelites, the heads of families, the commanders of thousands and of hundreds, and their officers who served the king in all matters of the divisions that rotated each month throughout the year, each division having twenty-four thousand.",
      "links": "<a href='/AIV/09/10/19'>1 Sam 10:19</a>; <a href='/AIV/13/23/1-2'>1 Chr 23:1-2</a>",
      "comment": "This section details the military organization during David's reign, reflecting order and structure, which points forward to the orderliness of leadership in the New Testament church (see Acts 6:1-6)."
    },
    {
      "pk": 13027002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 2,
      "text": "Over the first division for the first month was Jashobeam the son of Zabdiel. There were twenty-four thousand in his division.",
      "links": "<a href='/AIV/10/23/8'>2 Sam 23:8</a>",
      "comment": "Jashobeam was among David's mighty men. The monthly rotation hints at continual service, prefiguring the unceasing spiritual ministry of the church (cf. Rev 7:15)."
    },
    {
      "pk": 13027003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 3,
      "text": "He was a descendant of Perez and chief of all the commanders for the first month.",
      "links": "<a href='/AIV/01/38/29'>Gen 38:29</a>",
      "comment": "The mention of Perez is a reminder of God's sovereignty over the generations and His faithfulness to the promises to Judah (cf. Gen 49:10; Matt 1:3)."
    },
    {
      "pk": 13027004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 4,
      "text": "The division for the second month was led by Dodai the Ahohite, and of his division was Mikloth the chief officer. There were twenty-four thousand in his division.",
      "links": "<a href='/AIV/10/23/9'>2 Sam 23:9</a>",
      "comment": "Each tribal group is accounted for, showing collective participation in Israel's life, a principle later reflected in the New Testament's idea of the body of believers (1 Cor 12:14-27)."
    },
    {
      "pk": 13027005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 5,
      "text": "The third commander, for the third month, was Benaiah son of Jehoiada the priest, as chief. In his division were twenty-four thousand.",
      "links": "<a href='/AIV/10/23/20'>2 Sam 23:20</a>",
      "comment": "Benaiah’s connection to the priesthood suggests a blending of religious and civic leadership, anticipating later church traditions of spiritual leaders involved in governance."
    },
    {
      "pk": 13027006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 6,
      "text": "This was the Benaiah who was one of the Thirty, and leader over the Thirty. Ammizabad his son was in charge of his division.",
      "links": "<a href='/AIV/13/11/24-25'>1 Chr 11:24-25</a>",
      "comment": "Leadership often runs in families, demonstrating the biblical importance of succession and tradition."
    },
    {
      "pk": 13027007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 7,
      "text": "The fourth commander, for the fourth month, was Asahel the brother of Joab, and his son Zebadiah succeeded him. In his division were twenty-four thousand.",
      "links": "<a href='/AIV/10/23/24'>2 Sam 23:24</a>",
      "comment": "The passing of leadership from Asahel (killed at Gibeon) to his son shows the value of both sacrifice and the continuity of service (cf. Num 27:18-23)."
    },
    {
      "pk": 13027008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 8,
      "text": "The fifth, for the fifth month, was Shamhuth the Izrahite. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/27'>1 Chr 11:27</a>",
      "comment": "Shamhuth is little-known, reminding us God values faithfulness whether recognized or not (see Matt 25:21)."
    },
    {
      "pk": 13027009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 9,
      "text": "The sixth, for the sixth month, was Ira the son of Ikkesh the Tekoite. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/28'>1 Chr 11:28</a>",
      "comment": "Again, the list reinforces the regular, ordered service reminiscent of spiritual disciplines observed in the faith."
    },
    {
      "pk": 13027010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 10,
      "text": "The seventh, for the seventh month, was Helez the Pelonite, from the sons of Ephraim. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/27'>1 Chr 11:27</a>",
      "comment": "Ephraim’s prominence here is notable, as Joseph’s line often represented spiritual blessings (cf. Gen 48:19)."
    },
    {
      "pk": 13027011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 11,
      "text": "The eighth, for the eighth month, was Sibbecai the Hushathite, from the Zerahites. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/29'>1 Chr 11:29</a>",
      "comment": "Sibbecai’s victories highlight God’s empowerment of the humble—one of the spiritual lessons echoed by Christ (cf. Luke 14:11)."
    },
    {
      "pk": 13027012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 12,
      "text": "The ninth, for the ninth month, was Abiezer the Anathothite, a Benjaminite. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/28'>1 Chr 11:28</a>",
      "comment": "The inclusion of Benjaminites shows unity among the tribes, mirroring spiritual unity among Christians (Eph 4:3-6)."
    },
    {
      "pk": 13027013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 13,
      "text": "The tenth, for the tenth month, was Maharai the Netophathite, of the Zerahites. His division had twenty-four thousand.",
      "links": "<a href='/AIV/13/11/30'>1 Chr 11:30</a>",
      "comment": "The detailed tribal breakdown underscores the importance of particularity and universality in God’s people—a key theological theme."
    },
    {
      "pk": 13027014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 14,
      "text": "The eleventh, for the eleventh month, was Benaiah the Pirathonite, from the sons of Ephraim. His division had twenty-four thousand.",
      "links": "<a href='/AIV/07/12/13-15'>Judg 12:13-15</a>",
      "comment": "Benaiah’s repetition shows some names were common, reflecting the continuity of faith across generations."
    },
    {
      "pk": 13027015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 15,
      "text": "The twelfth, for the twelfth month, was Heldai the Netophathite, from Othniel. His division had twenty-four thousand.",
      "links": "<a href='/AIV/07/03/9'>Judg 3:9</a>",
      "comment": "Othniel’s family line points to Israel’s first judge, indicating a reverence for foundational leaders."
    },
    {
      "pk": 13027016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 16,
      "text": "Now over the tribes of Israel: for the Reubenites, Eliezer the son of Zichri was leader; for the Simeonites, Shephatiah the son of Maacah;",
      "links": "<a href='/AIV/04/01/5-16'>Num 1:5-16</a>",
      "comment": "The listing of tribal leaders recalls Moses' and Joshua’s arrangements—reminding the faithful of God’s ongoing guidance in leadership and tradition."
    },
    {
      "pk": 13027017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 17,
      "text": "for Levi, Hashabiah the son of Kemuel; for Aaron, Zadok;",
      "links": "<a href='/AIV/13/06/4-8'>1 Chr 6:4-8</a>",
      "comment": "Levi and Aaron are mentioned distinctly, emphasizing the unique, perpetual priestly office set apart for worship, which has continued spiritual resonance."
    },
    {
      "pk": 13027018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 18,
      "text": "for Judah, Elihu, one of David’s brothers; for Issachar, Omri the son of Michael;",
      "links": "<a href='/AIV/09/16/6-13'>1 Sam 16:6-13</a>",
      "comment": "David’s family involvement hints at kingly succession—foreshadowing the enduring line that ultimately leads to Christ (Matt 1:1-17)."
    },
    {
      "pk": 13027019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 19,
      "text": "for Zebulun, Ishmaiah the son of Obadiah; for Naphtali, Jeremoth the son of Azriel;",
      "links": "<a href='/AIV/07/01/30-33'>Judg 1:30-33</a>",
      "comment": "Every tribe is represented, reinforcing the unity and inclusivity of all God’s people—a spiritual principle sustained in the new covenant."
    },
    {
      "pk": 13027020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 20,
      "text": "for the Ephraimites, Hoshea the son of Azaziah; for the half-tribe of Manasseh, Joel the son of Pedaiah;",
      "links": "<a href='/AIV/06/17/1'>Josh 17:1</a>",
      "comment": "Notice the mention of the divided Manasseh, revealing the complexity yet unity of God’s plan for His people."
    },
    {
      "pk": 13027021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 21,
      "text": "for the half-tribe of Manasseh in Gilead, Iddo the son of Zechariah; for Benjamin, Jaasiel the son of Abner;",
      "links": "<a href='/AIV/13/12/29'>1 Chr 12:29</a>",
      "comment": "This persistent order amidst diversity later echoes in Christ’s calling of disciples from every background."
    },
    {
      "pk": 13027022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 22,
      "text": "for Dan, Azarel the son of Jeroham. These were the leaders of the tribes of Israel.",
      "links": "<a href='/AIV/04/01/16'>Num 1:16</a>",
      "comment": "Tribal structure is tied to identity and worship in biblical theology (cf. Rev 7:4-8)."
    },
    {
      "pk": 13027023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 23,
      "text": "David did not count those twenty years old and under, because the LORD had promised to make Israel as numerous as the stars of heaven.",
      "links": "<a href='/AIV/01/15/5'>Gen 15:5</a>; <a href='/AIV/01/22/17'>Gen 22:17</a>",
      "comment": "David’s restraint shows trust in God’s promise, a theme continued in the church’s reliance on divine providence rather than mere numbers (cf. Rom 9:6-8)."
    },
    {
      "pk": 13027024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 24,
      "text": "Joab the son of Zeruiah began to count them, but did not finish; wrath came upon Israel for this, and the number was not entered into the records of the chronicles of King David.",
      "links": "<a href='/AIV/10/24/1-17'>2 Sam 24:1-17</a>",
      "comment": "God’s displeasure at the census underscores the need for humble reliance on Him—a theme consistently held and applied in Christian doctrine."
    },
    {
      "pk": 13027025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 25,
      "text": "Over the king’s storehouses was Azmaveth the son of Adiel; over the storehouses in the fields, in the cities, villages, and towers was Jonathan the son of Uzziah.",
      "links": "<a href='/AIV/13/26/20'>1 Chr 26:20</a>",
      "comment": "The organization of resources for the king’s house mirrors the stewardship expected of God’s household (Matt 24:45-47; 1 Pet 4:10)."
    },
    {
      "pk": 13027026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 26,
      "text": "Over those who worked the fields, tilling the soil, was Ezri the son of Chelub.",
      "links": "<a href='/AIV/13/27/31'>1 Chr 27:31</a>",
      "comment": "Delegation of responsibilities supports the biblical principle of diverse gifts and services used for the common good (1 Cor 12:4-7)."
    },
    {
      "pk": 13027027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 27,
      "text": "Over the vineyards was Shimei the Ramathite; over the produce of the vineyards for the wine cellars was Zabdi the Shiphmite.",
      "links": "<a href='/AIV/01/09/20'>Gen 9:20</a>; <a href='/AIV/07/09/13'>Judg 9:13</a>",
      "comment": "Fruitfulness in the land prefigures Christ’s teaching about spiritual fruit (John 15:1-8)."
    },
    {
      "pk": 13027028,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 28,
      "text": "Over the olive and sycamore trees in the Shephelah was Baal-hanan the Gederite; over the stores of oil was Joash.",
      "links": "<a href='/AIV/05/08/8'>Deut 8:8</a>",
      "comment": "Olive oil was vital for worship, pointing to the enduring importance of sacred tradition and faith’s material aspects."
    },
    {
      "pk": 13027029,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 29,
      "text": "Over the herds grazing in Sharon was Shitrai the Sharonite; over the herds in the valleys was Shaphat the son of Adlai.",
      "links": "<a href='/AIV/22/02/1'>Song 2:1</a>",
      "comment": "Care for flocks and herds echoes the shepherding motif, fulfilled in Christ the Good Shepherd (John 10:11)."
    },
    {
      "pk": 13027030,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 30,
      "text": "Over the camels was Obil the Ishmaelite; over the donkeys was Jehdeiah the Meronothite.",
      "links": "<a href='/AIV/01/16/10-12'>Gen 16:10-12</a>",
      "comment": "Israel’s inclusion of foreigners (like Obil) in stewardship roles is a reminder that gentiles are grafted into God’s plan (Rom 11:17)."
    },
    {
      "pk": 13027031,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 31,
      "text": "Over the flocks was Jaziz the Hagrite. All these were in charge of King David’s property.",
      "links": "<a href='/AIV/13/05/10'>1 Chr 5:10</a>",
      "comment": "Delegated service reflects the way spiritual authority continues to be exercised by trustworthy individuals for the good of all."
    },
    {
      "pk": 13027032,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 32,
      "text": "Jonathan, David’s uncle, was a counselor, a man of understanding and a scribe; Jehiel the son of Hachmoni attended the king’s sons.",
      "links": "<a href='/AIV/10/21/21'>2 Sam 21:21</a>",
      "comment": "The mention of counselors and scribes anticipates the later role of teachers and elders in worshipping communities (cf. Acts 13:1)."
    },
    {
      "pk": 13027033,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 33,
      "text": "Ahithophel was the king’s counselor. Hushai the Archite was the king’s friend.",
      "links": "<a href='/AIV/10/15/12'>2 Sam 15:12</a>",
      "comment": "True wisdom and friendship are exalted roles—‘friend of the king’ is a prophetic type, as Christ calls His disciples friends (John 15:15)."
    },
    {
      "pk": 13027034,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 27,
      "verse": 34,
      "text": "After Ahithophel came Jehoiada the son of Benaiah, and Abiathar. Joab was commander of the king’s army.",
      "links": "<a href='/AIV/10/20/23'>2 Sam 20:23</a>",
      "comment": "The continuity of leadership from Ahithophel to Jehoiada to Abiathar to Joab exemplifies the principle of apostolic succession—each generation is entrusted with stewardship until the true King, Christ, reigns fully (cf. Matt 28:19-20)."
    }
  ],
  "translatedAt": "2025-12-24T04:20:14.111Z"
}