{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 9,
  "verses": [
    {
      "pk": 19009001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 1,
      "text": "Now in the twelfth month, which is the month of Adar, on the thirteenth day, when the king's command and decree were to be carried out, on the day when the enemies of the Jews hoped to overpower them, the opposite happened: the Jews overpowered those who hated them.",
      "links": "<a href='/AIV/19/8/17'>Esth. 8:17</a>; <a href='/AIV/2/15/9-10'>Ex. 15:9-10</a>",
      "comment": "The reversal of fortune fulfills the deliverance theme seen throughout Scripture, reminiscent of the deliverance at the Red Sea (Exodus 15). Notice how God works providentially, even when He is not named directly in the book.",
      "sectionHeader": "The Jews Destroy Their Enemies"
    },
    {
      "pk": 19009002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 2,
      "text": "The Jews gathered in their cities throughout all the provinces of King Ahasuerus to lay hands on those who sought their harm. No one could stand against them, for fear of them had fallen on all peoples.",
      "links": "<a href='/AIV/19/8/11'>Esth. 8:11</a>; <a href='/AIV/5/2/11'>Josh. 2:11</a>",
      "comment": "The fear that falls on the Gentile nations echoes the scenes in Joshua, where God's people are protected and made victorious by His power."
    },
    {
      "pk": 19009003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 3,
      "text": "And all the officials of the provinces, the satraps, the governors, and those who handled the king’s business, helped the Jews, because the fear of Mordecai had fallen upon them.",
      "links": "<a href='/AIV/19/8/9'>Esth. 8:9</a>; <a href='/AIV/19/9/4'>Esth. 9:4</a>",
      "comment": "The rise of Mordecai to prominence caused even secular authorities to support God's people. This demonstrates God's power working through His appointed agents."
    },
    {
      "pk": 19009004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 4,
      "text": "For Mordecai was great in the king’s house, and his fame spread throughout all the provinces, for the man Mordecai grew greater and greater.",
      "links": "<a href='/AIV/19/8/15'>Esth. 8:15</a>; <a href='/AIV/1/41/41'>Gen. 41:41-43</a>",
      "comment": "Mordecai’s exaltation is similar to Joseph’s rise in Egypt, highlighting how God raises up His servants at key moments for the salvation of His people."
    },
    {
      "pk": 19009005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 5,
      "text": "So the Jews struck all their enemies with the sword, killing and destroying them, and did as they pleased to those who hated them.",
      "links": "<a href='/AIV/19/8/11-13'>Esth. 8:11-13</a>",
      "comment": "This verse affirms the just defense of God’s people. There is both a literal and typological meaning here, pointing forward to spiritual victory over evil (cf. Rev. 19:15)."
    },
    {
      "pk": 19009006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 6,
      "text": "In Susa the citadel itself, the Jews killed and destroyed five hundred men.",
      "links": "<a href='/AIV/19/9/12'>Esth. 9:12</a>",
      "comment": "The description of victory in the capital underlines the complete reversal and victory for God's people in the very seat of power.",
      "sectionHeader": "The Death of Haman’s Sons"
    },
    {
      "pk": 19009007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 7,
      "text": "They killed Parshandatha, Dalphon, Aspatha,",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>",
      "comment": "These are the sons of Haman, enemies of the Jews. The naming of enemies recalls how victory over specific foes is both historical and symbolic."
    },
    {
      "pk": 19009008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 8,
      "text": "Poratha, Adalia, Aridatha,",
      "links": "<a href='/AIV/19/9/7'>Esth. 9:7</a>",
      "comment": "The text continues listing Haman’s sons, emphasizing the total defeat of the enemy’s house."
    },
    {
      "pk": 19009009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 9,
      "text": "Parmashta, Arisai, Aridai, and Vaizatha,",
      "links": "<a href='/AIV/19/9/7'>Esth. 9:7</a>",
      "comment": "Full naming makes the justice complete, and links to the biblical motif of judgment on families opposed to God's will (cf. Josh. 7:24-25)."
    },
    {
      "pk": 19009010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 10,
      "text": "the ten sons of Haman the son of Hammedatha, the enemy of the Jews; but they did not lay their hands on the plunder.",
      "links": "<a href='/AIV/9/15/3'>1 Sam. 15:3,9</a>; <a href='/AIV/19/3/1'>Esth. 3:1</a>",
      "comment": "The refusal to take plunder is significant; it fulfills God’s earlier command to Saul and demonstrates obedience and restraint (cf. 1 Sam. 15)."
    },
    {
      "pk": 19009011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 11,
      "text": "On that day the number of those killed in Susa the citadel was brought before the king.",
      "links": "<a href='/AIV/19/9/6'>Esth. 9:6</a>",
      "comment": "This official account highlights the justice and transparency of the actions taken by the Jews."
    },
    {
      "pk": 19009012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 12,
      "text": "And the king said to Queen Esther, 'In Susa the citadel the Jews have killed and destroyed five hundred men and also the ten sons of Haman. What have they done in the rest of the king’s provinces! Now, what is your request? It shall be given to you. And what further is your wish? It shall be fulfilled.'",
      "links": "<a href='/AIV/19/5/3'>Esth. 5:3</a>; <a href='/AIV/19/7/2'>Esth. 7:2</a>",
      "comment": "The king’s willingness to grant Esther’s requests speaks to her favor and influence—a precursor to the intercessory role seen clearly in New Testament figures such as Mary (John 2:3-5)."
    },
    {
      "pk": 19009013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 13,
      "text": "Esther said, 'If it pleases the king, let the Jews who are in Susa be allowed tomorrow also to do according to this day’s edict. And let the ten sons of Haman be hanged on the gallows.'",
      "links": "<a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "Esther’s bold request ensures full justice is meted out. Her persistent intercession and leadership foreshadow the value of leaders who advocate for the people."
    },
    {
      "pk": 19009014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 14,
      "text": "So the king commanded this to be done. A decree was issued in Susa, and they hanged the ten sons of Haman.",
      "links": "<a href='/AIV/19/9/13'>Esth. 9:13</a>",
      "comment": "The public hanging of Haman’s sons is presented as a warning and history lesson for future generations."
    },
    {
      "pk": 19009015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 15,
      "text": "The Jews who were in Susa gathered together again on the fourteenth day of the month of Adar and killed three hundred men in Susa, but they did not lay hands on the plunder.",
      "links": "<a href='/AIV/19/9/10'>Esth. 9:10</a>; <a href='/AIV/19/8/11'>Esth. 8:11</a>",
      "comment": "The repeated note about not taking plunder signals deep respect for God’s command—not for personal gain but to fulfill a higher purpose."
    },
    {
      "pk": 19009016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 16,
      "text": "Now the rest of the Jews who were in the king’s provinces also gathered to defend their lives and got relief from their enemies. They killed seventy-five thousand of those who hated them, but they did not lay hands on the plunder.",
      "links": "<a href='/AIV/19/9/10'>Esth. 9:10</a>",
      "comment": "The preservation of Israel is a constant biblical theme, prefiguring the New Covenant's extension to all who are joined spiritually to God’s people."
    },
    {
      "pk": 19009017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 17,
      "text": "This was done on the thirteenth day of the month of Adar, and on the fourteenth day they rested and made it a day of feasting and gladness.",
      "links": "<a href='/AIV/2/12/16'>Ex. 12:16</a>",
      "comment": "Celebration and feasting following deliverance recall the liturgical feasts instituted in salvation history—Moses (Ex. 12:16) and onward.",
      "sectionHeader": "The Jews Celebrate Their Victory"
    },
    {
      "pk": 19009018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 18,
      "text": "But the Jews who were in Susa gathered on both the thirteenth and fourteenth days and rested on the fifteenth day, making that a day of feasting and gladness.",
      "links": "<a href='/AIV/19/9/17'>Esth. 9:17</a>",
      "comment": "There is a distinction made between the provincial and capital Jews—yet both celebrate under one faith, hinting at the harmony of diverse parts making up one Body."
    },
    {
      "pk": 19009019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 19,
      "text": "Therefore, the Jews of the villages, who live in the rural towns, make the fourteenth day of the month of Adar a day of gladness and feasting, a holiday, and a day for sending gifts of food to one another.",
      "links": "<a href='/AIV/19/9/22'>Esth. 9:22</a>",
      "comment": "The giving of gifts reflects the spirit of communion, unity, and charity, themes later fulfilled in Christian practice (cf. Acts 2:44-46)."
    },
    {
      "pk": 19009020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 20,
      "text": "And Mordecai wrote these things down and sent letters to all the Jews who were in all the provinces of King Ahasuerus, both near and far,",
      "links": "<a href='/AIV/19/8/9-10'>Esth. 8:9-10</a>",
      "comment": "The institution of remembrance by written letter anticipates sacred tradition and faithful proclamation of salvific events for all generations.",
      "sectionHeader": "The Institution of the Feast of Purim"
    },
    {
      "pk": 19009021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 21,
      "text": "to instruct them to keep the fourteenth and fifteenth days of the month of Adar every year,",
      "links": "<a href='/AIV/19/9/27'>Esth. 9:27</a>",
      "comment": "A perpetual observance is decreed. This echoes the Old Testament feasts which later foreshadow the perpetual celebration in the Christian liturgy."
    },
    {
      "pk": 19009022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 22,
      "text": "as the days on which the Jews got relief from their enemies, and as the month that had been turned for them from sorrow into gladness and from mourning into a holiday; that they should make them days of feasting and gladness, days for sending gifts of food to one another and gifts to the poor.",
      "links": "<a href='/AIV/19/9/19'>Esth. 9:19</a>; <a href='/AIV/3/11/25'>Deut. 11:25</a>",
      "comment": "Generosity to one another, and especially to the poor, was central—prefiguring later Christian concepts of charity, almsgiving, and communal fellowship."
    },
    {
      "pk": 19009023,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 23,
      "text": "So the Jews accepted what they had started to do, and what Mordecai had written to them.",
      "links": "<a href='/AIV/19/9/20'>Esth. 9:20</a>",
      "comment": "An act of obedience and faithfulness to the discipline passed on through leadership, foreshadowing the early Church’s submission to apostolic instruction."
    },
    {
      "pk": 19009024,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 24,
      "text": "For Haman the son of Hammedatha, the Agagite, the enemy of all the Jews, had plotted against the Jews to destroy them and had cast Pur (that is, lots) to ruin and destroy them.",
      "links": "<a href='/AIV/19/3/7-9'>Esth. 3:7-9</a>",
      "comment": "The 'casting of lots' (Purim) recalls God’s sovereignty beyond human planning (see Prov. 16:33). It also has a typological meaning, alluding to the Cross, where apparent defeat is transformed into victory."
    },
    {
      "pk": 19009025,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 25,
      "text": "But when Esther came before the king, he gave orders in writing that the evil scheme Haman had devised against the Jews should return upon his own head, and that he and his sons should be hanged on the gallows.",
      "links": "<a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "Esther’s intercession turns the evil plan on its head. This points to the mediation of chosen leaders in the history of salvation, which prefigures Christ’s unique and singular role as mediator."
    },
    {
      "pk": 19009026,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 26,
      "text": "Therefore they called these days Purim, after the term 'Pur.' Therefore, because of all that was written in this letter, and what they had experienced in this matter, and what had happened to them,",
      "links": "<a href='/AIV/19/9/24'>Esth. 9:24</a>",
      "comment": "The naming of the feast memorializes God's hidden providence. Remembrance through feasts is a biblical way of passing down faith."
    },
    {
      "pk": 19009027,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 27,
      "text": "the Jews established and accepted as a custom for themselves, their descendants, and for all who would join them, that without fail they would keep these two days every year, just as it was prescribed and at the appointed time,",
      "links": "<a href='/AIV/19/9/21'>Esth. 9:21</a>",
      "comment": "This binding authority of tradition inspires unity in worship. The phrase 'all who would join them' anticipates the openness of God's covenant family."
    },
    {
      "pk": 19009028,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 28,
      "text": "that these days should be remembered and kept throughout every generation, every family, every province, and every city, and that these days of Purim should never fall into disuse among the Jews, nor should their remembrance cease among their descendants.",
      "links": "<a href='/AIV/19/9/22'>Esth. 9:22</a>",
      "comment": "This perpetual observance prefigures the enduring memorial of Christian worship and the faith passed through generations."
    },
    {
      "pk": 19009029,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 29,
      "text": "Then Queen Esther, the daughter of Abihail, and Mordecai the Jew, wrote with full authority to confirm this second letter about Purim.",
      "links": "<a href='/AIV/19/9/20'>Esth. 9:20</a>",
      "comment": "Full authority to establish observances is used here, suggesting a principle that God’s appointed leaders have legitimacy to bind the community’s worship."
    },
    {
      "pk": 19009030,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 30,
      "text": "Letters were sent to all the Jews, to the 127 provinces of the kingdom of Ahasuerus, with words of peace and truth,",
      "links": "<a href='/AIV/19/8/9'>Esth. 8:9</a>",
      "comment": "The universal exhortation to peace and truth unites all God’s people in right belief and practice."
    },
    {
      "pk": 19009031,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 31,
      "text": "to confirm these days of Purim at their appointed times, as Mordecai the Jew and Queen Esther had established for them, and as they had for themselves and for their descendants concerning their fasts and their lamentations.",
      "links": "<a href='/AIV/19/4/3'>Esth. 4:3</a>; <a href='/AIV/19/9/20-21'>Esth. 9:20-21</a>",
      "comment": "The linking of feasting and fasting illustrates the value of ordered practices: times of joy and of repentance in the shared community rhythm."
    },
    {
      "pk": 19009032,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 9,
      "verse": 32,
      "text": "And the command of Esther confirmed these practices about Purim, and it was written in the record.",
      "links": "<a href='/AIV/19/9/29'>Esth. 9:29</a>",
      "comment": "Esther’s command, committed to writing, underlines both the enduring authority of God’s chosen leaders and the importance of sacred tradition. In the broader biblical story, this prefigures how Christ would entrust His Church with the authority to preserve and teach the faith (cf. Matt. 28:19-20)."
    }
  ],
  "translatedAt": "2025-12-24T05:11:43.817Z",
  "sections": [
    {
      "title": "The Jews Destroy Their Enemies",
      "startVerse": 1,
      "endVerse": 5
    },
    {
      "title": "The Death of Haman’s Sons",
      "startVerse": 6,
      "endVerse": 16
    },
    {
      "title": "The Jews Celebrate Their Victory",
      "startVerse": 17,
      "endVerse": 19
    },
    {
      "title": "The Institution of the Feast of Purim",
      "startVerse": 20,
      "endVerse": 32
    }
  ]
}