{
  "book": 46,
  "bookName": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 3,
  "verses": [
    {
      "pk": 46003001,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 1,
      "text": "See, I am sending my messenger, and he will prepare the way before Me. Then suddenly, the Lord whom you seek will come to His temple; the messenger of the covenant in whom you delight—behold, He is coming, says the LORD of hosts.",
      "links": "<a href='/AIV/40/11/10'>Matt. 11:10</a>; <a href='/AIV/41/1/2'>Mark 1:2</a>; <a href='/AIV/42/1/76'>Luke 1:76</a>",
      "comment": "This prophecy points to John the Baptist as the messenger who prepares the way, and ultimately to Jesus Christ as the Lord coming to His temple. The phrase 'messenger of the covenant' signals the arrival of a new, divinely established covenant. This is foundational for understanding the incarnation and the fulfillment of Old Testament promise in the person of Christ. See <a href='/AIV/23/40/3'>Isaiah 40:3</a> for parallel prophecy."
    },
    {
      "pk": 46003002,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 2,
      "text": "But who can endure the day of His coming, and who can stand when He appears? For He is like a refiner's fire and like launderers' soap.",
      "links": "<a href='/AIV/19/24/3'>Ps. 24:3</a>; <a href='/AIV/23/33/14'>Isaiah 33:14</a>",
      "comment": "The arrival of the Lord will be a time of purification, indicating a need for holiness and preparation. The imagery of fire and soap suggest an inner purification, aligning with New Testament teachings on sanctification and spiritual transformation."
    },
    {
      "pk": 46003003,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 3,
      "text": "He will sit as a refiner and purifier of silver; He will purify the sons of Levi and refine them like gold and silver, so that they may offer to the LORD offerings in righteousness.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/23/48/10'>Isaiah 48:10</a>",
      "comment": "Purification of the Levitical priesthood prefigures the cleansing needed for service to God. In a spiritual sense, this prefigures the transformation of believers into a holy priesthood (see <a href='/AIV/60/2/9'>1 Peter 2:9</a>). The focus on righteous offerings points to the importance of sacrificial worship and tradition."
    },
    {
      "pk": 46003004,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 4,
      "text": "Then the offering of Judah and Jerusalem will be pleasing to the LORD as in days of old and in former years.",
      "links": "<a href='/AIV/03/22/19'>Lev. 22:19</a>; <a href='/AIV/19/51/19'>Ps. 51:19</a>",
      "comment": "After purification, true worship is restored, recalling an ideal of worship from Israel’s history. This restoration of acceptable offerings hints at a future where the faithful once again offer dignified, liturgical worship to God."
    },
    {
      "pk": 46003005,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 5,
      "text": "Then I will draw near to you for judgment; I will be a swift witness against sorcerers, against adulterers, against those who swear falsely, against those who oppress the hired worker in his wages, the widow and the fatherless, and those who turn aside the foreigner and do not fear Me, says the LORD of hosts.",
      "links": "<a href='/AIV/02/22/21-24'>Ex. 22:21-24</a>; <a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/23/1/23'>Isaiah 1:23</a>",
      "comment": "God promises judgment on moral and social evils, emphasizing justice for the vulnerable and integrity in oath and labor. These themes echo throughout prophetic literature and reinforce the call for comprehensive righteousness."
    },
    {
      "pk": 46003006,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 6,
      "text": "For I, the LORD, do not change; therefore you, O descendants of Jacob, are not destroyed.",
      "links": "<a href='/AIV/04/23/19'>Num. 23:19</a>; <a href='/AIV/19/102/27'>Ps. 102:27</a>; <a href='/AIV/58/13/8'>Heb. 13:8</a>",
      "comment": "God’s immutability assures the preservation of His people despite their failures. This principle is significant for understanding divine fidelity and covenantal promises."
    },
    {
      "pk": 46003007,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 7,
      "text": "From the days of your ancestors, you have turned aside from My statutes and have not kept them. Return to Me, and I will return to you, says the LORD of hosts. But you say, ‘How shall we return?’",
      "links": "<a href='/AIV/16/9/29'>Neh. 9:29</a>; <a href='/AIV/23/55/7'>Isaiah 55:7</a>",
      "comment": "God’s invitation to repent reveals His desire for reconciliation. The reciprocal language—return to Me and I will return to you—shows the harmony between divine initiative and human response. The question 'How?' initiates a teaching on true repentance and spiritual restoration."
    },
    {
      "pk": 46003008,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 8,
      "text": "Will a man rob God? Yet you are robbing Me. But you say, ‘How have we robbed You?’ In tithes and offerings.",
      "links": "<a href='/AIV/03/27/30'>Lev. 27:30</a>; <a href='/AIV/20/3/9'>Prov. 3:9</a>",
      "comment": "The withholding of tithes and offerings is equated with robbing God, underlining the connection between worship, stewardship, and covenant obligations. This also points toward a sacramental understanding of giving and sacrifice."
    },
    {
      "pk": 46003009,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 9,
      "text": "You are cursed with a curse, for you are robbing Me, the whole nation.",
      "links": "<a href='/AIV/05/28/15'>Deut. 28:15</a>; <a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "National disobedience brings corporate consequences, emphasizing the seriousness of communal worship and faithfulness. The concept of blessing and curse tied to covenant faithfulness echoes throughout both Testaments."
    },
    {
      "pk": 46003010,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 10,
      "text": "Bring the full tithe into the storehouse, so that there may be food in My house. And test Me now in this, says the LORD of hosts, if I will not open the windows of heaven for you and pour out for you a blessing until it overflows.",
      "links": "<a href='/AIV/05/28/12'>Deut. 28:12</a>; <a href='/AIV/42/6/38'>Luke 6:38</a>",
      "comment": "God invites His people to trust Him in stewardship, promising abundant blessing for obedience. 'My house' emphasizes the centrality of worship and the faith community. The storehouse image prefigures the generosity encouraged among Christians in Acts (<a href='/AIV/44/2/44-45'>Acts 2:44-45</a>)."
    },
    {
      "pk": 46003011,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 11,
      "text": "And I will rebuke the devourer for you, and he will not destroy the fruits of your ground; nor shall your vine in the field fail to bear, says the LORD of hosts.",
      "links": "<a href='/AIV/29/2/25'>Joel 2:25</a>; <a href='/AIV/05/28/4'>Deut. 28:4</a>",
      "comment": "Material blessings are tied to spiritual fidelity. God’s protection over crops and vineyards connects covenant obedience with both spiritual and temporal blessings, hinting at a holistic view of God’s providence."
    },
    {
      "pk": 46003012,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 12,
      "text": "And all nations will call you blessed, for you will be a land of delight, says the LORD of hosts.",
      "links": "<a href='/AIV/01/12/2-3'>Gen. 12:2-3</a>; <a href='/AIV/05/7/6'>Deut. 7:6</a>",
      "comment": "God’s intent to bless Israel is for the sake of the nations, linking His covenant people to the worldwide mission later emphasized by Jesus and the apostles (<a href='/AIV/40/28/19'>Matt. 28:19</a>)."
    },
    {
      "pk": 46003013,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 13,
      "text": "Your words have been harsh against Me, says the LORD. Yet you say, ‘What have we spoken against You?’",
      "links": "<a href='/AIV/19/73/9'>Ps. 73:9</a>; <a href='/AIV/18/34/5'>Job 34:5</a>",
      "comment": "Here God points out the people's disrespectful attitudes, beginning a rebuke focused on their lack of trust and reverence for Him."
    },
    {
      "pk": 46003014,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 14,
      "text": "You have said, ‘It is useless to serve God. What profit is there in keeping His command or in walking mournfully before the LORD of hosts?’",
      "links": "<a href='/AIV/19/73/13-14'>Ps. 73:13-14</a>",
      "comment": "This verse highlights the skepticism of those who see little value in faithfulness when reward seems absent. The spiritual discipline of service and even penitential practices are questioned, yet affirmed as meaningful in the grand narrative of God’s plan."
    },
    {
      "pk": 46003015,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 15,
      "text": "So now we call the arrogant blessed; evildoers not only prosper but also test God and escape.",
      "links": "<a href='/AIV/19/94/3-7'>Ps. 94:3-7</a>; <a href='/AIV/19/37/1-2'>Ps. 37:1-2</a>",
      "comment": "A common human complaint: the apparent success of the wicked. This motivates the need to trust in God's justice, both temporal and ultimate, rather than present circumstances."
    },
    {
      "pk": 46003016,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 16,
      "text": "Then those who feared the LORD spoke to one another, and the LORD paid attention and heard them. A book of remembrance was written before Him for those who feared the LORD and thought upon His name.",
      "links": "<a href='/AIV/19/56/8'>Ps. 56:8</a>; <a href='/AIV/27/7/10'>Dan. 7:10</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "The creation of a book of remembrance connects with the tradition of God recording the deeds and prayers of His faithful. This echoes the concept of intercessory prayer and the value of communal encouragement among believers (see <a href='/AIV/58/10/25'>Heb. 10:25</a>)."
    },
    {
      "pk": 46003017,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 17,
      "text": "They shall be Mine, says the LORD of hosts, on the day when I make up My treasure. I will spare them as a man spares his son who serves him.",
      "links": "<a href='/AIV/02/19/5'>Ex. 19:5</a>; <a href='/AIV/19/103/13'>Ps. 103:13</a>",
      "comment": "God’s people are His treasured possession, showing the close familial relationship God desires. The sparing of sons highlights an inheritance and loving discipline within the community of faith."
    },
    {
      "pk": 46003018,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 3,
      "verse": 18,
      "text": "Then you shall again distinguish between the righteous and the wicked, between one who serves God and one who does not serve Him.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/40/25/32-33'>Matt. 25:32-33</a>",
      "comment": "This final verse points to ultimate justice and the visible difference between the faithful and the wicked, fulfilled eschatologically in the final judgment indicated in New Testament teachings."
    }
  ],
  "translatedAt": "2025-12-24T10:01:17.712Z"
}