{
  "book": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 3,
  "verses": [
    {
      "pk": 3017321,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 1,
      "text": "See, I am sending my messenger, and he will prepare the way before me. Then suddenly the Lord you seek will come to his temple—the messenger of the covenant whom you desire—behold, he is coming, says the LORD of hosts.",
      "links": "<a href='/AIV/40/11/10'>Matt. 11:10</a>; <a href='/AIV/41/1/2'>Mark 1:2</a>; <a href='/AIV/42/1/76'>Luke 1:76</a>; <a href='/AIV/43/2/13-17'>John 2:13–17</a>",
      "comment": "This verse foresees both John the Baptist (as the messenger) and Christ coming to the temple (see Luke 1:76, Mark 1:2). The arrival of the Lord at his temple signals the coming judgment and fulfillment of the covenant. The focus on the temple and the covenant has implications for understanding God’s abiding presence and the role of mediators in salvation history."
    },
    {
      "pk": 3017322,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 2,
      "text": "But who can endure the day of his coming, and who will stand when he appears? For he is like a refiner's fire and like launderers' soap.",
      "links": "<a href='/AIV/23/33/14'>Isa. 33:14</a>; <a href='/AIV/40/3/11'>Matt. 3:11–12</a>",
      "comment": "This image of a 'refiner's fire' echoes purification themes. Christ comes to cleanse and sanctify his people, a process with both literal and spiritual dimensions."
    },
    {
      "pk": 3017323,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 3,
      "text": "He will sit as a refiner and purifier of silver. He will purify the sons of Levi, and refine them like gold and silver, so that they may offer righteous sacrifices to the LORD.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/66/1/6'>Rev. 1:6</a>",
      "comment": "The purification of the Levitical priesthood suggests a spiritual renewal, which points forward to the righteous offering of worship by God's people. The reference to righteous sacrifices connects with the New Testament teaching of offering oneself spiritually (see Romans 12:1)."
    },
    {
      "pk": 3017324,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 4,
      "text": "Then the offering of Judah and Jerusalem will be pleasing to the LORD, as in the days of old, as in former years.",
      "links": "<a href='/AIV/19/51/19'>Ps. 51:19</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "This recalls an era of faithful worship, which is restored by divine initiative. The acceptance of spiritual sacrifices remains a theme in the New Covenant community (see Hebrews 13:15)."
    },
    {
      "pk": 3017325,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 5,
      "text": "Then I will come near to you for judgment. I will be swift to bear witness against sorcerers, adulterers, and against those who swear falsely, against those who oppress wage earners, widows, and orphans, and who turn aside the foreigner and do not fear me, says the LORD of hosts.",
      "links": "<a href='/AIV/19/94/6'>Ps. 94:6</a>; <a href='/AIV/2/22/21-22'>Exod. 22:21–22</a>",
      "comment": "This verse highlights social justice and integrity as key demands of God's law, a theme carried forward into Christ’s teachings (see Matthew 23:23)."
    },
    {
      "pk": 3017326,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 6,
      "text": "For I, the LORD, do not change; therefore, you, the sons of Jacob, are not destroyed.",
      "links": "<a href='/AIV/19/102/27'>Ps. 102:27</a>; <a href='/AIV/58/13/8'>Heb. 13:8</a>",
      "comment": "God's immutability preserves his covenant people. This promise of faithfulness grounds Christian hope and is fulfilled in Christ, who is the same yesterday, today, and forever (see Hebrews 13:8)."
    },
    {
      "pk": 3017327,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 7,
      "text": "From the days of your ancestors, you have turned aside from my statutes and have not kept them. Return to me, and I will return to you, says the LORD of hosts. But you said, 'How shall we return?'",
      "links": "<a href='/AIV/19/81/8-13'>Ps. 81:8–13</a>; <a href='/AIV/59/4/8'>Jas. 4:8</a>",
      "comment": "The call to repentance and restoration is central here, anticipating the New Covenant invitation to reconciliation through Christ (see James 4:8)."
    },
    {
      "pk": 3017328,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 8,
      "text": "Will a person rob God? Yet you are robbing me. But you say, 'How have we robbed you?' In tithes and offerings.",
      "links": "<a href='/AIV/3/27/30'>Lev. 27:30</a>",
      "comment": "Faithfulness in material offerings reflects one’s spiritual disposition. Support for the worship community is a biblical principle seen throughout both testaments."
    },
    {
      "pk": 3017329,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 9,
      "text": "You are cursed with a curse, for you are robbing me—the whole nation.",
      "links": "<a href='/AIV/5/28/15-24'>Deut. 28:15–24</a>",
      "comment": "National disobedience leads to communal consequence. Covenant blessings and curses are a foundational theme from the Torah (Deuteronomy 28)."
    },
    {
      "pk": 3017330,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 10,
      "text": "Bring all the tithes into the storehouse, so that there may be food in my house. Test me in this, says the LORD of hosts, if I will not open the windows of heaven for you and pour out for you blessing until there is no more need.",
      "links": "<a href='/AIV/3/26/3-5'>Lev. 26:3–5</a>; <a href='/AIV/42/6/38'>Luke 6:38</a>",
      "comment": "God invites his people to trust his provision. This testing of God, rare in Scripture, encourages radical faith and generosity, echoed by Jesus (see Luke 6:38)."
    },
    {
      "pk": 3017331,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 11,
      "text": "I will rebuke the devourer for you, so that it will not destroy the produce of your land, nor will your vine in the field fail to bear fruit, says the LORD of hosts.",
      "links": "<a href='/AIV/5/28/4-5'>Deut. 28:4–5</a>",
      "comment": "God’s direct intervention in creation to bless his people points to the intimate relationship between worship, stewardship, and divine favor."
    },
    {
      "pk": 3017332,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 12,
      "text": "All nations will call you blessed, for you will be a land of delight, says the LORD of hosts.",
      "links": "<a href='/AIV/1/12/2-3'>Gen. 12:2–3</a>; <a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "This promise extends the Abrahamic blessing to all nations, foreshadowing the universal mission that becomes central in the New Testament."
    },
    {
      "pk": 3017333,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 13,
      "text": "Your words against me have been harsh, says the LORD. But you say, 'What have we spoken against you?'",
      "links": "<a href='/AIV/19/94/4'>Ps. 94:4</a>",
      "comment": "God challenges the attitude of his people, showing that even careless or cynical words matter. Reverence in speech is a sign of authentic faith."
    },
    {
      "pk": 3017334,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 14,
      "text": "You have said, 'It is pointless to serve God. What profit is it that we have kept his charge, or that we have walked in mourning before the LORD of hosts?'",
      "links": "<a href='/AIV/19/73/13-14'>Ps. 73:13–14</a>",
      "comment": "The perception of futility in piety is a recurring struggle for God’s people. This echoes themes from the Psalms about wrestling with apparent injustices."
    },
    {
      "pk": 3017335,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 15,
      "text": "Now we call the arrogant blessed. Evildoers prosper; they test God and escape.",
      "links": "<a href='/AIV/19/73/3-12'>Ps. 73:3–12</a>",
      "comment": "The prosperity of the wicked versus the suffering of the faithful is a tension that finds ultimate resolution in God’s final judgment, as revealed in Christ’s teachings."
    },
    {
      "pk": 3017336,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 16,
      "text": "Then those who feared the LORD spoke with one another, and the LORD paid attention and heard them; a book of remembrance was written before him for those who feared the LORD and honored his name.",
      "links": "<a href='/AIV/19/56/8'>Ps. 56:8</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "The concept of God’s ‘book of remembrance’ anticipates the Book of Life in Revelation, tying together the themes of justification and divine record of the righteous."
    },
    {
      "pk": 3017337,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 17,
      "text": "They will be mine, says the LORD of hosts, on the day when I make up my treasured possession. I will have compassion on them as a man has compassion on his son who serves him.",
      "links": "<a href='/AIV/2/19/5'>Exod. 19:5</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "God’s people are his treasured possession, a motif echoed in Exodus and Petine writings (see 1 Peter 2:9), relating to the idea of adoption and special relationship with God."
    },
    {
      "pk": 3017338,
      "translation": "AIV",
      "book": 39,
      "chapter": 3,
      "verse": 18,
      "text": "Then you will again discern between the righteous and the wicked, between one who serves God and one who does not serve him.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/40/25/32-46'>Matt. 25:32–46</a>",
      "comment": "The final separation of righteous and wicked is a recurring biblical theme, fulfilled eschatologically in Christ’s judgment (see Matthew 25:32–46). Distinctions in both visible and invisible worship communities are implied."
    }
  ],
  "translatedAt": "2025-12-23T07:42:42.390Z"
}