{
  "book": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 4,
  "verses": [
    {
      "pk": 3400401,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 1,
      "text": "For look, the day is coming, burning like an oven, when all the arrogant and all evildoers will be stubble. The coming day will set them ablaze, says the LORD of Armies, so that it will leave them neither root nor branch.",
      "links": "<a href='/AIV/23/5/24'>Isa. 5:24</a>; <a href='/AIV/34/1/10'>Nah. 1:10</a>; <a href='/AIV/40/13/30'>Matt. 13:30</a>",
      "comment": "Malachi describes the coming Day of the Lord as a time of judgment, with language echoing earlier prophets (see Isa. 5:24). Christologically, this finds fulfillment in both the first and second comings of Christ (cf. Matt. 13:30). The theme of final judgment highlights the need for ongoing faithfulness and repentance."
    },
    {
      "pk": 3400402,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 2,
      "text": "But for you who fear my name, the sun of righteousness will rise with healing in its wings. You will go out leaping like calves released from the stall.",
      "links": "<a href='/AIV/19/84/11'>Ps. 84:11</a>; <a href='/AIV/42/1/78'>Luke 1:78</a>",
      "comment": "The 'sun of righteousness' gives a vivid image of a messianic deliverer, a theme fulfilled in Jesus (see Luke 1:78). This also points to the transforming power of grace: those revering God’s name are liberated and renewed. The image of 'healing' connects to the restoration brought through sacramental life and obedience."
    },
    {
      "pk": 3400403,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 3,
      "text": "And you will trample the wicked; for they will be ashes under the soles of your feet on the day I act, says the LORD of Armies.",
      "links": "<a href='/AIV/19/1/5'>Ps. 1:5</a>; <a href='/AIV/65/1/15'>Jude 1:15</a>",
      "comment": "The reversal between the wicked and the faithful is highlighted. The faithful's victory is seen as participating with God in His righteous judgment (cf. Ps. 1:5). The spiritual interpretation sees the final triumph over evil not merely as a temporal event but as part of the eternal Kingdom established by Christ."
    },
    {
      "pk": 3400404,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 4,
      "text": "Remember the law of Moses my servant, which I commanded him at Horeb for all Israel, with the statutes and judgments.",
      "links": "<a href='/AIV/02/20/1-17'>Exod. 20:1–17</a>; <a href='/AIV/05/4/10'>Deut. 4:10</a>",
      "comment": "Malachi reminds Israel of faithfulness to the covenant, showing the unity between Law and later revelation. Christ upholds and fulfills the Law (Matt. 5:17). Continual remembrance points to the ongoing need to listen to God’s appointed leaders and teachings."
    },
    {
      "pk": 3400405,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 5,
      "text": "Look, I am sending you Elijah the prophet before the coming of the great and awesome day of the LORD.",
      "links": "<a href='/AIV/40/11/14'>Matt. 11:14</a>; <a href='/AIV/42/1/17'>Luke 1:17</a>; <a href='/AIV/40/17/10-13'>Matt. 17:10–13</a>",
      "comment": "Elijah represents the prophetic tradition, preparing the people for the Messiah. Jesus identifies John the Baptist as the fulfillment (Matt. 11:14). Spiritual interpretation sees God sending forerunners to call His people to repentance and unity before Christ’s coming."
    },
    {
      "pk": 3400406,
      "translation": "AIV",
      "book": 39,
      "chapter": 4,
      "verse": 6,
      "text": "He will turn the hearts of fathers to their children, and the hearts of children to their fathers, so that I will not come and strike the land with a decree of utter destruction.",
      "links": "<a href='/AIV/42/1/17'>Luke 1:17</a>; <a href='/AIV/19/78/7-8'>Ps. 78:7–8</a>",
      "comment": "True repentance brings reconciliation in families and within the community of faith. The role of God’s messenger is to restore right relationship among God’s people. Christ fulfills this restoration through both literal and spiritual family, drawing all to unity—a sign of the new covenant in Him (see Luke 1:17)."
    }
  ],
  "translatedAt": "2025-12-23T07:42:55.003Z"
}