{
  "book": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 1,
  "verses": [
    {
      "pk": 1014001,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 1,
      "text": "The oracle of the word of the LORD to Israel through Malachi.",
      "links": "<a href='/AIV/38/9/1'>Zechariah 9:1</a>; <a href='/AIV/35/1/1'>Habakkuk 1:1</a>",
      "comment": "Malachi uses 'oracle' to introduce his message, echoing prophetic traditions of receiving a divine burden. This sets the tone for God's authoritative pronouncement for the nation, continuing the prophetic line."
    },
    {
      "pk": 1014002,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 2,
      "text": "'I have loved you,' says the LORD. But you say, 'How have you loved us?' 'Was not Esau Jacob’s brother?' declares the LORD. 'Yet I loved Jacob,",
      "links": "<a href='/AIV/01/25/23'>Genesis 25:23</a>; <a href='/AIV/45/9/13'>Romans 9:13</a>",
      "comment": "God expresses His covenant love, yet Israel doubts. The reference to Jacob and Esau recalls God's elective love, which Paul later explains (Romans 9:13) as a pattern of divine sovereignty, foreshadowing salvation by grace and spiritual adoption."
    },
    {
      "pk": 1014003,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 3,
      "text": "but Esau I have hated. I have laid his mountains to waste and left his inheritance for the jackals of the wilderness.",
      "links": "<a href='/AIV/01/36/8-9'>Genesis 36:8-9</a>; <a href='/AIV/24/49/17'>Jeremiah 49:17'</a>",
      "comment": "The contrast between Jacob and Esau reveals divine prerogative. Esau's judgment highlights that the true inheritance comes through faithful relationship, not physical descent—a key theme in understanding spiritual sonship."
    },
    {
      "pk": 1014004,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 4,
      "text": "If Edom says, ‘We are shattered, but we will rebuild the ruins,’ the LORD of hosts says, ‘They may build, but I will tear down, and they will be called the territory of wickedness, the people against whom the LORD is angry forever.’",
      "links": "<a href='/AIV/23/34/5-17'>Isaiah 34:5-17</a>; <a href='/AIV/25/4/22'>Lamentations 4:22</a>",
      "comment": "Edom's persistent defiance is met with God's enduring judgment, reinforcing God’s justice against sin and emphasizing the moral and spiritual dimension of God's covenant dealings."
    },
    {
      "pk": 1014005,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 5,
      "text": "You will see this with your own eyes and say, ‘Great is the LORD beyond the borders of Israel!’",
      "links": "<a href='/AIV/19/48/10'>Psalm 48:10</a>; <a href='/AIV/27/4/35'>Daniel 4:35</a>",
      "comment": "God's greatness is revealed universally, not limited to Israel. This points to His plan for all nations, which develops fully in the New Covenant when worship rightly extends across the whole world."
    },
    {
      "pk": 1014006,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 6,
      "text": "'A son honors his father, and a servant his master. If I am a father, where is my honor? And if I am a master, where is my fear?' says the LORD of hosts to you, O priests who despise my name. But you say, 'How have we despised your name?'",
      "links": "<a href='/AIV/02/20/12'>Exodus 20:12</a>; <a href='/AIV/40/6/9'>Matthew 6:9</a>",
      "comment": "God rebukes the priests’ irreverence. The focus on honor and obedience recalls the deep spiritual reality that God calls His people to worship Him in spirit and truth—anticipated by Christ’s teaching on the Father’s name."
    },
    {
      "pk": 1014007,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 7,
      "text": "You offer defiled bread upon my altar. But you say, 'How have we defiled you?' By saying, 'The table of the LORD is contemptible.'",
      "links": "<a href='/AIV/03/22/20-25'>Leviticus 22:20-25</a>; <a href='/AIV/46/11/27-29'>1 Corinthians 11:27-29</a>",
      "comment": "Offering polluted sacrifices represents disrespect to God, not just breaking ritual rules but neglecting the deeper reality of worship. Paul’s warning about unworthy communion echoes this principle in the New Testament."
    },
    {
      "pk": 1014008,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 8,
      "text": "When you present blind animals for sacrifice, is that not wrong? And when you offer those that are lame or sick, is that not evil? Present them to your governor—would he be pleased with you or show you favor?' says the LORD of hosts.",
      "links": "<a href='/AIV/03/22/22'>Leviticus 22:22</a>; <a href='/AIV/05/15/21'>Deuteronomy 15:21</a>",
      "comment": "God contrasts the honor given to earthly authorities and the neglect shown to Him, stressing that sincere worship deserves the best. Reflects the higher call to holiness and purity in all acts of worship."
    },
    {
      "pk": 1014009,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 9,
      "text": "‘Now, plead with God to be gracious to us. With such offerings from your hand, will he show favor to any of you?’ says the LORD of hosts.",
      "links": "<a href='/AIV/23/27/11'>Isaiah 27:11</a>; <a href='/AIV/19/51/17'>Psalm 51:17</a>",
      "comment": "God warns that mere outward acts cannot earn His favor, reinforcing true contrition and heartfelt repentance—key aspects of spiritual renewal leading to genuine grace."
    },
    {
      "pk": 1014010,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 10,
      "text": "'Oh, that one among you would shut the doors so that you might not kindle fire on my altar in vain! I am not pleased with you,' says the LORD of hosts, 'and I will not accept an offering from your hand.'",
      "links": "<a href='/AIV/23/1/11-15'>Isaiah 1:11-15</a>; <a href='/AIV/19/141/2'>Psalm 141:2</a>",
      "comment": "God longs for sincerity in worship rather than empty ritual. True worship consists in interior conversion, a theme later fully developed by Christ’s teaching on worship 'in spirit and truth.'"
    },
    {
      "pk": 1014011,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 11,
      "text": "For from the rising of the sun to its setting, my name will be great among the nations, and in every place pure incense will be offered to my name, and a pure offering. For my name will be great among the nations,' says the LORD of hosts.",
      "links": "<a href='/AIV/19/113/3'>Psalm 113:3</a>; <a href='/AIV/42/13/29'>Luke 13:29</a>; <a href='/AIV/43/4/23'>John 4:23</a>",
      "comment": "This verse prophesies universal worship and the offering of a pure sacrifice in every place. Early Christian writers saw this as fulfilled in the worldwide offering instituted by Christ—a spiritual and unending worship present wherever the faithful gather."
    },
    {
      "pk": 1014012,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 12,
      "text": "But you profane it when you say, 'The table of the LORD is defiled, and its fruit, food, is contemptible.'",
      "links": "<a href='/AIV/03/21/6'>Leviticus 21:6</a>; <a href='/AIV/46/11/20-22'>1 Corinthians 11:20-22</a>",
      "comment": "Profaning God’s altar through careless worship foreshadows warnings in the New Testament about approaching the Lord’s table with reverence and purity."
    },
    {
      "pk": 1014013,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 13,
      "text": "You say, 'What a burden!' and you snort at it, says the LORD of hosts. You bring what has been stolen, lame, or sick, and you bring this as your offering! Should I accept this from your hand?' says the LORD.",
      "links": "<a href='/AIV/03/22/20'>Leviticus 22:20</a>; <a href='/AIV/40/11/28-30'>Matthew 11:28-30</a>",
      "comment": "God rebukes the careless attitude toward worship. Christ later invites His followers to find joy and rest in Him rather than seeing God's commands as burdensome, emphasizing willing and loving service."
    },
    {
      "pk": 1014014,
      "translation": "AIV",
      "book": 39,
      "chapter": 1,
      "verse": 14,
      "text": "‘Cursed is the deceiver who has a male in his flock, and vows it, yet sacrifices to the Lord what is blemished. For I am a great King,' says the LORD of hosts, 'and my name will be feared among the nations.'",
      "links": "<a href='/AIV/03/27/9-10'>Leviticus 27:9-10</a>; <a href='/AIV/19/47/2'>Psalm 47:2</a>; <a href='/AIV/51/1/13-18'>Colossians 1:13-18</a>",
      "comment": "God declares Himself the great King, deserving sincere and perfect offerings. This anticipates the perfect and eternal offering of Christ, who fulfills all sacrifices and establishes God's worship among all peoples."
    }
  ],
  "translatedAt": "2025-12-23T07:41:57.164Z"
}