{
  "book": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 2,
  "verses": [
    {
      "pk": 2200201,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 1,
      "text": "And now, O priests, this command is for you:",
      "links": "<a href='/AIV/24/23/33'>Jer. 23:33</a>; <a href='/AIV/26/34/2'>Ezek. 34:2</a>",
      "comment": "God addresses the religious leaders directly, holding them especially accountable for their actions. This theme of leadership responsibility recurs throughout Scripture (see Jas. 3:1)."
    },
    {
      "pk": 2200202,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 2,
      "text": "If you will not listen, and if you do not set your heart to honor my name, says the LORD of Armies, then I will send a curse upon you, and I will curse your blessings. Indeed, I have already cursed them, because you do not set your heart to honor me.",
      "links": "<a href='/AIV/05/11/28'>Deut. 11:28</a>; <a href='/AIV/24/44/26'>Jer. 44:26</a>",
      "comment": "Blessings become curses if God's name is not truly honored. Note the emphasis on inward devotion and intention, not just outward action (cf. Isa. 29:13; Mt. 15:8)."
    },
    {
      "pk": 2200203,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 3,
      "text": "See, I will rebuke your descendants, and I will spread dung on your faces, the dung of your festival sacrifices, and you will be taken away with it.",
      "links": "<a href='/AIV/24/16/4'>Jer. 16:4</a>; <a href='/AIV/03/15/16'>Lev. 15:16</a>",
      "comment": "The image is one of severe humiliation and removal. 'Dung' (offal) from sacrifices had to be carried outside the camp as unclean (Lev. 4:11-12); this metaphor signals public disgrace for unworthy priests."
    },
    {
      "pk": 2200204,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 4,
      "text": "Then you will know that I have sent this command to you, so that my covenant with Levi may continue, says the LORD of Armies.",
      "links": "<a href='/AIV/03/02/5'>Lev. 2:5</a>; <a href='/AIV/04/25/12-13'>Num. 25:12-13</a>",
      "comment": "The 'covenant with Levi' refers to God's setting apart of the priestly tribe for service (Num. 25:12-13). This prefigures the lasting priesthood fulfilled in Christ (Heb. 7:11-17)."
    },
    {
      "pk": 2200205,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 5,
      "text": "My covenant with him was one of life and peace, and I gave them to him that he might fear me. He feared me and stood in awe of my name.",
      "links": "<a href='/AIV/04/25/12'>Num. 25:12</a>",
      "comment": "Life, peace, and holy fear are the authentic marks of those who hold spiritual authority. The true priest mediates life and offers peace to the people, recalling Christ as the High Priest (Heb. 9:11-15)."
    },
    {
      "pk": 2200206,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 6,
      "text": "True instruction was in his mouth, and no wrong was found on his lips. He walked with me in peace and uprightness and turned many away from iniquity.",
      "links": "<a href='/AIV/19/37/37'>Ps. 37:37</a>; <a href='/AIV/20/10/21'>Prov. 10:21</a>",
      "comment": "The ministry of the priest as teacher of truth and example to others anticipates Christ, the ultimate teacher and mediator. See parallels in Isa. 53:9."
    },
    {
      "pk": 2200207,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 7,
      "text": "For the lips of a priest should guard knowledge, and people should seek instruction from his mouth, because he is the messenger of the LORD of Armies.",
      "links": "<a href='/AIV/03/10/11'>Lev. 10:11</a>; <a href='/AIV/38/7/8'>Zech. 7:8</a>",
      "comment": "Here the priest is shown as a spiritual authority and source of divine teaching, a role handed down through a visible, unbroken line (see Mt. 23:2-3)."
    },
    {
      "pk": 2200208,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 8,
      "text": "But you have turned from the way. You have caused many to stumble by your instruction. You have corrupted the covenant of Levi, says the LORD of Armies.",
      "links": "<a href='/AIV/26/13/22'>Ezek. 13:22</a>; <a href='/AIV/24/23/11'>Jer. 23:11</a>",
      "comment": "When leaders fail in teaching or example, they lead others into error. This critique supports the need for an unbroken and faithful guardianship of doctrine and morals."
    },
    {
      "pk": 2200209,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 9,
      "text": "So I have made you despised and humiliated before all the people, because you have not kept my ways but have shown partiality in your instruction.",
      "links": "<a href='/AIV/03/19/15'>Lev. 19:15</a>; <a href='/AIV/59/3/1'>Jas. 3:1</a>",
      "comment": "Partiality in teaching is condemned here, aligning with the concept that spiritual leaders must faithfully transmit the fullness of God's truth (cf. Acts 20:27, 1 Tim. 3:15)."
    },
    {
      "pk": 2200210,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 10,
      "text": "Do we not all have one Father? Has not one God created us? Why then are we faithless to one another, breaking the covenant of our ancestors?",
      "links": "<a href='/AIV/01/1/27'>Gen. 1:27</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "The universal fatherhood of God and human dignity are stressed. Covenant faithfulness is not just vertical (to God) but also horizontal (among one another), hinting at the unity and communion of the faithful."
    },
    {
      "pk": 2200211,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 11,
      "text": "Judah has been faithless, and a detestable thing has been done in Israel and in Jerusalem. For Judah has profaned the LORD’s holy sanctuary, which he loves, and has married the daughter of a foreign god.",
      "links": "<a href='/AIV/02/34/15-16'>Ex. 34:15-16</a>; <a href='/AIV/07/2/17'>Judg. 2:17</a>",
      "comment": "Spiritual unfaithfulness is compared to marital infidelity or idolatry, a common prophetic image (see Hosea 2). Physical and spiritual purity are closely linked here."
    },
    {
      "pk": 2200212,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 12,
      "text": "May the LORD cut off from the tents of Jacob anyone who does this, even those who bring an offering to the LORD of Armies.",
      "links": "<a href='/AIV/02/12/15'>Ex. 12:15</a>; <a href='/AIV/24/7/9-10'>Jer. 7:9-10</a>",
      "comment": "Religious acts do not make up for infidelity of heart. Offering sacrifices while being unfaithful is hypocrisy, rejected by God (see Isa. 1:13-17)."
    },
    {
      "pk": 2200213,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 13,
      "text": "And this is another thing you do: You cover the LORD’s altar with tears, with weeping and groaning, because he no longer regards the offering or receives it with favor from your hand.",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>; <a href='/AIV/19/66/18'>Ps. 66:18</a>",
      "comment": "Emotional displays cannot substitute for true repentance and faithfulness. God looks at the heart (1 Sam. 16:7), and broken relationships hinder worship and blessing."
    },
    {
      "pk": 2200214,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 14,
      "text": "But you say, 'Why?' Because the LORD was witness between you and the wife of your youth, to whom you have been faithless, though she is your companion and your wife by covenant.",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/20/2/17'>Prov. 2:17</a>",
      "comment": "Marriage is more than a contract; it is a holy covenant. Unfaithfulness to one’s spouse mirrors unfaithfulness to God and disrupts the life of the entire covenant community."
    },
    {
      "pk": 2200215,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 15,
      "text": "Did he not make them one, with a portion of the Spirit in their union? And what was the one God seeking? Godly offspring. So guard yourselves in your spirit, and let none be faithless to the wife of his youth.",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/40/19/4-6'>Mt. 19:4-6</a>",
      "comment": "The unity of marriage is established by God and animated by his Spirit. The covenant is ordered toward faithfulness and the continuation of a holy community. Jesus refers back to this principle in his teaching on marriage (Mt. 19:4-6)."
    },
    {
      "pk": 2200216,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 16,
      "text": "'For I hate divorce,' says the LORD, the God of Israel, 'and him who covers his garment with violence,' says the LORD of Armies. So guard yourselves in your spirit, and do not be faithless.",
      "links": "<a href='/AIV/05/24/1-4'>Deut. 24:1-4</a>; <a href='/AIV/40/19/8-9'>Mt. 19:8-9</a>",
      "comment": "Divorce is explicitly condemned. God’s intention is lifelong covenantal faithfulness. This underlying principle is fully revealed in the teaching of Jesus on the indissolubility of marriage."
    },
    {
      "pk": 2200217,
      "translation": "AIV",
      "book": 39,
      "chapter": 2,
      "verse": 17,
      "text": "You have wearied the LORD with your words. Yet you say, 'How have we wearied him?' By saying, 'Everyone who does evil is good in the eyes of the LORD, and he delights in them,' or by asking, 'Where is the God of justice?'",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>; <a href='/AIV/19/73/11'>Ps. 73:11</a>",
      "comment": "Questioning God’s justice and redefining good and evil are grave errors. The next chapter reveals that God’s justice will come—most fully in the Messiah, who purifies and judges with true righteousness."
    }
  ],
  "translatedAt": "2025-12-23T07:42:22.631Z"
}