{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 5,
  "verses": [
    {
      "pk": 29005001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 1,
      "text": "Let me sing for my beloved, a song of my dear one about his vineyard: My beloved had a vineyard on a fertile hillside.",
      "links": "<a href='/AIV/19/80/8-16'>Ps. 80:8-16</a>; <a href='/AIV/40/21/33-45'>Matt. 21:33-45</a>",
      "comment": "The 'beloved' represents God, and the vineyard is often interpreted as Israel or the people of God. Jesus uses this imagery in parables, giving it a prophetic and messianic fulfillment (see Matt. 21:33-45)."
    },
    {
      "pk": 29005002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 2,
      "text": "He dug it up, cleared it of stones, and planted it with choice vines. He built a watchtower in the midst of it and hewed out a winepress in it. He waited for it to yield good grapes, but it yielded only wild grapes.",
      "links": "<a href='/AIV/41/12/1-9'>Mark 12:1-9</a>; <a href='/AIV/19/80/8-16'>Ps. 80:8-16</a>",
      "comment": "God prepared everything for His people, but instead of responding faithfully, they turned to sin. There is an allusion to the sacraments in the preparation and the expectation of fruit—God plants and expects a holy people in response."
    },
    {
      "pk": 29005003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 3,
      "text": "Now, O inhabitants of Jerusalem and men of Judah, judge between me and my vineyard.",
      "links": "<a href='/AIV/33/6/1-2'>Mic. 6:1-2</a>",
      "comment": "God invites His people to examine their actions honestly, emphasizing human responsibility and the importance of self-examination before Him."
    },
    {
      "pk": 29005004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 4,
      "text": "What more was there to do for my vineyard that I have not done in it? Why, when I waited for it to yield good grapes, did it yield wild grapes?",
      "links": "<a href='/AIV/24/2/5-8'>Jer. 2:5-8</a>",
      "comment": "A rhetorical question highlighting God's perfect provision contrasted with the people's lack of response. This anticipates New Testament language about God's holiness and expectations of fruit in the lives of believers."
    },
    {
      "pk": 29005005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 5,
      "text": "Now I will tell you what I will do to my vineyard: I will remove its hedge, and it will be consumed; I will break down its wall, and it will be trampled down.",
      "links": "<a href='/AIV/19/80/12-13'>Ps. 80:12-13</a>; <a href='/AIV/25/2/6-8'>Lam. 2:6-8</a>",
      "comment": "God's protection is withdrawn because of persistent unfaithfulness. This judgment is both temporal (historical destruction) and spiritual (loss of grace)."
    },
    {
      "pk": 29005006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 6,
      "text": "I will make it a wasteland; it will not be pruned or hoed, and briers and thorns will grow up. I will also command the clouds not to rain on it.",
      "links": "<a href='/AIV/28/2/3'>Hos. 2:3</a>; <a href='/AIV/59/5/7'>Jas. 5:7</a>",
      "comment": "The removal of pruning and rain signifies the withdrawal of God's means of grace. The theme will later resonate with the withholding of spiritual blessings when there is unbelief."
    },
    {
      "pk": 29005007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 7,
      "text": "For the vineyard of the Lord of Hosts is the house of Israel, and the men of Judah are his pleasant planting. He looked for justice, but behold, bloodshed; for righteousness, but behold, an outcry.",
      "links": "<a href='/AIV/24/12/10'>Jer. 12:10</a>; <a href='/AIV/40/21/43'>Matt. 21:43</a>",
      "comment": "Here the metaphor is explicitly explained. God expects justice and righteousness from His people, connecting to the idea that the true people of God must show evidence of faith by works (see Matt. 21:43)."
    },
    {
      "pk": 29005008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 8,
      "text": "Woe to those who join house to house, who add field to field, until there is no more room, and you are made to dwell alone in the midst of the land!",
      "links": "<a href='/AIV/33/2/2'>Mic. 2:2</a>; <a href='/AIV/03/25/23'>Lev. 25:23-24</a>",
      "comment": "Condemnation of greed and land grabbing. Old Testament law prohibited the permanent loss of ancestral land (Lev. 25:23-24). Sharing resources and care for the poor are consistent themes through the Bible."
    },
    {
      "pk": 29005009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 9,
      "text": "The LORD of Hosts has declared in my hearing: \"Surely many houses shall be desolate, large and beautiful houses, without inhabitant.\"",
      "links": "<a href='/AIV/24/6/11-12'>Jer. 6:11-12</a>",
      "comment": "Material wealth and security are fleeting if unaccompanied by faithfulness to God. Contrast this with Jesus' teaching on the fleeting nature of earthly riches (Luke 12:20)."
    },
    {
      "pk": 29005010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 10,
      "text": "For ten acres of vineyard will yield only one bath, and a homer of seed will yield but an ephah.\"",
      "links": "<a href='/AIV/03/26/20'>Lev. 26:20</a>; <a href='/AIV/37/1/6'>Hag. 1:6</a>",
      "comment": "Disobedience leads to futility and barrenness in even the most productive endeavors. This foreshadows spiritual consequences when God’s grace is ignored."
    },
    {
      "pk": 29005011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 11,
      "text": "Woe to those who rise early in the morning to pursue strong drink, who linger late into the evening, inflamed with wine!",
      "links": "<a href='/AIV/20/23/29-35'>Prov. 23:29-35</a>; <a href='/AIV/23/28/7'>Isa. 28:7</a>",
      "comment": "Condemnation of drunkenness symbolizes both physical and spiritual intemperance. Early mornings should be reserved for seeking God (Ps. 5:3)."
    },
    {
      "pk": 29005012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 12,
      "text": "They have the harp and lyre, tambourine and flute, and wine at their feasts; but they do not regard the deeds of the LORD, or see the work of his hands.",
      "links": "<a href='/AIV/19/28/5'>Ps. 28:5</a>; <a href='/AIV/45/1/20-21'>Rom. 1:20-21</a>",
      "comment": "Ignoring God’s work leads to hardened hearts. Music and celebration divorced from worship devolves into idolatry."
    },
    {
      "pk": 29005013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 13,
      "text": "Therefore my people go into exile because they lack knowledge; their honored men are hungry, and their multitude is parched with thirst.",
      "links": "<a href='/AIV/28/4/6'>Hos. 4:6</a>",
      "comment": "True knowledge comes from God’s revelation. There is a spiritual famine when people neglect God’s Word, doctrine, and authority."
    },
    {
      "pk": 29005014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 14,
      "text": "Therefore Sheol has enlarged its appetite and opened its mouth beyond measure; and the nobility of Jerusalem and her crowd, her revelers, and those who exult in her, descend into it.",
      "links": "<a href='/AIV/20/27/20'>Prov. 27:20</a>; <a href='/AIV/19/49/14'>Ps. 49:14</a>",
      "comment": "Judgment does not respect social status. Refusal to repent results in spiritual death—the need for a Redeemer’s victory is hinted here."
    },
    {
      "pk": 29005015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 15,
      "text": "So man is brought low and mankind is humbled, and the eyes of the arrogant are brought down.",
      "links": "<a href='/AIV/23/2/11-12'>Isa. 2:11-12</a>",
      "comment": "God resists the proud but gives grace to the humble (cf. James 4:6). Sanctification requires ongoing humility."
    },
    {
      "pk": 29005016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 16,
      "text": "But the LORD of Hosts is exalted in justice, and the Holy God proves himself holy in righteousness.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>; <a href='/AIV/40/6/9'>Matt. 6:9</a>",
      "comment": "God’s holiness and justice are the foundation of all divine revelation. Every act of justice participates in His holiness. This anticipates Christ's fulfillment of all righteousness."
    },
    {
      "pk": 29005017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 17,
      "text": "Then lambs shall graze as in their own pasture, and strangers shall eat among the ruins of the wealthy.",
      "links": "<a href='/AIV/36/2/6-7'>Zeph. 2:6-7</a>",
      "comment": "God provides for the meek, not the self-sufficient. There is an early intimation of the reversal of fortunes, fulfilled in Christ’s teaching on the blessedness of the meek and poor in spirit (Matt. 5:5)."
    },
    {
      "pk": 29005018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 18,
      "text": "Woe to those who draw iniquity with cords of falsehood, who drag sin along as with cart ropes,",
      "links": "<a href='/AIV/19/7/14-16'>Ps. 7:14-16</a>",
      "comment": "Habitual sin binds a person and leads further from God. There is a warning here against justifying or excusing sinful actions, an issue addressed by both Old and New Testament writers."
    },
    {
      "pk": 29005019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 19,
      "text": "who say: \"Let him make haste, let him speed his work that we may see it! Let the plan of the Holy One of Israel draw near and come, that we may know it!\"",
      "links": "<a href='/AIV/61/3/4'>2 Pet. 3:4</a>; <a href='/AIV/23/30/10-11'>Isa. 30:10-11</a>",
      "comment": "This verse exposes cynicism and presumption in the face of God’s patience. Mocking divine judgment displays spiritual blindness."
    },
    {
      "pk": 29005020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 20,
      "text": "Woe to those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter!",
      "links": "<a href='/AIV/45/1/18-22'>Rom. 1:18-22</a>; <a href='/AIV/43/3/19-20'>John 3:19-20</a>",
      "comment": "There is a warning against moral relativism. God’s standards never change—even when human perspectives shift. The clarity of objective morality is a theme in both testaments."
    },
    {
      "pk": 29005021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 21,
      "text": "Woe to those who are wise in their own eyes, and prudent in their own sight!",
      "links": "<a href='/AIV/20/3/7'>Prov. 3:7</a>; <a href='/AIV/23/29/14'>Isa. 29:14</a>",
      "comment": "Human wisdom is insufficient for salvation. True wisdom comes from God and His revelation—a consistent message that culminates in Christ, the Wisdom incarnate (see 1 Cor. 1:30)."
    },
    {
      "pk": 29005022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 22,
      "text": "Woe to those who are heroes at drinking wine and valiant men in mixing strong drink,",
      "links": "<a href='/AIV/20/23/20'>Prov. 23:20</a>",
      "comment": "This is a further denunciation of excess and lack of self-control. Compare the emphasis in Scripture on sobriety and vigilance as virtues."
    },
    {
      "pk": 29005023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 23,
      "text": "who acquit the guilty for a bribe, and deprive the innocent of his right!",
      "links": "<a href='/AIV/02/23/8'>Exod. 23:8</a>; <a href='/AIV/20/17/15'>Prov. 17:15</a>",
      "comment": "Unjust leaders pervert justice. Pure and righteous judgment is a divine prerogative—God’s justice is a model for all human governance."
    },
    {
      "pk": 29005024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 24,
      "text": "Therefore, as the tongue of fire devours the stubble, and as dry grass sinks down in the flame, so their root will be as rottenness, and their blossom will go up like dust, because they have rejected the law of the LORD of Hosts and despised the word of the Holy One of Israel.",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/40/3/10-12'>Matt. 3:10-12</a>",
      "comment": "There is a direct connection between accepting God’s law and fruitfulness. Rejecting the 'Word of the Holy One' points toward the consequences of refusing Christ (Matt. 3:12)."
    },
    {
      "pk": 29005025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 25,
      "text": "Therefore the anger of the LORD was kindled against his people, and he stretched out his hand against them and struck them, and the mountains trembled; their dead bodies were like refuse in the midst of the streets. For all this his anger is not turned away, and his hand is stretched out still.",
      "links": "<a href='/AIV/23/9/12,17,21'>Isa. 9:12,17,21</a>",
      "comment": "The repeated phrase about God's hand shows both judgment and a continued call to repentance. Affliction is an opportunity for conversion if one responds in humility."
    },
    {
      "pk": 29005026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 26,
      "text": "He will raise a signal for nations far away, and whistle for them from the ends of the earth; and behold, quickly, speedily they come.",
      "links": "<a href='/AIV/23/13/2,5'>Isa. 13:2,5</a>",
      "comment": "God uses even foreign nations as instruments of His will. The sovereignty of God over all the nations is a demonstration of His kingship."
    },
    {
      "pk": 29005027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 27,
      "text": "None is weary, none stumbles, none slumbers or sleeps; not a waistband is loose, not a sandal strap broken;",
      "links": "<a href='/AIV/24/5/15-16'>Jer. 5:15-16</a>",
      "comment": "The invaders are well-prepared, a sign of divine judgment. There are echoes of the holy vigilance required of God’s own people."
    },
    {
      "pk": 29005028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 28,
      "text": "their arrows are sharp, all their bows bent; their horses’ hoofs seem like flint, and their wheels like the whirlwind.",
      "links": "<a href='/AIV/26/26/10'>Ezek. 26:10</a>",
      "comment": "This is poetic imagery for the overwhelming strength and speed of judgment—God’s discipline is thorough and unstoppable."
    },
    {
      "pk": 29005029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 29,
      "text": "Their roaring is like a lion, like young lions they roar; they seize their prey and carry it off, and none can rescue.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>; <a href='/AIV/28/5/14'>Hos. 5:14</a>",
      "comment": "The imagery of lions represents terror and complete conquest. The inability of anyone to deliver parallels the ultimate need for God to be the Redeemer."
    },
    {
      "pk": 29005030,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 5,
      "verse": 30,
      "text": "In that day they will roar over them like the roaring of the sea. And if one looks to the land, behold, darkness and distress; and the light is darkened by its clouds.",
      "links": "<a href='/AIV/30/8/9'>Amos 8:9</a>; <a href='/AIV/40/27/45'>Matt. 27:45</a>",
      "comment": "Darkness is a symbol of judgment and separation from God, echoed in the passion narratives. Yet throughout, God’s mercy remains available for those who seek the light—even amid severe judgment."
    }
  ],
  "translatedAt": "2025-12-24T07:53:26.660Z"
}