{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 44,
  "verses": [
    {
      "pk": 29044001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 1,
      "text": "But now listen, Jacob my servant, Israel whom I have chosen:",
      "links": "<a href='/AIV/01/28/10-15'>Gen. 28:10-15</a>; <a href='/AIV/23/41/8'>Isa. 41:8</a>",
      "comment": "God reminds His people of His special election, echoing promises first made to Jacob. In scripture, being chosen by God has lasting consequences in salvation history."
    },
    {
      "pk": 29044002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 2,
      "text": "Thus says the LORD who made you and formed you from the womb and will help you: Do not be afraid, Jacob my servant, Jeshurun whom I have chosen.",
      "links": "<a href='/AIV/05/32/15'>Deut. 32:15</a>; <a href='/AIV/23/43/1'>Isa. 43:1</a>",
      "comment": "The personal care of God is emphasized: He forms and chooses His people from birth. The use of 'Jeshurun' invokes closeness and affection."
    },
    {
      "pk": 29044003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 3,
      "text": "For I will pour water on thirsty ground and streams on dry land. I will pour my Spirit upon your descendants and my blessing on your offspring.",
      "links": "<a href='/AIV/29/2/28-29'>Joel 2:28-29</a>; <a href='/AIV/43/7/37-39'>John 7:37-39</a>",
      "comment": "Water and Spirit link physical restoration to spiritual renewal, prefiguring the outpouring of the Holy Spirit in the New Covenant. This alludes to both baptism and the indwelling of grace."
    },
    {
      "pk": 29044004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 4,
      "text": "They will spring up among the grass like willows by flowing streams.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Those blessed by God flourish, echoing the imagery of righteous ones as trees planted by waters. The Church is often compared to the branches of a single tree, growing through living water."
    },
    {
      "pk": 29044005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 5,
      "text": "One will say, 'I belong to the LORD'; another will call himself by Jacob's name; and another will write on his hand, 'The LORD's,' and be called by the name of Israel.",
      "links": "<a href='/AIV/66/22/4'>Rev. 22:4</a>; <a href='/AIV/23/43/7'>Isa. 43:7</a>",
      "comment": "Indelible belonging to God is stressed. Marked by God's name, the faithful are united and set apart—a theme later seen in the sacramental rites of initiation."
    },
    {
      "pk": 29044006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 6,
      "text": "Thus says the LORD, the King of Israel and his Redeemer, the LORD of hosts: 'I am the first and I am the last; apart from me there is no God.'",
      "links": "<a href='/AIV/66/1/17'>Rev. 1:17</a>; <a href='/AIV/66/22/13'>Rev. 22:13</a>",
      "comment": "'First and last' is echoed in Christ's self-identification in Revelation, revealing a high Christology and divine kingship. God alone is the source of redemption."
    },
    {
      "pk": 29044007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 7,
      "text": "Who is like me? Let him proclaim it! Let him declare and lay it out before me, since I appointed an ancient people. Let them tell what is coming and what will happen.",
      "links": "<a href='/AIV/23/41/22-23'>Isa. 41:22-23</a>",
      "comment": "God challenges false gods to declare the future, asserting His unique sovereignty and prophetic ability, which is a key sign of divine revelation in scripture."
    },
    {
      "pk": 29044008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 8,
      "text": "Do not tremble or be afraid; have I not told you and declared it long ago? You are my witnesses. Is there any God besides me? There is no other Rock; I know none.",
      "links": "<a href='/AIV/05/32/4'>Deut. 32:4</a>; <a href='/AIV/23/43/10'>Isa. 43:10</a>",
      "comment": "God as the Rock implies stability, protection, and the foundation of true faith—a concept also linked to Christ’s teaching on building the Church upon the Rock."
    },
    {
      "pk": 29044009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 9,
      "text": "Those who make carved idols are nothing, and their precious images do not profit. Their witnesses see nothing and know nothing, so they will be put to shame.",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>; <a href='/AIV/23/40/18-20'>Isa. 40:18-20</a>",
      "comment": "Idolatry is exposed as empty and shameful. The Church later continued teaching against idolatry, holding to right worship."
    },
    {
      "pk": 29044010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 10,
      "text": "Who forms a god or casts an idol that brings no profit?",
      "links": "<a href='/AIV/23/46/6-7'>Isa. 46:6-7</a>",
      "comment": "Human-made idols are contrasted with the living God. This distinction underscores the futility of false worship versus true sacramental devotion."
    },
    {
      "pk": 29044011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 11,
      "text": "Look, all his companions will be ashamed. The craftsmen are mere men. Let them all gather and stand up—they will be afraid and put to shame together.",
      "links": "<a href='/AIV/23/41/11'>Isa. 41:11</a>",
      "comment": "Idol-makers are exposed; their efforts lead only to shame. True worship unites and sanctifies, whereas falsehood divides and dishonors."
    },
    {
      "pk": 29044012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 12,
      "text": "The blacksmith works his tool over the coals; he shapes an idol with hammers; he works it with his strong arm. But he gets hungry, his strength fails; he drinks no water and grows weak.",
      "links": "<a href='/AIV/23/46/1-2'>Isa. 46:1-2</a>",
      "comment": "The frailty of idol-makers shows human limitation. Divine being is not fashioned by man but is self-existent and eternal."
    },
    {
      "pk": 29044013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 13,
      "text": "The carpenter stretches a line; he marks an outline with a stylus; he shapes it with chisels and measures it with a compass. He makes it in the form of a man, with human beauty, to dwell in a house.",
      "links": "<a href='/AIV/23/40/19-20'>Isa. 40:19-20</a>",
      "comment": "Idols are crafted in man's image, reversing the divine order (Gen. 1:27). True worship seeks union with the divine, not creation of substitutes."
    },
    {
      "pk": 29044014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 14,
      "text": "He cuts down cedars, or perhaps takes a cypress or oak, letting it grow strong among the trees of the forest. He plants a pine, and the rain makes it grow.",
      "links": "<a href='/AIV/19/104/16'>Ps. 104:16</a>",
      "comment": "God provides resources, yet human action misuses them. The contrast highlights stewardship and right ordering of creation for divine purposes."
    },
    {
      "pk": 29044015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 15,
      "text": "It serves as fuel for a man: He takes some of it to warm himself; he lights a fire and bakes bread. But he also makes a god and worships it; he makes an idol and bows down to it.",
      "links": "<a href='/AIV/23/46/6-7'>Isa. 46:6-7</a>",
      "comment": "Material creation is intended for good use, yet misuse leads to idolatry. Authentic worship directs all creation toward God's glory."
    },
    {
      "pk": 29044016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 16,
      "text": "He burns half of it in the fire; over this half he cooks meat, eats, and is satisfied. He warms himself and says, 'Ah, I am warm, I see the fire.'",
      "links": "<a href='/AIV/19/78/24-29'>Ps. 78:24-29</a>",
      "comment": "There is irony in using wood both for daily needs and false worship—a warning against confusing the temporal with the eternal."
    },
    {
      "pk": 29044017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 17,
      "text": "And the rest he makes into a god, his idol; he bows down to it and prays to it, saying, 'Save me, for you are my god!'",
      "links": "<a href='/AIV/23/45/20'>Isa. 45:20</a>; <a href='/AIV/19/135/15-18'>Ps. 135:15-18</a>",
      "comment": "The absurdity is clear: worshipping what one has just made. True salvation comes only from the living God, not from human works."
    },
    {
      "pk": 29044018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 18,
      "text": "They have not known nor understood, for their eyes are closed so they cannot see, and their hearts so they cannot discern.",
      "links": "<a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>",
      "comment": "Spiritual blindness results from idolatry. Later, Christ teaches about eyes opening through faith and revelation, connecting to sacramental enlightenment."
    },
    {
      "pk": 29044019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 19,
      "text": "No one considers, nor has the knowledge or understanding to say: 'Half of it I burned in the fire, I baked bread on its coals, I roasted meat and ate; and shall I make the rest into an abomination? Shall I bow to a block of wood?'",
      "links": "<a href='/AIV/23/1/3'>Isa. 1:3</a>",
      "comment": "A lack of discernment is a persistent human failing. The call to reason and wisdom anticipates later teachings on spiritual understanding."
    },
    {
      "pk": 29044020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 20,
      "text": "He feeds on ashes; a deceived heart has led him astray, and he cannot save himself nor say, 'Is not this thing I hold in my right hand a lie?'",
      "links": "<a href='/AIV/19/44/25'>Ps. 44:25</a>",
      "comment": "Idolatry brings spiritual starvation. Truth is found in turning hearts toward God, echoed in teachings on repentance and conversion."
    },
    {
      "pk": 29044021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 21,
      "text": "Remember these things, Jacob, and Israel, for you are my servant; I formed you, you are my servant; Israel, you will not be forgotten by me.",
      "links": "<a href='/AIV/23/49/15'>Isa. 49:15</a>",
      "comment": "God’s forgiveness and steadfast love are foundational. This forms the basis of assurance in redemptive history and the concept of covenant succession."
    },
    {
      "pk": 29044022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 22,
      "text": "I have wiped away your transgressions like a cloud and your sins like morning mist; return to me, for I have redeemed you.",
      "links": "<a href='/AIV/19/103/12'>Ps. 103:12</a>; <a href='/AIV/23/1/18'>Isa. 1:18</a>",
      "comment": "Divine forgiveness is offered. Redemption and the call to return prefigure sacramental reconciliation and the reality of absolution."
    },
    {
      "pk": 29044023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 23,
      "text": "Sing, O heavens, for the LORD has done it; shout, O depths of the earth. Burst forth in rejoicing, you mountains, forests, and every tree in them! For the LORD has redeemed Jacob and glorifies himself in Israel.",
      "links": "<a href='/AIV/23/49/13'>Isa. 49:13</a>; <a href='/AIV/19/96/11-12'>Ps. 96:11-12</a>",
      "comment": "All creation is called to rejoice at God’s redemption. This cosmic joy reflects the universality of salvation promised in Christ."
    },
    {
      "pk": 29044024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 24,
      "text": "Thus says the LORD, your Redeemer, who formed you from the womb: 'I am the LORD, maker of all things, who stretches out the heavens by myself and spreads out the earth—who was with me?'",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/23/40/22'>Isa. 40:22</a>",
      "comment": "God’s unique creative power is asserted. This verse supports the doctrine of creation ex nihilo and the mystery of divine initiative."
    },
    {
      "pk": 29044025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 25,
      "text": "I frustrate the signs of false prophets and make fools of diviners; I turn wise men backward and make their knowledge foolish.",
      "links": "<a href='/AIV/46/1/19-20'>1 Cor. 1:19-20</a>; <a href='/AIV/23/19/3'>Isa. 19:3</a>",
      "comment": "True wisdom comes from God alone; all human pretensions to prophecy or wisdom are overturned. This theme echoes Paul’s teaching on godly wisdom."
    },
    {
      "pk": 29044026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 26,
      "text": "I confirm the word of my servant and fulfill the counsel of my messengers; I say of Jerusalem, 'She shall be inhabited,' and of the cities of Judah, 'They shall be built,' and I will raise up her ruins.",
      "links": "<a href='/AIV/15/1/1-4'>Ezra 1:1-4</a>; <a href='/AIV/23/40/2'>Isa. 40:2</a>",
      "comment": "God’s faithfulness to His promises is emphasized. The restoration of Jerusalem prefigures the spiritual restoration found in the New Covenant."
    },
    {
      "pk": 29044027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 27,
      "text": "I say to the deep, 'Be dry!' and I will dry up your streams.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/23/11/15-16'>Isa. 11:15-16</a>",
      "comment": "God’s authority over nature is displayed in acts reminiscent of the Exodus. These serve as signs pointing toward renewal and new creation."
    },
    {
      "pk": 29044028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 44,
      "verse": 28,
      "text": "I say of Cyrus, 'He is my shepherd, and he will fulfill all my desire,' saying to Jerusalem, 'She shall be rebuilt,' and to the temple, 'Your foundation shall be laid.'",
      "links": "<a href='/AIV/15/1/2-4'>Ezra 1:2-4</a>; <a href='/AIV/23/45/1'>Isa. 45:1</a>",
      "comment": "Cyrus is called God’s shepherd, anointed for restoration. The mention of rebuilding the temple points to restoration, foreshadowing the renewal of worship and the importance of sacred space and liturgy in God’s plan."
    }
  ],
  "translatedAt": "2025-12-24T08:11:45.393Z"
}