{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 54,
  "verses": [
    {
      "pk": 29054001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 1,
      "text": "Sing, barren woman, you who have not given birth. Break out with singing and shout, you who have not been in labor. For the children of the desolate one are more than the children of her who is married, says the LORD.",
      "links": "<a href='/AIV/48/4/27'>Gal. 4:27</a>; <a href='/AIV/23/49/20-21'>Isa. 49:20-21</a>",
      "comment": "Paul quotes this verse in Galatians 4:27, applying it to the heavenly Jerusalem. The desolate woman is a symbol of restoration and fruitfulness through God's promise, foreshadowing the Church receiving children from all nations."
    },
    {
      "pk": 29054002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 2,
      "text": "Enlarge the place of your tent; stretch out the curtains of your dwelling, do not hold back. Lengthen your cords and strengthen your stakes.",
      "links": "<a href='/AIV/23/49/19-20'>Isa. 49:19-20</a>",
      "comment": "The expansion of the tent signifies the gathering of many peoples into God's family, indicating the universality of the new covenant."
    },
    {
      "pk": 29054003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 3,
      "text": "For you will spread out to the right and to the left, and your descendants will possess nations and will inhabit desolate cities.",
      "links": "<a href='/AIV/26/36/35'>Ezek. 36:35</a>; <a href='/AIV/1/28/14'>Gen. 28:14</a>",
      "comment": "The promise echoes the blessings to Abraham, fulfilled as God's people expand worldwide. Spiritually, it points to the growth of the faithful community and its inheritance of the kingdom."
    },
    {
      "pk": 29054004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 4,
      "text": "Do not be afraid, for you will not be ashamed; do not be discouraged, for you will not be disgraced. For you will forget the shame of your youth and will remember no more the reproach of your widowhood.",
      "links": "<a href='/AIV/23/41/10'>Isa. 41:10</a>; <a href='/AIV/28/2/16-17'>Hos. 2:16-17</a>",
      "comment": "God promises to remove the shame of His people, signifying full restoration and union with Him. The marriage imagery hints at the close relationship God desires with His people."
    },
    {
      "pk": 29054005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 5,
      "text": "For your Maker is your husband—the LORD of armies is His name—and your Redeemer is the Holy One of Israel; He is called the God of the whole earth.",
      "links": "<a href='/AIV/28/2/19'>Hos. 2:19</a>; <a href='/AIV/23/47/4'>Isa. 47:4</a>",
      "comment": "God assumes the role of husband and redeemer, underscoring personal relationship and faithfulness. Applied to Christ as Redeemer (Eph. 5:25-27), it points to the union between Christ and His Church."
    },
    {
      "pk": 29054006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 6,
      "text": "For the LORD has called you like a wife forsaken and grieved in spirit, like the wife of youth who is rejected, says your God.",
      "links": "<a href='/AIV/23/50/1'>Isa. 50:1</a>; <a href='/AIV/24/3/1'>Jer. 3:1</a>",
      "comment": "God's call to the 'forsaken wife' alludes to His people's previous rejection but now their restoration, an image of reconciliation and forgiveness."
    },
    {
      "pk": 29054007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 7,
      "text": "For a brief moment I abandoned you, but with great compassion I will gather you.",
      "links": "<a href='/AIV/25/3/31-32'>Lam. 3:31-32</a>",
      "comment": "God's discipline is temporary, but His mercy is enduring. The restoration prefigures God's ultimate gathering of His people."
    },
    {
      "pk": 29054008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 8,
      "text": "In overflowing wrath I hid My face from you for a moment, but with everlasting kindness I will have mercy on you, says the LORD, your Redeemer.",
      "links": "<a href='/AIV/23/57/16-18'>Isa. 57:16-18</a>; <a href='/AIV/10/7/15'>2 Sam. 7:15</a>",
      "comment": "Divine wrath serves a purpose, but God's steadfast love and forgiveness always prevail. Forgiveness and mercy are essential themes, reflected in the sacraments and the ministry of reconciliation (see John 20:23)."
    },
    {
      "pk": 29054009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 9,
      "text": "For this is like the days of Noah to Me: as I swore that the waters of Noah would never again cover the earth, so I have sworn that I will not be angry with you or rebuke you.",
      "links": "<a href='/AIV/1/9/11-17'>Gen. 9:11-17</a>; <a href='/AIV/23/12/1'>Isa. 12:1</a>",
      "comment": "God's covenant with Noah is paralleled with His grace towards His people. This oath underscores the permanence of God’s mercy—a theme carried forward in the new covenant."
    },
    {
      "pk": 29054010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 10,
      "text": "Though the mountains move and the hills are shaken, yet My kindness will not depart from you, nor will My covenant of peace be removed, says the LORD, who has compassion on you.",
      "links": "<a href='/AIV/19/89/33-34'>Ps. 89:33-34</a>; <a href='/AIV/36/3/17'>Zeph. 3:17</a>",
      "comment": "The 'covenant of peace' anticipates the new and everlasting covenant established ultimately in Christ (see Heb. 13:20). God's faithfulness transcends even creation."
    },
    {
      "pk": 29054011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 11,
      "text": "O afflicted one, storm-tossed and not comforted, behold, I will set your stones with turquoise, and your foundations with sapphires.",
      "links": "<a href='/AIV/66/21/19-21'>Rev. 21:19-21</a>; <a href='/AIV/1/2/12'>Gen. 2:12</a>",
      "comment": "The precious stones anticipate the imagery of the New Jerusalem in Revelation, symbolizing the splendor and stability of God’s renewed people."
    },
    {
      "pk": 29054012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 12,
      "text": "I will make your pinnacles of rubies, your gates of sparkling jewels, and all your walls of precious stones.",
      "links": "<a href='/AIV/66/21/18-21'>Rev. 21:18-21</a>",
      "comment": "The vivid description of the city points to the glory and perfection of God’s dwelling with His people, ultimately realized in the eternal kingdom."
    },
    {
      "pk": 29054013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 13,
      "text": "All your children will be taught by the LORD, and great will be the peace of your children.",
      "links": "<a href='/AIV/43/6/45'>John 6:45</a>; <a href='/AIV/24/31/33-34'>Jer. 31:33-34</a>",
      "comment": "Quoted in John 6:45, Jesus applies this to the new covenant where God Himself teaches His people through the Spirit. True peace and understanding come from divine instruction."
    },
    {
      "pk": 29054014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 14,
      "text": "In righteousness you will be established; you will be far from oppression, for you will not fear, and from terror, for it will not come near you.",
      "links": "<a href='/AIV/23/32/17'>Isa. 32:17</a>",
      "comment": "The righteous foundation of God’s people brings security and peace, outcomes of the sanctification God brings about in His people."
    },
    {
      "pk": 29054015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 15,
      "text": "If anyone attacks you, it will not be from Me; whoever assembles against you will fall because of you.",
      "links": "<a href='/AIV/19/27/2'>Ps. 27:2</a>; <a href='/AIV/23/8/10'>Isa. 8:10</a>",
      "comment": "God promises protection against enemies not sent by Him. The victory belongs to those under His covenant."
    },
    {
      "pk": 29054016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 16,
      "text": "See, I Myself have created the blacksmith who blows the coals in the fire and produces a weapon for its work; and I have created the destroyer to bring ruin.",
      "links": "<a href='/AIV/2/9/16'>Exod. 9:16</a>",
      "comment": "God is sovereign even over those who forge weapons or bring destruction. Nothing can succeed against God’s will. Divine providence includes even adversities serving God's purpose."
    },
    {
      "pk": 29054017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 54,
      "verse": 17,
      "text": "No weapon formed against you shall succeed, and every tongue that rises against you in judgment you shall condemn. This is the heritage of the servants of the LORD, and their righteousness is from Me, declares the LORD.",
      "links": "<a href='/AIV/45/8/33-34'>Rom. 8:33-34</a>; <a href='/AIV/19/37/39'>Ps. 37:39</a>",
      "comment": "God’s ultimate protection extends not just physically but spiritually. The heritage of righteousness and security is a promise for all who trust in the Lord, fulfilled in Christ who justifies (see Rom. 8:33-34) and unites His faithful in an unbreakable bond of grace."
    }
  ],
  "translatedAt": "2025-12-24T08:15:54.101Z"
}