{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 16,
  "verses": [
    {
      "pk": 29016001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 1,
      "text": "Send lambs as tribute to the ruler of the land, from Sela in the desert to the mountain of Daughter Zion.",
      "links": "<a href='/AIV/12/3/4'>2 Kgs. 3:4</a>; <a href='/AIV/23/18/7'>Isa. 18:7</a>",
      "comment": "Moab is urged to offer tribute, echoing the practice in <a href='/AIV/12/3/4'>2 Kings 3:4</a> where the Moabites once paid lambs to Israel. The 'mountain of Daughter Zion' points to Jerusalem, symbolizing spiritual authority and the unity of God's people."
    },
    {
      "pk": 29016002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 2,
      "text": "Like fleeing birds, like a scattered nest, the daughters of Moab will be at the fords of the Arnon.",
      "links": "<a href='/AIV/24/48/9'>Jer. 48:9</a>; <a href='/AIV/07/12/2'>Judg. 12:2</a>",
      "comment": "Moab’s people are compared to scattered birds, highlighting their vulnerability. The fords of the Arnon signify seeking refuge. This anticipates themes of exile and dependence on the mercy of Zion."
    },
    {
      "pk": 29016003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 3,
      "text": "\"Give counsel, provide justice; make your shade like night at noon. Hide the outcasts, do not betray the fugitive.",
      "links": "<a href='/AIV/19/82/3'>Ps. 82:3</a>; <a href='/AIV/23/58/7'>Isa. 58:7</a>",
      "comment": "Zion is called to offer protection, prefiguring the call of the people of God to shelter those in need. This responsibility points to the spiritual work of mercy and a universal refuge for the oppressed."
    },
    {
      "pk": 29016004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 4,
      "text": "Let my outcasts stay with you; be a shelter to them from the destroyer. When the oppressor is no more, destruction is at an end, and the aggressor has vanished from the land,",
      "links": "<a href='/AIV/19/57/1'>Ps. 57:1</a>; <a href='/AIV/23/25/4'>Isa. 25:4</a>",
      "comment": "Isaiah intercedes for Moab’s exiles, calling Zion a haven of mercy. This prefigures the Church’s role as a sanctuary and the hope for peace in the Messianic era."
    },
    {
      "pk": 29016005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 5,
      "text": "Then a throne will be established in steadfast love, and on it will sit in faithfulness one from the house of David—one who judges and seeks justice and is swift to do righteousness.",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/23/9/7'>Isa. 9:7</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "This is a clear Messianic prophecy. The ruler from David’s house foreshadows Christ, whose kingdom is marked by justice and true authority. The links to <a href='/AIV/23/9/7'>Isa. 9:7</a> and <a href='/AIV/42/1/32-33'>Luke 1:32-33</a> show this fulfilled in Jesus, the righteous King."
    },
    {
      "pk": 29016006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 6,
      "text": "We have heard of Moab's pride—how great is his arrogance—of his pride, his arrogance, and his boasting, his empty words.",
      "links": "<a href='/AIV/24/48/29'>Jer. 48:29</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Moab’s pride is condemned as a root of downfall, reflecting the biblical warning against arrogance. This underlines the need for humility to receive God’s grace and points to spiritual repentance."
    },
    {
      "pk": 29016007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 7,
      "text": "Therefore Moab will wail for Moab; everyone will mourn. For the raisin cakes of Kir-hareseth you will mourn, utterly stricken.",
      "links": "<a href='/AIV/24/48/31'>Jer. 48:31</a>; <a href='/AIV/28/3/1'>Hos. 3:1</a>",
      "comment": "Moab will experience collective sorrow, particularly felt in the loss of its agricultural blessings (raisin cakes). Mourning over these goods also points to misplaced trust in earthly wealth."
    },
    {
      "pk": 29016008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 8,
      "text": "The fields of Heshbon languish, and the vine of Sibmah. The rulers of the nations have struck down its choicest branches, which reached as far as Jazer and strayed to the desert; its shoots spread out and crossed over the sea.",
      "links": "<a href='/AIV/24/48/32'>Jer. 48:32</a>; <a href='/AIV/04/32/38'>Num. 32:38</a>",
      "comment": "Moab’s prosperity is destroyed by foreign powers. The vine, a symbol of blessing, is now withered, recalling Israel’s own identity as God’s vineyard (<a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>), and foreshadowing the true Vine who brings spiritual fruitfulness."
    },
    {
      "pk": 29016009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 9,
      "text": "Therefore I weep with the weeping of Jazer for the vine of Sibmah. I drench you with my tears, Heshbon and Elealeh; for over your summer fruit and your harvest the shout has fallen.",
      "links": "<a href='/AIV/19/119/136'>Ps. 119:136</a>; <a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "Isaiah personally mourns for Moab’s loss, reflecting God’s compassion even in judgment. The spiritual meaning encourages us to share in the suffering of others and show mercy in their distress."
    },
    {
      "pk": 29016010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 10,
      "text": "Gladness and joy are taken away from the orchards; no songs are sung, no shouts are raised; in the winepress no treader treads out wine; I have put an end to the shouting.",
      "links": "<a href='/AIV/24/48/33'>Jer. 48:33</a>; <a href='/AIV/23/24/7-11'>Isa. 24:7-11</a>",
      "comment": "The silence in the vineyards symbolizes the loss of festive joy of harvest. The cessation is both material and spiritual, pointing to judgment that leads to deeper longing for redemption."
    },
    {
      "pk": 29016011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 11,
      "text": "Therefore my inner parts moan like a lyre for Moab, and my inmost being for Kir-hareseth.",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>; <a href='/AIV/25/1/20'>Lam. 1:20</a>",
      "comment": "Isaiah’s deep lament is likened to the sound of a lyre—an interior grief in tune with God’s own heart of mercy. This models empathy with those under judgment and opens the way for future restoration."
    },
    {
      "pk": 29016012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 12,
      "text": "When Moab appears, weary on the high place, when he comes to his sanctuary to pray, he will not prevail.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>; <a href='/AIV/09/5/5'>1 Sam. 5:5</a>",
      "comment": "Moab’s religious rituals fail to save them, warning that human efforts apart from true worship of God are in vain. This foreshadows the necessity of sincere faith and right worship."
    },
    {
      "pk": 29016013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 13,
      "text": "This is the word the LORD spoke concerning Moab in earlier times.",
      "links": "<a href='/AIV/23/15/1'>Isa. 15:1</a>",
      "comment": "Isaiah recalls the earlier prophecy, emphasizing the consistency of God’s word. This contextual note points to the preeminence and authority of divine revelation."
    },
    {
      "pk": 29016014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 16,
      "verse": 14,
      "text": "But now the LORD says: 'In three years, like the years of a hired worker, the glory of Moab will be brought into contempt, along with all its great multitude, and the survivors will be very few and feeble.'",
      "links": "<a href='/AIV/23/21/16'>Isa. 21:16</a>; <a href='/AIV/24/48/42'>Jer. 48:42</a>",
      "comment": "The prophecy sets a precise time for Moab's downfall, showing God’s sovereignty over history. The few survivors foreshadow a remnant preserved by divine mercy—a recurring theme in the unity of redemption history."
    }
  ],
  "translatedAt": "2025-12-24T07:58:09.180Z"
}