{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 36,
  "verses": [
    {
      "pk": 29036001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 1,
      "text": "In the fourteenth year of King Hezekiah, Sennacherib king of Assyria came up against all the fortified cities of Judah and seized them.",
      "links": "<a href='/AIV/12/18/13'>2 Kings 18:13</a>; <a href='/AIV/14/32/1'>2 Chronicles 32:1</a>",
      "comment": "This verse sets the historical stage, referencing the Assyrian invasion during Hezekiah's reign. The deliberate mention of the fortified cities implies a picture of Judah’s vulnerability and a test for faithfulness (also see <a href='/AIV/23/22/7'>Isaiah 22:7</a>)."
    },
    {
      "pk": 29036002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 2,
      "text": "Then the king of Assyria sent Rabshakeh from Lachish to Jerusalem with a large army to King Hezekiah; and he stood by the aqueduct of the upper pool on the road to the Fuller’s Field.",
      "links": "<a href='/AIV/12/18/17'>2 Kings 18:17</a>; <a href='/AIV/23/7/3'>Isaiah 7:3</a>",
      "comment": "Rabshakeh’s position by the upper pool echoes Isaiah 7:3, highlighting a recurrent point of decision for Jerusalem. Water sources were critical during sieges, symbolizing both material and spiritual life (see <a href='/AIV/23/8/6'>Isaiah 8:6</a>)."
    },
    {
      "pk": 29036003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 3,
      "text": "And Eliakim the son of Hilkiah, who was in charge of the palace, Shebna the secretary, and Joah the son of Asaph, the recorder, came out to him.",
      "links": "<a href='/AIV/12/18/18'>2 Kings 18:18</a>; <a href='/AIV/23/22/20-22'>Isaiah 22:20-22</a>",
      "comment": "These officials represent the highest authority next to the king, showing the seriousness of the encounter. Note Eliakim in Isaiah 22:20-22 is depicted with spiritual stewardship, a typology for roles of spiritual leadership."
    },
    {
      "pk": 29036004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 4,
      "text": "Rabshakeh said to them, 'Please tell Hezekiah: “This is what the great king, the king of Assyria, says: What is this confidence you have?”'",
      "links": "<a href='/AIV/12/18/19'>2 Kings 18:19</a>",
      "comment": "The interrogation touches on the foundation of faith, questioning Hezekiah’s trust. In spiritual application, this prompts reflection on the object of our confidence in dire circumstances."
    },
    {
      "pk": 29036005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 5,
      "text": "'Do you think that empty words are counsel and strength for war? Now, in whom do you trust, that you have rebelled against me?'",
      "links": "<a href='/AIV/19/20/7'>Psalm 20:7</a>",
      "comment": "Rabshakeh undermines the power of faith over mere rhetoric. The question of what or whom we trust is deeply theological, paralleling the teaching that spiritual strength comes from faith, not human alliances."
    },
    {
      "pk": 29036006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 6,
      "text": "'Look, you are trusting in Egypt, that broken reed of a staff, which pierces the hand of anyone who leans on it. Such is Pharaoh king of Egypt to all who trust in him.'",
      "links": "<a href='/AIV/23/30/1-5'>Isaiah 30:1-5</a>; <a href='/AIV/12/18/21'>2 Kings 18:21</a>",
      "comment": "Egypt as unreliable ally is a recurring biblical theme (see Isaiah 30). Reliance on worldly powers rather than on God’s providence mirrors human temptation to seek solutions outside divine promise."
    },
    {
      "pk": 29036007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 7,
      "text": "'But if you say to me, “We trust in the LORD our God,” is it not He whose high places and altars Hezekiah has removed, saying to Judah and Jerusalem, “You shall worship before this altar”?'",
      "links": "<a href='/AIV/14/31/1'>2 Chronicles 31:1</a>; <a href='/AIV/12/18/22'>2 Kings 18:22</a>",
      "comment": "Rabshakeh misunderstands Hezekiah’s religious reforms. True worship was centralized, reflecting God’s instructions and prefiguring the unity and authority of spiritual worship around a singular altar, which hints at continuity in worship."
    },
    {
      "pk": 29036008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 8,
      "text": "'Now come, make a wager with my master the king of Assyria: I will give you two thousand horses, if you are able to put riders on them.'",
      "links": "<a href='/AIV/19/33/16-17'>Psalm 33:16-17</a>",
      "comment": "The challenge is more taunt than offer; it exposes Judah’s lack of military resources. The underlying lesson is that salvation does not depend on military might, but on God’s intervention."
    },
    {
      "pk": 29036009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 9,
      "text": "'How then can you turn back even one official of the least of my master’s servants, when you trust in Egypt for chariots and horsemen?'",
      "links": "<a href='/AIV/23/31/1'>Isaiah 31:1</a>",
      "comment": "This continues to emphasize the futility of trusting in inferior earthly powers. Spiritual insight reminds the reader that strength comes from being rightly aligned with God's will, not from external forces."
    },
    {
      "pk": 29036010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 10,
      "text": "'And now, have I come up against this land to destroy it without the LORD’s approval? The LORD said to me, “Go up against this land and destroy it.”'",
      "links": "<a href='/AIV/23/10/5-6'>Isaiah 10:5-6</a>",
      "comment": "Rabshakeh claims divine mandate, distorting true prophecy for political aims. This theme of using ‘the LORD’ for personal purposes runs through biblical history and calls for careful discernment of true revelation and authority."
    },
    {
      "pk": 29036011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 11,
      "text": "Then Eliakim, Shebna, and Joah said to Rabshakeh, 'Please speak to your servants in Aramaic, for we understand it; do not speak to us in Judean in the hearing of the people on the wall.'",
      "links": "<a href='/AIV/12/18/26'>2 Kings 18:26</a>",
      "comment": "The officials seek to limit panic among the people, a wise act of stewardship. This illustrates the responsibility of leaders to shield and guide the faithful, reminiscent of the role of shepherds in the New Testament."
    },
    {
      "pk": 29036012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 12,
      "text": "But Rabshakeh replied, 'Has my master sent me to speak these words only to your master and to you, and not to the people sitting on the wall—who will eat their own waste and drink their own urine with you?'",
      "links": "<a href='/AIV/23/3/1'>Isaiah 3:1</a>",
      "comment": "This graphic imagery highlights the horror of siege, amplifying fear. It serves as a sobering reminder of the consequences of spiritual and political rebellion, calling the faithful to steadfastness in adversity."
    },
    {
      "pk": 29036013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 13,
      "text": "Then Rabshakeh stood and called out in a loud voice in Judean: 'Hear the words of the great king, the king of Assyria!'",
      "links": "<a href='/AIV/12/18/28'>2 Kings 18:28</a>",
      "comment": "Rabshakeh speaks in the common tongue to spread fear directly among the people. The call to 'hear' echoes biblical exhortations to listen to the true voice of authority and discern truth from falsehood."
    },
    {
      "pk": 29036014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 14,
      "text": "'Thus says the king: “Do not let Hezekiah deceive you, for he cannot deliver you.”'",
      "links": "<a href='/AIV/19/146/3'>Psalm 146:3</a>",
      "comment": "Rabshakeh undermines faith in leadership. The warning against deception is a perennial theme, pointing to the importance of true faith and godly leaders’ intercession."
    },
    {
      "pk": 29036015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 15,
      "text": "'Do not let Hezekiah make you trust in the LORD, saying, “The LORD will surely deliver us; this city will not be given into the hand of the king of Assyria.”'",
      "links": "<a href='/AIV/23/37/35'>Isaiah 37:35</a>",
      "comment": "Here, the theme of trusting God’s deliverance is highlighted. This anticipates miraculous preservation, which prefigures divine intervention shown throughout salvation history."
    },
    {
      "pk": 29036016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 16,
      "text": "'Do not listen to Hezekiah, for this is what the king of Assyria says: “Make peace with me and come out to me. Then each of you will eat from his own vine and fig tree and drink water from his own cistern,”'",
      "links": "<a href='/AIV/11/4/25'>1 Kings 4:25</a>",
      "comment": "The offer of peace and plenty is a deceptive imitation of divine promise (see 1 Kings 4:25). This illustrates the difference between genuine blessing that comes from fidelity and hollow assurances from opposing powers."
    },
    {
      "pk": 29036017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 17,
      "text": "'until I come and take you away to a land like your own—a land of grain and new wine, a land of bread and vineyards.'",
      "links": "<a href='/AIV/23/28/1'>Isaiah 28:1</a>",
      "comment": "The Assyrian promise of abundance is a substitute for the true inheritance God offers. The motif of being ‘carried away’ points towards exile, but also calls to attention the spiritual danger of trusting in promises apart from God."
    },
    {
      "pk": 29036018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 18,
      "text": "'Do not let Hezekiah deceive you, saying, “The LORD will deliver us.” Have any of the gods of the nations delivered their lands from the hand of the king of Assyria?'",
      "links": "<a href='/AIV/19/115/3-7'>Psalm 115:3-7</a>",
      "comment": "Rabshakeh compares the living God with powerless idols. This rhetorical question both challenges and invites reflection on the unique, saving power of the true God—foreshadowing Christ’s unique authority over all nations."
    },
    {
      "pk": 29036019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 19,
      "text": "'Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim? And have they delivered Samaria out of my hand?'",
      "links": "<a href='/AIV/12/17/24-31'>2 Kings 17:24-31</a>; <a href='/AIV/23/10/9-11'>Isaiah 10:9-11</a>",
      "comment": "He lists defeated nations, further emphasizing the impotence of false gods. This sets a stage for God to display His supreme power and contrasts true worship with idolatry."
    },
    {
      "pk": 29036020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 20,
      "text": "'Who among all the gods of these lands have delivered their land from my hand, that the LORD should deliver Jerusalem from my hand?'",
      "links": "<a href='/AIV/19/135/5'>Psalm 135:5</a>; <a href='/AIV/23/37/17-20'>Isaiah 37:17-20</a>",
      "comment": "Rabshakeh’s comparison challenges the uniqueness of the LORD. The coming deliverance will show that the LORD alone has true authority—anticipating the vindication of divine power."
    },
    {
      "pk": 29036021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 21,
      "text": "But the people remained silent and did not answer him at all, for the king’s command was, ‘Do not answer him.’",
      "links": "<a href='/AIV/23/37/3'>Isaiah 37:3</a>",
      "comment": "Obedience to the king’s command shows discipline and trust in authority, echoing the biblical principle of submission to appointed leaders during crisis, and awaits God’s response."
    },
    {
      "pk": 29036022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 36,
      "verse": 22,
      "text": "Then Eliakim the son of Hilkiah, who was over the palace, Shebna the secretary, and Joah the son of Asaph, the recorder, came to Hezekiah with their clothes torn and reported to him what Rabshakeh had said.",
      "links": "<a href='/AIV/23/37/1'>Isaiah 37:1</a>",
      "comment": "Torn clothes symbolize grief and humility, common in biblical depictions of repentance and crisis. This submission and approach to the king set the stage for intercessory prayer and God’s intervention—reminding believers of the necessity of spiritual leadership, prayerful response, and unity under God’s authority."
    }
  ],
  "translatedAt": "2025-12-24T08:07:17.022Z"
}