{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 29,
  "verses": [
    {
      "pk": 29029001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 1,
      "text": "Woe to Ariel, to Ariel, the city where David encamped! Add year to year; let the festivals run their course.",
      "links": "<a href='/AIV/10/5/7'>2 Sam. 5:7</a>; <a href='/AIV/23/1/26'>Isa. 1:26</a>",
      "comment": "Ariel is a symbolic name for Jerusalem, tied to David's royal city. The warning is against a complacent reliance on rituals.",
      "christology": "Jerusalem, the city of David, prefigures the heavenly city to come (Rev. 21:2)."
    },
    {
      "pk": 29029002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 2,
      "text": "Yet I will distress Ariel, and there will be mourning and lamentation; and she shall be to me like Ariel.",
      "links": "<a href='/AIV/25/2/5'>Lam. 2:5</a>",
      "comment": "God Himself brings distress on Jerusalem, yet calls her 'Ariel'—His altared city—even in judgment.",
      "spiritual": "God's discipline of His people is rooted in His covenantal love."
    },
    {
      "pk": 29029003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 3,
      "text": "I will encamp against you all around, and lay siege against you with a ramp, and I will raise siegeworks against you.",
      "links": "<a href='/AIV/23/37/33'>Isa. 37:33</a>; <a href='/AIV/26/4/2'>Ezek. 4:2</a>",
      "comment": "The besieging of Jerusalem by God reflects divine justice, not merely human warfare."
    },
    {
      "pk": 29029004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 4,
      "text": "You will be brought low; from the ground you shall speak, and from the dust your words will murmur. Your voice shall be like a spirit from the ground; your speech will whisper out of the dust.",
      "links": "<a href='/AIV/23/8/19'>Isa. 8:19</a>",
      "comment": "This imagery evokes mourning and humiliation; the people's pride is brought to nothing.",
      "spiritual": "True humility before God is necessary for spiritual renewal."
    },
    {
      "pk": 29029005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 5,
      "text": "But the multitude of your enemies shall be like fine dust, and the multitude of the ruthless ones like chaff that blows away. And it will happen in an instant, suddenly.",
      "links": "<a href='/AIV/23/17/13'>Isa. 17:13</a>; <a href='/AIV/19/83/13'>Ps. 83:13</a>",
      "comment": "Though destruction comes, God promises the eventual defeat of Israel's enemies.",
      "christology": "God's deliverance prefigures Christ's defeat of spiritual enemies."
    },
    {
      "pk": 29029006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 6,
      "text": "You will be visited by the LORD of hosts with thunder, with earthquake and great noise, with whirlwind and tempest, and the flame of a devouring fire.",
      "links": "<a href='/AIV/02/19/16-18'>Ex. 19:16-18</a>; <a href='/AIV/66/8/5'>Rev. 8:5</a>",
      "comment": "God's powerful intervention is often accompanied by unmistakable signs, recalling His presence at Sinai.",
      "spiritual": "God's judgment purifies and renews His people."
    },
    {
      "pk": 29029007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 7,
      "text": "And the multitude of all the nations that fight against Ariel, all who attack her and her stronghold and distress her, shall be like a dream, a vision of the night.",
      "links": "<a href='/AIV/23/17/14'>Isa. 17:14</a>",
      "comment": "The enemies of Jerusalem will vanish as fleeting dreams, showing God's sovereign protection."
    },
    {
      "pk": 29029008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 8,
      "text": "As when a hungry man dreams, and behold, he is eating, but he awakes and his hunger is not satisfied; or as when a thirsty man dreams, and behold, he is drinking, but he awakes faint and his thirst is not quenched—so shall the multitude of all the nations be that fight against Mount Zion.",
      "links": "<a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "The futile striving of the nations highlights the futility of opposing God's chosen city."
    },
    {
      "pk": 29029009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 9,
      "text": "Stare in amazement, be astonished; blind yourselves and be blind! They are drunk, but not with wine, they stagger, but not with strong drink.",
      "links": "<a href='/AIV/23/6/10'>Isa. 6:10</a>; <a href='/AIV/45/11/8'>Rom. 11:8</a>",
      "comment": "Spiritual blindness and stupor are consequences of rejecting God, not physical intoxication.",
      "spiritual": "Hardness of heart is both divine judgment and the result of persistent unbelief."
    },
    {
      "pk": 29029010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 10,
      "text": "For the LORD has poured out upon you a spirit of deep sleep, and has closed your eyes, the prophets, and covered your heads, the seers.",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/45/11/8'>Rom. 11:8</a>",
      "comment": "God can withhold understanding as an act of judgment. Notice the parallel with heads (leadership) being covered—suggesting even spiritual leaders are not exempt."
    },
    {
      "pk": 29029011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 11,
      "text": "And the whole vision has become to you like the words of a sealed book. If men give it to one who can read, saying, 'Read this,' he says, 'I cannot, for it is sealed.'",
      "links": "<a href='/AIV/27/12/4'>Dan. 12:4</a>; <a href='/AIV/66/5/2-5'>Rev. 5:2-5</a>",
      "comment": "God's revelation is inaccessible to those not open to Him. The 'sealed book' image foreshadows fulfillment in the New Testament when only Christ can break the seals (Rev. 5:5)."
    },
    {
      "pk": 29029012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 12,
      "text": "And when the book is given to one who cannot read, saying, 'Read this,' he says, 'I cannot read.'",
      "links": "<a href='/AIV/66/5/3'>Rev. 5:3</a>",
      "comment": "A further image of spiritual incapacity—no human ability or wisdom can substitute for divine guidance."
    },
    {
      "pk": 29029013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 13,
      "text": "The Lord says: 'Because this people draw near me with their mouth and honor me with their lips, but their hearts are far from me, and their fear of me is a commandment taught by men,'",
      "links": "<a href='/AIV/40/15/8-9'>Matt. 15:8-9</a>; <a href='/AIV/41/7/6-7'>Mark 7:6-7</a>",
      "comment": "Jesus himself quotes this verse to critique hollow worship (Matt. 15:8-9). True worship must involve the heart, not rote tradition.",
      "spiritual": "The distinction between external religion and inward faith is highlighted here."
    },
    {
      "pk": 29029014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 14,
      "text": "Therefore, behold, I will again do marvelous things among this people, with wonder upon wonder; and the wisdom of their wise men shall perish, and the understanding of their prudent men shall be hidden.",
      "links": "<a href='/AIV/46/1/19'>1 Cor. 1:19</a>",
      "comment": "Paul cites this as fulfilled in the Gospel: human wisdom is overturned by God's mysterious plan in Christ (1 Cor. 1:19)."
    },
    {
      "pk": 29029015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 15,
      "text": "Woe to those who deeply hide their plans from the LORD, and whose deeds are done in darkness, and who say, 'Who sees us? Who knows us?'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "There is no hiding from God; secret evil will be exposed.",
      "spiritual": "Confession and openness before God are the keys to authentic relationship with Him."
    },
    {
      "pk": 29029016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 16,
      "text": "You turn things upside down! Shall the potter be considered as equal to the clay, that the thing made should say of its maker, 'He did not make me'; or the thing formed say of him who formed it, 'He has no understanding'?",
      "links": "<a href='/AIV/23/45/9'>Isa. 45:9</a>; <a href='/AIV/45/9/20-21'>Rom. 9:20-21</a>",
      "comment": "Paul applies this image to God’s sovereignty in salvation (Rom. 9:20-21). The Creator-creature distinction is crucial."
    },
    {
      "pk": 29029017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 17,
      "text": "Is it not yet a very little while until Lebanon is turned into a fruitful field, and the fruitful field is regarded as a forest?",
      "links": "<a href='/AIV/23/32/15'>Isa. 32:15</a>",
      "comment": "God promises a great reversal, with wilderness becoming fertile—an image associated with restoration and spiritual renewal."
    },
    {
      "pk": 29029018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 18,
      "text": "In that day the deaf shall hear the words of the book, and out of gloom and darkness the eyes of the blind shall see.",
      "links": "<a href='/AIV/35/2/14'>Hab. 2:14</a>; <a href='/AIV/40/11/5'>Matt. 11:5</a>",
      "comment": "Messianic promise: Healing of blindness and deafness is fulfilled in Christ's miracles (Matt. 11:5), emphasizing the new era of revelation.",
      "christology": "Jesus' ministry restores physical and spiritual sight and hearing."
    },
    {
      "pk": 29029019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 19,
      "text": "The meek shall obtain fresh joy in the LORD, and the poor among men shall rejoice in the Holy One of Israel.",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "Echoes the Beatitudes: The poor and meek rejoice in God's kingdom. Joy flows from humility and trust."
    },
    {
      "pk": 29029020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 20,
      "text": "For the ruthless shall come to nothing and the scoffer cease, and all who watch to do evil shall be cut off;",
      "links": "<a href='/AIV/19/37/10'>Ps. 37:10</a>",
      "comment": "God assures ultimate victory for good over evil—divine justice will prevail."
    },
    {
      "pk": 29029021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 21,
      "text": "those who by a word make a man out to be guilty, who lay a snare for the defender in the gate, and with emptiness deny justice to the one in the right.",
      "links": "<a href='/AIV/23/10/1-2'>Isa. 10:1-2</a>",
      "comment": "Corrupt justice is condemned. Legal oppression twists God's intent for righteous authority."
    },
    {
      "pk": 29029022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 22,
      "text": "Therefore thus says the LORD, who redeemed Abraham, concerning the house of Jacob: 'Jacob shall not now be ashamed, nor shall his face grow pale.'",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/19/105/42'>Ps. 105:42</a>",
      "comment": "God's promise to Abraham is remembered; His people will be restored and honored.",
      "spiritual": "Salvation history centers on God's faithfulness to His promises."
    },
    {
      "pk": 29029023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 23,
      "text": "For when he sees his children, the work of my hands, in his midst, they will sanctify my name; yes, they will sanctify the Holy One of Jacob, and stand in awe of the God of Israel.",
      "links": "<a href='/AIV/23/8/13'>Isa. 8:13</a>",
      "comment": "Restored faith and reverence will define the future community. 'Sanctify my name' anticipates Jesus' prayer, 'Hallowed be thy name' (Matt. 6:9).",
      "spiritual": "True worship transforms the community into God's handiwork."
    },
    {
      "pk": 29029024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 29,
      "verse": 24,
      "text": "Those who are wayward in spirit will come to understanding, and those who grumble will accept instruction.",
      "links": "<a href='/AIV/23/35/8'>Isa. 35:8</a>",
      "comment": "God's grace leads the rebellious to wisdom and the disobedient to obedience—suggesting a time of teaching authority and doctrinal clarity in the restored people.",
      "spiritual": "Renewal and unity flow from hearing and accepting God's established truth."
    }
  ],
  "translatedAt": "2025-12-24T08:04:15.816Z"
}