{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 47,
  "verses": [
    {
      "pk": 29047001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 1,
      "text": "Come down and sit in the dust, virgin daughter of Babylon. Sit on the ground without a throne, daughter of the Chaldeans. For you shall no longer be called tender and delicate.",
      "links": "<a href='/AIV/19/137/8'>Ps. 137:8</a>; <a href='/AIV/24/51/33'>Jer. 51:33</a>",
      "comment": "Babylon is personified as a virgin daughter, symbolizing her previous glory and security, now lost. This invites reflection on the downfall of proud empires and the divine justice that humbles the mighty. The image of sitting in the dust foreshadows the ultimate humiliation—this theme finds resonance in New Testament warnings against pride (<a href='/AIV/59/4/6'>James 4:6</a>)."
    },
    {
      "pk": 29047002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 2,
      "text": "Take millstones and grind flour; remove your veil. Strip off your skirt, uncover your legs, cross the rivers.",
      "links": "<a href='/AIV/25/1/15'>Lam. 1:15</a>; <a href='/AIV/34/3/5'>Nah. 3:5</a>",
      "comment": "This verse describes forced labor and exposure—judgment leading to shame and loss of dignity. The removal of garments and crossing rivers implies captivity and servitude. Spiritually, it points to the stripping away of earthly power and calls for humility before divine authority (<a href='/AIV/60/5/6'>1 Pet. 5:6</a>)."
    },
    {
      "pk": 29047003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 3,
      "text": "Your nakedness will be uncovered, your shame will be seen. I will take vengeance, and I will not meet you as a man.",
      "links": "<a href='/AIV/19/79/12'>Ps. 79:12</a>; <a href='/AIV/66/18/6'>Rev. 18:6</a>",
      "comment": "God's judgment exposes Babylon's true condition. The statement 'not as a man' hints at the divine nature of this judgment, transcending human limitations—prefiguring themes later manifest in Christ, whose judgment is both just and merciful (<a href='/AIV/43/5/22'>John 5:22</a>)."
    },
    {
      "pk": 29047004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 4,
      "text": "Our Redeemer—the LORD of hosts is His name—the Holy One of Israel.",
      "links": "<a href='/AIV/23/41/14'>Isa. 41:14</a>; <a href='/AIV/19/24/10'>Ps. 24:10</a>; <a href='/AIV/42/1/68'>Luke 1:68</a>",
      "comment": "A powerful declaration of God as Redeemer. In prophetic context, this points to God's unique saving action for His people. The title 'Holy One of Israel' echoes throughout Scripture, ultimately fulfilled in Christ, who is both Redeemer and Holy One (<a href='/AIV/44/3/14'>Acts 3:14</a>)."
    },
    {
      "pk": 29047005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 5,
      "text": "Sit in silence, and go into darkness, daughter of the Chaldeans; for you shall no longer be called the mistress of kingdoms.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/66/18/7'>Rev. 18:7</a>",
      "comment": "Babylon's fall is marked by silence and darkness, indicating loss of influence and glory. This serves as a warning against worldly ambition and power, reaffirming God's sovereignty over all kingdoms (<a href='/AIV/27/2/21'>Dan. 2:21</a>)."
    },
    {
      "pk": 29047006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 6,
      "text": "I was angry with My people; I profaned My inheritance and gave them into your hand. You showed them no mercy; you laid a heavy yoke on the elderly.",
      "links": "<a href='/AIV/19/106/40'>Ps. 106:40</a>; <a href='/AIV/25/5/13'>Lam. 5:13</a>",
      "comment": "Babylon was used as an instrument of God's judgment on Israel, but her lack of mercy is highlighted. This recalls the mysterious way God can use imperfect instruments for divine purposes—a theme later seen in the suffering of Christ and the Church (<a href='/AIV/45/8/28'>Rom. 8:28</a>)."
    },
    {
      "pk": 29047007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 7,
      "text": "You said, 'I will be mistress forever,' so you did not take these things to heart or think about their end.",
      "links": "<a href='/AIV/19/49/11'>Ps. 49:11</a>; <a href='/AIV/66/18/7'>Rev. 18:7</a>",
      "comment": "Babylon's pride blinds her to her own mortality. The warning is universal: those who forget divine judgment and live only for present power will face sudden downfall (<a href='/AIV/42/12/19-20'>Luke 12:19-20</a>)."
    },
    {
      "pk": 29047008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 8,
      "text": "Now listen, you lover of pleasures, who sits securely, who says in your heart, 'I am, and there is no one else beside me; I will not sit as a widow or know the loss of children.'",
      "links": "<a href='/AIV/66/18/7'>Rev. 18:7</a>; <a href='/AIV/23/45/6'>Isa. 45:6</a>",
      "comment": "Babylon arrogantly claims unique existence, echoing language reserved for God alone ('I am'). This pride sets up a false absolute in opposition to God, prefiguring the spiritual danger of self-sufficiency and the wisdom of humble dependency on divine providence (<a href='/AIV/19/46/10'>Ps. 46:10</a>)."
    },
    {
      "pk": 29047009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 9,
      "text": "But these two things will come to you in a moment, in one day: loss of children and widowhood. They will come upon you in full measure, despite your many sorceries and great enchantments.",
      "links": "<a href='/AIV/23/13/22'>Isa. 13:22</a>; <a href='/AIV/66/18/8'>Rev. 18:8</a>",
      "comment": "Sudden disaster strikes despite Babylon's reliance on occult powers. The futility of magic and human schemes is emphasized in contrast to trust in God alone. In spiritual interpretation, it affirms that only God saves, pointing towards the defeat of evil powers in Christ (<a href='/AIV/51/2/15'>Col. 2:15</a>)."
    },
    {
      "pk": 29047010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 10,
      "text": "You trusted in your wickedness. You said, 'No one sees me.' Your wisdom and knowledge led you astray, and you said in your heart, 'I am, and there is no one else beside me.'",
      "links": "<a href='/AIV/35/2/4'>Hab. 2:4</a>; <a href='/AIV/23/45/5'>Isa. 45:5</a>",
      "comment": "Babylon's self-deception is repeated. The claim 'I am' mirrors God's unique name (<a href='/AIV/2/3/14'>Ex. 3:14</a>), intensifying the blasphemous pride whose root cause is misplaced trust in human wisdom over revealed truth—a call to apostolic faith and humility."
    },
    {
      "pk": 29047011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 11,
      "text": "Therefore disaster shall come upon you, and you will not know its dawn. Misfortune will fall on you, and you will not be able to charm it away. Ruin will come on you suddenly, which you do not foresee.",
      "links": "<a href='/AIV/66/18/8'>Rev. 18:8</a>; <a href='/AIV/20/6/15'>Prov. 6:15</a>",
      "comment": "The suddenness of judgment underscores the limits of human foresight and powerless enchantments. This highlights the necessity of reliance on God’s mercy and providence, not on human power—spiritual readiness is found in watchfulness, as Jesus teaches (<a href='/AIV/40/24/44'>Matt. 24:44</a>)."
    },
    {
      "pk": 29047012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 12,
      "text": "Stand now with your enchantments and the multitude of your sorceries, with which you have labored from your youth; perhaps you may be able to benefit, perhaps you may cause terror.",
      "links": "<a href='/AIV/24/27/9'>Jer. 27:9</a>; <a href='/AIV/44/8/9'>Acts 8:9</a>",
      "comment": "God ironically challenges Babylon to rely on her occult practices, revealing their impotence. Divine power alone triumphs over evil—prefiguring Christ’s defeat of demonic forces and the call to reject all superstition in favor of faith (<a href='/AIV/44/16/18'>Acts 16:18</a>)."
    },
    {
      "pk": 29047013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 13,
      "text": "You are exhausted by your many counsels; let your astrologers stand up and save you, those who divide the heavens and make known what shall come upon you.",
      "links": "<a href='/AIV/27/2/2'>Dan. 2:2</a>; <a href='/AIV/23/44/25'>Isa. 44:25</a>",
      "comment": "The impotence of astrology and false wise men is exposed. Only true prophecy comes from God, not worldly sources, hinting at the importance of receiving divine revelation through authentic tradition (<a href='/AIV/61/1/20-21'>2 Pet. 1:20-21</a>)."
    },
    {
      "pk": 29047014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 14,
      "text": "Behold, they are like stubble; fire consumes them. They cannot rescue themselves from the power of the flame. There is no coal for warming, nor fire to sit before.",
      "links": "<a href='/AIV/23/33/11'>Isa. 33:11</a>; <a href='/AIV/19/83/14'>Ps. 83:14</a>",
      "comment": "Worldly powers and false spiritualities are likened to stubble, easily consumed by God’s judgment. The image of fire here is one both of destruction and purification, which in Christian tradition points to purgative justice and the necessity of true repentance (<a href='/AIV/46/3/13-15'>1 Cor. 3:13-15</a>)."
    },
    {
      "pk": 29047015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 47,
      "verse": 15,
      "text": "So shall those with whom you have labored, your merchants from your youth, wander each in his own direction; there is no one to save you.",
      "links": "<a href='/AIV/66/18/11'>Rev. 18:11</a>; <a href='/AIV/23/43/11'>Isa. 43:11</a>",
      "comment": "In the end, Babylon is utterly forsaken, unable to rely on the relationships or commerce built by human effort. Salvation is found nowhere but in the LORD Himself—foreshadowing the exclusivity of redemption in Christ and the necessity of perseverance in unity and faith (<a href='/AIV/43/14/6'>John 14:6</a>)."
    }
  ],
  "translatedAt": "2025-12-24T08:12:51.601Z"
}