{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 42,
  "verses": [
    {
      "pk": 29042001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 1,
      "text": "Behold My servant, whom I uphold, My chosen one in whom My soul delights. I have put My Spirit upon him; he will bring forth justice to the nations.",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/40/12/18-21'>Matt. 12:18-21</a>",
      "comment": "This passage points to the coming Messiah, fulfilled in Jesus, who is both God’s servant and the one anointed with the Spirit. Matthew cites this passage directly about Christ (Matt. 12:18–21), indicating its messianic fulfillment."
    },
    {
      "pk": 29042002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 2,
      "text": "He will not cry out nor raise his voice, nor make his voice heard in the street.",
      "links": "<a href='/AIV/40/12/19'>Matt. 12:19</a>",
      "comment": "The Messiah will be marked by humility and gentleness, not by ostentatious self-promotion. Jesus’ quiet approach fulfills this (see Matt. 12:19)."
    },
    {
      "pk": 29042003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 3,
      "text": "A bruised reed he will not break, and a faintly burning wick he will not extinguish; he will faithfully bring forth justice.",
      "links": "<a href='/AIV/40/12/20'>Matt. 12:20</a>; <a href='/AIV/19/34/18'>Ps. 34:18</a>",
      "comment": "This speaks of the Messiah’s compassion: he restores and does not crush the weak. Matthew connects this to Christ’s earthly ministry (Matt. 12:20)."
    },
    {
      "pk": 29042004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 4,
      "text": "He will not grow faint or be discouraged until he has established justice on the earth; and the coastlands wait for his law.",
      "links": "<a href='/AIV/23/11/10'>Isa. 11:10</a>; <a href='/AIV/19/98/1-3'>Ps. 98:1-3</a>",
      "comment": "The Messiah’s mission is worldwide, not limited to Israel alone. His law reaches the distant nations, fulfilling God’s plan of salvation for all peoples."
    },
    {
      "pk": 29042005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 5,
      "text": "Thus says God, the LORD, who created the heavens and stretched them out, who spread out the earth and what comes from it; who gives breath to the people on it and spirit to those who walk in it:",
      "links": "<a href='/AIV/23/40/22'>Isa. 40:22</a>; <a href='/AIV/01/2/7'>Gen. 2:7</a>",
      "comment": "God’s sovereignty over creation underlines His authority to bring salvation. Compare His giving of breath in Genesis 2:7."
    },
    {
      "pk": 29042006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 6,
      "text": "I, the LORD, have called you in righteousness; I will take hold of your hand, and I will keep you and make you to be a covenant for the people, a light for the nations.",
      "links": "<a href='/AIV/23/49/6-8'>Isa. 49:6,8</a>; <a href='/AIV/42/2/32'>Luke 2:32</a>",
      "comment": "The servant is the mediator of a covenant and a light to the Gentiles, themes echoed in Luke 2:32 as referring to Christ. There is an allusion to the idea of mediation and sacraments, as Christ becomes the way nations enter God’s covenant."
    },
    {
      "pk": 29042007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 7,
      "text": "to open the eyes that are blind, to bring out from prison those who are bound, from the dungeon those who sit in darkness.",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>; <a href='/AIV/42/4/18'>Luke 4:18</a>",
      "comment": "Christ fulfills these words as He heals the blind and sets captives free (Luke 4:18), addressing both physical and spiritual conditions."
    },
    {
      "pk": 29042008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 8,
      "text": "I am the LORD; that is my name! I will not give my glory to another, nor my praise to idols.",
      "links": "<a href='/AIV/02/20/5'>Ex. 20:5</a>; <a href='/AIV/23/48/11'>Isa. 48:11</a>",
      "comment": "This verse emphasizes the uniqueness of the God of Israel. Jesus receives worship and glory in the New Testament (see Phil. 2:10-11), which hints at His divinity."
    },
    {
      "pk": 29042009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 9,
      "text": "See, the former things have come to pass, and new things I now declare; before they spring forth, I announce them to you.",
      "links": "<a href='/AIV/23/41/22'>Isa. 41:22</a>; <a href='/AIV/46/5/17'>2 Cor. 5:17</a>",
      "comment": "God’s foretelling sets Him apart from idols. The new things point toward the new covenant and fulfillment in Jesus (2 Cor. 5:17)."
    },
    {
      "pk": 29042010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 10,
      "text": "Sing to the LORD a new song, his praise from the ends of the earth, you who go down to the sea, and all that fills it, the coastlands and their inhabitants.",
      "links": "<a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>; <a href='/AIV/66/5/9'>Rev. 5:9</a>",
      "comment": "The invitation to sing a new song signals a new era of salvation that involves all nations. The liturgical aspect of worship is highlighted here."
    },
    {
      "pk": 29042011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 11,
      "text": "Let the wilderness and its cities lift up their voice, the villages that Kedar inhabits; let the inhabitants of Sela sing for joy, let them shout from the top of the mountains.",
      "links": "<a href='/AIV/23/35/1-2'>Isa. 35:1-2</a>",
      "comment": "All regions and peoples, even those traditionally outside Israel, are included in God’s salvation."
    },
    {
      "pk": 29042012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 12,
      "text": "Let them give glory to the LORD, and declare his praise in the coastlands.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "Universal worship is the goal of God's plan, connecting to the later spread of the faith to the nations."
    },
    {
      "pk": 29042013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 13,
      "text": "The LORD goes out like a mighty man; like a warrior he stirs up his zeal; he cries out, yes, he shouts aloud; he shows himself mighty against his enemies.",
      "links": "<a href='/AIV/02/15/3'>Ex. 15:3</a>; <a href='/AIV/19/24/8'>Ps. 24:8</a>",
      "comment": "God is depicted as a warrior, fighting for justice and salvation of His people, a theme fulfilled in Christ’s victory over sin and death."
    },
    {
      "pk": 29042014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 14,
      "text": "For a long time I have held my peace; I have kept still and restrained myself; now I will cry out like a woman in labor; I will gasp and pant.",
      "links": "<a href='/AIV/23/45/15'>Isa. 45:15</a>",
      "comment": "God’s long patience gives way to decisive action for salvation, described with vivid imagery."
    },
    {
      "pk": 29042015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 15,
      "text": "I will lay waste mountains and hills, and dry up all their vegetation; I will make rivers become islands, and dry up the pools.",
      "links": "<a href='/AIV/23/41/18'>Isa. 41:18</a>",
      "comment": "The language of making desolate and renewal signals judgment and restoration, themes echoed in the message of John the Baptist and Christ."
    },
    {
      "pk": 29042016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 16,
      "text": "I will lead the blind by a way they did not know; I will guide them on paths they have not known. I will turn the darkness before them into light, and rough places into level ground. These are the things I will do, and I will not forsake them.",
      "links": "<a href='/AIV/42/1/79'>Luke 1:79</a>; <a href='/AIV/19/23/3'>Ps. 23:3</a>",
      "comment": "This promises divine guidance for the lost, a prophetic foreshadowing of Jesus’ ministry as the Light of the World."
    },
    {
      "pk": 29042017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 17,
      "text": "They are turned back and utterly put to shame, those who trust in idols, who say to metal images, 'You are our gods.'",
      "links": "<a href='/AIV/23/44/9'>Isa. 44:9</a>",
      "comment": "Idolatry leads to shame, reinforcing God’s call to pure worship. The prophetic focus on abandoning idols is central to true faith and sacramental life."
    },
    {
      "pk": 29042018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 18,
      "text": "Hear, you deaf, and look, you blind, that you may see!",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>",
      "comment": "God calls His people to spiritual awakening. The language is used by Jesus in reference to those resistant to His message."
    },
    {
      "pk": 29042019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 19,
      "text": "Who is blind but my servant, or deaf as my messenger whom I send? Who is as blind as my dedicated one, or blind as the servant of the LORD?",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>",
      "comment": "Here, 'servant' is Israel, who was meant to be God’s messenger but became spiritually blind. There is a contrast with Christ, the perfect Servant."
    },
    {
      "pk": 29042020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 20,
      "text": "You see many things, but do not observe them; your ears are open, but none hears.",
      "links": "<a href='/AIV/24/5/21'>Jer. 5:21</a>",
      "comment": "Spiritual blindness is not for lack of revelation but a failure to respond; God’s people need a renewed heart."
    },
    {
      "pk": 29042021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 21,
      "text": "The LORD was pleased, for his righteousness’ sake, to magnify his law and make it glorious.",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "God’s ‘law’ here can mean Torah or instruction. In the New Testament, Christ fulfills and lifts the Law to its highest, spiritual meaning (Matt. 5:17)."
    },
    {
      "pk": 29042022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 22,
      "text": "But this is a people plundered and looted; all of them are trapped in holes and hidden in prisons; they have become prey with none to rescue, spoil with none to say, 'Restore!'",
      "links": "<a href='/AIV/19/79/11'>Ps. 79:11</a>",
      "comment": "Their spiritual condition parallels their physical captivity. Ultimate restoration is foreshadowed—fulfilled through the Gospel which truly 'restores.'"
    },
    {
      "pk": 29042023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 23,
      "text": "Who among you will listen to this? Who will pay attention and listen for the time to come?",
      "links": "<a href='/AIV/23/28/23'>Isa. 28:23</a>",
      "comment": "A call to attentiveness and response to God’s revelation—this theme is echoed by Jesus in the Gospels (‘He who has ears to hear, let him hear’)."
    },
    {
      "pk": 29042024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 24,
      "text": "Who gave Jacob for spoil, and Israel to the plunderers? Was it not the LORD, against whom we have sinned, in whose ways they would not walk, and whose law they would not obey?",
      "links": "<a href='/AIV/19/44/10-11'>Ps. 44:10-11</a>",
      "comment": "God’s people’s suffering is attributed to their disobedience. The connection between faithfulness to God’s law and blessing is emphasized."
    },
    {
      "pk": 29042025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 42,
      "verse": 25,
      "text": "So he poured out on them the heat of his anger and the might of battle; it set him on fire all around, but he did not understand; it burned him up, but he took it not to heart.",
      "links": "<a href='/AIV/25/2/3'>Lam. 2:3</a>",
      "comment": "Chastisement leads to repentance and purification. The language of fire often anticipates later sacramental themes of cleansing and renewal, eventually fulfilled in the work of Christ and his Church."
    }
  ],
  "translatedAt": "2025-12-24T08:10:34.707Z"
}