{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 38,
  "verses": [
    {
      "pk": 29038001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 1,
      "text": "In those days Hezekiah became ill and was at the point of death. And Isaiah the son of Amoz came to him and said, 'Thus says the LORD: Set your house in order, for you shall die; you will not recover.'",
      "links": "<a href='/AIV/12/20/1'>2 Kings 20:1</a>; <a href='/AIV/19/39/4'>Ps. 39:4</a>",
      "comment": "This verse introduces the crisis facing Hezekiah, highlighting God’s sovereignty over life and death. The command to prepare his house reflects the spiritual importance of being ready for death. Compare to <a href='/AIV/19/90/12'>Psalm 90:12</a>, where we’re called to number our days. Communal and sacramental aspects of preparing for death are subtle here, pointing to deeper traditions in the life of faith."
    },
    {
      "pk": 29038002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 2,
      "text": "Then Hezekiah turned his face to the wall and prayed to the LORD.",
      "links": "<a href='/AIV/19/6/4'>Ps. 6:4</a>; <a href='/AIV/19/102/1-2'>Ps. 102:1-2</a>",
      "comment": "Hezekiah’s turning to the wall is an act of personal supplication, indicating intimacy and humility before God. It foreshadows the value placed on private prayer and honest lament in the spiritual tradition."
    },
    {
      "pk": 29038003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 3,
      "text": "'O LORD, remember, I pray, how I have walked before you faithfully and with a whole heart, and have done what is good in your sight.' And Hezekiah wept bitterly.",
      "links": "<a href='/AIV/19/26/1'>Ps. 26:1</a>; <a href='/AIV/19/56/8'>Ps. 56:8</a>",
      "comment": "Hezekiah appeals to his faithfulness, showing that honest, heartfelt prayer can move the heart of God. Repentance and tears have a key role in his supplication, a motif throughout salvation history (<a href='/AIV/19/51/17'>Ps. 51:17</a>)."
    },
    {
      "pk": 29038004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 4,
      "text": "Then the word of the LORD came to Isaiah, saying:",
      "links": "<a href='/AIV/12/20/4'>2 Kings 20:4</a>",
      "comment": "God’s response comes through His prophet, highlighting the role of prophetic mediation for Divine communication. This affirms the significance of order and authority in transmitting God’s will."
    },
    {
      "pk": 29038005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 5,
      "text": "'Go and say to Hezekiah, Thus says the LORD, the God of your ancestor David: I have heard your prayer; I have seen your tears. Behold, I will add fifteen years to your life.'",
      "links": "<a href='/AIV/19/34/15'>Ps. 34:15</a>; <a href='/AIV/12/20/5'>2 Kings 20:5</a>",
      "comment": "God’s mercy is shown in extending Hezekiah’s life based on His prayer and tears, reminiscent of the Lord’s favor upon David. The reference to David links Hezekiah to the royal covenant line, emphasizing God's faithfulness to His promises and prefiguring Christ, the true Son of David (<a href='/AIV/40/1/1'>Matt. 1:1</a>)."
    },
    {
      "pk": 29038006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 6,
      "text": "'I will deliver you and this city out of the hand of the king of Assyria, and I will defend this city.'",
      "links": "<a href='/AIV/12/19/32-34'>2 Kings 19:32-34</a>; <a href='/AIV/23/31/5'>Isa. 31:5</a>",
      "comment": "God’s rescue of Judah from the Assyrians reinforces His protective care over His people, which foreshadows the spiritual deliverance accomplished later through Christ."
    },
    {
      "pk": 29038007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 7,
      "text": "'And this shall be the sign to you from the LORD, that the LORD will do this thing that He has spoken:'",
      "links": "<a href='/AIV/12/20/8'>2 Kings 20:8</a>; <a href='/AIV/23/7/14'>Isa. 7:14</a>",
      "comment": "God often confirms His word with signs. The assurance here recalls how the Lord gives signs as confirmation for His people’s faith, connected to other significant signs in salvation history."
    },
    {
      "pk": 29038008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 8,
      "text": "'I will cause the shadow on the steps, which has gone down with the sun on the steps of Ahaz, to go backward ten steps.' So the sun’s shadow went backward ten steps on the steps on which it had gone down.",
      "links": "<a href='/AIV/12/20/9-11'>2 Kings 20:9-11</a>",
      "comment": "Here, God intervenes in creation, confirming His lordship over time and nature. The miraculous reversal alludes to how God's action can transcend natural laws, foreshadowing resurrection and transformation in Christ (<a href='/AIV/43/11/43-44'>John 11:43-44</a>)."
    },
    {
      "pk": 29038009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 9,
      "text": "A writing of Hezekiah king of Judah, after he was sick and had recovered from his sickness:",
      "links": "<a href='/AIV/19/30/2-3'>Ps. 30:2-3</a>",
      "comment": "Hezekiah personally records his experience, showing the value of spiritual testimony and gratitude. This mirrors other prayers and psalms composed after deliverance."
    },
    {
      "pk": 29038010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 10,
      "text": "'I said, In the middle of my days I must go down to the gates of Sheol; I am deprived of the rest of my years.'",
      "links": "<a href='/AIV/19/88/3'>Ps. 88:3</a>; <a href='/AIV/19/30/9'>Ps. 30:9</a>",
      "comment": "Hezekiah’s lament at facing death recognizes his mortality, anticipating the fuller revelation of life after death with Christ’s victory over Sheol (<a href='/AIV/46/15/54-55'>1 Cor. 15:54-55</a>)."
    },
    {
      "pk": 29038011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 11,
      "text": "'I said, I shall not see the LORD, the LORD in the land of the living; I shall look on man no more among the inhabitants of the world.'",
      "links": "<a href='/AIV/19/27/13'>Ps. 27:13</a>; <a href='/AIV/19/115/17'>Ps. 115:17</a>",
      "comment": "Hezekiah mourns being cut off from fellowship with God’s people and His worship, revealing the significance of visible, communal worship. This echoes a longing for spiritual communion that is fulfilled in Christ’s Church."
    },
    {
      "pk": 29038012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 12,
      "text": "'My dwelling is pulled up and removed from me like a shepherd’s tent; like a weaver I have rolled up my life. He cuts me off from the loom; from day to night you bring me to an end.'",
      "links": "<a href='/AIV/18/7/6'>Job 7:6</a>; <a href='/AIV/19/78/39'>Ps. 78:39</a>",
      "comment": "Life’s fragility is illustrated vividly. The metaphors stress transience, recalling other biblical images of temporality and the need for hope in resurrection."
    },
    {
      "pk": 29038013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 13,
      "text": "'I waited patiently until morning; like a lion, He breaks all my bones; from day to night you bring me to an end.'",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/34/20'>Ps. 34:20</a>",
      "comment": "This verse captures the agony of suffering and the sense of divine chastisement, recalling motifs found in the psalms of lament and even the suffering of Christ in His Passion."
    },
    {
      "pk": 29038014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 14,
      "text": "'Like a swallow or a crane, I chirp; I moan like a dove. My eyes grow weak looking upward; O Lord, I am oppressed; be my strength.'",
      "links": "<a href='/AIV/19/69/3'>Ps. 69:3</a>; <a href='/AIV/19/102/6-7'>Ps. 102:6-7</a>",
      "comment": "Hezekiah’s physical weakness and plea for God’s intervention embody earnest prayer. The image of looking upward, waiting for God's help, is a classic spiritual motif."
    },
    {
      "pk": 29038015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 15,
      "text": "'What shall I say? He has spoken to me, and He has done it; I shall walk humbly all my years because of this bitterness of my soul.'",
      "links": "<a href='/AIV/19/116/10'>Ps. 116:10</a>; <a href='/AIV/19/131/1'>Ps. 131:1</a>",
      "comment": "Hezekiah’s response is humility before God’s action—a reminder that, in suffering and in healing, the appropriate response is faithful surrender."
    },
    {
      "pk": 29038016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 16,
      "text": "'O Lord, by these things men live, and in all these is the life of my spirit. O restore me, and make me live.'",
      "links": "<a href='/AIV/19/119/50'>Ps. 119:50</a>; <a href='/AIV/19/71/20'>Ps. 71:20</a>",
      "comment": "Hezekiah recognizes God as the giver of physical and spiritual life, a truth at the heart of the biblical witness and the Church’s teaching on grace."
    },
    {
      "pk": 29038017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 17,
      "text": "'Behold, it was for my welfare that I had great bitterness; but you have lovingly delivered my soul from the pit of destruction, for you have tossed all my sins behind your back.'",
      "links": "<a href='/AIV/19/103/12'>Ps. 103:12</a>; <a href='/AIV/19/40/2'>Ps. 40:2</a>",
      "comment": "This verse beautifully expresses forgiveness and rescue. God’s act of setting sins aside prefigures Christ’s atoning sacrifice and the grace extended through Him."
    },
    {
      "pk": 29038018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 18,
      "text": "'For Sheol cannot thank you, death cannot praise you; those who go down to the pit cannot hope in your faithfulness.'",
      "links": "<a href='/AIV/19/6/5'>Ps. 6:5</a>; <a href='/AIV/19/30/9'>Ps. 30:9</a>",
      "comment": "Hezekiah stresses the importance of worship in this life, reinforcing the hope of resurrection where praise continues eternally (<a href='/AIV/66/7/9-10'>Rev. 7:9-10</a>)."
    },
    {
      "pk": 29038019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 19,
      "text": "'The living, the living, they thank you, as I do this day; fathers make known to children your faithfulness.'",
      "links": "<a href='/AIV/19/78/4'>Ps. 78:4</a>; <a href='/AIV/19/145/4'>Ps. 145:4</a>",
      "comment": "Testifying to God's faithfulness is a duty passed down generations, foreshadowing the importance of tradition and communal memory in the life of faith."
    },
    {
      "pk": 29038020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 20,
      "text": "'The LORD will save me, and we will play my songs on stringed instruments all the days of our lives, in the house of the LORD.'",
      "links": "<a href='/AIV/19/150/1-6'>Ps. 150:1-6</a>; <a href='/AIV/19/122/1'>Ps. 122:1</a>",
      "comment": "Hezekiah’s intention to worship in God’s house with music highlights liturgical worship and the physical space dedicated to offering praise, a tradition vital to the people of God’s covenant, and extended in the fullness of worship established by Christ."
    },
    {
      "pk": 29038021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 21,
      "text": "Now Isaiah had said, 'Let them take a cake of figs and apply it to the boil, and he will recover.'",
      "links": "<a href='/AIV/12/20/7'>2 Kings 20:7</a>",
      "comment": "God sometimes uses ordinary means, like medicine, alongside miraculous intervention. This supports the principle that both nature and grace work together in healing, as is seen throughout the history of the Church."
    },
    {
      "pk": 29038022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 38,
      "verse": 22,
      "text": "Hezekiah had asked, 'What is the sign that I shall go up to the house of the LORD?'",
      "links": "<a href='/AIV/12/20/8'>2 Kings 20:8</a>",
      "comment": "Hezekiah’s desire for a sign before worshiping God in His house points to the importance of assurance in taking part in sacred worship and hints at the value placed upon signs and sacraments as means of grace in the gathered community."
    }
  ],
  "translatedAt": "2025-12-24T08:08:33.729Z"
}