{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 45,
  "verses": [
    {
      "pk": 29045001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 1,
      "text": "This is what the LORD says to His anointed, to Cyrus, whose right hand I have grasped, to subdue nations before him and to loose the belts of kings, to open doors before him so gates will not be shut—",
      "links": "<a href='/AIV/27/5/30-31'>Dan. 5:30-31</a>; <a href='/AIV/15/1/1-2'>Ezra 1:1-2</a>",
      "comment": "Cyrus, though pagan, is called 'anointed' (Heb. 'messiah'), foreshadowing the way God can use any earthly ruler for His saving purposes, prefiguring Christ as the true Anointed One. This anticipates the universality of God's plan."
    },
    {
      "pk": 29045002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 2,
      "text": "I Myself will go before you and make the rough places smooth; I will break down the doors of bronze and cut through the bars of iron.",
      "links": "<a href='/AIV/19/107/16'>Ps. 107:16</a>; <a href='/AIV/23/13/2'>Isa. 13:2</a>",
      "comment": "God directly acts on behalf of Cyrus, breaking obstacles. This emphasizes God's sovereignty and parallels liberation motifs seen in Exodus. Underlines God’s ability to intervene in history."
    },
    {
      "pk": 29045003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 3,
      "text": "I will give you the treasures of darkness and hidden riches of secret places, so you may know that I am the LORD, the God of Israel, who calls you by name.",
      "links": "<a href='/AIV/27/1/2'>Dan. 1:2</a>; <a href='/AIV/19/135/4'>Ps. 135:4</a>",
      "comment": "Cyrus receives wealth as a sign of God’s active involvement in human affairs; ‘calls by name’ highlights the personal calling, an important aspect of vocation throughout scripture."
    },
    {
      "pk": 29045004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 4,
      "text": "For the sake of My servant Jacob, and Israel My chosen, I have called you by name; I give you a title, though you do not know Me.",
      "links": "<a href='/AIV/01/32/28'>Gen. 32:28</a>; <a href='/AIV/23/41/8-9'>Isa. 41:8-9</a>",
      "comment": "God works through Cyrus not for his merit, but for Israel’s sake. This affirms God’s free choice and grace, themes consistent in both Old and New Covenants."
    },
    {
      "pk": 29045005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 5,
      "text": "I am the LORD, and there is no other; besides Me there is no god. I equip you, though you do not know Me,",
      "links": "<a href='/AIV/05/6/4'>Deut. 6:4</a>; <a href='/AIV/23/44/6'>Isa. 44:6</a>",
      "comment": "A central affirmation of monotheism, foundational to biblical faith. This shapes later Christological doctrine: One God revealed in fullness."
    },
    {
      "pk": 29045006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 6,
      "text": "so that people may know, from the rising of the sun and from its setting, that there is none besides Me. I am the LORD, and there is no other.",
      "links": "<a href='/AIV/19/113/3'>Ps. 113:3</a>; <a href='/AIV/23/42/8'>Isa. 42:8</a>",
      "comment": "God’s universal sovereignty: His lordship is global, not limited. This echoes themes of true unity and universality in God’s plan."
    },
    {
      "pk": 29045007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 7,
      "text": "I form light and create darkness, I make well-being and create calamity; I am the LORD, who does all these things.",
      "links": "<a href='/AIV/01/1/3-5'>Gen. 1:3-5</a>; <a href='/AIV/25/3/38'>Lam. 3:38</a>",
      "comment": "God’s absolute authority over creation—both good and evil (calamity), showing that all things are subject to His providence. This supports a robust theology of God's sovereignty."
    },
    {
      "pk": 29045008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 8,
      "text": "Shower down, O heavens, from above, and let the clouds rain down righteousness; let the earth open, so that salvation may sprout, and righteousness spring up together. I, the LORD, have created it.",
      "links": "<a href='/AIV/19/85/11'>Ps. 85:11</a>; <a href='/AIV/23/61/11'>Isa. 61:11</a>",
      "comment": "A poetic call for the coming of salvation and righteousness. Early Christians saw this as prophetically pointing to the Incarnation and spiritual rebirth (cf. <a href='/AIV/42/1/35'>Luke 1:35</a>)."
    },
    {
      "pk": 29045009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 9,
      "text": "Woe to anyone who strives with his Maker—one clay pot among the pots of earth! Does the clay say to the potter, 'What are you making?' or 'Your work has no handles'?",
      "links": "<a href='/AIV/24/18/6'>Jer. 18:6</a>; <a href='/AIV/45/9/20'>Rom. 9:20</a>",
      "comment": "God's authority over creation likened to a potter over clay. Paul picks this up in Romans, highlighting human dependence and trust in Divine wisdom."
    },
    {
      "pk": 29045010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 10,
      "text": "Woe to anyone who says to a father, 'What are you begetting?' or to a woman, 'Why are you in labor?'",
      "links": "<a href='/AIV/01/30/2'>Gen. 30:2</a>; <a href='/AIV/01/18/13'>Gen. 18:13</a>",
      "comment": "Questioning God’s plans is likened to questioning parents about birth, emphasizing the mystery of God’s creative acts and their goodness."
    },
    {
      "pk": 29045011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 11,
      "text": "Thus says the LORD, the Holy One of Israel, and his Maker: 'Ask Me about things to come concerning My sons, and make commands about the work of My hands.'",
      "links": "<a href='/AIV/23/43/3'>Isa. 43:3</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "God invites us into His mystery, but within limits; He remains sovereign and holy. The reference to 'sons' points to God's intimate relationship with His people."
    },
    {
      "pk": 29045012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 12,
      "text": "I made the earth and created humanity upon it; My hands stretched out the heavens, and I command all their host.",
      "links": "<a href='/AIV/01/1/26'>Gen. 1:26</a>; <a href='/AIV/19/102/25'>Ps. 102:25</a>",
      "comment": "Clear echo of Genesis: God as Creator of all, affirming His universal authority over both earth and heaven."
    },
    {
      "pk": 29045013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 13,
      "text": "I have stirred him up in righteousness, and I will make all his ways straight. He shall build My city and set My exiles free, not for price or reward, says the LORD of hosts.",
      "links": "<a href='/AIV/15/1/2-4'>Ezra 1:2-4</a>; <a href='/AIV/23/44/28'>Isa. 44:28</a>",
      "comment": "Cyrus’s restoration of Jerusalem points forward to the true restoration accomplished through Christ’s work (cf. <a href='/AIV/42/4/18'>Luke 4:18</a>)."
    },
    {
      "pk": 29045014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 14,
      "text": "Thus says the LORD: 'The wealth of Egypt and the merchandise of Cush, and the Sabeans, men of stature, shall come over to you and shall be yours; they shall follow you, and bow down to you. They shall plead with you, saying, ‘Surely God is with you, and there is no other, no god besides Him.’'",
      "links": "<a href='/AIV/19/72/10'>Ps. 72:10</a>; <a href='/AIV/23/19/18-25'>Isa. 19:18-25</a>",
      "comment": "Foreign nations acknowledging God among His people foreshadows the gathering of all nations, a theme fulfilled in the New Covenant church."
    },
    {
      "pk": 29045015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 15,
      "text": "Truly, You are a God who hides Himself, O God of Israel, the Savior.",
      "links": "<a href='/AIV/19/44/24'>Ps. 44:24</a>; <a href='/AIV/46/2/7'>1 Cor. 2:7</a>",
      "comment": "God’s ways are mysterious. This spiritual truth is especially significant in the doctrine of salvation and the Incarnation—God’s hidden yet revealed plan."
    },
    {
      "pk": 29045016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 16,
      "text": "All who are makers of idols are put to shame and confounded; they go into confusion together.",
      "links": "<a href='/AIV/23/44/9-11'>Isa. 44:9-11</a>; <a href='/AIV/19/97/7'>Ps. 97:7</a>",
      "comment": "Idolatry ultimately leads to shame, contrasting with the security found in true worship. Affirms the exclusivity and superiority of the worship of the One True God."
    },
    {
      "pk": 29045017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 17,
      "text": "But Israel is saved by the LORD with an everlasting salvation; you shall not be shamed or disgraced forever and ever.",
      "links": "<a href='/AIV/19/125/1'>Ps. 125:1</a>; <a href='/AIV/45/10/11'>Rom. 10:11</a>",
      "comment": "Everlasting salvation hints at God’s eternal plan. The motif of security and perpetual salvation is a key doctrine carried into the New Testament."
    },
    {
      "pk": 29045018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 18,
      "text": "For thus says the LORD, who created the heavens—He is God, who formed the earth and made it, He established it; He did not create it to be empty, but formed it to be inhabited: 'I am the LORD, and there is no other.'",
      "links": "<a href='/AIV/01/1/1-2'>Gen. 1:1-2</a>; <a href='/AIV/40/22/32'>Matt. 22:32</a>",
      "comment": "Divine intention for creation to be full, not empty—reflects God’s purposeful act. This prepares for spiritual fulfillment later achieved in the fullness of the faithful."
    },
    {
      "pk": 29045019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 19,
      "text": "'I did not speak in secret, in a land of darkness; I did not say to the offspring of Jacob, ‘Seek Me in vain.’ I the LORD speak righteousness, I declare what is right.'",
      "links": "<a href='/AIV/23/48/16'>Isa. 48:16</a>; <a href='/AIV/19/138/3'>Ps. 138:3</a>",
      "comment": "God’s revelation is open and righteousness; His promises to Israel are trustworthy and visible. This foreshadows the clarity of revelation in Christ."
    },
    {
      "pk": 29045020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 20,
      "text": "Gather yourselves and come; draw near together, you survivors of the nations! They have no knowledge who carry about their wooden idols and pray to a god that cannot save.",
      "links": "<a href='/AIV/23/43/9'>Isa. 43:9</a>; <a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>",
      "comment": "The futility of idolatry contrasted with the saving power of God, again emphasizing universal invitation and the definitive unity of true faith."
    },
    {
      "pk": 29045021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 21,
      "text": "Declare and set forth your case, let them consult together! Who announced this from ancient times? Who declared it long ago? Was it not I, the LORD? There is no other god besides Me, a righteous God and a Savior; there is none besides Me.",
      "links": "<a href='/AIV/23/46/9-10'>Isa. 46:9-10</a>; <a href='/AIV/28/13/4'>Hos. 13:4</a>",
      "comment": "God’s sole divinity, righteous and for salvation. The theme of righteousness and salvation is developed fully in Christ’s redeeming work."
    },
    {
      "pk": 29045022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 22,
      "text": "'Turn to Me and be saved, all the ends of the earth; for I am God, and there is no other.'",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/43/3/16-17'>John 3:16-17</a>",
      "comment": "A global invitation to salvation. Early Christian preaching saw this as fulfilled in the Great Commission and the universal reach of the Gospel."
    },
    {
      "pk": 29045023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 23,
      "text": "'By Myself I have sworn; from My mouth has gone out righteousness, a word that shall not return: To Me every knee shall bow, every tongue shall confess.'",
      "links": "<a href='/AIV/45/14/11'>Rom. 14:11</a>; <a href='/AIV/50/2/10-11'>Phil. 2:10-11</a>",
      "comment": "Paul cites this in Philippians about Christ, seeing every tongue confessing Christ as Lord as ultimate fulfillment. See also in worship: both liturgical and personal surrender to God."
    },
    {
      "pk": 29045024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 24,
      "text": "'Only in the LORD, it shall be said of Me, are righteousness and strength.' To Him people shall come, and all who were angry at Him shall be ashamed.",
      "links": "<a href='/AIV/45/3/22'>Rom. 3:22</a>; <a href='/AIV/60/2/6'>1 Pet. 2:6</a>",
      "comment": "True righteousness and strength are found only in God; foreshadows justification and sanctification as gifts from God alone."
    },
    {
      "pk": 29045025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 45,
      "verse": 25,
      "text": "In the LORD all the offspring of Israel shall be justified and shall glory.",
      "links": "<a href='/AIV/45/5/2'>Rom. 5:2</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "‘Justified in the LORD’ anticipates the doctrine of justification, a key point in faith—communicated not by works but through union with God's saving work."
    }
  ],
  "translatedAt": "2025-12-24T08:12:12.769Z"
}