{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 21,
  "verses": [
    {
      "pk": 29021001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 1,
      "text": "The oracle concerning the desert by the sea: As tempests sweep through the Negev, so it comes from the desert, from a terrifying land.",
      "links": "<a href='/AIV/23/13/1'>Isa. 13:1</a>; <a href='/AIV/24/50/36-38'>Jer. 50:36-38</a>",
      "comment": "The 'desert by the sea' refers prophetically to Babylon, which was near a desert and called 'by the sea' because of its canals. This oracle foreshadows judgment."
    },
    {
      "pk": 29021002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 2,
      "text": "A harsh vision has been shown to me: The traitor betrays, and the destroyer destroys. Go up, Elam! Lay siege, Media! I have put an end to all her groaning.",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>; <a href='/AIV/27/5/28'>Dan. 5:28</a>",
      "comment": "Here Isaiah sees the Medes and Persians (Elam and Media) conquering Babylon. Prophecy is set in specific history, but the spiritual meaning looks ahead to the judgment of all nations."
    },
    {
      "pk": 29021003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 3,
      "text": "Therefore my loins are filled with anguish; pangs have seized me, like the pangs of a woman in labor. I am too distressed to hear, I am too dismayed to see.",
      "links": "<a href='/AIV/23/13/8'>Isa. 13:8</a>; <a href='/AIV/42/21/25'>Luke 21:25-26</a>",
      "comment": "Isaiah empathizes deeply with the coming suffering. The comparison to birth pangs is a recurring biblical image (see Matt 24:8), pointing to God's ultimate purposes through suffering and judgment."
    },
    {
      "pk": 29021004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 4,
      "text": "My heart staggers; horror terrifies me. The twilight I longed for has been turned into trembling for me.",
      "links": "<a href='/AIV/34/2/10'>Nah. 2:10</a>; <a href='/AIV/23/22/4'>Isa. 22:4</a>",
      "comment": "Isaiah's reaction demonstrates the true prophet’s sorrow at coming judgment, yet God's justice prevails. The image of 'twilight' reversed reminds readers how human longings are changed by God's plans."
    },
    {
      "pk": 29021005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 5,
      "text": "'They set the table, spread the rugs, they eat, they drink. Arise, you princes, oil the shields!'",
      "links": "<a href='/AIV/27/5/1'>Dan. 5:1</a>",
      "comment": "This scene foreshadows the sudden fall of Babylon during a feast (see Daniel 5). God's judgment often arrives when the world least expects it, a warning to remain vigilant (cf. Matt 24:42)."
    },
    {
      "pk": 29021006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 6,
      "text": "For the Lord said to me: 'Go, set a watchman; let him announce what he sees.'",
      "links": "<a href='/AIV/26/33/2-7'>Ezek. 33:2-7</a>",
      "comment": "The office of watchman is symbolic of spiritual leadership—called to warn and guide God's people. The theme of divinely appointed guardians continues throughout Scripture (cf. Heb 13:17)."
    },
    {
      "pk": 29021007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 7,
      "text": "When he sees riders, horsemen in pairs, riders on donkeys, riders on camels, let him listen diligently, very attentively.",
      "links": "<a href='/AIV/2/14/9'>Exod. 14:9</a>",
      "comment": "Details of the approaching army emphasize the accuracy of prophecy. The watchman's diligence is a call for the faithful to be alert and attentive to God's movements in history."
    },
    {
      "pk": 29021008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 8,
      "text": "Then the watchman cried, 'Upon the watchtower, O Lord, I stand continually by day; and at my post I stay all night.'",
      "links": "<a href='/AIV/35/2/1'>Hab. 2:1</a>",
      "comment": "Constant vigilance. The watchman's persistence is a pattern for prayer (cf. Luke 18:1). That prayer is to be ceaseless and faithful, in union with God’s will."
    },
    {
      "pk": 29021009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 9,
      "text": "And behold, here come riders, horsemen in pairs! And he answered, 'Fallen, fallen is Babylon; and all the carved images of her gods he has shattered to the ground.'",
      "links": "<a href='/AIV/24/51/8'>Jer. 51:8</a>; <a href='/AIV/66/14/8'>Rev. 14:8</a>",
      "comment": "Babylon’s fall is later echoed in Revelation, showing the spiritual and eschatological dimension of earthly judgment. The shattering of idols points to the necessity of right worship (cf. Exod. 20:3-5)."
    },
    {
      "pk": 29021010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 10,
      "text": "O my threshed and winnowed ones, what I have heard from the Lord of hosts, the God of Israel, I proclaim to you.",
      "links": "<a href='/AIV/23/41/15'>Isa. 41:15</a>; <a href='/AIV/40/3/12'>Matt. 3:12</a>",
      "comment": "The faithful are described as wheat, sifted and preserved by the Lord. This connects to New Testament imagery of Christ separating the wheat from the chaff and preserving His people."
    },
    {
      "pk": 29021011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 11,
      "text": "The oracle concerning Dumah: One calls to me from Seir, 'Watchman, what of the night? Watchman, what of the night?'",
      "links": "<a href='/AIV/1/25/23'>Gen. 25:23</a>",
      "comment": "Dumah and Seir refer to Edom’s territory. The repeated question signifies spiritual longing and uncertainty about God’s timing. Spiritual darkness here points symbolically to life without the light of revelation."
    },
    {
      "pk": 29021012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 12,
      "text": "The watchman said, 'Morning comes, and also the night. If you will inquire, inquire; come back again.'",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "True hope is mixed with sober warning: blessing and judgment are both on the horizon. Repeated invitation to 'inquire' echoes biblical invitations to persistent, faithful seeking (Matt. 7:7)."
    },
    {
      "pk": 29021013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 13,
      "text": "The oracle concerning Arabia: In the thickets in Arabia you will lodge, O caravans of Dedanites.",
      "links": "<a href='/AIV/1/25/3'>Gen. 25:3</a>",
      "comment": "The Dedanites—a trading people—are forced into hiding. The prophecy shows how even those dwelling in remote regions are not beyond God’s reach."
    },
    {
      "pk": 29021014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 14,
      "text": "Bring water to meet the thirsty! Inhabitants of the land of Tema, greet the fugitives with bread.",
      "links": "<a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "Hospitality to the needy is enjoined here, anticipating Christ’s teaching about caring for 'the least of these.' This reflects Old Testament law and is fulfilled in the new covenant command to love neighbor as self."
    },
    {
      "pk": 29021015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 15,
      "text": "For they have fled from swords, from the drawn sword, from the bent bow, from the heat of battle.",
      "links": "<a href='/AIV/19/3/1'>Ps. 3:1</a>",
      "comment": "Refugees are driven by violence and war. In the broader biblical story, God's protection of the persecuted foreshadows His mercy and the Church's role in providing refuge and sanctuary."
    },
    {
      "pk": 29021016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 16,
      "text": "For thus the Lord said to me: 'Within a year, according to the years of a hired worker, all the glory of Kedar will come to an end.'",
      "links": "<a href='/AIV/23/16/14'>Isa. 16:14</a>",
      "comment": "God’s timing is precise and merciful, giving warning before judgment. Kedar, descended from Ishmael, reminds us of God’s attention to all nations, not just Israel."
    },
    {
      "pk": 29021017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 21,
      "verse": 17,
      "text": "And the remainder of the archers, the mighty men of the sons of Kedar, will be few; for the Lord, the God of Israel, has spoken.",
      "links": "<a href='/AIV/23/10/19'>Isa. 10:19</a>; <a href='/AIV/19/33/9'>Ps. 33:9</a>",
      "comment": "A remnant motif reappears here. God’s word is unfailing. The few who remain reflect the preserving grace that always accompanies divine judgment, pointing to the remnant principle fulfilled in Christ and His body."
    }
  ],
  "translatedAt": "2025-12-24T08:00:00.510Z"
}