{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 52,
  "verses": [
    {
      "pk": 29052001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 1,
      "text": "Awake, awake, put on your strength, O Zion; put on your beautiful garments, Jerusalem, the holy city. For the uncircumcised and the unclean shall never enter you again.",
      "links": "<a href='/AIV/23/51/9'>Isa. 51:9</a>; <a href='/AIV/26/44/9'>Ezek. 44:9</a>; <a href='/AIV/66/60/1'>Isa. 60:1</a>",
      "comment": "The call for Zion and Jerusalem to awaken and clothe themselves in glory foreshadows spiritual renewal and holiness, later fulfilled through the Church purified by Christ (see Eph. 5:25-27). The emphasis on being 'clean' anticipates the establishment of a community marked by holiness and sacramental grace."
    },
    {
      "pk": 29052002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 2,
      "text": "Shake yourself from the dust; arise, sit down, O Jerusalem; loose yourself from the bonds of your neck, O captive daughter of Zion.",
      "links": "<a href='/AIV/19/113/7'>Ps. 113:7</a>; <a href='/AIV/23/51/17'>Isa. 51:17</a>",
      "comment": "The command to 'arise and sit' suggests both freedom from captivity and taking a place of dignity. The imagery parallels what Christ achieves in freeing humanity from the bondage of sin and elevating the faithful."
    },
    {
      "pk": 29052003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 3,
      "text": "For thus says the LORD: You were sold for nothing, and you shall be redeemed without money.",
      "links": "<a href='/AIV/19/44/12'>Ps. 44:12</a>; <a href='/AIV/46/6/20'>1 Cor. 6:20</a>; <a href='/AIV/60/1/18-19'>1 Pet. 1:18-19</a>",
      "comment": "Redemption 'without money' points to a deeper reality, fulfilled in Christ's sacrificial death (see 1 Peter 1:18-19), where the price paid is not silver or gold, but His own life."
    },
    {
      "pk": 29052004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 4,
      "text": "For thus says the Lord GOD: My people went down at first into Egypt to dwell there; then Assyria oppressed them without cause.",
      "links": "<a href='/AIV/02/1/1-8'>Ex. 1:1-8</a>; <a href='/AIV/12/17/6'>2 Kings 17:6</a>",
      "comment": "The mention of Egypt and Assyria recalls times of foreign oppression, setting the stage for understanding salvation history as an ongoing story of deliverance culminating in Christ's ultimate liberation."
    },
    {
      "pk": 29052005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 5,
      "text": "Now therefore, what have I here, says the LORD, that My people are taken away for nothing? Those who rule over them mock, declares the LORD, and continually My name is despised.",
      "links": "<a href='/AIV/26/36/20-23'>Ezek. 36:20-23</a>; <a href='/AIV/19/22/7'>Ps. 22:7</a>; <a href='/AIV/45/2/24'>Rom. 2:24</a>",
      "comment": "The continuous blasphemy of God's name among the nations stresses the necessity for God's intervention. This anticipates the sanctification of God's people, which Christ would complete for all nations."
    },
    {
      "pk": 29052006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 6,
      "text": "Therefore My people shall know My name; in that day they shall know that it is I who speak; behold, it is I.",
      "links": "<a href='/AIV/23/41/4'>Isa. 41:4</a>; <a href='/AIV/43/8/24'>John 8:24</a>; <a href='/AIV/02/3/14'>Ex. 3:14</a>",
      "comment": "The declaration 'It is I' echoes the divine self-identification ('I Am') and foreshadows Christ's own claims to divinity (see John 8:58), showing the unity of God's revelation."
    },
    {
      "pk": 29052007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 7,
      "text": "How beautiful upon the mountains are the feet of the one who brings good news, who announces peace, who brings glad tidings of good things, who proclaims salvation, who says to Zion, 'Your God reigns.'",
      "links": "<a href='/AIV/45/10/15'>Rom. 10:15</a>; <a href='/AIV/23/40/9'>Isa. 40:9</a>; <a href='/AIV/19/96/10'>Ps. 96:10</a>",
      "comment": "This verse is quoted by Paul in Romans to refer to the proclamation of the Gospel. The spiritual application is the beautiful mission of those who spread the message of Christ’s salvation throughout the world."
    },
    {
      "pk": 29052008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 8,
      "text": "The voice of your watchmen—they lift up their voices, together they sing for joy; for eye to eye they see the return of the LORD to Zion.",
      "links": "<a href='/AIV/19/126/2'>Ps. 126:2</a>; <a href='/AIV/23/62/6'>Isa. 62:6</a>",
      "comment": "The unity of the watchmen heralds the restoration of God's people and prefigures the joy of the Church in recognizing Christ's return and His presence among the faithful."
    },
    {
      "pk": 29052009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 9,
      "text": "Break forth together into singing, you waste places of Jerusalem, for the LORD has comforted His people; He has redeemed Jerusalem.",
      "links": "<a href='/AIV/23/40/1'>Isa. 40:1</a>; <a href='/AIV/42/2/38'>Luke 2:38</a>",
      "comment": "This comfort and redemption are ultimately fulfilled in Christ, whose sacrifice brings true restoration and eternal comfort to God's people."
    },
    {
      "pk": 29052010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 10,
      "text": "The LORD has bared His holy arm in the sight of all the nations, and all the ends of the earth shall see the salvation of our God.",
      "links": "<a href='/AIV/23/53/1'>Isa. 53:1</a>; <a href='/AIV/19/98/2-3'>Ps. 98:2-3</a>; <a href='/AIV/42/2/30-31'>Luke 2:30-31</a>",
      "comment": "The 'bare arm' refers to God's direct and powerful action, which the New Testament reveals as Christ Himself—salvation visible to all people everywhere."
    },
    {
      "pk": 29052011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 11,
      "text": "Depart, depart, go out from there; touch no unclean thing; go out from the midst of her, purify yourselves, you who carry the vessels of the LORD.",
      "links": "<a href='/AIV/47/6/17'>2 Cor. 6:17</a>; <a href='/AIV/15/2/2'>Ezra 2:2</a>",
      "comment": "Purity for those carrying the Lord’s vessels anticipates the call to holiness for all ministers and the faithful, especially in liturgical service and sacramental ministry."
    },
    {
      "pk": 29052012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 12,
      "text": "For you shall not go out in haste, nor go as fugitives; for the LORD will go before you, and the God of Israel will be your rear guard.",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>; <a href='/AIV/23/58/8'>Isa. 58:8</a>",
      "comment": "God’s presence before and behind recalls the Exodus and guarantees protection. This mirrors Christ’s promise to always be with His people and guide them safely."
    },
    {
      "pk": 29052013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 13,
      "text": "Behold, My servant shall act wisely; he shall be exalted, lifted up, and shall be very high.",
      "links": "<a href='/AIV/50/2/9'>Phil. 2:9</a>; <a href='/AIV/23/53/10'>Isa. 53:10</a>",
      "comment": "This begins the famous 'Servant Song,' prophetic of Christ’s Passion, Resurrection, and Ascension—His ultimate exaltation as Lord over all."
    },
    {
      "pk": 29052014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 14,
      "text": "Just as many were astonished at you—his appearance was so disfigured beyond human likeness, and his form marred beyond that of the sons of men—",
      "links": "<a href='/AIV/23/53/2-3'>Isa. 53:2-3</a>; <a href='/AIV/40/27/29-30'>Matt. 27:29-30</a>",
      "comment": "This describes the suffering and humiliation endured by the Servant, fulfilled in Christ’s Passion, displaying both His deep sacrificial love and the profound mystery of redemption."
    },
    {
      "pk": 29052015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 52,
      "verse": 15,
      "text": "so he will sprinkle many nations. Kings shall shut their mouths at him; for that which has not been told them they shall see, and that which they have not heard they shall understand.",
      "links": "<a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/18/29/22'>Job 29:22</a>; <a href='/AIV/45/15/21'>Rom. 15:21</a>",
      "comment": "‘Sprinkle’ alludes to priestly purification (see Lev. 16:14), fulfilled in Christ’s atoning blood which cleanses and makes holy. The astonishment of kings points to the conversion of nations and the universal scope of Christ’s redemptive work (Rom. 15:21)."
    }
  ],
  "translatedAt": "2025-12-24T08:15:11.630Z"
}