{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 34,
  "verses": [
    {
      "pk": 29034001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 1,
      "text": "Come near, O nations, to hear, and give attention, O peoples! Let the earth hear, and all that fills it; the world, and all that comes from it.",
      "links": "<a href='/AIV/23/1/2'>Isaiah 1:2</a>; <a href='/AIV/19/49/1'>Psalm 49:1</a>",
      "comment": "Isaiah summons all peoples to listen to God's coming judgment, demonstrating the universality of God's authority."
    },
    {
      "pk": 29034002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 2,
      "text": "For the Lord is enraged against all the nations, and furious against all their armies; he will set them apart for destruction, he will give them to slaughter.",
      "links": "<a href='/AIV/19/110/6'>Psalm 110:6</a>; <a href='/AIV/23/13/5'>Isaiah 13:5</a>",
      "comment": "This verse stresses God’s justice and power over all nations, foreshadowing the ultimate judgment and the need for unity with God’s will."
    },
    {
      "pk": 29034003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 3,
      "text": "Their slain shall be cast out, and the stench of their corpses shall rise; the mountains will melt with their blood.",
      "links": "<a href='/AIV/66/14/20'>Revelation 14:20</a>; <a href='/AIV/23/14/19'>Isaiah 14:19</a>",
      "comment": "This graphic image of judgment points toward both historical judgments and the finality of God's justice. It echoes imagery later found in Revelation."
    },
    {
      "pk": 29034004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 4,
      "text": "All the host of heaven will rot away, and the skies will be rolled up like a scroll. All their host shall fall, as leaves fall from a vine, like leaves falling from the fig tree.",
      "links": "<a href='/AIV/66/6/14'>Revelation 6:14</a>; <a href='/AIV/40/24/29'>Matthew 24:29</a>",
      "comment": "Apocalyptic images here are echoed by Jesus and John, referring to cosmic upheaval at the final judgment. The rolling of the skies as a scroll directly connects to new creation themes."
    },
    {
      "pk": 29034005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 5,
      "text": "For my sword has drunk its fill in the heavens; behold, it descends for judgment upon Edom, upon the people I have devoted to destruction.",
      "links": "<a href='/AIV/24/49/7-22'>Jeremiah 49:7–22</a>; <a href='/AIV/31/1/1'>Obadiah 1:1</a>",
      "comment": "Edom symbolizes all nations hostile to God’s people. This anticipates the biblical pattern where God judges enemies and purifies his chosen community."
    },
    {
      "pk": 29034006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 6,
      "text": "The Lord’s sword is filled with blood; it is made fat with the blood of lambs and goats, with the fat of the kidneys of rams. For the Lord has a sacrifice in Bozrah, a great slaughter in the land of Edom.",
      "links": "<a href='/AIV/23/63/1-6'>Isaiah 63:1-6</a>; <a href='/AIV/19/50/14'>Psalm 50:14</a>",
      "comment": "God’s judgment is described in sacrificial terms. These themes prefigure the New Testament sacrificial atonement through Christ, the ultimate sacrifice."
    },
    {
      "pk": 29034007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 7,
      "text": "Wild oxen shall fall with them, and young bulls with mighty bulls. Their land will be soaked with blood, and their dust made fat with fatness.",
      "links": "<a href='/AIV/36/1/17-18'>Zephaniah 1:17-18</a>",
      "comment": "The inclusion of sacrificial animals points to the thoroughness and totality of the judgment, echoing liturgical imagery."
    },
    {
      "pk": 29034008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 8,
      "text": "For the Lord has a day of vengeance, a year of recompense for the cause of Zion.",
      "links": "<a href='/AIV/23/61/2'>Isaiah 61:2</a>; <a href='/AIV/66/6/17'>Revelation 6:17</a>",
      "comment": "God’s justice defends Zion and fulfills divine promises. This points to God’s protective care for his people and ultimately, the sanctification of the faithful."
    },
    {
      "pk": 29034009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 9,
      "text": "Edom’s streams will be turned into pitch, her soil into sulfur; her land shall become burning pitch.",
      "links": "<a href='/AIV/01/19/24'>Genesis 19:24</a>; <a href='/AIV/66/19/3'>Revelation 19:3</a>",
      "comment": "The fate of Edom mirrors that of Sodom, symbolizing complete destruction that is a warning to all who reject God’s authority."
    },
    {
      "pk": 29034010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 10,
      "text": "Night and day it shall not be quenched; its smoke shall go up forever. From generation to generation it will lie waste; none shall pass through it forever and ever.",
      "links": "<a href='/AIV/66/18/9'>Revelation 18:9</a>; <a href='/AIV/66/14/11'>Revelation 14:11</a>",
      "comment": "This judgment’s eternal nature foreshadows New Testament teaching on final judgment and the permanence of spiritual consequences."
    },
    {
      "pk": 29034011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 11,
      "text": "But the desert owl and the screech owl shall possess it; the owl and the raven shall dwell in it. He shall stretch the line of confusion over it, and the plumb line of emptiness.",
      "links": "<a href='/AIV/24/4/23-26'>Jeremiah 4:23-26</a>",
      "comment": "Isaiah describes Edom’s transformation from a city to a wasteland, echoing Genesis imagery of uncreation—order returning to chaos."
    },
    {
      "pk": 29034012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 12,
      "text": "Its nobles—there is no one there to call a kingdom, and all its princes shall be nothing.",
      "links": "<a href='/AIV/23/24/21'>Isaiah 24:21</a>",
      "comment": "The loss of rulers highlights the total devastation and the reversal of worldly power, reminding the faithful to trust in an everlasting kingdom."
    },
    {
      "pk": 29034013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 13,
      "text": "Thorns shall grow over its strongholds, nettles and brambles in its fortresses. It will become a habitation of jackals, a home for ostriches.",
      "links": "<a href='/AIV/35/3/6'>Habakkuk 3:6</a>; <a href='/AIV/34/2/10-13'>Nahum 2:10-13</a>",
      "comment": "Formerly strong places are left to ruin, symbolizing the futility of defending anything apart from God’s will and order."
    },
    {
      "pk": 29034014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 14,
      "text": "Wild animals shall meet with hyenas; the goat-demon shall cry to his fellow; indeed, there the night creature settles and finds herself a resting place.",
      "links": "<a href='/AIV/03/17/7'>Leviticus 17:7</a>; <a href='/AIV/23/13/21-22'>Isaiah 13:21-22</a>",
      "comment": "These eerie images reveal spiritual overtones, showing chaos where God's order is rejected. The reference to demonic creatures points to the reality of both physical and spiritual consequences."
    },
    {
      "pk": 29034015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 15,
      "text": "There the owl nests and lays and hatches and gathers her young in her shadow; there also the hawks gather, each one with her mate.",
      "links": "<a href='/AIV/19/102/6'>Psalm 102:6</a>",
      "comment": "Birds of desolation fill the ruined land, underscoring the fullness of judgment and the consequences of persistent separation from God."
    },
    {
      "pk": 29034016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 16,
      "text": "Seek and read from the book of the Lord: Not one of these shall be missing; none shall be without its mate. For his mouth has commanded, and his Spirit has gathered them.",
      "links": "<a href='/AIV/23/55/11'>Isaiah 55:11</a>; <a href='/AIV/01/1/2'>Genesis 1:2</a>",
      "comment": "Isaiah urges attention to Scripture, affirming that God’s word and Spirit are inseparable and always fulfilled—a foundation for faith in ongoing divine guidance."
    },
    {
      "pk": 29034017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 34,
      "verse": 17,
      "text": "He has cast the lot for them, and his hand has portioned it out to them with the measuring line; they shall possess it forever; from generation to generation they shall dwell in it.",
      "links": "<a href='/AIV/19/125/3'>Psalm 125:3</a>; <a href='/AIV/23/61/7'>Isaiah 61:7</a>",
      "comment": "The final verse claims God’s sovereignty over judgment and inheritance. Just as God’s people inherit blessing, God’s justice is everlasting. This points forward to the promise of an eternal inheritance for the faithful, maintained throughout generations according to God’s plan."
    }
  ],
  "translatedAt": "2025-12-24T08:06:34.448Z"
}