{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 12,
  "verses": [
    {
      "pk": 29012001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 1,
      "text": "On that day you will say: 'I will praise you, LORD. Even though you were angry with me, your anger has turned away, and you have comforted me.'",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/23/10/25'>Isa. 10:25</a>; <a href='/AIV/28/14/4'>Hos. 14:4</a>",
      "comment": "Isaiah begins by speaking of a future day of rejoicing, when God's anger turns into comfort. This foreshadows the restoration through God's mercy, reminiscent of the pattern of sin, repentance, and forgiveness. The language echoes the comfort promised in later passages (Isaiah 40:1) and points to a God who disciplines but ultimately restores His people."
    },
    {
      "pk": 29012002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 2,
      "text": "See, God is my salvation; I will trust and not be afraid. For the LORD, the LORD himself, is my strength and my song, and he has become my salvation.",
      "links": "<a href='/AIV/02/15/2'>Ex. 15:2</a>; <a href='/AIV/19/118/14'>Ps. 118:14</a>",
      "comment": "Isaiah draws from Israel’s song at the Red Sea (Exodus 15:2), placing trust in the Lord as Savior. This anticipates the individual and communal trust in God's saving work, which Christians understand as fulfilled most perfectly in Jesus Christ, the true salvation sent by God. The double use of 'the LORD' emphasizes God's covenant identity."
    },
    {
      "pk": 29012003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 3,
      "text": "With joy you will draw water from the wells of salvation.",
      "links": "<a href='/AIV/43/4/10-14'>John 4:10-14</a>; <a href='/AIV/43/7/37-39'>John 7:37-39</a>",
      "comment": "Isaiah uses 'wells of salvation' as an image for the abundant grace God offers, which New Testament writers see fulfilled in Christ, the source of living water (John 4:14). This foreshadows not only future rejoicing in God’s mercy but also the sacraments by which grace is communicated to believers."
    },
    {
      "pk": 29012004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 4,
      "text": "On that day you will say: 'Give thanks to the LORD; call on his name. Make known his deeds among the nations; proclaim that his name is exalted.'",
      "links": "<a href='/AIV/13/16/8'>1 Chron. 16:8</a>; <a href='/AIV/19/105/1'>Ps. 105:1</a>",
      "comment": "The call to declare God's deeds among the nations hints at a universal mission—witnessing God's glory to all people, not just Israel (see Genesis 12:3). The elevated name of the Lord prepares the way for the broader understanding of the people of God as a light to the nations, finding full meaning in the Church's mission."
    },
    {
      "pk": 29012005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 5,
      "text": "Sing to the LORD, for he has done glorious things; let this be known throughout all the earth.",
      "links": "<a href='/AIV/02/15/1'>Ex. 15:1</a>; <a href='/AIV/23/42/10-12'>Isa. 42:10-12</a>",
      "comment": "Worship and proclamation are bound together. The works of God, especially salvation, prompt not only private praise but public declaration. True worship leads to mission. The universality again foreshadows God’s plan to unite all peoples in praise of Him."
    },
    {
      "pk": 29012006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 12,
      "verse": 6,
      "text": "Cry out and sing for joy, you who dwell in Zion, for great in your midst is the Holy One of Israel.",
      "links": "<a href='/AIV/23/6/3'>Isa. 6:3</a>; <a href='/AIV/26/48/35'>Ezek. 48:35</a>",
      "comment": "The presence of the 'Holy One' among His people connects to both Temple worship and the later promise of God dwelling with humanity (Ezek. 48:35, 'The LORD is there'). Christians see this profoundly realized in the incarnation—God coming to dwell not just symbolically but personally among us in Jesus (John 1:14), a theme echoed in sacramental theology as God remains truly present among His people."
    }
  ],
  "translatedAt": "2025-12-24T07:56:30.558Z"
}