{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 65,
  "verses": [
    {
      "pk": 29065001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 1,
      "text": "I was sought by those who did not ask for Me; I was found by those who did not seek Me. I said, ‘Here I am, here I am,’ to a nation that was not called by My name.",
      "links": "<a href='/AIV/45/10/20'>Rom. 10:20</a>; <a href='/AIV/28/2/23'>Hos. 2:23</a>",
      "comment": "Paul quotes this verse in Romans, interpreting it as God's openness to Gentiles. The literal meaning addresses God's readiness to reveal Himself even to those distant from Him. Spiritually, it points forward to the universal outreach of salvation, fulfilled in Christ and the Church's worldwide mission."
    },
    {
      "pk": 29065002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 2,
      "text": "I spread out My hands all day long to a rebellious people, who walk in a way that is not good, following their own thoughts;",
      "links": "<a href='/AIV/45/10/21'>Rom. 10:21</a>; <a href='/AIV/05/32/5'>Deut. 32:5</a>",
      "comment": "God's patience and persistent offer of grace is emphasized. While literally directed at Israel, the spiritual meaning points to God's endless mercy and initiative in reaching out to humanity despite repeated rebellion."
    },
    {
      "pk": 29065003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 3,
      "text": "A people who provoke Me continually to My face, sacrificing in gardens and burning incense on altars of brick;",
      "links": "<a href='/AIV/23/1/29'>Isa. 1:29</a>; <a href='/AIV/26/8/16-18'>Ezek. 8:16-18</a>",
      "comment": "These practices refer to idolatrous worship and syncretism. God desires worship as He prescribed, not according to human invention. The special emphasis on correct worship forms hints at the importance of liturgical tradition and fidelity."
    },
    {
      "pk": 29065004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 4,
      "text": "Who sit among the graves and spend the night in secret places; who eat the flesh of swine, and the broth of abominable things is in their vessels;",
      "links": "<a href='/AIV/03/11/7'>Lev. 11:7</a>; <a href='/AIV/24/16/18'>Jer. 16:18</a>",
      "comment": "These actions were considered ritually unclean. This verse highlights the draw toward forbidden practices, showing the need for purification and sacred boundaries in worship and daily life."
    },
    {
      "pk": 29065005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 5,
      "text": "Who say, ‘Keep to yourself, do not come near me, for I am holier than you!’ These are smoke in My nostrils, a fire that burns all day.",
      "links": "<a href='/AIV/42/18/9-14'>Lk. 18:9-14</a>",
      "comment": "False spiritual pride is condemned. Jesus' parable of the Pharisee and Tax Collector echoes this. True holiness is not found in self-righteousness but in humble obedience, inviting all into authentic community and sacramental unity."
    },
    {
      "pk": 29065006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 6,
      "text": "See, it is written before Me: I will not keep silent, but I will repay; even repay into their lap,",
      "links": "<a href='/AIV/23/59/12'>Isa. 59:12</a>; <a href='/AIV/19/50/21'>Ps. 50:21</a>",
      "comment": "Divine justice is assured; sin is never overlooked. This establishes God's unwavering commitment to moral order, yet prepares the way for mercy."
    },
    {
      "pk": 29065007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 7,
      "text": "your iniquities and the iniquities of your fathers together, says the LORD; who have burned incense on the mountains and scorned Me on the hills—I will measure their former deeds into their lap.",
      "links": "<a href='/AIV/02/34/7'>Ex. 34:7</a>; <a href='/AIV/24/32/18-19'>Jer. 32:18-19</a>",
      "comment": "The collective responsibility for sin across generations is underscored, echoing the need for generational healing—addressed sacramentally in the new covenant."
    },
    {
      "pk": 29065008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 8,
      "text": "Thus says the LORD, as the new wine is found in the cluster, and one says, ‘Do not destroy it, for there is a blessing in it,’ so I will do for My servants’ sake, that I may not destroy them all.",
      "links": "<a href='/AIV/19/80/8'>Ps. 80:8</a>; <a href='/AIV/23/6/13'>Isa. 6:13</a>",
      "comment": "Even amid judgment, God preserves a remnant—the faithful servants. The imagery of the cluster and wine foreshadows the Eucharistic imagery of blessing through sacrifice and communion."
    },
    {
      "pk": 29065009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 9,
      "text": "I will bring forth descendants from Jacob, and from Judah an inheritor of My mountains; My chosen shall inherit it, and My servants shall dwell there.",
      "links": "<a href='/AIV/45/11/5'>Rom. 11:5</a>; <a href='/AIV/24/31/1'>Jer. 31:1</a>",
      "comment": "The promise of inheritance for the chosen points to continuity of God's plan. Spiritually, this refers to the faithful remnant and prefigures the spiritual Israel—the community of believers united in one faith."
    },
    {
      "pk": 29065010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 10,
      "text": "Sharon shall become a pasture for flocks, and the Valley of Achor a resting place for herds, for My people who seek Me.",
      "links": "<a href='/AIV/28/2/15'>Hos. 2:15</a>; <a href='/AIV/06/7/26'>Josh. 7:26</a>",
      "comment": "Restoration and abundance for God's people is promised. These lands, formerly sites of sorrow, become places of peace—a literal and spiritual renewal for those who seek God."
    },
    {
      "pk": 29065011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 11,
      "text": "But you who forsake the LORD, who forget My holy mountain, who prepare a table for Fortune and fill cups of mixed wine for Destiny,",
      "links": "<a href='/AIV/05/32/15'>Deut. 32:15</a>; <a href='/AIV/23/1/13'>Isa. 1:13</a>",
      "comment": "Idolatrous worship and neglect of God's holy mountain are condemned. The reference to table prepares theological ground for proper liturgical worship centered around sacred tradition."
    },
    {
      "pk": 29065012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 12,
      "text": "I will destine you to the sword, and all of you shall bow down to slaughter; because when I called, you did not answer, when I spoke, you did not listen; but you did what was evil in My eyes and chose that in which I did not delight.",
      "links": "<a href='/AIV/23/1/19-20'>Isa. 1:19-20</a>; <a href='/AIV/20/1/24-26'>Prov. 1:24-26</a>",
      "comment": "Judgment is a consequence of persistent rejection of God's call. The stress on responsiveness is linked to the invitation to conversion and fidelity in gospel preaching."
    },
    {
      "pk": 29065013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 13,
      "text": "Therefore, thus says the Lord GOD: ‘My servants shall eat, but you shall be hungry; My servants shall drink, but you shall be thirsty; My servants shall rejoice, but you shall be put to shame;",
      "links": "<a href='/AIV/19/22/26'>Ps. 22:26</a>; <a href='/AIV/40/5/6'>Matt. 5:6</a>",
      "comment": "A sharp distinction is drawn between the faithful and the rebellious, both literally and spiritually. This foreshadows the blessings of the kingdom, with sacramental overtones of spiritual nourishment."
    },
    {
      "pk": 29065014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 14,
      "text": "My servants shall sing for joy of heart, but you shall cry out from pain of heart and wail from broken spirit.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/42/13/28'>Luke 13:28</a>",
      "comment": "Emotional and spiritual consequences are described. Compare to Jesus' warning about 'weeping and gnashing of teeth'—showing spiritual realities are tied to fidelity to God."
    },
    {
      "pk": 29065015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 15,
      "text": "You shall leave your name as a curse for My chosen; for the Lord GOD will kill you, but His servants He will call by another name.",
      "links": "<a href='/AIV/23/62/2'>Isa. 62:2</a>; <a href='/AIV/66/2/17'>Rev. 2:17</a>",
      "comment": "A new identity is promised to the faithful, foreshadowing the transformation found in Christ and in the communal identity of the Church. Spiritual rebirth is central to New Testament theology."
    },
    {
      "pk": 29065016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 16,
      "text": "So that the one who blesses himself in the land shall bless himself by the God of truth, and the one who swears in the land shall swear by the God of truth; because the former troubles are forgotten and hidden from My eyes.",
      "links": "<a href='/AIV/23/54/4'>Isa. 54:4</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "A new era of blessing and forgiveness is announced. This anticipates the promised renewal brought forth in Christ, where sin and shame are erased."
    },
    {
      "pk": 29065017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 17,
      "text": "For behold, I create new heavens and a new earth; and the former things shall not be remembered or come to mind.",
      "links": "<a href='/AIV/66/21/1'>Rev. 21:1</a>; <a href='/AIV/23/66/22'>Isa. 66:22</a>",
      "comment": "This is a major prophetic promise fulfilled in Revelation, where a new creation is inaugurated. Both literal and spiritual meanings apply, foreseeing ultimate redemption and restoration."
    },
    {
      "pk": 29065018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 18,
      "text": "But be glad and rejoice forever in what I create; for behold, I create Jerusalem a joy, and her people a gladness.",
      "links": "<a href='/AIV/66/21/2-3'>Rev. 21:2-3</a>; <a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "Jerusalem symbolizes God's people restored. In Christian tradition, this points to the heavenly city, the communion of saints and fullness of joy in the redeemed community."
    },
    {
      "pk": 29065019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 19,
      "text": "I will rejoice in Jerusalem and be glad in My people; no more shall be heard in it the sound of weeping and the cry of distress.",
      "links": "<a href='/AIV/23/35/10'>Isa. 35:10</a>; <a href='/AIV/23/25/8'>Isa. 25:8</a>",
      "comment": "God personally rejoices over His people. The absence of sorrow foreshadows ultimate restoration and eternal peace in the new creation."
    },
    {
      "pk": 29065020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 20,
      "text": "No more shall there be in it an infant who lives but a few days, or an old man who does not fill out his days; for the young shall die a hundred years old, and the sinner, a hundred years old, shall be accursed.",
      "links": "<a href='/AIV/18/5/26'>Job 5:26</a>; <a href='/AIV/23/33/24'>Isa. 33:24</a>",
      "comment": "Longevity and blessing are promised, symbolizing a reversal of the curse of death. This hints at the sacramental promise of life in Christ, transcending physical death."
    },
    {
      "pk": 29065021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 21,
      "text": "They shall build houses and inhabit them; they shall plant vineyards and eat their fruit.",
      "links": "<a href='/AIV/05/28/30'>Deut. 28:30'>; <a href='/AIV/24/31/5'>Jer. 31:5</a>",
      "comment": "The reversal of previous judgments emphasizes stability and fruitfulness—associated spiritually with the fruitful life of those united in faith and communion."
    },
    {
      "pk": 29065022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 22,
      "text": "They shall not build and another inhabit; they shall not plant and another eat. For like the days of a tree shall the days of My people be, and My chosen shall long enjoy the work of their hands.",
      "links": "<a href='/AIV/19/92/12-14'>Ps. 92:12-14</a>",
      "comment": "Security and permanence in blessings point to the hope of lasting inheritance. The imagery of trees reflects enduring life—also a symbol of the saints."
    },
    {
      "pk": 29065023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 23,
      "text": "They shall not labor in vain or bear children for calamity; for they are offspring of the blessed of the LORD, and their descendants with them.",
      "links": "<a href='/AIV/23/61/9'>Isa. 61:9</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "Fruitfulness and hope for future generations are guaranteed. This echoes both the natural and supernatural fruitfulness found among those who are truly blessed in faith."
    },
    {
      "pk": 29065024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 24,
      "text": "Before they call I will answer; while they are still speaking I will hear.",
      "links": "<a href='/AIV/23/58/9'>Isa. 58:9</a>; <a href='/AIV/19/139/4'>Ps. 139:4</a>",
      "comment": "Divine attentiveness is emphasized, suggesting the closeness of God to those in communion with Him. Spiritually, this aligns with the assurance of efficacious prayer found in the Body of Christ."
    },
    {
      "pk": 29065025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 65,
      "verse": 25,
      "text": "The wolf and the lamb shall feed together, and the lion shall eat straw like the ox; but dust shall be the serpent’s food. They shall not hurt nor destroy in all My holy mountain, says the LORD.",
      "links": "<a href='/AIV/23/11/6-9'>Isa. 11:6-9</a>; <a href='/AIV/01/3/15'>Gen. 3:15</a>",
      "comment": "A vision of perfect peace and harmony—fulfilled finally in the eschatological kingdom. The allusions point to Christ's defeat of evil and restoration of creation, realized fully in the unity of God's people in His holy presence."
    }
  ],
  "translatedAt": "2025-12-24T08:20:19.893Z"
}