{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 50,
  "verses": [
    {
      "pk": 29050001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 1,
      "text": "This is what the Lord says: Where is your mother's certificate of divorce, with which I sent her away? Or to which of My creditors did I sell you? No, you were sold because of your sins, and your mother was sent away because of your transgressions.",
      "links": "<a href='/AIV/24/3/8'>Jer. 3:8</a>; <a href='/AIV/28/2/2'>Hos. 2:2</a>; <a href='/AIV/23/4/6'>Isa. 4:6</a>",
      "comment": "God confronts His people, refuting the idea that He abandoned them arbitrarily; rather, their alienation was a consequence of their sins. The imagery of divorce and debt was common in ancient legal customs. This verse establishes a foundational theme of restoration based on repentance—a motif also found in Lk 15:11-32 (Parable of the Prodigal Son)."
    },
    {
      "pk": 29050002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 2,
      "text": "Why was no one there when I came? Why did no one answer when I called? Is My hand too short to redeem? Or do I lack strength to deliver? By My rebuke I dry up the sea, I make rivers a desert; their fish rot for lack of water and die of thirst.",
      "links": "<a href='/AIV/02/14/21'>Ex. 14:21</a>; <a href='/AIV/23/51/10'>Isa. 51:10</a>",
      "comment": "God laments His people's spiritual deafness and doubts about His power. This verse recalls God's authority over creation (see Ex 14:21), foreshadowing Christ's miraculous control over nature (Mk 4:39). The divine call and lack of response also prefigure Israel's rejection of the Messiah."
    },
    {
      "pk": 29050003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 3,
      "text": "I clothe the heavens with darkness and make sackcloth their covering.",
      "links": "<a href='/AIV/02/10/22'>Ex. 10:22</a>; <a href='/AIV/40/27/45'>Matt. 27:45</a>",
      "comment": "The power to bring darkness references the plagues of Egypt and prefigures the darkness at Christ's crucifixion (Matt 27:45). God’s ability to manipulate creation demonstrates His supreme authority and willingness to act in judgment as well as in mercy."
    },
    {
      "pk": 29050004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 4,
      "text": "The Lord God has given Me the tongue of those who are taught, that I may know how to speak a word in season to him who is weary. He wakens Me morning by morning, He awakens My ear to listen as those who are taught.",
      "links": "<a href='/AIV/23/42/1'>Isa. 42:1</a>; <a href='/AIV/40/11/28'>Matt. 11:28</a>",
      "comment": "This Servant Song (one of the key Messianic passages in Isaiah) speaks of a uniquely gifted figure whose wisdom is divinely granted and whose role is to comfort the suffering. This closely parallels the life and ministry of Jesus, especially His ability to teach and comfort (Matt 11:28). The idea of listening 'morning by morning' suggests a life of prayer and submission—an example set for the Church’s ministers."
    },
    {
      "pk": 29050005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 5,
      "text": "The Lord God has opened My ear, and I was not rebellious; I did not turn away.",
      "links": "<a href='/AIV/19/40/6'>Ps. 40:6</a>; <a href='/AIV/50/2/8'>Phil. 2:8</a>",
      "comment": "The Servant's active obedience mirrors the obedience of Christ (Phil 2:8). Unlike many of Israel’s leaders, the Servant does not resist God’s call. This readiness is a model for all believers, inviting us to submit ourselves to God’s will even when difficult."
    },
    {
      "pk": 29050006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 6,
      "text": "I gave My back to those who strike Me, and My cheeks to those who pull out My beard; I did not hide My face from insult and spitting.",
      "links": "<a href='/AIV/40/26/67'>Matt. 26:67</a>; <a href='/AIV/23/53/5'>Isa. 53:5</a>",
      "comment": "Here the Servant endures suffering and humiliation, prefiguring Christ’s Passion (see Matt 26:67). The voluntary acceptance of suffering is interpreted as a redemptive act throughout the tradition, connecting to the spiritual value of uniting one's suffering to Christ."
    },
    {
      "pk": 29050007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 7,
      "text": "But the Lord God helps Me; therefore I have not been disgraced. I have set My face like flint, and I know that I will not be put to shame.",
      "links": "<a href='/AIV/42/9/51'>Luke 9:51</a>; <a href='/AIV/19/118/6'>Ps. 118:6</a>",
      "comment": "The unwavering determination of the Servant is reminiscent of Jesus’s resolute journey toward Jerusalem (Luke 9:51). Trust in God’s help provides assurance, and this resoluteness inspires faithfulness in the face of persecution."
    },
    {
      "pk": 29050008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 8,
      "text": "He who vindicates Me is near; who will contend with Me? Let us stand up together. Who is My adversary? Let him come near to Me.",
      "links": "<a href='/AIV/45/8/33'>Rom. 8:33</a>; <a href='/AIV/23/49/4'>Isa. 49:4</a>",
      "comment": "The Servant’s confidence in divine vindication resonates with Romans 8:33, emphasizing that God Himself justifies. This verse underscores the availability of true justice and the futility of opposition against those whom God defends."
    },
    {
      "pk": 29050009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 9,
      "text": "See, the Lord God helps Me; who can declare Me guilty? Look, all of them will wear out like a garment; the moth will eat them up.",
      "links": "<a href='/AIV/18/13/28'>Job 13:28</a>; <a href='/AIV/19/102/26'>Ps. 102:26</a>",
      "comment": "The ultimate vindication of the Servant is assured, and those who accuse will pass away. The language foreshadows Christ’s innocence before His accusers and the transience of worldly judgment compared to divine justice."
    },
    {
      "pk": 29050010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 10,
      "text": "Who among you fears the Lord and listens to the voice of His Servant? Though he walks in darkness and has no light, let him trust in the name of the Lord and rely on his God.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/23/42/16'>Isa. 42:16</a>",
      "comment": "Faith and trust are central, even without understanding or visible evidence. Listening to the Servant's voice evokes the authority of divinely appointed leaders and the importance of trusting God in spiritual darkness—an echo of the spiritual journey described in Psalm 23 and a foundation for ongoing trust in the Church’s guidance."
    },
    {
      "pk": 29050011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 50,
      "verse": 11,
      "text": "Look, all you who kindle a fire, who array yourselves with burning torches—walk by the light of your own fire and by the torches you have ignited! This you shall have from My hand: you shall lie down in torment.",
      "links": "<a href='/AIV/23/8/22'>Isa. 8:22</a>; <a href='/AIV/19/36/9'>Ps. 36:9</a>",
      "comment": "Those who seek their own guidance and reject divine illumination face loss and judgment. This warning highlights the necessity of seeking true light from God, not relying on self-made understanding. The passage gently encourages trust in established traditions and spiritual authority for true guidance."
    }
  ],
  "translatedAt": "2025-12-24T08:14:21.401Z"
}