{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 60,
  "verses": [
    {
      "pk": 29060001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 1,
      "text": "Arise, shine, for your light has come, and the glory of the LORD has risen upon you.",
      "links": "<a href='/AIV/40/5/14-16'>Matt. 5:14-16</a>; <a href='/AIV/43/1/4-9'>John 1:4-9</a>; <a href='/AIV/23/58/8'>Isa. 58:8</a>",
      "comment": "This opening verse proclaims a spiritual awakening and the arrival of God’s presence. The 'light' here is often seen as a prophetic text foreshadowing the coming of Christ, who is called the 'light of the world' (John 8:12). From a spiritual interpretation, it also points to the Church being the vessel that carries forth God's glory to the nations."
    },
    {
      "pk": 29060002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 2,
      "text": "For behold, darkness shall cover the earth, and thick darkness the peoples; but the LORD will arise upon you, and his glory will be seen upon you.",
      "links": "<a href='/AIV/23/9/2'>Isa. 9:2</a>; <a href='/AIV/43/12/46'>John 12:46</a>",
      "comment": "This verse highlights the contrast between global spiritual darkness and the unique light that comes from God's presence with his people. The light given by God is set against a backdrop of great need, evoking themes of redemption that are fulfilled in the life and mission of Jesus (cf. John 1:5)."
    },
    {
      "pk": 29060003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 3,
      "text": "Nations will come to your light, and kings to the brightness of your rising.",
      "links": "<a href='/AIV/19/72/10-11'>Ps. 72:10-11</a>; <a href='/AIV/40/2/1-2'>Matt. 2:1-2</a>",
      "comment": "Here, there is a vision of the worldwide impact of God's people—nations and rulers drawn by spiritual illumination. This verse is commonly linked to the visit of the Magi (Matt. 2:1-12), representing gentile nations coming to honor the Messiah."
    },
    {
      "pk": 29060004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 4,
      "text": "Lift up your eyes all around, and see: they all gather together, they come to you; your sons shall come from afar, and your daughters shall be carried on the hip.",
      "links": "<a href='/AIV/23/49/18-22'>Isa. 49:18-22</a>",
      "comment": "This verse depicts the reunification and gathering of God's people, symbolizing spiritual restoration and inclusion. It also serves as a typology for the gathering of believers from distant lands into the one true faith."
    },
    {
      "pk": 29060005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 5,
      "text": "Then you shall see and be radiant; your heart shall tremble and swell with joy, because the abundance of the sea will be turned to you, the wealth of nations shall come to you.",
      "links": "<a href='/AIV/23/61/6'>Isa. 61:6</a>; <a href='/AIV/19/45/11-12'>Ps. 45:11-12</a>",
      "comment": "God promises material and spiritual blessings as a sign of redemption. The influx of resources and people from many nations foreshadows the universality of the faith that will open to all peoples in the new covenant."
    },
    {
      "pk": 29060006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 6,
      "text": "A multitude of camels will cover you, the young camels of Midian and Ephah; all those from Sheba shall come. They shall bring gold and frankincense, and shall proclaim the praises of the LORD.",
      "links": "<a href='/AIV/40/2/11'>Matt. 2:11</a>; <a href='/AIV/19/72/10-15'>Ps. 72:10,15</a>",
      "comment": "The gifts of gold and frankincense link this passage to the gifts given to Jesus by the magi, indicating the recognition of the Messiah by the gentile world. The theme of worship and offering links Old Testament worship to New Testament fulfillment."
    },
    {
      "pk": 29060007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 7,
      "text": "All the flocks of Kedar shall be gathered to you; the rams of Nebaioth shall minister to you. They shall ascend with acceptance on my altar, and I will beautify my glorious house.",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>; <a href='/AIV/19/51/19'>Ps. 51:19</a>",
      "comment": "Foreign nations’ offerings are being accepted upon God's altar, indicating the opening of God's house to all peoples. It reflects the unification of worship and the continuity of sacrificial worship into spiritual fulfillment."
    },
    {
      "pk": 29060008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 8,
      "text": "Who are these that fly like a cloud, and like doves to their windows?",
      "links": "<a href='/AIV/19/55/6'>Ps. 55:6</a>",
      "comment": "This poetic image captures the eagerness of people from afar coming quickly to share in God's blessings, united in a common faithful purpose."
    },
    {
      "pk": 29060009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 9,
      "text": "For the coastlands shall hope for me, and the ships of Tarshish first, to bring your sons from afar, their silver and gold with them, for the name of the LORD your God, and for the Holy One of Israel, because he has made you beautiful.",
      "links": "<a href='/AIV/23/66/19-20'>Isa. 66:19-20</a>",
      "comment": "Gentile nations are portrayed as eagerly participating in the restoration and enrichment of Jerusalem, emphasizing that the faith will be adorned and glorified by diverse peoples, reflecting both earthly and heavenly realities."
    },
    {
      "pk": 29060010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 10,
      "text": "Foreigners shall build up your walls, and their kings shall serve you; for in my wrath I struck you, but in my favor I have had mercy on you.",
      "links": "<a href='/AIV/16/2/8'>Neh. 2:8</a>; <a href='/AIV/23/54/7-8'>Isa. 54:7-8</a>",
      "comment": "Even political leaders from outside Israel will serve the restored city—a sign that God's redemptive plan is universal. Restoration comes through divine mercy, pointing to the Church's reliance on God’s grace."
    },
    {
      "pk": 29060011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 11,
      "text": "Your gates shall be open continually; day and night they shall not be shut, so that people may bring to you the wealth of nations, with their kings led in procession.",
      "links": "<a href='/AIV/66/21/24-27'>Rev. 21:24-27</a>",
      "comment": "This image is echoed in Revelation’s description of the New Jerusalem, symbolizing unending access to God's presence and the perpetual gathering of all peoples into unity of faith."
    },
    {
      "pk": 29060012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 12,
      "text": "For the nation and kingdom that will not serve you shall perish; those nations shall be utterly ruined.",
      "links": "<a href='/AIV/23/14/2'>Isa. 14:2</a>; <a href='/AIV/19/2/8-12'>Ps. 2:8-12</a>",
      "comment": "Only those who align themselves with God's people will endure, reinforcing the absolute necessity of entering into true faith and communion with God’s covenant community."
    },
    {
      "pk": 29060013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 13,
      "text": "The glory of Lebanon shall come to you, the cypress, the plane and the pine together, to beautify the place of my sanctuary, and I will make the place of my feet glorious.",
      "links": "<a href='/AIV/11/5/6'>1 Kings 5:6</a>; <a href='/AIV/19/99/5'>Ps. 99:5</a>",
      "comment": "Materials from foreign lands beautify God’s sanctuary, evidencing both the universality and physicality of sacred worship, as God’s glory is manifest amongst his people in visible and tangible ways."
    },
    {
      "pk": 29060014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 14,
      "text": "The sons of those who oppressed you shall come bending low to you, and all who despised you will bow down at your feet. They will call you the City of the LORD, Zion of the Holy One of Israel.",
      "links": "<a href='/AIV/66/3/9'>Rev. 3:9</a>; <a href='/AIV/19/86/9'>Ps. 86:9</a>",
      "comment": "This foretells vindication for God's people and the recognition of the true faith by former adversaries. The humility of the nations foreshadows all creation’s submission to God in Christ."
    },
    {
      "pk": 29060015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 15,
      "text": "Whereas you were forsaken and hated, with no one passing through, I will make you a majestic pride forever, a joy from age to age.",
      "links": "<a href='/AIV/23/62/4'>Isa. 62:4</a>; <a href='/AIV/64/7-9'>Isa. 64:7-9</a>",
      "comment": "A prophecy of eternal honor and joy for those who once suffered. This points to the enduring place of the faithful in God's saving plan."
    },
    {
      "pk": 29060016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 16,
      "text": "You shall suck the milk of nations, and nurse at the breast of kings; and you shall know that I, the LORD, am your Savior and your Redeemer, the Mighty One of Jacob.",
      "links": "<a href='/AIV/49/4/15-16'>Eph. 4:15-16</a>; <a href='/AIV/23/43/14'>Isa. 43:14</a>",
      "comment": "Metaphorical language expressing sustenance and blessing from the nations. The recognition of God as redeemer shows the unity of salvation history and hints at spiritual nourishment provided by visible means."
    },
    {
      "pk": 29060017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 17,
      "text": "Instead of bronze I will bring gold, and instead of iron I will bring silver; instead of wood, bronze; and instead of stones, iron. I will make peace your overseer, and righteousness your ruler.",
      "links": "<a href='/AIV/38/9/10'>Zech. 9:10</a>; <a href='/AIV/23/32/1'>Isa. 32:1</a>",
      "comment": "God promises to perfect and elevate every aspect of His people, spiritually and materially. The mention of peace and righteousness as guides prefigures the reign of Christ."
    },
    {
      "pk": 29060018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 18,
      "text": "Violence shall no more be heard in your land, devastation or destruction within your borders; but you shall call your walls Salvation, and your gates Praise.",
      "links": "<a href='/AIV/23/26/1'>Isa. 26:1</a>; <a href='/AIV/66/21/12'>Rev. 21:12</a>",
      "comment": "This is an image of the peace and security God will provide. In the New Testament, salvation and praise are linked directly to the spiritual structure of the true people of God."
    },
    {
      "pk": 29060019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 19,
      "text": "The sun shall no longer be your light by day, nor for brightness shall the moon give you light; but the LORD will be your everlasting light, and your God will be your glory.",
      "links": "<a href='/AIV/66/21/23'>Rev. 21:23</a>; <a href='/AIV/23/24/23'>Isa. 24:23</a>",
      "comment": "God Himself is the light, fulfilling ultimate communion with Him. Revelation 21:23 quotes this to describe the eternal city."
    },
    {
      "pk": 29060020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 20,
      "text": "Your sun shall no longer go down, nor your moon withdraw itself; for the LORD will be your everlasting light, and your days of mourning shall be ended.",
      "links": "<a href='/AIV/23/35/10'>Isa. 35:10</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "A prophecy of the end of sorrow and the perpetual presence of God. Many have seen in this a vision of the age to come, where tears are wiped away in the kingdom of heaven."
    },
    {
      "pk": 29060021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 21,
      "text": "Your people shall all be righteous; they shall possess the land forever, the shoot of my planting, the work of my hands, that I might be glorified.",
      "links": "<a href='/AIV/23/61/3'>Isa. 61:3</a>; <a href='/AIV/40/13/43'>Matt. 13:43</a>",
      "comment": "This verse points to the total transformation of God’s people into righteousness—a core theme repeated in the teaching of Jesus about the righteous shining in the age to come (Matt. 13:43). The permanence of possession underscores the eternal covenant."
    },
    {
      "pk": 29060022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 60,
      "verse": 22,
      "text": "The least one shall become a thousand, and the smallest one a mighty nation; I am the LORD; in its time I will hasten it.",
      "links": "<a href='/AIV/38/4/10'>Zech. 4:10</a>; <a href='/AIV/41/4/31-32'>Mark 4:31-32</a>",
      "comment": "This final verse depicts the miraculous growth of God's people. It connects to Jesus' parable of the mustard seed (Mark 4:31-32), showing how the true faith, though small at first, becomes a global, united communion by God’s power."
    }
  ],
  "translatedAt": "2025-12-24T08:18:18.442Z"
}