{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 18,
  "verses": [
    {
      "pk": 29018001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 1,
      "text": "Woe to the land of whirring wings, which lies beyond the rivers of Cush,",
      "links": "<a href='/AIV/01/10/6-7'>Gen. 10:6-7</a>; <a href='/AIV/23/37/9'>Isa. 37:9</a>",
      "comment": "The 'land of whirring wings' refers poetically to lands south of Egypt, likely Ethiopia. The warning shows God's sovereignty over all nations, even those far from Israel. Cush often symbolizes distant peoples in the Bible."
    },
    {
      "pk": 29018002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 2,
      "text": "which sends envoys by sea, in papyrus boats over the water. Go, swift messengers, to a tall and smooth-skinned people, to a people feared far and wide, a nation mighty and conquering, whose land the rivers divide.",
      "links": "<a href='/AIV/23/20/3-5'>Isa. 20:3-5</a>; <a href='/AIV/44/8/27'>Acts 8:27</a>",
      "comment": "This points to Cushite diplomacy toward other nations. Papyrus boats show ancient travel on the Nile. The description of the people fits both literal and symbolic meanings—sometimes interpreted as alluding to universal mission, foreshadowing the spread of God's message to distant nations (see <a href='/AIV/44/8/27'>Acts 8:27</a> and Philip's encounter)."
    },
    {
      "pk": 29018003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 3,
      "text": "All you inhabitants of the world, you who dwell on the earth, when a banner is raised on the mountains, you will see it; when a trumpet is blown, you will hear it.",
      "links": "<a href='/AIV/23/5/26'>Isa. 5:26</a>; <a href='/AIV/40/24/31'>Matt. 24:31</a>",
      "comment": "The universal call here foreshadows the proclamation of God's kingdom to the whole world—fulfilled more deeply in Christ (cf. <a href='/AIV/40/24/31'>Mt. 24:31</a>). The mountain and trumpet imagery also echo both judgment and a coming gathering."
    },
    {
      "pk": 29018004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 4,
      "text": "For thus the LORD said to me: 'I will quietly look from My dwelling place like clear heat in sunshine, like a cloud of dew in the heat of harvest.'",
      "links": "<a href='/AIV/23/26/21'>Isa. 26:21</a>; <a href='/AIV/02/14/24'>Ex. 14:24</a>",
      "comment": "This verse depicts God's restraint and patient watchfulness, preparing for the right time to act. The 'dwelling place' alludes to God's heavenly throne, and through revelation history, is gradually connected to His presence among His people."
    },
    {
      "pk": 29018005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 5,
      "text": "For before the harvest, when the blossom is gone and the flower becomes a ripening grape, He will cut off the shoots with pruning knives, and take away and cut down the spreading branches.",
      "links": "<a href='/AIV/23/5/6'>Isa. 5:6</a>; <a href='/AIV/43/15/2'>John 15:2</a>",
      "comment": "The sudden cutting off before fruit matures is a warning of unexpected judgment. The vineyard imagery connects to God's people (see <a href='/AIV/23/5/6'>Isa. 5:6</a>; <a href='/AIV/43/15/2'>Jn. 15:2</a>). Spiritually, this calls for readiness and openness to God's pruning, a theme continued in the New Testament."
    },
    {
      "pk": 29018006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 6,
      "text": "They will all be left together for the birds of prey of the mountains and for the beasts of the earth. The birds of prey will feed on them in summer, and all the wild animals in winter.",
      "links": "<a href='/AIV/23/34/1-3'>Isa. 34:1-3</a>; <a href='/AIV/26/39/17'>Ezek. 39:17</a>",
      "comment": "Total judgment leaves none untouched. The gathering of birds and animals echoes the imagery of final judgment (compare with <a href='/AIV/66/19/17'>Rev. 19:17</a>), pointing to the seriousness of opposing God's plan."
    },
    {
      "pk": 29018007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 18,
      "verse": 7,
      "text": "At that time, gifts will be brought to the LORD of hosts from a people tall and smooth-skinned, from a people feared far and wide, a nation mighty and conquering, whose land the rivers divide, to the place of the name of the LORD of hosts, to Mount Zion.",
      "links": "<a href='/AIV/23/2/2-3'>Isa. 2:2-3</a>; <a href='/AIV/60/2/5'>1 Pet. 2:5</a>",
      "comment": "The prophecy climaxes with the offering of gifts to the LORD in Zion, prefiguring the gathering of the nations to worship the true God. This alludes to the eschatological pilgrimage of the nations, and in Christian understanding, points forward to the unity of all peoples in the worship centered on Mount Zion—later seen as a symbol of God's universal Church. This sacrificial worship is fulfilled in Christ (see <a href='/AIV/19/68/29-31'>Ps. 68:29-31</a>, <a href='/AIV/23/2/2-3'>Isa. 2:2-3</a>)."
    }
  ],
  "translatedAt": "2025-12-24T07:58:49.097Z"
}