{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 3,
  "verses": [
    {
      "pk": 29003001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 1,
      "text": "For look, the Lord, the LORD of hosts, is about to take from Jerusalem and from Judah supply and support—every supply of bread and every supply of water—",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/23/1/19-20'>Isa. 1:19-20</a>",
      "comment": "A severe judgment is announced: loss of basic necessities. This sets up the consequences of turning away from God. Allegorically, it suggests spiritual deprivation when the people abandon true worship. The mention of 'bread and water' foreshadows Christ as the true Bread and Living Water (John 6:35; John 4:14), pointing to future spiritual fulfillment."
    },
    {
      "pk": 29003002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 2,
      "text": "the mighty man and the man of war, the judge and the prophet, the diviner and the elder,",
      "links": "<a href='/AIV/04/11/16'>Num. 11:16</a>; <a href='/AIV/07/4/4'>Judg. 4:4</a>",
      "comment": "All levels of leadership—military, judicial, spiritual—are to be removed. The reference to judge and prophet signals the loss of both civic and spiritual guidance, highlighting the necessity of God-ordained leadership. Throughout salvation history, God provides shepherds for His people. This points toward apostolic succession and the importance of visible, structured leadership."
    },
    {
      "pk": 29003003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 3,
      "text": "the captain of fifty and the man of rank, the counselor and the skillful magician and the expert in charms.",
      "links": "<a href='/AIV/12/1/9'>2 Kings 1:9</a>; <a href='/AIV/02/7/11'>Ex. 7:11</a>",
      "comment": "Even lesser leaders—units of soldiers, respected men, counselors, and even those relied upon for supernatural aid—will be gone. It shows a total collapse of societal order as a result of abandoning righteousness. Historically, this reflects the need for ordered, sacramental life to prevent spiritual chaos."
    },
    {
      "pk": 29003004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 4,
      "text": "And I will make boys their princes, and children shall rule over them.",
      "links": "<a href='/AIV/21/10/16'>Eccl. 10:16</a>; <a href='/AIV/23/3/12'>Isa. 3:12</a>",
      "comment": "Immaturity in leadership is a sign of God's judgment—chaos ensues when the wise are replaced by inexperienced rulers. This verse reminds us of the value of tradition and teaching authority. The spiritual parallel is clear: when communities reject authentic authority, confusion follows."
    },
    {
      "pk": 29003005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 5,
      "text": "And the people shall oppress one another, every man his neighbor; the youth shall rise up against the elder, and the base against the honorable.",
      "links": "<a href='/AIV/20/30/11'>Prov. 30:11-14</a>",
      "comment": "Social breakdown is the consequence of lost reverence for elders and tradition. This spiritually prefigures division when scriptural order and apostolic teaching are dismissed. Respect for elders and tradition is vital in understanding and preserving orthodoxy."
    },
    {
      "pk": 29003006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 6,
      "text": "A man will seize his brother in his father's house, saying, 'You have a cloak; you shall be our leader, and this heap of ruins shall be under your hand.'",
      "links": "<a href='/AIV/23/4/1'>Isa. 4:1</a>",
      "comment": "Desperation leads to appointing unqualified leaders. This underscores the need for divinely established structures. The imagery of 'heap of ruins' reveals both physical and spiritual devastation, reinforcing the call to seek God's authentic order."
    },
    {
      "pk": 29003007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 7,
      "text": "In that day he will protest, saying, 'I will not be a healer, for in my house there is neither bread nor cloak; you shall not set me as leader of the people.'",
      "links": "<a href='/AIV/23/1/6'>Isa. 1:6</a>",
      "comment": "Leaders refuse responsibility, recognizing their own inadequacy. This can be seen as prophetic of the insufficiency of human solutions apart from God’s grace and provision, a theme fulfilled in the New Covenant where Christ appoints true shepherds."
    },
    {
      "pk": 29003008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 8,
      "text": "For Jerusalem has stumbled and Judah has fallen, because their tongue and their actions are against the LORD, defying His glorious presence.",
      "links": "<a href='/AIV/19/78/56'>Ps. 78:56</a>; <a href='/AIV/23/59/13'>Isa. 59:13</a>",
      "comment": "The reason for judgment is rebellion against God’s glory and presence. Isaiah often links sin with separation from God's dwelling, prefiguring the concept of God tabernacling among His people in Christ (John 1:14), whom ultimate rejection leads to spiritual ruin."
    },
    {
      "pk": 29003009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 9,
      "text": "Their faces display their guilt; they parade their sin like Sodom, and do not conceal it. Woe to them! For they have brought disaster upon themselves.",
      "links": "<a href='/AIV/01/19/5'>Gen. 19:5</a>; <a href='/AIV/23/1/9'>Isa. 1:9'</a>",
      "comment": "Sodom is referenced as the archetype of open rebellion and moral decay. Hebrews see the parallel in visible, shameless sin leading to destruction (Jude 1:7). Only humble repentance restores the covenant relationship and averts judgment."
    },
    {
      "pk": 29003010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 10,
      "text": "Say to the righteous that it will go well with them, for they will eat the fruit of their deeds.",
      "links": "<a href='/AIV/19/1/1-3'>Ps. 1:1-3</a>; <a href='/AIV/40/25/34-40'>Matt. 25:34-40</a>",
      "comment": "Despite judgment, God promises a reward for the righteous. This affirms free will and the merit of works—a doctrine visible throughout scripture and in Christ’s teaching on final judgment (Matt. 25:31-46). Holiness is both inward and outward, realized in a life of love and obedience."
    },
    {
      "pk": 29003011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 11,
      "text": "Woe to the wicked! Disaster is upon them; for what their hands have done shall be done to them.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15-16</a>; <a href='/AIV/62/6/7'>Gal. 6:7</a>",
      "comment": "This is a classic statement of divine justice; evil deeds bring just retribution. It affirms both individual accountability and the consequences of rejecting God's ways. This principle of sowing and reaping is fundamental throughout biblical revelation."
    },
    {
      "pk": 29003012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 12,
      "text": "My people—children oppress them, and women rule over them. O my people, your guides lead you astray and confuse the direction of your paths.",
      "links": "<a href='/AIV/23/9/16'>Isa. 9:16</a>; <a href='/AIV/28/4/6'>Hos. 4:6</a>",
      "comment": "Isaiah laments wrong leadership and confusion—a recurring theme. Historically, it’s a call to authentic spiritual authority, which rightly instructs and protects God’s people from error. God's guidance is found in the transmission of truth through generations."
    },
    {
      "pk": 29003013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 13,
      "text": "The LORD stands to plead His case; He rises to judge the peoples.",
      "links": "<a href='/AIV/19/82/1'>Ps. 82:1</a>; <a href='/AIV/23/66/16'>Isa. 66:16</a>",
      "comment": "God is portrayed as the divine Judge over all nations, a theme fulfilled in Christ who will return to judge the living and the dead (Acts 10:42). The concept of universal judgment is foundational in biblical theology."
    },
    {
      "pk": 29003014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 14,
      "text": "The LORD enters into judgment with the elders and princes of His people: 'It is you who have devoured the vineyard; the plunder of the poor is in your houses.'",
      "links": "<a href='/AIV/19/82/2'>Ps. 82:2-4</a>; <a href='/AIV/18/24/2'>Job 24:2</a>",
      "comment": "Leaders are held accountable for abuse of authority and neglect of the poor. 'Devoured the vineyard' connects with Israel as God’s vineyard (Isa. 5:1-7), paralleling Christ's parables. Righteous leadership is always just and merciful."
    },
    {
      "pk": 29003015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 15,
      "text": "'What do you mean by crushing My people and grinding the faces of the poor?' declares the Lord, the LORD of hosts.",
      "links": "<a href='/AIV/19/72/4'>Ps. 72:4</a>; <a href='/AIV/23/10/2'>Isa. 10:2</a>",
      "comment": "Social justice is a prominent biblical concern; God's people are called to protect the vulnerable. In the fullness of revelation, Christ identifies with the poor and suffering (Matt. 25:40). The true community of faith brings justice and mercy together."
    },
    {
      "pk": 29003016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 16,
      "text": "The LORD says, 'Because the daughters of Zion are proud and walk with stretched necks, flirting with their eyes, walking with mincing steps and jingling with their feet,'",
      "links": "<a href='/AIV/23/32/9'>Isa. 32:9</a>",
      "comment": "Pride and outward display mark spiritual danger. The emphasis on vanity and external show mirrors New Testament warnings on humility (1 Pet. 3:3-4) and interior transformation. True faith centers on reverence, not external appearances."
    },
    {
      "pk": 29003017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 17,
      "text": "therefore the Lord will afflict the scalps of the daughters of Zion with scabs, and the LORD will lay bare their secret parts.",
      "links": "<a href='/AIV/05/28/27'>Deut. 28:27</a>",
      "comment": "Physical shame is the consequence of spiritual pride. These images point towards the necessity of purity in following God. The uncovering of 'secret parts' signals judgment that exposes inward sin, anticipating Christ’s call for interior conversion."
    },
    {
      "pk": 29003018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 18,
      "text": "In that day, the Lord will remove the finery: the anklets, headbands, crescent ornaments,",
      "links": "<a href='/AIV/01/24/22'>Gen. 24:22</a>",
      "comment": "The loss of outward adornments is a symbol of judgment. It teaches the transience of wealth and beauty, reflecting the call to focus on the imperishable virtues of faith, hope, and charity (1 Cor. 13:13)."
    },
    {
      "pk": 29003019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 19,
      "text": "the earrings, bracelets, and veils,",
      "links": "<a href='/AIV/01/35/4'>Gen. 35:4</a>",
      "comment": "Material excess is stripped away, reminding God's people that spiritual riches matter above temporal ones. The focus shifts to interior rather than exterior glory."
    },
    {
      "pk": 29003020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 20,
      "text": "the headdresses, armlets, sashes, perfume boxes, and amulets,",
      "links": "<a href='/AIV/08/3/3'>Ruth 3:3</a>",
      "comment": "The inventory of adornments underscores the theme of misplaced priorities. God evaluates the heart and motives, not just outward signs."
    },
    {
      "pk": 29003021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 21,
      "text": "the rings and nose jewels,",
      "links": "<a href='/AIV/01/24/47'>Gen. 24:47</a>",
      "comment": "The details here show the cultural norms of ancient Jerusalem, but the principle applies universally: true dignity comes from a right relationship with God."
    },
    {
      "pk": 29003022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 22,
      "text": "the festal garments, outer cloaks, shawls, and purses,",
      "links": "<a href='/AIV/12/5/5'>2 Kings 5:5</a>",
      "comment": "Once again, all external marks of luxury and status are lost. Judgment comes to correct the focus from vanity to worship and service."
    },
    {
      "pk": 29003023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 23,
      "text": "the mirrors, linen garments, turbans, and veils.",
      "links": "<a href='/AIV/19/39/6'>Ps. 39:6</a>",
      "comment": "All jewelry and luxury—symbols of pride—are taken away. Isaiah’s repetition drives home the message: God’s people must seek humility and true spiritual beauty, which lasts forever."
    },
    {
      "pk": 29003024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 24,
      "text": "Instead of a sweet fragrance there will be rottenness; instead of a sash, a rope; instead of styled hair, baldness; instead of fine robes, a girding of sackcloth; branding instead of beauty.",
      "links": "<a href='/AIV/23/22/12'>Isa. 22:12</a>; <a href='/AIV/42/15/16'>Luke 15:16</a>",
      "comment": "The reversals here highlight the consequences of pride and the emptiness of external beauty. Sackcloth and baldness are symbols of mourning, urging repentance. The spiritual point is that only interior conversion leads to true restoration."
    },
    {
      "pk": 29003025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 25,
      "text": "Your men will fall by the sword, and your mighty in battle.",
      "links": "<a href='/AIV/25/2/21'>Lam. 2:21</a>",
      "comment": "Loss of protectors and defenders is the cost of rejecting God. This foreshadows the devastation of Jerusalem and invites prayer for true peace and safety, found ultimately in the Messiah’s victory."
    },
    {
      "pk": 29003026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 3,
      "verse": 26,
      "text": "Her gates will mourn and lament; deserted, she will sit on the ground.",
      "links": "<a href='/AIV/25/1/4'>Lam. 1:4</a>; <a href='/AIV/23/47/1'>Isa. 47:1</a>",
      "comment": "Isaiah ends the chapter with a vision of desolation, yet the sorrow sets up the hope for future restoration. Throughout scripture, lament leads to renewal and resurrection, anticipating Christ who turns mourning into gladness for His Church (Isa. 61:3, Rev. 21:4)."
    }
  ],
  "translatedAt": "2025-12-24T07:52:36.636Z"
}