{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 46,
  "verses": [
    {
      "pk": 29046001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 1,
      "text": "Bel bows down, Nebo stoops; their idols are carried by beasts and cattle. The loads you carry are heavy, a burden for the weary animal.",
      "links": "<a href='/AIV/24/50/2'>Jer. 50:2</a>; <a href='/AIV/09/5/2-5'>1 Sam. 5:2-5</a>",
      "comment": "Bel and Nebo were prominent Babylonian gods. The image highlights the impotence of idols, contrasting the living God who needs no support. The futility of idol-worship is a theme that points forward to the need for true worship in spirit and truth (John 4:24), hinting at the fullness of worship established by Christ."
    },
    {
      "pk": 29046002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 2,
      "text": "They stoop and bow down together; they cannot rescue the burden but themselves go into captivity.",
      "links": "<a href='/AIV/23/21/9'>Isa. 21:9</a>; <a href='/AIV/24/48/7'>Jer. 48:7</a>",
      "comment": "The passage reinforces the helplessness of man-made gods. Idols become burdens themselves, unable to save anyone. The idea of rescue and captivity lays groundwork for themes of liberation in the New Testament, especially through Christ’s sacrifice (Gal. 5:1)."
    },
    {
      "pk": 29046003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 3,
      "text": "Listen to Me, O house of Jacob, all the remnant of the house of Israel, who have been carried by Me from birth, upheld from the womb.",
      "links": "<a href='/AIV/05/1/31'>Deut. 1:31</a>; <a href='/AIV/19/71/6'>Ps. 71:6</a>",
      "comment": "God’s tender care from the womb foreshadows the idea of God’s sovereignty and providence in every stage of life. Such imagery anticipates later revelation of God’s intimate involvement with humanity, leading to the Incarnation (Luke 1:35)."
    },
    {
      "pk": 29046004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 4,
      "text": "Even to your old age I am He, and to gray hairs I will carry you. I have made, and I will bear; I will carry and will save.",
      "links": "<a href='/AIV/19/68/19'>Ps. 68:19</a>; <a href='/AIV/19/71/18'>Ps. 71:18</a>",
      "comment": "God’s unchanging faithfulness is stressed here. The language mirrors God's unending fatherhood and protection, reflected fully in the permanence of Christ’s saving work (Heb. 13:8). The sustaining care hints at the grace supplied through Christ’s enduring presence in the Church."
    },
    {
      "pk": 29046005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 5,
      "text": "To whom will you compare Me and make Me equal, and liken Me, that we may be alike?",
      "links": "<a href='/AIV/23/40/18'>Isa. 40:18</a>; <a href='/AIV/19/89/6'>Ps. 89:6</a>",
      "comment": "This verse echoes the transcendent uniqueness of God, foreshadowing the ultimate revelation in Christ, who is both fully God and fully man (John 1:18; Col. 1:15)."
    },
    {
      "pk": 29046006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 6,
      "text": "Some pour out gold from their bag, weigh out silver on the scales. They hire a goldsmith to make a god, then they fall down and worship.",
      "links": "<a href='/AIV/02/32/2-4'>Exod. 32:2-4</a>; <a href='/AIV/24/10/3-5'>Jer. 10:3-5</a>",
      "comment": "This image of idolatry, making gods of gold and silver, underscores the absurdity of placing faith in created things rather than the Creator. The passage invites reflection on authentic worship and devotion, which finds its fullest expression in the rites and sacraments uniquely set apart by Christ."
    },
    {
      "pk": 29046007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 7,
      "text": "They lift it up, carry it on their shoulders, set it in its place, and it stands there; it cannot move from its place. If one cries to it, it does not answer or save anyone from trouble.",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "Again, the impotence of idols is contrasted with the living God who hears and acts. This anticipates the theme that only God, revealed most fully in Christ, is able to save."
    },
    {
      "pk": 29046008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 8,
      "text": "Remember this, and be firm. Take it to heart, you transgressors.",
      "links": "<a href='/AIV/23/44/21'>Isa. 44:21</a>",
      "comment": "Calling upon people to remember God's acts and be steadfast, this passage invites a deep interior conversion—a theme developed in the New Testament with repentance and faith leading toward deeper communion (Luke 15:17-18)."
    },
    {
      "pk": 29046009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 9,
      "text": "Remember the former things of old, for I am God, and there is no other; I am God, and there is none like Me.",
      "links": "<a href='/AIV/05/4/35'>Deut. 4:35</a>; <a href='/AIV/23/45/5'>Isa. 45:5</a>",
      "comment": "God’s exclusivity is clear. Old Testament monotheism is fulfilled in the profound mystery of Christ’s divinity, a truth that anchors all Christian faith and liturgy (John 14:9)."
    },
    {
      "pk": 29046010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 10,
      "text": "Declaring the end from the beginning and from ancient times what is yet to come, saying, 'My purpose will stand, and I will accomplish all that I desire.'",
      "links": "<a href='/AIV/23/44/7'>Isa. 44:7</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "God’s absolute sovereignty and providence are revealed here, pointing toward the fulfillment of His promises in Christ, whose mission and sacrifice were foretold from ancient times. See Romans 8:28."
    },
    {
      "pk": 29046011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 11,
      "text": "Calling a bird of prey from the east, the man of My purpose from a distant land; I have spoken, and I will bring it to pass; I have planned it, and I will do it.",
      "links": "<a href='/AIV/23/41/2'>Isa. 41:2</a>; <a href='/AIV/27/2/37-38'>Dan. 2:37-38</a>",
      "comment": "Most interpreters see ‘bird of prey’ as referring to Cyrus, whom God uses for His redemptive plan. Ultimately, God’s sovereignty over history points toward Christ, the ultimate fulfillment of divine purpose (Acts 2:23)."
    },
    {
      "pk": 29046012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 12,
      "text": "Listen to Me, you stubborn of heart, you who are far from righteousness:",
      "links": "<a href='/AIV/23/48/4'>Isa. 48:4</a>; <a href='/AIV/45/10/3'>Rom. 10:3</a>",
      "comment": "Calling stubborn hearts to repentance and righteousness foreshadows the universal call to holiness found throughout the New Testament, inviting all to share in divine life through the means established by Christ."
    },
    {
      "pk": 29046013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 46,
      "verse": 13,
      "text": "I bring near My righteousness; it is not far away, and My salvation will not delay. I will grant salvation in Zion, My glory for Israel.",
      "links": "<a href='/AIV/23/45/8'>Isa. 45:8</a>; <a href='/AIV/42/2/32'>Luke 2:32</a>",
      "comment": "God promises imminent salvation and righteousness, ultimately fulfilled in Jesus, who brings glory and salvation not only to Israel but to all nations (Luke 2:32). This foreshadows the universal scope of the Church and the ongoing reality of salvation offered through her."
    }
  ],
  "translatedAt": "2025-12-24T08:12:29.085Z"
}