{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 25,
  "verses": [
    {
      "pk": 29025001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 1,
      "text": "LORD, you are my God; I will exalt you, I will praise your name; for you have done wonderful things—plans formed long ago, faithful and true.",
      "links": "<a href='/AIV/19/9/1'>Ps. 9:1</a>; <a href='/AIV/23/14/24'>Isa. 14:24</a>",
      "comment": "Verse 1 opens with personal praise, recognizing God's sovereignty and the fulfillment of His ancient plans. The phrase 'plans formed long ago' points to God's eternal providence and unchanging faithfulness. This echoes God's foreknowledge and timeless authority—a theme that is enriched throughout Scripture (cf. Ephesians 1:4)."
    },
    {
      "pk": 29025002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 2,
      "text": "For you have turned the city into a heap, the fortified city into ruins; the stronghold of foreigners is no longer a city—it will never be rebuilt.",
      "links": "<a href='/AIV/23/17/1'>Isa. 17:1</a>; <a href='/AIV/24/51/37'>Jer. 51:37</a>",
      "comment": "God's judgment on proud, fortified cities shows His ultimate authority over human power. Spiritually, it points to the passing of earthly kingdoms and the primacy of the heavenly kingdom which God alone can establish (see Daniel 2:44)."
    },
    {
      "pk": 29025003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 3,
      "text": "Therefore strong peoples will glorify you; cities of ruthless nations will fear you.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/23/18/7'>Isa. 18:7</a>",
      "comment": "God's judgment leads not only to defeat, but to recognition of His glory among all nations. This points to the universal nature of His salvation—a theme fulfilled in Christ's calling of all peoples into unity under God’s reign."
    },
    {
      "pk": 29025004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 4,
      "text": "For you have been a refuge for the poor, a shelter for the needy in distress, a hiding place from the storm, a shade from the heat; for the breath of the ruthless is like a storm against a wall.",
      "links": "<a href='/AIV/19/9/9'>Ps. 9:9</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "God cares for the poor and distressed, offering protection and comfort. This compassionate care anticipates the ministry of Christ, who calls all those who labor and are burdened to Himself (Matthew 11:28)."
    },
    {
      "pk": 29025005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 5,
      "text": "You subdue the roar of strangers, as heat is reduced by the shade of a cloud; so you quiet the song of the ruthless.",
      "links": "<a href='/AIV/19/65/7'>Ps. 65:7</a>",
      "comment": "God actively intervenes against oppression and pride, bringing peace where there was turmoil. This foreshadows the peace brought by the Messiah, whose reign brings justice and serenity (cf. Isaiah 9:6-7)."
    },
    {
      "pk": 29025006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 6,
      "text": "On this mountain, the LORD of hosts will prepare for all peoples a feast of rich food, a feast of aged wine—of rich food full of marrow, of aged wine well refined.",
      "links": "<a href='/AIV/19/22/26'>Ps. 22:26</a>; <a href='/AIV/40/8/11'>Matt. 8:11</a>",
      "comment": "This verse is a prophecy about a universal feast on God's holy mountain, often interpreted as the messianic banquet. In Christian interpretation, this anticipates the heavenly celebration and the Eucharistic gathering, where God's people are united in joyful communion."
    },
    {
      "pk": 29025007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 7,
      "text": "And He will destroy on this mountain the shroud that covers all peoples, the veil spread over all nations.",
      "links": "<a href='/AIV/47/3/16'>2 Cor. 3:16</a>; <a href='/AIV/40/27/51'>Matt. 27:51</a>",
      "comment": "The 'veil' represents separation from God's presence or understanding. Christ's death tore the veil (Matthew 27:51), symbolizing that access to God is now open for all nations—a theme central to Christian salvation."
    },
    {
      "pk": 29025008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 8,
      "text": "He will swallow up death forever; the LORD God will wipe away tears from all faces, and will remove the reproach of His people from all the earth. For the LORD has spoken.",
      "links": "<a href='/AIV/46/15/54'>1 Cor. 15:54</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "This is a powerful prophecy of resurrection and victory over death, directly quoted in the New Testament (1 Corinthians 15:54). The promise to wipe away every tear foreshadows our hope in eternal life and true comfort in God’s presence."
    },
    {
      "pk": 29025009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 9,
      "text": "It will be said on that day: 'Look, this is our God; we have waited for Him, and He has saved us. This is the LORD we have hoped for; let us rejoice and be glad in His salvation.'",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/23/12/2'>Isa. 12:2</a>",
      "comment": "This declaration affirms personal trust in the Lord’s salvation. It not only refers to immediate deliverance, but also to the ultimate salvation offered through Jesus Christ, who fulfills the hope of the ages."
    },
    {
      "pk": 29025010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 10,
      "text": "For the hand of the LORD will rest on this mountain, and Moab will be trampled down in its place, as straw is trampled in the water of a manure pit.",
      "links": "<a href='/AIV/23/11/9'>Isa. 11:9</a>; <a href='/AIV/24/48/42'>Jer. 48:42</a>",
      "comment": "God's special favor on His holy mountain contrasts with judgment on Moab, symbolizing correction for pride. The holy mountain is often interpreted as the place where God’s presence dwells, prefiguring the sanctuary where God gathers His people together in unity."
    },
    {
      "pk": 29025011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 11,
      "text": "They will stretch out their hands in the midst of it, as swimmers stretch out their hands to swim; but the LORD will bring down their pride together with the skill of their hands.",
      "links": "<a href='/AIV/19/89/10'>Ps. 89:10</a>",
      "comment": "The image presents the futility of human strength and pride against God’s judgment. True salvation and security can only come by placing trust in God, rather than in human effort or skill."
    },
    {
      "pk": 29025012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 25,
      "verse": 12,
      "text": "And He will lay low your high walls, cast them to the ground, and bring them down to dust.",
      "links": "<a href='/AIV/23/2/12'>Isa. 2:12</a>; <a href='/AIV/23/26/5'>Isa. 26:5</a>",
      "comment": "God humbles what is proud and exalted, establishing His own kingdom by tearing down all barriers. This verse reflects the necessity of humility and surrender before God's ultimate authority, a key spiritual principle throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-24T08:01:53.574Z"
}