{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 14,
  "verses": [
    {
      "pk": 29014001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 1,
      "text": "For the LORD will have compassion on Jacob, and will again choose Israel, and set them in their own land. So foreigners will join them, and will be united with the house of Jacob.",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/23/56/3'>Isa. 56:3</a>",
      "comment": "God’s mercy for Israel is shown, and foreigners are invited to be part of His people. This foreshadows the inclusion of Gentiles through Christ (see Eph. 2:11-13), showing both continuity and enlargement in God’s plan."
    },
    {
      "pk": 29014002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 2,
      "text": "And peoples will take them and bring them to their place, and the house of Israel will possess them in the LORD’s land as male and female servants. They will take captive those who had taken them captive, and rule over their oppressors.",
      "links": "<a href='/AIV/19/137/3'>Ps. 137:3</a>; <a href='/AIV/24/30/16'>Jer. 30:16</a>",
      "comment": "Israel is promised a reversal of fortunes with their captors. Spiritually, this echoes Christian victory over sin and the spiritual slavery of the world through Christ's redeeming work."
    },
    {
      "pk": 29014003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 3,
      "text": "On the day the LORD gives you rest from your sorrow, and from your trouble and the hard service with which you were made to serve,",
      "links": "<a href='/AIV/23/11/10'>Isa. 11:10</a>; <a href='/AIV/40/11/28'>Matt. 11:28</a>",
      "comment": "Here is a promise of divine rest, prefiguring spiritual rest in Christ (see Heb. 4:9-10). It points to the ultimate comfort believers receive from God."
    },
    {
      "pk": 29014004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 4,
      "text": "you will take up this taunt against the king of Babylon, and say: \"How the oppressor has ceased! How his fury has ended!\"",
      "links": "<a href='/AIV/27/5/1-6'>Dan. 5:1-6</a>",
      "comment": "A song of triumph over Babylon’s king signifies judgment. Babylon often symbolizes pride and rebellion against God—an image used in Revelation (see Rev. 18), regarding the defeat of evil."
    },
    {
      "pk": 29014005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 5,
      "text": "The LORD has broken the staff of the wicked, the scepter of rulers,",
      "links": "<a href='/AIV/19/125/3'>Ps. 125:3</a>",
      "comment": "The breaking of the oppressor’s power reveals God’s sovereignty. The term 'staff' and 'scepter' indicate true authority comes from God alone."
    },
    {
      "pk": 29014006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 6,
      "text": "who struck peoples in wrath with unceasing blows, who ruled nations in fury with relentless persecution.",
      "links": "<a href='/AIV/23/10/24'>Isa. 10:24</a>",
      "comment": "The king of Babylon’s cruelty is emphasized. This serves as a warning against tyranny and a reminder of God’s justice and ultimate judgment."
    },
    {
      "pk": 29014007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 7,
      "text": "The whole earth is at rest and quiet; they break forth into singing.",
      "links": "<a href='/AIV/23/12/6'>Isa. 12:6</a>; <a href='/AIV/19/96/1'>Ps. 96:1</a>",
      "comment": "The universal joy at the fall of oppression anticipates the peace the Messiah brings. Such joy reflects the song of deliverance at Christ’s resurrection conquering death."
    },
    {
      "pk": 29014008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 8,
      "text": "Even the cypress trees rejoice over you, and the cedars of Lebanon, saying, ‘Since you were laid low, no woodsman comes up against us.’",
      "links": "<a href='/AIV/19/148/9'>Ps. 148:9</a>",
      "comment": "Nature rejoices symbolically, expressing God’s restoration of creation. Trees here represent nations or people delivered from tyranny."
    },
    {
      "pk": 29014009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 9,
      "text": "Sheol beneath is stirred up to meet you at your coming; it rouses the shades to greet you, all who were leaders of the earth; it raises from their thrones all the kings of the nations.",
      "links": "<a href='/AIV/26/32/21'>Ezek. 32:21</a>; <a href='/AIV/19/9/17'>Ps. 9:17</a>",
      "comment": "This passage describes the realm of the dead, highlighting the humiliation of the proud. Sheol presents a profound theological concept of earthly judgment and afterlife consequences."
    },
    {
      "pk": 29014010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 10,
      "text": "They all will speak and say to you: ‘You too have become weak as we are! You have become like us!’",
      "links": "<a href='/AIV/26/32/22-32'>Ezek. 32:22-32</a>",
      "comment": "The former king, now powerless, is mocked by those already dead—an image of the inevitable fate of all earthly pride and rebellion."
    },
    {
      "pk": 29014011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 11,
      "text": "Your pomp is brought down to Sheol, the sound of your harps; maggots are spread under you, and worms cover you.",
      "links": "<a href='/AIV/19/49/14'>Ps. 49:14</a>",
      "comment": "The imagery of decay and corruption is vivid, emphasizing the transience of worldly grandeur. A sober reflection on mortality and judgment."
    },
    {
      "pk": 29014012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 12,
      "text": "How you have fallen from heaven, O shining one, son of the dawn! How you are cut down to the ground, you who laid low the nations!",
      "links": "<a href='/AIV/42/10/18'>Luke 10:18</a>; <a href='/AIV/66/12/7-9'>Rev. 12:7-9</a>",
      "comment": "Traditional interpretation often links this verse to the fall of Lucifer/Satan. Christ references spiritual warfare (Luke 10:18), affirming He has authority over evil powers and angels."
    },
    {
      "pk": 29014013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 13,
      "text": "You said in your heart, ‘I will ascend to heaven; I will raise my throne above the stars of God; I will sit on the mountain of assembly in the far reaches of the north;",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "Pride and self-exaltation are condemned here. The passage is a warning against usurping God’s authority—an echo of the sin of Adam (see Gen. 3:5-6)."
    },
    {
      "pk": 29014014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 14,
      "text": "I will ascend above the heights of the clouds, I will make myself like the Most High.’",
      "links": "<a href='/AIV/01/03/5'>Gen. 3:5</a>; <a href='/AIV/50/2/6'>Phil. 2:6</a>",
      "comment": "The king’s desire to usurp God’s place mirrors Satan’s rebellion. Christ, in contrast, ‘did not count equality with God a thing to be grasped’ (Phil. 2:6), showing perfect humility."
    },
    {
      "pk": 29014015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 15,
      "text": "But you are brought down to Sheol, to the depths of the pit.",
      "links": "<a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "The ultimate fate of pride is humiliation and judgment. This foreshadows the final defeat of evil at the end of time (see Rev. 20:10)."
    },
    {
      "pk": 29014016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 16,
      "text": "Those who see you will stare at you and ponder, ‘Is this the man who made the earth tremble, who shook kingdoms,",
      "links": "<a href='/AIV/26/28/9'>Ezek. 28:9</a>",
      "comment": "The downfall of proud rulers becomes a spectacle. This is a plain reminder of how worldly power is transient compared to God's eternal kingdom."
    },
    {
      "pk": 29014017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 17,
      "text": "who made the world like a desert and overthrew its cities, who did not let his prisoners go home?’",
      "links": "<a href='/AIV/23/47/6'>Isa. 47:6</a>",
      "comment": "The destruction caused by tyranny is highlighted. It is a lesson about justice and the need for mercy—virtues to be cultivated in the Christian life."
    },
    {
      "pk": 29014018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 18,
      "text": "All the kings of the nations lie in glory, each in his own tomb;",
      "links": "<a href='/AIV/26/32/28'>Ezek. 32:28</a>",
      "comment": "Nations honor their dead, but even earthly glory fades. The Christian hope rests not in monuments, but in resurrection through Christ."
    },
    {
      "pk": 29014019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 19,
      "text": "but you are cast out, away from your grave, like a hated branch, clothed with the slain, those pierced by the sword, who go down to the stones of the pit, like a corpse trampled underfoot.",
      "links": "<a href='/AIV/19/83/10'>Ps. 83:10</a>",
      "comment": "Unlike honored kings, the oppressor is rejected even in death. This signals disgrace and separation from the communion of God’s people."
    },
    {
      "pk": 29014020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 20,
      "text": "You will not be joined with them in burial, because you have destroyed your land, you have slain your people. May the offspring of evildoers never be named.",
      "links": "<a href='/AIV/01/04/11'>Gen. 4:11</a>",
      "comment": "The destruction resulting from wickedness excludes even rulers from honor in death. It underscores the severe consequences of sin."
    },
    {
      "pk": 29014021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 21,
      "text": "Prepare a slaughter for his children because of their ancestors’ guilt, so that they do not rise and possess the earth, and fill the face of the world with cities.",
      "links": "<a href='/AIV/02/34/7'>Ex. 34:7</a>",
      "comment": "The judgment passes down to descendants, showing sin's consequences reaching generations. The faithful must seek God's mercy, which restores and renews even those with a troubled inheritance."
    },
    {
      "pk": 29014022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 22,
      "text": "\"I will rise against them,\" declares the LORD of hosts, \"and will cut off from Babylon name and remnant, descendants and posterity,\" says the LORD.",
      "links": "<a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "Total, permanent destruction is decreed. God’s judgment is absolute, foreshadowing eschatological (final) justice."
    },
    {
      "pk": 29014023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 23,
      "text": "\"I will make it a possession of hedgehogs and a place for pools of water, and I will sweep it with the broom of destruction,\" declares the LORD of hosts.",
      "links": "<a href='/AIV/23/13/21'>Isa. 13:21</a>",
      "comment": "Babylon will become desolate—a symbol of God’s power to humble the proud and restore holiness to the land. It recalls how sin corrupts, but God can renew."
    },
    {
      "pk": 29014024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 24,
      "text": "The LORD of hosts has sworn: \"As I have planned, so shall it be; and as I have purposed, so shall it stand,",
      "links": "<a href='/AIV/23/46/10'>Isa. 46:10</a>",
      "comment": "God’s solemn oath highlights His supreme power and unchangeable purpose. Believers can rest in divine providence, a core Christian trust."
    },
    {
      "pk": 29014025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 25,
      "text": "that I will break the Assyrian in my land, and on my mountains trample him underfoot; and his yoke will depart from them, and his burden from their shoulders.",
      "links": "<a href='/AIV/23/10/27'>Isa. 10:27</a>",
      "comment": "God promises deliverance from Assyria. The liberation foreshadows Christ freeing believers from the yoke of sin (see Matt. 11:28-30)."
    },
    {
      "pk": 29014026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 26,
      "text": "This is the purpose that is purposed against the whole earth, and this is the hand that is stretched out over all the nations.",
      "links": "<a href='/AIV/44/17/26'>Acts 17:26</a>",
      "comment": "This verse illustrates God’s universal reign. His plans encompass all nations, pointing to His desire to unite all under His kingdom."
    },
    {
      "pk": 29014027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 27,
      "text": "For the LORD of hosts has purposed, and who will annul it? His hand is stretched out, and who can turn it back?",
      "links": "<a href='/AIV/23/43/13'>Isa. 43:13</a>",
      "comment": "God’s sovereign will is irresistible and dependable, a foundation for Christian confidence and hope."
    },
    {
      "pk": 29014028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 28,
      "text": "In the year that King Ahaz died, this oracle came:",
      "links": "<a href='/AIV/12/16/20'>2 Kings 16:20</a>",
      "comment": "Historical context is noted, tying prophecy to real events—a reminder of God’s unfolding plan throughout history."
    },
    {
      "pk": 29014029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 29,
      "text": "Do not rejoice, Philistia, all of you, that the rod that struck you is broken; for from the root of that snake will come forth an adder, and its fruit will be a flying serpent.",
      "links": "<a href='/AIV/04/21/6'>Num. 21:6</a>",
      "comment": "Judgment’s continuation is pronounced even after one oppressor is removed. The imagery recalls the spiritual battle with evil and the need to trust in God’s ultimate deliverance."
    },
    {
      "pk": 29014030,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 30,
      "text": "The firstborn of the poor will eat, and the needy will lie down in safety; but I will kill your root with famine, and your remnant will be destroyed.",
      "links": "<a href='/AIV/19/72/4'>Ps. 72:4</a>",
      "comment": "God cares for the poor and needy, a sign of His justice. Ultimately, Christ fulfills this in His teaching and miracles (see Luke 4:18)."
    },
    {
      "pk": 29014031,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 31,
      "text": "Wail, O gate; cry out, O city; melt away, all you Philistines! For smoke comes from the north, and there is no straggler in his ranks.",
      "links": "<a href='/AIV/23/13/20'>Isa. 13:20</a>",
      "comment": "A warning of unstoppable judgment, emphasizing God’s justice and His zeal for righteousness."
    },
    {
      "pk": 29014032,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 14,
      "verse": 32,
      "text": "What will one answer the messengers of the nation? \"The LORD has founded Zion, and in her the afflicted of His people will find refuge.\"",
      "links": "<a href='/AIV/19/87/1'>Ps. 87:1</a>; <a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/60/2/6'>1 Pet. 2:6</a>",
      "comment": "Zion, God's holy city, provides refuge—anticipating the Church as the spiritual home for all who trust God (see 1 Pet. 2:6). The afflicted find true safety in the kingdom God establishes."
    }
  ],
  "translatedAt": "2025-12-24T07:57:30.464Z"
}