{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 64,
  "verses": [
    {
      "pk": 29064001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 1,
      "text": "Oh that you would tear open the heavens and come down, so that the mountains would quake at your presence—",
      "links": "<a href='/AIV/02/19/18'>Ex. 19:18</a>; <a href='/AIV/19/18/7'>Ps. 18:7</a>; <a href='/AIV/26/1/1'>Ezek. 1:1</a>",
      "comment": "The prophet cries out for God's dramatic intervention, recalling the momentous events when God descended at Sinai. This longing prefigures the Incarnation, where God truly comes down among His people (cf. John 1:14)."
    },
    {
      "pk": 29064002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 2,
      "text": "As fire kindles brushwood and causes water to boil, to make your name known to your adversaries, so that the nations might tremble at your presence!",
      "links": "<a href='/AIV/02/19/16-18'>Ex. 19:16-18</a>; <a href='/AIV/19/46/6'>Ps. 46:6</a>",
      "comment": "Isaiah uses strong imagery for God's power to purify and reveal Himself. The desire for God's name to be known among the nations anticipates the universal mission of the Church, fulfilling God's promise to bless all nations through His people (Gen. 12:3)."
    },
    {
      "pk": 29064003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 3,
      "text": "When you did awesome things that we did not look for, you came down, the mountains quaked at your presence.",
      "links": "<a href='/AIV/07/5/4-5'>Judg. 5:4-5</a>; <a href='/AIV/19/68/8'>Ps. 68:8</a>",
      "comment": "The recall of God's unexpected wonders alludes to the various saving acts in Israel's history. These prefigure the ultimate 'coming down' in Christ, the event no one could fully anticipate (1 Cor. 2:9)."
    },
    {
      "pk": 29064004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 4,
      "text": "From ages past no one has heard, no ear has perceived, no eye has seen any God besides you, who acts for those who wait for him.",
      "links": "<a href='/AIV/46/2/9'>1 Cor. 2:9</a>",
      "comment": "Paul the Apostle will reference this verse, connecting it to the unseen glory revealed in Jesus. The idea of waiting upon the Lord hints at faith and trust, akin to patient hope in the promises God fulfills through His Covenant people."
    },
    {
      "pk": 29064005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 5,
      "text": "You meet the one who joyfully practices righteousness, those who remember you in your ways. But you were angry, and we sinned; in our sins we have been a long time, and shall we be saved?",
      "links": "<a href='/AIV/19/85/10'>Ps. 85:10-13</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "The tension between righteousness and sinfulness is highlighted, echoing the need for both justice and mercy. The question, 'shall we be saved?' points forward to the salvation found ultimately in Christ, and anticipates the need for ongoing grace given to the faithful."
    },
    {
      "pk": 29064006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 6,
      "text": "We have all become like something unclean, and all our righteous deeds are like filthy rags. We all wither like a leaf, and our iniquities, like the wind, carry us away.",
      "links": "<a href='/AIV/19/14/3'>Ps. 14:3</a>; <a href='/AIV/45/3/9-10'>Rom. 3:9-10</a>",
      "comment": "Human efforts apart from God's grace are insufficient for salvation. The language underlines the necessity of divine transformation, a work only possible through the means God Himself ordains (cf. Titus 3:5). The phrase 'filthy rags' conveys ritual impurity, underscoring the need for purification."
    },
    {
      "pk": 29064007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 7,
      "text": "There is no one who calls upon your name, who rouses himself to take hold of you; for you have hidden your face from us and have melted us away because of our sins.",
      "links": "<a href='/AIV/19/10/1'>Ps. 10:1</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "Isaiah recognizes the separation sin causes between God and His people. This theme of God's apparent 'hiddenness' can be connected with the lament Psalms and anticipates the longing for reconciliation that Christ fulfills (cf. 2 Cor. 5:18-19)."
    },
    {
      "pk": 29064008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 8,
      "text": "But now, O Lord, you are our Father; we are the clay, and you are our potter; we are all the work of your hand.",
      "links": "<a href='/AIV/23/29/16'>Isa. 29:16</a>; <a href='/AIV/24/18/6'>Jer. 18:6</a>; <a href='/AIV/45/9/20-21'>Rom. 9:20-21</a>",
      "comment": "This depiction of God as Father and potter signifies both intimacy and authority. Humanity's dependence on God's shaping hand is echoed in Paul's theology of divine sovereignty and in the continual formation of the faithful through grace."
    },
    {
      "pk": 29064009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 9,
      "text": "Do not be exceedingly angry, O Lord, and do not remember iniquity forever. Behold, please look, we are all your people.",
      "links": "<a href='/AIV/19/130/3'>Ps. 130:3</a>; <a href='/AIV/19/25/6-7'>Ps. 25:6-7</a>",
      "comment": "The plea for forgiveness and for God not to remember sins foreshadows the fuller forgiveness and reconciliation granted in Christ, revealing the heart of divine mercy accessible through repentance and faith."
    },
    {
      "pk": 29064010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 10,
      "text": "Your holy cities have become a wilderness; Zion has become a wilderness, Jerusalem a desolation.",
      "links": "<a href='/AIV/25/1/1-2'>Lam. 1:1-2</a>",
      "comment": "The devastation of Jerusalem is mourned, reflecting the historical exile but also symbolizing spiritual desolation when God's people stray. This prepares for the promise of restoration and new life in the coming Kingdom."
    },
    {
      "pk": 29064011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 11,
      "text": "Our holy and beautiful house, where our fathers praised you, has been burned with fire, and all we treasured has been ruined.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/25/2/6-7'>Lam. 2:6-7</a>",
      "comment": "The reference to the temple's destruction deepens the lament. The loss of right worship points toward the need for a restored, pure worship—eventually found in the new covenant, where true worshipers adore God in spirit and truth (John 4:23)."
    },
    {
      "pk": 29064012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 64,
      "verse": 12,
      "text": "Will you restrain yourself at these things, O Lord? Will you keep silent, and afflict us so severely?",
      "links": "<a href='/AIV/19/28/1'>Ps. 28:1</a>; <a href='/AIV/19/83/1'>Ps. 83:1</a>",
      "comment": "The prophet’s urgent plea for divine action closes the prayer. God's 'silence' is not final; in the fullness of time, God responds with redemption, answering the deepest needs of His people through His ultimate act of salvation."
    }
  ],
  "translatedAt": "2025-12-24T08:19:49.144Z"
}