{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 56,
  "verses": [
    {
      "pk": 29056001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 1,
      "text": "This is what the LORD says: Keep justice and do what is right, for My salvation is coming soon, and My righteousness will be revealed.",
      "links": "<a href='/AIV/23/1/17'>Isa. 1:17</a>; <a href='/AIV/45/13/11'>Rom. 13:11</a>; <a href='/AIV/40/3/2'>Matt. 3:2</a>",
      "comment": "The call to justice and righteousness anticipates the coming salvation, foreshadowing New Testament teaching about preparing for the coming of Christ. The emphasis on 'My righteousness' points toward God's initiative in salvation."
    },
    {
      "pk": 29056002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 2,
      "text": "Blessed is the person who does this, the one who holds to it; who keeps the Sabbath without profaning it, and keeps his hand from doing evil.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/02/20/8-11'>Exod. 20:8-11</a>",
      "comment": "Note the singular individual, highlighting personal responsibility. The Sabbath observance points to a rhythm of worship and rest, which continues to shape Christian practice. This connects with the blessing Jesus speaks on obedience in the Gospels."
    },
    {
      "pk": 29056003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 3,
      "text": "Do not let the foreigner who has joined himself to the LORD say, 'The LORD will surely exclude me from His people.' And do not let the eunuch say, 'I am only a dry tree.'",
      "links": "<a href='/AIV/05/23/1'>Deut. 23:1</a>; <a href='/AIV/44/8/36-39'>Acts 8:36-39</a>",
      "comment": "God's invitation is extended beyond ethnic boundaries and ritual restrictions, prefiguring the inclusion of Gentiles and all people into the Church. The mention of the eunuch links with the New Testament story of the Ethiopian eunuch, emphasizing the universal call."
    },
    {
      "pk": 29056004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 4,
      "text": "For this is what the LORD says: To the eunuchs who keep My Sabbaths, who choose what pleases Me and hold fast to My covenant—",
      "links": "<a href='/AIV/24/32/40'>Jer. 32:40</a>; <a href='/AIV/23/56/6'>Isa. 56:6</a>",
      "comment": "The Lord describes blessing based on faithfulness and covenant-keeping, not physical or ethnic status, highlighting the spiritual family and a deeper covenant."
    },
    {
      "pk": 29056005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 5,
      "text": "I will give them, within My house and within My walls, a memorial and a name better than sons and daughters; I will give them an everlasting name that will never be cut off.",
      "links": "<a href='/AIV/66/2/17'>Rev. 2:17</a>; <a href='/AIV/19/135/13'>Ps. 135:13</a>",
      "comment": "This promise of a name and memorial in God's house looks ahead to the New Testament teaching of being given a new name and eternal identity in God's family, tied to the Church as spiritual household."
    },
    {
      "pk": 29056006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 6,
      "text": "Also, the foreigners who join themselves to the LORD to serve Him, to love the name of the LORD, and to be His servants, all who keep the Sabbath without profaning it and hold fast to My covenant—",
      "links": "<a href='/AIV/23/14/1'>Isa. 14:1</a>; <a href='/AIV/45/1/5-7'>Rom. 1:5-7</a>",
      "comment": "Inclusiveness is expanded to all peoples who genuinely seek God and keep His covenant, a prophecy fulfilled in the universal invitation to Christ's Church."
    },
    {
      "pk": 29056007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 7,
      "text": "I will bring them to My holy mountain and make them joyful in My house of prayer. Their burnt offerings and sacrifices will be accepted on My altar; for My house will be called a house of prayer for all peoples.",
      "links": "<a href='/AIV/40/21/13'>Matt. 21:13</a>; <a href='/AIV/23/2/2'>Isa. 2:2</a>",
      "comment": "Jesus quotes this verse when he cleanses the Temple, identifying Himself with the fulfillment of Isaiah's prophecy. The 'holy mountain' and 'house of prayer' prefigure the worship of God by all nations in the Church, and the acceptance of spiritual sacrifices."
    },
    {
      "pk": 29056008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 8,
      "text": "The Lord GOD, who gathers the outcasts of Israel, declares, 'I will gather still others to them besides those already gathered.'",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "This is a key prophecy about God gathering people from every nation, anticipating the Church's universality and Christ's statement about having 'other sheep.'"
    },
    {
      "pk": 29056009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 9,
      "text": "All you beasts of the field, come to devour—all you beasts of the forest.",
      "links": "<a href='/AIV/19/79/7'>Ps. 79:7</a>; <a href='/AIV/24/5/6'>Jer. 5:6</a>",
      "comment": "Symbolic oracles of judgment follow. Beasts often represent hostile powers or enemies that threaten Israel; spiritually, it represents the need for vigilant leadership in God's people."
    },
    {
      "pk": 29056010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 10,
      "text": "Israel’s watchmen are blind; all of them lack knowledge. They are all silent dogs, unable to bark; they lie down and dream, they love to slumber.",
      "links": "<a href='/AIV/26/3/17'>Ezek. 3:17</a>; <a href='/AIV/23/62/6'>Isa. 62:6</a>",
      "comment": "Isaiah criticizes negligent spiritual leaders, emphasizing the need for vigilant shepherds. This has ecclesial implications for the importance of faithful and alert leadership within the Church."
    },
    {
      "pk": 29056011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 11,
      "text": "The dogs are greedy; they never have enough. And these shepherds lack understanding; they all turn to their own way, each one seeks his own gain, every last one.",
      "links": "<a href='/AIV/24/6/13'>Jer. 6:13</a>; <a href='/AIV/26/34/8'>Ezek. 34:8</a>",
      "comment": "Selfishness and neglect among leaders is denounced—a continuing warning echoed in later Scriptures (e.g. Ezekiel 34), which urge shepherds to serve sacrificially, a principle fulfilled in Christ and continued in leaders who seek spiritual rather than worldly rewards."
    },
    {
      "pk": 29056012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 56,
      "verse": 12,
      "text": "\"Come,\" they say, \"let us get wine; let us drink heavily of strong drink. Tomorrow will be like today, or even far better!\"",
      "links": "<a href='/AIV/23/22/13'>Isa. 22:13</a>; <a href='/AIV/42/12/19'>Luke 12:19</a>",
      "comment": "The complacency and indulgence of the people sets the stage for warning and calls to true repentance. Spiritually, it cautions against the presumption that God's patience is infinite, and underscores the need for continued vigilance and readiness for the coming of God's kingdom."
    }
  ],
  "translatedAt": "2025-12-24T08:16:27.210Z"
}