{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 11,
  "verses": [
    {
      "pk": 29011001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 1,
      "text": "A shoot will spring up from the stump of Jesse, and a branch from his roots will bear fruit.",
      "links": "<a href='/AIV/9/16/1'>1 Sam. 16:1</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>; <a href='/AIV/23/4/2'>Isa. 4:2</a>",
      "comment": "Jesse is the father of King David, and this prophecy promises a future leader from David's line. Christian tradition sees this as pointing to Jesus the Messiah, the true fulfillment (see Matt. 1:1)."
    },
    {
      "pk": 29011002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 2,
      "text": "The Spirit of the LORD will rest on him — the spirit of wisdom and understanding, the spirit of counsel and strength, the spirit of knowledge and the fear of the LORD.",
      "links": "<a href='/AIV/43/3/34'>John 3:34</a>; <a href='/AIV/61/1/3'>2 Pet. 1:3</a>; <a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "The seven-fold gifts of the Spirit described here are later recognized in Christian tradition. Jesus fulfills this perfectly at His baptism, when the Spirit descends (see Isa. 61:1; Matt. 3:16)."
    },
    {
      "pk": 29011003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 3,
      "text": "His delight will be in the fear of the LORD; he will not judge by what his eyes see, nor decide by what his ears hear.",
      "links": "<a href='/AIV/40/22/16'>Matt. 22:16</a>; <a href='/AIV/43/7/24'>John 7:24</a>",
      "comment": "Unlike worldly rulers, this future king will rule with perfect justice and wisdom, not limited to outward appearances. Jesus, in his earthly ministry, consistently judges by divine insight."
    },
    {
      "pk": 29011004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 4,
      "text": "But with righteousness he will judge the poor, and decide with equity for the meek of the earth; he will strike the earth with the rod of his mouth, and with the breath of his lips he will slay the wicked.",
      "links": "<a href='/AIV/19/72/2'>Ps. 72:2</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "The imagery of striking with the rod of his mouth appears in Revelation (Rev. 19:15), revealing the divine authority of Christ’s word. Righteous judgment is a hallmark of his reign."
    },
    {
      "pk": 29011005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 5,
      "text": "Righteousness will be the belt around his waist, and faithfulness the sash around his hips.",
      "links": "<a href='/AIV/49/6/14'>Eph. 6:14</a>; <a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Paul likens truth and righteousness to a belt in Ephesians 6:14. This verse speaks of the Messiah's complete readiness and commitment to justice and faithfulness."
    },
    {
      "pk": 29011006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 6,
      "text": "The wolf will live with the lamb, and the leopard will lie down with the young goat; the calf and the young lion and the fattened calf together; and a little child will lead them.",
      "links": "<a href='/AIV/23/65/25'>Isa. 65:25</a>; <a href='/AIV/36/3/19'>Zeph. 3:19</a>",
      "comment": "This poetic description foresees a peace that overturns natural enmity. Seen spiritually, it symbolizes the harmony brought by the Messiah's reign, where innocence and humility lead."
    },
    {
      "pk": 29011007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 7,
      "text": "The cow and the bear will graze; their young will lie down together; and the lion will eat straw like the ox.",
      "links": "<a href='/AIV/23/65/25'>Isa. 65:25</a>",
      "comment": "God’s restoration brings even warring creatures into unity, representing the healing and transformation possible through divine power. This foreshadows the renewal of creation itself."
    },
    {
      "pk": 29011008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 8,
      "text": "The infant will play beside the hole of the cobra, and the weaned child will put his hand in the viper's den.",
      "links": "<a href='/AIV/19/91/13'>Ps. 91:13</a>; <a href='/AIV/41/16/18'>Mark 16:18</a>",
      "comment": "This vision of safety and innocence echoes the promises of protection found in Psalm 91 and foreshadowed in the signs accompanying followers of Christ (Mark 16:18)."
    },
    {
      "pk": 29011009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 9,
      "text": "They will not harm or destroy on all my holy mountain, for the earth will be full of the knowledge of the LORD as the waters cover the sea.",
      "links": "<a href='/AIV/35/2/14'>Hab. 2:14</a>; <a href='/AIV/23/2/2'>Isa. 2:2-4</a>",
      "comment": "The proliferation of the knowledge of God fulfills earlier promises (Hab. 2:14), suggesting both a literal peace and spiritual transformation covering all creation."
    },
    {
      "pk": 29011010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 10,
      "text": "On that day, the root of Jesse will stand as a signal for the peoples; nations will seek him, and his resting place will be glorious.",
      "links": "<a href='/AIV/45/15/12'>Rom. 15:12</a>; <a href='/AIV/23/66/18-19'>Isa. 66:18-19</a>",
      "comment": "Paul cites this verse (Rom. 15:12) as referring to Jesus, showing that the Messiah draws all nations. His resting place points to a spiritual gathering and possibly the sanctuary of God's presence."
    },
    {
      "pk": 29011011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 11,
      "text": "On that day the Lord will again stretch out his hand to recover the remnant of his people who remain, from Assyria and Egypt, from Pathros, Cush, Elam, Shinar, Hamath, and the islands of the sea.",
      "links": "<a href='/AIV/23/10/20-22'>Isa. 10:20-22</a>; <a href='/AIV/26/39/27'>Ezek. 39:27-28</a>",
      "comment": "This promise of restoration highlights God's ongoing mission to gather his people from every nation, foreshadowing the later inclusion of all peoples into God's family."
    },
    {
      "pk": 29011012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 12,
      "text": "He will raise a banner for the nations, and gather the exiles of Israel; he will assemble the scattered of Judah from the four corners of the earth.",
      "links": "<a href='/AIV/23/27/13'>Isa. 27:13</a>; <a href='/AIV/40/24/31'>Matt. 24:31</a>",
      "comment": "The gathering of God's people from all the earth is echoed by Jesus' own words concerning the end times (Matt. 24:31), pointing toward a physical and spiritual reunion within the Church."
    },
    {
      "pk": 29011013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 13,
      "text": "Ephraim’s jealousy will depart, and the hostility between Judah and Ephraim will cease. Ephraim will not envy Judah, nor will Judah oppose Ephraim.",
      "links": "<a href='/AIV/23/9/21'>Isa. 9:21</a>; <a href='/AIV/26/37/16-19'>Ezek. 37:16-19</a>",
      "comment": "This reunification of Israel's divided kingdom foreshadows deeper peace and unity, fulfilled spiritually in the coming together of all believers through the One Shepherd."
    },
    {
      "pk": 29011014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 14,
      "text": "Together they will swoop down on the slopes of Philistia to the west; together they will plunder the people of the east. They will stretch out their hand against Edom and Moab, and the Ammonites will obey them.",
      "links": "<a href='/AIV/23/16/14'>Isa. 16:14</a>; <a href='/AIV/26/25/10'>Ezek. 25:10</a>",
      "comment": "Here, unity results in victory over traditional enemies. Typologically, this can represent the Church’s victory over sin and hostility, bringing outsiders into the community of God."
    },
    {
      "pk": 29011015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 15,
      "text": "The LORD will utterly dry up the tongue of the Egyptian sea, and with scorching wind will wave his hand over the River, striking it into seven channels, so that people can cross in sandals.",
      "links": "<a href='/AIV/2/14/21'>Ex. 14:21</a>; <a href='/AIV/23/19/5'>Isa. 19:5</a>",
      "comment": "This recalls the Exodus miracle (Ex. 14:21), and promises future deliverance. The repeated crossing on dry ground is a sign of God’s ongoing redemptive work, which continues among His people."
    },
    {
      "pk": 29011016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 11,
      "verse": 16,
      "text": "There will be a highway for the remnant of his people who remain, from Assyria, just as there was for Israel when they came up from the land of Egypt.",
      "links": "<a href='/AIV/23/35/8'>Isa. 35:8</a>; <a href='/AIV/23/40/3'>Isa. 40:3</a>; <a href='/AIV/2/14/29'>Ex. 14:29</a>",
      "comment": "The highway imagery symbolizes easy access to salvation and to God’s presence. Isaiah uses this elsewhere to signify preparation for the Lord (Isa. 40:3). The theme of a gathered remnant points to a united family, guided by divine providence."
    }
  ],
  "translatedAt": "2025-12-24T07:56:20.035Z"
}