{
  "book": "Jude",
  "bookAbbreviation": "Jude",
  "chapter": 1,
  "verses": [
    {
      "pk": 2940101,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 1,
      "text": "Jude, a servant of Jesus Christ and brother of James, to those who are called, loved by God the Father and kept for Jesus Christ:",
      "links": "<a href='/AIV/40/13/55'>Matt. 13:55</a>; <a href='/AIV/50/1/1'>Phil. 1:1</a>",
      "comment": "Jude identifies himself as both a servant of Jesus and brother of James, connecting to the apostolic leadership. 'Kept for Jesus Christ' hints at divine protection and perseverance in the faith, possibly alluding to a communal preservation and unity."
    },
    {
      "pk": 2940102,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 2,
      "text": "May mercy, peace, and love be multiplied to you.",
      "links": "<a href='/AIV/60/1/2'>1 Pet. 1:2</a>",
      "comment": "Triad of mercy, peace, and love is a uniquely robust blessing, surpassing the typical 'grace and peace' greeting, emphasizing God's overflowing gifts—suggestive of ongoing participation in the divine life."
    },
    {
      "pk": 2940103,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 3,
      "text": "Beloved, while I was eager to write to you about our common salvation, I found it necessary to write exhorting you to contend earnestly for the faith that was once for all delivered to the saints.",
      "links": "<a href='/AIV/54/6/12'>1 Tim. 6:12</a>; <a href='/AIV/58/2/3'>Heb. 2:3</a>",
      "comment": "Jude stresses the universality and finality of the faith handed to the saints, underscoring the importance of tradition and stewardship of doctrine for all believers."
    },
    {
      "pk": 2940104,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 4,
      "text": "For certain people have crept in unnoticed, who long ago were designated for this condemnation, ungodly men who pervert the grace of our God into sensuality and deny our only Master and Lord, Jesus Christ.",
      "links": "<a href='/AIV/48/5/13'>Gal. 5:13</a>; <a href='/AIV/56/1/16'>Titus 1:16</a>",
      "comment": "The warning against false teachers who distort grace signals the need for vigilant communal boundaries, with 'Master and Lord' titles affirming Jesus' divinity and authority."
    },
    {
      "pk": 2940105,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 5,
      "text": "Now I want to remind you, though you already know this, that the Lord, having saved the people out of the land of Egypt, afterward destroyed those who did not believe.",
      "links": "<a href='/AIV/2/12/51'>Exod. 12:51</a>; <a href='/AIV/4/14/29-30'>Num. 14:29-30</a>",
      "comment": "The reference to the Exodus recalls God's saving acts juxtaposed with judgment upon unbelief. Spiritual unity demands both faith and obedience."
    },
    {
      "pk": 2940106,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 6,
      "text": "And the angels who did not keep their own position but abandoned their proper dwelling, he has kept in everlasting chains in darkness for the judgment of the great day.",
      "links": "<a href='/AIV/1/6/2-4'>Gen. 6:2–4</a>; <a href='/AIV/2/19/1'>Exod. 19:1</a>; <a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "Jude uses extra-biblical tradition to reinforce the fate of rebellious angels (see also 2 Peter 2:4), highlighting ultimate accountability to God and the reality of supernatural order."
    },
    {
      "pk": 2940107,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 7,
      "text": "Likewise, Sodom and Gomorrah and the surrounding towns, which indulged in immorality and pursued unnatural desires, serve as an example by undergoing the punishment of eternal fire.",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/66/21/8'>Rev. 21:8</a>",
      "comment": "References to eternal fire and specific moral failings echo a literal and spiritual warning, showing the continuity of God’s justice from Old to New Testament."
    },
    {
      "pk": 2940108,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 8,
      "text": "In the same way, these people also, relying on their dreams, defile the flesh, reject authority, and blaspheme glorious beings.",
      "links": "<a href='/AIV/2/16/2'>Exod. 16:2</a>; <a href='/AIV/61/2/10'>2 Pet. 2:10</a>",
      "comment": "The description of false teachers echoes themes of subjective authority vs. ecclesial and apostolic authority, emphasizing humility and obedience as key spiritual virtues."
    },
    {
      "pk": 2940109,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 9,
      "text": "But when Michael the archangel was disputing with the devil over the body of Moses, he did not presume to pronounce a blasphemous judgment, but said, 'The Lord rebuke you.'",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/66/12/7'>Rev. 12:7</a>",
      "comment": "Michael’s humility before God’s authority models reverence in spiritual warfare. While based on Jewish tradition (Assumption of Moses), it reinforces respect for divine order."
    },
    {
      "pk": 2940110,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 10,
      "text": "But these people blaspheme what they do not understand, and they are destroyed by what they instinctively know, like unreasoning animals.",
      "links": "<a href='/AIV/45/1/21-22'>Rom. 1:21-22</a>; <a href='/AIV/61/2/12'>2 Pet. 2:12</a>",
      "comment": "A warning that human reason alone can be corrupted; spiritual knowledge must be formed within the apostolic teaching."
    },
    {
      "pk": 2940111,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 11,
      "text": "Woe to them! For they have gone the way of Cain, rushed headlong into Balaam’s error for gain, and perished in Korah’s rebellion.",
      "links": "<a href='/AIV/1/4/8'>Gen. 4:8</a>; <a href='/AIV/4/22/7'>Num. 22:7</a>; <a href='/AIV/4/16/1-35'>Num. 16:1-35</a>",
      "comment": "The trio of Old Testament examples especially highlights the dangers of pride, greed, and rebellion against spiritual authority."
    },
    {
      "pk": 2940112,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 12,
      "text": "These are hidden reefs at your love feasts, feasting with you without fear, caring for themselves; clouds without water, carried along by winds; autumn trees without fruit, uprooted—twice dead.",
      "links": "<a href='/AIV/46/11/20'>1 Cor. 11:20</a>; <a href='/AIV/55/3/5'>2 Tim. 3:5</a>",
      "comment": "‘Love feasts’ refer to communal worship—likely the Eucharistic celebration—undermined by false teachers. Metaphors stress fruitfulness linked to rootedness in the faith."
    },
    {
      "pk": 2940113,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 13,
      "text": "They are wild waves of the sea, casting up their own shame like foam; wandering stars, for whom the deepest gloom of darkness has been reserved forever.",
      "links": "<a href='/AIV/23/57/20'>Isa. 57:20</a>; <a href='/AIV/66/8/10'>Rev. 8:10</a>",
      "comment": "Vivid apocalyptic imagery points to chaos, instability, and ultimate separation from God for those who resist divine order."
    },
    {
      "pk": 2940114,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 14,
      "text": "It was about these that Enoch, the seventh from Adam, prophesied, saying, 'Behold, the Lord comes with tens of thousands of his holy ones,'",
      "links": "<a href='/AIV/1/5/18'>Gen. 5:18</a>; <a href='/AIV/27/7/10'>Dan. 7:10</a>",
      "comment": "A quote from 1 Enoch, affirming the early Church’s recognition of ancient tradition; underscores the certainty of coming judgment coupled with divine majesty."
    },
    {
      "pk": 2940115,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 15,
      "text": "to execute judgment on all and to convict all the ungodly of all their ungodly deeds which they have done in an ungodly way, and of all the harsh things ungodly sinners have spoken against him.",
      "links": "<a href='/AIV/19/50/6'>Ps. 50:6</a>; <a href='/AIV/66/19/11'>Rev. 19:11</a>",
      "comment": "The fourfold use of 'ungodly' highlights the total corruption that divine judgment will eradicate, portraying Christ as the eschatological Judge."
    },
    {
      "pk": 2940116,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 16,
      "text": "These are grumblers and malcontents, following their own desires; their mouths speak boastful words, flattering people for their own advantage.",
      "links": "<a href='/AIV/4/14/2'>Num. 14:2</a>; <a href='/AIV/45/16/18'>Rom. 16:18</a>",
      "comment": "Points to a deficiency in humility and charity; self-seeking disrupts the unity and holiness of the Body."
    },
    {
      "pk": 2940117,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 17,
      "text": "But you, beloved, remember the words spoken before by the apostles of our Lord Jesus Christ.",
      "links": "<a href='/AIV/44/20/29-30'>Acts 20:29–30</a>; <a href='/AIV/61/3/2'>2 Pet. 3:2</a>",
      "comment": "Emphasizes the authority of apostolic tradition as the safeguard against heresy—historic continuity is key."
    },
    {
      "pk": 2940118,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 18,
      "text": "They said to you, 'In the last time there will be scoffers, following their own ungodly desires.'",
      "links": "<a href='/AIV/54/4/1'>1 Tim. 4:1</a>; <a href='/AIV/61/3/3'>2 Pet. 3:3</a>",
      "comment": "End-times warnings by the apostles create a sense of vigilance for the faithful; spiritual discernment is essential for protection and perseverance."
    },
    {
      "pk": 2940119,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 19,
      "text": "These are the ones who cause divisions, worldly people, devoid of the Spirit.",
      "links": "<a href='/AIV/46/3/3'>1 Cor. 3:3</a>; <a href='/AIV/62/4/6'>1 John 4:6</a>",
      "comment": "A clear contrast between worldly wisdom and spiritual fullness; divisions imply a call for visible, organic unity among the believers."
    },
    {
      "pk": 2940120,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 20,
      "text": "But you, beloved, building yourselves up in your most holy faith and praying in the Holy Spirit,",
      "links": "<a href='/AIV/46/14/15'>1 Cor. 14:15</a>; <a href='/AIV/52/5/17'>1 Thess. 5:17</a>",
      "comment": "Community formation through shared faith and prayer in the Spirit; the phrase 'most holy faith' implies a sacred, tangible deposit received and maintained together."
    },
    {
      "pk": 2940121,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 21,
      "text": "keep yourselves in the love of God, waiting for the mercy of our Lord Jesus Christ that leads to eternal life.",
      "links": "<a href='/AIV/62/5/3'>1 John 5:3</a>; <a href='/AIV/45/2/7'>Rom. 2:7</a>",
      "comment": "Endurance in divine love, accompanied by hopeful anticipation of mercy—underscoring both the active and passive dimensions of salvation."
    },
    {
      "pk": 2940122,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 22,
      "text": "And have mercy on those who doubt;",
      "links": "<a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "Pastoral concern for doubters encourages restoration rather than condemnation—a hallmark of mature, sacramental community."
    },
    {
      "pk": 2940123,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 23,
      "text": "save others by snatching them out of the fire; to others show mercy with fear, hating even the garment stained by the flesh.",
      "links": "<a href='/AIV/30/4/11'>Amos 4:11</a>; <a href='/AIV/66/3/4'>Rev. 3:4</a>",
      "comment": "Active evangelization and vigilance against personal and communal sin; imagery draws from the Old Testament’s purity laws."
    },
    {
      "pk": 2940124,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 24,
      "text": "Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy,",
      "links": "<a href='/AIV/50/1/6'>Phil. 1:6</a>; <a href='/AIV/49/5/27'>Eph. 5:27</a>",
      "comment": "The assurance of divine perseverance and presentation to God reflects both spiritual and future bodily sanctification, culminating in eschatological joy."
    },
    {
      "pk": 2940125,
      "translation": "AIV",
      "book": 65,
      "chapter": 1,
      "verse": 25,
      "text": "to the only God our Savior, through Jesus Christ our Lord, be glory, majesty, power, and authority, before all time and now and forever. Amen.",
      "links": "<a href='/AIV/54/1/17'>1 Tim. 1:17</a>; <a href='/AIV/45/16/27'>Rom. 16:27</a>",
      "comment": "High Christology (‘only God our Savior, through Jesus Christ’) points directly to the divinity of Christ and the unity of Christian worship. The doxology affirms unbroken worship from eternity past to eternity future."
    }
  ],
  "translatedAt": "2025-12-23T04:20:41.721Z"
}