{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 7,
  "verses": [
    {
      "pk": 13007001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 1,
      "text": "The sons of Issachar were Tola, Puah, Jashub, and Shimron—four in total.",
      "links": "<a href='/AIV/1/46/13'>Gen. 46:13</a>; <a href='/AIV/4/26/23'>Num. 26:23</a>",
      "comment": "The listing of tribal sons roots Israel’s identity in history and covenant. The emphasis on four sons affirms the completeness of Issachar’s family line, showing God’s faithfulness to His promises. Genealogies underline the importance of tradition and apostolic succession in ancient faith."
    },
    {
      "pk": 13007002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 2,
      "text": "The descendants of Tola were mighty men of valor: their numbers in the days of David totaled twenty-two thousand six hundred.",
      "links": "<a href='/AIV/13/12/2'>1Chr. 12:2</a>; <a href='/AIV/10/23/8'>2Sam. 23:8</a>",
      "comment": "The mention of their valor and great numbers during David’s reign reinforces the significance of loyal lineage supporting God’s chosen king. This also points forward to Christ—the true King—whose followers would be known for spiritual valor as members of a united priesthood."
    },
    {
      "pk": 13007003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 3,
      "text": "The sons of Uzzi: Izrahiah. The sons of Izrahiah: Michael, Obadiah, Joel, and Isshiah, all five were chiefs.",
      "links": "<a href='/AIV/4/26/23'>Num. 26:23</a>",
      "comment": "The focus on leadership in each generation hints at the structure of God’s people—order and designated authority continue as core elements in biblical communities. Continuity of leadership would prepare for the Messianic kingdom where Christ is chief over all."
    },
    {
      "pk": 13007004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 4,
      "text": "Along with them, by their generations according to their fathers’ houses, were thirty-six thousand men for battle, for they had many wives and children.",
      "links": "<a href='/AIV/1/35/23'>Gen. 35:23</a>",
      "comment": "Large numbers of warriors are a sign of God’s blessing on the tribe. The flourishing of family lines also points toward God’s desire for His people to be fruitful—a result of the covenant promises first given to Abraham."
    },
    {
      "pk": 13007005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 5,
      "text": "Their kinsmen among all the families of Issachar were mighty men of valor, listed by genealogy eighty-seven thousand in total.",
      "links": "<a href='/AIV/4/26/23'>Num. 26:23</a>; <a href='/AIV/13/9/1'>1Chr. 9:1</a>",
      "comment": "A precise census shows structured stewardship and ordered worship among God’s people. Such organization foreshadows the Church as a spiritual family with a clear hierarchy and unity."
    },
    {
      "pk": 13007006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 6,
      "text": "The sons of Benjamin were Bela, Becher, and Jediael—three in all.",
      "links": "<a href='/AIV/1/46/21'>Gen. 46:21</a>; <a href='/AIV/4/26/38'>Num. 26:38</a>",
      "comment": "Benjamin’s listing connects to Saul, Israel’s first king. Alluding to royalty, Benjamin’s importance foreshadows the Messianic kingship—David’s successor, Christ, would unify Israel and the nations."
    },
    {
      "pk": 13007007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 7,
      "text": "The sons of Bela: Ezbon, Uzzi, Uzziel, Jerimoth, and Iri—five heads of fathers’ houses, mighty men of valor. They were counted by genealogy: twenty-two thousand thirty-four.",
      "links": "<a href='/AIV/4/26/40'>Num. 26:40</a>",
      "comment": "The Benjaminite genealogy emphasizes strong, faithful leadership. The consistent mention of mighty men further highlights preparation for God’s kingdom to come, increasingly realized in the Church."
    },
    {
      "pk": 13007008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 8,
      "text": "The sons of Becher: Zemirah, Joash, Eliezer, Elioenai, Omri, Jeremoth, Abijah, Anathoth, and Alemeth. All these were sons of Becher.",
      "links": "<a href='/AIV/4/26/38'>Num. 26:38</a>",
      "comment": "The detail shows the richness and diversity within tribes; each house contributes uniquely to the heritage of God’s people, just as every believer has a distinct role within the Church."
    },
    {
      "pk": 13007009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 9,
      "text": "Their records, counted by genealogy according to their generations, were twenty thousand two hundred.",
      "links": "<a href='/AIV/13/9/1'>1Chr. 9:1</a>",
      "comment": "Detailed enumeration of families reinforces ongoing remembrance and continuity—a reflection of God’s eternal covenant with His people and the orderly transmission of faith."
    },
    {
      "pk": 13007010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 10,
      "text": "The son of Jediael: Bilhan. The sons of Bilhan: Jeush, Benjamin, Ehud, Chenaanah, Zethan, Tarshish, and Ahishahar.",
      "links": "<a href='/AIV/4/26/38'>Num. 26:38</a>",
      "comment": "Continuing the genealogy downwards, the tradition highlights each generation’s potential contribution to God's unfolding plan of salvation."
    },
    {
      "pk": 13007011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 11,
      "text": "All these were sons of Jediael, heads of fathers’ houses, mighty men of valor, seventeen thousand two hundred equipped for war.",
      "links": "<a href='/AIV/13/7/7'>1Chr. 7:7</a>",
      "comment": "Martial readiness among God’s people is underscored, paralleling spiritual preparedness in the Church—the people set apart and ready for God’s purposes."
    },
    {
      "pk": 13007012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 12,
      "text": "Shuppim and Huppim were the sons of Ir; Hushim was the son of Aher.",
      "links": "<a href='/AIV/1/46/23'>Gen. 46:23</a>",
      "comment": "Domestically, all children matter—God values each line, reflecting the inclusive offer of salvation through Christ to all peoples."
    },
    {
      "pk": 13007013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 13,
      "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum, descended from Bilhah.",
      "links": "<a href='/AIV/1/46/24'>Gen. 46:24</a>",
      "comment": "The mention of Bilhah as mother highlights the value of every branch and every ancestor—for God’s kingdom encompasses all who respond in faith."
    },
    {
      "pk": 13007014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 14,
      "text": "The sons of Manasseh: Asriel, his concubine bore Machir, the father of Gilead.",
      "links": "<a href='/AIV/4/26/29'>Num. 26:29</a>",
      "comment": "Reference to concubines and inheritance reflects the complexity of God’s plan—even unconventional circumstances are used to bring about His promises, leading up to the perfect fulfillment in Christ."
    },
    {
      "pk": 13007015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 15,
      "text": "Machir took a wife from among the Huppim and Shuppim, her name was Maacah. The second was named Zelophehad, who had only daughters.",
      "links": "<a href='/AIV/4/27/1'>Num. 27:1</a>",
      "comment": "Zelophehad’s daughters are noted for inheriting property—a foreshadowing of spiritual inheritance available to all, regardless of background, in God’s Kingdom."
    },
    {
      "pk": 13007016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 16,
      "text": "Maacah, the wife of Machir, bore a son and called his name Peresh; his brother was Sheresh; Peresh’s sons were Ulam and Rakem.",
      "links": "<a href='/AIV/4/26/30'>Num. 26:30</a>",
      "comment": "Every generation is named and remembered, showing God’s ongoing faithfulness and the vital role of continuity in God’s family."
    },
    {
      "pk": 13007017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 17,
      "text": "The son of Ulam: Bedan. These were descendants of Gilead, son of Machir, son of Manasseh.",
      "links": "<a href='/AIV/4/26/30'>Num. 26:30</a>",
      "comment": "Ulam’s descendants preserve the heritage of Manasseh, an essential tribe, indicating careful stewardship of God-given blessings."
    },
    {
      "pk": 13007018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 18,
      "text": "His sister Hammolecheth bore Ishhod, Abiezer, and Mahlah.",
      "links": "<a href='/AIV/4/27/1'>Num. 27:1</a>",
      "comment": "Female roles, though often less prominent, show the fullness of God’s family and the inclusion of every member for His purposes."
    },
    {
      "pk": 13007019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 19,
      "text": "The sons of Shemida were Ahian, Shechem, Likhi, and Aniam.",
      "links": "",
      "comment": "Shemida is another branch of Manasseh, underpinning the idea of multiplicity and unity within the family of God."
    },
    {
      "pk": 13007020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 20,
      "text": "The sons of Ephraim: Shuthelah, Bered his son, Tahath his son, Eleadah his son, Tahath his son,",
      "links": "<a href='/AIV/4/26/35'>Num. 26:35</a>",
      "comment": "Repeating names in the genealogy emphasize continuity and tradition. Ephraim’s prominence points forward to messianic prophecy and restoration of Israel (cf. Hos. 11:8)."
    },
    {
      "pk": 13007021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 21,
      "text": "Zabad his son, Shuthelah his son, and Ezer and Elead. The men of Gath, natives of the land, killed them because they came down to take their cattle.",
      "links": "<a href='/AIV/9/13/20'>1Sam. 13:20</a>",
      "comment": "Hostility between Israel and outsiders was a pattern; their suffering for wrongdoing yet also for their faith becomes an analogy for enduring persecution as believers."
    },
    {
      "pk": 13007022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 22,
      "text": "Ephraim their father mourned many days, and his brothers came to comfort him.",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "Deep mourning and comfort from family foreshadow communal care and support in the spiritual family of God’s people—echoing the role of the Church as comforters (cf. 2Cor. 1:4)."
    },
    {
      "pk": 13007023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 23,
      "text": "Then Ephraim went in to his wife, and she conceived and bore a son. He called his name Beriah, because trouble had come upon his house.",
      "links": "<a href='/AIV/1/4/25'>Gen. 4:25</a>",
      "comment": "Naming after sorrow shows how God’s children often experience trials before the restoration promised through faith—culminating in Christ."
    },
    {
      "pk": 13007024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 24,
      "text": "His daughter was Sheerah, who built Upper and Lower Beth-horon and Uzzen-sheerah.",
      "links": "<a href='/AIV/6/10/10'>Josh. 10:10</a>",
      "comment": "Sheerah’s role as builder is extraordinary for a woman in the Old Testament, showing God’s capacity to use anyone for great purposes—signing the value of service within the spiritual family."
    },
    {
      "pk": 13007025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 25,
      "text": "Rephah was his son, and Resheph, Telah his son, Tahan his son,",
      "links": "<a href='/AIV/4/26/36'>Num. 26:36</a>",
      "comment": "Genealogy continues, marking the faithfulness of God to uphold family lines generation after generation."
    },
    {
      "pk": 13007026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 26,
      "text": "Ladan his son, Ammihud his son, Elishama his son,",
      "links": "<a href='/AIV/4/1/10'>Num. 1:10</a>",
      "comment": "The continuity with previous censuses upholds the theme of divine order and careful transmission of tradition."
    },
    {
      "pk": 13007027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 27,
      "text": "Nun his son, Joshua his son.",
      "links": "<a href='/AIV/6/1/1'>Josh. 1:1</a>",
      "comment": "Joshua, successor of Moses, prefigures Christ as the one who fully leads God’s people into inheritance—recall Christ as the greater Joshua (cf. Heb. 4:8)."
    },
    {
      "pk": 13007028,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 28,
      "text": "Their property and places of residence were Bethel and its towns, eastward Naaran, westward Gezer and its towns, and Shechem and its towns to Ayyah and its towns.",
      "links": "<a href='/AIV/6/21/21-22'>Josh. 21:21-22</a>",
      "comment": "Geographical inheritance stresses the promised land’s fulfillment and stewardship—anticipating spiritual inheritance in Christ."
    },
    {
      "pk": 13007029,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 29,
      "text": "Also by the borders of the sons of Manasseh: Beth-shean and its towns, Taanach and its towns, Megiddo and its towns, Dor and its towns. In these lived the sons of Joseph, the son of Israel.",
      "links": "<a href='/AIV/6/17/11'>Josh. 17:11</a>; <a href='/AIV/1/49/22'>Gen. 49:22</a>",
      "comment": "The fullness of Joseph’s inheritance shows the favor and blessing for those faithful in Israel, pointing toward the spiritual abundance in Christ (cf. John 10:10)."
    },
    {
      "pk": 13007030,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 30,
      "text": "The sons of Asher: Imnah, Ishvah, Ishvi, Beriah, and Serah their sister.",
      "links": "<a href='/AIV/1/46/17'>Gen. 46:17</a>",
      "comment": "Asher’s family includes a sister, Serah, emphasizing that God’s covenant and blessing include women and men alike in various roles."
    },
    {
      "pk": 13007031,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 31,
      "text": "The sons of Beriah: Heber and Malchiel, who was the father of Birzaith.",
      "links": "<a href='/AIV/4/26/45'>Num. 26:45</a>",
      "comment": "This genealogy shows that every tribe has its unique history and contribution to the one people of God."
    },
    {
      "pk": 13007032,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 32,
      "text": "Heber begot Japhlet, Shomer, and Hotham, as well as Shua their sister.",
      "links": "",
      "comment": "Sisters are not often named in genealogies, so their inclusion is significant—demonstrating God’s remembrance of each member."
    },
    {
      "pk": 13007033,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 33,
      "text": "The sons of Japhlet: Pasach, Bimhal, and Ashvath; these are Japhlet’s sons.",
      "links": "",
      "comment": "The record continues, upholding order and memory—a practice that finds its full meaning in the communion of saints, each person recorded before God."
    },
    {
      "pk": 13007034,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 34,
      "text": "The sons of Shomer: Ahi, Rohgah, Hubbah, and Aram.",
      "links": "",
      "comment": "Every generation matters. The careful recording of genealogy upholds the value of every soul reached through divine grace."
    },
    {
      "pk": 13007035,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 35,
      "text": "The sons of his brother Helem: Zophah, Imna, Shelesh, and Amal.",
      "links": "",
      "comment": "Shared ancestry affirms familial unity—hinting at the unity of believers in one spiritual household built upon apostolic tradition."
    },
    {
      "pk": 13007036,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 36,
      "text": "The sons of Zophah: Suah, Harnepher, Shual, Beri, Imrah,",
      "links": "",
      "comment": "The ongoing list shows fullness and fruitfulness among God's people—a picture of spiritual fruit to be manifest in every believer."
    },
    {
      "pk": 13007037,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 37,
      "text": "Bezer, Hod, Shamma, Shilshah, Ithran, and Beera.",
      "links": "",
      "comment": "The genealogy continues to emphasize everyone’s connection to the promises of God. Each name is a testament to faithful transmission."
    },
    {
      "pk": 13007038,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 38,
      "text": "The sons of Jether: Jephunneh, Pispah, and Ara.",
      "links": "",
      "comment": "Minor names complete the record—showing that no one is overlooked by divine providence."
    },
    {
      "pk": 13007039,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 39,
      "text": "The sons of Ulla: Arah, Hanniel, and Rizia.",
      "links": "",
      "comment": "As the genealogy draws toward its end, every name bears witness to God’s concern for His people through every era."
    },
    {
      "pk": 13007040,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 7,
      "verse": 40,
      "text": "All these belonged to the families of the sons of Asher, heads of their fathers’ houses, chosen mighty men of valor, chief among the leaders. Their number listed for service was twenty-six thousand men.",
      "links": "<a href='/AIV/4/26/47'>Num. 26:47</a>",
      "comment": "Final enumeration of Asher’s tribe points to their special role among Israel’s leaders. The recording of ‘service’ reflects the participation of all believers in the work God calls them to—anticipating the universal priesthood established by Christ. The restoration of order and leadership, especially chief roles, points toward the foundation of a united, apostolic Church, built on tradition, hierarchy, and fidelity—fitting Christ’s intention for His followers to continue His work in the world."
    }
  ],
  "translatedAt": "2025-12-24T04:08:58.841Z"
}