{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 17,
  "verses": [
    {
      "pk": 13017001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 1,
      "text": "Now, when David was settled in his house, he said to Nathan the prophet, 'Look, I live in a house of cedar, but the Ark of the Covenant of the Lord stays under a tent.'",
      "links": "<a href='/AIV/10/7/2'>2 Sam. 7:2</a>; <a href='/AIV/13/15/1'>1 Chr. 15:1</a>",
      "comment": "David recognizes the contrast between his own comfort and the humble dwelling of the Ark, showing his devotion to God's presence. This sets the stage for the desire to build a temple—a theme later fulfilled in Christ, who becomes the ultimate Temple (John 2:21)."
    },
    {
      "pk": 13017002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 2,
      "text": "Nathan said to David, 'Do all that is in your heart, for God is with you.'",
      "links": "<a href='/AIV/10/7/3'>2 Sam. 7:3</a>",
      "comment": "Nathan, as the prophet, first affirms David’s intentions, misunderstanding the fullness of God’s plan. Shows both prophetic authority and the need for divine revelation beyond human wisdom."
    },
    {
      "pk": 13017003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 3,
      "text": "But that night, the word of God came to Nathan, saying:",
      "links": "<a href='/AIV/10/7/4'>2 Sam. 7:4</a>",
      "comment": "God often clarifies his will to his servants, reminding us of the necessity of seeking divine guidance. This illustrates the pattern of prophetic correction and obedience."
    },
    {
      "pk": 13017004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 4,
      "text": "'Go and tell my servant David, \"This is what the LORD says: You shall not build me a house to dwell in.\"'",
      "links": "<a href='/AIV/10/7/5'>2 Sam. 7:5</a>; <a href='/AIV/13/22/7-8'>1 Chr. 22:7-8</a>",
      "comment": "God reveals that David is not the one chosen to build the temple, despite his good intentions. Highlights divine sovereignty and wisdom surpassing our human understanding."
    },
    {
      "pk": 13017005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 5,
      "text": "'For I have not dwelt in a house since the day I brought Israel up out of Egypt, but I have moved from tent to tent and from dwelling to dwelling.'",
      "links": "<a href='/AIV/02/40/34-38'>Ex. 40:34-38</a>; <a href='/AIV/09/4/4'>1 Sam. 4:4</a>",
      "comment": "God’s presence journeyed with His people in portable dwellings, emphasizing God’s closeness to Israel throughout their history. Points to the incarnation—God dwelling among us in Christ (John 1:14)."
    },
    {
      "pk": 13017006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 6,
      "text": "'In all places where I have moved with all Israel, did I ever ask any of the judges of Israel, whom I commanded to shepherd my people, \"Why have you not built me a house of cedar?\"'",
      "links": "<a href='/AIV/07/2/16'>Judg. 2:16</a>",
      "comment": "God reminds David that He never requested a permanent house, showing that God’s plan unfolds gradually. Echoes God guiding His flock through various leaders, foreshadowing Christ the Good Shepherd (John 10:11)."
    },
    {
      "pk": 13017007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 7,
      "text": "'Now then, tell my servant David, \"This is what the LORD of hosts says: I took you from the pasture, from following the sheep, to be ruler over my people Israel.\"'",
      "links": "<a href='/AIV/09/16/11-13'>1 Sam. 16:11-13</a>",
      "comment": "God reminds David of His sovereign election—from humble beginnings, David is raised up as king, symbolizing God’s power to transform lives for His purposes."
    },
    {
      "pk": 13017008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 8,
      "text": "'I have been with you wherever you have gone, and I have cut off all your enemies from before you. I will make your name great, like the names of the greatest men on earth.'",
      "links": "<a href='/AIV/10/5/10'>2 Sam. 5:10</a>",
      "comment": "God promises to exalt David’s name, implying a lasting legacy. This sees prophetic fulfillment in the messianic title 'Son of David' applied to Jesus (Matthew 21:9)."
    },
    {
      "pk": 13017009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 9,
      "text": "'And I will appoint a place for my people Israel, and will plant them, so that they may dwell in their own place and not be disturbed; nor shall wicked people wear them down as before,'",
      "links": "<a href='/AIV/10/7/10'>2 Sam. 7:10</a>",
      "comment": "God’s establishment of Israel in peace and security foreshadows the ultimate fulfillment of rest in God’s kingdom, both earthly and heavenly."
    },
    {
      "pk": 13017010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 10,
      "text": "'From the time I appointed judges over my people Israel. And I will subdue all your enemies. Furthermore, I declare to you that the LORD will build you a house.'",
      "links": "<a href='/AIV/10/7/11'>2 Sam. 7:11</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "God reverses David’s plan—the Lord will build David a house (dynasty), not vice versa. This points to the establishment of a perpetual kingship, culminating in Christ."
    },
    {
      "pk": 13017011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 11,
      "text": "'When your days are fulfilled and you go to be with your fathers, I will raise up your offspring after you, one of your own sons, and I will establish his kingdom.'",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>",
      "comment": "This prophecy finds its immediate fulfillment in Solomon, but its ultimate realization in the eternal reign of Jesus, the true Son of David."
    },
    {
      "pk": 13017012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 12,
      "text": "'He shall build a house for me, and I will establish his throne forever.'",
      "links": "<a href='/AIV/13/28/6'>1 Chr. 28:6</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "Solomon constructed the temple, yet the promise of an everlasting throne points to Christ, whose kingdom is eternal (Daniel 7:14)."
    },
    {
      "pk": 13017013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 13,
      "text": "'I will be his father, and he will be my son. I will not take my steadfast love away from him as I took it from him who was before you.'",
      "links": "<a href='/AIV/10/7/14'>2 Sam. 7:14</a>; <a href='/AIV/58/1/5'>Hebrews 1:5</a>",
      "comment": "This verse carries both an immediate and prophetic sense, speaking of Solomon and foreshadowing the divine sonship of Jesus."
    },
    {
      "pk": 13017014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 14,
      "text": "'But I will set him in my house and my kingdom forever, and his throne shall be established forever.'",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "Eternal establishment of the throne points unmistakably to messianic fulfillment in Christ’s everlasting kingship."
    },
    {
      "pk": 13017015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 15,
      "text": "According to all these words and this revelation, Nathan spoke to David.",
      "links": "<a href='/AIV/10/7/17'>2 Sam. 7:17</a>",
      "comment": "Nathan faithfully delivers God’s message, illustrating the importance of revelation and authoritative preaching within the community of faith."
    },
    {
      "pk": 13017016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 16,
      "text": "Then King David went and sat before the Lord and said, 'Who am I, O Lord God, and what is my house, that you have brought me this far?'",
      "links": "<a href='/AIV/10/7/18'>2 Sam. 7:18</a>; <a href='/AIV/09/18/18'>1 Sam. 18:18</a>",
      "comment": "David’s humility and awe at God’s grace teaches the posture we should have before divine blessing—a sense of unworthiness met by divine generosity."
    },
    {
      "pk": 13017017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 17,
      "text": "'And yet this was a small thing in your eyes, O God, for you have spoken about your servant’s house for a great while to come, and have regarded me according to the standard of a man of high rank, O Lord God.'",
      "links": "<a href='/AIV/10/7/19'>2 Sam. 7:19</a>",
      "comment": "David marvels at God’s promise, indicating that such grace is far more generous than expected. Spiritual applications include God's initiative in blessing beyond human worthiness."
    },
    {
      "pk": 13017018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 18,
      "text": "'What more can David say to you for honoring your servant? For you know your servant.'",
      "links": "<a href='/AIV/19/139/1'>Ps. 139:1</a>",
      "comment": "David gives credit to God for knowing him intimately, as later echoed in Psalm 139—a biblical affirmation of God’s omniscience."
    },
    {
      "pk": 13017019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 19,
      "text": "'O Lord, for your servant’s sake, and according to your own heart, you have done all this greatness, revealing all these great things.'",
      "links": "<a href='/AIV/10/7/21'>2 Sam. 7:21</a>",
      "comment": "The gifts and promises are grounded in God’s own will, not merely David’s merit—a principle of grace often echoed in the New Testament (Ephesians 2:8-9)."
    },
    {
      "pk": 13017020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 20,
      "text": "'O Lord, there is none like you, and there is no God besides you, according to all that we have heard with our ears.'",
      "links": "<a href='/AIV/05/4/35'>Deut. 4:35</a>; <a href='/AIV/19/86/8'>Ps. 86:8</a>",
      "comment": "David affirms God’s uniqueness and supreme authority—a foundational principle for worship and devotion."
    },
    {
      "pk": 13017021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 21,
      "text": "'And who is like your people Israel, the one nation on earth whom God went to redeem as his people, to make for yourself a name of greatness and terror, by driving out nations before your people whom you redeemed from Egypt?'",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/05/4/34'>Deut. 4:34</a>",
      "comment": "Israel’s unique calling prefigures the establishment of God's chosen people. Spiritual interpretation connects this to the New Covenant community, redeemed and set apart for God’s glory."
    },
    {
      "pk": 13017022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 22,
      "text": "'And you made your people Israel to be your own forever; and you, O Lord, became their God.'",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "This highlights the covenant bond between God and His people, anticipating the eternal union of God and His people in the fulfillment of all things."
    },
    {
      "pk": 13017023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 23,
      "text": "'And now, O Lord, let the promise you have made concerning your servant and his house be confirmed forever, and do as you have spoken.'",
      "links": "<a href='/AIV/10/7/25'>2 Sam. 7:25</a>",
      "comment": "David’s prayer invokes faith in God's promises, underscoring the reliability of God’s word—a theme pursued throughout Scripture."
    },
    {
      "pk": 13017024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 24,
      "text": "'Let your name be established and magnified forever, saying, \"The LORD of hosts, the God of Israel, is Israel’s God,\" and let the house of your servant David be established before you.'",
      "links": "<a href='/AIV/13/29/13'>1 Chr. 29:13</a>",
      "comment": "David’s prayer for God’s name and his own line reveals the unity between God’s glory and the perpetuation of His covenant community. The establishment of David’s house connects directly to messianic hopes."
    },
    {
      "pk": 13017025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 25,
      "text": "'For you, my God, have revealed to your servant that you will build him a house. That is why your servant has found courage to pray to you.'",
      "links": "<a href='/AIV/10/7/27'>2 Sam. 7:27</a>",
      "comment": "David’s boldness in prayer hinges on divine initiative and revelation—the same foundation for Christian prayer and confidence."
    },
    {
      "pk": 13017026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 26,
      "text": "'O Lord, you are God! You have promised this good thing to your servant.'",
      "links": "<a href='/AIV/10/7/28'>2 Sam. 7:28</a>",
      "comment": "God’s faithfulness is underscored; Scripture continually calls God true to His word, encouraging trust and faith."
    },
    {
      "pk": 13017027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 17,
      "verse": 27,
      "text": "'Now you have been pleased to bless the house of your servant, that it may continue forever before you. For you, O Lord, have blessed, and it is blessed forever.'",
      "links": "<a href='/AIV/19/89/36-37'>Ps. 89:36-37</a>",
      "comment": "David affirms in faith that God’s blessing is irrevocable and everlasting—a confidence later fulfilled through the eternal kingship of Christ, echoing the permanent nature of God's promises to His people."
    }
  ],
  "translatedAt": "2025-12-24T04:14:48.644Z"
}