{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 10,
  "verses": [
    {
      "pk": 13010001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 1,
      "text": "Now the Philistines fought against Israel. The Israelites fled from before the Philistines, and many of them fell slain on Mount Gilboa.",
      "links": "<a href='/AIV/9/31/1'>1 Sam. 31:1</a>; <a href='/AIV/19/44/9-10'>Ps. 44:9-10</a>",
      "comment": "This account parallels 1 Samuel 31, showing the defeat of Israel as a consequence of spiritual failure. The spiritual principle of God’s judgment on unfaithfulness is highlighted (see Ps. 44:9-10)."
    },
    {
      "pk": 13010002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 2,
      "text": "The Philistines pursued Saul and his sons and killed Jonathan, Abinadab, and Malchishua, Saul’s sons.",
      "links": "<a href='/AIV/9/31/2'>1 Sam. 31:2</a>",
      "comment": "The loss of Saul’s sons, especially Jonathan, marks a tragic moment. The death of Jonathan also closes a chapter of friendship and covenant faithfulness anticipated in messianic figures (see 1 Sam. 18:1-4)."
    },
    {
      "pk": 13010003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 3,
      "text": "The battle grew fierce around Saul, and the archers overtook him, and he was severely wounded by the archers.",
      "links": "<a href='/AIV/9/31/3'>1 Sam. 31:3</a>",
      "comment": "Saul’s wounding fulfills the judgment foretold for his disobedience. The description of archers alludes to God using external threats for discipline (see Deut. 32:23)."
    },
    {
      "pk": 13010004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 4,
      "text": "Then Saul said to his armor-bearer, 'Draw your sword and pierce me with it, or else these uncircumcised will come and make sport of me.' But his armor-bearer would not, because he was very afraid. So Saul took his own sword and fell upon it.",
      "links": "<a href='/AIV/9/31/4'>1 Sam. 31:4</a>; <a href='/AIV/7/16/30'>Judg. 16:30</a>",
      "comment": "Saul’s tragic death by suicide is not celebrated, but portrayed as a consequence of turning from the Lord. The phrase 'uncircumcised' links to themes of covenant and purity. Compare this scene with the death of Samson (Judg. 16:30), another judge whose life ended in despair, highlighting the importance of faithful perseverance."
    },
    {
      "pk": 13010005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 5,
      "text": "When his armor-bearer saw that Saul was dead, he also fell on his sword and died.",
      "links": "<a href='/AIV/9/31/5'>1 Sam. 31:5</a>",
      "comment": "The loyalty of the armor-bearer, even in death, foreshadows the sacrificial loyalty expected of disciples and close followers throughout Scripture (see John 15:13 regarding sacrificial love)."
    },
    {
      "pk": 13010006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 6,
      "text": "So Saul died, and his three sons, and all his household died together.",
      "links": "<a href='/AIV/9/31/6'>1 Sam. 31:6</a>",
      "comment": "The judgment includes Saul’s entire household, showing the seriousness of leadership and the consequences of sin. This highlights the biblical principle of generational stewardship, echoed later in the role of spiritual fathers in the church (cf. Eph. 6:4; 1 Tim. 3:4-5)."
    },
    {
      "pk": 13010007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 7,
      "text": "When all the men of Israel who were in the valley saw that the army had fled and that Saul and his sons were dead, they abandoned their cities and fled. So the Philistines came and lived in them.",
      "links": "<a href='/AIV/9/31/7'>1 Sam. 31:7</a>",
      "comment": "Israel’s abandonment of their inheritance fulfills warnings of judgment (Deut. 28:47-52). The loss of the land points toward the need for a faithful king to restore the people, anticipating messianic fulfillment."
    },
    {
      "pk": 13010008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 8,
      "text": "The next day, when the Philistines came to strip the slain, they discovered Saul and his sons fallen on Mount Gilboa.",
      "links": "<a href='/AIV/9/31/8'>1 Sam. 31:8</a>",
      "comment": "The shame of defeated Israel is made public. This moment sets up the restoration to come under David, symbolizing how public sin is remedied by public restoration and redemption (cf. Rom. 5:19)."
    },
    {
      "pk": 13010009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 9,
      "text": "They stripped him, took his head and his armor, and sent word throughout the land of the Philistines, to carry the news to their idols and to their people.",
      "links": "<a href='/AIV/9/31/9'>1 Sam. 31:9</a>; <a href='/AIV/19/44/13-14'>Ps. 44:13-14</a>",
      "comment": "Saul’s humiliation before pagan gods underscores the importance of the true worship of the one God, and the consequences of apostasy (see Ps. 44:13-14). The enemies’ boasting contrasts sharply with God’s later vindication through David."
    },
    {
      "pk": 13010010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 10,
      "text": "They placed his armor in the house of their gods and fastened his head in the temple of Dagon.",
      "links": "<a href='/AIV/9/31/10'>1 Sam. 31:10</a>; <a href='/AIV/9/5/2-7'>1 Sam. 5:2-7</a>",
      "comment": "Saul’s head placed in the temple of Dagon illustrates how God’s people suffer when forsaking divine worship. Notably, this also references the earlier episode where the Ark of the Covenant brought judgment upon Dagon (see 1 Sam. 5:2-7), emphasizing the supremacy of God even amidst apparent defeat."
    },
    {
      "pk": 13010011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 11,
      "text": "When all Jabesh-Gilead heard everything the Philistines had done to Saul,",
      "links": "<a href='/AIV/9/31/11'>1 Sam. 31:11</a>",
      "comment": "Jabesh-Gilead’s loyalty is a response to Saul’s earlier kindness (compare with 1 Sam. 11:1-11). Their response models gratitude and honor for leadership, a principle echoed in Christian obedience to spiritual authorities (cf. Heb. 13:17)."
    },
    {
      "pk": 13010012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 12,
      "text": "all their valiant men rose up, took the bodies of Saul and his sons, brought them to Jabesh, and buried their bones under the oak in Jabesh. Then they fasted seven days.",
      "links": "<a href='/AIV/9/31/12-13'>1 Sam. 31:12-13</a>; <a href='/AIV/6/24/26'>Josh. 24:26</a>",
      "comment": "The act of burying the bones and the seven-day fast reflect communal mourning and respect for the dead. The ritual actions hint at the spiritual significance of funerary rites, later seen in Christian burial practices (see Josh. 24:26 for sacred burial under an oak)."
    },
    {
      "pk": 13010013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 13,
      "text": "So Saul died for his unfaithfulness against the LORD, because he did not keep the word of the LORD and also consulted a medium for guidance.",
      "links": "<a href='/AIV/9/28/7'>1 Sam. 28:7</a>; <a href='/AIV/3/19/31'>Lev. 19:31</a>",
      "comment": "Here, Saul's death is given theological meaning: it is the direct result of not keeping God’s word and seeking help from a medium, forbidden in the Law (see Lev. 19:31). This underlines the necessity of obedience to God's revealed authority and the rejection of occult practices, a key theme for spiritual fidelity."
    },
    {
      "pk": 13010014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 10,
      "verse": 14,
      "text": "He did not inquire of the LORD; therefore, He put him to death and turned the kingdom over to David son of Jesse.",
      "links": "<a href='/AIV/9/13/14'>1 Sam. 13:14</a>; <a href='/AIV/19/78/70-71'>Ps. 78:70-71</a>",
      "comment": "Saul’s failure to seek the LORD is contrasted with David’s chosen status. The text subtly underscores the transition of divine authority and kingship, prefiguring David as a forerunner to the eternal king (see Ps. 78:70-71). This theme draws spiritual attention to the importance of succession in spiritual leadership, echoing the line of spiritual authority and apostolic tradition in the church’s foundation."
    }
  ],
  "translatedAt": "2025-12-24T04:10:49.692Z"
}