{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 21,
  "verses": [
    {
      "pk": 13021001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 1,
      "text": "Then Satan rose up against Israel and incited David to count the people of Israel.",
      "links": "<a href='/AIV/10/24/1'>2 Sam. 24:1</a>; <a href='/AIV/18/1/6-12'>Job 1:6–12</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "The name 'Satan' here means adversary or accuser. In 2 Samuel 24:1, it is the anger of the LORD that moves David, showing the mystery of divine providence and permission of evil for greater good. The introduction of Satan as tempter hints at spiritual warfare underlying visible events."
    },
    {
      "pk": 13021002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 2,
      "text": "So David said to Joab and the commanders of the troops, 'Go, count Israel from Beersheba to Dan and bring me a report so that I may know their number.'",
      "links": "<a href='/AIV/10/24/2'>2 Sam. 24:2</a>; <a href='/AIV/07/20/1'>Judg. 20:1</a>",
      "comment": "Beersheba in the south to Dan in the north marks the traditional span of the land. David’s desire to number the people can reflect pride or a reliance on human strength rather than on God's providence."
    },
    {
      "pk": 13021003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 3,
      "text": "But Joab replied, 'May the LORD multiply His people a hundredfold! My lord the king, are they not all servants of my lord? Why should my lord seek this? Why should he bring guilt on Israel?'",
      "links": "<a href='/AIV/02/30/12'>Exod. 30:12</a>; <a href='/AIV/10/24/3'>2 Sam. 24:3</a>",
      "comment": "Joab senses the census is wrong unless commanded by God, as earlier censuses included atonement offerings (Exod. 30:12). Joab’s protest hints at a spiritual intuition sometimes overlooked by leaders."
    },
    {
      "pk": 13021004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 4,
      "text": "But the king’s command was stronger than Joab’s. So Joab departed and travelled through all Israel, and returned to Jerusalem.",
      "links": "<a href='/AIV/10/24/4'>2 Sam. 24:4</a>",
      "comment": "David’s insistence shows how even God’s chosen charge can err when acting apart from the Lord’s will. This sets the stage for repentance and mercy that follows."
    },
    {
      "pk": 13021005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 5,
      "text": "Joab gave the total of the census to David. In all Israel there were one million one hundred thousand men able to draw a sword, and in Judah four hundred and seventy thousand men able to draw a sword.",
      "links": "<a href='/AIV/10/24/9'>2 Sam. 24:9</a>",
      "comment": "Chronicles gives a slightly different number than Samuel—a typical variance due to different sources or counting methods. The large size emphasizes God's blessing, but also the danger of human pride."
    },
    {
      "pk": 13021006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 6,
      "text": "But he did not include Levi and Benjamin in the count, because Joab was disgusted with the king’s command.",
      "links": "<a href='/AIV/01/49/27'>Gen. 49:27</a>; <a href='/AIV/04/1/47-49'>Num. 1:47–49</a>",
      "comment": "Levi was not usually counted in military censuses by divine instruction (cf. Num. 1:47–49). That Joab omits Benjamin may show either haste, reluctance, or a deeper sense of unease at the task."
    },
    {
      "pk": 13021007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 7,
      "text": "But God was displeased with this thing and struck Israel.",
      "links": "<a href='/AIV/10/24/10-15'>2 Sam. 24:10–15</a>",
      "comment": "The census is not inherently wrong, but doing it for prideful motives brings guilt. God’s discipline reveals the seriousness of trusting in numbers or human strength rather than in His providence."
    },
    {
      "pk": 13021008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 8,
      "text": "David said to God, 'I have sinned greatly by doing this. Please take away the guilt of Your servant, for I have acted very foolishly.'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>; <a href='/AIV/10/24/10'>2 Sam. 24:10</a>",
      "comment": "David confesses plainly, embodying the heart of true repentance. This model is echoed in Psalm 51, showing that restoration with God depends on humble confession."
    },
    {
      "pk": 13021009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 9,
      "text": "The LORD spoke to Gad, David’s seer, saying,",
      "links": "<a href='/AIV/09/3/1'>1 Sam. 3:1</a>; <a href='/AIV/10/24/11'>2 Sam. 24:11</a>",
      "comment": "God sends His response through the prophet, reminding us that He continues to use intermediaries to communicate His will. Prophets stand as vital links between man and God."
    },
    {
      "pk": 13021010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 10,
      "text": "'Go and tell David this is what the LORD says: “I am giving you three options; choose one for Me to do to you.”'",
      "links": "<a href='/AIV/10/24/12'>2 Sam. 24:12</a>",
      "comment": "God’s discipline invites a free response; even in punishment, He allows a certain participation and choice, which deepens David’s sense of accountability."
    },
    {
      "pk": 13021011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 11,
      "text": "So Gad came to David and said to him, 'This is what the LORD says: “Choose for yourself”,'",
      "links": "<a href='/AIV/10/24/13'>2 Sam. 24:13</a>",
      "comment": "Reiterates the necessity of David making a moral decision rather than remaining passive in view of sin and its consequences."
    },
    {
      "pk": 13021012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 12,
      "text": "'either three years of famine, or three months of being swept away before your enemies and the sword of your foes overtaking you, or three days of the sword of the LORD—plague in the land, with the angel of the LORD bringing destruction throughout all the territory of Israel. Now consider what answer I should return to Him who sent me.'",
      "links": "<a href='/AIV/03/26/25'>Lev. 26:25</a>; <a href='/AIV/10/24/13'>2 Sam. 24:13</a>",
      "comment": "All three punishments echo covenant curses (Lev. 26). The 'angel of the LORD' imagery recalls Passover and later, the ministry of angels throughout scripture—messengers and executors of God’s will."
    },
    {
      "pk": 13021013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 13,
      "text": "David said to Gad, 'I am in great distress. Let me fall into the hand of the LORD, for His mercy is very great; but do not let me fall into human hands.'",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/10/24/14'>2 Sam. 24:14</a>",
      "comment": "Even when facing justice, David appeals to God’s mercy—a principle running throughout salvation history. Trust in divine mercy is fundamental to relationship with God."
    },
    {
      "pk": 13021014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 14,
      "text": "So the LORD sent a plague on Israel, and seventy thousand men of Israel fell.",
      "links": "<a href='/AIV/10/24/15'>2 Sam. 24:15</a>",
      "comment": "The heavy consequence underscores the seriousness of leadership and collective responsibility. Yet even this harsh punishment is brief compared to the potential length of other options."
    },
    {
      "pk": 13021015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 15,
      "text": "God sent an angel to Jerusalem to destroy it, but as he was about to destroy it, the LORD looked and relented from the disaster and said to the destroying angel, 'Enough! Withdraw your hand.' The angel of the LORD was then standing by the threshing floor of Ornan the Jebusite.",
      "links": "<a href='/AIV/02/12/13'>Exod. 12:13</a>; <a href='/AIV/19/78/38'>Ps. 78:38</a>; <a href='/AIV/10/24/16'>2 Sam. 24:16</a>",
      "comment": "This moment focuses on God’s mercy overtaking His wrath. The location—Ornan’s threshing floor—will later become the site of Solomon’s Temple, central to worship and sacrificial atonement foreshadowing Christ."
    },
    {
      "pk": 13021016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 16,
      "text": "David looked up and saw the angel of the LORD standing between earth and heaven, with a drawn sword in his hand stretched out over Jerusalem. So David and the elders, clothed in sackcloth, fell face down.",
      "links": "<a href='/AIV/01/18/1-2'>Gen. 18:1–2</a>; <a href='/AIV/06/5/13'>Josh. 5:13</a>; <a href='/AIV/19/35/13'>Ps. 35:13</a>",
      "comment": "The angel as mediator between heaven and earth prefigures the priestly and intercessory role fulfilled in Christ. The elders' sackcloth and prostration demonstrate true contrition and communal repentance."
    },
    {
      "pk": 13021017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 17,
      "text": "David said to God, 'Wasn’t I the one who ordered the people to be counted? I, the shepherd, have sinned and done wrong. But these sheep, what have they done? LORD my God, let Your hand be against me and my father’s house, but not against Your people, that they should be plagued.'",
      "links": "<a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "David identifies himself with the shepherd—a key foreshadowing of Christ, the Good Shepherd who takes the punishment on Himself for the sheep (John 10:11). This substitutionary dynamic lays groundwork for later doctrines of atonement."
    },
    {
      "pk": 13021018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 18,
      "text": "Then the angel of the LORD commanded Gad to tell David to go up and build an altar to the LORD on the threshing floor of Ornan the Jebusite.",
      "links": "<a href='/AIV/01/22/2'>Gen. 22:2</a>; <a href='/AIV/10/24/18'>2 Sam. 24:18</a>",
      "comment": "The chosen site links back to Abraham’s offering of Isaac (Gen. 22:2), highlighting continuity of sacrifice and foreshadowing the one perfect sacrifice to come."
    },
    {
      "pk": 13021019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 19,
      "text": "So David went up as Gad had spoken in the name of the LORD.",
      "links": "<a href='/AIV/10/24/19'>2 Sam. 24:19</a>",
      "comment": "David’s obedience ‘in the name of the LORD’ models right response to prophetic instruction—an example of faithfulness and humility before God’s revelation."
    },
    {
      "pk": 13021020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 20,
      "text": "Now Ornan was threshing wheat. He turned and saw the angel, and his four sons who were with him hid themselves.",
      "links": "<a href='/AIV/02/33/20'>Exod. 33:20</a>; <a href='/AIV/01/16/7-10'>Gen. 16:7–10</a>",
      "comment": "Fear at the appearance of the angel reflects the awe and terror due the presence of divine messengers. Ornan’s reaction echoes responses of others called in critical moments."
    },
    {
      "pk": 13021021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 21,
      "text": "As David came to Ornan, Ornan looked and saw David. He went out from the threshing floor and bowed down before David with his face to the ground.",
      "links": "<a href='/AIV/08/2/10'>Ruth 2:10</a>; <a href='/AIV/43/12/3'>John 12:3</a>",
      "comment": "Ornan’s act of reverence underscores respect for authority and for what God is accomplishing through David."
    },
    {
      "pk": 13021022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 22,
      "text": "Then David said to Ornan, 'Sell me the site of this threshing floor, that I may build an altar to the LORD on it, so that the plague may be lifted from the people. Sell it to me for the full price.'",
      "links": "<a href='/AIV/01/23/9'>Gen. 23:9</a>; <a href='/AIV/10/24/21'>2 Sam. 24:21'</a>",
      "comment": "David insists on paying ‘full price’ for the site, just as Abraham did for Sarah’s burial field. This affirms that sacrifice must cost something to be genuine—a principle underlying sacrificial worship."
    },
    {
      "pk": 13021023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 23,
      "text": "Ornan said to David, 'Take it! Let my lord the king do what is good in his eyes. Look, I give the oxen for burnt offerings, the threshing sledges for wood, and the wheat for the grain offering—everything I give.'",
      "links": "<a href='/AIV/01/14/18-20'>Gen. 14:18–20</a>",
      "comment": "Ornan’s generosity echoes Melchizedek’s offering, pointing to the ideal of worship and selfless giving that prefigures Christian stewardship and offering."
    },
    {
      "pk": 13021024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 24,
      "text": "But King David said to Ornan, 'No, I will buy it for the full price. I will not take what is yours for the LORD or offer a burnt offering that costs me nothing.'",
      "links": "<a href='/AIV/10/24/24'>2 Sam. 24:24</a>",
      "comment": "Sacrifice and worship are to be personal and costly, never superficial. David’s resolve highlights the value of intentional offering and the heart’s disposition in worship—principles still central in Christian spirituality."
    },
    {
      "pk": 13021025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 25,
      "text": "So David gave Ornan six hundred shekels of gold by weight for the site.",
      "links": "<a href='/AIV/01/23/16'>Gen. 23:16</a>; <a href='/AIV/11/3/1'>1 Kgs. 3:1</a>",
      "comment": "David’s payment formalizes the acquisition, ensuring that the future Temple’s site was acquired justly and righteously. This historical anchor strengthens the continuity of God’s plan for worship in Jerusalem."
    },
    {
      "pk": 13021026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 26,
      "text": "David built an altar to the LORD there and offered burnt offerings and peace offerings. He called to the LORD, and He answered him with fire from heaven on the altar of burnt offering.",
      "links": "<a href='/AIV/03/9/24'>Lev. 9:24</a>; <a href='/AIV/11/18/38'>1 Kgs. 18:38</a>",
      "comment": "The divine fire confirms that David’s sacrifice is accepted, a prefiguration of God’s approval of true worship and sacrifice—fulfilled perfectly in Christ’s self-offering."
    },
    {
      "pk": 13021027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 27,
      "text": "Then the LORD spoke to the angel, and he put away his sword back into its sheath.",
      "links": "<a href='/AIV/01/3/24'>Gen. 3:24</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "God’s mercy ends the judgment. The imagery of the sword sheathed recalls scenes where God limits judgment and restores peace—a hint of the efficacy of atoning sacrifice."
    },
    {
      "pk": 13021028,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 28,
      "text": "At that time, when David saw that the LORD had answered him on the threshing floor of Ornan the Jebusite, he offered sacrifices there.",
      "links": "<a href='/AIV/11/8/62-63'>1 Kgs. 8:62–63</a>",
      "comment": "The chosen place becomes a permanent site of worship, anticipating the future Temple as the center of Israel’s sacrificial worship—a foundation for ongoing communal liturgical life."
    },
    {
      "pk": 13021029,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 29,
      "text": "The tabernacle of the LORD, which Moses had made in the wilderness, and the altar of burnt offering were at that time at the high place in Gibeon.",
      "links": "<a href='/AIV/02/40/2'>Exod. 40:2</a>; <a href='/AIV/14/1/3'>2 Chr. 1:3</a>",
      "comment": "This detail marks a transition from the movable tabernacle to the fixed altar at Jerusalem, signaling a movement toward a unified, visible place of worship for God’s people."
    },
    {
      "pk": 13021030,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 21,
      "verse": 30,
      "text": "But David could not go before it to seek God, because he was afraid of the sword of the angel of the LORD.",
      "links": "<a href='/AIV/02/33/20'>Exod. 33:20</a>",
      "comment": "David’s fear shows that encountering the true and holy presence of God is not to be taken lightly. The need for an accessible but holy place of worship, mediated through sacrifice, finds its fulfillment in later worship through Christ, who removes the barrier between God and man."
    }
  ],
  "translatedAt": "2025-12-24T04:16:41.049Z"
}