{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 29,
  "verses": [
    {
      "pk": 13029001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 1,
      "text": "Then King David said to all the assembly, \"My son Solomon—whom God alone has chosen—is young and inexperienced, and the work is great; for the palace will not be for man, but for the LORD God.\"",
      "links": "<a href='/AIV/11/3/7'>1 Kings 3:7</a>; <a href='/AIV/13/28/6'>1 Chr. 28:6</a>",
      "comment": "David makes clear that this temple is to be dedicated to God, not for human purposes. This prefigures the later understanding of God dwelling among His people, pointing towards Christ as the temple (John 2:19-21)."
    },
    {
      "pk": 13029002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 2,
      "text": "So with all my strength I have provided for the house of my God—gold for gold articles, silver for silver, bronze for bronze, iron for iron, wood for wood, as well as onyx stones, settings for jewels, turquoise, all sorts of precious stones and marble in abundance.",
      "links": "<a href='/AIV/11/7/51'>1 Kings 7:51</a>; <a href='/AIV/13/22/14'>1 Chr. 22:14</a>",
      "comment": "David's generosity models total dedication, reflecting a heart willing to give for God's dwelling place, foreshadowing Christian discipleship and sacrificial giving."
    },
    {
      "pk": 13029003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 3,
      "text": "Moreover, because of my delight in the house of my God, I am giving my own private treasure of gold and silver for the house of my God, beyond all that I have prepared for the holy house.",
      "links": "<a href='/AIV/13/22/14-16'>1 Chr. 22:14-16</a>",
      "comment": "David’s personal gift shows that building God’s house requires personal sacrifice, a theme present in New Testament teaching (Mark 12:41-44)."
    },
    {
      "pk": 13029004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 4,
      "text": "Three thousand talents of gold (of Ophir) and seven thousand talents of refined silver, to overlay the walls of the buildings;",
      "links": "<a href='/AIV/11/10/11'>1 Kings 10:11</a>",
      "comment": "The mentioned quantities emphasize the overwhelming abundance and glory intended for God’s house, reflecting the heavenly temple’s magnificence in Revelation (Rev. 21:18)."
    },
    {
      "pk": 13029005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 5,
      "text": "gold for the gold work and silver for the silver work, and for all the work to be done by craftsmen. Who then is willing to consecrate himself today to the LORD?\"",
      "links": "<a href='/AIV/13/28/21'>1 Chr. 28:21</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "David’s call to consecration anticipates the Christian call to self-offering and holiness (Romans 12:1)."
    },
    {
      "pk": 13029006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 6,
      "text": "Then the leaders of families, the commanders of the tribes of Israel, the officers over the thousands and hundreds, and the officials in charge of the king’s work offered willingly.",
      "links": "<a href='/AIV/13/24/4'>1 Chr. 24:4</a>; <a href='/AIV/13/27/1'>1 Chr. 27:1</a>",
      "comment": "The leaders act in unity, setting an example for obedience and zeal, echoing the apostolic unity of the early Church (Acts 4:32)."
    },
    {
      "pk": 13029007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 7,
      "text": "They gave for the service of the house of God five thousand talents and ten thousand darics of gold, ten thousand talents of silver, eighteen thousand talents of bronze, and a hundred thousand talents of iron.",
      "links": "<a href='/AIV/13/29/3'>1 Chr. 29:3</a>",
      "comment": "The generosity highlights collective responsibility in building God's kingdom, a principle continued in Christian stewardship."
    },
    {
      "pk": 13029008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 8,
      "text": "And those who had precious stones gave them to the treasury of the house of the LORD, under the care of Jehiel the Gershonite.",
      "links": "<a href='/AIV/13/26/22'>1 Chr. 26:22</a>",
      "comment": "Special treasures are entrusted to designated guardians, foreshadowing the Old Testament’s establishment of sacred offices for maintaining worship and order."
    },
    {
      "pk": 13029009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 9,
      "text": "Then the people rejoiced because they had offered willingly, for with a whole heart they had offered freely to the LORD. King David also rejoiced greatly.",
      "links": "<a href='/AIV/19/110/3'>Ps. 110:3</a>; <a href='/AIV/47/9/7'>2 Cor. 9:7</a>",
      "comment": "Joyful giving with a free heart shows the spiritual power of unity in worship, preparing for the new covenant joy found in Christ."
    },
    {
      "pk": 13029010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 10,
      "text": "Therefore, David blessed the LORD before all the assembly. And David said, \"Blessed are You, O LORD, God of Israel, our father, forever and ever.\"",
      "links": "<a href='/AIV/19/41/13'>Ps. 41:13</a>; <a href='/AIV/19/106/48'>Ps. 106:48</a>",
      "comment": "David’s blessing is both liturgical and communal, echoing future forms of worship and prayer in Christian tradition."
    },
    {
      "pk": 13029011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 11,
      "text": "Yours, O LORD, is the greatness and the power and the glory and the victory and the majesty; indeed, everything in heaven and earth is Yours. Yours is the kingdom, O LORD, and You are exalted as head over all.",
      "links": "<a href='/AIV/19/145/11-13'>Ps. 145:11-13</a>; <a href='/AIV/40/6/13'>Matt. 6:13</a>",
      "comment": "This verse closely mirrors the doxology in the Lord’s Prayer (Matthew 6:13), linking Old Testament worship directly to Christian liturgy and the idea of God's eternal kingship."
    },
    {
      "pk": 13029012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 12,
      "text": "Riches and honor come from You, and You rule over all. In Your hand are power and might, and it is in Your hand to make great and to strengthen everyone.",
      "links": "<a href='/AIV/19/75/6-7'>Ps. 75:6-7</a>; <a href='/AIV/27/2/20-21'>Dan. 2:20-21</a>",
      "comment": "God’s sovereignty over all material and spiritual gifts is emphasized, foundational for understanding divine providence."
    },
    {
      "pk": 13029013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 13,
      "text": "And now, our God, we give thanks to You and praise Your glorious name.",
      "links": "<a href='/AIV/19/30/4'>Ps. 30:4</a>; <a href='/AIV/19/111/9'>Ps. 111:9</a>",
      "comment": "Thanksgiving and praise are central to both Old and New Testament worship, showing God's praise as the purpose of creation (Eph. 1:12)."
    },
    {
      "pk": 13029014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 14,
      "text": "But who am I, and who are my people, that we should be able to offer so freely as this? For all things come from You, and what we have given You comes from Your own hand.",
      "links": "<a href='/AIV/10/7/18'>2 Sam. 7:18</a>; <a href='/AIV/46/4/7'>1 Cor. 4:7</a>",
      "comment": "David acknowledges God’s grace as the source of every good, underlying Christian teachings on grace and stewardship."
    },
    {
      "pk": 13029015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 15,
      "text": "For we are strangers and sojourners before You, as were all our ancestors; our days on the earth are like a shadow, and there is no hope.",
      "links": "<a href='/AIV/19/39/12'>Ps. 39:12</a>; <a href='/AIV/58/11/13'>Heb. 11:13</a>",
      "comment": "The idea of earthly pilgrimage echoes later New Testament themes of Christians as 'sojourners' looking forward to heavenly fulfillment (Heb. 11:13)."
    },
    {
      "pk": 13029016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 16,
      "text": "O LORD our God, all this abundance that we have provided for building You a house for Your holy name comes from Your hand and belongs to You.",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "Emphasizes that all belongs to God—echoing the spiritual truth that the Church is built by God's power and all things belong to Him."
    },
    {
      "pk": 13029017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 17,
      "text": "I know, my God, that You test the heart and delight in uprightness. In the uprightness of my heart I have willingly offered all these things, and now I have seen Your people, who are present here, offering to You willingly and joyfully.",
      "links": "<a href='/AIV/19/7/9'>Ps. 7:9</a>; <a href='/AIV/19/51/6'>Ps. 51:6</a>",
      "comment": "God desires inner righteousness, reinforcing the need for purity of intention in worship and service."
    },
    {
      "pk": 13029018,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 18,
      "text": "O LORD, God of Abraham, Isaac, and Israel, keep this desire and thought in the hearts of Your people forever, and direct their hearts toward You.",
      "links": "<a href='/AIV/13/16/16'>1 Chr. 16:16</a>; <a href='/AIV/19/119/36'>Ps. 119:36</a>",
      "comment": "David’s prayer for continual faithfulness points to the idea of tradition and apostolic succession—maintaining continuity in worship and devotion."
    },
    {
      "pk": 13029019,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 19,
      "text": "Give to Solomon my son a loyal heart to keep Your commandments, Your testimonies, and Your statutes, to do everything and to build the palace for which I have made provision.\"",
      "links": "<a href='/AIV/19/72/1'>Ps. 72:1</a>; <a href='/AIV/13/22/6-10'>1 Chr. 22:6-10</a>",
      "comment": "A prayer for Solomon’s faithfulness points to the necessity of both right faith and works in fulfilling God’s will."
    },
    {
      "pk": 13029020,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 20,
      "text": "Then David said to all the assembly, \"Bless the LORD your God!\" And all the assembly blessed the LORD, the God of their fathers, and bowed low and prostrated themselves before the LORD and the king.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/13/29/10'>1 Chr. 29:10</a>",
      "comment": "Liturgical blessing and bowing are central acts of corporate worship, anticipating later Christian forms of reverence and adoration."
    },
    {
      "pk": 13029021,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 21,
      "text": "And on the next day they offered sacrifices to the LORD and presented burnt offerings to the LORD: a thousand bulls, a thousand rams, a thousand lambs, with their drink offerings, and many sacrifices for all Israel.",
      "links": "<a href='/AIV/13/16/1'>1 Chr. 16:1</a>; <a href='/AIV/11/8/62-64'>1 Kings 8:62-64</a>",
      "comment": "The vast number of offerings demonstrates communal participation and prefigures the sacrificial nature of Christian worship fulfilled in Christ’s sacrifice."
    },
    {
      "pk": 13029022,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 22,
      "text": "They ate and drank before the LORD on that day with great joy. And they made Solomon son of David king the second time, and anointed him before the LORD as prince, and Zadok as priest.",
      "links": "<a href='/AIV/11/1/32-39'>1 Kings 1:32-39</a>; <a href='/AIV/13/23/1'>1 Chr. 23:1</a>",
      "comment": "Anointing Solomon as king and Zadok as priest together formally connects royal and priestly authority, prefiguring Christ as both King and High Priest (Hebrews 7:1-3)."
    },
    {
      "pk": 13029023,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 23,
      "text": "Then Solomon sat on the throne of the LORD as king in place of David his father. He prospered, and all Israel obeyed him.",
      "links": "<a href='/AIV/11/2/12'>1 Kings 2:12</a>",
      "comment": "Solomon’s enthronement is called 'sitting on the throne of the LORD,' indicating that earthly kingship shares in divine authority when aligned with God’s will—foreshadowing Christ’s eternal reign."
    },
    {
      "pk": 13029024,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 24,
      "text": "All the leaders, the mighty men, and also all the sons of King David pledged allegiance to King Solomon.",
      "links": "<a href='/AIV/11/1/53'>1 Kings 1:53</a>",
      "comment": "The unified pledge shows the importance of unity under a divinely chosen leader, reminiscent of obedience to apostolic authority in the early Church (Acts 2:42)."
    },
    {
      "pk": 13029025,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 25,
      "text": "The LORD greatly exalted Solomon in the sight of all Israel and bestowed upon him royal majesty such as had not been on any king before him in Israel.",
      "links": "<a href='/AIV/11/3/13'>1 Kings 3:13</a>",
      "comment": "Solomon’s unique royal majesty signifies God’s blessing tied to fidelity to divine purpose, a theme anticipated in Christ’s glory."
    },
    {
      "pk": 13029026,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 26,
      "text": "Thus David son of Jesse reigned over all Israel.",
      "links": "<a href='/AIV/10/5/4-5'>2 Sam. 5:4-5</a>",
      "comment": "This closes David’s reign, affirming God’s faithfulness to His promises—David’s house is foundational for messianic prophecy fulfilled in Christ (Luke 1:32-33)."
    },
    {
      "pk": 13029027,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 27,
      "text": "And the time that he reigned over Israel was forty years; he reigned seven years in Hebron and thirty-three years in Jerusalem.",
      "links": "<a href='/AIV/10/5/5'>2 Sam. 5:5</a>; <a href='/AIV/11/2/11'>1 Kings 2:11</a>",
      "comment": "David’s symbolic reign—forty years—echoes biblical periods of preparation and fulfillment, with Jerusalem’s centrality pointing toward the importance of the holy city in salvation history."
    },
    {
      "pk": 13029028,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 28,
      "text": "David died at a good old age, full of days, riches, and honor. Then Solomon his son reigned in his place.",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>",
      "comment": "David’s peaceful death, succeeded by Solomon, continues God’s promise for David’s lineage—a prophecy ultimately fulfilled in Jesus, the Son of David."
    },
    {
      "pk": 13029029,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 29,
      "text": "And the acts of King David, from beginning to end, are written in the Chronicles of Samuel the seer, Nathan the prophet, and Gad the seer.",
      "links": "<a href='/AIV/9/1/1'>1 Samuel 1:1</a>; <a href='/AIV/11/1/8-10'>1 Kings 1:8-10</a>",
      "comment": "Multiple inspired witnesses safeguard the transmission of sacred history, a principle seen in maintaining apostolic and prophetic tradition."
    },
    {
      "pk": 13029030,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 29,
      "verse": 30,
      "text": "With all his rule, his might, and the events that happened to him, to Israel, and to all the kingdoms of the lands.",
      "links": "<a href='/AIV/10/8/15'>2 Sam. 8:15</a>; <a href='/AIV/13/18/14'>1 Chr. 18:14</a>",
      "comment": "The chronicling of David’s reign emphasizes the lasting significance of God’s covenant with David, forming the backdrop for the coming of Christ, the eternal King (Matthew 1:1)."
    }
  ],
  "translatedAt": "2025-12-24T04:21:20.244Z"
}