{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 20,
  "verses": [
    {
      "pk": 13020001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 1,
      "text": "In the springtime of the year, when kings go out to battle, Joab led out the army and devastated the land of the Ammonites. He besieged Rabbah while David remained in Jerusalem. Joab attacked Rabbah and overthrew it.",
      "links": "<a href='/AIV/10/11/1'>2 Sam. 11:1</a>; <a href='/AIV/10/12/26-31'>2 Sam. 12:26-31</a>",
      "comment": "Unlike 2 Samuel, Chronicles omits the story of David's sin with Bathsheba, focusing instead on the military campaigns and successes under David's command, a subtle emphasis on his leadership. This further elevates David's image as a type of Christ, the anointed and victorious king (see <a href='/AIV/40/1/1'>Matt. 1:1</a>). The mention of spring as 'the time when kings go out' alludes to an established order and season for warfare in the ancient Near East."
    },
    {
      "pk": 13020002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 2,
      "text": "David took the crown from the head of their king. It was found to weigh a talent of gold, and it had a precious stone. It was placed on David’s head. He brought out a great amount of plunder from the city.",
      "links": "<a href='/AIV/10/12/30'>2 Sam. 12:30</a>; <a href='/AIV/19/21/3'>Ps. 21:3</a>",
      "comment": "David's donning of the crown is an image of divine favor and destiny, hinting at God's chosen kingly line. The taking of the crown also foreshadows the fulfillment of God’s promise to establish David’s throne forever (<a href='/AIV/10/7/16'>2 Sam. 7:16</a>), a foreshadowing type fulfilled in Christ (see <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>). The 'precious stone' may symbolize wisdom or divine approval."
    },
    {
      "pk": 13020003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 3,
      "text": "He brought out the people who were in the city, and set them to labor with saws, iron picks, and axes. David did this to all the cities of the Ammonites. Then David and all the army returned to Jerusalem.",
      "links": "<a href='/AIV/10/12/31'>2 Sam. 12:31</a>",
      "comment": "This verse refers to the Ammonite captives' forced labor. The Chronicler highlights David's authority and judgment, prefiguring Christ’s reign over the nations. The tradition of gathering the people also recalls the ingathering of the nations into the one kingdom (see <a href='/AIV/23/2/2-4'>Isa. 2:2-4</a>)."
    },
    {
      "pk": 13020004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 4,
      "text": "After this, there arose war at Gezer with the Philistines. At that time Sibbecai the Hushathite struck down Sippai, one of the descendants of the giants, and they were subdued.",
      "links": "<a href='/AIV/10/21/18'>2 Sam. 21:18</a>; <a href='/AIV/6/11/22'>Josh. 11:22</a>",
      "comment": "The defeat of the Philistine giants represents the triumph of God’s people over chaos and evil. The giants echo earlier battles with the Nephilim and point to the seed of the woman’s victory over evil (see <a href='/AIV/01/3/15'>Gen. 3:15</a>). Subduing giants is a motif fulfilled in David's greater Son, who conquers sin and death."
    },
    {
      "pk": 13020005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 5,
      "text": "Again, there was war with the Philistines; and Elhanan son of Jair struck down Lahmi the brother of Goliath the Gittite, whose spear shaft was like a weaver’s beam.",
      "links": "<a href='/AIV/10/21/19'>2 Sam. 21:19</a>; <a href='/AIV/09/17/7'>1 Sam. 17:7</a>",
      "comment": "Chronicles clarifies that Elhanan killed Lahmi, the brother of Goliath, not Goliath himself, aligning with the traditional understanding that David alone killed Goliath (<a href='/AIV/09/17/50'>1 Sam. 17:50</a>). The repeated battles emphasize ongoing spiritual warfare and remind us of the Church’s enduring conflicts against spiritual enemies."
    },
    {
      "pk": 13020006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 6,
      "text": "There was still another battle at Gath, where there was a man of great stature who had six fingers on each hand and six toes on each foot, twenty-four in all. He also was descended from the giants.",
      "links": "<a href='/AIV/10/21/20'>2 Sam. 21:20</a>",
      "comment": "Chronicling the defeat of the giants reflects the complete and total victory of David’s army, prefiguring the absolute triumph of Christ over all His enemies. The repetition of the number six suggests a sign of incompleteness or imperfection, which is ultimately defeated by God’s chosen people."
    },
    {
      "pk": 13020007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 7,
      "text": "When he taunted Israel, Jonathan the son of Shimea, David’s brother, struck him down.",
      "links": "<a href='/AIV/10/21/21'>2 Sam. 21:21</a>; <a href='/AIV/09/17/10'>1 Sam. 17:10</a>",
      "comment": "As Goliath once taunted Israel, so this descendant of the giants challenges God’s people. Jonathan’s victory echoes the theme that faithfulness and courage, even among the king’s own relatives, brings victory. This prefigures the familial nature of God’s covenant people and unity in spiritual battles."
    },
    {
      "pk": 13020008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 20,
      "verse": 8,
      "text": "These were descended from the giants in Gath, and they fell by the hand of David and by the hand of his servants.",
      "links": "<a href='/AIV/10/21/22'>2 Sam. 21:22</a>; <a href='/AIV/09/17/47'>1 Sam. 17:47</a>",
      "comment": "The total defeat of the giants by David’s hand and his servants reveals the cooperative nature of God’s saving plan, where the chosen king works through his people. This anticipates the role of the faithful in Christ’s kingdom, participating in His victory (<a href='/AIV/46/15/57'>1 Cor. 15:57</a>)."
    }
  ],
  "translatedAt": "2025-12-24T04:15:57.080Z"
}