{
  "book": 13,
  "bookName": "1 Chronicles",
  "bookAbbreviation": "1Chr",
  "chapter": 14,
  "verses": [
    {
      "pk": 13014001,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 1,
      "text": "King Hiram of Tyre sent messengers to David, along with cedar trees, masons, and carpenters to build a house for him.",
      "links": "<a href='/AIV/10/5/11'>2 Sam. 5:11</a>; <a href='/AIV/11/5/1'>1 Kings 5:1</a>",
      "comment": "This verse highlights David's relationship with foreign kings and the building of his house, pointing to the growing recognition of his kingship. The 'house' can be seen not just as a physical dwelling, but also as a sign of the establishment of his dynasty, prefiguring the household of faith built through David's line (<a href='/AIV/40/1/1'>Matt. 1:1</a>)."
    },
    {
      "pk": 13014002,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 2,
      "text": "And David understood that the LORD had established him as king over Israel, because his kingdom was highly exalted for the sake of His people Israel.",
      "links": "<a href='/AIV/10/5/12'>2 Sam. 5:12</a>; <a href='/AIV/19/89/20-29'>Ps. 89:20-29</a>",
      "comment": "David recognizes that his kingship is not for personal glory but for the people. This points to the principle that true leadership is service for God's flock and anticipates how Christ’s kingship is for the sake of humanity (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 13014003,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 3,
      "text": "David took more wives in Jerusalem; and David fathered more sons and daughters.",
      "links": "<a href='/AIV/10/5/13'>2 Sam. 5:13</a>; <a href='/AIV/05/17/17'>Deut. 17:17</a>",
      "comment": "David’s taking of more wives, though allowed in his time, is later clarified in Scripture as not ideal (<a href='/AIV/40/19/4-6'>Matt. 19:4-6</a>). The line of David is preserved despite his failings, illustrating God’s faithfulness and the preservation of His promises."
    },
    {
      "pk": 13014004,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 4,
      "text": "These are the names of the children born to him in Jerusalem: Shammua, Shobab, Nathan, Solomon,",
      "links": "<a href='/AIV/10/5/14'>2 Sam. 5:14</a>; <a href='/AIV/40/1/6'>Matt. 1:6</a>",
      "comment": "Solomon, listed here, will become heir to David’s throne and builder of the temple. Note the role Nathan plays in the genealogy of Jesus through Mary (<a href='/AIV/42/3/31'>Luke 3:31</a>), hinting at a dual legacy in salvation history."
    },
    {
      "pk": 13014005,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 5,
      "text": "Ibhar, Elishua, Elpelet,",
      "links": "<a href='/AIV/10/5/15-16'>2 Sam. 5:15-16</a>",
      "comment": "The chronicler carefully names David’s children, indicating the importance of lineage and the unfolding of God's promises through family and heritage, setting the ground for the one holy people."
    },
    {
      "pk": 13014006,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 6,
      "text": "Nogah, Nepheg, Japhia,",
      "links": "<a href='/AIV/10/5/15-16'>2 Sam. 5:15-16</a>",
      "comment": "These lists show the fullness of David's household and God’s blessing on his royal family, a sign that God raises up leaders for His people."
    },
    {
      "pk": 13014007,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 7,
      "text": "Elishama, Beeliada, and Eliphelet.",
      "links": "<a href='/AIV/10/5/16'>2 Sam. 5:16</a>",
      "comment": "Seven names are listed here, a symbolic number of completeness and blessing. Each name represents the continuation of God’s plan through human history."
    },
    {
      "pk": 13014008,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 8,
      "text": "When the Philistines heard that David had been anointed king over all Israel, all the Philistines went up to seek out David. But when David heard about it, he went out against them.",
      "links": "<a href='/AIV/10/5/17'>2 Sam. 5:17</a>; <a href='/AIV/09/16/13'>1 Sam. 16:13</a>",
      "comment": "The Philistines, ancient enemies of Israel, move aggressively when David is publicly enthroned, foreshadowing the continuing spiritual battles God's chosen must endure."
    },
    {
      "pk": 13014009,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 9,
      "text": "Now the Philistines came and made a raid in the Valley of Rephaim.",
      "links": "<a href='/AIV/10/5/18'>2 Sam. 5:18</a>",
      "comment": "The Valley of Rephaim is often associated with conflict and testing. These battles serve as reminders that the promised land requires constant vigilance and reliance on God's direction."
    },
    {
      "pk": 13014010,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 10,
      "text": "So David inquired of God, saying, 'Shall I go up against the Philistines? Will You deliver them into my hand?' The LORD said to him, 'Go up, for I will deliver them into your hand.'",
      "links": "<a href='/AIV/10/5/19'>2 Sam. 5:19</a>; <a href='/AIV/09/23/2'>1 Sam. 23:2</a>",
      "comment": "David's practice of seeking God's will is emphasized, showing the proper dependence on divine guidance—a pattern for spiritual leaders and the importance of listening to God's voice in all decisions."
    },
    {
      "pk": 13014011,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 11,
      "text": "So they went up to Baal-perazim, and David struck them there. Then David said, 'God has burst out against my enemies by my hand like the bursting out of waters.' Therefore, they called the name of that place Baal-perazim.",
      "links": "<a href='/AIV/10/5/20'>2 Sam. 5:20</a>; <a href='/AIV/23/28/21'>Isa. 28:21</a>",
      "comment": "The name Baal-perazim means 'Lord of breakthroughs.' David’s victory is attributed to God’s action. This foreshadows Christ’s victory over sin, securing deliverance by God's decisive intervention."
    },
    {
      "pk": 13014012,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 12,
      "text": "The Philistines abandoned their gods there, and David gave a command, and they were burned with fire.",
      "links": "<a href='/AIV/05/7/5,25'>Deut. 7:5,25</a>; <a href='/AIV/23/44/15'>Isa. 44:15</a>",
      "comment": "Idols are destroyed in accordance with God's command in the law, symbolizing the necessity of rejecting all false worship. The destruction of idols hints at the purifying role of true worship in the one faith."
    },
    {
      "pk": 13014013,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 13,
      "text": "Again the Philistines made a raid in the valley.",
      "links": "<a href='/AIV/10/5/22'>2 Sam. 5:22</a>",
      "comment": "Repetition of attacks underscores the persistence of evil and the necessity of ongoing vigilance and renewed obedience to God in the face of recurring trials."
    },
    {
      "pk": 13014014,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 14,
      "text": "So David again inquired of God, and God said to him, 'You shall not go up after them. Circle around behind them and come upon them opposite the balsam trees.'",
      "links": "<a href='/AIV/10/5/23'>2 Sam. 5:23</a>",
      "comment": "David’s obedience to specific divine instructions reveals the necessity for continued discernment and openness to God's changing guidance. The image of coming upon the enemy from behind points to the wisdom and creativity found in doing God’s will."
    },
    {
      "pk": 13014015,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 15,
      "text": "'And when you hear the sound of marching in the tops of the balsam trees, then go out to battle. For God will go out before you to strike the army of the Philistines.'",
      "links": "<a href='/AIV/02/14/14'>Exod. 14:14</a>; <a href='/AIV/10/5/24'>2 Sam. 5:24</a>",
      "comment": "God's presence is manifested in the 'sound of marching,' a supernatural sign that He fights for His people. This foreshadows the work of the Holy Spirit—God moving among His people, preparing victory."
    },
    {
      "pk": 13014016,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 16,
      "text": "So David did as God commanded him, and they struck down the Philistine army from Gibeon to Gezer.",
      "links": "<a href='/AIV/10/5/25'>2 Sam. 5:25</a>",
      "comment": "David's complete obedience brings victory. The geographical extent of the victory signifies the far-reaching effect of faithfulness to God, echoing the growing spread of God’s kingdom."
    },
    {
      "pk": 13014017,
      "translation": "AIV",
      "book": 13,
      "bookName": "1 Chronicles",
      "bookAbbreviation": "1Chr",
      "chapter": 14,
      "verse": 17,
      "text": "And the fame of David went out into all lands, and the LORD brought the fear of him upon all nations.",
      "links": "<a href='/AIV/10/7/9'>2 Sam. 7:9</a>; <a href='/AIV/19/18/43'>Ps. 18:43</a>",
      "comment": "David’s growing fame is attributed to the Lord. He is exalted for the sake of God’s people, ultimately pointing to Christ’s universal kingship (<a href='/AIV/50/2/9-11'>Phil. 2:9-11</a>), who is to be feared and honored by all nations."
    }
  ],
  "translatedAt": "2025-12-24T04:12:58.147Z"
}