{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 8,
  "verses": [
    {
      "pk": 10008001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 1,
      "text": "After this, David struck the Philistines and subdued them, and David took control of Metheg-ammah from the hand of the Philistines.",
      "links": "<a href='/AIV/9/7/13'>1 Sam 7:13</a>; <a href='/AIV/19/18/1'>Ps. 18:1</a>",
      "comment": "David begins establishing Israel’s supremacy over neighboring nations. Psalm 18 echoes God’s deliverance and blessing upon David’s victories, pointing ahead to Christ’s conquest over sin and death."
    },
    {
      "pk": 10008002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 2,
      "text": "He defeated Moab and measured them with a line, making them lie down on the ground; two lines he measured to be put to death, and one full line to be kept alive. So the Moabites became servants to David and brought tribute.",
      "links": "<a href='/AIV/4/24/17'>Num 24:17</a>; <a href='/AIV/19/60/8'>Ps. 60:8</a>",
      "comment": "David’s judgment over Moab fulfills ancient prophecies (Num 24:17). The tribute points to the king’s role not just as warrior but governor, foreshadowing the coming of the Messianic King who rules with justice and mercy."
    },
    {
      "pk": 10008003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 3,
      "text": "David also struck Hadadezer son of Rehob, king of Zobah, as he went to restore his control at the River Euphrates.",
      "links": "<a href='/AIV/13/18/3'>1 Chr 18:3</a>; <a href='/AIV/1/15/18'>Gen 15:18</a>",
      "comment": "David’s extension to the Euphrates fulfills God's promise of the land to Abraham’s offspring (Gen 15:18). The strong kingship here reflects the enduring authority promised by God to his chosen, prefiguring Christ’s ultimate reign."
    },
    {
      "pk": 10008004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 4,
      "text": "David captured from him seventeen hundred horsemen and twenty thousand foot soldiers. David hamstrung all the chariot horses, but left enough for a hundred chariots.",
      "links": "<a href='/AIV/13/18/4'>1 Chr 18:4</a>; <a href='/AIV/5/17/16'>Deut 17:16</a>",
      "comment": "Restraining the horses aligns with Deuteronomy 17:16’s warning for the king not to multiply horses, reflecting deeper trust in God rather than military power—important for understanding spiritual reliance throughout salvation history."
    },
    {
      "pk": 10008005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 5,
      "text": "When the Arameans of Damascus came to help Hadadezer king of Zobah, David struck down twenty-two thousand men of the Arameans.",
      "links": "<a href='/AIV/13/18/5'>1 Chr 18:5</a>",
      "comment": "David’s victories over Aram continue to show divine favor. The continuous conquest mirrors how the Son of David will conquer opposing spiritual powers."
    },
    {
      "pk": 10008006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 6,
      "text": "Then David set garrisons among the Arameans of Damascus, and the Arameans became servants to David, bringing tribute. And the LORD gave David victory wherever he went.",
      "links": "<a href='/AIV/13/18/6'>1 Chr 18:6</a>; <a href='/AIV/19/18/39'>Ps. 18:39</a>",
      "comment": "David’s garrisons indicate the establishment of lasting authority. God’s unwavering support of the chosen king foreshadows divine protection for the true 'house' God builds, both visible and spiritual."
    },
    {
      "pk": 10008007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 7,
      "text": "David took the shields of gold carried by the servants of Hadadezer and brought them to Jerusalem.",
      "links": "<a href='/AIV/13/18/7'>1 Chr 18:7</a>; <a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "Bringing treasures to Jerusalem anticipates the future gathering of the nations’ riches to the holy city, paralleling Christ gathering all things to Himself for the glory of God."
    },
    {
      "pk": 10008008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 8,
      "text": "From Betah and Berothai, cities of Hadadezer, King David took very much bronze.",
      "links": "<a href='/AIV/13/18/8'>1 Chr 18:8</a>",
      "comment": "The acquisition of precious metals prefigures the temple’s construction, supplied by David though built by his son. This meaningfully parallels how Christ prepares the way for the foundation of God’s enduring dwelling among his people."
    },
    {
      "pk": 10008009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 9,
      "text": "When Toi king of Hamath heard that David had defeated the entire army of Hadadezer,",
      "links": "<a href='/AIV/13/18/9'>1 Chr 18:9</a>",
      "comment": "Toi’s reaction demonstrates the far-reaching knowledge of David’s triumph and establishes diplomatic relationships, anticipating the worldwide recognition of God’s chosen king."
    },
    {
      "pk": 10008010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 10,
      "text": "he sent his son Joram to King David, to greet him and to bless him, because he had fought against Hadadezer and defeated him. For Hadadezer had been at war with Toi. Joram brought articles of silver, gold, and bronze.",
      "links": "<a href='/AIV/19/72/10'>Ps. 72:10</a>; <a href='/AIV/60/2/12'>1 Pet 2:12</a>",
      "comment": "Foreign nations bringing gifts to David prefigure the gospel reality of the Gentiles coming to God’s anointed with tribute and worship. See Psalm 72:10 for prophecy fulfillment."
    },
    {
      "pk": 10008011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 11,
      "text": "King David dedicated these to the LORD, along with the silver and gold that he had dedicated from all the nations he subdued:",
      "links": "<a href='/AIV/13/18/11'>1 Chr 18:11</a>; <a href='/AIV/19/68/18'>Ps. 68:18</a>",
      "comment": "David’s consecration of gifts emphasizes the importance of offering the spoils and blessings back to God, prefiguring the sanctification of everything for God’s service in the new covenant. Psalm 68:18 is echoed in the ascension of Christ, who gives spiritual gifts to His church."
    },
    {
      "pk": 10008012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 12,
      "text": "from Aram, Moab, the Ammonites, the Philistines, Amalek, and from the spoils of Hadadezer son of Rehob, king of Zobah.",
      "links": "<a href='/AIV/9/30/26-28'>1 Sam 30:26-28</a>",
      "comment": "This summary shows David’s faithfulness to dedicate his victories to God. Such dedication models total surrender and stewardship, pivotal in the life and mission of God’s people."
    },
    {
      "pk": 10008013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 13,
      "text": "David made a name for himself when he returned after striking eighteen thousand Edomites in the Valley of Salt.",
      "links": "<a href='/AIV/19/60/1'>Ps. 60:1</a>; <a href='/AIV/13/18/12'>1 Chr 18:12</a>",
      "comment": "By defeating Edom, David acquires renown—echoing the promised legacy to Abraham’s line, and a typological foreshadowing of the enduring fame and glory of the Messiah. Psalm 60 commemorates this event."
    },
    {
      "pk": 10008014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 14,
      "text": "He put garrisons in Edom; all Edom became servants to David. And the LORD gave victory to David wherever he went.",
      "links": "<a href='/AIV/19/44/1-3'>Ps. 44:1-3</a>",
      "comment": "David’s full reign over Edom is established, fulfilling God’s promise of dominion. The repeating phrase 'victory wherever he went' underlines God’s providential, sustaining endowment for His anointed ruler."
    },
    {
      "pk": 10008015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 15,
      "text": "So David reigned over all Israel, and David executed justice and righteousness for all his people.",
      "links": "<a href='/AIV/19/72/1-2'>Ps. 72:1-2</a>; <a href='/AIV/23/11/4'>Isa 11:4</a>",
      "comment": "David’s kingship is marked by justice and righteousness, an anticipation of the perfect reign of the Messiah, the Son of David, who fulfills the deepest desire for true justice and peace (see Psalm 72; Isaiah 11)."
    },
    {
      "pk": 10008016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 16,
      "text": "Joab son of Zeruiah was over the army; Jehoshaphat son of Ahilud was recorder;",
      "links": "<a href='/AIV/13/18/15'>1 Chr 18:15</a>",
      "comment": "Here is the key administrative structure of David’s rule. Such order anticipates the structure and continuity of spiritual leadership, as established by the apostles and their successors."
    },
    {
      "pk": 10008017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 17,
      "text": "Zadok son of Ahitub and Ahimelech son of Abiathar were priests; Seraiah was secretary;",
      "links": "<a href='/AIV/13/18/16'>1 Chr 18:16</a>; <a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "The presence of priests with David, especially from two lines, emphasizes the necessary intercession and mediation between God and His people. Psalm 110:4 relates to Christ as the eternal priest-king."
    },
    {
      "pk": 10008018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 8,
      "verse": 18,
      "text": "Benaiah son of Jehoiada was over the Cherethites and Pelethites; and David’s sons were priests.",
      "links": "<a href='/AIV/13/18/17'>1 Chr 18:17</a>; <a href='/AIV/19/132/11'>Ps. 132:11</a>",
      "comment": "David’s sons serving as priests suggests a royal priesthood, linking kingship and priesthood, later echoed in Christ as both King and High Priest. The presence of trusted guardians (Cherethites and Pelethites) points to the enduring protection and leadership within God’s people."
    }
  ],
  "translatedAt": "2025-12-24T03:15:20.667Z"
}