{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 15,
  "verses": [
    {
      "pk": 10015001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 1,
      "text": "After this, Absalom prepared for himself a chariot and horses, and fifty men to run before him.",
      "links": "<a href='/AIV/11/1/5'>1 Kings 1:5</a>",
      "comment": "Absalom's actions here suggest ambition and a desire to display royal authority, hinting at his future attempt to take the throne."
    },
    {
      "pk": 10015002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 2,
      "text": "Absalom would get up early and stand beside the road leading to the city gate. Whenever anyone had a dispute to bring before the king for judgment, Absalom would call out to him, asking, 'From what city are you?' When he responded, 'Your servant is from one of the tribes of Israel,'",
      "links": "<a href='/AIV/20/31/23'>Prov. 31:23</a>",
      "comment": "Absalom seeks to gain the people's favor by positioning himself as approachable, a theme seen later where Christ, the true King, became accessible to all <a href='/AIV/40/11/28'>Matt. 11:28</a>."
    },
    {
      "pk": 10015003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 3,
      "text": "Absalom would say, 'Look, your claims are right and good; but there is no one appointed by the king to hear you.'",
      "links": "<a href='/AIV/19/12/1-2'>Ps. 12:1-2</a>",
      "comment": "He subtly undermines his father's rule, drawing attention to what he claims are failings in David's justice."
    },
    {
      "pk": 10015004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 4,
      "text": "Absalom would add, 'Oh, that I were appointed judge in the land! Then everyone with a dispute or complaint could come to me, and I would give him justice.'",
      "links": "<a href='/AIV/07/8/22-23'>Judg. 8:22-23</a>",
      "comment": "Absalom's ambition to judge all Israel reflects the longing for a good judge, ultimately fulfilled by Christ as the perfect Judge <a href='/AIV/43/5/22'>John 5:22</a>."
    },
    {
      "pk": 10015005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 5,
      "text": "Whenever anyone approached him to bow before him, Absalom would reach out, take hold of him, and kiss him.",
      "links": "<a href='/AIV/18/29/8-11'>Job 29:8-11</a>",
      "comment": "Absalom uses displays of affection to win loyalty, in contrast with Christ, who offers true love and humility (see <a href='/AIV/43/13/5'>John 13:5</a>)."
    },
    {
      "pk": 10015006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 6,
      "text": "Absalom acted in this way toward all the Israelites who came to the king for judgment. So Absalom stole the hearts of the men of Israel.",
      "links": "<a href='/AIV/11/1/6'>1 Kings 1:6</a>",
      "comment": "This verse shows the dangers of charismatic but misguided leadership; Absalom wins popular support against legitimate authority."
    },
    {
      "pk": 10015007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 7,
      "text": "After four years, Absalom said to the king, 'Please let me go to Hebron and fulfill a vow I made to the LORD.'",
      "links": "<a href='/AIV/01/13/18'>Gen. 13:18</a>",
      "comment": "Hebron is a significant location, both as David's first capital and a place of covenant. Absalom uses religious language to mask his intentions."
    },
    {
      "pk": 10015008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 8,
      "text": "For your servant made a vow while I lived at Geshur in Aram, saying, ‘If the LORD really brings me back to Jerusalem, then I will serve the LORD.’",
      "links": "<a href='/AIV/10/13/37-38'>2Sam 13:37-38</a>",
      "comment": "Absalom's alleged piety is put forward as the reason, but his true aim is rebellion."
    },
    {
      "pk": 10015009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 9,
      "text": "The king said to him, 'Go in peace.' So he arose and went to Hebron.",
      "links": "<a href='/AIV/09/1/17'>1 Sam. 1:17</a>",
      "comment": "David gives his blessing, trusting Absalom’s motives. There’s a parallel here with Christ’s disciples sometimes misunderstanding His mission."
    },
    {
      "pk": 10015010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 10,
      "text": "But Absalom sent secret messengers throughout all the tribes of Israel, saying, 'As soon as you hear the sound of the trumpet, then you shall say, ‘Absalom is king at Hebron!’'",
      "links": "<a href='/AIV/11/1/34'>1 Kings 1:34</a>",
      "comment": "Absalom’s conspiracy relies on secrecy and subterfuge, mimicking the way earthly kingdoms rise by power, unlike the Messiah's kingdom (see <a href='/AIV/43/18/36'>John 18:36</a>)."
    },
    {
      "pk": 10015011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 11,
      "text": "Two hundred men from Jerusalem went with Absalom. They had been invited and went innocently, knowing nothing about the matter.",
      "links": "<a href='/AIV/10/13/28'>2Sam 13:28</a>",
      "comment": "These unwitting supporters symbolize the dangers of being led astray without discernment—a recurring theme later in the New Testament (see <a href='/AIV/45/16/18'>Rom. 16:18</a>)."
    },
    {
      "pk": 10015012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 12,
      "text": "While Absalom was offering sacrifices, he sent for Ahithophel the Gilonite, David’s counselor, from his city Giloh. The conspiracy grew strong, and the people with Absalom kept increasing.",
      "links": "<a href='/AIV/10/16/23'>2Sam 16:23</a>",
      "comment": "Ahithophel’s role as counselor prefigures the betrayals seen in Jesus’ life (see <a href='/AIV/19/41/9'>Ps. 41:9</a>, <a href='/AIV/43/13/18'>John 13:18</a>)."
    },
    {
      "pk": 10015013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 13,
      "text": "A messenger came to David, saying, 'The hearts of the men of Israel have gone after Absalom.'",
      "links": "<a href='/AIV/10/19/14'>2Sam 19:14</a>",
      "comment": "David finds himself rejected by his own, prefiguring the rejection of Christ by His people (<a href='/AIV/19/118/22'>Ps. 118:22</a>, <a href='/AIV/41/12/10'>Mark 12:10</a>)."
    },
    {
      "pk": 10015014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 14,
      "text": "David said to all his servants who were with him in Jerusalem, 'Get up! Let us flee, or none of us will escape from Absalom. Hurry, or he will overtake us quickly, bring disaster upon us, and strike the city with the sword.'",
      "links": "<a href='/AIV/10/19/9'>2Sam 19:9</a>",
      "comment": "David’s decision to flee shows both prudence and reliance on God, trusting His will, a theme throughout Scripture."
    },
    {
      "pk": 10015015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 15,
      "text": "The king’s servants said to the king, 'Whatever my lord the king decides, we are your servants.'",
      "links": "<a href='/AIV/08/1/16'>Ruth 1:16</a>",
      "comment": "Their loyalty highlights the call to serve God’s chosen leader, foreshadowing the Church’s unity under its shepherds (<a href='/AIV/41/3/14'>Mark 3:14</a>)."
    },
    {
      "pk": 10015016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 16,
      "text": "So the king went out, with all his household after him. But the king left ten concubines behind to keep the house.",
      "links": "<a href='/AIV/10/16/21-22'>2Sam 16:21-22</a>",
      "comment": "The concubines’ fate later becomes part of Absalom’s attempt to claim power, symbolizing complete usurpation of David’s kingship."
    },
    {
      "pk": 10015017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 17,
      "text": "So the king went out, and all the people after him. They paused at the last house.",
      "links": "<a href='/AIV/01/45/1'>Gen. 45:1</a>",
      "comment": "The last house marks David’s departure from Jerusalem, foreshadowing exile and return, reminiscent of Jesus leaving the city to pray (see <a href='/AIV/42/22/39'>Luke 22:39</a>)."
    },
    {
      "pk": 10015018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 18,
      "text": "All his servants passed by him; the Cherethites, the Pelethites, and all the Gittites—six hundred men who had followed him from Gath—passed before the king.",
      "links": "<a href='/AIV/10/8/18'>2Sam 8:18</a>",
      "comment": "David’s army includes foreign followers, emphasizing unity among God’s people, a foreshadowing of the Gentiles’ inclusion in the covenant."
    },
    {
      "pk": 10015019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 19,
      "text": "Then the king said to Ittai the Gittite, 'Why should you also go with us? Go back and stay with the king, for you are a foreigner and also an exile from your own land.'",
      "links": "<a href='/AIV/10/18/2'>2Sam 18:2</a>",
      "comment": "David’s openness to outsiders reveals a deeper mystery later fulfilled in the Church’s universal outreach."
    },
    {
      "pk": 10015020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 20,
      "text": "You came only yesterday, and shall I today make you wander about with us, while I go where I may? Go back and take your brothers with you, and may mercy and faithfulness be with you.'",
      "links": "<a href='/AIV/10/8/18'>2Sam 8:18</a>",
      "comment": "David blesses Ittai, modeling the leader who cares for his followers—pointing to the Good Shepherd, Christ (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 10015021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 21,
      "text": "But Ittai answered the king, 'As the LORD lives, and as my lord the king lives, wherever my lord the king shall be, whether for death or for life, there also will your servant be.'",
      "links": "<a href='/AIV/08/1/16-17'>Ruth 1:16-17</a>",
      "comment": "Ittai’s loyalty echoes Ruth’s pledge; such faithfulness is emblematic of discipleship."
    },
    {
      "pk": 10015022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 22,
      "text": "David said to Ittai, 'Go and cross over.' So Ittai the Gittite and all his men and all the little ones who were with him crossed over.",
      "links": "<a href='/AIV/02/12/37-38'>Exod. 12:37-38</a>",
      "comment": "Infants are included in the group, showing that the community of the faithful encompasses all ages—a principle underlying the sacramental life of the Church."
    },
    {
      "pk": 10015023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 23,
      "text": "All the land wept with a loud voice as all the people passed by. The king crossed the brook Kidron, and all the people crossed toward the way of the wilderness.",
      "links": "<a href='/AIV/43/18/1'>John 18:1</a>",
      "comment": "The Kidron crossing is significant; centuries later, Christ crosses Kidron before His Passion, fulfilling and deepening this archetype."
    },
    {
      "pk": 10015024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 24,
      "text": "And Zadok came also, and all the Levites with him, carrying the ark of the covenant of God. They set down the ark of God, and Abiathar went up until all the people had finished passing out of the city.",
      "links": "<a href='/AIV/10/6/17'>2Sam 6:17</a>",
      "comment": "The ark’s presence highlights God’s leadership, prefiguring the perpetual guidance of God’s Holy Spirit among the faithful."
    },
    {
      "pk": 10015025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 25,
      "text": "Then the king said to Zadok, 'Carry the ark of God back into the city. If I find favor in the LORD’s eyes, He will bring me back and let me see both it and His dwelling place.'",
      "links": "<a href='/AIV/19/84/1-2'>Ps. 84:1-2</a>",
      "comment": "David entrusts his fate to the Lord, a Christ-like submission to the Father’s will (see <a href='/AIV/42/22/42'>Luke 22:42</a>)."
    },
    {
      "pk": 10015026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 26,
      "text": "But if He says, ‘I am not pleased with you,’ then here I am—let Him do to me as seems good to Him.'",
      "links": "<a href='/AIV/09/3/18'>1 Sam. 3:18</a>",
      "comment": "David’s acceptance echoes the perfect obedience of Christ at Gethsemane and saints who submit to God’s will."
    },
    {
      "pk": 10015027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 27,
      "text": "The king also said to Zadok the priest, 'Are you not a seer? Return to the city in peace, you and your two sons with you, Ahimaaz your son, and Jonathan the son of Abiathar.'",
      "links": "<a href='/AIV/10/8/17'>2Sam 8:17</a>",
      "comment": "The priests return with the ark, showing the importance of continuing worship even in times of trial—a foundational principle for believers."
    },
    {
      "pk": 10015028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 28,
      "text": "See, I will wait at the fords of the wilderness until word comes from you to inform me.'",
      "links": "<a href='/AIV/06/2/1-3'>Josh. 2:1-3</a>",
      "comment": "David trusts in the Lord’s providence, but acts prudently, demonstrating the harmony of faith and reason."
    },
    {
      "pk": 10015029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 29,
      "text": "So Zadok and Abiathar carried the ark of God back to Jerusalem, and they remained there.",
      "links": "<a href='/AIV/10/19/11'>2Sam 19:11</a>",
      "comment": "This obedience helps maintain peace and continued worship in the holy city."
    },
    {
      "pk": 10015030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 30,
      "text": "But David went up the ascent of the Mount of Olives, weeping as he went, with his head covered and barefoot. All the people with him covered their heads, and they went up, weeping as they went.",
      "links": "<a href='/AIV/42/19/37-41'>Luke 19:37-41</a>",
      "comment": "This journey over the Mount of Olives parallels Christ’s own Passion; both endure rejection and suffering outside Jerusalem."
    },
    {
      "pk": 10015031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 31,
      "text": "Someone told David, 'Ahithophel is among the conspirators with Absalom.' And David said, 'O LORD, please turn the counsel of Ahithophel into foolishness.'",
      "links": "<a href='/AIV/19/3/1-2'>Ps. 3:1-2</a>",
      "comment": "David turns to prayer in adversity, prefiguring Jesus’ prayers in the garden before betrayal."
    },
    {
      "pk": 10015032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 32,
      "text": "While David was coming to the summit, where he worshiped God, behold, Hushai the Archite came to meet him, with his coat torn and dirt on his head.",
      "links": "<a href='/AIV/10/17/5-14'>2Sam 17:5-14</a>",
      "comment": "Worship during tribulation and the solidarity of friends are shown here, a template for perseverance in faith."
    },
    {
      "pk": 10015033,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 33,
      "text": "David said to him, 'If you go on with me, you will be a burden to me.'",
      "links": "<a href='/AIV/02/17/12'>Exod. 17:12</a>",
      "comment": "Sometimes the wise counsel is more valuable in the palace than alongside the exiled king; discernment of vocation is key."
    },
    {
      "pk": 10015034,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 34,
      "text": "'But if you return to the city and say to Absalom, “I will be your servant, O king; as I have been your father’s servant in time past, so now I will be your servant,” then you can defeat the counsel of Ahithophel for me.'",
      "links": "<a href='/AIV/10/17/7-14'>2Sam 17:7-14</a>",
      "comment": "God's providence sometimes works through human cleverness as well as miracles."
    },
    {
      "pk": 10015035,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 35,
      "text": "Do you not have Zadok and Abiathar the priests with you there? Therefore, whatever you hear from the king’s house, you shall tell it to Zadok and Abiathar the priests.",
      "links": "<a href='/AIV/10/8/17'>2Sam 8:17</a>",
      "comment": "David urges the use of established priestly authority for communication—highlighting the role of spiritual leaders in upholding the true king."
    },
    {
      "pk": 10015036,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 36,
      "text": "Behold, they have their two sons with them, Ahimaaz, Zadok’s son, and Jonathan, Abiathar’s son, and through them you shall send to me everything you hear.'",
      "links": "<a href='/AIV/10/17/17'>2Sam 17:17</a>",
      "comment": "The use of trusted messengers preserves the Davidic line, upholding the lineage that will eventually produce the Messiah."
    },
    {
      "pk": 10015037,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 15,
      "verse": 37,
      "text": "So Hushai, David’s friend, came into the city, just as Absalom was entering Jerusalem.",
      "links": "<a href='/AIV/10/16/16-19'>2Sam 16:16-19</a>",
      "comment": "Hushai’s fidelity to David presents the virtue of faithfulness even in times of danger, prefiguring Christ’s loyal disciples."
    }
  ],
  "translatedAt": "2025-12-24T03:19:52.908Z"
}