{
  "book": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 21,
  "verses": [
    {
      "pk": 2142101,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 1,
      "text": "There was a famine during David’s reign for three years, year after year. So David sought the presence of the LORD, and the LORD said, \"It is because of Saul and his bloody house, for he put the Gibeonites to death.\"",
      "links": "<a href='/AIV/6/9/3-27'>Josh. 9:3–27</a>; <a href='/AIV/9/15/2-3'>1 Sam. 15:2–3</a>",
      "comment": "Notes 'bloody house' as literal, referring to Saul’s violent actions against the Gibeonites."
    },
    {
      "pk": 2142102,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 2,
      "text": "So the king called the Gibeonites and spoke to them. (Now the Gibeonites were not Israelites, but a remnant of the Amorites; and the Israelites had sworn to them, but Saul had sought to kill them in his zeal for the people of Israel and Judah.)",
      "links": "<a href='/AIV/6/9/15-17'>Josh. 9:15–17</a>",
      "comment": "Includes explanation in parentheses as found in most manuscripts."
    },
    {
      "pk": 2142103,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 3,
      "text": "David said to the Gibeonites, \"What shall I do for you, and how shall I make atonement, so that you may bless the inheritance of the LORD?\"",
      "links": "<a href='/AIV/4/16/20'>Lev. 16:20</a>; <a href='/AIV/10/20/3'>2 Sam. 20:3</a>",
      "comment": "Keeps language of 'bless the inheritance of the LORD' – i.e. Israel."
    },
    {
      "pk": 2142104,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 4,
      "text": "The Gibeonites said to him, \"It is not a matter of silver or gold between us and Saul or his house; nor is it for us to put any man to death in Israel.\" And he said, \"Whatever you say, I will do for you.\"",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "Maintains the literal meaning: they refuse monetary compensation or broader vengeance."
    },
    {
      "pk": 2142105,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 5,
      "text": "They said to the king, \"The man who consumed us and plotted against us so that we would be destroyed and have no place within the borders of Israel —",
      "links": "<a href='/AIV/6/9/27'>Josh. 9:27</a>",
      "comment": "‘Consumed’ refers to attempted eradication of the Gibeonites."
    },
    {
      "pk": 2142106,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 6,
      "text": "\"let seven of his descendants be given to us, and we will hang them before the LORD at Gibeah of Saul, the chosen of the LORD.\" And the king said, \"I will give them.\"",
      "links": "<a href='/AIV/10/20/1'>2 Sam. 20:1</a>; <a href='/AIV/10/1/1'>1 Sam. 10:24</a>",
      "comment": "‘Hang’ here may refer to impaling or execution; clarified as before the LORD."
    },
    {
      "pk": 2142107,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 7,
      "text": "But the king spared Mephibosheth, the son of Jonathan son of Saul, because of the oath of the LORD between David and Jonathan son of Saul.",
      "links": "<a href='/AIV/9/20/15'>1 Sam. 20:15</a>; <a href='/AIV/10/9/7'>2 Sam. 9:7</a>",
      "comment": "David preserves the covenant with Jonathan."
    },
    {
      "pk": 2142108,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 8,
      "text": "So the king took the two sons of Rizpah daughter of Aiah, whom she bore to Saul, Armoni and Mephibosheth, and the five sons of Merab daughter of Saul, whom she bore to Adriel son of Barzillai the Meholathite.",
      "links": "<a href='/AIV/9/18/19'>1 Sam. 18:19</a>; <a href='/AIV/10/3/7'>2 Sam. 3:7</a>",
      "comment": "Some manuscripts say Michal instead of Merab, but Merab is correct contextually."
    },
    {
      "pk": 2142109,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 9,
      "text": "He gave them into the hands of the Gibeonites, and they hanged them on the mountain before the LORD. Seven of them died together. They were put to death in the first days of harvest, at the beginning of the barley harvest.",
      "links": "<a href='/AIV/3/23/10'>Lev. 23:10</a>; <a href='/AIV/10/6/17'>2 Sam. 6:17</a>",
      "comment": "Barley harvest was in spring, marking the timing of the event."
    },
    {
      "pk": 2142110,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 10,
      "text": "Rizpah daughter of Aiah took sackcloth and spread it for herself on the rock, from the beginning of harvest until rain fell from heaven on them. She did not allow the birds of the sky to come upon them by day or the wild animals by night.",
      "links": "<a href='/AIV/3/21/23'>Lev. 21:23</a>; <a href='/AIV/10/3/7'>2 Sam. 3:7</a>",
      "comment": "Shows mourning and guarding the corpses, indicating delayed burial."
    },
    {
      "pk": 2142111,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 11,
      "text": "When David was told what Rizpah daughter of Aiah, Saul’s concubine, had done,",
      "links": "<a href='/AIV/10/3/7'>2 Sam. 3:7</a>",
      "comment": "Saul’s concubine clarifies her status and relationship."
    },
    {
      "pk": 2142112,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 12,
      "text": "David went and took the bones of Saul and the bones of Jonathan his son from the men of Jabesh-gilead, who had stolen them from the public square of Beth-shan, where the Philistines had hung them, when the Philistines struck down Saul at Gilboa.",
      "links": "<a href='/AIV/9/31/8-13'>1 Sam. 31:8–13</a>",
      "comment": "Careful rendering of the recovery of the bones; 'stolen' as in rescued."
    },
    {
      "pk": 2142113,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 13,
      "text": "He brought up from there the bones of Saul and the bones of Jonathan his son, and they gathered the bones of those who had been hanged.",
      "links": "<a href='/AIV/9/31/13'>1 Sam. 31:13</a>",
      "comment": "Brings together remains for a formal burial."
    },
    {
      "pk": 2142114,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 14,
      "text": "They buried the bones of Saul and Jonathan his son in the land of Benjamin in Zela, in the tomb of Kish his father. They did all that the king commanded. After that, God heeded the prayers for the land.",
      "links": "<a href='/AIV/9/9/1'>1 Sam. 9:1</a>; <a href='/AIV/10/17/22'>2 Sam. 17:22</a>",
      "comment": "‘God heeded’ uses literal sense of answered prayer and ended famine."
    },
    {
      "pk": 2142115,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 15,
      "text": "Again there was war between the Philistines and Israel. David went down with his servants, and they fought against the Philistines. And David grew weary.",
      "links": "<a href='/AIV/10/5/17-25'>2 Sam. 5:17–25</a>",
      "comment": "‘Grew weary’—David’s aging is noted, fitting original phrasing."
    },
    {
      "pk": 2142116,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 16,
      "text": "And Ishbi-benob, one of the descendants of the giants, whose spear weighed three hundred shekels of bronze, and who was armed with a new sword, intended to kill David.",
      "links": "<a href='/AIV/13/20/4'>1 Chron. 20:4</a>",
      "comment": "‘Descendants of the giants’ translated from 'Rapha'; maintains literal sense."
    },
    {
      "pk": 2142117,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 17,
      "text": "But Abishai son of Zeruiah came to David’s aid and struck the Philistine and killed him. Then David’s men swore to him, \"You shall never go out with us to battle again, so that the lamp of Israel may not be quenched.\"",
      "links": "<a href='/AIV/10/19/21'>2 Sam. 19:21</a>",
      "comment": "‘Lamp of Israel’—idiom maintained, refers to David as Israel's leader/light."
    },
    {
      "pk": 2142118,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 18,
      "text": "After this, there was once again war with the Philistines at Gob. Then Sibbecai the Hushathite killed Saph, one of the descendants of the giants.",
      "links": "<a href='/AIV/13/20/4'>1 Chron. 20:4</a>",
      "comment": "Hushathite specifies Sibbecai’s family; Saph aligns with parallel in Chronicles."
    },
    {
      "pk": 2142119,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 19,
      "text": "Again there was war with the Philistines at Gob, and Elhanan son of Jaare-oregim the Bethlehemite killed Goliath the Gittite, whose spear shaft was like a weaver’s beam.",
      "links": "<a href='/AIV/9/17/7'>1 Sam. 17:7</a>; <a href='/AIV/13/20/5'>1 Chron. 20:5</a>",
      "comment": "Chronicles clarifies that Elhanan killed Lahmi, brother of Goliath; here the original lists Goliath."
    },
    {
      "pk": 2142120,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 20,
      "text": "And there was war at Gath, where there was a man of great stature who had six fingers on each hand and six toes on each foot, twenty-four in total. He also was descended from the giants.",
      "links": "<a href='/AIV/13/20/6'>1 Chron. 20:6</a>",
      "comment": "Physical description aligns with original Hebrew."
    },
    {
      "pk": 2142121,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 21,
      "text": "When he taunted Israel, Jonathan son of Shimei, David’s brother, killed him.",
      "links": "<a href='/AIV/13/20/7'>1 Chron. 20:7</a>",
      "comment": "Maintains the literal, direct phrasing."
    },
    {
      "pk": 2142122,
      "translation": "AIV",
      "book": 10,
      "chapter": 21,
      "verse": 22,
      "text": "These four were descended from the giants in Gath, and they fell by the hand of David and by the hand of his servants.",
      "links": "<a href='/AIV/13/20/8'>1 Chron. 20:8</a>",
      "comment": "Summary statement mirrors Hebrew structure."
    }
  ],
  "translatedAt": "2025-12-22T09:45:36.763Z"
}