{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 14,
  "verses": [
    {
      "pk": 10014001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 1,
      "text": "Now Joab son of Zeruiah perceived that the king’s heart longed for Absalom.",
      "links": "<a href='/AIV/10/13/39'>2Sam 13:39</a>",
      "comment": "Joab, David’s military commander, noticed David’s deep yearning for his estranged son Absalom. This sets the groundwork for reconciliation, which foreshadows the role of intermediaries in reconciling people with God."
    },
    {
      "pk": 10014002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 2,
      "text": "So Joab sent to Tekoa and brought a wise woman from there. He said to her, 'Please, pretend to be a mourner. Put on mourning clothes, and do not anoint yourself with oil, but act like a woman who has been grieving for the dead for many days.'",
      "links": "<a href='/AIV/10/12/1'>2Sam 12:1</a>",
      "comment": "Joab’s use of a wise woman is parallel to the prophet Nathan’s approach to David in 2Sam 12:1. Sometimes God uses stories and intermediaries to move hard hearts toward mercy."
    },
    {
      "pk": 10014003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 3,
      "text": "'Go to the king and speak these words to him.' And Joab put the words into her mouth.",
      "links": "",
      "comment": "Joab orchestrates the encounter, highlighting the guidance of authority figures in spiritual matters. The necessity of spoken wisdom and mediation is evident."
    },
    {
      "pk": 10014004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 4,
      "text": "When the woman of Tekoa spoke to the king, she fell on her face to the ground and did obeisance, and said, 'Help, O king!'",
      "links": "<a href='/AIV/11/3/16'>1Kings 3:16</a>",
      "comment": "Her humility in approaching King David mirrors how the faithful approach God—reverence and humble petitioning. Compare Solomon’s wisdom and the story of the two women in 1Kings 3:16."
    },
    {
      "pk": 10014005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 5,
      "text": "The king asked her, 'What troubles you?' She answered, 'Alas, I am a widow; my husband is dead.'",
      "links": "<a href='/AIV/42/18/1-8'>Luke 18:1-8</a>",
      "comment": "David’s inquiry opens the door for an appeal to mercy, foreshadowing the parable of the persistent widow in Luke 18."
    },
    {
      "pk": 10014006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 6,
      "text": "'Your servant had two sons. They fought together in the field, and there was no one to part them. One struck the other and killed him.'",
      "links": "<a href='/AIV/01/04/8'>Gen 4:8</a>",
      "comment": "Her story echoes that of Cain and Abel (Gen 4:8). The theme of family violence and need for mercy is recurring in Scripture."
    },
    {
      "pk": 10014007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 7,
      "text": "'Now the whole clan has risen against your servant, saying, “Hand over the one who struck his brother, so that we may put him to death for the life of his brother, whom he killed; and so they would destroy the heir also.” Thus they would quench the last ember I have, leaving my husband neither name nor remnant on the earth.'",
      "links": "<a href='/AIV/05/25/6'>Deut 25:6</a>, <a href='/AIV/09/24/21'>1Sam 24:21</a>",
      "comment": "Preserving a ‘name’ and ‘remnant’ is a crucial biblical theme, connecting to laws in Deut 25:6 and promises to David (2Sam 7:12)."
    },
    {
      "pk": 10014008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 8,
      "text": "Then the king said to the woman, 'Go to your house, and I will give orders concerning you.'",
      "links": "",
      "comment": "David acts as judge and mediator, a type and foreshadowing of Christ as the just and merciful judge."
    },
    {
      "pk": 10014009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 9,
      "text": "The woman of Tekoa said to the king, 'My lord the king, let the guilt be on me and on my father’s house; but the king and his throne be guiltless.'",
      "links": "<a href='/AIV/01/44/33'>Gen 44:33</a>",
      "comment": "Taking guilt upon oneself echoes intercession, modeling substitutionary dynamics and priestly mediation (see Gen 44:33, Judah for Benjamin)."
    },
    {
      "pk": 10014010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 10,
      "text": "The king said, 'If anyone says anything to you, bring him to me, and he will never bother you again.'",
      "links": "<a href='/AIV/23/54/17'>Isa 54:17</a>",
      "comment": "The king’s word is final. David’s authority is an image of the ultimate authority given by God’s anointed (a hint towards the Church’s teaching authority, see Matt 16:19)."
    },
    {
      "pk": 10014011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 11,
      "text": "Then she said, 'Please, let the king remember the LORD your God, so that the avenger of blood may not destroy any more, lest they destroy my son.' He said, 'As the LORD lives, not one hair of your son shall fall to the ground.'",
      "links": "<a href='/AIV/09/14/45'>1Sam 14:45</a>, <a href='/AIV/42/21/18'>Luke 21:18</a>",
      "comment": "David swears by God, invoking the sacredness of an oath. 'Not one hair...' foreshadows Jesus’ assurance in Luke 21:18."
    },
    {
      "pk": 10014012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 12,
      "text": "Then the woman said, 'Please let your servant speak a word to my lord the king.' He said, 'Speak.'",
      "links": "",
      "comment": "Her request shows respectful boldness before the king, paralleling faithful confidence before God (Heb 4:16)."
    },
    {
      "pk": 10014013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 13,
      "text": "The woman said, 'Why then have you planned such a thing against the people of God? For in giving this judgment, the king convicts himself, in that the king does not bring back his own banished one.'",
      "links": "<a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "She gently rebukes David, paralleling the parable of the prodigal son (Luke 15), where mercy to the banished is central."
    },
    {
      "pk": 10014014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 14,
      "text": "'For we must all die; we are like water spilled on the ground, which cannot be gathered up again. Yet God does not take away life; instead, He devises plans so that the banished may not remain an outcast from Him.'",
      "links": "<a href='/AIV/10/12/13'>2Sam 12:13</a>, <a href='/AIV/42/19/10'>Luke 19:10</a>",
      "comment": "God’s mercy and plan for reconciliation is a profound biblical truth, fulfilled most fully in Christ, who seeks and saves the lost (Luke 19:10). This underpins the sacramental grace of reconciliation."
    },
    {
      "pk": 10014015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 15,
      "text": "'Now, I have come to speak of this matter to my lord the king because the people have made me afraid. Your servant thought, “I will speak to the king; it may be that the king will perform the request of his servant.”'",
      "links": "",
      "comment": "Fear of others compels appeals to the king’s mercy, just as the faithful turn to divine help in need."
    },
    {
      "pk": 10014016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 16,
      "text": "'For the king will hear and deliver his servant from the hand of the man who would destroy me and my son together from God's inheritance.’",
      "links": "",
      "comment": "David is seen as a deliverer of God’s heritage; in Christ, believers find the ultimate deliverer."
    },
    {
      "pk": 10014017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 17,
      "text": "'And your servant thought, “The word of my lord the king will bring rest, for my lord the king is like the angel of God to discern good and evil. May the LORD your God be with you!”'",
      "links": "<a href='/AIV/09/29/9'>1Sam 29:9</a>",
      "comment": "David is compared to an angel of God, who brings discernment and peace—roles fulfilled ultimately in the Messiah (cf. Isa 9:6)."
    },
    {
      "pk": 10014018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 18,
      "text": "Then the king answered and said to the woman, 'Please do not hide anything from me that I am about to ask you.' The woman said, 'Let my lord the king speak.'",
      "links": "",
      "comment": "Inquiry and transparency before the king reflect the call to honesty before God."
    },
    {
      "pk": 10014019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 19,
      "text": "The king said, 'Is the hand of Joab with you in all this?' The woman answered, 'As surely as you live, my lord the king, no one can turn to the right or left from anything my lord the king has said. Yes, your servant Joab commanded me, and he put all these words in the mouth of your servant.’",
      "links": "",
      "comment": "David’s discernment uncovers Joab’s involvement, highlighting the wisdom required of those in authority."
    },
    {
      "pk": 10014020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 20,
      "text": "'In order to change the appearance of things, Joab your servant has done this thing. But my lord is wise, with the wisdom of an angel of God to know all things that are on the earth.'",
      "links": "<a href='/AIV/10/14/17'>2Sam 14:17</a>",
      "comment": "The ‘wisdom of an angel’ motif is repeated, foreshadowing the divinely guided apostolic wisdom given to Church leaders."
    },
    {
      "pk": 10014021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 21,
      "text": "The king said to Joab, 'Very well, I grant this request. Go, bring back the young man Absalom.'",
      "links": "",
      "comment": "David grants pardon and restoration, modeling forgiveness and reconciliation—key aspects in the sacramental life."
    },
    {
      "pk": 10014022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 22,
      "text": "Joab fell on his face to the ground, and blessed the king. Joab said, 'Today your servant knows that I have found favor in your eyes, my lord the king, because the king has granted the request of his servant.'",
      "links": "",
      "comment": "Finding favor harkens to the concepts of grace and favor found throughout Scripture (see Luke 1:28, Mary ‘full of grace’)."
    },
    {
      "pk": 10014023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 23,
      "text": "So Joab arose and went to Geshur and brought Absalom back to Jerusalem.",
      "links": "<a href='/AIV/10/13/37'>2Sam 13:37</a>",
      "comment": "Absalom’s exile and return prefigures the exiled sinner’s return to the family of God."
    },
    {
      "pk": 10014024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 24,
      "text": "But the king said, 'Let him return to his own house, but let him not see my face.' So Absalom returned to his own house, but he did not see the king’s face.",
      "links": "<a href='/AIV/03/22/3'>Lev 22:3</a>",
      "comment": "Despite return, Absalom remains separated—demonstrating that reconciliation is a process, not fully realized until full communion and restoration."
    },
    {
      "pk": 10014025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 25,
      "text": "Now in all Israel there was no one so highly praised for his appearance as Absalom, from the sole of his foot to the crown of his head there was no blemish in him.",
      "links": "<a href='/AIV/09/09/2'>1Sam 9:2</a>",
      "comment": "Absalom’s physical perfection draws a connection to Saul and models ‘outward appearances’—a warning that spiritual beauty should outweigh the exterior."
    },
    {
      "pk": 10014026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 26,
      "text": "When he cut his hair—he cut it at the end of every year, because it became too heavy for him—the weight of the hair of his head was two hundred shekels by the royal standard.",
      "links": "",
      "comment": "Absalom’s symbolic hair will play a role in his downfall (2Sam 18:9), a reminder that pride precedes a fall."
    },
    {
      "pk": 10014027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 27,
      "text": "Three sons were born to Absalom, and one daughter whose name was Tamar. She was a beautiful woman.",
      "links": "<a href='/AIV/10/13/1'>2Sam 13:1</a>",
      "comment": "The naming and beauty of Absalom’s daughter Tamar recalls Absalom’s sister, and by extension, cycles of sin and tragedy in David’s house."
    },
    {
      "pk": 10014028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 28,
      "text": "Absalom dwelt two full years in Jerusalem without seeing the king’s face.",
      "links": "",
      "comment": "A sign that outward participation in the community does not always equal full reconciliation or communion with authority."
    },
    {
      "pk": 10014029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 29,
      "text": "Then Absalom sent for Joab, to send him to the king, but Joab would not come to him. And he sent again a second time, but he would not come.",
      "links": "",
      "comment": "Even intermediaries can hesitate—persistent seeking is needed for reconciliation (cf. Matt 7:7, 'Ask, and it will be given')."
    },
    {
      "pk": 10014030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 30,
      "text": "So he said to his servants, 'See, Joab’s field is next to mine, and he has barley there; go and set it on fire.' So Absalom’s servants set the field on fire.",
      "links": "<a href='/AIV/07/15/5'>Judg 15:5</a>",
      "comment": "Absalom’s extreme measure recalls Samson’s burning of the fields (Judges 15:5). Forceful action sometimes follows when gentle appeals fail."
    },
    {
      "pk": 10014031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 31,
      "text": "Then Joab arose, came to Absalom at his house, and said to him, 'Why have your servants set my field on fire?'",
      "links": "",
      "comment": "Direct confrontation leads to action and dialogue—a principle in conflict resolution and reconciliation."
    },
    {
      "pk": 10014032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 32,
      "text": "Absalom answered Joab, 'Look, I sent word to you, saying, “Come here, so I may send you to the king, to ask, ‘Why have I come from Geshur? It would be better for me to be there still.’” Now therefore, let me see the king’s face; and if there is guilt in me, let him put me to death.'",
      "links": "<a href='/AIV/01/44/33'>Gen 44:33</a>",
      "comment": "Absalom seeks either full restoration or judgment, willing to accept the consequences. This foreshadows the existential choice of standing before the judge in humility."
    },
    {
      "pk": 10014033,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 14,
      "verse": 33,
      "text": "So Joab went to the king and told him. Then he called for Absalom, and he came to the king and bowed himself on his face to the ground before the king. Then the king kissed Absalom.",
      "links": "<a href='/AIV/01/33/4'>Gen 33:4</a>, <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "The king’s kiss is the sign of full restoration, echoing Jacob and Esau’s reconciliation and the prodigal son (Luke 15:20). It foreshadows the peace and restoration God wishes to grant all His children through mercy and sacramental reconciliation."
    }
  ],
  "translatedAt": "2025-12-24T03:18:57.371Z"
}