{
  "book": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 9,
  "verses": [
    {
      "pk": 20909001,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 1,
      "text": "And David said, “Is there still anyone left from the house of Saul, to whom I may show kindness for Jonathan’s sake?”",
      "links": "<a href='/AIV/9/20/15'>1 Sam. 20:15</a>; <a href='/AIV/10/21/7'>2 Sam. 21:7</a>",
      "comment": "David remembers his covenant with Jonathan (see 1 Sam. 20:15)."
    },
    {
      "pk": 20909002,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 2,
      "text": "Now there was a servant from the house of Saul whose name was Ziba. And they called him to David. The king said to him, “Are you Ziba?” And he said, “I am your servant.”",
      "links": "<a href='/AIV/10/16/1'>2 Sam. 16:1</a>",
      "comment": "Ziba becomes an important character later (2 Sam. 16:1)."
    },
    {
      "pk": 20909003,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 3,
      "text": "And the king said, “Is there not still someone from the house of Saul, to whom I may show the kindness of God?” And Ziba said to the king, “There is still a son of Jonathan; he is crippled in his feet.”",
      "links": "<a href='/AIV/10/4/4'>2 Sam. 4:4</a>",
      "comment": "Refers back to 2 Sam. 4:4, where Mephibosheth’s disability is mentioned."
    },
    {
      "pk": 20909004,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 4,
      "text": "And the king said to him, “Where is he?” And Ziba said to the king, “He is in the house of Machir the son of Ammiel, at Lo-debar.”",
      "links": "<a href='/AIV/10/17/27'>2 Sam. 17:27</a>",
      "comment": "Lo-debar is a region east of the Jordan. Machir later helps David (2 Sam. 17:27)."
    },
    {
      "pk": 20909005,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 5,
      "text": "Then King David sent and brought him from the house of Machir son of Ammiel, at Lo-debar.",
      "links": "<a href='/AIV/10/9/4'>v. 4</a>",
      "comment": "This repeats details to emphasize the action."
    },
    {
      "pk": 20909006,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 6,
      "text": "And Mephibosheth, the son of Jonathan, the son of Saul, came to David and fell on his face and prostrated himself. And David said, “Mephibosheth.” And he answered, “Behold, I am your servant.”",
      "links": "<a href='/AIV/10/4/4'>2 Sam. 4:4</a>",
      "comment": "Falling on his face and bowing is a sign of respect and submission."
    },
    {
      "pk": 20909007,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 7,
      "text": "And David said to him, “Do not be afraid, for I will surely show you kindness for the sake of your father Jonathan, and I will restore to you all the land of Saul your father, and you shall eat at my table always.”",
      "links": "<a href='/AIV/9/20/15'>1 Sam. 20:15</a>; <a href='/AIV/10/19/28'>2 Sam. 19:28</a>",
      "comment": "David promises both land and a permanent place at his royal table."
    },
    {
      "pk": 20909008,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 8,
      "text": "And he bowed low and said, “What is your servant, that you should show regard for a dead dog such as I?”",
      "links": "<a href='/AIV/9/24/14'>1 Sam. 24:14</a>; <a href='/AIV/10/16/9'>2 Sam. 16:9</a>",
      "comment": "Calling oneself a ‘dead dog’ is an expression of extreme humility and worthlessness."
    },
    {
      "pk": 20909009,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 9,
      "text": "Then the king called Ziba, Saul’s servant, and said to him, “All that belonged to Saul and to all his house I have given to your master’s grandson.",
      "links": "<a href='/AIV/10/9/7'>v. 7</a>",
      "comment": "Here, 'master’s grandson' refers to Mephibosheth."
    },
    {
      "pk": 20909010,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 10,
      "text": "And you and your sons and your servants shall cultivate the land for him, and shall bring in its produce, that your master’s grandson may have food to eat. But Mephibosheth your master’s grandson shall always eat at my table.” Now Ziba had fifteen sons and twenty servants.",
      "links": "<a href='/AIV/10/9/11'>v. 11</a>",
      "comment": "David arranges for Ziba’s large household to serve Mephibosheth."
    },
    {
      "pk": 20909011,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 11,
      "text": "And Ziba said to the king, “According to all that my lord the king commands his servant, so will your servant do.” So Mephibosheth ate at David’s table, like one of the king’s sons.",
      "links": "<a href='/AIV/10/9/7'>v. 7</a>",
      "comment": "David treats Mephibosheth like royal family."
    },
    {
      "pk": 20909012,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 12,
      "text": "And Mephibosheth had a young son, whose name was Mica. And all that lived in the house of Ziba were servants to Mephibosheth.",
      "links": "<a href='/AIV/1/8/34'>1 Chr. 8:34</a>",
      "comment": "1 Chronicles 8:34 lists the genealogy of Mephibosheth’s descendants."
    },
    {
      "pk": 20909013,
      "translation": "AIV",
      "book": 10,
      "chapter": 9,
      "verse": 13,
      "text": "So Mephibosheth lived in Jerusalem, for he always ate at the king’s table. Now he was lame in both his feet.",
      "links": "<a href='/AIV/10/9/3'>v. 3</a>; <a href='/AIV/10/4/4'>2 Sam. 4:4</a>",
      "comment": "The chapter closes by repeating Mephibosheth’s condition, underlining his dependence and David’s mercy."
    }
  ],
  "translatedAt": "2025-12-22T09:37:31.808Z"
}