{
  "book": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 24,
  "verses": [
    {
      "pk": 1932450,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 1,
      "text": "Again the anger of the LORD was kindled against Israel, and he incited David against them, saying, “Go, count Israel and Judah.”",
      "links": "<a href='/AIV/13/21/1'>1 Chron. 21:1</a>; <a href='/AIV/19/106/29'>Ps. 106:29</a>",
      "comment": "The parallel in 1 Chronicles 21:1 says Satan incited David, whereas here it says the LORD. This reflects a significant difference in perspective between the texts."
    },
    {
      "pk": 1932451,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 2,
      "text": "So the king said to Joab the commander of the army who was with him, “Go through all the tribes of Israel, from Dan to Beersheba, and count the people, so I may know the number of the people.”",
      "links": "<a href='/AIV/07/20/1'>Judg. 20:1</a>; <a href='/AIV/09/3/20'>1 Sam. 3:20</a>",
      "comment": "‘Dan to Beersheba’ is a traditional way of expressing all Israel, north to south."
    },
    {
      "pk": 1932452,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 3,
      "text": "But Joab said to the king, “May the LORD your God add to the people a hundred times as many as they are, and may the eyes of my lord the king see it. But why does my lord the king desire this thing?”",
      "links": "<a href='/AIV/09/14/29'>1 Sam. 14:29</a>; <a href='/AIV/10/18/4'>2 Sam. 18:4</a>",
      "comment": "Joab questions the king’s motive, similar to the chronicler’s account."
    },
    {
      "pk": 1932453,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 4,
      "text": "But the king’s word prevailed against Joab and the commanders of the army. So Joab and the commanders of the army went out from the presence of the king to count the people of Israel.",
      "links": "<a href='/AIV/10/18/2'>2 Sam. 18:2</a>",
      "comment": "David’s insistence overrides Joab’s objection."
    },
    {
      "pk": 1932454,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 5,
      "text": "They crossed the Jordan and began at Aroer, and went through the city in the middle of the valley toward Gad and then to Jazer.",
      "links": "<a href='/AIV/04/32/1'>Num. 32:1</a>; <a href='/AIV/06/13/25'>Josh. 13:25</a>",
      "comment": "Aroer, Gad, and Jazer are locations east of the Jordan River."
    },
    {
      "pk": 1932455,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 6,
      "text": "Then they went to Gilead and to the land of Tahtim-hodshi. They came to Dan-jaan and went around to Sidon.",
      "links": "<a href='/AIV/07/18/29'>Judg. 18:29</a>",
      "comment": "Some of these place names are uncertain; modern locations are not clear."
    },
    {
      "pk": 1932456,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 7,
      "text": "They came to the fortress of Tyre and to all the cities of the Hivites and Canaanites, and finally ended at Beersheba in the Negev of Judah.",
      "links": "<a href='/AIV/01/10/15'>Gen. 10:15</a>; <a href='/AIV/10/3/10'>2 Sam. 3:10</a>",
      "comment": "The tour covers much of the territory associated with Israel and Judah."
    },
    {
      "pk": 1932457,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 8,
      "text": "They traveled through all the land, and after nine months and twenty days, they returned to Jerusalem.",
      "links": "<a href='/AIV/10/15/37'>2 Sam. 15:37</a>",
      "comment": "The census took over nine months."
    },
    {
      "pk": 1932458,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 9,
      "text": "Joab gave the total number of the people to the king: In Israel there were eight hundred thousand men who could handle a sword, and in Judah five hundred thousand.",
      "links": "<a href='/AIV/13/21/5'>1 Chron. 21:5</a>",
      "comment": "Numbers differ slightly in Chronicles. Here: 800,000 Israel, 500,000 Judah."
    },
    {
      "pk": 1932459,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 10,
      "text": "But David’s heart struck him after he had counted the people. David said to the LORD, “I have sinned greatly by doing this. Now, LORD, please take away the guilt of your servant, for I have acted very foolishly.”",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "David admits his guilt after the census is completed."
    },
    {
      "pk": 1932460,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 11,
      "text": "When David got up in the morning, the word of the LORD came to the prophet Gad, David’s seer:",
      "links": "<a href='/AIV/10/22/5'>2 Sam. 22:5</a>; <a href='/AIV/13/21/9'>1 Chron. 21:9</a>",
      "comment": "Gad is called David’s personal prophet (seer)."
    },
    {
      "pk": 1932461,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 12,
      "text": "\"Go and tell David: ‘This is what the LORD says: I am offering you three choices. Choose one of them, and I will do it to you.’\"",
      "links": "<a href='/AIV/13/21/10'>1 Chron. 21:10</a>",
      "comment": "God offers David a choice of discipline."
    },
    {
      "pk": 1932462,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 13,
      "text": "So Gad came to David and said, “Shall three years of famine come to you in your land? Or will you flee from your enemies for three months while they pursue you? Or shall there be three days of plague in your land? Now think and decide what answer I should bring back to the one who sent me.”",
      "links": "<a href='/AIV/13/21/12'>1 Chron. 21:12</a>",
      "comment": "Chronicles says ‘three years’ famine; some ancient manuscripts say ‘seven’. This translation keeps three (Hebrew here)."
    },
    {
      "pk": 1932463,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 14,
      "text": "David said to Gad, “I am in great distress. Let us fall into the hand of the LORD, for his mercy is great; but do not let me fall into the hand of man.”",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/13/21/13'>1 Chron. 21:13</a>",
      "comment": "David appeals to God’s mercy, fearing men more than God."
    },
    {
      "pk": 1932464,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 15,
      "text": "So the LORD sent a plague on Israel from the morning until the appointed time. Seventy thousand people died from Dan to Beersheba.",
      "links": "<a href='/AIV/13/21/14'>1 Chron. 21:14</a>",
      "comment": "Chronicles matches seventy thousand deaths."
    },
    {
      "pk": 1932465,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 16,
      "text": "When the angel stretched out his hand toward Jerusalem to destroy it, the LORD relented about the disaster and said to the angel who was destroying the people, “Enough! Withdraw your hand now.” The angel of the LORD was then by the threshing floor of Araunah the Jebusite.",
      "links": "<a href='/AIV/13/21/15'>1 Chron. 21:15</a>",
      "comment": "The angel’s location provides the setting for the future temple."
    },
    {
      "pk": 1932466,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 17,
      "text": "When David saw the angel striking the people, he said to the LORD, “Surely I have sinned and done wrong, but these sheep—what have they done? Let your hand, I pray, be against me and against my father’s house.”",
      "links": "<a href='/AIV/19/44/22'>Ps. 44:22</a>; <a href='/AIV/13/21/17'>1 Chron. 21:17</a>",
      "comment": "David highlights his own guilt apart from the people."
    },
    {
      "pk": 1932467,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 18,
      "text": "Gad came to David that day and said to him, “Go and build an altar to the LORD on the threshing floor of Araunah the Jebusite.”",
      "links": "<a href='/AIV/10/21/20'>2 Sam. 21:20</a>; <a href='/AIV/13/21/18'>1 Chron. 21:18</a>",
      "comment": "Threshing floor is important for future temple site."
    },
    {
      "pk": 1932468,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 19,
      "text": "So David went up, as Gad had told him, just as the LORD had commanded.",
      "links": "<a href='/AIV/10/22/2'>2 Sam. 22:2</a>; <a href='/AIV/13/21/19'>1 Chron. 21:19</a>",
      "comment": "David obeys unquestioningly."
    },
    {
      "pk": 1932469,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 20,
      "text": "When Araunah looked and saw the king and his men coming toward him, he went out and bowed before the king with his face to the ground.",
      "links": "<a href='/AIV/13/21/20'>1 Chron. 21:20</a>",
      "comment": "Araunah shows proper respect for David’s position."
    },
    {
      "pk": 1932470,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 21,
      "text": "Araunah said, “Why has my lord the king come to his servant?” David replied, “To buy your threshing floor so I can build an altar to the LORD, to halt the plague upon the people.”",
      "links": "<a href='/AIV/13/21/21'>1 Chron. 21:22</a>",
      "comment": "David makes his request to Araunah clear and honorable."
    },
    {
      "pk": 1932471,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 22,
      "text": "Araunah said to David, “Let my lord the king take it and offer whatever seems good to him. Here are oxen for the burnt offering, and the threshing sledges and yokes for the wood.”",
      "links": "<a href='/AIV/13/21/23'>1 Chron. 21:23</a>",
      "comment": "Araunah offers all he has for David’s sacrifice."
    },
    {
      "pk": 1932472,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 23,
      "text": "All this, O king, Araunah gives to you. Araunah also said to the king, “May the LORD your God accept you.”",
      "links": "<a href='/AIV/10/24/14'>2 Sam. 24:14</a>",
      "comment": "Araunah wishes David’s offering to be accepted."
    },
    {
      "pk": 1932473,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 24,
      "text": "But the king said to Araunah, “No, I will buy it from you at a price. I will not offer to the LORD my God burnt offerings that cost me nothing.” So David bought the threshing floor and the oxen for fifty shekels of silver.",
      "links": "<a href='/AIV/13/21/25'>1 Chron. 21:24-25</a>",
      "comment": "Chronicles records six hundred shekels, likely for the whole site. Here, fifty shekels is for the oxen and threshing floor."
    },
    {
      "pk": 1932474,
      "translation": "AIV",
      "book": 10,
      "chapter": 24,
      "verse": 25,
      "text": "David built an altar to the LORD there and offered burnt offerings and peace offerings. So the LORD answered prayer for the land, and the plague was stopped in Israel.",
      "links": "<a href='/AIV/13/21/26-27'>1 Chron. 21:26-27</a>; <a href='/AIV/01/8/21'>Gen. 8:21</a>",
      "comment": "David’s sacrifice ends the plague, with accepted prayer."
    }
  ],
  "translatedAt": "2025-12-22T09:47:50.704Z"
}