{
  "book": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 2,
  "verses": [
    {
      "pk": 2200201,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 1,
      "text": "After this, David inquired of the LORD, \"Should I go up to one of the cities of Judah?\" The LORD answered him, \"Go up.\" David said, \"To which shall I go up?\" And He said, \"To Hebron.\"",
      "links": "<a href='/ESV/9/23/9'>1 Sam. 23:9</a>; <a href='/ESV/10/5/1'>2 Sam. 5:1</a>",
      "comment": "David seeks guidance from God, showing his dependence on divine direction."
    },
    {
      "pk": 2200202,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 2,
      "text": "So David went up there, and also his two wives: Ahinoam of Jezreel and Abigail the widow of Nabal of Carmel.",
      "links": "<a href='/ESV/9/25/43'>1 Sam. 25:43</a>",
      "comment": "David's two wives are named, reflecting his family status at the time."
    },
    {
      "pk": 2200203,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 3,
      "text": "David brought up his men who were with him, every man with his household, and they settled in the towns of Hebron.",
      "links": "<a href='/ESV/9/27/3'>1 Sam. 27:3</a>",
      "comment": "David moves with his followers, emphasizing his leadership and community."
    },
    {
      "pk": 2200204,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 4,
      "text": "Then the men of Judah came, and there they anointed David king over the house of Judah. They told David, \"The men of Jabesh-gilead buried Saul.\"",
      "links": "<a href='/ESV/10/5/3'>2 Sam. 5:3</a>; <a href='/ESV/9/31/11-13'>1 Sam. 31:11–13</a>",
      "comment": "David is anointed, but only over Judah, not yet all Israel."
    },
    {
      "pk": 2200205,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 5,
      "text": "So David sent messengers to the men of Jabesh-gilead and said to them, \"May you be blessed by the LORD, because you showed kindness to Saul your lord and buried him.\"",
      "links": "<a href='/ESV/9/31/11-13'>1 Sam. 31:11–13</a>",
      "comment": "David commends those who honored Saul, showing his respect for the former king."
    },
    {
      "pk": 2200206,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 6,
      "text": "\"Now may the LORD show faithfulness and kindness to you. And I also will do good to you, because you have done this thing.\"",
      "links": "<a href='/ESV/10/9/1'>2 Sam. 9:1</a>",
      "comment": "David promises reciprocal kindness, emphasizing covenant loyalty."
    },
    {
      "pk": 2200207,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 7,
      "text": "\"Therefore, let your hands be strong and be brave, for your lord Saul is dead, and the house of Judah has anointed me king over them.\"",
      "links": "<a href='/ESV/10/5/3'>2 Sam. 5:3</a>",
      "comment": "David encourages alliance, but does not force it, respecting their autonomy."
    },
    {
      "pk": 2200208,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 8,
      "text": "But Abner son of Ner, commander of Saul's army, took Ish-bosheth son of Saul and brought him over to Mahanaim.",
      "links": "<a href='/ESV/10/3/6'>2 Sam. 3:6</a>",
      "comment": "Abner establishes Saul's son as rival king, setting up conflict."
    },
    {
      "pk": 2200209,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 9,
      "text": "He made him king over Gilead, the Ashurites, Jezreel, Ephraim, Benjamin, and all Israel.",
      "links": "<a href='/ESV/10/5/1'>2 Sam. 5:1</a>",
      "comment": "Ish-bosheth rules everywhere except Judah, showing the divided kingdom."
    },
    {
      "pk": 2200210,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 10,
      "text": "Ish-bosheth son of Saul was forty years old when he became king over Israel, and he reigned for two years. But the house of Judah followed David.",
      "links": "<a href='/ESV/10/5/5'>2 Sam. 5:5</a>",
      "comment": "The divided reign is noted; duration of his reign and age are made explicit."
    },
    {
      "pk": 2200211,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 11,
      "text": "And the time that David was king in Hebron over the house of Judah was seven years and six months.",
      "links": "<a href='/ESV/10/5/5'>2 Sam. 5:5</a>",
      "comment": "Chronological detail showing the length of the divided monarchy."
    },
    {
      "pk": 2200212,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 12,
      "text": "Abner son of Ner and the servants of Ish-bosheth son of Saul went out from Mahanaim to Gibeon.",
      "links": "<a href='/ESV/10/2/8'>2 Sam. 2:8</a>",
      "comment": "Introduction of battle, setting locations and parties involved."
    },
    {
      "pk": 2200213,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 13,
      "text": "And Joab son of Zeruiah and the servants of David went out and met them at the pool of Gibeon. They sat down, one group on one side of the pool and the other group on the other side.",
      "links": "<a href='/ESV/10/2/18'>2 Sam. 2:18</a>",
      "comment": "Both sides literally sit facing each other, leading to confrontation."
    },
    {
      "pk": 2200214,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 14,
      "text": "Abner said to Joab, \"Let the young men arise and compete before us.\" Joab said, \"Let them arise.\"",
      "links": "<a href='/ESV/10/2/17'>2 Sam. 2:17</a>",
      "comment": "Abner proposes combat between selected young warriors as a form of conflict."
    },
    {
      "pk": 2200215,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 15,
      "text": "So they arose and went over by number: twelve for Benjamin and Ish-bosheth son of Saul, and twelve from the servants of David.",
      "links": "<a href='/ESV/10/3/20'>2 Sam. 3:20</a>",
      "comment": "The contest is made even, twelve on each side, echoing the twelve tribes."
    },
    {
      "pk": 2200216,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 16,
      "text": "Each man grabbed his opponent by the head and thrust his sword into his side, so they fell down together. Therefore that place was called Helkath-hazzurim, which is at Gibeon.",
      "links": "<a href='/ESV/10/2/24'>2 Sam. 2:24</a>",
      "comment": "\"Helkath-hazzurim\" means \"Field of Swords\" or \"Field of Hostilities.\""
    },
    {
      "pk": 2200217,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 17,
      "text": "And the battle that day was exceedingly fierce, and Abner and the men of Israel were defeated before the servants of David.",
      "links": "<a href='/ESV/10/3/1'>2 Sam. 3:1</a>",
      "comment": "David's side prevails, demonstrating his growing strength."
    },
    {
      "pk": 2200218,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 18,
      "text": "The three sons of Zeruiah were there: Joab, Abishai, and Asahel. Asahel was as swift of foot as a wild gazelle.",
      "links": "<a href='/ESV/10/3/30'>2 Sam. 3:30</a>",
      "comment": "The abilities of David’s nephews are highlighted."
    },
    {
      "pk": 2200219,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 19,
      "text": "Asahel pursued Abner, and in going he did not turn to the right or to the left from following Abner.",
      "links": "<a href='/ESV/10/3/27'>2 Sam. 3:27</a>",
      "comment": "Determination of Asahel in the pursuit is emphasized."
    },
    {
      "pk": 2200220,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 20,
      "text": "Then Abner turned and asked, \"Is that you, Asahel?\" He answered, \"It is.\"",
      "links": "<a href='/ESV/10/2/18'>2 Sam. 2:18</a>",
      "comment": "Dialogue spelled out to clarify the pursuit."
    },
    {
      "pk": 2200221,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 21,
      "text": "Abner said to him, \"Turn aside to your right or to your left, and seize one of the young men and take his armor for yourself.\" But Asahel refused to turn aside from pursuing him.",
      "links": "<a href='/ESV/10/2/23'>2 Sam. 2:23</a>",
      "comment": "Abner tries to prevent confrontation; Asahel refuses, showing stubbornness."
    },
    {
      "pk": 2200222,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 22,
      "text": "Abner again said to Asahel, \"Turn aside from following me. Why should I strike you down? How could I then show my face to your brother Joab?\"",
      "links": "<a href='/ESV/10/3/27'>2 Sam. 3:27</a>",
      "comment": "Abner wishes to avoid enmity with Joab, anticipating consequences."
    },
    {
      "pk": 2200223,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 23,
      "text": "But he refused to turn aside. So Abner struck him in the stomach with the butt of his spear, so that the spear came out his back. Asahel fell and died there. And all who came to that place and saw Asahel lay dead there.",
      "links": "<a href='/ESV/10/3/30'>2 Sam. 3:30</a>",
      "comment": "Abner’s killing of Asahel sets up later rivalry and revenge."
    },
    {
      "pk": 2200224,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 24,
      "text": "But Joab and Abishai pursued Abner. And as the sun was going down, they came to the hill of Ammah, which lies before Giah on the way to the wilderness of Gibeon.",
      "links": "<a href='/ESV/10/2/27'>2 Sam. 2:27</a>",
      "comment": "Geographical details are preserved; pursuit continues."
    },
    {
      "pk": 2200225,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 25,
      "text": "The men of Benjamin gathered behind Abner and formed as one group and stood on the top of a hill.",
      "links": "<a href='/ESV/10/2/8'>2 Sam. 2:8</a>",
      "comment": "Benjamin’s unity and defensive position are emphasized."
    },
    {
      "pk": 2200226,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 26,
      "text": "Abner called out to Joab and said, \"Shall the sword devour forever? Do you not realize that it will lead to bitterness in the end? How long before you tell the people to stop pursuing their brothers?\"",
      "links": "<a href='/ESV/10/2/27'>2 Sam. 2:27</a>",
      "comment": "Abner questions the point of continual warfare among Israelites."
    },
    {
      "pk": 2200227,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 27,
      "text": "Joab said, \"As God lives, if you had not spoken, surely the men would not have stopped pursuing their brothers until morning.\"",
      "links": "<a href='/ESV/10/19/6'>2 Sam. 19:6</a>",
      "comment": "Joab admits Abner’s speech ended the fighting, not his own command."
    },
    {
      "pk": 2200228,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 28,
      "text": "So Joab blew the trumpet, and all the people stopped and no longer pursued Israel, and they did not continue fighting.",
      "links": "<a href='/ESV/10/18/16'>2 Sam. 18:16</a>",
      "comment": "Trumpet as signal for cessation of battle is typical in ancient Israel."
    },
    {
      "pk": 2200229,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 29,
      "text": "Abner and his men went all that night through the Arabah. They crossed the Jordan, marched all morning, and came to Mahanaim.",
      "links": "<a href='/ESV/10/2/8'>2 Sam. 2:8</a>",
      "comment": "Retreat and regrouping of Abner’s forces, gives the sense of exhaustion."
    },
    {
      "pk": 2200230,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 30,
      "text": "Joab returned from pursuing Abner and gathered all the people. Nineteen of David's servants were missing, besides Asahel.",
      "links": "<a href='/ESV/10/2/23'>2 Sam. 2:23</a>",
      "comment": "Record of casualties; Asahel singled out due to his prominence."
    },
    {
      "pk": 2200231,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 31,
      "text": "But the servants of David had struck down three hundred sixty of Abner’s men from Benjamin.",
      "links": "<a href='/ESV/10/3/1'>2 Sam. 3:1</a>",
      "comment": "Disparity in casualties demonstrates David’s superiority."
    },
    {
      "pk": 2200232,
      "translation": "AIV",
      "book": 10,
      "chapter": 2,
      "verse": 32,
      "text": "They took up Asahel and buried him in his father's tomb, which was at Bethlehem. And Joab and his men marched all night and arrived at Hebron at daybreak.",
      "links": "<a href='/ESV/10/3/32'>2 Sam. 3:32</a>; <a href='/ESV/9/17/12'>1 Sam. 17:12</a>",
      "comment": "Asahel’s burial in Bethlehem is a significant detail about David’s family."
    }
  ],
  "translatedAt": "2025-12-22T08:39:51.542Z"
}