{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 19,
  "verses": [
    {
      "pk": 10019001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 1,
      "text": "Joab was told, 'Look, the king is weeping and mourning for Absalom.'",
      "links": "<a href='/AIV/10/18/33'>2 Sam. 18:33</a>",
      "comment": "After Absalom’s death, David’s profound grief becomes public knowledge. This sets the emotional stage for the chapter, emphasizing the humanity and vulnerability of even a king. David's mourning also foreshadows the sorrow over lost children seen in God's heart (see: Luke 19:41 for Christ weeping over Jerusalem)."
    },
    {
      "pk": 10019002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 2,
      "text": "So the victory that day was turned into mourning for all the people, for the people heard it said that day, 'The king is grieved for his son.'",
      "links": "<a href='/AIV/10/18/31-33'>2 Sam. 18:31–33</a>",
      "comment": "Israel’s joy at deliverance gives way to sadness because their king grieves. This illustrates the deep connection between a shepherd and his people (John 10:11)."
    },
    {
      "pk": 10019003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 3,
      "text": "And the people slipped into the city that day as people who are ashamed steal away when they flee in battle.",
      "links": "<a href='/AIV/10/18/17'>2 Sam. 18:17</a>",
      "comment": "The people’s quiet return signifies the awkward reversal of expected roles—victors behave as though they were defeated. This highlights how leadership's emotional state can deeply affect the community."
    },
    {
      "pk": 10019004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 4,
      "text": "But the king covered his face, and the king cried with a loud voice, 'O my son Absalom! O Absalom, my son, my son!'",
      "links": "<a href='/AIV/10/18/33'>2 Sam. 18:33</a>",
      "comment": "David’s grief continues to dominate, echoing Jesus’ lament over Israel (Matt 23:37). The repetition marks deep, personal sorrow."
    },
    {
      "pk": 10019005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 5,
      "text": "Then Joab came into the house to the king and said, 'Today you have shamed all your servants who have saved your life and the lives of your sons and daughters, your wives and your concubines,",
      "links": "<a href='/AIV/10/12/10-12'>2 Sam. 12:10–12</a>",
      "comment": "Joab gently but firmly corrects David’s excessive sorrow, reminding him of unity and loyalty among his people. Even good leaders need correction (Prov. 27:5–6)."
    },
    {
      "pk": 10019006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 6,
      "text": "'by loving those who hate you and hating those who love you. For you have made it clear today that commanders and servants are nothing to you. I see that if Absalom were alive and all of us were dead today, then it would have pleased you!'",
      "links": "<a href='/AIV/10/15/13-14'>2 Sam. 15:13–14</a>",
      "comment": "Joab exposes the perceived injustice of David’s mourning, issuing a necessary exhortation to right ordered love. The ordering of affections has a deeply spiritual dimension (see Luke 14:26; rightly loving God and neighbor)."
    },
    {
      "pk": 10019007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 7,
      "text": "'Now go out and speak kindly to your servants, for I swear by the LORD, if you do not go, not a man will stay with you tonight, and this will be worse for you than all the disaster that has come upon you from your youth until now.'",
      "links": "<a href='/AIV/10/12/10-12'>2 Sam. 12:10–12</a>",
      "comment": "Joab insists David fulfill his duty as king for the good of the people. The gravity of office requires self-sacrifice, a theme fulfilled perfectly by Christ’s self-giving leadership (Phil. 2:5-8)."
    },
    {
      "pk": 10019008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 8,
      "text": "Then the king got up and sat in the gateway. When all the people were told, 'See, the king is sitting at the gate,' they all came before the king. Meanwhile, all Israel had fled, each to his own tent.",
      "links": "<a href='/AIV/10/15/2'>2 Sam. 15:2</a>; <a href='/AIV/10/18/17'>2 Sam. 18:17</a>",
      "comment": "David resumes his kingly duties, appearing publicly to reassure the people. Sitting at the gate is symbolic of authority and justice (Ruth 4:1). Leadership includes visibly being present for the people."
    },
    {
      "pk": 10019009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 9,
      "text": "All the people, throughout the tribes of Israel, were arguing among themselves, saying, 'The king delivered us from the hand of our enemies and saved us from the Philistines, but now he has fled from the land because of Absalom.'",
      "links": "<a href='/AIV/10/8/1'>2 Sam. 8:1</a>",
      "comment": "The nation remembers David’s earlier deliverance. There is a tension between David’s former glory and his current weakened state; foreshadowing how but for God’s gracious action, God’s people can fall into confusion and division."
    },
    {
      "pk": 10019010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 10,
      "text": "'But Absalom, whom we anointed over us, is dead in battle. So why do you say nothing about bringing the king back?'",
      "links": "<a href='/AIV/10/15/10'>2 Sam. 15:10</a>",
      "comment": "Israel faces a leadership vacuum and recognizes the need to restore their true king. The longing for the king’s return prefigures messianic hopes (Acts 1:6)."
    },
    {
      "pk": 10019011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 11,
      "text": "King David sent messengers to Zadok and Abiathar the priests, saying, 'Speak to the elders of Judah and say to them, “Why should you be the last to bring the king back to his palace, since what all Israel is saying has reached the king at his house?",
      "links": "<a href='/AIV/10/15/24-29'>2 Sam. 15:24-29</a>",
      "comment": "David appeals to the priests as mediators, showing the importance of ordained leaders in reconciling the king and the people. The priestly mediation is an enduring reality in God’s plan (Heb. 5:1-4)."
    },
    {
      "pk": 10019012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 12,
      "text": "'You are my relatives, my own flesh and blood. Why should you be the last to bring back the king?'",
      "links": "<a href='/AIV/1/29/14'>Gen. 29:14</a>",
      "comment": "David appeals to kinship, emphasizing unity. Physical descent carries spiritual consequences, as in the new family created by Christ (Matt. 12:50)."
    },
    {
      "pk": 10019013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 13,
      "text": "'And say to Amasa, “Are you not my bone and flesh? God do so to me and more also, if you are not commander of my army from now on, instead of Joab.”'",
      "links": "<a href='/AIV/10/17/25'>2 Sam. 17:25</a>",
      "comment": "David appoints Amasa as military leader, both to reconcile dissenters and to establish order. The pattern of leadership restoration anticipates Christ replacing old leadership forms with greater ones (see John 21:15-17 about Peter’s restoration)."
    },
    {
      "pk": 10019014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 14,
      "text": "He won over the hearts of every man of Judah as if they were one man. So they sent word to the king, 'Return, you and all your servants.'",
      "links": "<a href='/AIV/10/5/1'>2 Sam. 5:1</a>; <a href='/AIV/10/15/10'>2 Sam. 15:10</a>",
      "comment": "Corporate unity—“as one man”—is God’s abiding ideal for his people (Eph. 4:4-6), manifest in the unity of God’s church under rightful shepherds."
    },
    {
      "pk": 10019015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 15,
      "text": "So the king returned and came as far as the Jordan. And the men of Judah came to Gilgal to meet the king and bring him over the Jordan.",
      "links": "<a href='/AIV/6/4/19'>Josh. 4:19</a>",
      "comment": "David’s return via the Jordan and Gilgal recalls Israel’s earlier crossing into the Promised Land. Restoration of the king echoes the spiritual restoration that comes through Christ (Rom. 5:10)."
    },
    {
      "pk": 10019016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 16,
      "text": "Shimei son of Gera, a Benjamite from Bahurim, hurried down with the men of Judah to meet King David.",
      "links": "<a href='/AIV/10/16/5'>2 Sam. 16:5</a>",
      "comment": "Shimei, once an adversary, hastens to reconcile. His repentance underscores mercy and the return of exiles. The invitation to repentance and forgiveness remains open in God’s household (Luke 15:21-24)."
    },
    {
      "pk": 10019017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 17,
      "text": "With him were a thousand men from Benjamin, and Ziba, the servant of Saul’s house, with his fifteen sons and twenty servants. They rushed to the Jordan before the king.",
      "links": "<a href='/AIV/10/9/2'>2 Sam. 9:2</a>, <a href='/AIV/10/16/1'>2 Sam. 16:1</a>",
      "comment": "Former opponents are now gathered in submission and service, illustrating reconciliation and restoration. This anticipates a future gathering of all nations (Rev. 7:9)."
    },
    {
      "pk": 10019018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 18,
      "text": "They crossed the ford to bring over the king’s household and to do whatever pleased him. Shimei son of Gera fell down before the king as he was about to cross the Jordan.",
      "links": "<a href='/AIV/10/16/7-8'>2 Sam. 16:7-8</a>",
      "comment": "Shimei’s humility and submission reflect true repentance. Crossing the river is a symbolic act of entering mercy and new beginnings—prefiguring baptism as the passage into reconciliation and restoration."
    },
    {
      "pk": 10019019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 19,
      "text": "He said to the king, 'Do not let my lord hold me guilty or remember what your servant did when my lord the king left Jerusalem, that the king should take it to heart.'",
      "links": "<a href='/AIV/10/16/5-13'>2 Sam. 16:5–13</a>",
      "comment": "Shimei seeks forgiveness, and his plea echoes the sinner’s confession—highlighting the king's authority to grant pardon (cf. John 20:23)."
    },
    {
      "pk": 10019020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 20,
      "text": "'For your servant knows that I have sinned. See, I have come today, the first of all the house of Joseph to come down to meet my lord the king.'",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "Shimei confesses his sin openly, setting an example for true penitence. Public confession and repentance are key elements in restoration and return to grace (James 5:16)."
    },
    {
      "pk": 10019021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 21,
      "text": "But Abishai son of Zeruiah answered, 'Should not Shimei be put to death for this, because he cursed the LORD’s anointed?'",
      "links": "<a href='/AIV/10/16/9'>2 Sam. 16:9</a>, <a href='/AIV/19/105/15'>Ps. 105:15</a>",
      "comment": "Abishai’s zeal for justice recalls Old Testament traditions about God’s anointed. Yet, God’s mercy is greater than strict justice; the Lord desires mercy and not sacrifice (Hos. 6:6)."
    },
    {
      "pk": 10019022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 22,
      "text": "But David said, 'What have I to do with you, you sons of Zeruiah, that you should act as adversaries to me today? Should anyone be put to death in Israel today? Do I not know that today I am king over Israel?'",
      "links": "<a href='/AIV/10/16/10'>2 Sam. 16:10</a>, <a href='/AIV/42/9/54-56'>Luke 9:54–56</a>",
      "comment": "David chooses mercy over vengeance as the inauguration of a new era of peace. Jesus, too, rebukes James and John when they desire judgment rather than mercy (Luke 9:55)."
    },
    {
      "pk": 10019023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 23,
      "text": "So the king said to Shimei, 'You shall not die.' And the king gave him his oath.",
      "links": "<a href='/AIV/10/21/7'>2 Sam. 21:7</a>, <a href='/AIV/19/130/4'>Ps. 130:4</a>",
      "comment": "David's oath of pardon prefigures Christ’s forgiveness of sinners (Luke 23:34). Mercy and restoration dominate the king’s rule."
    },
    {
      "pk": 10019024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 24,
      "text": "Mephibosheth, the grandson of Saul, also came down to meet the king. He had not cared for his feet, trimmed his beard, or washed his clothes from the day the king departed until he returned safely.",
      "links": "<a href='/AIV/10/9/6'>2 Sam. 9:6</a>, <a href='/AIV/10/16/3'>2 Sam. 16:3</a>",
      "comment": "Mephibosheth’s outward neglect shows his inner mourning and loyalty. Suffering alongside the rightful king reveals the depth of commitment expected of the king’s subjects (Rom. 8:17)."
    },
    {
      "pk": 10019025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 25,
      "text": "When he came from Jerusalem to meet the king, the king said to him, 'Why did you not go with me, Mephibosheth?'",
      "links": "<a href='/AIV/10/16/3'>2 Sam. 16:3</a>",
      "comment": "David questions Mephibosheth, seeking truth and loyalty. The exchange invites the theme of examination at the return of the king (Matt. 25:19)."
    },
    {
      "pk": 10019026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 26,
      "text": "He replied, 'My lord the king, my servant deceived me. Your servant said, “I will saddle a donkey for myself, so that I may ride on it and go with the king,” because your servant is lame.'",
      "links": "<a href='/AIV/10/9/13'>2 Sam. 9:13</a>, <a href='/AIV/10/16/1-3'>2 Sam. 16:1–3</a>",
      "comment": "Mephibosheth pleads his innocence and details his physical limitations. The just king listens with compassion, foreshadowing Christ’s care for the marginalized."
    },
    {
      "pk": 10019027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 27,
      "text": "'He has slandered your servant to my lord the king. But my lord the king is like the angel of God; so do as you think best.'",
      "links": "<a href='/AIV/10/14/17'>2 Sam. 14:17</a>",
      "comment": "Mephibosheth appeals to David as judge, recognizing his king’s wisdom and near-divine impartiality—a type of Christ as the all-wise Judge."
    },
    {
      "pk": 10019028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 28,
      "text": "'For all my father’s house were but dead men before my lord the king; yet you set your servant among those who eat at your table. What right then have I to appeal any more to the king?'",
      "links": "<a href='/AIV/10/9/7-11'>2 Sam. 9:7–11</a>, <a href='/AIV/10/21/7'>2 Sam. 21:7</a>",
      "comment": "Recognition of unworthiness and gratitude for mercy is a recurring theme in the Christian life. Eating at the king’s table is a foretaste of the heavenly banquet (Luke 14:15)."
    },
    {
      "pk": 10019029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 29,
      "text": "The king said to him, 'Why speak any more about your affairs? I have decided: You and Ziba shall divide the land.'",
      "links": "<a href='/AIV/10/9/9'>2 Sam. 9:9</a>, <a href='/AIV/10/16/4'>2 Sam. 16:4</a>",
      "comment": "David wisely settles the dispute, balancing mercy and justice. Such authority in earthly matters reflects God’s wisdom in shepherding his people (1 Cor. 6:2)."
    },
    {
      "pk": 10019030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 30,
      "text": "Mephibosheth said to the king, 'Let him even take it all, since my lord the king has come safely back to his own house.'",
      "links": "<a href='/AIV/10/19/24'>2 Sam. 19:24</a>",
      "comment": "Mephibosheth’s selfless response shows gratitude and detachment from material goods. True joy is found in the presence of the king rather than earthly blessings (Matt. 5:3)."
    },
    {
      "pk": 10019031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 31,
      "text": "Barzillai the Gileadite came down from Rogelim, and he went with the king to the Jordan, to escort him over the Jordan.",
      "links": "<a href='/AIV/10/17/27'>2 Sam. 17:27</a>",
      "comment": "Barzillai is commended for his faithful generosity. Support of the anointed king in times of trial is a pattern for Christian charity and hospitality."
    },
    {
      "pk": 10019032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 32,
      "text": "Barzillai was very old, eighty years of age. He had provided food for the king during his stay at Mahanaim, for he was a very wealthy man.",
      "links": "<a href='/AIV/10/17/27-29'>2 Sam. 17:27–29</a>",
      "comment": "Barzillai’s age and wealth are not hindrances but assets in service. The proper use of wealth for the sake of the king is praised throughout Scripture (Luke 8:2-3)."
    },
    {
      "pk": 10019033,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 33,
      "text": "The king said to Barzillai, 'Come over with me and I will provide for you with me in Jerusalem.'",
      "links": "<a href='/AIV/10/19/31'>2 Sam. 19:31</a>",
      "comment": "David’s invitation to Jerusalem illustrates reward for loyalty and service. Sharing life with the king in the city anticipates the promise of communion in God’s kingdom (Phil. 3:20)."
    },
    {
      "pk": 10019034,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 34,
      "text": "But Barzillai said to the king, 'How many more years will I live, that I should go up with the king to Jerusalem?'",
      "links": "<a href='/AIV/19/39/5'>Ps. 39:5</a>",
      "comment": "Barzillai’s humility and awareness of mortality illustrates detachment and wisdom. The humble often receive the greatest blessings in God’s kingdom."
    },
    {
      "pk": 10019035,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 35,
      "text": "'I am now eighty years old. Can I discern between good and evil? Can your servant taste what he eats or drinks? Can I still hear the voice of singing men and women? Why then should your servant be an added burden to my lord the king?'",
      "links": "<a href='/AIV/19/90/10'>Ps. 90:10</a>",
      "comment": "Barzillai’s limitations reflect the reality of aging. Even in old age, serving God’s anointed is honored and blessed."
    },
    {
      "pk": 10019036,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 36,
      "text": "'Your servant will just cross over the Jordan with the king for a short distance. Why should the king repay me with such a reward?'",
      "links": "<a href='/AIV/42/17/10'>Luke 17:10</a>",
      "comment": "Barzillai shows genuine humility and recognizes that true service expects no earthly reward, echoing Jesus’ words on unworthy servants."
    },
    {
      "pk": 10019037,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 37,
      "text": "'Let your servant return, that I may die in my own city near the tomb of my father and my mother. But here is your servant Kimham. Let him cross over with my lord the king and do for him whatever seems good to you.'",
      "links": "<a href='/AIV/3/49/29-31'>Gen. 49:29–31</a>, <a href='/AIV/11/2/7'>1 Kings 2:7</a>",
      "comment": "Barzillai passes the blessing on to Kimham, demonstrating spiritual succession and legacy—reminding us of how faithfulness is handed down in God’s family."
    },
    {
      "pk": 10019038,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 38,
      "text": "The king answered, 'Kimham shall cross over with me, and I will do for him whatever seems good to you, and whatever you request of me, I will do for you.'",
      "links": "<a href='/AIV/11/2/7'>1 Kings 2:7</a>",
      "comment": "The king’s open-handed generosity models the way God responds to the intercession of the righteous for others (Jas. 5:16)."
    },
    {
      "pk": 10019039,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 39,
      "text": "All the people crossed the Jordan, and the king crossed too. Then the king kissed Barzillai and blessed him, and he returned to his own place.",
      "links": "<a href='/AIV/10/14/33'>2 Sam. 14:33</a>",
      "comment": "Final blessing with a kiss marks true friendship and blessing in departing. Shared blessings and farewells are integral to Christian community (Acts 20:37)."
    },
    {
      "pk": 10019040,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 40,
      "text": "The king went on to Gilgal, and Kimham went with him. All the people of Judah and half the people of Israel escorted the king.",
      "links": "<a href='/AIV/10/19/15'>2 Sam. 19:15</a>",
      "comment": "The division in the procession anticipates later national division. Nevertheless, the king is restored amidst this imperfection, illustrating unity that is always in tension this side of heaven."
    },
    {
      "pk": 10019041,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 41,
      "text": "Then all the men of Israel came to the king and said, 'Why have our brothers, the men of Judah, stolen the king away and brought him and his household over the Jordan, with all David’s men?'",
      "links": "<a href='/AIV/10/15/10'>2 Sam. 15:10</a>",
      "comment": "Jealousy and suspicion begin to surface between the tribes—a reminder of the dangers of disunity (see John 17:21 for Christ’s prayer for unity in his Church)."
    },
    {
      "pk": 10019042,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 42,
      "text": "All the men of Judah answered the men of Israel, 'Because the king is closely related to us. Why are you angry about this? Have we eaten at his expense? Has he given us any gift?'",
      "links": "<a href='/AIV/10/19/12'>2 Sam. 19:12</a>",
      "comment": "Judah asserts its closeness to the king based on kinship. The foundation of spiritual kinship through covenant becomes a major principle in New Testament community (Gal. 3:26-29)."
    },
    {
      "pk": 10019043,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 19,
      "verse": 43,
      "text": "Then the men of Israel answered the men of Judah, 'We have ten shares in the king, and in David also we have more than you. Why then did you treat us with contempt? Were we not the first to speak of bringing back our king?' But the words of the men of Judah were fiercer than the words of the men of Israel.",
      "links": "<a href='/AIV/10/19/9-10'>2 Sam. 19:9–10</a>",
      "comment": "The chapter closes with unresolved tension. Human rivalry and pride threaten the unity that only God can finally heal—fulfilled in Christ’s new covenant (Eph. 2:14-18)."
    }
  ],
  "translatedAt": "2025-12-24T03:23:02.547Z"
}