{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 4,
  "verses": [
    {
      "pk": 10004001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 1,
      "text": "When Saul’s son heard that Abner had died at Hebron, his courage failed, and all Israel was alarmed.",
      "links": "<a href='/AIV/10/3/27'>2Sam 3:27</a>; <a href='/AIV/9/31/6'>1Sam 31:6</a>",
      "comment": "Saul’s son refers to Ish-bosheth, who depends on Abner’s strength. The nation’s panic foreshadows instability when leadership is uncertain. This sets the stage for David's kingship, which will bring unity, echoing types of Christ as true King (cf. <a href='/AIV/19/2/6'>Ps. 2:6</a>)."
    },
    {
      "pk": 10004002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 2,
      "text": "Saul’s son had two men who were leaders of raiding bands. One was named Baanah, and the other, Rechab, sons of Rimmon the Beerothite, from the tribe of Benjamin—for Beeroth is counted among Benjamin.",
      "links": "<a href='/AIV/6/18/25'>Josh 18:25</a>",
      "comment": "The Beerothites’ association with Benjamin strengthens the connection to Saul’s house. The mention of raiding bands hints at the lawlessness under divided rule (cf. <a href='/AIV/7/21/25'>Judg. 21:25</a>)."
    },
    {
      "pk": 10004003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 3,
      "text": "The Beerothites had fled to Gittaim and have lived there as resident foreigners until this day.",
      "links": "<a href='/AIV/16/11/33'>Neh 11:33</a>",
      "comment": "This exile of the Beerothites is a sign of Israel’s fractured tribes. The concept of living as foreigners foreshadows later periods of exile, and spiritual concepts of being strangers in a sinful world (cf. <a href='/AIV/58/11/13'>Heb. 11:13</a>)."
    },
    {
      "pk": 10004004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 4,
      "text": "Jonathan, Saul's son, had a son who was lame in both feet. He was five years old when the news about Saul and Jonathan came from Jezreel, and his nurse picked him up and fled. In haste to get away, the boy fell and became lame. His name was Mephibosheth.",
      "links": "<a href='/AIV/10/9/3'>2Sam 9:3</a>; <a href='/AIV/9/31/2'>1Sam 31:2</a>",
      "comment": "Mephibosheth’s disability caused by flight reflects the tragic effects of fallen leadership and war. He will later be an object of David’s mercy, symbolizing the king’s graciousness and foreshadowing Christ’s mercy (cf. <a href='/AIV/10/9/7'>2Sam 9:7</a>)."
    },
    {
      "pk": 10004005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 5,
      "text": "Now the sons of Rimmon the Beerothite, Rechab and Baanah, went during the heat of the day to the house of Ish-bosheth, as he was lying down for his midday rest.",
      "links": "<a href='/AIV/10/3/39'>2Sam 3:39</a>",
      "comment": "Their approach during Ish-bosheth's vulnerable moment evokes the theme of betrayal, a motif found throughout Scripture, including the betrayal of righteous leaders (cf. <a href='/AIV/19/41/9'>Ps. 41:9</a>)."
    },
    {
      "pk": 10004006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 6,
      "text": "They entered into the house, as though to get wheat, and stabbed him in the stomach. Then Rechab and Baanah, his brother, escaped.",
      "links": "<a href='/AIV/10/2/23'>2Sam 2:23</a>",
      "comment": "The deception of seeking grain highlights the treachery of the act. Kinslaying is a grave sin in ancient culture and prefigures deeper themes of betrayal, echoing Cain and Abel (<a href='/AIV/1/4/8'>Gen 4:8</a>)."
    },
    {
      "pk": 10004007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 7,
      "text": "After they entered the house, he lay on his bed in his bedroom. They struck him, killed him, and cut off his head. Taking his head, they traveled all night along the road to the Arabah.",
      "links": "<a href='/AIV/10/1/9'>2Sam 1:9</a>",
      "comment": "The brutal murder and beheading is reminiscent of Saul’s own fate (<a href='/AIV/9/31/9'>1Sam 31:9</a>). Such violence calls for justice and order, which David fulfills as king, prefiguring the righteous judgment of Christ."
    },
    {
      "pk": 10004008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 8,
      "text": "They brought the head of Ish-bosheth to David at Hebron and said to the king, 'Here is the head of Ish-bosheth, Saul’s son, your enemy who sought your life. The LORD has avenged my lord the king this day against Saul and his offspring.'",
      "links": "<a href='/AIV/10/1/16'>2Sam 1:16</a>",
      "comment": "Rechab and Baanah attempt to justify their crime as a divine act, but David’s later response will show true understanding of God’s justice and mercy—not equating vengeance with righteousness. The motif of bringing enemy heads echoes ancient customs, but fulfills deeper biblical justice."
    },
    {
      "pk": 10004009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 9,
      "text": "But David answered Rechab and Baanah, his brother, sons of Rimmon the Beerothite, 'As the LORD lives, who has redeemed my life from every adversity,'",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>; <a href='/AIV/10/22/2-3'>2Sam 22:2-3</a>",
      "comment": "David’s invocation of God as Redeemer reflects a theology of grace and deliverance, trusting God over human violence. The motif will be central to Christological themes of redemption (cf. <a href='/AIV/40/20/28'>Matt 20:28</a>)."
    },
    {
      "pk": 10004010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 10,
      "text": "'When someone told me, “Saul is dead,” imagining he was bringing good news, I seized him and killed him in Ziklag, which was his reward for his message.'",
      "links": "<a href='/AIV/10/1/14-16'>2Sam 1:14-16</a>",
      "comment": "David’s action toward the Amalekite messenger demonstrates justice tempered with mercy. Leadership must uphold moral laws beyond pragmatic gain, anticipating Christ’s teaching on justice and mercy."
    },
    {
      "pk": 10004011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 11,
      "text": "'How much more, wicked men who have killed a righteous man in his own house on his bed! Shall I not now require his blood from your hand and destroy you from the earth?'",
      "links": "<a href='/AIV/1/9/6'>Gen 9:6</a>; <a href='/AIV/5/19/11'>Deut 19:11</a>",
      "comment": "David’s appeal to the sanctity of life affirms the seriousness of shedding innocent blood, rooted in the Law. True kingship is defined by upholding justice, foreshadowing Christ as Judge (<a href='/AIV/43/5/22'>John 5:22</a>)."
    },
    {
      "pk": 10004012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 4,
      "verse": 12,
      "text": "So David commanded his young men, and they killed Rechab and Baanah, cut off their hands and feet, and hung them by the pool in Hebron. But the head of Ish-bosheth they buried in the tomb of Abner at Hebron.",
      "links": "<a href='/AIV/10/3/32'>2Sam 3:32</a>; <a href='/AIV/9/31/9-10'>1Sam 31:9-10</a>",
      "comment": "David enforces public justice, restoring order among God’s people. He honors the dead appropriately, foreshadowing practices of reverence for the righteous that will become central to Christian tradition regarding saints and martyrs (cf. <a href='/AIV/19/116/15'>Ps. 116:15</a>)."
    }
  ],
  "translatedAt": "2025-12-24T03:10:23.816Z"
}