{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 9,
  "verses": [
    {
      "pk": 10009001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 1,
      "text": "David asked, \"Is there anyone left from the house of Saul, to whom I may show kindness for Jonathan’s sake?\"",
      "links": "<a href='/AIV/9/20/14-15'>1 Sam. 20:14-15</a>",
      "comment": "David’s desire to show kindness for Jonathan’s sake demonstrates the importance of covenant loyalty and mercy. This foreshadows Christ’s mercy extended to all on account of the covenant, and highlights the enduring faithfulness that transcends generations."
    },
    {
      "pk": 10009002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 2,
      "text": "There was a servant of Saul’s household named Ziba. They called him to David, and the king asked, \"Are you Ziba?\" He replied, \"I am your servant.\"",
      "links": "<a href='/AIV/10/16/1'>2 Sam. 16:1</a>",
      "comment": "Ziba, as a faithful servant, becomes the mediator through whom David exercises his mercy. This can be seen as a sign of how God’s grace is often administered through human instruments, prefiguring the role of the apostles and the importance of service within the church."
    },
    {
      "pk": 10009003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 3,
      "text": "The king said, \"Is there no one still alive from the house of Saul to whom I may show God’s kindness?\" Ziba answered, \"There is still a son of Jonathan; he is crippled in both feet.\"",
      "links": "<a href='/AIV/10/4/4'>2 Sam. 4:4</a>",
      "comment": "Mephibosheth, Jonathan’s son, is described as afflicted and weak, yet is singled out for mercy. This points toward God’s preference for the humble and broken, hinting at the spiritual truth that grace is offered not based on merit but on divine love."
    },
    {
      "pk": 10009004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 4,
      "text": "\"Where is he?\" the king asked. Ziba replied, \"He is at the house of Machir son of Ammiel, in Lo-debar.\"",
      "links": "<a href='/AIV/10/17/27'>2 Sam. 17:27</a>",
      "comment": "Mephibosheth is found in Lo-debar, a place named \"no pasture\"—reflecting exile and impoverishment. David’s outreach mirrors God’s initiative to call us out of spiritual desolation into communion."
    },
    {
      "pk": 10009005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 5,
      "text": "Then King David sent for him and brought him from Machir’s house at Lo-debar.",
      "links": "<a href='/AIV/24/32/41-42'>Jer. 32:41-42</a>",
      "comment": "David’s personal intervention to retrieve Mephibosheth signifies the incarnational aspect of divine mercy—God comes to us, not remaining distant."
    },
    {
      "pk": 10009006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 6,
      "text": "When Mephibosheth son of Jonathan, son of Saul, came to David, he bowed low and paid homage. David said, \"Mephibosheth!\" And he answered, \"Here is your servant.\"",
      "links": "<a href='/AIV/42/15/18-19'>Luke 15:18-19</a>",
      "comment": "Mephibosheth’s humility before David echoes the prodigal’s return, underscoring repentance and openness before mercy. The king’s personal address is reminiscent of Christ calling sinners by name."
    },
    {
      "pk": 10009007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 7,
      "text": "David said to him, \"Do not be afraid, for I will surely show you kindness for Jonathan your father’s sake. I will return to you all the land that belonged to Saul your grandfather, and you shall always eat at my table.\"",
      "links": "<a href='/AIV/42/22/30'>Luke 22:30</a>; <a href='/AIV/10/21/7'>2 Sam. 21:7</a>",
      "comment": "The promise of perpetual table fellowship strongly suggests adoption into the royal household, paralleling the Christian doctrine of believers’ communion at the sacred table. This points to the unending covenant meal established in the New Testament."
    },
    {
      "pk": 10009008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 8,
      "text": "Mephibosheth bowed down and said, \"What is your servant, that you should notice a dead dog like me?\"",
      "links": "<a href='/AIV/10/16/9'>2 Sam. 16:9</a>",
      "comment": "Mephibosheth’s self-abasement underscores the undeserved nature of grace. Despite his unworthiness, he is elevated; similar to the way Christ lifts souls from humility to dignity (Luke 18:13-14)."
    },
    {
      "pk": 10009009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 9,
      "text": "Then the king called Ziba, Saul’s servant, and said to him, \"I have given to your master’s grandson everything that belonged to Saul and his family.\"",
      "links": "<a href='/AIV/10/19/29'>2 Sam. 19:29</a>",
      "comment": "Restoration of inheritance emphasizes God’s ability to revive lost dignity and bestow blessings previously forfeited by sin, echoing the theme of restoration found throughout salvation history."
    },
    {
      "pk": 10009010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 10,
      "text": "You and your sons and your servants shall farm the land for him and bring in its produce, so that your master’s grandson may have food to eat. But Mephibosheth, your master’s grandson, will always eat at my table.\" Ziba had fifteen sons and twenty servants.",
      "links": "<a href='/AIV/46/9/13'>1 Cor. 9:13</a>",
      "comment": "The king assigns caregivers to Mephibosheth, but he himself is welcomed at the royal table. This reflects the dual provision of the church: material and spiritual blessing, and the priority of communion with the king."
    },
    {
      "pk": 10009011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 11,
      "text": "Then Ziba said to the king, \"Your servant will do all my lord the king commands.\" So Mephibosheth ate at David’s table, like one of the king’s sons.",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>",
      "comment": "Mephibosheth is treated as a son by the king, emphasizing the theology of adoption (see Gal. 4:4-7), union, and intimacy with the royal family—anticipating the Gospel promise that believers become children of God."
    },
    {
      "pk": 10009012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 12,
      "text": "Mephibosheth had a young son named Mica. All who lived in Ziba’s household became servants of Mephibosheth.",
      "links": "<a href='/AIV/13/8/34-35'>1 Chr. 8:34-35</a>",
      "comment": "Mephibosheth’s restored position is complete with the expansion of blessing to his family, echoing the transmission of grace through generations by household faithfulness."
    },
    {
      "pk": 10009013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 9,
      "verse": 13,
      "text": "And Mephibosheth lived in Jerusalem, because he always ate at the king’s table. He was crippled in both feet.",
      "links": "<a href='/AIV/10/21/7'>2 Sam. 21:7</a>",
      "comment": "Dwelling in Jerusalem and eating at the king’s table, despite personal weakness, is a vivid sign of the continuous grace offered in the city of God and a foretaste of the perpetual banquet promised to those who persevere in faith."
    }
  ],
  "translatedAt": "2025-12-24T03:15:37.201Z"
}