{
  "book": 22,
  "bookName": "Job",
  "bookAbbreviation": "Job",
  "chapter": 25,
  "verses": [
    {
      "pk": 22025001,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 1,
      "text": "Then Bildad the Shuhite answered and said:",
      "links": "<a href='/AIV/18/8/1'>Job 8:1</a>",
      "comment": "This opening signals that the following words are Bildad’s, continuing the cycle of dialogues within Job. No significant variance from the Hebrew text."
    },
    {
      "pk": 22025002,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 2,
      "text": "\"Dominion and awe belong to Him; He makes peace in His high places.\"",
      "links": "<a href='/AIV/19/89/9'>Ps. 89:9</a>; <a href='/AIV/23/57/15'>Isa. 57:15</a>",
      "comment": "Bildad emphasizes God’s absolute sovereignty and His ordering of the heavens, echoing themes of divine order found in the Psalms and Isaiah. The phrase 'makes peace in His high places' alludes to harmony among the heavenly hosts, foreshadowing later biblical notions of cosmic order. Spiritually, this anticipates the peace Christ brings between heaven and earth (<a href='/AIV/42/2/14'>Luke 2:14</a>)."
    },
    {
      "pk": 22025003,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 3,
      "text": "\"Can His armies be numbered? Upon whom does His light not rise?\"",
      "links": "<a href='/AIV/19/147/4'>Ps. 147:4</a>; <a href='/AIV/43/1/9'>John 1:9</a>",
      "comment": "Here, Bildad stresses the countless hosts under God's command and the universal reach of God’s light. This light motif anticipates New Testament themes, where the light is identified with Christ, 'the true light which gives light to everyone' (John 1:9)."
    },
    {
      "pk": 22025004,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 4,
      "text": "\"How then can man be righteous before God? How can he who is born of woman be pure?\"",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Bildad’s rhetorical questions point to the universal human condition of sin. This echoes Psalm 143:2 and forms the theological basis for the need of divine grace found more fully in the New Testament, as Paul writes in Romans 3:23. Spiritually, these verses invite reflection on original sin and humanity’s need for a mediator."
    },
    {
      "pk": 22025005,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 5,
      "text": "\"Behold, even the moon is not bright, and the stars are not pure in His eyes.\"",
      "links": "<a href='/AIV/19/104/19'>Ps. 104:19</a>; <a href='/AIV/23/24/23'>Isa. 24:23</a>",
      "comment": "This verse underscores that even the highest and most beautiful of creation are lacking compared to God’s holiness. A subtle allusion here to the need for sanctification and divine illumination — truths fulfilled in the economy of salvation, both for the righteous of Israel and for the Church."
    },
    {
      "pk": 22025006,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 25,
      "verse": 6,
      "text": "\"How much less man, who is a maggot, and the son of man, who is a worm!\"",
      "links": "<a href='/AIV/19/22/6'>Ps. 22:6</a>; <a href='/AIV/18/4/19'>Job 4:19</a>",
      "comment": "Bildad uses strong imagery to remind humanity of its frailty. 'Son of man' here can also foreshadow the humility of Christ, who bears the same title (see <a href='/AIV/40/8/20'>Matt. 8:20</a>) and identifies with our weakness to raise us up. The language of humility and the necessity of grace is foundational to the faith and the sacraments, which provide sanctifying grace for believers."
    }
  ],
  "translatedAt": "2025-12-24T05:50:20.272Z"
}