{
  "book": 22,
  "bookName": "Job",
  "bookAbbreviation": "Job",
  "chapter": 4,
  "verses": [
    {
      "pk": 22004001,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 1,
      "text": "Then Eliphaz the Temanite responded and said:",
      "links": "<a href='/AIV/18/2/11'>Job 2:11</a>; <a href='/AIV/18/15/1'>Job 15:1</a>",
      "comment": "Eliphaz, one of Job’s friends, begins the first of several discourses. His speech sets the stage for debates about suffering and divine justice. Teman was an Edomite region known for wisdom (Jer. 49:7), connecting this to ancient tradition."
    },
    {
      "pk": 22004002,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 2,
      "text": "If someone tries to speak with you, will you be impatient? But who can keep from speaking?",
      "links": "<a href='/AIV/18/16/3'>Job 16:3</a>; <a href='/AIV/20/27/2'>Prov. 27:2</a>",
      "comment": "Eliphaz gently suggests that speaking is necessary, even though Job’s suffering makes him sensitive to rebuke. The rhetorical question sets a tone of concern and moral teaching."
    },
    {
      "pk": 22004003,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 3,
      "text": "Look, you have instructed many, and you have strengthened weak hands.",
      "links": "<a href='/AIV/18/29/7-11'>Job 29:7-11</a>; <a href='/AIV/23/35/3'>Isa. 35:3</a>",
      "comment": "Job is remembered for his wisdom and help to others. The imagery of ‘strengthening weak hands’ resonates with themes of spiritual and corporal works of mercy (cf. Isa. 35:3)."
    },
    {
      "pk": 22004004,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 4,
      "text": "Your words have upheld those who were stumbling, and you have made firm the knees that were giving way.",
      "links": "<a href='/AIV/23/35/3'>Isa. 35:3</a>; <a href='/AIV/58/12/12'>Heb. 12:12</a>",
      "comment": "Job’s encouragement to others is highlighted, showing his role as a source of strength. The verse echoes later spiritual encouragement in Hebrews 12:12, pointing to a tradition of upholding the weak."
    },
    {
      "pk": 22004005,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 5,
      "text": "But now trouble comes upon you, and you are discouraged; it touches you, and you are dismayed.",
      "links": "<a href='/AIV/18/3/24-26'>Job 3:24-26</a>",
      "comment": "Eliphaz points out Job’s struggle when misfortune personally affects him, introducing subtle themes of perseverance in suffering, which prefigure Christian teachings on redemptive suffering."
    },
    {
      "pk": 22004006,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 6,
      "text": "Isn’t your reverence your confidence, and the integrity of your ways your hope?",
      "links": "<a href='/AIV/18/1/1'>Job 1:1</a>; <a href='/AIV/18/27/5-6'>Job 27:5-6</a>",
      "comment": "Here, Eliphaz suggests Job’s hope was anchored in his righteousness and fear of God—virtues foundational for assurance before God, anticipating New Testament teachings on faith and works."
    },
    {
      "pk": 22004007,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 7,
      "text": "Remember: who, being innocent, has ever perished? Or where were the upright destroyed?",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>; <a href='/AIV/18/8/20'>Job 8:20</a>",
      "comment": "Eliphaz introduces a principle of retribution, common in wisdom literature. Revelation of innocent suffering is most fully displayed in Christ’s Passion (cf. Isa. 53), suggesting a mystery to divine providence beyond simple retribution."
    },
    {
      "pk": 22004008,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 8,
      "text": "As I have observed, those who plow evil and sow trouble reap the same.",
      "links": "<a href='/AIV/28/10/13'>Hos. 10:13</a>; <a href='/AIV/48/6/7'>Gal. 6:7-8</a>",
      "comment": "This sowing-and-reaping principle is echoed throughout Scripture. Its literal justice is nuanced in later revelation, especially in Christ’s teachings on suffering and redemption."
    },
    {
      "pk": 22004009,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 9,
      "text": "By the breath of God they perish, and by the blast of His anger they are consumed.",
      "links": "<a href='/AIV/18/15/30'>Job 15:30</a>; <a href='/AIV/19/18/15'>Ps. 18:15</a>",
      "comment": "This echoes the belief that God’s judgment is active against the wicked. The imagery of breath connects to Genesis 2:7 and John 20:22, linking creation and judgment with divine sovereignty."
    },
    {
      "pk": 22004010,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 10,
      "text": "The roaring of the lion, the voice of the fierce lion, and the teeth of the young lions are broken.",
      "links": "<a href='/AIV/18/29/17'>Job 29:17</a>; <a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "Lion imagery often symbolizes pride and power. The breaking of the lions’ teeth illustrates the defeat of wicked strength by divine action."
    },
    {
      "pk": 22004011,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 11,
      "text": "The strong lion perishes for lack of prey, and the cubs of the lioness are scattered.",
      "links": "<a href='/AIV/18/28/8'>Job 28:8</a>; <a href='/AIV/28/5/14'>Hos. 5:14</a>",
      "comment": "The destruction of lions represents the downfall of those opposed to divine justice. It also spiritually prefigures the scattering of those who reject God’s authority."
    },
    {
      "pk": 22004012,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 12,
      "text": "Now a word was spoken to me in secret, and my ear caught a whisper of it.",
      "links": "<a href='/AIV/18/33/14-17'>Job 33:14-17</a>; <a href='/AIV/19/81/5'>Ps. 81:5</a>",
      "comment": "Eliphaz claims revelation by mystical hearing, pointing to the tradition that God may speak in private ways. This mysterious disclosure foreshadows prophetic revelation and discernment of spirits."
    },
    {
      "pk": 22004013,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 13,
      "text": "Amid thoughts from visions of the night, when deep sleep falls on men,",
      "links": "<a href='/AIV/18/33/15'>Job 33:15</a>; <a href='/AIV/1/15/12'>Gen. 15:12</a>",
      "comment": "Visions in sleep were a recognized means of divine communication. Note the similarity to Abraham’s vision in Genesis 15:12, supporting the continuity of God’s guidance throughout salvation history."
    },
    {
      "pk": 22004014,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 14,
      "text": "fear came upon me, and trembling, which shook all my bones.",
      "links": "<a href='/AIV/27/10/7'>Dan. 10:7</a>; <a href='/AIV/42/24/37'>Luke 24:37</a>",
      "comment": "Encounters with the divine often provoke profound fear and awe, reflecting a biblical pattern from prophets to the disciples encountering the Risen Lord."
    },
    {
      "pk": 22004015,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 15,
      "text": "Then a spirit passed by my face; the hair on my flesh stood up.",
      "links": "<a href='/AIV/11/19/12'>1 Kings 19:12-13</a>; <a href='/AIV/43/3/8'>John 3:8</a>",
      "comment": "The ‘spirit’ moving subtly evokes the mystery of God’s presence through the Spirit, with later echoes to the still small voice to Elijah and the wind in John 3:8."
    },
    {
      "pk": 22004016,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 16,
      "text": "It stood still, but I could not discern its appearance; a form was before my eyes. There was silence, then I heard a voice:",
      "links": "<a href='/AIV/11/19/12'>1 Kings 19:12</a>",
      "comment": "God’s approach is often veiled and mysterious, teaching the soul humility before the incomprehensible, in keeping with the mystery of God’s revelation."
    },
    {
      "pk": 22004017,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 17,
      "text": "Can a mortal be more righteous than God? Can a man be purer than his Maker?",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/18/25/4'>Job 25:4</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "The universality of human sinfulness is a theme expounded in both Old and New Testaments (Ps. 143:2, Rom. 3:23). Spiritual humility and the need for divine grace are strongly highlighted."
    },
    {
      "pk": 22004018,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 18,
      "text": "Even in His servants He puts no trust, and His angels He charges with error.",
      "links": "<a href='/AIV/18/15/15'>Job 15:15</a>; <a href='/AIV/61/2/4'>2 Pet. 2:4</a>",
      "comment": "The fallibility even of divine messengers points to the need for ultimate dependence upon God. This notion of angelic error alludes to the New Testament reference to fallen angels."
    },
    {
      "pk": 22004019,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 19,
      "text": "How much more those who dwell in houses of clay, whose foundation is in the dust, who are crushed before the moth!",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/18/33/6'>Job 33:6</a>",
      "comment": "Humankind’s frailty is rooted in our earthly nature. Genesis 2:7, man being formed from dust, reminds us of the spiritual call to humility and the hope found only in God’s mercy."
    },
    {
      "pk": 22004020,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 20,
      "text": "Between morning and evening, they are shattered; without anyone noticing, they perish forever.",
      "links": "<a href='/AIV/18/7/6'>Job 7:6</a>; <a href='/AIV/19/90/5-6'>Ps. 90:5-6</a>",
      "comment": "The brevity of human life is underscored. Psalm 90:5-6 echoes this, urging watchfulness and prayer for final perseverance."
    },
    {
      "pk": 22004021,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 4,
      "verse": 21,
      "text": "Is not their tent cord plucked up within them? They die, and do not attain wisdom.",
      "links": "<a href='/AIV/18/27/8'>Job 27:8</a>; <a href='/AIV/18/36/12'>Job 36:12</a>",
      "comment": "The tent cord represents the fragile thread of life. The verse stresses the importance of seeking true wisdom—a spiritual interpretation calls for persistent seeking of truth, fullness of life, and the pursuit of deep relationship with God."
    }
  ],
  "translatedAt": "2025-12-24T05:41:00.012Z"
}