{
  "book": 22,
  "bookName": "Job",
  "bookAbbreviation": "Job",
  "chapter": 39,
  "verses": [
    {
      "pk": 22039001,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 1,
      "text": "Do you know when the mountain goats give birth? Have you observed the calving of the deer?",
      "links": "<a href='/AIV/19/104/18'>Ps. 104:18</a>; <a href='/AIV/18/38/39'>Job 38:39</a>",
      "comment": "This verse begins God's continued questioning of Job, stressing God's knowledge and providential care for creation. There is an underlying theme that points to God's intimate governance, foreshadowing the New Testament understanding of divine providence (cf. Matt. 6:26)."
    },
    {
      "pk": 22039002,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 2,
      "text": "Can you count the months they must fulfill? Or do you know the time when they give birth?",
      "links": "<a href='/AIV/19/104/27'>Ps. 104:27</a>",
      "comment": "This verse underscores the mystery of life cycles known only to God. It gently hints at the limits of human understanding, a theme echoed in later wisdom literature (Prov. 30:18-19)."
    },
    {
      "pk": 22039003,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 3,
      "text": "They crouch, give birth to their young, and deliver their offspring.",
      "links": "<a href='/AIV/19/29/9'>Ps. 29:9</a>",
      "comment": "The hidden birth of wild animals reflects God's unseen yet active role in sustaining creation, an ongoing theme that points to humanity’s dependence on revelation (cf. Rom. 1:20)."
    },
    {
      "pk": 22039004,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 4,
      "text": "Their young grow strong in the open; they go out and do not return to them.",
      "links": "<a href='/AIV/18/39/14-15'>Job 39:14-15</a>",
      "comment": "The independence of wild offspring signifies God’s wisdom in ordaining creatures’ lives apart from human oversight—a subtle reminder that creation is ordered by the Creator (cf. Ps. 147:9)."
    },
    {
      "pk": 22039005,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 5,
      "text": "Who has set the wild donkey free? Who has loosed the bonds of the swift donkey?",
      "links": "<a href='/AIV/18/11/12'>Job 11:12</a>; <a href='/AIV/19/104/11'>Ps. 104:11</a>",
      "comment": "The liberation of the wild donkey symbolizes freedom given by God, suggesting both natural and spiritual realities: creation’s autonomy and divine initiative (see Gal. 5:1 for spiritual liberation)."
    },
    {
      "pk": 22039006,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 6,
      "text": "I have made the wilderness his home and the salt land his dwelling place.",
      "links": "<a href='/AIV/19/107/34'>Ps. 107:34</a>",
      "comment": "God’s sovereign placing of creatures in their proper habitat also speaks to the theme of vocation—that every being has its place and purpose determined by God (cf. 1 Cor. 12:18)."
    },
    {
      "pk": 22039007,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 7,
      "text": "He laughs at the commotion of the city; he does not hear the shouts of the driver.",
      "links": "<a href='/AIV/18/24/5'>Job 24:5</a>",
      "comment": "The wild donkey’s indifference to civilization emphasizes the separation between the sacred order of creation and human constructs, a theme connected to the reality that divine law precedes human law."
    },
    {
      "pk": 22039008,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 8,
      "text": "He ranges the mountains as his pasture and searches after every green thing.",
      "links": "<a href='/AIV/19/104/14'>Ps. 104:14</a>",
      "comment": "The unfettered search for sustenance signifies trust in God's providence, prefiguring Jesus’s teaching about God's care for creation (Matt. 6:26)."
    },
    {
      "pk": 22039009,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 9,
      "text": "Will the wild ox be willing to serve you, or spend the night at your manger?",
      "links": "<a href='/AIV/18/39/12'>Job 39:12</a>; <a href='/AIV/23/1/3'>Isa. 1:3</a>",
      "comment": "The wild ox's refusal to serve man alludes to the humility required to submit to the divine; the idea of the manger becomes significant christologically (cf. Luke 2:7—Jesus in the manger)."
    },
    {
      "pk": 22039010,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 10,
      "text": "Can you bind him in the furrow with ropes, or will he harrow the valleys behind you?",
      "links": "<a href='/AIV/18/39/11'>Job 39:11</a>",
      "comment": "Humanity’s inability to tame the wild ox reveals the limitations of human authority and hints at mankind’s need for a mediator between creation and God."
    },
    {
      "pk": 22039011,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 11,
      "text": "Will you trust him because his strength is great, or will you leave your labor to him?",
      "links": "<a href='/AIV/18/39/9'>Job 39:9</a>",
      "comment": "Here the text subtly moves from mere creation to the importance of trust—a virtue key to faith—hinting at the spiritual journey toward submission to God's will."
    },
    {
      "pk": 22039012,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 12,
      "text": "Will you rely on him to bring in your grain, or gather it to your threshing floor?",
      "links": "<a href='/AIV/18/39/9'>Job 39:9</a>; <a href='/AIV/40/3/12'>Matt. 3:12</a>",
      "comment": "The threshing floor is a biblically loaded image (see Matt. 3:12), representing both harvest and judgment; only God can gather the harvest, an image hinting at Christ’s final work."
    },
    {
      "pk": 22039013,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 13,
      "text": "The wings of the ostrich wave proudly, but are her pinions and feathers kindly?",
      "links": "<a href='/AIV/18/39/17'>Job 39:17</a>",
      "comment": "Ostrich imagery here suggests apparent foolishness in creation, yet hints at the higher wisdom of God, whose ways surpass human insight (cf. 1 Cor. 1:25)."
    },
    {
      "pk": 22039014,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 14,
      "text": "She leaves her eggs on the ground and lets them warm in the dust,",
      "links": "<a href='/AIV/18/39/16'>Job 39:16</a>",
      "comment": "The ostrich’s neglect again reveals apparent folly in creation that ultimately gives glory to God's hidden wisdom."
    },
    {
      "pk": 22039015,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 15,
      "text": "forgetting that a foot may crush them, or a wild animal may trample them.",
      "links": "<a href='/AIV/23/43/20'>Isa. 43:20</a>",
      "comment": "Natural vulnerabilities appear accidental, but act within the limits God has set for His creatures. God’s providence is never absent."
    },
    {
      "pk": 22039016,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 16,
      "text": "She deals harshly with her young, as if they were not hers; though her labor is in vain, she shows no concern.",
      "links": "<a href='/AIV/28/13/8'>Hos. 13:8</a>",
      "comment": "The ostrich’s behavior, in human eyes, seems uncaring; yet it ultimately teaches reliance on God’s wisdom above nature and understanding."
    },
    {
      "pk": 22039017,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 17,
      "text": "For God has deprived her of wisdom, and has not given her a share of understanding.",
      "links": "<a href='/AIV/18/39/13'>Job 39:13</a>; <a href='/AIV/19/147/9'>Ps. 147:9</a>",
      "comment": "God sovereignly withholds or gives wisdom as He pleases; this foreshadows the gift of divine wisdom given through faith and revelation (see James 1:5)."
    },
    {
      "pk": 22039018,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 18,
      "text": "Yet, when she lifts herself high to run, she laughs at horse and rider.",
      "links": "<a href='/AIV/18/39/19'>Job 39:19</a>",
      "comment": "Despite the lack of wisdom, the ostrich is swift, highlighting the diverse gifts in nature—a parallel to spiritual gifts distributed as the Holy Spirit wills (1 Cor. 12:11)."
    },
    {
      "pk": 22039019,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 19,
      "text": "Do you give the horse its strength? Do you clothe his neck with a mane?",
      "links": "<a href='/AIV/19/147/10'>Ps. 147:10</a>",
      "comment": "The horse’s strength comes from God alone. This mirrors the Christian understanding of all gifts coming from above (James 1:17)."
    },
    {
      "pk": 22039020,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 20,
      "text": "Do you make him leap like a locust? His majestic snorting strikes terror.",
      "links": "<a href='/AIV/29/2/4'>Joel 2:4</a>",
      "comment": "The description of the horse evokes awe, and like other powerful creatures, highlights creation’s dependence on God’s sustaining word (cf. Heb. 1:3)."
    },
    {
      "pk": 22039021,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 21,
      "text": "He paws in the valley and rejoices in his strength; he charges into the clash of arms.",
      "links": "<a href='/AIV/20/21/31'>Prov. 21:31</a>",
      "comment": "The horse’s readiness for battle symbolizes zeal and holy courage—virtues important for those defending the faith (cf. Eph. 6:10-17, ‘the armor of God’)."
    },
    {
      "pk": 22039022,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 22,
      "text": "He mocks at fear and is not dismayed; he does not turn back from the sword.",
      "links": "<a href='/AIV/18/41/29'>Job 41:29</a>",
      "comment": "Fearlessness is presented as a gift ordered toward God’s purposes. In spiritual typology, this quality is seen in the saints and martyrs who trust in God's victory."
    },
    {
      "pk": 22039023,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 23,
      "text": "The quiver rattles against him, the flashing spear and javelin.",
      "links": "<a href='/AIV/24/50/9'>Jer. 50:9</a>",
      "comment": "The horse faces the weapons of battle undaunted, exemplifying steadfast faith amidst trials, echoed in New Testament perseverance (Rom. 8:35-39)."
    },
    {
      "pk": 22039024,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 24,
      "text": "With fierceness and rage he swallows the ground; he does not stand still at the sound of the trumpet.",
      "links": "<a href='/AIV/24/8/6'>Jer. 8:6</a>",
      "comment": "The horse’s eagerness in battle embodies commitment, urging believers to pursue holiness with zeal (cf. Heb. 12:1)."
    },
    {
      "pk": 22039025,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 25,
      "text": "At the blast of the trumpet he says, ‘Aha!’ He smells the battle from afar, the thunder of captains, and shouting.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Symbolic of spiritual warfare, the horse’s anticipation mirrors the Christian’s attentiveness to God’s call and readiness for spiritual trials (Eph. 6:13)."
    },
    {
      "pk": 22039026,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 26,
      "text": "Is it by your wisdom that the hawk soars and spreads his wings toward the south?",
      "links": "<a href='/AIV/24/8/7'>Jer. 8:7</a>",
      "comment": "The migration instinct in birds testifies to a divine imprint on nature, suggesting a higher wisdom at work—a theme that points to the Holy Spirit’s guidance of the faithful."
    },
    {
      "pk": 22039027,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 27,
      "text": "Is it at your command that the eagle mounts up and makes his nest on high?",
      "links": "<a href='/AIV/20/30/18-19'>Prov. 30:18-19</a>; <a href='/AIV/05/32/11'>Deut. 32:11</a>",
      "comment": "The eagle is biblically symbolic of strength and renewal (Isa. 40:31), underlining yet again that God alone commands the forces of nature, just as He governs the Church."
    },
    {
      "pk": 22039028,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 28,
      "text": "He dwells and lodges on the rock, on the crag of the rock and the stronghold.",
      "links": "<a href='/AIV/19/104/18'>Ps. 104:18</a>",
      "comment": "The eagle nesting on the rock is typologically rich, reminding us of Christ as the Rock (1 Cor. 10:4; Matt. 16:18)—the true foundation and refuge for God’s people."
    },
    {
      "pk": 22039029,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 29,
      "text": "From there he spies out the prey; his eyes see it from afar.",
      "links": "<a href='/AIV/35/2/1'>Hab. 2:1</a>",
      "comment": "The eagle’s vigilance illustrates discernment, a spiritual gift for believers, nurturing watchfulness and wisdom in seeking the things of God."
    },
    {
      "pk": 22039030,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 39,
      "verse": 30,
      "text": "His young ones suck up blood; where the slain are, there he is.",
      "links": "<a href='/AIV/40/24/28'>Matt. 24:28</a>; <a href='/AIV/42/17/37'>Luke 17:37</a>",
      "comment": "Jesus echoes this imagery in His eschatological teaching (Matt. 24:28; Luke 17:37), reinforcing the prophetic and typological nature of Job. Just as the eagle is drawn to the slain, so will judgment and gathering come at the end, emphasizing vigilance and readiness for the final day."
    }
  ],
  "translatedAt": "2025-12-24T05:57:41.716Z"
}