{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 2,
  "verses": [
    {
      "pk": 5002001,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 1,
      "text": "This is what the LORD says: For three transgressions of Moab, and for four, I will not turn back My wrath, because he burned the bones of the king of Edom to lime.",
      "links": "<a href='/AIV/23/25/10'>Isa. 25:10</a>; <a href='/AIV/24/48/1'>Jer. 48:1</a>",
      "comment": "Moab's offense is grave: desecrating human remains was seen as an ultimate insult, violating both human dignity and God's image in mankind (Gen. 1:27)."
    },
    {
      "pk": 5002002,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 2,
      "text": "So I will send fire upon Moab, and it shall destroy the palaces of Kerioth; and Moab shall die amid tumult, with shoutings and the sound of the trumpet.",
      "links": "<a href='/AIV/24/48/24'>Jer. 48:24</a>; <a href='/AIV/19/9/5-6'>Ps. 9:5–6</a>",
      "comment": "Judgment on Moab is complete and noisy—akin to apocalyptic imagery in other prophets. The fire echoes God’s consuming holiness (Heb. 12:29)."
    },
    {
      "pk": 5002003,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 3,
      "text": "I will cut off the ruler from its midst, and will kill all its princes with him, says the LORD.",
      "links": "<a href='/AIV/24/48/7'>Jer. 48:7</a>",
      "comment": "God judges leaders for their actions, reminding us of the divine authority over earthly rulers (Rom. 13:1)."
    },
    {
      "pk": 5002004,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 4,
      "text": "This is what the LORD says: For three transgressions of Judah, and for four, I will not turn back My wrath, because they have rejected the law of the LORD and have not kept His statutes; their lies have caused them to go astray, after which their fathers walked.",
      "links": "<a href='/AIV/19/78/10'>Ps. 78:10</a>; <a href='/AIV/24/11/10'>Jer. 11:10</a>",
      "comment": "Judah’s judgment is specifically tied to abandoning God’s revealed law—not just social evil. Spiritual infidelity is highlighted here, a foreshadowing of Christ’s call to fulfill the Law (Matt. 5:17)."
    },
    {
      "pk": 5002005,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 5,
      "text": "So I will send fire upon Judah, and it shall devour the palaces of Jerusalem.",
      "links": "<a href='/AIV/12/25/9'>2 Kings 25:9</a>; <a href='/AIV/24/17/27'>Jer. 17:27</a>",
      "comment": "Judah, God’s chosen people, are not exempt from judgment—showing that belonging to the covenant community requires faithfulness. The temple, much later, becomes the locus of Christ’s atoning presence."
    },
    {
      "pk": 5002006,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 6,
      "text": "This is what the LORD says: For three transgressions of Israel, and for four, I will not turn back My wrath, because they sell the righteous for silver, and the needy for a pair of sandals.",
      "links": "<a href='/AIV/28/12/7'>Hos. 12:7</a>; <a href='/AIV/40/26/15'>Matt. 26:15</a>",
      "comment": "Social injustice is condemned. The phrase 'sell the righteous for silver' foreshadows the betrayal of Christ for silver (Matt. 26:15), linking prophecy to fulfillment."
    },
    {
      "pk": 5002007,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 7,
      "text": "They trample on the head of the poor into the dust of the earth, and push aside the afflicted. A man and his father go in to the same young woman, so as to profane My holy name.",
      "links": "<a href='/AIV/3/18/7'>Lev. 18:7</a>; <a href='/AIV/46/5/1'>1 Cor. 5:1</a>",
      "comment": "Gross personal and sexual sin corrupts communal holiness. The reference to profaning God's name points to the dignity and sacredness of being God’s people."
    },
    {
      "pk": 5002008,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 8,
      "text": "They lie beside every altar on garments taken in pledge, and drink wine in the house of their gods bought with fines.",
      "links": "<a href='/AIV/2/22/26'>Ex. 22:26-27</a>; <a href='/AIV/23/57/7'>Isa. 57:7</a>",
      "comment": "Israel corrupts worship by using unjust gains and violating the law on pledges (see Ex. 22:26-27). The intertwining of injustice and false worship contrasts with genuine worship in Spirit and truth (John 4:24)."
    },
    {
      "pk": 5002009,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 9,
      "text": "Yet I destroyed the Amorite before them, whose height was like the height of the cedars, and who was strong as oaks; I destroyed his fruit above and his roots beneath.",
      "links": "<a href='/AIV/6/24/8'>Josh. 24:8</a>; <a href='/AIV/5/9/2'>Deut. 9:2</a>",
      "comment": "Despite God’s mighty acts—the defeat of formidable enemies—Israel forgot His deliverance. The fruit/root imagery contains hints of judgment and restoration themes found in later prophets (Isa. 11:1)."
    },
    {
      "pk": 5002010,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 10,
      "text": "Also I brought you up out of the land of Egypt, and led you forty years through the wilderness, to possess the land of the Amorite.",
      "links": "<a href='/AIV/2/12/51'>Ex. 12:51</a>; <a href='/AIV/6/3/17'>Josh. 3:17</a>",
      "comment": "This recalls the Exodus, central to scriptural salvation history, later spiritually fulfilled in Christ as the True Deliverer (Luke 9:31)."
    },
    {
      "pk": 5002011,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 11,
      "text": "And I raised up some of your sons as prophets, and some of your young men as Nazirites. Is it not so, people of Israel? says the LORD.",
      "links": "<a href='/AIV/4/6/2'>Num. 6:2</a>; <a href='/AIV/9/3/20'>1 Sam. 3:20</a>",
      "comment": "Prophets and Nazirites were set apart for God’s service, prefiguring the later call to holiness and sacrificial living (Rom. 12:1)."
    },
    {
      "pk": 5002012,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 12,
      "text": "But you made the Nazirites drink wine, and commanded the prophets, saying, 'Do not prophesy.'",
      "links": "<a href='/AIV/24/11/21'>Jer. 11:21</a>; <a href='/AIV/33/2/6'>Mic. 2:6</a>",
      "comment": "Israel’s rejection of consecrated people foreshadows later resistance to God’s messengers—including Christ Himself (Luke 11:47-49)."
    },
    {
      "pk": 5002013,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 13,
      "text": "Behold, I will press you down in your place, as a cart full of sheaves presses down.",
      "links": "<a href='/AIV/24/6/11'>Jer. 6:11</a>",
      "comment": "Oppression imagery indicates the weighty consequences of sin—God’s justice is not arbitrary, but proportional and purposeful."
    },
    {
      "pk": 5002014,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 14,
      "text": "Flight will perish from the swift; the strong will not strengthen his force, nor will the mighty save himself.",
      "links": "<a href='/AIV/23/30/16'>Isa. 30:16</a>",
      "comment": "Human resources and strength fail in the face of divine judgment, underscoring the need for dependence on the Lord alone—an invitation to humility and surrender."
    },
    {
      "pk": 5002015,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 15,
      "text": "He who handles the bow will not stand, nor will the swift of foot escape; nor will he who rides the horse save his life.",
      "links": "<a href='/AIV/19/33/16-17'>Ps. 33:16–17</a>",
      "comment": "Skill and speed offer no escape; salvation comes not from human means but from God alone (Ps. 33:16–17)."
    },
    {
      "pk": 5002016,
      "translation": "AIV",
      "book": 30,
      "chapter": 2,
      "verse": 16,
      "text": "Even the bravest among the warriors will flee naked on that day, declares the LORD.",
      "links": "<a href='/AIV/24/46/5'>Jer. 46:5</a>; <a href='/AIV/41/14/51'>Mark 14:51–52</a>",
      "comment": "Humiliation in judgment is total. The image anticipates the vulnerability of even the strong, echoing spiritual themes of dependence and repentance. Note Mark 14:51-52, where fleeing naked symbolizes abandonment of earthly security."
    }
  ],
  "translatedAt": "2025-12-23T07:26:05.033Z"
}