{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 4,
  "verses": [
    {
      "pk": 1941001,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 1,
      "text": "Hear this word, you cows of Bashan, who are on the mountain of Samaria, who oppress the poor, who crush the needy, who say to their husbands, 'Bring us something to drink!'",
      "links": "<a href='/AIV/19/22/12'>Ps. 22:12</a>; <a href='/AIV/30/3/9'>Amos 3:9</a>",
      "comment": "Amos uses striking language here, comparing wealthy women in Samaria to well-fed cattle of Bashan—a picture of indulgence and privilege. Their responsibility in oppressing the needy echoes prophetic warnings elsewhere (Mic. 2:2, Isa. 3:15)."
    },
    {
      "pk": 1941002,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 2,
      "text": "The Lord GOD has sworn by his holiness, 'Behold, the days are coming upon you when you will be taken away with hooks, and your descendants with fishhooks.'",
      "links": "<a href='/AIV/26/29/4'>Ezek. 29:4</a>; <a href='/AIV/30/6/8'>Amos 6:8</a>",
      "comment": "God swearing by His holiness emphasizes the seriousness of this prophecy—His very character guarantees its fulfillment. The image of hooks conveys violent exile (see 2 Kgs 19:28), also seen in later judgment imagery."
    },
    {
      "pk": 1941003,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 3,
      "text": "You shall go out through the breaches, each one straight ahead, and you shall be cast out toward Harmon,' declares the LORD.",
      "links": "<a href='/AIV/24/52/7'>Jer. 52:7</a>; <a href='/AIV/30/9/4'>Amos 9:4</a>",
      "comment": "'Breaches' refers to breaks in the city walls—symbolizing disgraceful defeat and forced exile. God’s sovereign purpose behind judgment is in view."
    },
    {
      "pk": 1941004,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 4,
      "text": "'Come to Bethel, and transgress; to Gilgal, and multiply transgression! Bring your sacrifices every morning, your tithes every three days;",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>; <a href='/AIV/30/5/5'>Amos 5:5</a>",
      "comment": "The prophet speaks ironically, exposing false worship at Bethel and Gilgal. While the people increase their religious rituals, their hearts remain far from obedience (see 1 Sam. 15:22). This invites reflection on true vs. empty worship."
    },
    {
      "pk": 1941005,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 5,
      "text": "offer a sacrifice of thanksgiving of that which is leavened, and proclaim freewill offerings, publish them; for so you love to do, O people of Israel!' declares the Lord GOD.",
      "links": "<a href='/AIV/03/7/13'>Lev. 7:13</a>; <a href='/AIV/23/1/11-15'>Isa. 1:11–15</a>",
      "comment": "The people’s zeal for ritual shows outward religiousness but lacks repentance, pointing to the need for a worship that unites external acts and inward faith (see Mic. 6:6–8). This anticipates how authentic worship requires both faith and action."
    },
    {
      "pk": 1941006,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 6,
      "text": "'I gave you cleanness of teeth in all your cities, and lack of bread in all your places, yet you did not return to me,' declares the LORD.",
      "links": "<a href='/AIV/05/28/48'>Deut. 28:48</a>; <a href='/AIV/30/4/8-11'>Amos 4:8–11</a>",
      "comment": "The phrase 'cleanness of teeth' is a metaphor for hunger. God sent famine as discipline to lead His people to repentance, but they refused to return—an ongoing prophetic theme (Hos. 7:10)."
    },
    {
      "pk": 1941007,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 7,
      "text": "'I also withheld the rain from you when there were yet three months to the harvest; I would send rain on one city and not send rain on another city; one field would have rain, and the field on which it did not rain would wither.'",
      "links": "<a href='/AIV/05/11/17'>Deut. 11:17</a>; <a href='/AIV/01/41/53-54'>Gen. 41:53–54</a>",
      "comment": "Drought is described as a divine disciplinary act. It underscores God’s sovereignty over creation and foreshadows the way judgment and warning serve as calls to repentance (see also James 5:17–18)."
    },
    {
      "pk": 1941008,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 8,
      "text": "So two or three cities would wander to one city to drink water and would not be satisfied; yet you did not return to me,' declares the LORD.",
      "links": "<a href='/AIV/05/28/23-24'>Deut. 28:23–24</a>; <a href='/AIV/30/4/6'>Amos 4:6</a>",
      "comment": "Scarcity led to inter-city searching for relief, yet no spiritual turn to God occurred. The repeated call highlights how exterior suffering often draws people to reflect inwardly, and hints at the need for conversion of heart."
    },
    {
      "pk": 1941009,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 9,
      "text": "'I struck you with blight and mildew; your many gardens and your vineyards, your fig trees and your olive trees the locust devoured; yet you did not return to me,' declares the LORD.",
      "links": "<a href='/AIV/02/10/13-15'>Exod. 10:13–15</a>; <a href='/AIV/05/28/38-42'>Deut. 28:38–42</a>",
      "comment": "Exodus and Deuteronomy warn of agricultural plagues as discipline. Here, loss of sustenance recalls the Exodus plagues, inviting a meditative (typological) connection to future judgment and salvation history."
    },
    {
      "pk": 1941010,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 10,
      "text": "'I sent among you a plague after the manner of Egypt; I killed your young men with the sword, and carried away your horses, and I made the stench of your camp go up into your nostrils; yet you did not return to me,' declares the LORD.",
      "links": "<a href='/AIV/02/12/29-30'>Exod. 12:29–30</a>; <a href='/AIV/05/28/25-26'>Deut. 28:25–26</a>",
      "comment": "God’s acts mirror the judgments on Egypt, showing His justice is consistent throughout history. The repeated lack of repentance sets the stage for a later message of hope and restoration grounded in faith and sacramental conversion (Ezek. 36:26–27; John 3:5)."
    },
    {
      "pk": 1941011,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 11,
      "text": "'I overthrew some of you, as when God overthrew Sodom and Gomorrah, and you were like a brand snatched out of the fire; yet you did not return to me,' declares the LORD.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24–25</a>; <a href='/AIV/38/3/2'>Zech. 3:2</a>",
      "comment": "The 'brand snatched from the fire' portrays God’s mercy—preserving a remnant despite judgment (Rom. 11:5). This foreshadows how God’s ultimate rescue would be fulfilled in Christ and His gathered people."
    },
    {
      "pk": 1941012,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 12,
      "text": "'Therefore I will do this to you, O Israel; because I will do this to you, prepare to meet your God, O Israel!'",
      "links": "<a href='/AIV/02/19/17'>Exod. 19:17</a>; <a href='/AIV/58/10/31'>Heb. 10:31</a>",
      "comment": "The solemn call 'prepare to meet your God' highlights both warning and hope. Meeting God involves judgment, but also the possibility of restoration. The language echoes the seriousness and solemnity of approaching God in worship, foreshadowing the final judgment."
    },
    {
      "pk": 1941013,
      "translation": "AIV",
      "book": 30,
      "chapter": 4,
      "verse": 13,
      "text": "For behold, he who forms the mountains, and creates the wind, and declares to man what is his thought, who makes the morning darkness, and treads on the high places of the earth—the LORD, the God of hosts, is his name.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/104/5-9'>Ps. 104:5–9</a>; <a href='/AIV/24/10/12-13'>Jer. 10:12–13</a>",
      "comment": "God is revealed as both Creator and Judge. His knowledge of thoughts points toward the New Testament idea of God searching the heart (Heb. 4:12–13). Amos underscores that the Lord is over all—inviting awe, reverence, and the unity of worship and life."
    }
  ],
  "translatedAt": "2025-12-23T07:26:41.263Z"
}