{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 3,
  "verses": [
    {
      "pk": 3003001,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 1,
      "text": "Hear this word that the LORD has spoken against you, sons of Israel, against the whole family which I brought up out of the land of Egypt:",
      "links": "<a href='/AIV/2/12/51'>Ex. 12:51</a>; <a href='/AIV/30/2/10'>Amos 2:10</a>",
      "comment": "God addresses all Israel as a single family, emphasizing unity and shared responsibility. The reference to Egypt recalls their deliverance and covenant relationship."
    },
    {
      "pk": 3003002,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 2,
      "text": "You alone have I known out of all the families of the earth; therefore I will punish you for all your sins.",
      "links": "<a href='/AIV/1/18/19'>Gen. 18:19</a>; <a href='/AIV/19/147/19-20'>Ps. 147:19-20</a>",
      "comment": "God’s unique relationship to Israel brings both privilege and accountability. Chosen status is paired with a call to holiness, prefiguring the idea of a set-apart people."
    },
    {
      "pk": 3003003,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 3,
      "text": "Do two walk together unless they are agreed?",
      "links": "<a href='/AIV/19/119/63'>Ps. 119:63</a>",
      "comment": "Walking together implies harmony and purpose. This anticipates the biblical theme of unity in faith and doctrine within the Church."
    },
    {
      "pk": 3003004,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 4,
      "text": "Does a lion roar in the forest when he has no prey? Does a young lion cry out from his den if he has caught nothing?",
      "links": "<a href='/AIV/18/4/10'>Job 4:10</a>; <a href='/AIV/28/11/10'>Hos. 11:10</a>",
      "comment": "Natural cause and effect—Amos uses images to show that God’s warning is not random, but purposeful. Judgment follows real reasons."
    },
    {
      "pk": 3003005,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 5,
      "text": "Does a bird fall into a trap on the ground without a snare being set? Does a trap spring up from the earth when it has caught nothing?",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>; <a href='/AIV/20/6/5'>Prov. 6:5</a>",
      "comment": "Pointing to consequences from actions—divine judgment is not arbitrary."
    },
    {
      "pk": 3003006,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 6,
      "text": "If the trumpet is blown in a city, will not the people be afraid? If disaster comes to a city, has not the LORD done it?",
      "links": "<a href='/AIV/26/33/3'>Ezek. 33:3</a>; <a href='/AIV/23/45/7'>Isa. 45:7</a>",
      "comment": "The sovereignty of God is affirmed—even calamity is within His command. This speaks to His providence, echoed in New Testament teachings about God’s will."
    },
    {
      "pk": 3003007,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 7,
      "text": "Surely the Lord GOD does nothing without revealing His secret to His servants the prophets.",
      "links": "<a href='/AIV/1/18/17'>Gen. 18:17</a>; <a href='/AIV/43/15/15'>John 15:15</a>",
      "comment": "God discloses His plans through prophets—laying foundations for the authority of sacred prophecy and indicating an established means of teaching and revelation."
    },
    {
      "pk": 3003008,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 8,
      "text": "The lion has roared; who will not fear? The Lord GOD has spoken; who can but prophesy?",
      "links": "<a href='/AIV/24/20/9'>Jer. 20:9</a>; <a href='/AIV/44/4/20'>Acts 4:20</a>",
      "comment": "When God acts, witnesses respond. The overwhelming force of His word compels proclamation, foreshadowing the apostolic mandate for preaching."
    },
    {
      "pk": 3003009,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 9,
      "text": "Proclaim it in the strongholds of Ashdod and in the strongholds of Egypt, and say, 'Gather yourselves on the mountains of Samaria and see the great tumults within it and the oppressions in her midst.'",
      "links": "<a href='/AIV/26/23/23'>Ezek. 23:23</a>",
      "comment": "God calls Gentile nations as witnesses to Israel’s injustice—demonstrating accountability even for those chosen."
    },
    {
      "pk": 3003010,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 10,
      "text": "For they do not know how to do right, declares the LORD, those who store up violence and robbery in their strongholds.",
      "links": "<a href='/AIV/19/14/4'>Ps. 14:4</a>; <a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "Condemnation for injustice and corruption. Righteousness is inseparable from true worship, a theme continued in the New Testament for the Church."
    },
    {
      "pk": 3003011,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 11,
      "text": "Therefore, thus says the Lord GOD: 'An enemy shall surround the land and bring down your strength, and your strongholds shall be plundered.'",
      "links": "<a href='/AIV/23/39/3'>Isa. 39:3-6</a>; <a href='/AIV/30/2/14-16'>Amos 2:14-16</a>",
      "comment": "The judgment involves destruction of defenses, emphasizing utter vulnerability apart from God."
    },
    {
      "pk": 3003012,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 12,
      "text": "Thus says the LORD: 'As the shepherd rescues from the lion’s mouth two legs, or a piece of an ear, so shall the Israelites who live in Samaria be rescued, with only a corner of a bed or a piece of a couch.'",
      "links": "<a href='/AIV/9/17/34-35'>1 Sam. 17:34-35</a>; <a href='/AIV/19/22/21'>Ps. 22:21</a>",
      "comment": "The remnant imagery emphasizes how thorough the judgment is, but also the idea of a remnant, which plays into the theme of restoration in later prophecy."
    },
    {
      "pk": 3003013,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 13,
      "text": "Hear and testify against the house of Jacob, declares the Lord GOD, the God of hosts:",
      "links": "<a href='/AIV/30/2/6-8'>Amos 2:6-8</a>; <a href='/AIV/19/50/7'>Ps. 50:7</a>",
      "comment": "A call for witnesses underlines the gravity of sin and the need for public recognition and repentance."
    },
    {
      "pk": 3003014,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 14,
      "text": "On the day I punish Israel for her transgressions, I will also punish the altars of Bethel; the horns of the altar shall be cut off and fall to the ground.",
      "links": "<a href='/AIV/11/12/28-33'>1 Kings 12:28-33</a>; <a href='/AIV/26/6/6'>Ezek. 6:6</a>",
      "comment": "The destruction of the altars shows that false worship is subject to judgment. The reference to the altar’s horns highlights the loss of security and atonement outside divinely appointed worship—hinting at the necessity of true sacrifice and pure worship."
    },
    {
      "pk": 3003015,
      "translation": "AIV",
      "book": 30,
      "chapter": 3,
      "verse": 15,
      "text": "I will strike down the winter house together with the summer house, and the houses of ivory shall perish; the great houses shall come to an end, declares the LORD.",
      "links": "<a href='/AIV/11/22/39'>1 Kings 22:39</a>; <a href='/AIV/19/49/16-17'>Ps. 49:16-17</a>",
      "comment": "God promises to humble the proud and wealthy, exposing earthly security as fleeting. The theme of judgment on luxury points to scriptural calls to humility and detachment from worldly goods (<a href='/AIV/40/6/19-21'>Matt. 6:19-21</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:26:21.259Z"
}