{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 7,
  "verses": [
    {
      "pk": 21007001,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 1,
      "text": "This is what the Lord GOD showed me: He was forming swarms of locusts when the latter growth was just beginning to sprout—after the king’s harvest.",
      "links": "<a href='/AIV/2/10/4-5'>Ex. 10:4–5</a>, <a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Amos receives a vision of a coming judgment in the form of locusts, paralleling Exodus and Joel. The timing indicates God's judgment would devastate the land."
    },
    {
      "pk": 21007002,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 2,
      "text": "When the swarm had finished eating the grass of the land, I said, 'Lord GOD, please forgive! How can Jacob stand? He is so small!'",
      "links": "<a href='/AIV/19/106/23'>Ps. 106:23</a>, <a href='/AIV/26/9/8'>Ezek. 9:8</a>",
      "comment": "Amos intercedes for Israel, pleading for forgiveness. This is a pattern seen throughout Scripture—God’s people intercede for others, a foreshadowing of Christ’s priestly role."
    },
    {
      "pk": 21007003,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 3,
      "text": "The LORD relented concerning this. 'It shall not be,' said the LORD.",
      "links": "<a href='/AIV/19/106/45'>Ps. 106:45</a>, <a href='/AIV/32/3/10'>Jon. 3:10</a>",
      "comment": "God shows His mercy by relenting from judgment, echoing moments in Scripture when God’s compassion is moved by prayer and repentance."
    },
    {
      "pk": 21007004,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 4,
      "text": "This is what the Lord GOD showed me: He was calling for judgment by fire. It consumed the great deep and would have devoured the land.",
      "links": "<a href='/AIV/2/9/23'>Ex. 9:23</a>, <a href='/AIV/19/18/8'>Ps. 18:8</a>",
      "comment": "Another vision shows a fiery judgment consuming everything, recalling images of purification, as God’s justice consumes even the depths (see Matthew 3:11–12 for fire imagery as purification)."
    },
    {
      "pk": 21007005,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 5,
      "text": "Then I said, 'Lord GOD, please stop! How can Jacob stand? He is so small!'",
      "links": "<a href='/AIV/19/79/8'>Ps. 79:8</a>",
      "comment": "Amos again intercedes, appealing to God’s mercy for the sake of His people’s weakness, a theme recalled in Hebrews 4:15–16, where Christ intercedes for humanity."
    },
    {
      "pk": 21007006,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 6,
      "text": "The LORD relented concerning this again. 'This also shall not be,' said the Lord GOD.",
      "links": "<a href='/AIV/32/3/10'>Jon. 3:10</a>, <a href='/AIV/24/26/13'>Jer. 26:13</a>",
      "comment": "The Lord’s patience and willingness to respond to true intercession reveal His personal relationship with His people and readiness to show mercy."
    },
    {
      "pk": 21007007,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 7,
      "text": "This is what He showed me: The Lord was standing by a wall built with a plumb line, with a plumb line in His hand.",
      "links": "<a href='/AIV/23/28/17'>Isa. 28:17</a>, <a href='/AIV/12/21/13'>2 Kgs. 21:13</a>",
      "comment": "The plumb line represents the standard of God’s justice, reminiscent of imagery in Isaiah and Second Kings. God is the builder who examines His people by His perfect measure."
    },
    {
      "pk": 21007008,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 8,
      "text": "And the LORD said to me, 'Amos, what do you see?' And I said, 'A plumb line.' Then the Lord said, 'Behold, I am setting a plumb line in the midst of my people Israel; I will spare them no longer.'",
      "links": "<a href='/AIV/23/28/17'>Isa. 28:17</a>",
      "comment": "No longer postponing judgment, God is measuring Israel by His absolute justice. This is a turning point: the time for mercy passes when the standard is continually rejected."
    },
    {
      "pk": 21007009,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 9,
      "text": "'The high places of Isaac shall be made desolate, and the sanctuaries of Israel shall be laid waste, and I will rise against the house of Jeroboam with the sword.'",
      "links": "<a href='/AIV/11/12/31'>1 Kgs. 12:31</a>, <a href='/AIV/23/27/9'>Isa. 27:9</a>",
      "comment": "Idolatrous worship sites will be destroyed, and the house of the king will be judged, showing that God’s holiness requires judgment even of religious places."
    },
    {
      "pk": 21007010,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 10,
      "text": "Then Amaziah the priest of Bethel sent to Jeroboam king of Israel, saying, 'Amos has conspired against you in the midst of the house of Israel. The land cannot endure all his words.'",
      "links": "<a href='/AIV/11/12/29'>1 Kgs. 12:29</a>",
      "comment": "Amaziah accuses Amos before the king, demonstrating resistance of religious leaders to true prophetic messages (see Matthew 23:29–31 for similar opposition to prophets in the New Testament)."
    },
    {
      "pk": 21007011,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 11,
      "text": "'For thus Amos has said: ",
      "'By the sword Jeroboam shall die, and Israel must go into exile away from its land.": "<a href='/AIV/12/15/8-10'>2 Kgs. 15:8–10</a>, <a href='/AIV/28/10/5'>Hos. 10:5–6</a>",
      "comment": "The prophecy of exile is restated as threat. The theme of exile and restoration echoes throughout Scripture—fulfilled in the exile of Israel and spiritually fulfilled in the redemption brought by Christ."
    },
    {
      "pk": 21007012,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 12,
      "text": "And Amaziah said to Amos, 'O seer, go, flee away to the land of Judah and eat your bread there, and prophesy there,",
      "links": "<a href='/AIV/12/17/13'>2 Kgs. 17:13</a>",
      "comment": "Amaziah tries to drive Amos away, preferring not to hear God’s word. The rejection of prophets echoes the repeated resistance of God’s people, seen in the ministry of Jesus and his apostles."
    },
    {
      "pk": 21007013,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 13,
      "text": "'but never again prophesy at Bethel, for it is the king's sanctuary, and it is a royal house.'",
      "links": "<a href='/AIV/11/13/1'>1 Kgs. 13:1</a>",
      "comment": "Bethel, a site of corrupted worship, is regarded as royal property. This separation of true worship from political power hints at the importance of a pure, divinely-established authority in the worshipping community."
    },
    {
      "pk": 21007014,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 14,
      "text": "Then Amos answered and said to Amaziah, 'I was no prophet, nor was I a prophet's son, but I was a sheep breeder and a tender of sycamore figs.",
      "links": "<a href='/AIV/30/1/1'>Amos 1:1</a>, <a href='/AIV/9/16/11'>1 Sam. 16:11–12</a>",
      "comment": "Amos emphasizes his humble origins, similar to how other biblical figures (like David) were called from ordinary life, showing God’s initiative apart from human institutions."
    },
    {
      "pk": 21007015,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 15,
      "text": "But the LORD took me from tending the flock, and the LORD said to me, 'Go, prophesy to my people Israel.'",
      "links": "<a href='/AIV/9/16/12'>1 Sam. 16:12'>, <a href='/AIV/26/2/3'>Ezek. 2:3</a>",
      "comment": "The Lord’s direct, personal call is emphasized. God always initiates His mission, not merely through human tradition or qualification, but by His own will."
    },
    {
      "pk": 21007016,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 16,
      "text": "'Now therefore hear the word of the LORD: You say, ",
      "'Do not prophesy against Israel, and do not preach against the house of Isaac.": "<a href='/AIV/30/2/12'>Amos 2:12</a>",
      "comment": "Rejecting God’s word brings severe consequences, a warning repeated by Christ (cf. Luke 10:16). True authority rests on obedience to God’s word, not on position or tradition alone."
    },
    {
      "pk": 21007017,
      "translation": "AIV",
      "book": 30,
      "chapter": 7,
      "verse": 17,
      "text": "Therefore, this is what the LORD says: 'Your wife will become a prostitute in the city, your sons and daughters will fall by the sword, your land will be divided by measuring line, and you yourself will die in an unclean land. Israel shall surely go into exile away from its land.'",
      "links": "<a href='/AIV/24/6/12'>Jer. 6:12</a>, <a href='/AIV/26/23/46'>Ezek. 23:46</a>, <a href='/AIV/28/9/3'>Hos. 9:3</a>",
      "comment": "A severe judgment falls on Amaziah—public shame, family destruction, and loss of land—highlighting the consequences of resisting God’s chosen ones (cf. John 15:20). The exile previews the ultimate separation from blessing that only true repentance and faith can restore."
    }
  ],
  "translatedAt": "2025-12-23T07:27:59.188Z"
}