{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 1,
  "verses": [
    {
      "pk": 4101001,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 1,
      "text": "The words of Amos, who was among the shepherds of Tekoa, which he saw concerning Israel in the days of Uzziah king of Judah and in the days of Jeroboam son of Joash, king of Israel, two years before the earthquake.",
      "links": "<a href='/AIV/14/26/1'>2 Chron. 26:1</a>; <a href='/AIV/12/14/23'>2 Kings 14:23</a>",
      "comment": "Amos introduces himself as a shepherd, emphasizing his humble background. The reference to the earthquake marks this prophecy in a historical period. Shepherd imagery carries throughout Scripture, anticipating Christ as the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 4101002,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 2,
      "text": "He said: 'The LORD roars from Zion and lifts his voice from Jerusalem; the pastures of the shepherds mourn, and the top of Carmel dries up.'",
      "links": "<a href='/AIV/29/3/16'>Joel 3:16</a>; <a href='/AIV/19/50/2-3'>Ps. 50:2-3</a>",
      "comment": "The Lord speaking from Zion points to God's central authority established in Jerusalem. The imagery of God 'roaring' is a theme of divine judgment. Jerusalem as the place where God’s presence dwells foreshadows the fullness revealed in the New Covenant (<a href='/AIV/58/12/22'>Heb. 12:22-24</a>)."
    },
    {
      "pk": 4101003,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 3,
      "text": "Thus says the LORD: 'For three transgressions of Damascus, and for four, I will not revoke punishment, because they threshed Gilead with iron sledges.'",
      "links": "<a href='/AIV/23/8/4'>Isa. 8:4</a>; <a href='/AIV/24/49/23'>Jer. 49:23-27</a>",
      "comment": "The phrase 'for three transgressions, and for four' indicates a fullness and abundance of sin. Damascus, representing Syria, is condemned for their violence. The use of ‘iron sledges’ underscores brutality. This pattern of judgment mirrors God’s justice, ultimately completed in Christ, who absorbs wrath for sin on the Cross (<a href='/AIV/45/3/25'>Rom. 3:25</a>)."
    },
    {
      "pk": 4101004,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 4,
      "text": "'So I will send fire on the house of Hazael, and it shall devour the fortresses of Ben-hadad.'",
      "links": "<a href='/AIV/12/8/12'>2 Kings 8:12</a>; <a href='/AIV/24/49/27'>Jer. 49:27</a>",
      "comment": "God's judgment through fire symbolizes purification and destruction of evil. The emphasis on Hazael and Ben-hadad’s houses highlights the targeting of corrupt dynasties. Fire is repeated as both judgment and, elsewhere, a sign of God’s presence (see <a href='/AIV/2/3/2'>Ex. 3:2</a>), symbolizing divine action to sanctify and purify."
    },
    {
      "pk": 4101005,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 5,
      "text": "'I will break the gate of Damascus and cut off the inhabitant from the Valley of Aven, and the one who holds the scepter from Beth-eden; and the people of Syria shall go into exile to Kir,' says the LORD.",
      "links": "<a href='/AIV/12/16/9'>2 Kings 16:9</a>; <a href='/AIV/24/49/23-27'>Jer. 49:23-27</a>",
      "comment": "Exile as punishment appears throughout Scripture, echoing the expulsion from Eden (<a href='/AIV/1/3/23-24'>Gen. 3:23-24</a>). The breaking of oppressive power prepares the way for God’s righteous reign."
    },
    {
      "pk": 4101006,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 6,
      "text": "Thus says the LORD: 'For three transgressions of Gaza, and for four, I will not revoke punishment, because they carried into exile a whole people to deliver them up to Edom.'",
      "links": "<a href='/AIV/24/47/1'>Jer. 47:1</a>; <a href='/AIV/26/25/15'>Ezek. 25:15-17</a>",
      "comment": "Gaza, representative of Philistia, is judged for injustice and enslavement. This condemnation of targeting and selling entire populations foreshadows the dignity of the human person in redemption through Christ (<a href='/AIV/48/3/28'>Gal. 3:28</a>)."
    },
    {
      "pk": 4101007,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 7,
      "text": "'So I will send fire upon the wall of Gaza, and it shall devour her fortresses.'",
      "links": "<a href='/AIV/7/16/21'>Judg. 16:21-30</a>; <a href='/AIV/24/47/5'>Jer. 47:5</a>",
      "comment": "Destructive fire as judgment again points to the purification necessary before reconciliation with God. This motif foreshadows the cleansing of the world through the ultimate offering of Christ (<a href='/AIV/58/9/13-14'>Heb. 9:13-14</a>)."
    },
    {
      "pk": 4101008,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 8,
      "text": "'And I will cut off the inhabitant from Ashdod, and the one who holds the scepter from Ashkelon; I will turn my hand against Ekron, and the remnant of the Philistines shall perish,' says the LORD God.",
      "links": "<a href='/AIV/24/47/5-7'>Jer. 47:5-7</a>; <a href='/AIV/26/25/15-17'>Ezek. 25:15-17</a>",
      "comment": "The removal of rulers and destruction of Philistine centers shows God’s power over nations and establishing His sovereignty. Spiritually, it points toward Christ, who delivers all nations from sin and brings unity through faith (<a href='/AIV/51/1/20'>Col. 1:20</a>)."
    },
    {
      "pk": 4101009,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 9,
      "text": "Thus says the LORD: 'For three transgressions of Tyre, and for four, I will not revoke punishment, because they delivered up a whole people to Edom and did not remember the covenant of brotherhood.'",
      "links": "<a href='/AIV/24/25/22'>Jer. 25:22</a>; <a href='/AIV/26/26/2'>Ezek. 26:2</a>",
      "comment": "The broken 'covenant of brotherhood' emphasizes the importance of covenants and bonds between peoples, with powerful spiritual echoes of God’s covenant fidelity. Those who violate covenant are judged, highlighting the New Covenant’s fulfillment in Christ, who establishes a new brotherhood in Himself (<a href='/AIV/46/11/25'>1 Cor. 11:25</a>)."
    },
    {
      "pk": 4101010,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 10,
      "text": "'So I will send fire upon the wall of Tyre, and it shall devour her fortresses.'",
      "links": "<a href='/AIV/26/28/18'>Ezek. 28:18</a>",
      "comment": "Continued repetition of fiery judgment on cities signals the ultimate justice of God, and the need for spiritual purification before entering into God's presence in glory (<a href='/AIV/66/21/27'>Rev. 21:27</a>)."
    },
    {
      "pk": 4101011,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 11,
      "text": "Thus says the LORD: 'For three transgressions of Edom, and for four, I will not revoke punishment, because he pursued his brother with the sword and cast off all pity. His anger tore perpetually, and he kept his wrath forever.'",
      "links": "<a href='/AIV/01/25/23'>Gen. 25:23</a>; <a href='/AIV/31/1/10-14'>Obad. 1:10-14</a>",
      "comment": "Edom, descendant of Esau, is judged for fratricide and relentless anger. The spiritual implication is the tragic division of kin cut off from mercy, countered ultimately by Christ who reconciles all humanity and calls for forgiveness (<a href='/AIV/40/6/14'>Matt. 6:14</a>)."
    },
    {
      "pk": 4101012,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 12,
      "text": "'So I will send fire upon Teman, and it shall devour the fortresses of Bozrah.'",
      "links": "<a href='/AIV/24/49/20-22'>Jer. 49:20-22</a>; <a href='/AIV/23/34/6'>Isa. 34:6</a>",
      "comment": "Teman and Bozrah, key cities in Edom, are destroyed for their role in violence. This displays God’s impartiality in justice, and the need for sinners to seek repentance and restoration—a theme central to the later Gospel invitation."
    },
    {
      "pk": 4101013,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 13,
      "text": "Thus says the LORD: 'For three transgressions of the Ammonites, and for four, I will not revoke punishment, because they ripped open pregnant women in Gilead, that they might enlarge their border.'",
      "links": "<a href='/AIV/12/8/12'>2 Kings 8:12</a>; <a href='/AIV/24/49/1-6'>Jer. 49:1-6</a>",
      "comment": "Ammon’s horrific acts highlight the depravity of unchecked sin. The horror of violence against innocents echoes the innocence found in Christ Himself, who is victim and redeemer (<a href='/AIV/23/53/7'>Isa. 53:7</a>), calling believers to value life in all circumstances."
    },
    {
      "pk": 4101014,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 14,
      "text": "'So I will kindle a fire in the wall of Rabbah, and it shall devour her fortresses, with shouting on the day of battle, with a tempest in the day of the whirlwind.'",
      "links": "<a href='/AIV/24/49/2'>Jer. 49:2</a>; <a href='/AIV/26/21/28'>Ezek. 21:28</a>",
      "comment": "Rabbah, the Ammonite capital, is judged through tumultuous and irreversible devastation. The day of whirlwind recalls apocalyptic imagery fulfilled in the coming judgment and victory of Christ (<a href='/AIV/40/24/27'>Matt. 24:27</a>)."
    },
    {
      "pk": 4101015,
      "translation": "AIV",
      "book": 30,
      "chapter": 1,
      "verse": 15,
      "text": "'And their king shall go into exile, he and his princes together,' says the LORD.",
      "links": "<a href='/AIV/24/49/3'>Jer. 49:3</a>; <a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>",
      "comment": "The exile of kings and princes signals the end of human pride and power—reminding all that God alone is sovereign, and ultimately, true kingship is revealed in Christ as the humble and exalted King (<a href='/AIV/41/15/2'>Mark 15:2</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:25:44.288Z"
}