{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 4,
  "verses": [
    {
      "pk": 37004001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 1,
      "text": "Hear this word, you cows of Bashan who are on the mountain of Samaria, you who oppress the poor, crush the needy, and say to your husbands, 'Bring us something to drink.'",
      "links": "<a href='/AIV/19/22/12'>Ps. 22:12</a>; <a href='/AIV/30/3/9'>Amos 3:9</a>",
      "comment": "The women of Samaria are rebuked for luxury and oppression. The word 'cows of Bashan' is figurative for wealthy women who indulge at the expense of the poor. This calls to mind the importance of both justice and mercy, reminiscent of Mary's Magnificat (<a href='/AIV/42/1/52-53'>Luke 1:52-53</a>), where God opposes the proud but lifts up the lowly."
    },
    {
      "pk": 37004002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 2,
      "text": "The Lord God has sworn by His holiness: 'Indeed, the days are coming upon you when they will take you away with hooks, even the last of you with fishhooks.'",
      "links": "<a href='/AIV/30/6/8'>Amos 6:8</a>; <a href='/AIV/24/16/16'>Jer. 16:16</a>",
      "comment": "God's holiness is emphasized as the basis for judgment. The invaders will lead Israel away like fish caught by hooks—a vivid image of exile. The warning echoes God's unwavering commitment to justice, as seen also in <a href='/AIV/02/34/7'>Exod. 34:7</a>."
    },
    {
      "pk": 37004003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 3,
      "text": "You will go out through broken walls, each one straight ahead, and you will be cast out toward Harmon,' declares the Lord.",
      "links": "<a href='/AIV/12/10/32-33'>2 Kgs. 10:32-33</a>",
      "comment": "The image of escaping through breaches in the wall signifies defeat and shame (see <a href='/AIV/24/39/2'>Jer. 39:2</a>). The reference to 'Harmon' may be a location or a word indicating disposal. Israel's pride will be broken by God's judgment."
    },
    {
      "pk": 37004004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 4,
      "text": "'Go to Bethel and transgress, to Gilgal and multiply transgression; bring your sacrifices every morning, your tithes every three days.'",
      "links": "<a href='/AIV/09/15/22'>1 Sam. 15:22</a>; <a href='/AIV/28/8/11'>Hos. 8:11</a>",
      "comment": "This is irony: God mocks their religious activity that lacks true devotion. Even frequent sacrifices mean nothing without obedience (cf. <a href='/AIV/09/15/22'>1 Sam. 15:22</a>). The cycle of sacrifice anticipates the need for a true, once-for-all sacrifice, fulfilled in Christ (<a href='/AIV/58/10/10'>Heb. 10:10</a>)."
    },
    {
      "pk": 37004005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 5,
      "text": "Offer a thank offering of leavened bread, and proclaim freewill offerings, publish them; for so you love to do, O people of Israel!' declares the Lord God.",
      "links": "<a href='/AIV/03/7/13'>Lev. 7:13</a>; <a href='/AIV/24/6/20'>Jer. 6:20</a>",
      "comment": "Israel's noisy public worship is exposed as empty ritual. The prophet underlines how devotion requires sincerity of heart, not mere outward ceremonies. God desires worship in spirit and truth (<a href='/AIV/43/4/23'>John 4:23</a>)."
    },
    {
      "pk": 37004006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 6,
      "text": "'I gave you empty stomachs in all your cities, and lack of bread in all your places, yet you did not return to Me,' declares the Lord.",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>; <a href='/AIV/23/9/13'>Isa. 9:13</a>",
      "comment": "God's discipline—hunger—was meant to turn Israel back. Yet they did not repent. This highlights the call for ongoing conversion, not merely a one-time acknowledgment. Repentance is a continual turning to God's grace."
    },
    {
      "pk": 37004007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 7,
      "text": "'I also withheld rain from you when the harvest was still three months away. I caused rain to fall on one city but not on another; one field had rain, the other withered.'",
      "links": "<a href='/AIV/11/17/1'>1 Kgs. 17:1</a>; <a href='/AIV/26/14/13'>Ezek. 14:13</a>",
      "comment": "The selective drought is a sign of God's sovereignty over nature and His people's fates. This recalls God's control in the Exodus (see <a href='/AIV/02/9/23-26'>Exod. 9:23-26</a>). These signs are meant as calls to repentance and communion with God."
    },
    {
      "pk": 37004008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 8,
      "text": "So two or three cities staggered to another city to drink water, but were not satisfied; yet you did not return to Me,' declares the Lord.",
      "links": "<a href='/AIV/24/14/3'>Jer. 14:3</a>",
      "comment": "The frustration of physical thirst points to spiritual thirst. God alone satisfies our deepest needs (<a href='/AIV/19/63/1'>Ps. 63:1</a>). This prepares for Christ's invitation to the living water (<a href='/AIV/43/4/14'>John 4:14</a>)."
    },
    {
      "pk": 37004009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 9,
      "text": "'I struck you with blight and mildew; your many gardens and vineyards, your fig trees and olive trees the locust devoured; yet you did not return to Me,' declares the Lord.",
      "links": "<a href='/AIV/05/28/22'>Deut. 28:22</a>; <a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Crop failures and plague were covenant warnings. These signs recall the call to faithfulness. The pattern of discipline and opportunity to repent echoes the Lord's patience and desire for all to return to Him."
    },
    {
      "pk": 37004010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 10,
      "text": "'I sent among you a plague in the manner of Egypt; I slew your young men with the sword, together with your captured horses. I made the stench of your camp rise even to your nostrils; yet you did not return to Me,' declares the Lord.",
      "links": "<a href='/AIV/02/12/29-30'>Exod. 12:29-30</a>; <a href='/AIV/05/28/60'>Deut. 28:60</a>",
      "comment": "The plagues evoke the memory of Egypt and the need to heed God's warnings. The repeated refrain urges the people toward true repentance, not just regret for suffering."
    },
    {
      "pk": 37004011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 11,
      "text": "'I overthrew some of you, as when God overthrew Sodom and Gomorrah, and you were like a firebrand plucked from the burning; yet you did not return to Me,' declares the Lord.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/65/1/23'>Jude 1:23</a>",
      "comment": "The reference to Sodom and Gomorrah is a sobering warning of total judgment. The phrase 'firebrand plucked from the burning' also appears in <a href='/AIV/38/3/2'>Zech. 3:2</a> and <a href='/AIV/65/1/23'>Jude 1:23</a>, signifying rescue from wrath—a foreshadowing of the salvation available in Christ."
    },
    {
      "pk": 37004012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 12,
      "text": "'Therefore thus I will do to you, O Israel; because I will do this to you, prepare to meet your God, O Israel!'",
      "links": "<a href='/AIV/02/19/17'>Exod. 19:17</a>; <a href='/AIV/58/12/29'>Heb. 12:29</a>",
      "comment": "'Prepare to meet your God' is both a threat and a mercy—a final summons to repentance. Compare with the 'Day of the Lord' theme throughout Scripture (<a href='/AIV/23/13/6'>Isa. 13:6</a>). The motif anticipates New Testament teaching on judgment and readiness (<a href='/AIV/40/25/13'>Matt. 25:13</a>)."
    },
    {
      "pk": 37004013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 4,
      "verse": 13,
      "text": "For behold, He who forms the mountains and creates the wind, who declares to man what His thought is, who turns dawn to darkness and treads on the high places of the earth—the Lord, the God of hosts, is His name.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/23/40/12'>Isa. 40:12</a>",
      "comment": "Amos closes with a hymn-like ascription to God as Creator and Ruler—a reminder of divine majesty. This encourages reverent awe before God. In Christ, the fullness of this revelation is seen (<a href='/AIV/43/1/3'>John 1:3</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:42:55.654Z"
}