{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 5,
  "verses": [
    {
      "pk": 37005001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 1,
      "text": "Hear this word that I take up over you in lamentation, O house of Israel:",
      "links": "<a href='/AIV/31/1/1'>Obad. 1:1</a>; <a href='/AIV/24/9/10'>Jer. 9:10</a>",
      "comment": "Amos begins this section with a prophetic lamentation, signaling the seriousness of Israel’s condition, echoing prophetic traditions of mourning over the people (cf. Jeremiah 9)."
    },
    {
      "pk": 37005002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 2,
      "text": "\"Fallen, no more to rise, is the virgin Israel; forsaken on her land, with no one to raise her up.\"",
      "links": "<a href='/AIV/24/31/4'>Jer. 31:4</a>; <a href='/AIV/23/47/1'>Isa. 47:1</a>",
      "comment": "The phrase 'virgin Israel' highlights God's intended purity for His people; their fall indicates a profound loss. Yet the language hints at future restoration (Jer. 31:4), suggesting the enduring mercy of God’s covenant."
    },
    {
      "pk": 37005003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 3,
      "text": "For thus says the Lord GOD: \"The city that went out a thousand shall have a hundred left, and that which went out a hundred shall have ten left to the house of Israel.\"",
      "links": "<a href='/AIV/03/26/36-39'>Lev. 26:36-39</a>; <a href='/AIV/23/6/13'>Isa. 6:13</a>",
      "comment": "This proportional judgment echoes covenant curses (Lev. 26), calling Israel to recognize divine justice amid disaster, yet ten and a hundred remaining suggest a faithful remnant."
    },
    {
      "pk": 37005004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 4,
      "text": "For thus says the LORD to the house of Israel: \"Seek me and live;\"",
      "links": "<a href='/AIV/29/2/12'>Joel 2:12</a>; <a href='/AIV/23/55/6'>Isa. 55:6</a>",
      "comment": "God’s invitation is gracious—life is found in truly seeking Him, not just in ritual observance, anticipating later teachings of conversion of heart (Joel 2:12; Isa. 55:6)."
    },
    {
      "pk": 37005005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 5,
      "text": "\"But do not seek Bethel, and do not enter into Gilgal, or cross over to Beersheba; for Gilgal shall surely go into exile, and Bethel shall come to nothing.\"",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>; <a href='/AIV/01/28/19'>Gen. 28:19</a>",
      "comment": "Religious sites like Bethel, Gilgal, and Beersheba, once holy, have become associated with empty ritual. God desires authentic worship, an early foreshadow of worship 'in spirit and truth' (John 4:23)."
    },
    {
      "pk": 37005006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 6,
      "text": "\"Seek the LORD and live, lest he break out like fire in the house of Joseph, and consume, with none to quench it for Bethel,\"",
      "links": "<a href='/AIV/19/80/2'>Ps. 80:2</a>; <a href='/AIV/23/9/19'>Isa. 9:19</a>",
      "comment": "Again, the call is to authentic relationship, with a warning: God's judgment is compared to consuming fire, anticipating later imagery of divine judgment and purification (cf. 1 Cor. 3:13-15)."
    },
    {
      "pk": 37005007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 7,
      "text": "O you who turn justice into wormwood and cast righteousness down to the earth!",
      "links": "<a href='/AIV/20/21/7'>Prov. 21:7</a>; <a href='/AIV/23/59/14'>Isa. 59:14</a>",
      "comment": "The perversion of justice and righteousness condemns Israel. Justice and charity are central to God’s demands, echoing the future requirements for Christ’s followers (cf. Matthew 25:35-40)."
    },
    {
      "pk": 37005008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 8,
      "text": "He who made the Pleiades and Orion, who turns deep darkness into morning and darkens the day into night, who calls for the waters of the sea and pours them out upon the surface of the earth— the LORD is his name;",
      "links": "<a href='/AIV/18/9/9'>Job 9:9</a>; <a href='/AIV/19/104/20'>Ps. 104:20</a>",
      "comment": "God’s sovereignty over creation is declared. The cosmic authority links to the Creator’s power, anticipating Christ as the Lord of all creation (Colossians 1:16)."
    },
    {
      "pk": 37005009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 9,
      "text": "who makes destruction flash forth against the strong, so that destruction comes upon the fortress.",
      "links": "<a href='/AIV/18/12/21'>Job 12:21</a>; <a href='/AIV/23/25/12'>Isa. 25:12</a>",
      "comment": "God is impartial: even the strong and powerful are subject to His justice. Earthly power is fleeting before God’s might."
    },
    {
      "pk": 37005010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 10,
      "text": "They hate him who reproves in the gate, and they abhor him who speaks the truth.",
      "links": "<a href='/AIV/20/9/7-8'>Prov. 9:7-8</a>; <a href='/AIV/43/7/7'>John 7:7</a>",
      "comment": "The rejection of just criticism echoes the world’s response to the prophets and ultimately to Christ Himself, who was rejected for truth-telling (John 7:7)."
    },
    {
      "pk": 37005011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 11,
      "text": "Therefore, because you trample on the poor and exact taxes of grain from him, you have built houses of hewn stone, but you shall not dwell in them; you have planted pleasant vineyards, but you shall not drink their wine.",
      "links": "<a href='/AIV/05/28/30-33'>Deut. 28:30-33</a>; <a href='/AIV/23/65/21-22'>Isa. 65:21-22</a>",
      "comment": "Unjust gain leads to loss of blessings, reiterating the curse/blessing motif of the law (Deut. 28). The treatment of the poor is central to God’s judgment."
    },
    {
      "pk": 37005012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 12,
      "text": "For I know how many are your transgressions and how great are your sins— you who afflict the righteous, who take bribes, and turn aside the needy in the gate.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/02/23/8'>Ex. 23:8</a>",
      "comment": "Corruption and injustice expose Israel’s need for repentance and deeper conversion. God’s omniscience ensures nothing is hidden."
    },
    {
      "pk": 37005013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 13,
      "text": "Therefore he who is prudent will keep silent in such a time, for it is an evil time.",
      "links": "<a href='/AIV/19/39/2'>Ps. 39:2</a>",
      "comment": "In times of deep corruption, prudence sometimes means silence—recognizing when words will have no effect."
    },
    {
      "pk": 37005014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 14,
      "text": "\"Seek good, and not evil, that you may live; and so the LORD, the God of hosts, will be with you, as you have said.\"",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "God calls for a holistic pursuit of goodness, not just external piety. God’s presence is conditioned by conversion of life, foreshadowing the Gospel’s call to righteousness."
    },
    {
      "pk": 37005015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 15,
      "text": "\"Hate evil, and love good, and establish justice in the gate; it may be that the LORD, the God of hosts, will be gracious to the remnant of Joseph.\"",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>; <a href='/AIV/23/1/17'>Isa. 1:17</a>",
      "comment": "Active pursuit of justice is inseparable from faith. The 'remnant' theme points to God preserving a faithful people amid judgment, which finds fulfillment in New Testament promises (Rom. 11:5)."
    },
    {
      "pk": 37005016,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 16,
      "text": "Therefore thus says the LORD, the God of hosts, the Lord: \"In all the squares there shall be wailing, and in all the streets they shall say, 'Alas! Alas!' They shall call the farmers to mourning and to wailing those skilled in lamentation.\"",
      "links": "<a href='/AIV/24/9/17'>Jer. 9:17</a>; <a href='/AIV/29/1/13'>Joel 1:13</a>",
      "comment": "The universal mourning described shows the scope of coming judgment; inviting even farmers and professionals in lamentation. The need for both exterior and interior expressions of repentance is emphasized."
    },
    {
      "pk": 37005017,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 17,
      "text": "\"And in all vineyards there shall be wailing, for I will pass through your midst,\" says the LORD.",
      "links": "<a href='/AIV/02/12/12'>Ex. 12:12</a>",
      "comment": "God’s personal visitation in judgment echoes the Passover (Ex. 12:12), but here as punitive rather than protective."
    },
    {
      "pk": 37005018,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 18,
      "text": "Woe to you who desire the day of the LORD! Why would you have the day of the LORD? It is darkness, and not light;",
      "links": "<a href='/AIV/29/2/1-2'>Joel 2:1-2</a>; <a href='/AIV/23/13/9'>Isa. 13:9</a>",
      "comment": "The Day of the LORD is not automatically favorable for all—mere association with God’s people does not guarantee blessing. This foreshadows Christian warnings about presumption versus true faith (cf. Matthew 7:21-23)."
    },
    {
      "pk": 37005019,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 19,
      "text": "as if a man fled from a lion, and a bear met him, or went into the house and leaned his hand against the wall, and a serpent bit him.",
      "links": "<a href='/AIV/24/48/44'>Jer. 48:44</a>",
      "comment": "The inevitability of judgment is graphically depicted—there is no escape outside of sincere conversion, underscoring God’s perfect justice."
    },
    {
      "pk": 37005020,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 20,
      "text": "Is not the day of the LORD darkness, and not light, and gloom with no brightness in it?",
      "links": "<a href='/AIV/29/2/2'>Joel 2:2</a>",
      "comment": "The unexpected nature of the Day of the LORD warns against complacency and hollow religion."
    },
    {
      "pk": 37005021,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 21,
      "text": "\"I hate, I despise your feasts, and I take no delight in your solemn assemblies.\"",
      "links": "<a href='/AIV/23/1/13-14'>Isa. 1:13-14</a>",
      "comment": "God rejects mere ritual without heart conversion. Sacrifice and worship must be joined to justice and faith (see also Isaiah 1, Matthew 9:13)."
    },
    {
      "pk": 37005022,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 22,
      "text": "\"Even though you offer me your burnt offerings and grain offerings, I will not accept them; and the peace offerings of your fattened animals, I will not look upon them.\"",
      "links": "<a href='/AIV/28/6/6'>Hos. 6:6</a>; <a href='/AIV/19/51/16-17'>Ps. 51:16-17</a>",
      "comment": "Offering sacrifices without a contrite heart lacks true value. This underscores the proper preparation and inward disposition required for worship."
    },
    {
      "pk": 37005023,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 23,
      "text": "\"Take away from me the noise of your songs; to the melody of your harps I will not listen.\"",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Even beautiful music is empty if not united with a sincere heart. True worship must harmonize external and internal devotion."
    },
    {
      "pk": 37005024,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 24,
      "text": "But let justice roll down like waters, and righteousness like an ever-flowing stream.",
      "links": "<a href='/AIV/23/48/18'>Isa. 48:18</a>; <a href='/AIV/33/6/8'>Mic. 6:8</a>",
      "comment": "The most pleasing offering is a life of justice and righteousness. This verse becomes a rallying cry for authentic faith and works together."
    },
    {
      "pk": 37005025,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 25,
      "text": "\"Did you bring me sacrifices and offerings during the forty years in the wilderness, O house of Israel?\"",
      "links": "<a href='/AIV/44/7/42-43'>Acts 7:42-43</a>",
      "comment": "Amos challenges Israel to reflect on the true nature of worship during the Exodus. This verse is later cited by Stephen (Acts 7) to underscore the need for a deeper spiritual worship."
    },
    {
      "pk": 37005026,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 26,
      "text": "You shall take up Sakkuth your king and Kaiwan your star-god—your images that you made for yourselves;",
      "links": "<a href='/AIV/44/7/43'>Acts 7:43</a>",
      "comment": "Israel is rebuked for adopting false worship alongside worship of the true God. The judgment pronouncement emphasizes undivided devotion, calling to mind the Church’s later insistence on exclusive fidelity."
    },
    {
      "pk": 37005027,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 5,
      "verse": 27,
      "text": "\"and I will send you into exile beyond Damascus,\" says the LORD, whose name is the God of hosts.",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/23/39/3'>Isa. 39:3</a>",
      "comment": "The prophecy of exile is fulfilled with the Assyrian captivity (2 Kings 17). Yet exile is not the end of the story—God continues to work through a remnant, preparing the way for a restored people and ultimately the coming of Christ."
    }
  ],
  "translatedAt": "2025-12-24T09:43:31.402Z"
}