{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 1,
  "verses": [
    {
      "pk": 37001001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 1,
      "text": "The words of Amos, who was among the shepherds of Tekoa, which he saw concerning Israel in the days of Uzziah king of Judah and in the days of Jeroboam son of Joash, king of Israel, two years before the earthquake.",
      "links": "<a href='/AIV/14/26/1'>2 Chron. 26:1</a>; <a href='/AIV/12/14/23'>2 Kings 14:23</a>; <a href='/AIV/38/14/5'>Zech. 14:5</a>",
      "comment": "Amos identifies his humble background and roots his prophecy in specific historical kings. The earthquake mentioned here is also referenced in Zechariah 14:5, adding historical weight. The prophetic tradition often includes prophets from ordinary backgrounds, hinting that God calls whom He wills, often choosing shepherds and simple people to speak on His behalf (1 Sam. 16:11)."
    },
    {
      "pk": 37001002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 2,
      "text": "He said: 'The LORD roars from Zion, and raises His voice from Jerusalem; the pastures of the shepherds wither, and the top of Carmel dries up.'",
      "links": "<a href='/AIV/29/3/16'>Joel 3:16</a>; <a href='/AIV/19/46/6'>Ps. 46:6</a>",
      "comment": "The image of the LORD roaring from Zion emphasizes God's supreme authority and judgment issuing from Jerusalem, the center of worship (see Joel 3:16). The drying of Carmel signifies judgment upon plenty and fruitfulness. The prophecy begins with a focus on the sacred place chosen by God, from which His true teaching and authority flow. There are spiritual senses suggesting judgment against all false worship, exalting the centrality of Jerusalem."
    },
    {
      "pk": 37001003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 3,
      "text": "This is what the LORD says: 'For three transgressions of Damascus, and for four, I will not turn back its punishment, because they have threshed Gilead with iron sledges.'",
      "links": "<a href='/AIV/23/8/4'>Isa. 8:4</a>; <a href='/AIV/24/49/23'>Jer. 49:23</a>",
      "comment": "'Three...even four' is a formula indicating repeated and overflowing sin. Damascus, representative of Syria, is judged for cruelty, specifically their harsh treatment of Gilead. Historically, this refers to the ruthless warfare of Syria (2 Kings 10:32-33). The iron sledges symbolize brutal oppression."
    },
    {
      "pk": 37001004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 4,
      "text": "So I will send fire upon the house of Hazael, and it will consume the palaces of Ben-Hadad.",
      "links": "<a href='/AIV/12/13/3'>2 Kings 13:3</a>; <a href='/AIV/24/49/27'>Jer. 49:27</a>",
      "comment": "The fire represents divine judgment and destruction upon the ruling dynasty of Syria. God acts directly to judge the nations, not only Israel, showing His universal authority. This fire can be understood both literally (conquest) and spiritually (divine purification)."
    },
    {
      "pk": 37001005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 5,
      "text": "I will break the gate-bar of Damascus, and cut off the inhabitants from the Valley of Aven, and the one who holds the scepter from Beth Eden; and the people of Aram shall go into exile to Kir,' says the LORD.",
      "links": "<a href='/AIV/12/16/9'>2 Kings 16:9</a>; <a href='/AIV/30/9/7'>Amos 9:7</a>",
      "comment": "The breaking of the gate-bar signifies the city's vulnerability. The exile to Kir was fulfilled when Tiglath-Pileser III exiled the Arameans (2 Kings 16:9). This prophecy shows God's sovereignty over the rise and fall of nations and empires, echoing the theme that God humbles the proud."
    },
    {
      "pk": 37001006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 6,
      "text": "This is what the LORD says: 'For three transgressions of Gaza, and for four, I will not turn back its punishment, because they carried whole communities into exile, handing them over to Edom.'",
      "links": "<a href='/AIV/24/47/1'>Jer. 47:1</a>; <a href='/AIV/26/25/15'>Ezek. 25:15</a>",
      "comment": "Gaza, a major Philistine city, is condemned for slave trading—depoting Israelites and selling them to Edom. This offense against the dignity of persons is heavily judged. The spiritual sense underlines the importance of charity and justice toward the vulnerable, echoing Jesus' teaching (Matt. 25:40)."
    },
    {
      "pk": 37001007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 7,
      "text": "So I will send fire upon the wall of Gaza, and it will consume her palaces.",
      "links": "<a href='/AIV/36/2/4'>Zeph. 2:4</a>",
      "comment": "Again, fire symbolizes judgment; the fire will consume their strongholds. The prophetic imagery of fire recurs in connection with divine retribution, as seen in later apocalyptic passages (e.g., Matt. 13:40-42)."
    },
    {
      "pk": 37001008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 8,
      "text": "I will cut off the inhabitants from Ashdod, and the one who holds the scepter from Ashkelon; I will turn My hand against Ekron, and the remnant of the Philistines shall perish,' says the Lord GOD.",
      "links": "<a href='/AIV/24/47/5'>Jer. 47:5</a>; <a href='/AIV/36/2/4-5'>Zeph. 2:4-5</a>",
      "comment": "Four main cities of Philistia are condemned. Each is judged for their part in violence and oppression. 'Turn My hand against' echoes God's direct action and power. In the spiritual sense, the 'remnant perishing' signals the end of rebellion and opposition to God's chosen order."
    },
    {
      "pk": 37001009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 9,
      "text": "This is what the LORD says: 'For three transgressions of Tyre, and for four, I will not turn back its punishment, because they delivered entire communities of captives to Edom, and did not remember the covenant of brothers.'",
      "links": "<a href='/AIV/26/26/2'>Ezek. 26:2</a>; <a href='/AIV/29/3/4'>Joel 3:4-6</a>",
      "comment": "Tyre is judged for breaking a 'covenant of brothers,' likely a treaty with Israel, and participating in the slave trade. The moral violation is compounded by betrayal of kinship ties—reflecting the grave consequences of covenant infidelity, a theme that anticipates the New Covenant. See also Joel 3:4-6."
    },
    {
      "pk": 37001010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 10,
      "text": "So I will send fire upon the wall of Tyre, and it will consume her palaces.",
      "links": "<a href='/AIV/26/28/18'>Ezek. 28:18</a>",
      "comment": "Tyre's great wealth and strongholds could not save her from divine judgment. The prophecy is fulfilled in Nebuchadnezzar's and later Alexander's conquests. The fire points to God's justice over all nations, not just Israel."
    },
    {
      "pk": 37001011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 11,
      "text": "This is what the LORD says: 'For three transgressions of Edom, and for four, I will not turn back its punishment, because he pursued his brother with the sword, cast off all compassion, maintained his anger continually, and kept his rage forever.'",
      "links": "<a href='/AIV/31/1/10-11'>Obad. 10-11</a>; <a href='/AIV/19/137/7'>Ps. 137:7</a>",
      "comment": "Edom's relentless hostility toward his 'brother'—a reference to Esau (Edom) and Jacob (Israel)—is judged as persistent and merciless hatred. The refusal to forgive and the perpetuation of rage is condemned; God’s law holds all people to the standard of mercy and reconciliation (Matt. 5:7, 18:21-22)."
    },
    {
      "pk": 37001012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 12,
      "text": "So I will send fire upon Teman, and it will consume the palaces of Bozrah.",
      "links": "<a href='/AIV/24/49/20-22'>Jer. 49:20-22</a>",
      "comment": "Teman and Bozrah were principal cities of Edom. Divine judgment again appears as fire—God purifies and judges even those considered strong and secure. Prophetic warnings highlight the universal reach of God’s justice."
    },
    {
      "pk": 37001013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 13,
      "text": "This is what the LORD says: 'For three transgressions of the Ammonites, and for four, I will not turn back its punishment, because they ripped open pregnant women in Gilead, that they might enlarge their border.'",
      "links": "<a href='/AIV/12/15/16'>2 Kings 15:16</a>; <a href='/AIV/24/49/1'>Jer. 49:1</a>",
      "comment": "Ammon is condemned for extreme cruelty in war. This grave offense against life is especially condemned in biblical tradition. Echoes of the evil condemned here are found in later Christian emphasis on the inviolable dignity of every human person from conception."
    },
    {
      "pk": 37001014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 14,
      "text": "So I will set fire to the wall of Rabbah, and it will consume her palaces, with shouting on the day of battle, with a storm on the day of the whirlwind.",
      "links": "<a href='/AIV/24/49/2'>Jer. 49:2</a>",
      "comment": "Rabbah, the capital of Ammon, is promised destruction. The chaos described—shouting, storm, whirlwind—emphasizes devastating judgment. The pattern of judgment reiterates both literal and spiritual consequences for grave injustice."
    },
    {
      "pk": 37001015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 1,
      "verse": 15,
      "text": "And their king will go into exile, he and his officials together,' says the LORD.",
      "links": "<a href='/AIV/24/49/3'>Jer. 49:3</a>",
      "comment": "The king and his officials represent the earthly headship of Ammon, now subject to God's authority and judgment. Just as nations suffer when their rulers fail, so true spiritual order is emphasized—pointing ahead to Christ as the true King whose kingdom endures forever (Luke 1:33; Rev. 11:15)."
    }
  ],
  "translatedAt": "2025-12-24T09:41:44.768Z"
}