{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 6,
  "verses": [
    {
      "pk": 1450060,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 1,
      "text": "Woe to those who are at ease in Zion, and to those who feel secure on the mountain of Samaria, the notable ones of the first of the nations, to whom the house of Israel comes!",
      "links": "<a href='/AIV/23/32/9'>Isa. 32:9</a>; <a href='/AIV/30/3/9'>Amos 3:9</a>",
      "comment": "The term 'at ease in Zion' rebukes the leaders of Israel and Judah for self-confidence while ignoring moral decay—'Zion' alludes to the spiritual center of God's people. There is an implied warning against presumption of spiritual privilege."
    },
    {
      "pk": 1450061,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 2,
      "text": "Pass over to Calneh and see, and from there go to Hamath the great, then go down to Gath of the Philistines—are you better than these kingdoms? Or is their territory greater than your territory?",
      "links": "<a href='/AIV/23/10/9'>Isa. 10:9</a>; <a href='/AIV/24/49/23'>Jer. 49:23</a>",
      "comment": "Amos lists Calneh, Hamath, and Gath as warnings; these once-powerful cities were destroyed due to arrogance. The message: even the chosen people are not immune to judgment if they forsake God's commands."
    },
    {
      "pk": 1450062,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 3,
      "text": "You put far away the day of disaster and bring near the seat of violence.",
      "links": "<a href='/AIV/30/9/10'>Amos 9:10</a>; <a href='/AIV/23/5/19'>Isa. 5:19</a>",
      "comment": "People postpone thoughts of judgment but through their actions hasten iniquity. There is a nod toward accountability: judgment eventually comes to all God's household, making this text relevant for believers who presume safety apart from obedience."
    },
    {
      "pk": 1450063,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 4,
      "text": "You lie on beds of ivory and lounge on your couches, eating lambs from the flock and calves from the midst of the stall;",
      "links": "<a href='/AIV/30/3/15'>Amos 3:15</a>; <a href='/AIV/26/16/49'>Ezek. 16:49</a>",
      "comment": "Ivory beds and luxury foods symbolize complacency and self-indulgence. A spiritual reading: true security is found not in prosperity but in covenant faithfulness and living sacrificially as Christ taught."
    },
    {
      "pk": 1450064,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 5,
      "text": "who sing idle songs to the sound of the harp; like David they invent for themselves instruments of music;",
      "links": "<a href='/AIV/19/150/3'>Ps. 150:3</a>; <a href='/AIV/13/23/5'>1 Chr. 23:5</a>",
      "comment": "Amos critiques using music for entertainment rather than worship—David used instruments for God's glory. Genuine worship must be directed upward, not self-indulgently inward. This subtly points to the necessity of ordered worship anchored in tradition."
    },
    {
      "pk": 1450065,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 6,
      "text": "who drink wine in bowls and anoint themselves with the finest oils, but are not grieved over the ruin of Joseph!",
      "links": "<a href='/AIV/23/22/13'>Isa. 22:13</a>; <a href='/AIV/24/8/21'>Jer. 8:21</a>",
      "comment": "'Joseph' here stands for Israel. Their lack of mourning for spiritual and social decline is a call for penitence—anticipating Christ’s beatitude: 'Blessed are those who mourn, for they shall be comforted.' (<a href='/AIV/40/5/4'>Matt. 5:4</a>)"
    },
    {
      "pk": 1450066,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 7,
      "text": "Therefore they shall now be the first to go into exile, and the revelry of those who lounge shall pass away.",
      "links": "<a href='/AIV/23/5/13'>Isa. 5:13</a>; <a href='/AIV/30/7/11'>Amos 7:11</a>",
      "comment": "The first in privilege will be the first in judgment if they forsake mercy and justice. There is a typological warning about the responsibility that comes with being part of God’s chosen assembly."
    },
    {
      "pk": 1450067,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 8,
      "text": "The Lord GOD has sworn by himself, declares the LORD, the God of hosts: 'I abhor the pride of Jacob and hate his strongholds, and I will deliver up the city and all that is in it.'",
      "links": "<a href='/AIV/30/4/2'>Amos 4:2</a>; <a href='/AIV/24/12/7'>Jer. 12:7</a>",
      "comment": "'God of hosts' reveals divine authority. God's abhorrence of pride is fulfilled ultimately in Christ's humility—even cities of strength cannot stand apart from God's grace."
    },
    {
      "pk": 1450068,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 9,
      "text": "And if ten men remain in one house, they shall die.",
      "links": "<a href='/AIV/26/9/6'>Ezek. 9:6</a>; <a href='/AIV/30/5/3'>Amos 5:3</a>",
      "comment": "Symbolizes the totality of judgment; even small remnants will not escape. This foreshadows the idea that outside God's covenant and grace, none can stand (see <a href='/AIV/45/3/23'>Rom. 3:23</a>)."
    },
    {
      "pk": 1450069,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 10,
      "text": "And when one's relative, he who burns the dead, shall take up the body to bring the bones out of the house, and shall say to someone in the innermost parts of the house, 'Is anyone else with you?' and he shall say, 'No one.' Then he shall say, 'Silence! We must not mention the name of the LORD.'",
      "links": "<a href='/AIV/26/39/14'>Ezek. 39:14</a>; <a href='/AIV/03/10/6'>Lev. 10:6</a>",
      "comment": "The prohibition to invoke God's name highlights the seriousness of judgment, echoing a reverent fear and awe due to God, similar to the solemn liturgies and traditions in worship."
    },
    {
      "pk": 1450070,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 11,
      "text": "For behold, the LORD commands, and the great house will be struck down into fragments, and the little house into pieces.",
      "links": "<a href='/AIV/23/29/19'>Isa. 29:19</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Both great and small suffer when the Lord decrees judgment. No one is exempt on account of status. Spiritually, the passage points to the need for unity and foundation upon God’s revealed order."
    },
    {
      "pk": 1450071,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 12,
      "text": "Do horses run on rocks? Does one plow the sea with oxen? But you have turned justice into poison and the fruit of righteousness into wormwood—",
      "links": "<a href='/AIV/05/32/32'>Deut. 32:32</a>; <a href='/AIV/30/5/7'>Amos 5:7</a>",
      "comment": "Obvious absurdities illustrate Israel’s distortion of justice. The contrast here prefigures Christ’s call to embody true righteousness, not merely external observance."
    },
    {
      "pk": 1450072,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 13,
      "text": "you who rejoice in Lo-debar, who say, 'Have we not taken Karnaim for ourselves by our own strength?'",
      "links": "<a href='/AIV/10/8/6'>2 Sam. 8:6</a>; <a href='/AIV/30/2/10'>Amos 2:10</a>",
      "comment": "Boasting is condemned; Israel puts their trust in their own victories. The biblical theme is that all victory comes from God, not human power—fulfilled in Christ, who conquers through humility."
    },
    {
      "pk": 1450073,
      "translation": "AIV",
      "book": 30,
      "chapter": 6,
      "verse": 14,
      "text": "'For behold, I will raise up a nation against you, O house of Israel,' declares the LORD, the God of hosts; 'and they shall oppress you from Lebo-hamath to the Brook of the Arabah.'",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/07/20/1'>Judg. 20:1</a>",
      "comment": "The coming oppressor is a consequence of covenant unfaithfulness. This foreshadows the biblical theme of exile and restoration, ultimately fulfilled through Christ restoring God's people into unity and truth."
    }
  ],
  "translatedAt": "2025-12-23T07:27:37.908Z"
}