{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 5,
  "verses": [
    {
      "pk": 3050501,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 1,
      "text": "Hear this word that I take up against you, a lamentation, O house of Israel:",
      "links": "<a href='/AIV/24/7/29'>Jer. 7:29</a>; <a href='/AIV/25/1/1'>Lam. 1:1</a>",
      "comment": "The word 'lamentation' signifies a prophetic dirge; it conveys the gravity of Israel's coming judgment. The language anticipates later lamentations over Jerusalem."
    },
    {
      "pk": 3050502,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 2,
      "text": "The virgin Israel has fallen; she will rise no more. She lies forsaken on her own land, with none to raise her up.",
      "links": "<a href='/AIV/23/47/1'>Isa. 47:1</a>; <a href='/AIV/25/2/8'>Lam. 2:8-10</a>",
      "comment": "'Virgin Israel' is an ironic phrase—once pure, but now fallen. This typology is picked up spiritually in the New Testament understanding of the Church as the Bride of Christ (2 Cor. 11:2; Rev. 21:9)."
    },
    {
      "pk": 3050503,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 3,
      "text": "For thus says the Lord GOD: 'The city that went out a thousand shall have a hundred left, and that which went out a hundred shall have ten left, to the house of Israel.'",
      "links": "<a href='/AIV/03/26/36'>Lev. 26:36-39</a>; <a href='/AIV/05/28/62'>Deut. 28:62</a>",
      "comment": "A prophecy of drastic reduction—judgment will leave only a remnant. This theme of the faithful remnant can be seen throughout Scripture (Rom. 9:27)."
    },
    {
      "pk": 3050504,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 4,
      "text": "For thus says the LORD to the house of Israel: 'Seek Me and live,'",
      "links": "<a href='/AIV/23/55/6'>Isa. 55:6</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "Repentance and seeking God are directly tied to life. Spiritual life begins with sincerely seeking God, and is fulfilled in Christ's invitation (Matt. 7:7)."
    },
    {
      "pk": 3050505,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 5,
      "text": "But do not seek Bethel, nor enter into Gilgal, nor cross over to Beersheba; for Gilgal shall surely go into exile, and Bethel shall come to nothing.",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>; <a href='/AIV/09/8/2'>1 Sam. 8:2'</a>",
      "comment": "Israel is warned not to seek God through ritualistic places or mere tradition. Genuine worship is not tied solely to physical locations, foreshadowing Jesus' teaching in John 4:21-24."
    },
    {
      "pk": 3050506,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 6,
      "text": "Seek the LORD and live, lest he break out like fire in the house of Joseph, and it devour, with none to quench it for Bethel.",
      "links": "<a href='/AIV/23/31/9'>Isa. 31:9</a>; <a href='/AIV/25/2/3'>Lam. 2:3</a>",
      "comment": "Again, seeking God sincerely is essential for life. The 'house of Joseph' represents the northern kingdom, and fire as judgment appears throughout biblical prophecy."
    },
    {
      "pk": 3050507,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 7,
      "text": "You who turn justice into bitterness and cast righteousness down to the earth!",
      "links": "<a href='/AIV/23/59/14'>Isa. 59:14</a>; <a href='/AIV/33/3/9'>Mic. 3:9</a>",
      "comment": "Justice and righteousness are among Israel's key failures. True religion produces both: harmony with God and neighbor—a theme also central in the Gospels (Matt. 23:23)."
    },
    {
      "pk": 3050508,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 8,
      "text": "He who made the Pleiades and Orion, who turns deep darkness into morning, and makes the day dark as night, who calls forth the waters of the sea and pours them out on the surface of the earth—the LORD is his name.",
      "links": "<a href='/AIV/01/1/1-10'>Gen. 1:1-10</a>; <a href='/AIV/18/38/31'>Job 38:31</a>",
      "comment": "God is sovereign Creator, governing the cosmos as well as history. Echoes of Genesis affirm God's power, controlling both creation and judgment. This high view of God underpins Christological understanding (John 1:3)."
    },
    {
      "pk": 3050509,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 9,
      "text": "Who brings sudden destruction upon the strong, so that destruction comes upon the fortress.",
      "links": "<a href='/AIV/01/11/4-8'>Gen. 11:4-8</a>; <a href='/AIV/19/147/6'>Ps. 147:6</a>",
      "comment": "No human strength or fortress can endure against God's judgment. This humbles earthly powers—a consistent biblical theme."
    },
    {
      "pk": 3050510,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 10,
      "text": "They hate him who reproves in the gate and abhor him who speaks the truth.",
      "links": "<a href='/AIV/11/22/8'>1 Kings 22:8</a>; <a href='/AIV/40/23/31-37'>Matt. 23:31-37</a>",
      "comment": "The 'gate' was the seat of justice. Hatred for truth-tellers prefigures the rejection of prophets and ultimately Christ (Matt. 23:29-37)."
    },
    {
      "pk": 3050511,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 11,
      "text": "Therefore, because you trample on the poor and take from him taxes of grain, though you have built houses of hewn stone, you shall not dwell in them; though you have planted pleasant vineyards, you shall not drink their wine.",
      "links": "<a href='/AIV/05/28/30-39'>Deut. 28:30-39</a>; <a href='/AIV/23/5/8'>Isa. 5:8</a>",
      "comment": "Violation of social justice leads to curses listed by Moses, evoking covenantal punishment (Deut. 28). Care for the poor remains a continuous call for God's people."
    },
    {
      "pk": 3050512,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 12,
      "text": "For I know your many transgressions and your great sins: you afflict the righteous, take bribes, and turn aside the needy in the gate.",
      "links": "<a href='/AIV/05/16/19'>Deut. 16:19</a>; <a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "Injustice against the righteous and the poor marks Israel’s deep moral failure. Social justice is integral to faithful religion (James 1:27)."
    },
    {
      "pk": 3050513,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 13,
      "text": "Therefore, at such a time the prudent will keep silent, for it is an evil time.",
      "links": "<a href='/AIV/19/39/1-2'>Ps. 39:1-2</a>",
      "comment": "At times, silence is wisdom in the face of overwhelming evil. Jesus Himself was silent before His accusers (Isa. 53:7; Matt. 27:14)."
    },
    {
      "pk": 3050514,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 14,
      "text": "Seek good, and not evil, that you may live; so the LORD, the God of hosts, will be with you, as you have said.",
      "links": "<a href='/AIV/05/30/15'>Deut. 30:15-16</a>; <a href='/AIV/24/7/23'>Jer. 7:23</a>",
      "comment": "The life offered is both temporal and spiritual. Obedience invites the presence of God, ultimately fulfilled in Christ's promise (John 14:23)."
    },
    {
      "pk": 3050515,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 15,
      "text": "Hate evil, and love good, and establish justice in the gate. It may be that the LORD, the God of hosts, will be gracious to the remnant of Joseph.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>; <a href='/AIV/45/11/5'>Rom. 11:5</a>",
      "comment": "Religious devotion is inseparable from moral action. The language of 'remnant' will become crucial for later theological interpretation (Rom. 11:5)."
    },
    {
      "pk": 3050516,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 16,
      "text": "Therefore thus says the LORD, the God of hosts, the Lord: 'In all the squares there shall be wailing, and in all the streets they shall say, “Alas! Alas!” They shall call the farmer to mourning, and to wailing those skilled in lamentation.",
      "links": "<a href='/AIV/24/9/17-22'>Jer. 9:17-22</a>; <a href='/AIV/38/12/10-12'>Zech. 12:10-12</a>",
      "comment": "The universal mourning reflects corporate judgment. Professional mourners (cf. Matt. 9:23) were common in ancient cultures."
    },
    {
      "pk": 3050517,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 17,
      "text": "And in all vineyards there shall be wailing, for I will pass through your midst,' says the LORD.",
      "links": "<a href='/AIV/02/12/12'>Ex. 12:12'</a>; <a href='/AIV/18/18/7'>Job 18:7'</a>",
      "comment": "Echoes the language of the Exodus Passover (Ex. 12:12), but here God passes through in judgment, not deliverance."
    },
    {
      "pk": 3050518,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 18,
      "text": "Woe to you who desire the day of the LORD! Why would you have the day of the LORD? It is darkness, and not light;",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>; <a href='/AIV/30/8/9'>Amos 8:9</a>",
      "comment": "The 'day of the LORD' is not necessarily salvation, but can mean devastating judgment on those unprepared."
    },
    {
      "pk": 3050519,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 19,
      "text": "As if a man fled from a lion, and a bear met him, or went into the house and leaned his hand against the wall, and a snake bit him.",
      "links": "<a href='/AIV/23/24/18'>Isa. 24:18</a>",
      "comment": "No escape from God's judgment for the unrepentant. The imagery conveys inescapable disaster."
    },
    {
      "pk": 3050520,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 20,
      "text": "Is not the day of the LORD darkness, and not light, even gloom with no brightness in it?",
      "links": "<a href='/AIV/36/1/15'>Zeph. 1:15</a>; <a href='/AIV/40/24/29'>Matt. 24:29</a>",
      "comment": "A severe warning: God’s coming judgment is fearsome unless one is ready. Spiritual preparation is necessary."
    },
    {
      "pk": 3050521,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 21,
      "text": "'I hate, I despise your festivals, and I take no delight in your solemn assemblies.'",
      "links": "<a href='/AIV/23/1/13-14'>Isa. 1:13-14</a>; <a href='/AIV/40/15/7-9'>Matt. 15:7-9</a>",
      "comment": "Mere outward worship, apart from justice and righteousness, is worthless to God. True worship unites faith and works."
    },
    {
      "pk": 3050522,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 22,
      "text": "Even though you offer me your burnt offerings and grain offerings, I will not accept them; nor will I regard the peace offerings of your fattened animals.",
      "links": "<a href='/AIV/19/51/16-17'>Ps. 51:16-17</a>; <a href='/AIV/23/66/3-4'>Isa. 66:3-4</a>",
      "comment": "God desires sincere hearts, not ritual without repentance. This anticipates the New Testament's emphasis on inner conversion."
    },
    {
      "pk": 3050523,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 23,
      "text": "Take away from me the noise of your songs! I will not listen to the melody of your harps.",
      "links": "<a href='/AIV/19/137/3-4'>Ps. 137:3-4</a>; <a href='/AIV/24/7/21-23'>Jer. 7:21-23</a>",
      "comment": "Music and song are empty without just living and love for God. True liturgy involves both worship and moral living."
    },
    {
      "pk": 3050524,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 24,
      "text": "But let justice roll down like waters, and righteousness like an ever-flowing stream.",
      "links": "<a href='/AIV/23/48/18'>Isa. 48:18</a>; <a href='/AIV/19/72/7'>Ps. 72:7</a>",
      "comment": "This famous verse appeals for an abundance of justice and righteousness—hallmarks of divine worship and authentic faith (Matt. 23:23)."
    },
    {
      "pk": 3050525,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 25,
      "text": "Did you bring me sacrifices and offerings in the wilderness forty years, O house of Israel?",
      "links": "<a href='/AIV/44/7/42'>Acts 7:42-43</a>; <a href='/AIV/05/32/17'>Deut. 32:17</a>",
      "comment": "God questions whether outward ritual without inward faith was ever truly practiced during Israel's wanderings. See Stephen’s speech in Acts 7."
    },
    {
      "pk": 3050526,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 26,
      "text": "You shall carry Sikkuth your king and Kiyyun your images, the star-god of your gods, which you made for yourselves.",
      "links": "<a href='/AIV/44/7/43'>Acts 7:43</a>",
      "comment": "'Sikkuth' and 'Kiyyun' are foreign idols, possibly referencing Moloch and Rephan. Idolatry at the heart of worship is condemned (see also Acts 7:43)."
    },
    {
      "pk": 3050527,
      "translation": "AIV",
      "book": 30,
      "chapter": 5,
      "verse": 27,
      "text": "Therefore I will send you into exile beyond Damascus,' says the LORD, whose name is the God of hosts.",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/05/29/28'>Deut. 29:28</a>",
      "comment": "God sovereignly sends Israel into exile, a judgment for persistent idolatry. Exile prefigures both judgment and, ultimately, hope for restoration (see Ezekiel 37)."
    }
  ],
  "translatedAt": "2025-12-23T07:27:18.917Z"
}