{
  "book": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 9,
  "verses": [
    {
      "pk": 1933090,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 1,
      "text": "I saw the Lord standing beside the altar, and he said: 'Strike the tops of the pillars so that the thresholds shake, and shatter them on the heads of all the people. Those who are left I will kill with the sword; not one of them shall escape, not one shall survive.'",
      "links": "<a href='/AIV/23/6/1'>Isa. 6:1</a>; <a href='/AIV/11/19/50'>1 Kgs. 19:50</a>",
      "comment": "The vision of the Lord at the altar recalls His sovereign authority and ability to judge, reminiscent of temple imagery throughout the prophets. The destruction is complete, conveying there is no escape from divine judgment (compare Amos 5:18-20)."
    },
    {
      "pk": 1933091,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 2,
      "text": "If they dig into Sheol, from there my hand will take them; if they climb up to heaven, from there I will bring them down.",
      "links": "<a href='/AIV/19/139/8'>Ps. 139:8</a>; <a href='/AIV/23/14/13'>Isa. 14:13-15</a>",
      "comment": "This verse references God's omnipresence and inescapable power, echoing Psalm 139:8. Whether death or the heights of heaven, no one can hide from the Lord."
    },
    {
      "pk": 1933092,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 3,
      "text": "If they hide themselves on the top of Carmel, there I will search them out and take them; and if they hide from my sight at the bottom of the sea, there I will command the serpent, and it shall bite them.",
      "links": "<a href='/AIV/19/139/9-10'>Ps. 139:9-10</a>; <a href='/AIV/18/26/13'>Job 26:13</a>",
      "comment": "Carmel symbolizes strength and sanctuary, yet even in the safest places, God's judgment is not hindered. The sea serpent (possibly a reference to Leviathan) represents unstoppable danger even in the depths."
    },
    {
      "pk": 1933093,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 4,
      "text": "And if they go into captivity before their enemies, there I will command the sword, and it shall kill them; and I will set my eyes upon them for evil and not for good.",
      "links": "<a href='/AIV/24/44/11'>Jer. 44:11</a>; <a href='/AIV/26/5/11'>Ezek. 5:11-12</a>",
      "comment": "God's 'eyes for evil' is a reversal of his covenant blessings (Num. 6:24-26); punishment pursues the unfaithful even into exile. This prepares the way for restoration when God's face shines again (see v.11-15)."
    },
    {
      "pk": 1933094,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 5,
      "text": "The Lord, God of hosts—he who touches the earth, and it melts, and all who live in it mourn, and all of it rises like the Nile and sinks again, like the Nile of Egypt—",
      "links": "<a href='/AIV/19/46/6'>Ps. 46:6</a>; <a href='/AIV/30/8/8'>Amos 8:8</a>",
      "comment": "God’s sovereign power to judge is displayed in the earth’s trembling and the imagery of the Nile rising and sinking, symbolizing unstoppable upheaval (Amos 8:8)."
    },
    {
      "pk": 1933095,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 6,
      "text": "who builds his upper chambers in the heavens and founds his vault upon the earth; who calls for the waters of the sea and pours them out upon the face of the earth—the Lord is his name.",
      "links": "<a href='/AIV/30/4/13'>Amos 4:13</a>; <a href='/AIV/19/104/3'>Ps. 104:3</a>",
      "comment": "References God’s creative authority over heaven and earth. As in Genesis 1, his word commands even the waters above and below. The title 'the Lord is his name' recalls the unique covenant identity of God."
    },
    {
      "pk": 1933096,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 7,
      "text": "Are you not like the Cushites to me, O people of Israel?' says the Lord. 'Did I not bring up Israel from the land of Egypt, and the Philistines from Caphtor, and the Arameans from Kir?'",
      "links": "<a href='/AIV/19/87/4'>Ps. 87:4</a>; <a href='/AIV/24/47/4'>Jer. 47:4</a>",
      "comment": "God shows his sovereignty over all nations; his choosing of Israel is by grace, not due to merit. This challenges exclusive nationalism but also prepares for the ingrafting of all peoples into God’s plan (see Romans 11)."
    },
    {
      "pk": 1933097,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 8,
      "text": "'Behold, the eyes of the Lord God are upon the sinful kingdom, and I will destroy it from the face of the earth; except that I will not utterly destroy the house of Jacob,' declares the Lord.",
      "links": "<a href='/AIV/24/30/11'>Jer. 30:11</a>; <a href='/AIV/26/6/8'>Ezek. 6:8</a>",
      "comment": "Even in judgment, restoration is promised—a remnant will remain. This is a central theme of both exile and restoration in scripture."
    },
    {
      "pk": 1933098,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 9,
      "text": "For behold, I will command, and shake the house of Israel among all the nations as one shakes with a sieve, yet not the least kernel shall fall to the ground.",
      "links": "<a href='/AIV/19/125/3'>Ps. 125:3</a>; <a href='/AIV/42/22/31'>Luke 22:31</a>",
      "comment": "God’s judgment is precise. The imagery of sifting relates to separating faithful from the unfaithful, an anticipation of both temporal and final judgment (cf. Luke 22:31; Matt. 3:12)."
    },
    {
      "pk": 1933099,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 10,
      "text": "All the sinners of my people shall die by the sword, those who say, ‘Disaster shall not overtake or meet us.’",
      "links": "<a href='/AIV/24/5/12-13'>Jer. 5:12-13</a>; <a href='/AIV/30/6/3'>Amos 6:3</a>",
      "comment": "Those who presume on safety without repentance face judgment. The consequence for stubborn refusal of God’s warnings is separation from his promises."
    },
    {
      "pk": 1933100,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 11,
      "text": "'In that day I will raise up the fallen tent of David, and repair its breaches, and raise up its ruins, and rebuild it as in the days of old,'",
      "links": "<a href='/AIV/44/15/16-17'>Acts 15:16-17</a>; <a href='/AIV/23/16/5'>Isa. 16:5</a>",
      "comment": "A prophecy of the restoration of the Davidic kingdom, fulfilled in the coming Messiah. In Acts 15:16-17, this is applied to the inclusion of all nations into the one Church through Christ. The image of the ‘tent/booth’ also recalls the tabernacle and the dwelling presence of God among his people—a high christological theme."
    },
    {
      "pk": 1933101,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 12,
      "text": "so that they may possess the remnant of Edom and all the nations who are called by my name,' declares the Lord who does this.",
      "links": "<a href='/AIV/44/15/17'>Acts 15:17</a>; <a href='/AIV/23/54/3'>Isa. 54:3</a>",
      "comment": "Here is the expansion of God’s kingdom to include the Gentiles ('all the nations who are called by my name'), fulfilled in Christ and the spread of the Gospel (see Ephesians 2:11-22)."
    },
    {
      "pk": 1933102,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 13,
      "text": "'Behold, the days are coming,' declares the Lord, 'when the plowman shall overtake the reaper, and the treader of grapes him who sows the seed; the mountains shall drip with sweet wine, and all the hills shall flow with it.'",
      "links": "<a href='/AIV/29/3/18'>Joel 3:18</a>; <a href='/AIV/24/31/12'>Jer. 31:12</a>",
      "comment": "An image of abundance—a reversal of curse, fulfillment of promise. Agricultural metaphors symbolize eschatological renewal and joy, ultimately realized in the new covenant’s blessings."
    },
    {
      "pk": 1933103,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 14,
      "text": "'I will restore the fortunes of my people Israel, and they shall rebuild the ruined cities and live in them; they shall plant vineyards and drink their wine, and they shall make gardens and eat their fruit.'",
      "links": "<a href='/AIV/26/36/33-36'>Ezek. 36:33-36</a>; <a href='/AIV/24/32/42-44'>Jer. 32:42-44</a>",
      "comment": "Restoration includes both spiritual and material blessings, with echoes of the promised land and Eden-like restoration. God’s people are not only forgiven but established, with sacramental images of wine and fruit possibly foreshadowing the Eucharist."
    },
    {
      "pk": 1933104,
      "translation": "AIV",
      "book": 30,
      "chapter": 9,
      "verse": 15,
      "text": "'I will plant them upon their land, and they shall never again be uprooted from the land that I have given them,' says the Lord your God.",
      "links": "<a href='/AIV/24/24/6'>Jer. 24:6</a>; <a href='/AIV/26/37/25'>Ezek. 37:25</a>",
      "comment": "Final security and permanence are promised: God's people are planted by Him, never to be uprooted. This is fulfilled most fully through Christ's kingdom, where the faithful have an everlasting inheritance (see 1 Peter 1:4)."
    }
  ],
  "translatedAt": "2025-12-23T07:28:44.251Z"
}