{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 33,
  "verses": [
    {
      "pk": 14033001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 1,
      "text": "Manasseh was twelve years old when he began to reign, and he reigned in Jerusalem for fifty-five years.",
      "links": "<a href='/AIV/12/21/1'>2 Kings 21:1</a>",
      "comment": "Manasseh had one of the longest reigns of any king in Judah, beginning his rule at a very young age."
    },
    {
      "pk": 14033002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 2,
      "text": "He did what was evil in the sight of the LORD, according to the abominations of the nations whom the LORD had driven out before the people of Israel.",
      "links": "<a href='/AIV/12/21/2'>2 Kings 21:2</a>; <a href='/AIV/03/18/24-30'>Lev. 18:24-30</a>",
      "comment": "Manasseh's reign begins with idolatry and practices adopted from pagan nations, in direct violation of God's law."
    },
    {
      "pk": 14033003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 3,
      "text": "He rebuilt the high places that his father Hezekiah had torn down, and he raised up altars to the Baals and made Asherah poles, and bowed down to all the host of heaven and served them.",
      "links": "<a href='/AIV/14/31/1'>2Chr 31:1</a>; <a href='/AIV/12/21/3'>2 Kings 21:3</a>; <a href='/AIV/07/2/11-13'>Judges 2:11-13</a>",
      "comment": "Restoring idolatrous sites reversed his father's reforms. Worship of Baal and heavenly bodies was strictly forbidden (Deut. 4:19), highlighting deep spiritual decline."
    },
    {
      "pk": 14033004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 4,
      "text": "He built altars in the house of the LORD, where the LORD had said, 'My name will be in Jerusalem forever.'",
      "links": "<a href='/AIV/11/9/3'>1 Kings 9:3</a>; <a href='/AIV/05/12/11'>Deut. 12:11</a>",
      "comment": "Placing foreign altars in God’s temple showed direct contempt for God's unique dwelling and presence."
    },
    {
      "pk": 14033005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 5,
      "text": "He built altars for all the host of heaven in the two courts of the house of the LORD.",
      "links": "<a href='/AIV/12/21/5'>2 Kings 21:5</a>",
      "comment": "The idol worship even penetrated the sacred spaces, reflecting the severity of spiritual corruption under Manasseh."
    },
    {
      "pk": 14033006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 6,
      "text": "He burned his sons as an offering in the Valley of Hinnom, practiced fortune-telling, omens, sorcery, and consulted mediums and spiritists. He did much evil in the LORD's sight, provoking him to anger.",
      "links": "<a href='/AIV/12/21/6'>2 Kings 21:6</a>; <a href='/AIV/03/18/21'>Lev. 18:21</a>; <a href='/AIV/05/18/10-14'>Deut. 18:10-14</a>",
      "comment": "Child sacrifice and occult practices show the extent of apostasy. Hinnom became associated with judgment (see also Mark 9:43), which hints at later teachings on the consequences of grave sin."
    },
    {
      "pk": 14033007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 7,
      "text": "He set a carved image, the idol he had made, in the house of God, of which God had said to David and to Solomon his son, 'In this house, and in Jerusalem, which I have chosen from all the tribes of Israel, I will set my name forever.'",
      "links": "<a href='/AIV/11/9/3'>1 Kings 9:3</a>; <a href='/AIV/14/6/6'>2Chr 6:6</a>",
      "comment": "God’s exclusive claim on the temple is an early hint towards the concept of sacred space and the importance of right worship, which has deep implications in later Christian worship traditions."
    },
    {
      "pk": 14033008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 8,
      "text": "'I will never again remove the feet of Israel from the land I appointed for your ancestors, if only they will diligently do all that I have commanded them—all the laws, statutes, and judgments given through Moses.'",
      "links": "<a href='/AIV/05/28/1-14'>Deut. 28:1-14</a>; <a href='/AIV/14/7/19-22'>2Chr 7:19-22</a>",
      "comment": "God’s covenant blessings are always conditional on obedience, foreshadowing the New Covenant, where love and obedience remain central (John 14:15)."
    },
    {
      "pk": 14033009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 9,
      "text": "But Manasseh led Judah and the inhabitants of Jerusalem astray, to do more evil than the nations whom the LORD had destroyed before the Israelites.",
      "links": "<a href='/AIV/12/21/9'>2 Kings 21:9</a>",
      "comment": "The king’s personal sin leads the entire nation astray, showing the responsibility and influence of spiritual leadership—a theme that echoes into the New Testament understanding of authority and unity of worship."
    },
    {
      "pk": 14033010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 10,
      "text": "The LORD spoke to Manasseh and his people, but they paid no attention.",
      "links": "",
      "comment": "Despite warnings, the people refused to listen. God’s persistent call to repentance is a pattern seen through Scripture, fulfilled ultimately in Christ’s merciful call (Matthew 4:17)."
    },
    {
      "pk": 14033011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 11,
      "text": "So the LORD brought against them the commanders of the army of the king of Assyria, who captured Manasseh with hooks, bound him in bronze chains, and took him to Babylon.",
      "links": "<a href='/AIV/12/21/14'>2 Kings 21:14</a>",
      "comment": "Divine judgment comes as exile to Babylon. In the wider biblical story, exile often foreshadows spiritual separation, and restoration comes through repentance and return to God."
    },
    {
      "pk": 14033012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 12,
      "text": "When he was in distress, he sought the favor of the LORD his God and humbled himself greatly before the God of his ancestors.",
      "links": "",
      "comment": "Manasseh's humility and repentance, even after severe sin, is a powerful reminder of God’s endless mercy for those who truly repent (see Luke 15:11-32)."
    },
    {
      "pk": 14033013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 13,
      "text": "He prayed to Him, and God was moved by his plea and listened to his prayer. So He brought Manasseh back to Jerusalem and to his kingdom. Then Manasseh knew that the LORD is God.",
      "links": "<a href='/AIV/19/34/4-6'>Ps. 34:4-6</a>; <a href='/AIV/23/55/6-7'>Isa. 55:6-7</a>",
      "comment": "God’s response to repentance illustrates divine mercy and the restoration that follows sincere conversion, reflecting the spiritual principle of reconciliation stressed throughout Scripture."
    },
    {
      "pk": 14033014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 14,
      "text": "Afterward, he rebuilt the outer wall of the city of David, west of Gihon in the valley, to the entrance of the Fish Gate, and around the Ophel. He made it very high. He also placed military commanders in all the fortified cities of Judah.",
      "links": "<a href='/AIV/16/3/3'>Neh. 3:3</a>",
      "comment": "Manasseh’s practical reforms following repentance also show how true interior conversion leads to positive external action and protection for God’s people."
    },
    {
      "pk": 14033015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 15,
      "text": "He removed the foreign gods and the idol from the house of the LORD, as well as all the altars he had built on the mountain of the house of the LORD and in Jerusalem, and he cast them outside the city.",
      "links": "",
      "comment": "He cleansed the temple and city, restoring true worship. The pattern of removing false worship and returning to God’s presence is mirrored in Christian liturgy and discipline, emphasizing purity in worship."
    },
    {
      "pk": 14033016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 16,
      "text": "He restored the altar of the LORD, and offered on it sacrifices of fellowship and thanksgiving, and commanded Judah to serve the LORD, the God of Israel.",
      "links": "",
      "comment": "Restoration of right sacrifice is the climax of Manasseh’s repentance. The centrality of sacrifice in worship points to the later perfect sacrificial offering in Christ, whose sacrifice alone restores humanity to God (Hebrews 9:12)."
    },
    {
      "pk": 14033017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 17,
      "text": "Nevertheless, the people continued to sacrifice at the high places, but only to the LORD their God.",
      "links": "",
      "comment": "Old practices of worship persisted even as intention shifted back to the Lord. This hints at the importance of unified, right worship according to God’s prescribed manner—a theme further developed in Christian tradition."
    },
    {
      "pk": 14033018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 18,
      "text": "The rest of the acts of Manasseh, his prayer to his God, and the words of the seers who spoke to him in the name of the LORD, the God of Israel, are written among the chronicles of the kings of Israel.",
      "links": "<a href='/AIV/12/21/17'>2 Kings 21:17</a>",
      "comment": "Reference to other historical records implies the continuity and authority of traditional accounts—a principle held dear in the preservation of sacred tradition."
    },
    {
      "pk": 14033019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 19,
      "text": "His prayer, and how God was moved by him, all his sin and unfaithfulness, and the locations where he built high places and set up Asherah poles and images before he humbled himself—these are recorded in the records of the seers.",
      "links": "",
      "comment": "Manasseh’s story is preserved as both warning and hope: no one is beyond God’s mercy, but personal turning and humility are essential."
    },
    {
      "pk": 14033020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 20,
      "text": "So Manasseh laid down with his ancestors, and they buried him in his house. And his son Amon became king in his place.",
      "links": "<a href='/AIV/12/21/18-19'>2 Kings 21:18-19</a>",
      "comment": "Manasseh’s peaceful death after repentance contrasts the doom that would have befallen him. It demonstrates how restored relationship with God brings peace at the end of life (Phil. 4:7)."
    },
    {
      "pk": 14033021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 21,
      "text": "Amon was twenty-two years old when he began to reign, and he reigned for two years in Jerusalem.",
      "links": "<a href='/AIV/12/21/19'>2 Kings 21:19</a>",
      "comment": "Amon’s brief reign sets the stage for the consequences of successive generations either upholding or abandoning true worship."
    },
    {
      "pk": 14033022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 22,
      "text": "He did what was evil in the sight of the LORD, as his father Manasseh had done, and Amon sacrificed to all the images that his father Manasseh had made, and served them.",
      "links": "<a href='/AIV/12/21/20-21'>2 Kings 21:20-21</a>",
      "comment": "Despite Manasseh’s repentance, Amon returned to idolatry, showing the importance of faithful transmission of belief and practice—a theme stressed in apostolic succession."
    },
    {
      "pk": 14033023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 23,
      "text": "He did not humble himself before the LORD as Manasseh his father had humbled himself, but this Amon increased his guilt.",
      "links": "",
      "comment": "Amon’s lack of repentance leads to greater sin. The principle of humility before God is a constant call in the spiritual life (James 4:6-10)."
    },
    {
      "pk": 14033024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 24,
      "text": "His servants conspired against him and killed him in his own house.",
      "links": "<a href='/AIV/12/21/23'>2 Kings 21:23</a>",
      "comment": "Amon’s violent death demonstrates the instability that follows persistent rejection of God’s ways and is a warning about the consequences of impiety."
    },
    {
      "pk": 14033025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 33,
      "verse": 25,
      "text": "But the people of the land struck down all those who had conspired against King Amon, and the people made his son Josiah king in his place.",
      "links": "<a href='/AIV/12/21/24'>2 Kings 21:24</a>; <a href='/AIV/12/22/1-2'>2 Kings 22:1-2</a>",
      "comment": "The people's role in restoring the Davidic line prepares for Josiah’s reforms. This points towards God's faithfulness in preserving a holy remnant and a righteous king, anticipating the eventual messianic King (Luke 1:32-33)."
    }
  ],
  "translatedAt": "2025-12-24T04:38:16.363Z"
}