{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 17,
  "verses": [
    {
      "pk": 14017001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 1,
      "text": "Jehoshaphat, his son, became king after him, and strengthened himself against Israel.",
      "links": "<a href='/AIV/11/15/24'>1 Kings 15:24</a>; <a href='/AIV/14/16/14'>2 Chr. 16:14</a>",
      "comment": "Jehoshaphat follows Asa as king of Judah, focusing on security from the northern kingdom of Israel. This split kingdom sets up later events in salvation history."
    },
    {
      "pk": 14017002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 2,
      "text": "He placed troops in all the fortified cities of Judah, and set garrisons in the land of Judah and in the cities of Ephraim that Asa his father had taken.",
      "links": "<a href='/AIV/14/15/8'>2 Chr. 15:8</a>; <a href='/AIV/11/15/16-22'>1 Kings 15:16-22</a>",
      "comment": "Jehoshaphat continues the defensive strategies of his father, strengthening the kingdom’s stability and peace. This prefigures Christ as the protector of His Church."
    },
    {
      "pk": 14017003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 3,
      "text": "The Lord was with Jehoshaphat, because he walked in the early ways of his father David, and did not seek the Baals.",
      "links": "<a href='/AIV/19/18/1'>Ps. 18:1</a>; <a href='/AIV/11/9/4'>1 Kings 9:4</a>",
      "comment": "Jehoshaphat is blessed for following the original devotion of David, avoiding idolatry. David’s faithfulness is held up as the model for the legitimate leadership."
    },
    {
      "pk": 14017004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 4,
      "text": "Instead, he sought the God of his father, and followed His commandments, and did not act as Israel did.",
      "links": "<a href='/AIV/14/16/12'>2 Chr. 16:12</a>; <a href='/AIV/19/119/2'>Ps. 119:2</a>",
      "comment": "Distinction is made between Judah’s faithfulness and Israel’s apostasy. Spiritual fidelity is imperative for true worship—echoing the need for continuity and obedience in the faith."
    },
    {
      "pk": 14017005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 5,
      "text": "The Lord established the kingdom in his hand; all Judah gave gifts to Jehoshaphat, and he had wealth and honor in abundance.",
      "links": "<a href='/AIV/19/112/3'>Ps. 112:3</a>; <a href='/AIV/14/1/12'>2 Chr. 1:12</a>",
      "comment": "Obedience to God brings material and spiritual blessings. The unity and generosity of Judah towards their king point ahead to the unity of the faithful under Christ’s kingship."
    },
    {
      "pk": 14017006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 6,
      "text": "His heart was lifted up in the ways of the Lord; furthermore, he removed the high places and Asherim from Judah.",
      "links": "<a href='/AIV/14/15/17'>2 Chr. 15:17</a>; <a href='/AIV/11/22/43'>1 Kings 22:43</a>",
      "comment": "Removing false worship is seen as a sign of true zeal. The cleansing of the land prefigures purification of the soul, and also points to the need for right worship."
    },
    {
      "pk": 14017007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 7,
      "text": "In the third year of his reign, he sent his officials—Ben-Hail, Obadiah, Zechariah, Nethanel, and Micaiah—to teach in the cities of Judah.",
      "links": "<a href='/AIV/14/35/3'>2 Chr. 35:3</a>; <a href='/AIV/16/8/1-8'>Neh. 8:1-8</a>",
      "comment": "Teaching the Law is central for true leadership. The sending of teachers recalls apostolic missions, highlighting the importance of instruction in the faith."
    },
    {
      "pk": 14017008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 8,
      "text": "With them were the Levites: Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tob-Adonijah; and the priests Elishama and Jehoram.",
      "links": "<a href='/AIV/13/6/16-30'>1 Chr. 6:16-30</a>; <a href='/AIV/14/31/4'>2 Chr. 31:4</a>",
      "comment": "Levites and priests are distinguished as special ministers of the Word—pointing towards the office of ministry and teaching authority within the Church."
    },
    {
      "pk": 14017009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 9,
      "text": "They taught throughout Judah, carrying the Book of the Law of the Lord, and they went around all the cities of Judah and taught among the people.",
      "links": "<a href='/AIV/5/6/6-9'>Deut. 6:6-9</a>; <a href='/AIV/16/8/7-8'>Neh. 8:7-8</a>",
      "comment": "Public dissemination of the Scriptures was vital for collective faith. Emphasis is placed on tradition and transmission of the faith, hinting at the value of apostolic teaching."
    },
    {
      "pk": 14017010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 10,
      "text": "The fear of the Lord fell upon all the kingdoms of the lands surrounding Judah, and they did not wage war against Jehoshaphat.",
      "links": "<a href='/AIV/2/23/27'>Ex. 23:27</a>; <a href='/AIV/14/20/29'>2 Chr. 20:29</a>",
      "comment": "God’s protection is shown whenever His people are obedient. This foreshadows the spiritual peace granted to the faithful, reflecting the providential care of the Lord."
    },
    {
      "pk": 14017011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 11,
      "text": "Some of the Philistines brought Jehoshaphat gifts and silver as tribute, and the Arabs brought him flocks—seven thousand seven hundred rams and the same number of goats.",
      "links": "<a href='/AIV/10/8/2'>2 Sam. 8:2</a>; <a href='/AIV/14/26/8'>2 Chr. 26:8</a>",
      "comment": "Surrounding nations recognize and respect the authority of Jehoshaphat, which points ahead to the gathering of all peoples to the true King, Christ."
    },
    {
      "pk": 14017012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 12,
      "text": "Jehoshaphat grew increasingly powerful; he built fortresses and storage cities throughout Judah.",
      "links": "<a href='/AIV/13/29/1'>1 Chr. 29:1</a>; <a href='/AIV/14/11/11'>2 Chr. 11:11</a>",
      "comment": "Material and military growth complements the spiritual reform. This parallels the growth of the early Church in numbers and influence, always rooted in spiritual fidelity."
    },
    {
      "pk": 14017013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 13,
      "text": "He had many workers in Jerusalem, and brave warriors throughout Judah, all under his command.",
      "links": "<a href='/AIV/13/12/38'>1 Chr. 12:38</a>; <a href='/AIV/14/26/11-13'>2 Chr. 26:11-13</a>",
      "comment": "Unity and order are highlighted by Jehoshaphat’s well-structured leadership—an early echo of the apostolic order and the value of hierarchy for the people of God."
    },
    {
      "pk": 14017014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 14,
      "text": "This was their muster according to their ancestral houses: Judah’s commanders were Adnah the chief, with three hundred thousand valiant warriors;",
      "links": "<a href='/AIV/13/27/1'>1 Chr. 27:1</a>; <a href='/AIV/13/5/24'>1 Chr. 5:24</a>",
      "comment": "Genealogy and familial line remain central. This continuity of succession points ultimately to the role of apostolic succession in safeguarding the faith."
    },
    {
      "pk": 14017015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 15,
      "text": "Next to him, Jehohanan, the captain, with two hundred eighty thousand;",
      "links": "<a href='/AIV/13/7/10'>1 Chr. 7:10</a>",
      "comment": "The careful accounting of leaders’ names and numbers further underscores order and organization, reflecting the tradition of maintaining holy structure in leadership."
    },
    {
      "pk": 14017016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 16,
      "text": "Amasiah son of Zikri, who voluntarily offered himself to the Lord, with two hundred thousand valiant warriors;",
      "links": "<a href='/AIV/14/29/31'>2 Chr. 29:31</a>",
      "comment": "Amasiah’s free dedication to service emphasizes the voluntary aspect of devotion, foretelling the willing self-giving of Christ and commitment expected from every believer."
    },
    {
      "pk": 14017017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 17,
      "text": "From Benjamin: Eliada, a mighty man of valor, with two hundred thousand men, armed with bow and shield;",
      "links": "<a href='/AIV/13/8/27'>1 Chr. 8:27</a>; <a href='/AIV/14/13/2'>2 Chr. 13:2</a>",
      "comment": "Benjamin’s historic role as a key tribe is maintained. The specific mention of arms emphasizes preparedness—echoed spiritually in the New Testament call to don the armor of faith (cf. Eph. 6:10-17)."
    },
    {
      "pk": 14017018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 18,
      "text": "And next to him, Jehozabad, with one hundred eighty thousand equipped for war.",
      "links": "<a href='/AIV/14/20/26'>2 Chr. 20:26</a>",
      "comment": "The detailed organization of the military forces shows the importance of order and preparation, which is mirrored spiritually in the structuring of God’s people."
    },
    {
      "pk": 14017019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 17,
      "verse": 19,
      "text": "These were the men who served the king, besides those whom he had placed in the fortified cities throughout all Judah.",
      "links": "<a href='/AIV/14/11/12'>2 Chr. 11:12</a>; <a href='/AIV/13/26/32'>1 Chr. 26:32</a>",
      "comment": "Jehoshaphat’s reign demonstrates strong, centralized leadership, preparing the way for a united worship and pointing towards the ideal of unity and continuity in the people of God."
    }
  ],
  "translatedAt": "2025-12-24T04:29:46.109Z"
}