{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 36,
  "verses": [
    {
      "pk": 14036001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 1,
      "text": "Then the people of the land took Jehoahaz the son of Josiah and made him king in Jerusalem in place of his father.",
      "links": "<a href='/AIV/12/23/30'>2 Kings 23:30</a>",
      "comment": "Jehoahaz’s rise to kingship shows the nation’s involvement in choosing leaders, echoing earlier times when the people affirmed their king. This foreshadows Christ as King chosen for all humanity, fulfilling deeper messianic expectations."
    },
    {
      "pk": 14036002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 2,
      "text": "Jehoahaz was twenty-three years old when he became king, and he reigned three months in Jerusalem.",
      "links": "<a href='/AIV/12/23/31'>2 Kings 23:31</a>",
      "comment": "The short reign of Jehoahaz underscores the instability in Judah at this time, highlighting the consequences of abandoning God’s covenant. The brevity of his rule stands in contrast to God’s eternal kingdom established in Christ."
    },
    {
      "pk": 14036003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 3,
      "text": "The king of Egypt removed him from Jerusalem and imposed a tribute of one hundred talents of silver and a talent of gold on the land.",
      "links": "<a href='/AIV/12/23/33'>2 Kings 23:33</a>",
      "comment": "Egypt’s interference demonstrates the loss of Judah’s independence, a result of faithlessness. The tribute foreshadows the spiritual debt humanity bears, needing redemption through the perfect sacrifice."
    },
    {
      "pk": 14036004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 4,
      "text": "The king of Egypt made Eliakim, Jehoahaz’s brother, king over Judah and Jerusalem and changed his name to Jehoiakim; but Necho took Jehoahaz away to Egypt.",
      "links": "<a href='/AIV/12/23/34'>2 Kings 23:34</a>",
      "comment": "Changing Eliakim’s name to Jehoiakim signifies authority over the Israelite king. Biblically, name changes often mark new missions or destinies (see Genesis 17:5, John 1:42), here used by pagan rulers, contrasting with God’s purpose."
    },
    {
      "pk": 14036005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 5,
      "text": "Jehoiakim was twenty-five years old when he became king, and he reigned eleven years in Jerusalem. He did evil in the sight of the LORD his God.",
      "links": "<a href='/AIV/12/23/36-37'>2 Kings 23:36-37</a>",
      "comment": "Jehoiakim’s evil leadership reflects a recurring pattern of unfaithfulness in Israel, leading to judgment. This sets the stage for exile, yet also for restoration, prefiguring the need for a righteous King and Savior."
    },
    {
      "pk": 14036006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 6,
      "text": "Nebuchadnezzar king of Babylon came against him and bound him in bronze chains to take him to Babylon.",
      "links": "<a href='/AIV/27/1/1-2'>Daniel 1:1-2</a>; <a href='/AIV/12/24/1'>2 Kings 24:1</a>",
      "comment": "Jehoiakim’s capture signals the beginning of Babylonian dominance, a punishment foretold in prophecy (Jeremiah 25:8-11). The exile’s theological meaning points to purification and God’s sovereignty through adversity."
    },
    {
      "pk": 14036007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 7,
      "text": "Nebuchadnezzar also carried off some of the vessels from the house of the LORD and put them in his temple in Babylon.",
      "links": "<a href='/AIV/27/1/2'>Daniel 1:2</a>; <a href='/AIV/12/24/13'>2 Kings 24:13</a>",
      "comment": "The vessels’ removal signifies desecration of the Temple, yet these items later play a role in restoration (Ezra 1:7). Spiritually, it symbolizes God’s holiness enduring even in foreign lands, pointing ahead to the universal call of worship."
    },
    {
      "pk": 14036008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 8,
      "text": "The rest of the deeds of Jehoiakim, the detestable things he did, and all that was found against him, are written in the Book of the Kings of Israel and Judah. Then Jehoiachin his son became king in his place.",
      "links": "<a href='/AIV/12/24/5-6'>2 Kings 24:5-6</a>",
      "comment": "Jehoiakim’s record in other annals shows the historic accuracy and connection between biblical books. Succession continues despite failure, hinting at God’s commitment to David’s line, ultimately realized in the Messiah’s genealogy."
    },
    {
      "pk": 14036009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 9,
      "text": "Jehoiachin was eighteen years old when he became king, and he reigned three months and ten days in Jerusalem. He did evil in the sight of the LORD.",
      "links": "<a href='/AIV/12/24/8-9'>2 Kings 24:8-9</a>",
      "comment": "Jehoiachin’s brief and sinful reign marks continued disobedience. Although later exiled, his eventual release (Jeremiah 52:31-34) foreshadows hope of restoration, reinforcing God’s fidelity amidst human unfaithfulness."
    },
    {
      "pk": 14036010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 10,
      "text": "At the turn of the year, King Nebuchadnezzar sent and brought him to Babylon, along with the precious vessels of the house of the LORD, and made Zedekiah, Jehoiakim’s brother, king over Judah and Jerusalem.",
      "links": "<a href='/AIV/12/24/10-17'>2 Kings 24:10-17</a>; <a href='/AIV/27/1/1-2'>Daniel 1:1-2</a>",
      "comment": "The repeated removal of vessels reinforces the theme of defilement and displacement, yet God’s providence continues in the preservation of the Davidic line and holy tradition."
    },
    {
      "pk": 14036011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 11,
      "text": "Zedekiah was twenty-one years old when he became king, and he reigned eleven years in Jerusalem.",
      "links": "<a href='/AIV/12/24/18'>2 Kings 24:18</a>",
      "comment": "Zedekiah’s ascension sets the stage for the final collapse of Judah, yet his longer reign allowed for opportunities for repentance and God’s mercy, constantly echoed throughout salvation history."
    },
    {
      "pk": 14036012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 12,
      "text": "He did evil in the sight of the LORD his God and did not humble himself before Jeremiah the prophet, who spoke from the mouth of the LORD.",
      "links": "<a href='/AIV/24/37/2'>Jeremiah 37:2</a>",
      "comment": "Refusing prophetic correction reveals spiritual pride. This recalls Jesus’ critiques of hardened hearts (Matthew 23:37), inviting us to receive the fullness of divine revelation with humility."
    },
    {
      "pk": 14036013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 13,
      "text": "He rebelled against King Nebuchadnezzar, who had made him swear by God; but he stiffened his neck and hardened his heart against turning to the LORD, the God of Israel.",
      "links": "<a href='/AIV/24/52/3'>Jeremiah 52:3</a>",
      "comment": "Breaking his oath before God magnifies the gravity of Zedekiah’s rebellion. This warns against violating divine covenants, themes further developed in the New Testament concerning the necessity of true fidelity."
    },
    {
      "pk": 14036014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 14,
      "text": "All the leaders of the priests and the people became more and more unfaithful, following all the detestable practices of the nations. They polluted the house of the LORD which he had consecrated in Jerusalem.",
      "links": "<a href='/AIV/26/8/6'>Ezekiel 8:6</a>; <a href='/AIV/19/74/7'>Psalm 74:7</a>",
      "comment": "Spiritual corruption among priests and people shows collective responsibility for holiness. The desecration of the Temple foreshadows Christ’s cleansing of the temple (John 2:13-21), and points toward the required purity for communal worship."
    },
    {
      "pk": 14036015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 15,
      "text": "The LORD, the God of their fathers, sent word to them through his messengers again and again, because he had compassion on his people and on his dwelling place.",
      "links": "<a href='/AIV/24/7/25'>Jeremiah 7:25</a>; <a href='/AIV/40/21/34-36'>Matthew 21:34-36</a>",
      "comment": "God’s compassion is emphasized by his repeated warnings through prophets, showing endless mercy. The idea of compassion for the ‘dwelling place’ preludes themes of the Church as the temple of the Holy Spirit (1 Corinthians 3:16)."
    },
    {
      "pk": 14036016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 16,
      "text": "But they mocked God’s messengers, despised his words, and scoffed at his prophets, until the anger of the LORD rose against his people, so there was no remedy.",
      "links": "<a href='/AIV/40/23/37'>Matthew 23:37</a>; <a href='/AIV/41/12/6'>Mark 12:6</a>",
      "comment": "Persistent rejection of God’s servants leads to inevitable judgment. This is echoed in the rejection of Christ and the apostles, emphasizing the necessity of listening to God’s authoritative messengers for spiritual unity."
    },
    {
      "pk": 14036017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 17,
      "text": "Therefore he brought against them the king of the Chaldeans, who killed their young men with the sword in the house of their sanctuary and did not spare either young man or virgin, old or elderly; God gave all of them into his hand.",
      "links": "<a href='/AIV/25/2/20-21'>Lamentations 2:20-21</a>",
      "comment": "The severity of judgment underscores the holiness of the sanctuary and the gravity of sin. Divine retribution reinforces the need for reverence in worship and obedience to sacred instruction."
    },
    {
      "pk": 14036018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 18,
      "text": "All the vessels of the house of God, large and small, and the treasures of the LORD’s house, the king, and his leaders, were all carried to Babylon.",
      "links": "<a href='/AIV/27/5/2-4'>Daniel 5:2-4</a>; <a href='/AIV/15/1/7-11'>Ezra 1:7-11</a>",
      "comment": "The complete removal of sacred treasures marks total devastation, but these relics later contribute to restoration. This prefigures God’s power to restore holy things and rebuild the worship community."
    },
    {
      "pk": 14036019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 19,
      "text": "They burned the house of God, broke down the wall of Jerusalem, burned all its palaces with fire, and destroyed all its precious items.",
      "links": "<a href='/AIV/19/79/1'>Psalm 79:1</a>; <a href='/AIV/25/2/7'>Lamentations 2:7</a>",
      "comment": "The destruction of Jerusalem marks a pivotal moment of loss, setting a type for mourning and hope for rebuilding — echoed in post-exile restoration and foreshadowing Christ’s resurrection, where destruction becomes the path to new life."
    },
    {
      "pk": 14036020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 20,
      "text": "Those who survived the sword were carried away to Babylon, where they became servants to him and his sons until the kingdom of Persia came to power.",
      "links": "<a href='/AIV/27/1/3-7'>Daniel 1:3-7</a>; <a href='/AIV/15/1/1'>Ezra 1:1</a>",
      "comment": "Exile as servitude shows the consequences of sin but also sets up the hope of deliverance and return, mirroring the spiritual journey from slavery to freedom through redemption."
    },
    {
      "pk": 14036021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 21,
      "text": "This fulfilled the word of the LORD spoken by Jeremiah, so the land enjoyed its sabbath rests; all the days of desolation it rested, until seventy years were fulfilled.",
      "links": "<a href='/AIV/24/25/11-12'>Jeremiah 25:11-12</a>; <a href='/AIV/27/9/2'>Daniel 9:2</a>",
      "comment": "The seventy-year exile fulfills prophecies and highlights the importance of sabbath observance. Theologically, it underlines the need for obedience to God’s commands, reminding believers to honor rhythms of worship and rest."
    },
    {
      "pk": 14036022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 22,
      "text": "Now in the first year of Cyrus king of Persia, that the word of the LORD spoken by Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus king of Persia, so he made a proclamation throughout his kingdom and also put it in writing:",
      "links": "<a href='/AIV/24/29/10'>Jeremiah 29:10</a>; <a href='/AIV/15/1/1'>Ezra 1:1</a>",
      "comment": "God’s sovereignty working through Cyrus shows divine authority extending even over pagan rulers. This opens the way for restored worship, anticipating the establishment of true worship throughout the world."
    },
    {
      "pk": 14036023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 36,
      "verse": 23,
      "text": "‘Thus says Cyrus king of Persia, “The LORD, the God of heaven, has given me all the kingdoms of the earth and charged me to build him a house in Jerusalem, which is in Judah. Whoever among you belongs to his people—may the LORD his God be with him, and let him go up.”’",
      "links": "<a href='/AIV/15/1/2-3'>Ezra 1:2-3</a>",
      "comment": "Cyrus’s proclamation fulfills prophecy and emphasizes God’s global lordship. The call to ‘go up’ to build the house of the LORD is a summons to restore unified worship, prefiguring the gathering of God’s people in one holy church."
    }
  ],
  "translatedAt": "2025-12-24T04:40:00.500Z"
}