{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 1,
  "verses": [
    {
      "pk": 14001001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 1,
      "text": "Solomon the son of David made himself strong in his kingdom, and the Lord his God was with him and exalted him greatly.",
      "links": "<a href='/AIV/13/28/5-7'>1 Chr. 28:5-7</a>; <a href='/AIV/11/2/46'>1 Kgs. 2:46</a>",
      "comment": "Solomon’s rise to power is shown as a result of God's will, continuing the Davidic lineage which has a prophetic and typological connection to Christ, the ultimate King (<a href='/AIV/40/1/1'>Matt. 1:1</a>)."
    },
    {
      "pk": 14001002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 2,
      "text": "Solomon spoke to all Israel, to the commanders of thousands and hundreds, to the judges, and to every leader in all Israel, the heads of the fathers’ houses.",
      "links": "<a href='/AIV/13/27/1'>1 Chr. 27:1</a>",
      "comment": "The gathering reflects the biblical theme of leadership acting in unity—important for preserving the faith and tradition. This foreshadows the unity Christ prays for among His followers (<a href='/AIV/43/17/20-23'>John 17:20-23</a>)."
    },
    {
      "pk": 14001003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 3,
      "text": "Then Solomon and all the assembly with him went to the high place at Gibeon, because the tent of meeting of God, which Moses the servant of the Lord had made in the wilderness, was there.",
      "links": "<a href='/AIV/02/40/34-38'>Exod. 40:34-38</a>; <a href='/AIV/09/21/29'>1 Sam. 21:29</a>",
      "comment": "Worship at the tent of meeting points to the importance of public, visible worship, a prefiguration of the Church’s central role in helping believers encounter God."
    },
    {
      "pk": 14001004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 4,
      "text": "But David had brought up the ark of God from Kiriath-jearim to the place David had prepared for it, for he had pitched a tent for it in Jerusalem.",
      "links": "<a href='/AIV/10/6/2'>2 Sam. 6:2</a>; <a href='/AIV/13/15/1'>1 Chr. 15:1</a>",
      "comment": "The ark’s movement to Jerusalem foreshadows the establishment of a central place of worship, later fulfilled in the coming of Christ who is the true temple (<a href='/AIV/43/2/19-21'>John 2:19-21</a>)."
    },
    {
      "pk": 14001005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 5,
      "text": "Moreover, the bronze altar that Bezalel the son of Uri, son of Hur, had made, was there before the tabernacle of the Lord. And Solomon and the assembly sought it out.",
      "links": "<a href='/AIV/02/31/2'>Exod. 31:2</a>; <a href='/AIV/02/38/1'>Exod. 38:1</a>",
      "comment": "Solomon’s seeking of the altar shows the continuity of legitimate worship inherited from Moses, echoing the importance of right worship guided by proper authority."
    },
    {
      "pk": 14001006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 6,
      "text": "And Solomon went up there to the bronze altar before the Lord at the tent of meeting, and offered a thousand burnt offerings on it.",
      "links": "<a href='/AIV/11/3/4'>1 Kgs. 3:4</a>",
      "comment": "Solomon’s lavish offering underscores radical devotion and the role of sacrifice in approaching God—ultimately fulfilled in Christ’s perfect sacrifice (<a href='/AIV/58/10/10'>Heb. 10:10</a>)."
    },
    {
      "pk": 14001007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 7,
      "text": "That night God appeared to Solomon and said to him, 'Ask for whatever you wish Me to give you.'",
      "links": "<a href='/AIV/11/3/5'>1 Kgs. 3:5</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "God’s initiative to Solomon highlights divine generosity and invitation to prayer, resonating with Jesus’ own invitation to ask in faith."
    },
    {
      "pk": 14001008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 8,
      "text": "And Solomon said to God, 'You have shown great and steadfast love to David my father, and have made me king in his place.'",
      "links": "<a href='/AIV/10/7/15'>2 Sam. 7:15</a>; <a href='/AIV/11/3/6'>1 Kgs. 3:6</a>",
      "comment": "Solomon recognizes the continuity of God's covenant, emphasizing God’s faithfulness. This covenantal love foreshadows the everlasting kingship of Jesus—the Son of David."
    },
    {
      "pk": 14001009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 9,
      "text": "'O Lord God, let Your promise to David my father be realized, for You have made me king over a people as numerous as the dust of the earth.'",
      "links": "<a href='/AIV/01/13/16'>Gen. 13:16</a>; <a href='/AIV/10/7/12'>2 Sam. 7:12</a>",
      "comment": "Solomon appeals to God’s faithfulness to promise—he does not rely on his own merit. This hints at biblical dependence on grace."
    },
    {
      "pk": 14001010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 10,
      "text": "'Now give me wisdom and knowledge so that I may lead this people, for who is able to govern this great people of Yours?'",
      "links": "<a href='/AIV/11/3/9'>1 Kgs. 3:9</a>; <a href='/AIV/20/2/3-6'>Prov. 2:3-6</a>; <a href='/AIV/59/1/5'>Jas. 1:5</a>",
      "comment": "Desiring wisdom above riches reveals Solomon’s humility. This wisdom is later personified in Christ (see <a href='/AIV/46/1/30'>1 Cor. 1:30</a>)."
    },
    {
      "pk": 14001011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 11,
      "text": "And God said to Solomon, 'Because this was in your heart, and you have not asked for riches, wealth, or honor, nor the death of your enemies, nor have you asked for a long life, but have asked for wisdom and knowledge to govern My people over whom I have made you king,'",
      "links": "<a href='/AIV/19/37/4'>Ps. 37:4</a>",
      "comment": "God commends Solomon’s selflessness. The pursuit of spiritual gifts is shown as pleasing to the Lord, a model for every believer."
    },
    {
      "pk": 14001012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 12,
      "text": "'Wisdom and knowledge are granted to you. And I will give you riches, wealth, and honor, unlike any king before you or after you.'",
      "links": "<a href='/AIV/11/3/12-13'>1 Kgs. 3:12-13</a>",
      "comment": "Blessings follow when spiritual gifts are sought first. Jesus echoes this principle: 'Seek first His kingdom…and all these things will be added to you' (<a href='/AIV/40/6/33'>Matt. 6:33</a>)."
    },
    {
      "pk": 14001013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 13,
      "text": "So Solomon came from the high place at Gibeon, from before the tent of meeting, to Jerusalem. And he reigned over Israel.",
      "links": "<a href='/AIV/11/3/15'>1 Kgs. 3:15</a>",
      "comment": "Solomon’s rule, sourced in his encounter with God, points forward to the perfect kingship of Christ established in the new covenant."
    },
    {
      "pk": 14001014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 14,
      "text": "Solomon gathered chariots and horsemen. He had one thousand four hundred chariots and twelve thousand horsemen, whom he stationed in the chariot cities and with the king at Jerusalem.",
      "links": "<a href='/AIV/11/10/26'>1 Kgs. 10:26</a>",
      "comment": "Solomon’s growing power fulfills earlier promises but also lays the groundwork for future temptation—power and possessions must be ordered under God’s law (<a href='/AIV/05/17/16-17'>Deut. 17:16-17</a>)."
    },
    {
      "pk": 14001015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 15,
      "text": "And the king made silver and gold in Jerusalem as plentiful as stones, and cedars as abundant as the sycamores in the foothills.",
      "links": "<a href='/AIV/11/10/27'>1 Kgs. 10:27</a>",
      "comment": "Such abundance is a sign of God’s blessing, yet Scripture often points to the greater value of spiritual riches over material (<a href='/AIV/40/6/19-20'>Matt. 6:19-20</a>)."
    },
    {
      "pk": 14001016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 16,
      "text": "Solomon’s horses were imported from Egypt and Kue. The king’s merchants purchased them from Kue at a price.",
      "links": "<a href='/AIV/11/10/28'>1 Kgs. 10:28</a>",
      "comment": "Refers to the early international relations of Israel’s king. The import of horses is also presented with some caution in the law (<a href='/AIV/05/17/16'>Deut. 17:16</a>), warning against placing trust in military might."
    },
    {
      "pk": 14001017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 1,
      "verse": 17,
      "text": "A chariot could be imported from Egypt for six hundred shekels of silver, and a horse for one hundred fifty. In the same way, they exported them to all the kings of the Hittites and of Aram.",
      "links": "<a href='/AIV/11/10/29'>1 Kgs. 10:29</a>",
      "comment": "The mention of trade with neighboring peoples shows Israel’s influence, but stresses that true security does not come from riches or alliances, but from fidelity to God and His covenant."
    }
  ],
  "translatedAt": "2025-12-24T04:21:55.620Z"
}