{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 25,
  "verses": [
    {
      "pk": 14025001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 1,
      "text": "Amaziah was twenty-five years old when he became king, and he reigned twenty-nine years in Jerusalem. His mother’s name was Jehoaddan of Jerusalem.",
      "links": "<a href='/AIV/12/14/2'>2 Kings 14:2</a>",
      "comment": "Amaziah begins his reign at twenty-five, consistent with the age of kingship found elsewhere. The mention of his mother’s name underscores the importance of lineage and maternal heritage within the royal chronicles."
    },
    {
      "pk": 14025002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 2,
      "text": "He did what was right in the eyes of the LORD, but not with a whole heart.",
      "links": "<a href='/AIV/12/14/3'>2 Kings 14:3</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "Amaziah’s partial devotion highlights the necessity for complete submission to God. Scripture often contrasts half-hearted service with true faithfulness (see Deut. 6:5). This also points to the need for sincere inward conversion, not just external obedience."
    },
    {
      "pk": 14025003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 3,
      "text": "And as soon as the kingdom was firmly in his hand, he killed his servants who had struck down the king his father.",
      "links": "<a href='/AIV/12/14/5'>2 Kings 14:5</a>",
      "comment": "Amaziah executes justice on the assassins of his father, fulfilling the demands for accountability. Justice for wrongdoing is a consistent biblical principle."
    },
    {
      "pk": 14025004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 4,
      "text": "But he did not put their children to death, because, as it is written in the Law, in the Book of Moses, 'Fathers shall not die because of their children, nor shall children die because of their fathers, but each person shall die for his own sin.'",
      "links": "<a href='/AIV/5/24/16'>Deut. 24:16</a>; <a href='/AIV/26/18/20'>Ezek. 18:20</a>",
      "comment": "Amaziah obeys Mosaic Law by not punishing the children for their fathers’ sins, demonstrating the principle of individual responsibility before God, an important point in salvation history."
    },
    {
      "pk": 14025005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 5,
      "text": "Then Amaziah assembled the men of Judah and arranged them according to their fathers’ houses, under commanders of thousands and of hundreds, for all Judah and Benjamin. And he counted those twenty years old and up and found 300,000 chosen men, fit for war, able to handle spear and shield.",
      "links": "<a href='/AIV/4/1/3'>Num. 1:3</a>",
      "comment": "Amaziah’s preparation for war follows the military organization prescribed by Moses, reflecting the order and discipline expected among God’s people. The specific age of twenty highlights the standard for military service in the Old Testament."
    },
    {
      "pk": 14025006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 6,
      "text": "He also hired 100,000 mighty men of valor from Israel for one hundred talents of silver.",
      "links": "<a href='/AIV/12/16/3'>2 Kings 16:3</a>",
      "comment": "Amaziah seeks to strengthen his army by hiring mercenaries from Israel. Depending on those outside God’s covenant people is often criticized elsewhere, suggesting a lack of reliance on divine providence."
    },
    {
      "pk": 14025007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 7,
      "text": "But a man of God came to him, saying, 'O king, do not let the army of Israel go with you, for the LORD is not with Israel, with all these people of Ephraim.'",
      "links": "<a href='/AIV/11/13/12'>1 Kings 13:12</a>",
      "comment": "Prophets and ‘men of God’ serve as instruments of divine revelation and correction (cf. 2 Sam. 12:1). The warning not to unite with those whom God opposes points to God’s desire for a pure, distinct people."
    },
    {
      "pk": 14025008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 8,
      "text": "Even if you go, and act bravely in battle, God will make you stumble before the enemy; for God has power to help or to cast down.'",
      "links": "<a href='/AIV/9/19/18'>2 Samuel 19:18</a>; <a href='/AIV/19/75/7'>Ps. 75:7</a>",
      "comment": "The prophet reminds Amaziah that spiritual victory is determined by God, not numbers or earthly strength (cf. Zech. 4:6). This foreshadows God’s sovereignty seen throughout Scripture and ultimately in the victory of Christ."
    },
    {
      "pk": 14025009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 9,
      "text": "Amaziah said to the man of God, 'But what about the hundred talents that I gave for the army of Israel?' The man of God answered, 'The LORD is able to give you much more than this.'",
      "links": "<a href='/AIV/19/50/10'>Ps. 50:10</a>; <a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "Amaziah’s concern reflects a tendency to put material things over obedience. The prophet’s reply stresses God’s ability and willingness to provide abundantly for those who trust in Him."
    },
    {
      "pk": 14025010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 10,
      "text": "So Amaziah separated the army that had come to him from Ephraim to go home. But their anger was greatly aroused against Judah, and they returned home in fierce anger.",
      "links": "<a href='/AIV/9/19/43'>2 Samuel 19:43</a>",
      "comment": "Being rejected stirred up anger against Judah, showing the fragile relationship between Israel and Judah. This division highlights the importance of unity within the people of God, a unity Christ would later pray for in John 17."
    },
    {
      "pk": 14025011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 11,
      "text": "Amaziah strengthened himself and led his people out, and went to the Valley of Salt, and struck down ten thousand men of Seir.",
      "links": "<a href='/AIV/12/14/7'>2 Kings 14:7</a>",
      "comment": "The victory in the Valley of Salt is a demonstration of how victory belongs to the Lord when one acts in obedience, even if the numbers are less than desired. Seir refers to Edom."
    },
    {
      "pk": 14025012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 12,
      "text": "Judah’s people captured another ten thousand alive, brought them to the top of a cliff, and threw them down, so that they were all dashed to pieces.",
      "links": "<a href='/AIV/19/137/9'>Ps. 137:9</a>",
      "comment": "This harsh punishment is a rare instance highlighting the severity of war in the ancient world. Such acts are recorded for historical accuracy, not as prescriptive for Christian ethics, showing the difference between the Old Law and the teachings of Jesus."
    },
    {
      "pk": 14025013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 13,
      "text": "But the soldiers of the army whom Amaziah had sent back, so that they would not go with him into battle, raided the cities of Judah from Samaria to Beth-horon, killed three thousand of them, and took much spoil.",
      "links": "<a href='/AIV/10/4/2'>2 Sam. 4:2</a>",
      "comment": "Those dismissed from service acted in retaliation, demonstrating the consequences of division and disunity among the people of God."
    },
    {
      "pk": 14025014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 14,
      "text": "After Amaziah came from striking down the Edomites, he brought the gods of the men of Seir, set them up as his own gods, worshiped them, and burned incense to them.",
      "links": "<a href='/AIV/2/32/1-8'>Ex. 32:1-8</a>",
      "comment": "Amaziah’s turn to false gods after victory is a tragic departure from faithfulness to the LORD, warning against syncretism and idolatry. Incense is used in both true and false worship throughout Scripture, but true worship involves offering the heart to God."
    },
    {
      "pk": 14025015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 15,
      "text": "Therefore the LORD’s anger was kindled against Amaziah, and He sent a prophet to him who said, 'Why have you sought the gods of a people who could not deliver their own people from your hand?'",
      "links": "<a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "The prophet’s question exposes the futility of idolatry (see Isa. 44). True prophets always call God’s people back to the worship and service of the one true God."
    },
    {
      "pk": 14025016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 16,
      "text": "But as he was speaking, Amaziah said to him, 'Have we made you the king’s counselor? Stop! Why should you be struck down?' So the prophet stopped, but said, 'I know that God has planned to destroy you, because you have done this and have not listened to my counsel.'",
      "links": "<a href='/AIV/9/10/13'>1 Sam. 10:13</a>; <a href='/AIV/20/29/1'>Prov. 29:1</a>",
      "comment": "Amaziah’s refusal to heed prophetic warning foreshadows the judgment that will come. Ignoring prophetic voices is a pattern often repeated prior to the exile."
    },
    {
      "pk": 14025017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 17,
      "text": "Then Amaziah, king of Judah, took counsel and sent to Joash, son of Jehoahaz, son of Jehu, king of Israel, saying, 'Come, let us look one another in the face.'",
      "links": "<a href='/AIV/12/14/8'>2 Kings 14:8</a>",
      "comment": "Amaziah calls for confrontation with Israel’s king, possibly out of pride or retaliation. The expression 'look one another in the face' indicates a challenge to conflict."
    },
    {
      "pk": 14025018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 18,
      "text": "And Joash, king of Israel, sent to Amaziah king of Judah, saying, 'The thistle that was in Lebanon sent to the cedar that was in Lebanon, saying, ‘Give your daughter to my son for a wife.’ But a wild beast of Lebanon passed by and trampled down the thistle.'",
      "links": "<a href='/AIV/11/4/33'>1 Kings 4:33</a>",
      "comment": "Joash responds with a parable contrasting the smallness of Amaziah with his own perceived greatness, warning against arrogance. Use of parables anticipates Jesus’ later method of teaching spiritual truths."
    },
    {
      "pk": 14025019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 19,
      "text": "'You say, ‘See, I have struck down Edom,’ and your heart has lifted you up to boast. Stay at home. Why should you provoke trouble and fall, you and Judah with you?'",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Joash warns Amaziah that pride precedes destruction. The theme of humility and heeding wise counsel aligns with wisdom literature."
    },
    {
      "pk": 14025020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 20,
      "text": "But Amaziah would not listen, for this was from God, that He might give them into the hand of their enemies, because they had sought the gods of Edom.",
      "links": "<a href='/AIV/19/81/11-12'>Ps. 81:11-12</a>",
      "comment": "God’s sovereignty over human pride is clear—hardening Amaziah’s heart as a consequence of idolatry. Sometimes, God permits stubbornness to bring about justice and to instruct the faithful."
    },
    {
      "pk": 14025021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 21,
      "text": "And Joash, king of Israel, went up; and he and Amaziah, king of Judah, faced one another at Beth-shemesh, which belongs to Judah.",
      "links": "<a href='/AIV/6/21/16'>Josh. 21:16</a>",
      "comment": "Beth-shemesh, meaning 'house of the sun', witnessed conflict arising from disunity, a recurring theme in the divided kingdoms’ history."
    },
    {
      "pk": 14025022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 22,
      "text": "Judah was defeated by Israel, and every man fled to his home.",
      "links": "<a href='/AIV/28/8/14'>Hos. 8:14</a>",
      "comment": "Judah’s defeat fulfills the warnings issued by the prophets for their unfaithfulness. The scattering of the people alludes to exile and foreshadows the need for a future restoration."
    },
    {
      "pk": 14025023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 23,
      "text": "And Joash, king of Israel, captured Amaziah, king of Judah, son of Joash, son of Jehoahaz, at Beth-shemesh. He brought him to Jerusalem and broke down the wall of Jerusalem, from the Ephraim Gate to the Corner Gate, four hundred cubits.",
      "links": "<a href='/AIV/16/3/6'>Neh. 3:6</a>",
      "comment": "Joash’s breach of Jerusalem’s wall demonstrates the vulnerability caused by sin. Brokenness in the city’s physical defense is symbolic of spiritual weakness and separation from God."
    },
    {
      "pk": 14025024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 24,
      "text": "He took all the gold and silver, all the vessels that were found in the house of God with Obed-edom, and the treasures of the king’s house, the hostages also, and returned to Samaria.",
      "links": "<a href='/AIV/11/15/18'>1 Kings 15:18</a>",
      "comment": "The plundering of the temple foreshadows later exiles and emphasizes the loss that comes with unfaithfulness. The mention of Obed-edom recalls earlier history of the ark and worship (1 Chron. 13:14)."
    },
    {
      "pk": 14025025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 25,
      "text": "Amaziah, son of Joash, king of Judah, lived fifteen years after the death of Joash, son of Jehoahaz, king of Israel.",
      "links": "<a href='/AIV/12/14/17'>2 Kings 14:17</a>",
      "comment": "The chronicler briefly notes the overlapping reigns for historical continuity."
    },
    {
      "pk": 14025026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 26,
      "text": "Now the rest of the acts of Amaziah, from first to last, are they not written in the Book of the Kings of Judah and Israel?",
      "links": "<a href='/AIV/12/14/18'>2 Kings 14:18</a>",
      "comment": "This formulaic statement refers to further records, showing the value placed on accurate and detailed historical accounts."
    },
    {
      "pk": 14025027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 27,
      "text": "From the time that Amaziah turned away from following the LORD, they made a conspiracy against him in Jerusalem, and he fled to Lachish. But they sent after him to Lachish and killed him there.",
      "links": "<a href='/AIV/12/14/19'>2 Kings 14:19</a>; <a href='/AIV/23/36/2'>Isa. 36:2</a>",
      "comment": "Amaziah’s rejection of the Lord led to his violent end, a recurring pattern when leaders abandon the covenant. In scripture, faithlessness often brings about internal unrest and tragedy."
    },
    {
      "pk": 14025028,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 25,
      "verse": 28,
      "text": "They brought him back on horses and buried him with his fathers in the city of Judah.",
      "links": "<a href='/AIV/12/14/20'>2 Kings 14:20</a>",
      "comment": "Despite his failings, Amaziah is given an honorable burial. This points to the biblical balance of justice and mercy seen throughout salvation history, where even flawed leaders receive respect in death, prefiguring grace shown to repentant sinners."
    }
  ],
  "translatedAt": "2025-12-24T04:33:53.864Z"
}