{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 30,
  "verses": [
    {
      "pk": 14030001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 1,
      "text": "Hezekiah sent word to all Israel and Judah, and also wrote letters to Ephraim and Manasseh, inviting them to come to the House of the LORD at Jerusalem, to celebrate the Passover to the LORD, the God of Israel.",
      "links": "<a href='/AIV/26/45/21'>Ezek. 45:21</a>; <a href='/AIV/02/12/1-3'>Ex. 12:1-3</a>",
      "comment": "Hezekiah's invitation shows the unity intended for all tribes of Israel in worship at Jerusalem, prefiguring the universal call to worship in spirit and truth (John 4:23). The Passover foreshadows Christ, our true Passover (1 Cor. 5:7)."
    },
    {
      "pk": 14030002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 2,
      "text": "The king, his leaders, and all the assembly in Jerusalem decided to celebrate the Passover in the second month.",
      "links": "<a href='/AIV/04/09/10-11'>Num. 9:10-11</a>",
      "comment": "Due to ritual uncleanness and delays, the Passover could be celebrated in the second month according to the Law (Num. 9:10-11). Hezekiah's concern for correct worship points to the importance of obedience to divine liturgy."
    },
    {
      "pk": 14030003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 3,
      "text": "They had not been able to keep it at the proper time, because not enough priests had consecrated themselves, and the people had not assembled at Jerusalem.",
      "links": "<a href='/AIV/02/12/6'>Ex. 12:6</a>; <a href='/AIV/04/09/6-13'>Num. 9:6-13</a>",
      "comment": "Priestly consecration was required for legitimate worship; the need for sanctified ministers is foundational for authentic worship and sacrament."
    },
    {
      "pk": 14030004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 4,
      "text": "The plan seemed right to the king and to all the assembly.",
      "links": "<a href='/AIV/19/122/1'>Ps. 122:1</a>",
      "comment": "Consensus in worship among leaders and people brings unity, a mark of the one Church established by God (Eph. 4:4-6)."
    },
    {
      "pk": 14030005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 5,
      "text": "So they established a decree, proclaiming throughout all Israel, from Beersheba to Dan, that people should come to keep the Passover to the LORD, the God of Israel, at Jerusalem, because many had not kept it as it was written.",
      "links": "<a href='/AIV/07/20/1'>Judg. 20:1</a>; <a href='/AIV/01/35/1'>Gen. 35:1</a>",
      "comment": "The call from Beersheba to Dan means the entire land. Adherence to what is written (divine law) is stressed, resonating with living under apostolic tradition."
    },
    {
      "pk": 14030006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 6,
      "text": "The couriers went throughout all Israel and Judah, with letters from the king and his officials, saying, 'People of Israel, return to the LORD, the God of Abraham, Isaac, and Israel, that He may bring you back to those who have escaped from the hand of the kings of Assyria.'",
      "links": "<a href='/AIV/15/09/8'>Ezra 9:8</a>; <a href='/AIV/28/06/1'>Hos. 6:1</a>",
      "comment": "Hezekiah emphasizes covenant faithfulness and hope of restoration, reflecting God's mercy for the remnant, similar to the Church’s gathering of all nations."
    },
    {
      "pk": 14030007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 7,
      "text": "Do not be like your ancestors and your siblings, who were unfaithful to the LORD, the God of their ancestors, so that He made them a horror, as you see.",
      "links": "<a href='/AIV/26/20/18'>Ezek. 20:18</a>; <a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Warning against disobedience aligns with the call to personal conversion. The visible consequences of rejecting God show the need for repentance."
    },
    {
      "pk": 14030008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 8,
      "text": "Do not stiffen your neck as your ancestors did. Yield yourselves to the LORD, and come to His sanctuary which He has set apart forever. Serve the LORD your God, so that His fierce anger may turn away from you.",
      "links": "<a href='/AIV/19/95/8'>Ps. 95:8</a>; <a href='/AIV/03/16/2'>Lev. 16:2</a>",
      "comment": "Submission and participation in God’s sanctuary prefigure the necessity of joining in the sacred liturgy and sacraments, instituted for all time."
    },
    {
      "pk": 14030009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 9,
      "text": "For if you turn back to the LORD, your relatives and your children will be shown compassion by those who took them captive, and will return to this land. For the LORD your God is gracious and merciful; He will not turn His face away from you if you return to Him.",
      "links": "<a href='/AIV/28/14/1-3'>Hos. 14:1-3</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "Repentance leads to restoration—God’s mercy is always available. This compassion underscores the healing power of reconciliation, both divine and familial."
    },
    {
      "pk": 14030010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 10,
      "text": "So the couriers passed from city to city through the land of Ephraim and Manasseh, as far as Zebulun, but the people laughed at them and mocked them.",
      "links": "<a href='/AIV/19/22/7'>Ps. 22:7</a>; <a href='/AIV/40/27/39'>Matt. 27:39</a>",
      "comment": "Rejection from some foreshadows Christ Himself being mocked; true worshipers may face ridicule, yet perseverance is rewarded."
    },
    {
      "pk": 14030011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 11,
      "text": "But some from Asher, Manasseh, and Zebulun humbled themselves and came to Jerusalem.",
      "links": "<a href='/AIV/59/04/10'>James 4:10</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "The humble accept God’s invitation. Participation in the central sanctuary for worship anticipates the faithful’s gathering in one Church."
    },
    {
      "pk": 14030012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 12,
      "text": "The hand of God was also upon Judah, giving them unity of heart to do what the king and leaders had commanded by the word of the LORD.",
      "links": "<a href='/AIV/44/04/32'>Acts 4:32</a>; <a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "God’s Spirit creates unity among believers, echoing the unity established at Pentecost and desired in Christ’s prayer (John 17:21)."
    },
    {
      "pk": 14030013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 13,
      "text": "A large crowd gathered at Jerusalem to keep the Feast of Unleavened Bread in the second month, a very great assembly.",
      "links": "<a href='/AIV/02/12/17'>Ex. 12:17</a>; <a href='/AIV/07/21/19'>Judg. 21:19</a>",
      "comment": "Keeping the God-ordained feasts in Jerusalem highlights the centrality of communal worship and God's chosen place for His name."
    },
    {
      "pk": 14030014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 14,
      "text": "They arose and removed the altars that were in Jerusalem, and took away all the incense altars and threw them into the Kidron Valley.",
      "links": "<a href='/AIV/12/23/12'>2 Kings 23:12</a>; <a href='/AIV/26/11/18'>Ezek. 11:18</a>",
      "comment": "Purifying the city of foreign worship anticipates the exclusivity of true worship and the removal of obstacles to the fullness of faith."
    },
    {
      "pk": 14030015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 15,
      "text": "They slaughtered the Passover lamb on the fourteenth day of the second month. The priests and Levites were ashamed, and sanctified themselves and brought burnt offerings into the house of the LORD.",
      "links": "<a href='/AIV/02/12/6'>Ex. 12:6</a>; <a href='/AIV/03/16/11'>Lev. 16:11</a>",
      "comment": "Sanctification of the priests is needed for worthy service; foreshadows Christ as both priest and offering (Heb. 9:14)."
    },
    {
      "pk": 14030016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 16,
      "text": "They took their places according to their custom, as prescribed in the Law of Moses, the man of God. The priests splashed the blood, handed to them by the Levites.",
      "links": "<a href='/AIV/04/18/7'>Num. 18:7</a>; <a href='/AIV/03/01/5'>Lev. 1:5</a>",
      "comment": "Observance of the prescribed ritual points to continuity with divine law, as the Church maintains apostolic forms in her worship."
    },
    {
      "pk": 14030017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 17,
      "text": "For many in the assembly were not ceremonially clean, so the Levites had to slaughter the Passover lambs for everyone who was not clean, to consecrate them to the LORD.",
      "links": "<a href='/AIV/04/09/6-7'>Num. 9:6-7</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Intercession and mediation by the Levites foreshadow the role of ordained ministers and highlights the need for cleansing before approaching God."
    },
    {
      "pk": 14030018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 18,
      "text": "A large number of the people, many from Ephraim, Manasseh, Issachar, and Zebulun, had not purified themselves, yet they ate the Passover contrary to what was written. But Hezekiah prayed for them, saying, 'May the good LORD pardon everyone'",
      "links": "<a href='/AIV/19/86/5'>Ps. 86:5</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "Hezekiah’s prayer of intercession brings pardon, anticipating Christ's mediation and priestly intercession for believers (Heb. 7:25)."
    },
    {
      "pk": 14030019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 19,
      "text": "'who sets his heart to seek God, the LORD, the God of his ancestors, even though he is not clean according to the rules of the sanctuary.'",
      "links": "<a href='/AIV/23/55/6'>Isa. 55:6</a>; <a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>",
      "comment": "Sincerity of heart in seeking God receives mercy. God values inner disposition over mere external ritual, as fulfilled in Christ's teaching (Matt. 15:8)."
    },
    {
      "pk": 14030020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 20,
      "text": "The LORD listened to Hezekiah and healed the people.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/43/09/6-7'>John 9:6-7</a>",
      "comment": "God answers the prayers of the righteous. Healing is a sign of divine mercy; spiritual restoration is at the heart of redemption."
    },
    {
      "pk": 14030021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 21,
      "text": "The people of Israel who were present at Jerusalem kept the Feast of Unleavened Bread for seven days with great joy, and the Levites and priests praised the LORD every day, playing instruments to the LORD.",
      "links": "<a href='/AIV/19/150/3-6'>Ps. 150:3-6</a>; <a href='/AIV/02/13/6'>Ex. 13:6</a>",
      "comment": "Joyful worship and continuous praise, led by ministers, prefigure the unceasing liturgical celebration which is central to Christian life."
    },
    {
      "pk": 14030022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 22,
      "text": "Hezekiah spoke encouragingly to all the Levites who showed good understanding of the service of the LORD. So they ate throughout the feast for seven days, offering peace offerings and giving thanks to the LORD, the God of their ancestors.",
      "links": "<a href='/AIV/03/07/11-21'>Lev. 7:11-21</a>; <a href='/AIV/19/92/1'>Ps. 92:1</a>",
      "comment": "Proper teaching and understanding enrich worship. Peace offerings and thanksgiving tie together sacrifice and gratitude, elements essential for spiritual growth."
    },
    {
      "pk": 14030023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 23,
      "text": "Then the whole assembly agreed to celebrate for another seven days, so they kept the feast with gladness for seven more days.",
      "links": "<a href='/AIV/03/23/34'>Lev. 23:34</a>; <a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "A prolonged celebration expresses abundant joy. Such devotion prefigures lifelong worship—echoes of the communion of saints rejoicing forever."
    },
    {
      "pk": 14030024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 24,
      "text": "Hezekiah king of Judah gave a thousand bulls and seven thousand sheep to the assembly, and the leaders gave a thousand bulls and ten thousand sheep, and many priests consecrated themselves.",
      "links": "<a href='/AIV/03/08/33'>Lev. 8:33</a>; <a href='/AIV/11/08/63'>1 Kings 8:63</a>",
      "comment": "Abundant offerings reflect generosity and devotion, and the consecration of many priests shows the importance of a large body of ministers for proper worship."
    },
    {
      "pk": 14030025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 25,
      "text": "All the congregation of Judah rejoiced, along with the priests, Levites, and all who came from Israel—including the sojourners who came from the land of Israel and those living in Judah.",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6-7</a>; <a href='/AIV/44/10/45'>Acts 10:45</a>",
      "comment": "Inclusion of strangers and sojourners in worship foreshadows the openness of God’s people to all nations, fulfilled in the Church’s universality."
    },
    {
      "pk": 14030026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 26,
      "text": "There was great joy in Jerusalem, for since the days of Solomon son of David king of Israel, there had not been anything like this in Jerusalem.",
      "links": "<a href='/AIV/14/07/8'>2 Chr. 7:8</a>; <a href='/AIV/11/08/65'>1 Kings 8:65</a>",
      "comment": "The restoration of true worship in Jerusalem recalls the high point of Davidic worship, linking the promise of the Messiah’s everlasting kingdom."
    },
    {
      "pk": 14030027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 30,
      "verse": 27,
      "text": "Then the priests and the Levites stood up and blessed the people; and the LORD heard them, and their prayer reached His holy dwelling in heaven.",
      "links": "<a href='/AIV/04/06/23-27'>Num. 6:23-27</a>; <a href='/AIV/66/08/3-4'>Rev. 8:3-4</a>",
      "comment": "The blessing and intercessory prayer of the ordained ministers is effective, ascending to God’s throne. This anticipates Christ’s priestly mediation and the importance of ministerial blessing in worship."
    }
  ],
  "translatedAt": "2025-12-24T04:36:33.255Z"
}