{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 13,
  "verses": [
    {
      "pk": 14013001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 1,
      "text": "In the eighteenth year of King Jeroboam, Abijah became king over Judah.",
      "links": "<a href='/AIV/11/15/1'>1 Kings 15:1</a>",
      "comment": "The same event is recorded in 1 Kings 15:1. Abijah's accession is synchronized to the reign of Jeroboam in Israel, showing the connected history of the divided kingdoms."
    },
    {
      "pk": 14013002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 2,
      "text": "He reigned for three years in Jerusalem. His mother’s name was Micaiah, the daughter of Uriel of Gibeah. There was war between Abijah and Jeroboam.",
      "links": "<a href='/AIV/11/15/2'>1 Kings 15:2</a>",
      "comment": "Micaiah is an alternative form of Maacah found in 1 Kings 15:2. Chronicles often preserves different details than Kings, giving fuller genealogy and background."
    },
    {
      "pk": 14013003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 3,
      "text": "Abijah went into battle with an army of valiant warriors, four hundred thousand chosen men. Jeroboam arranged battle against him with eight hundred thousand chosen men, mighty warriors.",
      "links": "<a href='/AIV/10/24/9'>2 Samuel 24:9</a>",
      "comment": "The staggering numbers indicate not only a literal army, but in Jewish history serve to characterize the seriousness of division among God's people, representing the peril of schism."
    },
    {
      "pk": 14013004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 4,
      "text": "Abijah stood on Mount Zemaraim, in the hill country of Ephraim, and said, 'Hear me, Jeroboam and all Israel!'",
      "links": "<a href='/AIV/06/18/22'>Joshua 18:22</a>",
      "comment": "Mount Zemaraim was an ancient landmark in Ephraim. Abijah’s speech on a mountain echoes the Old Testament's use of elevated places for authoritative pronouncements—foreshadowing later, similar scenes."
    },
    {
      "pk": 14013005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 5,
      "text": "'Don’t you know that the LORD, the God of Israel, gave the kingship over Israel to David and his descendants forever by a covenant of salt?'",
      "links": "<a href='/AIV/10/07/16'>2 Samuel 7:16</a>; <a href='/AIV/04/18/19'>Numbers 18:19</a>",
      "comment": "The covenant of salt (Num 18:19) symbolized an eternal, unbreakable promise. The reference to David's house points toward God’s enduring purpose, fulfilled ultimately in Christ, the true heir."
    },
    {
      "pk": 14013006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 6,
      "text": "'Yet Jeroboam son of Nebat, the servant of Solomon son of David, rose up and rebelled against his lord.'",
      "links": "<a href='/AIV/11/11/26-40'>1 Kings 11:26-40</a>",
      "comment": "Abijah calls Jeroboam a servant, highlighting his rebellion as not just political but spiritual—a break from divinely appointed authority, a warning about schism's dangers."
    },
    {
      "pk": 14013007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 7,
      "text": "'And worthless men, sons of wickedness, gathered to him and were too strong for Rehoboam, the son of Solomon, while Rehoboam was young and fainthearted and could not stand against them.'",
      "links": "<a href='/AIV/11/12/8-20'>1 Kings 12:8-20</a>",
      "comment": "The description 'sons of wickedness' echoes Old Testament terminology for rebellion against God’s order (<a href='/AIV/09/02/12'>1 Samuel 2:12</a>), a reminder of the seriousness of dissent."
    },
    {
      "pk": 14013008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 8,
      "text": "'And now you think you can withstand the kingdom of the LORD, which is in the hand of the sons of David, because you are a great multitude and have with you the golden calves that Jeroboam made for your gods.'",
      "links": "<a href='/AIV/02/32/4'>Exodus 32:4</a>; <a href='/AIV/11/12/28'>1 Kings 12:28</a>",
      "comment": "Golden calves symbolize idolatry and false worship, drawing direct parallel to Exodus 32. True worship and legitimate leadership are intrinsically connected."
    },
    {
      "pk": 14013009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 9,
      "text": "'Have you not cast out the priests of the LORD, the descendants of Aaron, and the Levites, and made for yourselves priests like the peoples of other lands? Whoever comes to consecrate himself with a young bull and seven rams may become a priest of what are not gods.'",
      "links": "<a href='/AIV/02/28/1'>Exodus 28:1</a>; <a href='/AIV/04/03/10'>Numbers 3:10</a>; <a href='/AIV/11/12/31'>1 Kings 12:31</a>",
      "comment": "Abijah defends the legitimate priesthood ordained by God. Unauthorized ordination (as Jeroboam did) is condemned—a theme that echoes through all scriptural teachings on ministry and sacrifice."
    },
    {
      "pk": 14013010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 10,
      "text": "'But as for us, the LORD is our God, and we have not forsaken him; the priests who serve the LORD are sons of Aaron, and the Levites are at their duties.'",
      "links": "<a href='/AIV/04/08/24-26'>Numbers 8:24-26</a>",
      "comment": "Faithfulness to divinely appointed priesthood and worship is emphasized. The proper succession and ministry are seen as necessary for true worship—this theme is continued in the teachings of Christ’s Church (see <a href='/AIV/58/05/1-6'>Hebrews 5:1-6</a>)."
    },
    {
      "pk": 14013011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 11,
      "text": "'They burn to the LORD every morning and every evening burnt offerings and fragrant incense. They set out the showbread on the pure table and care for the golden lampstand, to kindle its lamps every evening; for we keep the charge of the LORD our God, but you have forsaken him.'",
      "links": "<a href='/AIV/02/30/7-8'>Exodus 30:7-8</a>; <a href='/AIV/03/24/5-9'>Leviticus 24:5-9</a>; <a href='/AIV/04/08/2'>Numbers 8:2</a>",
      "comment": "The daily sacrifices and prescribed rituals indicate continual, ordered worship. This points toward perpetual prayer and worship as central to faith, later realized spiritually in the New Covenant."
    },
    {
      "pk": 14013012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 12,
      "text": "'Behold, God himself is with us as our head, and his priests with the trumpets of alarm to sound the call to battle against you. O children of Israel, do not fight against the LORD, the God of your fathers, for you will not succeed.'",
      "links": "<a href='/AIV/04/10/8-9'>Numbers 10:8-9</a>; <a href='/AIV/02/14/25'>Exodus 14:25</a>",
      "comment": "God as head is a recurrent theme pointing toward Christ as the ultimate head of his people (see <a href='/AIV/51/01/18'>Colossians 1:18</a>). The trumpets recall sacred warfare and divine leadership."
    },
    {
      "pk": 14013013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 13,
      "text": "But Jeroboam had set an ambush to come from behind. So his army was in front of Judah, while the ambush was behind them.",
      "links": "<a href='/AIV/07/20/29'>Judges 20:29</a>",
      "comment": "Jeroboam’s ambush illustrates worldly strategy set against divine order; frequently in Scripture, human cunning is shown to be no match for God’s providence."
    },
    {
      "pk": 14013014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 14,
      "text": "When Judah turned, behold, the battle was before and behind them. They cried out to the LORD, and the priests blew the trumpets.",
      "links": "<a href='/AIV/07/03/9-20'>Judges 3:9-20</a>; <a href='/AIV/04/10/9-10'>Numbers 10:9-10</a>",
      "comment": "In the face of defeat, Judah’s cry to God and the priestly trumpets show intercession and liturgy together—prayer and sacramental action are both needed for deliverance."
    },
    {
      "pk": 14013015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 15,
      "text": "Then the men of Judah raised a shout. And as they shouted, God struck Jeroboam and all Israel before Abijah and Judah.",
      "links": "<a href='/AIV/06/06/5'>Joshua 6:5</a>",
      "comment": "God’s intervention is associated with the praise and worship of his people (see <a href='/AIV/19/22/3'>Psalm 22:3</a>). Here, spiritual and physical deliverance are closely linked."
    },
    {
      "pk": 14013016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 16,
      "text": "The men of Israel fled before Judah, and God delivered them into their hand.",
      "links": "<a href='/AIV/07/07/22'>Judges 7:22</a>",
      "comment": "Again, victory comes not by human strength but by divine favor—a theme fulfilled spiritually in Christ’s triumph over sin and death."
    },
    {
      "pk": 14013017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 17,
      "text": "Abijah and his people struck them with a great slaughter, so five hundred thousand chosen men of Israel fell slain.",
      "links": "<a href='/AIV/06/10/10-11'>Joshua 10:10-11</a>",
      "comment": "The immense loss illustrates the tragic cost of separating from divinely constituted leadership. The numbers communicate the destructive result of division in the community of God."
    },
    {
      "pk": 14013018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 18,
      "text": "So the Israelites were subdued at that time, and the people of Judah prevailed because they relied on the LORD, the God of their fathers.",
      "links": "<a href='/AIV/14/16/8'>2 Chronicles 16:8</a>; <a href='/AIV/19/20/7'>Psalm 20:7</a>",
      "comment": "Judah’s trust in God was more significant than their own strength—faith and reliance on God’s ordained way bring victory, foreshadowing the ultimate triumph found in submitting to Christ’s authority."
    },
    {
      "pk": 14013019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 19,
      "text": "Abijah pursued Jeroboam and took some cities from him—Bethel with its villages, Jeshanah with its villages, and Ephron with its villages.",
      "links": "<a href='/AIV/06/16/1-2'>Joshua 16:1-2</a>",
      "comment": "The recapture of these significant cities signals the restoration of order and the reclaiming of true worship centers."
    },
    {
      "pk": 14013020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 20,
      "text": "Jeroboam did not recover his power again in the days of Abijah. And the LORD struck him, and he died.",
      "links": "<a href='/AIV/11/14/20'>1 Kings 14:20</a>",
      "comment": "Jeroboam’s fate is a cautionary tale about resisting God’s appointed leadership. God’s sovereign justice is exacted on those who lead his people astray."
    },
    {
      "pk": 14013021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 21,
      "text": "But Abijah grew strong, took fourteen wives, and fathered twenty-two sons and sixteen daughters.",
      "links": "<a href='/AIV/14/11/21'>2 Chronicles 11:21</a>",
      "comment": "The prosperity and expansion of Abijah’s house reflect the blessing on David’s line and the biblical idea of fruitfulness—often taken as a sign of divine favor."
    },
    {
      "pk": 14013022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 13,
      "verse": 22,
      "text": "Now the rest of the acts of Abijah, his ways, and his sayings are written in the record of the prophet Iddo.",
      "links": "<a href='/AIV/14/09/29'>2 Chronicles 9:29</a>",
      "comment": "Iddo the prophet’s chronicling of Abijah’s reign illustrates the value of tradition and the written witness handed down through generations, echoing the importance of both Scripture and sacred tradition in preserving truth."
    }
  ],
  "translatedAt": "2025-12-24T04:28:15.306Z"
}