{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 18,
  "verses": [
    {
      "pk": 14018001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 1,
      "text": "Now Jehoshaphat had great riches and honor, and he allied himself by marriage with Ahab.",
      "links": "<a href='/AIV/11/3/1'>1 Kings 3:1</a>; <a href='/AIV/11/16/31'>1 Kings 16:31</a>",
      "comment": "Jehoshaphat's alliance with Ahab through marriage mirrors the pattern of royal alliances in the Ancient Near East. These relationships often had deep religious and political implications, sometimes leading the people of God into compromise (cf. 1 Kings 16:31). The unity of God's people is subtly foreshadowed in these accounts, as later realized in Christ."
    },
    {
      "pk": 14018002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 2,
      "text": "After some years, he went down to Ahab in Samaria. And Ahab killed many sheep and oxen for him and the people who were with him and persuaded him to go up with him to Ramoth-gilead.",
      "links": "<a href='/AIV/11/22/2'>1 Kings 22:2</a>",
      "comment": "The lavish feast underscores the use of hospitality as a means to win allies for political and military purposes. Ramoth-gilead was a disputed territory, highlighting the ongoing struggle between Israel and Aram."
    },
    {
      "pk": 14018003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 3,
      "text": "And Ahab, king of Israel, said to Jehoshaphat, king of Judah, 'Will you go with me to Ramoth-gilead?' He replied, 'I am as you are, my people as your people. We will be with you in the war.'",
      "links": "<a href='/AIV/11/22/4'>1 Kings 22:4</a>",
      "comment": "Jehoshaphat's willing participation reveals the risks of associating too closely with those who may not be faithful to God's covenant. Spiritual unity is meant to be built on truth and fidelity to God's word."
    },
    {
      "pk": 14018004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 4,
      "text": "But Jehoshaphat said to the king of Israel, 'Please inquire first for the word of the LORD.'",
      "links": "<a href='/AIV/9/23'>1 Samuel 9:9; <a href='/AIV/11/22/5'>1 Kings 22:5</a>",
      "comment": "This demonstrates a heart that seeks divine guidance before taking action. The principle of consulting God’s will remains foundational for true leadership."
    },
    {
      "pk": 14018005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 5,
      "text": "So the king of Israel gathered the prophets, four hundred men, and said to them, 'Shall we go to battle against Ramoth-gilead, or shall I refrain?' And they said, 'Go up, for God will deliver it into the king’s hand.'",
      "links": "<a href='/AIV/11/18/19'>1 Kings 18:19</a>; <a href='/AIV/11/22/6'>1 Kings 22:6</a>",
      "comment": "The presence of so many prophets points to the danger of false or compromised voices among the people of God. Discernment is always needed when seeking divine counsel."
    },
    {
      "pk": 14018006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 6,
      "text": "But Jehoshaphat said, 'Is there not here another prophet of the LORD, by whom we may inquire?'",
      "links": "<a href='/AIV/11/22/7'>1 Kings 22:7</a>",
      "comment": "Jehoshaphat senses something is amiss. The desire for an authentic prophet shows the importance of apostolic succession in hearing the true voice of God throughout history."
    },
    {
      "pk": 14018007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 7,
      "text": "The king of Israel said to Jehoshaphat, 'There is still one man by whom we may inquire of the LORD, Micaiah the son of Imlah, but I hate him, for he never prophesies good concerning me, but always evil.' Jehoshaphat said, 'Let not the king say so.'",
      "links": "<a href='/AIV/11/22/8'>1 Kings 22:8</a>",
      "comment": "True prophetic voices often bring uncomfortable truth. The reception of correction is a hallmark of genuine righteousness."
    },
    {
      "pk": 14018008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 8,
      "text": "Then the king of Israel called an officer and said, 'Bring quickly Micaiah the son of Imlah.'",
      "links": "<a href='/AIV/11/22/9'>1 Kings 22:9</a>",
      "comment": "Micaiah’s isolated position among the prophets points to the cost that comes with fidelity to God's message, paralleling later experiences of true disciples and apostles."
    },
    {
      "pk": 14018009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 9,
      "text": "Now the king of Israel and Jehoshaphat the king of Judah were sitting each on his throne, arrayed in their robes, at the threshing floor at the entrance of the gate of Samaria. All the prophets were prophesying before them.",
      "links": "<a href='/AIV/11/22/10'>1 Kings 22:10</a>",
      "comment": "The scene highlights the solemnity and public nature of royal judgment and the prophetic word, setting the stage for God’s authoritative intervention."
    },
    {
      "pk": 14018010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 10,
      "text": "And Zedekiah the son of Chenaanah made for himself horns of iron and said, 'Thus says the LORD, “With these you shall push the Syrians until they are destroyed.”'",
      "links": "<a href='/AIV/11/22/11'>1 Kings 22:11</a>; <a href='/AIV/23/10/15'>Isaiah 10:15</a>",
      "comment": "Prophets would sometimes use symbolic acts to communicate their message, much like some of the signs performed by later prophets and ultimately fulfilled in Christ’s own actions (cf. Isaiah 10:15)."
    },
    {
      "pk": 14018011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 11,
      "text": "All the prophets prophesied so, saying, 'Go up to Ramoth-gilead and triumph; the LORD will give it into the hand of the king.'",
      "links": "<a href='/AIV/11/22/12'>1 Kings 22:12</a>",
      "comment": "This consensus among the false prophets stands in contrast to the lone voice of truth, reminiscent of the lonely path Christ would walk before the crowds."
    },
    {
      "pk": 14018012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 12,
      "text": "And the messenger who went to summon Micaiah said to him, 'Behold, the words of the prophets with one accord are favorable to the king. Let your word be like one of them, and speak favorably.'",
      "links": "<a href='/AIV/11/22/13'>1 Kings 22:13</a>",
      "comment": "There is pressure to conform and affirm the majority, but true prophecy is not shaped by consensus. The tension here points toward Christian courage in standing for truth."
    },
    {
      "pk": 14018013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 13,
      "text": "But Micaiah said, 'As the LORD lives, what my God says, that I will speak.'",
      "links": "<a href='/AIV/11/22/14'>1 Kings 22:14</a>; <a href='/AIV/4/24/13'>Numbers 24:13</a>",
      "comment": "Micaiah’s response reveals the true role of prophet or apostle: to speak God’s word, regardless of the human audience or consequences."
    },
    {
      "pk": 14018014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 14,
      "text": "And when he came to the king, the king said to him, 'Micaiah, shall we go to Ramoth-gilead to battle, or shall I refrain?' And he said, 'Go up and triumph; they will be given into your hand.'",
      "links": "<a href='/AIV/11/22/15'>1 Kings 22:15</a>",
      "comment": "There is an ironic tone in Micaiah’s response, similar to the challenge Jesus gave to his questioners, revealing deeper meaning beneath the surface words."
    },
    {
      "pk": 14018015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 15,
      "text": "But the king said to him, 'How many times shall I make you swear that you speak to me nothing but the truth in the name of the LORD?'",
      "links": "<a href='/AIV/11/22/16'>1 Kings 22:16</a>",
      "comment": "Ahab’s demand for truth reveals the human conscience's longing for a genuine divine word, even when such truth is difficult."
    },
    {
      "pk": 14018016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 16,
      "text": "And he said, 'I saw all Israel scattered on the mountains, as sheep that have no shepherd.' And the LORD said, 'These have no master. Let each return to his house in peace.'",
      "links": "<a href='/AIV/11/22/17'>1 Kings 22:17</a>; <a href='/AIV/40/9/36'>Matthew 9:36</a>",
      "comment": "The image of sheep without a shepherd anticipates Christ’s own words about the spiritual leadership of God's people (Matthew 9:36). God’s plan is always to provide true shepherds for His flock."
    },
    {
      "pk": 14018017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 17,
      "text": "And the king of Israel said to Jehoshaphat, 'Did I not tell you that he would not prophesy good concerning me, but only evil?'",
      "links": "<a href='/AIV/11/22/18'>1 Kings 22:18</a>",
      "comment": "Ahab’s unwillingness to receive negative prophecy reveals a heart hardened against correction, an enduring spiritual danger."
    },
    {
      "pk": 14018018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 18,
      "text": "And Micaiah said, 'Therefore hear the word of the LORD: I saw the LORD sitting on his throne, and all the host of heaven standing on His right and on His left.'",
      "links": "<a href='/AIV/11/22/19'>1 Kings 22:19</a>; <a href='/AIV/18/1/6'>Job 1:6</a>; <a href='/AIV/19/103/20'>Ps. 103:20</a>",
      "comment": "This vision of the heavenly court echoes scenes from Job and the Psalms, invoking the liturgical reality of worship and judgment before God’s throne."
    },
    {
      "pk": 14018019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 19,
      "text": "And the LORD said, ‘Who will entice Ahab king of Israel, that he may go up and fall at Ramoth-gilead?’ And one said one thing, and another said another.",
      "links": "<a href='/AIV/11/22/20'>1 Kings 22:20</a>; <a href='/AIV/7/9/23'>Judges 9:23</a>",
      "comment": "This conversation reveals the mystery of God’s sovereignty even over the events of earthly kings."
    },
    {
      "pk": 14018020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 20,
      "text": "Then a spirit came forward and stood before the LORD, saying, 'I will entice him.' And the LORD said to him, 'By what means?'",
      "links": "<a href='/AIV/11/22/21'>1 Kings 22:21</a>",
      "comment": "God permits spiritual beings to serve His greater purpose, echoing themes of spiritual warfare and the mystery of divine providence."
    },
    {
      "pk": 14018021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 21,
      "text": "And he said, 'I will go out and be a lying spirit in the mouth of all his prophets.' And the LORD said, 'You are to entice him, and you shall succeed; go out and do so.'",
      "links": "<a href='/AIV/11/22/22'>1 Kings 22:22</a>; <a href='/AIV/2/14/4'>Ex. 14:4</a>",
      "comment": "This hard passage reveals God’s allowance of deception for judgment. It underscores the superiority of divine wisdom and the need for a protected, authoritative teaching office in the faith."
    },
    {
      "pk": 14018022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 22,
      "text": "Now therefore, behold, the LORD has put a lying spirit in the mouth of these your prophets; the LORD has declared disaster concerning you.",
      "links": "<a href='/AIV/11/22/23'>1 Kings 22:23</a>; <a href='/AIV/23/29/10'>Isa. 29:10</a>",
      "comment": "Judgment comes on those who listen to false prophecy, highlighting the importance of spiritual discernment, tradition, and continuity for God’s people."
    },
    {
      "pk": 14018023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 23,
      "text": "Then Zedekiah the son of Chenaanah came near and struck Micaiah on the cheek, and said, 'Which way did the Spirit of the LORD go from me to speak to you?'",
      "links": "<a href='/AIV/11/22/24'>1 Kings 22:24</a>; <a href='/AIV/40/26/67'>Matt. 26:67</a>",
      "comment": "The prophet’s suffering is a foreshadowing of Christ and His apostles being struck and persecuted for speaking truth (cf. Matthew 26:67)."
    },
    {
      "pk": 14018024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 24,
      "text": "And Micaiah said, 'Behold, you shall see on that day when you go into an inner chamber to hide yourself.'",
      "links": "<a href='/AIV/11/22/25'>1 Kings 22:25</a>",
      "comment": "Prophetic warnings are confirmed by coming events. Such moments reinforce faith in the living and active guidance of God’s word."
    },
    {
      "pk": 14018025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 25,
      "text": "And the king of Israel said, 'Seize Micaiah and take him back to Amon, the governor of the city, and to Joash the king’s son;",
      "links": "<a href='/AIV/11/22/26'>1 Kings 22:26</a>",
      "comment": "Faithful messengers often face persecution and marginalization, as would many prophets and later the apostles."
    },
    {
      "pk": 14018026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 26,
      "text": "and say, ‘Thus says the king: “Put this man in prison and feed him with meager rations of bread and water until I return in peace.”’",
      "links": "<a href='/AIV/11/22/27'>1 Kings 22:27</a>",
      "comment": "The cost of fidelity to the Word includes suffering and deprivation—a theme fulfilled by Christ and echoed in the lives of the saints."
    },
    {
      "pk": 14018027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 27,
      "text": "And Micaiah said, 'If you return in peace, the LORD has not spoken by me.' And he said, 'Hear, all you peoples!'",
      "links": "<a href='/AIV/11/22/28'>1 Kings 22:28</a>; <a href='/AIV/33/1/2'>Micah 1:2</a>",
      "comment": "True prophecy is vindicated by its fulfillment. The appeal to all people hints toward the universal scope of God’s revelation."
    },
    {
      "pk": 14018028,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 28,
      "text": "So the king of Israel and Jehoshaphat king of Judah went up to Ramoth-gilead.",
      "links": "<a href='/AIV/11/22/29'>1 Kings 22:29</a>",
      "comment": "Despite the warning, both kings proceed, reflecting the persistent tendency of humanity to trust in human plans rather than divine wisdom."
    },
    {
      "pk": 14018029,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 29,
      "text": "And the king of Israel said to Jehoshaphat, 'I will disguise myself and go into the battle, but you wear your robes.' So the king of Israel disguised himself, and they went into the battle.",
      "links": "<a href='/AIV/11/22/30'>1 Kings 22:30</a>",
      "comment": "Ahab’s decision to disguise himself shows his desire to escape divine judgment by human cunning—a futile effort."
    },
    {
      "pk": 14018030,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 30,
      "text": "Now the king of Syria had commanded the captains of his chariots, 'Do not fight with anyone small or great, but only with the king of Israel.'",
      "links": "<a href='/AIV/11/22/31'>1 Kings 22:31</a>",
      "comment": "Divine justice works even through the decisions of foreign kings, showing God’s sovereign oversight."
    },
    {
      "pk": 14018031,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 31,
      "text": "And when the captains of the chariots saw Jehoshaphat, they said, 'It is the king of Israel.' So they turned to fight against him, and Jehoshaphat cried out, and the LORD helped him. God drew them away from him.",
      "links": "<a href='/AIV/11/22/32'>1 Kings 22:32</a>",
      "comment": "When Jehoshaphat cries out, God responds—the importance of prayer in moments of distress is a recurring theme throughout the Scriptures."
    },
    {
      "pk": 14018032,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 32,
      "text": "For as soon as the captains of the chariots saw that it was not the king of Israel, they turned back from pursuing him.",
      "links": "<a href='/AIV/11/22/33'>1 Kings 22:33</a>",
      "comment": "Jehoshaphat’s deliverance further proves divine control over battle and destiny, a picture of God’s ongoing deliverance of His faithful."
    },
    {
      "pk": 14018033,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 33,
      "text": "But a certain man drew his bow at random and struck the king of Israel between the joints of the armor. Therefore he said to the driver of his chariot, 'Turn around and carry me out of the battle, for I am wounded.'",
      "links": "<a href='/AIV/11/22/34'>1 Kings 22:34</a>",
      "comment": "Even a chance arrow fulfills the word of the LORD; God’s providence ultimately prevails over all schemes."
    },
    {
      "pk": 14018034,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 18,
      "verse": 34,
      "text": "And the battle grew fierce that day; and the king of Israel was propped up in his chariot facing the Syrians until evening. And about sunset he died.",
      "links": "<a href='/AIV/11/22/35'>1 Kings 22:35</a>",
      "comment": "Prophecy is accomplished in detail, showing that all God’s words will unfailingly be fulfilled. This points to the faithfulness of God’s promises, both of judgment and redemption."
    }
  ],
  "translatedAt": "2025-12-24T04:30:37.695Z"
}