{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 15,
  "verses": [
    {
      "pk": 14015001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 1,
      "text": "Now the Spirit of God came upon Azariah the son of Oded.",
      "links": "<a href='/AIV/7/3/10'>Judg. 3:10</a>; <a href='/AIV/14/24/20'>2Chr. 24:20</a>",
      "comment": "The empowerment of Azariah by the Spirit signifies direct divine intervention. Prophetic inspiration is a recurring theme showing God's ongoing guidance of His people."
    },
    {
      "pk": 14015002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 2,
      "text": "He went out to meet Asa and said to him, 'Hear me, Asa, and all Judah and Benjamin: The Lord is with you when you are with Him. If you seek Him, He will be found by you, but if you abandon Him, He will abandon you.'",
      "links": "<a href='/AIV/11/3/14'>1 Kgs. 3:14</a>; <a href='/AIV/14/12/5'>2Chr. 12:5</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "This highlights God's conditional covenant: faithful pursuit of the Lord brings blessing. See Jer. 29:13, which echoes seeking and finding God—a theme seen throughout Scripture."
    },
    {
      "pk": 14015003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 3,
      "text": "Now for a long time Israel was without the true God, without a teaching priest, and without the law.",
      "links": "<a href='/AIV/28/3/4'>Hos. 3:4</a>; <a href='/AIV/3/10/11'>Lev. 10:11</a>",
      "comment": "Notice the lack of a teaching priest and the law, which implies that priestly mediation was essential for Israel’s relationship with God. This foreshadows the importance of authority and sacred tradition continuing in the faith community."
    },
    {
      "pk": 14015004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 4,
      "text": "But in their distress they turned to the Lord, the God of Israel, and sought Him, and He was found by them.",
      "links": "<a href='/AIV/5/4/29'>Deut. 4:29</a>; <a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "God’s mercy in response to repentance is a recurring biblical motif. This verse points forward to the themes of searching for God and His readiness to respond to humble seekers."
    },
    {
      "pk": 14015005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 5,
      "text": "In those times there was no peace for anyone who went out or came in, for great turmoil was on all the inhabitants of the lands.",
      "links": "<a href='/AIV/7/5/6'>Judg. 5:6</a>; <a href='/AIV/23/48/22'>Isa. 48:22</a>",
      "comment": "The lack of peace is presented as a consequence of abandoning God; spiritual disorder often leads to societal turmoil."
    },
    {
      "pk": 14015006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 6,
      "text": "Nation was crushed by nation and city by city, for God caused all kinds of distress among them.",
      "links": "<a href='/AIV/7/2/14'>Judg. 2:14</a>; <a href='/AIV/19/106/41-42'>Ps. 106:41-42</a>",
      "comment": "God's providence in history includes judgment as a means to bring His people back to Himself, emphasizing that disunity apart from God leads to chaos."
    },
    {
      "pk": 14015007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 7,
      "text": "But you, be strong and do not let your hands grow weak, for your work will be rewarded.'",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>; <a href='/AIV/46/15/58'>1 Cor. 15:58</a>",
      "comment": "Encouragement not to lose heart in serving God. The promise of reward echoes into New Testament teaching on perseverance and the heavenly reward."
    },
    {
      "pk": 14015008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 8,
      "text": "When Asa heard these words, and the prophecy of Azariah the son of Oded the prophet, he took courage and removed the abominable idols from all the land of Judah and Benjamin and from the cities he had captured in the hill country of Ephraim. He renewed the altar of the Lord that was before the porch of the Lord.",
      "links": "<a href='/AIV/11/15/12-14'>1 Kgs. 15:12-14</a>; <a href='/AIV/14/4/19'>2Chr. 4:19</a>",
      "comment": "Asa's reforms show the need not just for individual repentance, but corporate renewal and purification, centered on right worship and restoration of sacrifice."
    },
    {
      "pk": 14015009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 9,
      "text": "He gathered all Judah and Benjamin, and those from Ephraim, Manasseh, and Simeon who sojourned with them, for many had come over to him from Israel when they saw that the Lord his God was with him.",
      "links": "<a href='/AIV/13/12/19'>1 Chr. 12:19</a>; <a href='/AIV/14/11/16'>2Chr. 11:16</a>",
      "comment": "Unity of God’s people around true worship attracted even those from divided tribes, a foreshadowing of the eventual gathering of all God's people into one spiritual family."
    },
    {
      "pk": 14015010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 10,
      "text": "So they gathered at Jerusalem in the third month, in the fifteenth year of Asa’s reign.",
      "links": "<a href='/AIV/3/23/15'>Lev. 23:15</a>; <a href='/AIV/5/16/9-10'>Deut. 16:9-10</a>",
      "comment": "The third month corresponds to Pentecost, a major feast for communal worship. This communal renewal prefigures deeper gatherings of God’s people seen in the New Covenant."
    },
    {
      "pk": 14015011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 11,
      "text": "And they offered to the Lord that day, from the plunder they had brought, seven hundred oxen and seven thousand sheep.",
      "links": "<a href='/AIV/3/3/6'>Lev. 3:6</a>; <a href='/AIV/13/29/21'>1 Chr. 29:21</a>",
      "comment": "The giving of offerings from their victory emphasizes thanksgiving and restitution to God. The large numbers also signify the people's dedication and the solemnity of their renewal."
    },
    {
      "pk": 14015012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 12,
      "text": "They entered into a covenant to seek the Lord, the God of their fathers, with all their heart and with all their soul.",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/19/119/2'>Ps. 119:2</a>",
      "comment": "Renewal of covenant is central in Scripture. Here, wholehearted seeking of God anticipates the later call to wholehearted discipleship (cf. Jesus’ greatest commandment) and the communal nature of covenant faith."
    },
    {
      "pk": 14015013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 13,
      "text": "Whoever would not seek the Lord, the God of Israel, was to be put to death, whether young or old, man or woman.",
      "links": "<a href='/AIV/5/17/2'>Deut. 17:2</a>; <a href='/AIV/2/22/20'>Ex. 22:20</a>",
      "comment": "The severe penalty underlines the seriousness of apostasy in Old Testament law and highlights the gravity of the covenant community’s purity. While the New Testament emphasizes mercy, the seriousness of remaining in God’s covenant community remains."
    },
    {
      "pk": 14015014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 14,
      "text": "They took an oath to the Lord with a loud voice, with shouting and with trumpets and with horns.",
      "links": "<a href='/AIV/4/10/10'>Num. 10:10</a>; <a href='/AIV/16/10/29'>Neh. 10:29</a>",
      "comment": "The public, communal oath with ritual song and music reflects the importance of formal liturgical acts in covenant renewal—a pattern found throughout salvation history."
    },
    {
      "pk": 14015015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 15,
      "text": "And all Judah rejoiced about the oath, for they had sworn with all their heart and sought Him with all their desire, and He was found by them. So the Lord gave them rest all around.",
      "links": "<a href='/AIV/19/32/6'>Ps. 32:6</a>; <a href='/AIV/19/105/4'>Ps. 105:4</a>",
      "comment": "Wholehearted worship leads to rejoicing and peace. Spiritual rest, prefiguring the rest promised to God’s people in Christ (Heb. 4:9), comes to the obedient community."
    },
    {
      "pk": 14015016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 16,
      "text": "He even removed Maacah, the mother of King Asa, from being queen mother, because she had made an abominable image for Asherah. Asa cut down her idol, crushed it, and burned it at the brook Kidron.",
      "links": "<a href='/AIV/11/15/13'>1 Kgs. 15:13</a>; <a href='/AIV/12/23/6'>2 Kgs. 23:6</a>",
      "comment": "Asa’s zeal upheld righteous worship over familial relations. The destruction of idolatry, even by royal family members, shows how leadership must submit to the law of God above all."
    },
    {
      "pk": 14015017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 17,
      "text": "But the high places were not taken away from Israel. Nevertheless, the heart of Asa was fully committed all his days.",
      "links": "<a href='/AIV/11/15/14'>1 Kgs. 15:14</a>; <a href='/AIV/14/20/33'>2Chr. 20:33</a>",
      "comment": "Asa’s full devotion is commended, though not absolute reform is achieved. The persistence of high places shows the complexity of religious reform—a reminder of the ongoing call for renewal."
    },
    {
      "pk": 14015018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 18,
      "text": "He brought into the house of God the silver and the gold and the utensils that he and his father had dedicated.",
      "links": "<a href='/AIV/11/7/51'>1 Kgs. 7:51</a>; <a href='/AIV/13/29/8'>1 Chr. 29:8</a>",
      "comment": "Restoring the dedicated treasures to God’s house indicates respect for what is sacred and set apart. This foreshadows the concept of consecration of gifts for worship."
    },
    {
      "pk": 14015019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 15,
      "verse": 19,
      "text": "And there was no more war until the thirty-fifth year of Asa’s reign.",
      "links": "<a href='/AIV/14/14/1'>2Chr. 14:1</a>; <a href='/AIV/14/20/30'>2Chr. 20:30</a>",
      "comment": "The period of peace is a sign of God’s blessing for faithfulness. In Scripture, such rest often points ahead to the lasting peace promised in the fullness of God's kingdom."
    }
  ],
  "translatedAt": "2025-12-24T04:29:08.258Z"
}