{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 2,
  "verses": [
    {
      "pk": 14002001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 1,
      "text": "Solomon determined to build a house for the Name of the LORD, and a royal house for himself.",
      "links": "<a href='/AIV/11/5/5'>1 Kings 5:5</a>; <a href='/AIV/13/17/12'>1 Chr. 17:12</a>",
      "comment": "Solomon sets out to build both the temple (the LORD’s house) and his palace. The language of 'the Name of the LORD' refers to God’s presence dwelling especially in the temple. See also promises to David in 1 Chr. 17:12. This foreshadows the special dwelling of the LORD among His people."
    },
    {
      "pk": 14002002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 2,
      "text": "Solomon assigned seventy thousand men to bear burdens, eighty thousand to quarry stone in the hill country, and three thousand six hundred to supervise them.",
      "links": "<a href='/AIV/11/5/15-16'>1 Kings 5:15-16</a>",
      "comment": "This verse outlines the vast workforce for the temple – echoing Moses and the orderly service of God’s people. The numbers stress the scale and importance of this holy task."
    },
    {
      "pk": 14002003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 3,
      "text": "Solomon sent word to Huram the king of Tyre: 'As you did for my father David and sent him cedars to build himself a house to dwell in, so do for me.'",
      "links": "<a href='/AIV/11/5/2'>1 Kings 5:2</a>; <a href='/AIV/10/5/11'>2 Sam. 5:11</a>",
      "comment": "Huram (also spelled Hiram) cooperated with David and now Solomon. This recalls David as a type of Christ (the anointed king) and his son Solomon building God’s house, fulfilling the Davidic promise."
    },
    {
      "pk": 14002004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 4,
      "text": "'Behold, I am about to build a house for the Name of the LORD my God, to dedicate it to Him, to burn before Him incense of fragrant spices, for the regular showbread, and for burnt offerings morning and evening, on Sabbaths, new moons, and the appointed feasts of the LORD our God. This is a perpetual statute for Israel.'",
      "links": "<a href='/AIV/2/30/7-9'>Exod. 30:7-9</a>; <a href='/AIV/3/24/5-8'>Lev. 24:5-8</a>",
      "comment": "The temple is for constant, ordered worship – incense, showbread, offerings – reflecting continuity with Moses’ law. These elements stress God's real presence and foreshadow ongoing worship in the Church."
    },
    {
      "pk": 14002005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 5,
      "text": "'The house that I am about to build will be great, for our God is greater than all gods.'",
      "links": "<a href='/AIV/2/15/11'>Exod. 15:11</a>; <a href='/AIV/19/86/8-10'>Ps. 86:8-10</a>",
      "comment": "The greatness of the temple reflects God's incomparable majesty. This monotheistic statement sets the God of Israel above all others."
    },
    {
      "pk": 14002006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 6,
      "text": "'But who is able to build Him a house, since heaven and the highest heaven cannot contain Him? Who am I to build Him a house, except as a place to burn sacrifices before Him?'",
      "links": "<a href='/AIV/11/8/27'>1 Kings 8:27</a>; <a href='/AIV/44/7/48-50'>Acts 7:48-50</a>",
      "comment": "Solomon humbly acknowledges that no human building can contain God; the temple’s purpose is for sacrificial worship. This points ahead to Christ’s ultimate sacrifice which perfects all offerings."
    },
    {
      "pk": 14002007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 7,
      "text": "'So now send me a craftsman skilled in working in gold, silver, bronze, and iron, and in purple, crimson, and blue fabrics, and one who is skilled in engraving, to be with the skilled men who are with me in Judah and Jerusalem, whom David my father provided.'",
      "links": "<a href='/AIV/2/35/30-35'>Exod. 35:30-35</a>; <a href='/AIV/11/7/13-14'>1 Kings 7:13-14</a>",
      "comment": "The request for skilled craftsmen recalls Bezalel and the artisans of the tabernacle, showing the necessity of wisdom and beauty in worship. This elevates the value of material creation in serving God."
    },
    {
      "pk": 14002008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 8,
      "text": "'Send me also cedar, cypress, and algum logs from Lebanon, for I know that your servants have skill to cut timber there. My servants will work with your servants,'",
      "links": "<a href='/AIV/11/5/8-9'>1 Kings 5:8-9</a>",
      "comment": "Wood from Lebanon was renowned for quality. The partnership with the Gentile Tyre anticipates the ingrafting of the nations into the worship of the one true God."
    },
    {
      "pk": 14002009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 9,
      "text": "'to prepare timber in abundance, for the house I am about to build will be great and wonderful.'",
      "links": "<a href='/AIV/11/6/15'>1 Kings 6:15</a>",
      "comment": "Solomon emphasizes both the abundance and the glory of the temple as suitable for the God of Israel, reflecting the beauty and dignity fitting for divine worship."
    },
    {
      "pk": 14002010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 10,
      "text": "'I will provide for your servants, the woodcutters who cut the timber, twenty thousand cors of crushed wheat, twenty thousand cors of barley, twenty thousand baths of wine, and twenty thousand baths of oil.'",
      "links": "<a href='/AIV/11/5/11'>1 Kings 5:11</a>",
      "comment": "Solomon offers abundant provision in exchange—demonstrating generosity and reminding us of the reciprocal nature of fellowship in God’s work. The use of food and drink echoes the temple’s sacrificial system."
    },
    {
      "pk": 14002011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 11,
      "text": "Then Huram king of Tyre answered in a letter: 'Because the LORD loves His people, He has made you king over them.'",
      "links": "<a href='/AIV/47/5/14'>2 Cor. 5:14</a>",
      "comment": "The Gentile king recognizes that Solomon’s kingship is an act of divine love. This anticipates the full inclusion of the nations in the blessings of God’s kingdom in Christ."
    },
    {
      "pk": 14002012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 12,
      "text": "Huram said also: 'Blessed be the LORD, the God of Israel, who made heaven and earth, who has given King David a wise son, endowed with discretion and understanding, who will build a house for the LORD and a royal house for himself.'",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/11/3/12'>1 Kings 5:7</a>",
      "comment": "Huram’s praise echoes Genesis 1:1. The wisdom granted to Solomon to build foreshadows Christ, whom the New Testament calls the true Wisdom and Builder of God’s House."
    },
    {
      "pk": 14002013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 13,
      "text": "'Now I am sending a skilled man, endowed with understanding, Huram-abi,",
      "links": "<a href='/AIV/11/7/13-14'>1 Kings 7:13-14</a>",
      "comment": "Huram-abi is like Bezalel in Exodus, specially gifted by God’s Spirit. The tradition of apostolic succession passes skilled service from one to another, signifying continuity in God’s house."
    },
    {
      "pk": 14002014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 14,
      "text": "the son of a woman of the daughters of Dan, and his father was a man of Tyre. He is trained to work in gold, silver, bronze, iron, stone, and wood, and in purple, blue, fine linen, and crimson, and also to do all kinds of engraving and to execute any design assigned to him. He will work with your skilled men and with the skilled men of my lord David your father.'",
      "links": "<a href='/AIV/2/31/3'>Exod. 31:3</a>",
      "comment": "Huram-abi’s dual heritage (Israelite and Gentile) prefigures the uniting of Jew and Gentile in God’s service. His diverse skills show the importance of beauty and order in worship, and the role of the 'arts' in glorifying God."
    },
    {
      "pk": 14002015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 15,
      "text": "Now therefore, let my lord send to his servants the wheat, barley, oil, and wine as my lord has said.",
      "links": "<a href='/AIV/11/5/9-11'>1 Kings 5:9-11</a>",
      "comment": "Huram repeats Solomon’s offer of supplies. This underscores mutual giving and the necessity of supporting those who minister for the LORD—a principle continued in the Church."
    },
    {
      "pk": 14002016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 16,
      "text": "We will cut timber from Lebanon as much as you need, and we will bring it to you as rafts by sea to Joppa. From there you may take it up to Jerusalem.",
      "links": "<a href='/AIV/11/5/9'>1 Kings 5:9</a>; <a href='/AIV/16/3/7'>Ezra 3:7</a>",
      "comment": "Joppa served as Israel’s port for building God’s house, and later for restoration (Ezra 3:7)—foreshadowing mission, outreach, and the recurring centrality of the temple’s place in salvation history."
    },
    {
      "pk": 14002017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 17,
      "text": "Solomon counted all the resident aliens who were in the land of Israel, after the census that David his father had taken, and there were found to be 153,600.",
      "links": "<a href='/AIV/13/22/2'>1 Chr. 22:2</a>",
      "comment": "Solomon, like David, includes resident aliens in temple service. This reach toward the nations hints at God’s universal plan of salvation, embracing all peoples in worship. The number itself recalls the symbolic numbers chosen by Christ (e.g., John 21:11)."
    },
    {
      "pk": 14002018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 2,
      "verse": 18,
      "text": "He assigned seventy thousand of them to bear burdens, eighty thousand to quarry stone in the hill country, and three thousand six hundred overseers to make the people work.",
      "links": "<a href='/AIV/13/22/2'>1 Chr. 22:2</a>; <a href='/AIV/8/6/3'>Ezra 6:3</a>",
      "comment": "Solomon organizes the work for God’s house, involving the nations as laborers and establishing an ordered structure under leaders—prefiguring the orderly ministry and unity of the future Church built upon Christ as the cornerstone."
    }
  ],
  "translatedAt": "2025-12-24T04:22:20.243Z"
}