{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 10,
  "verses": [
    {
      "pk": 19010001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 1,
      "text": "King Xerxes imposed tribute both on the mainland and on the islands of the sea.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1</a>; <a href='/AIV/27/2/37-38'>Dan. 2:37-38</a>",
      "comment": "This verse emphasizes the extent of King Xerxes’ authority, ruling over a vast domain. The narrative context highlights the power and order established by earthly kings, setting up a contrast with the sovereignty of God (Dan. 2:37-38). The use of 'islands of the sea' references the broadness of his reign, similar to themes in Psalms about God's universal dominion (Ps. 72:8)."
    },
    {
      "pk": 19010002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 2,
      "text": "All the acts of his power and might, as well as the full account of the greatness of Mordecai, whom the king promoted, are they not written in the Book of the Chronicles of the kings of Media and Persia?",
      "links": "<a href='/AIV/17/2/21-23'>Esth. 2:21-23</a>; <a href='/AIV/16/7/5'>Neh. 7:5</a>",
      "comment": "This passage highlights the historical recording of great deeds and the honoring of Mordecai, echoing the biblical tradition of preserving memory and honoring virtue (Esth. 2:21-23). The mention of official chronicles suggests the importance of communal remembrance and tradition, pointing toward practices established by the early apostolic community in maintaining a faithful witness and authoritative record (Acts 1:21-26)."
    },
    {
      "pk": 19010003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 3,
      "text": "For Mordecai the Jew was second in rank to King Xerxes, and was great among the Jews, well-liked by the multitude of his people, seeking the good of his people and speaking peace to all their descendants.",
      "links": "<a href='/AIV/17/8/15'>Esth. 8:15</a>; <a href='/AIV/19/122/6-9'>Ps. 122:6-9</a>; <a href='/AIV/40/5/9'>Matt. 5:9</a>",
      "comment": "Mordecai’s position as advocate and peacemaker for his people mirrors aspects of biblical leadership, foreshadowing the role of Christ as mediator and advocate (Matt. 5:9; 1 Tim. 2:5). There is a spiritual application here, recognizing the significance of intercession for the community, a practice that developed in the early church’s ministry. Mordecai’s pursuit of peace and the common good reflects the scriptural call to seek the welfare of God’s people, a characteristic of authentic leadership and unity in the faith (Ps. 122:6-9)."
    },
    {
      "pk": 19010004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 4,
      "heading": "Addition F — Interpretation of Mordecai’s Dream",
      "text": "Then Mordecai said, 'These things have happened from God.'",
      "links": "<a href='/AIV/19/1/23'>Esth. 1:23</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "This addition states explicitly what Esther’s main narrative often implies: providence. Mordecai reads the reversal not as luck, but as God’s hidden governance of history."
    },
    {
      "pk": 19010005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 5,
      "text": "For I remember the dream that I saw concerning these matters, and not one thing has failed.",
      "links": "<a href='/AIV/19/1/23-27'>Esth. 1:23-27</a>",
      "comment": "The dream is understood as fulfilled revelation. God’s guidance is sometimes recognized only after events unfold, inviting the faithful to trust even before understanding."
    },
    {
      "pk": 19010006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 6,
      "text": "There was a little spring, and it became a river, and there was light, and the sun, and much water.",
      "links": "<a href='/AIV/43/7/38'>John 7:38</a>; <a href='/AIV/19/46/4'>Ps. 46:4</a>",
      "comment": "The spring-to-river image portrays deliverance growing from small beginnings into overwhelming grace. Light and sunrise are classic signs of salvation after darkness."
    },
    {
      "pk": 19010007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 7,
      "text": "The river is Esther, whom the king married and made queen.",
      "links": "<a href='/AIV/19/2/17'>Esth. 2:17</a>",
      "comment": "Esther’s exaltation is not mere romance or politics—it becomes the channel of salvation. God often raises the lowly in order to protect His people through unexpected instruments."
    },
    {
      "pk": 19010008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 8,
      "text": "The two dragons are Haman and myself.",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>; <a href='/AIV/19/6/10'>Esth. 6:10</a>",
      "comment": "The conflict is personified: the struggle is not abstract, but embodied in real agents of pride and fidelity. The “dragon” language underscores the intensity of the battle against God’s people."
    },
    {
      "pk": 19010009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 9,
      "text": "The nations are those that assembled to destroy the name of the Jews.",
      "links": "<a href='/AIV/19/3/6'>Esth. 3:6</a>",
      "comment": "What begins as one man’s hatred becomes a broader mobilization against a whole people. The addition highlights how quickly political power can amplify personal malice into communal danger."
    },
    {
      "pk": 19010010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 10,
      "text": "And my nation is this Israel, which cried to God and was saved. The Lord has saved his people and delivered us from all these evils. God worked signs and great wonders that have not been done among the nations.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "The core testimony is deliverance: God hears the cry of His people and acts. The language recalls the Exodus pattern—oppression, cry, rescue, and memorial."
    },
    {
      "pk": 19010011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 11,
      "text": "Therefore he appointed two lots—one for the people of God and one for all the nations—and these lots came at the appointed time and day of decision before God among all nations.",
      "links": "<a href='/AIV/20/16/33'>Prov. 16:33</a>",
      "comment": "The “lots” connect the dream to Purim (Pur = lot). What appears random is shown to be under God’s sovereignty, who directs outcomes beyond human control."
    },
    {
      "pk": 19010012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 12,
      "text": "And God remembered his people and had mercy on his inheritance.",
      "links": "<a href='/AIV/02/2/24'>Ex. 2:24</a>; <a href='/AIV/19/105/8'>Ps. 105:8</a>",
      "comment": "“Remembered” is covenant language: God is not forgetful, but faithful. This is the biblical assurance that the Lord remains committed to His promises even in exile and danger."
    },
    {
      "pk": 19010013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 10,
      "verse": 13,
      "text": "Therefore they keep these days in the month of Adar as days of Purim (that is, Lots), with an assembly and joy and gladness before God, throughout every generation forever among his people Israel.",
      "links": "<a href='/AIV/19/9/26-28'>Esth. 9:26-28</a>",
      "comment": "Deliverance is preserved through liturgical memory. Purim becomes a yearly proclamation that God overturns plots of destruction and keeps His people through every generation."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}