{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 13,
  "verses": [
    {
      "pk": 19013001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 1,
      "heading": "Addition C — Prayer of Mordecai",
      "text": "Then Mordecai prayed to the Lord and said, 'Lord, Lord, King Almighty, everything is in your power, and no one can resist you when you will to save.'",
      "links": "<a href='/AIV/14/20/6'>2 Chr. 20:6</a>",
      "comment": "Mordecai begins with adoration and faith in God’s sovereignty. In biblical prayer, remembering who God is comes before naming what we fear."
    },
    {
      "pk": 19013002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 2,
      "text": "'You made heaven and earth and everything under the heavens. You are Lord of all, and there is no one who can oppose you.'",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>",
      "comment": "The prayer anchors hope in creation: the One who made all things can also govern all things. This confession re-centers the heart in the middle of danger."
    },
    {
      "pk": 19013003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 3,
      "text": "'You know all things. You know that I did not refuse to bow to Haman out of pride or contempt. For the sake of my people, I would gladly have honored him; but I would not give to any man the honor due to you alone.'",
      "links": "<a href='/AIV/02/20/3-5'>Ex. 20:3-5</a>",
      "comment": "Mordecai clarifies his motive: fidelity to God, not personal stubbornness. His refusal is rooted in the first commandment—worship belongs to God alone."
    },
    {
      "pk": 19013004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 4,
      "text": "'Now, Lord, do not hand over your inheritance to destruction. We are sold to be destroyed, to be killed, and to be wiped out.'",
      "links": "<a href='/AIV/19/74/2'>Ps. 74:2</a>; <a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "He pleads for God’s people as God’s own possession—an appeal to covenant mercy. The wording echoes the genocidal decree, turning that threat into a direct petition before the Lord."
    },
    {
      "pk": 19013005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 5,
      "text": "'Hear our cry, have mercy on your people, and turn our mourning into joy, so that we may live and praise your name.'",
      "links": "<a href='/AIV/19/30/11-12'>Ps. 30:11-12</a>",
      "comment": "The goal of deliverance is worship: life restored so God may be praised. This is the movement of the Psalms—lament transformed into thanksgiving."
    },
    {
      "pk": 19013006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 6,
      "heading": "Addition C — Prayer of Esther",
      "text": "Queen Esther, seized with fear of death, sought refuge in the Lord and prayed,",
      "links": "<a href='/AIV/19/56/3-4'>Ps. 56:3-4</a>",
      "comment": "Esther’s prayer makes explicit what the narrative implies: before she enters the king’s court, she enters prayer. Fear becomes a doorway to faith."
    },
    {
      "pk": 19013007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 7,
      "text": "'Lord, God of Abraham, God of Isaac, and God of Jacob, blessed are you. Help me, for I am alone and have no helper but you.'",
      "links": "<a href='/AIV/02/3/6'>Ex. 3:6</a>",
      "comment": "She appeals to the God of the covenant and confesses total dependence. Esther’s strength is not her crown, but the Lord who keeps His promises."
    },
    {
      "pk": 19013008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 8,
      "text": "'You know that I hate the splendor of my position and the pride that surrounds me. I have not sought this honor for myself, and I have not been glad in the feast of the wicked.'",
      "links": "<a href='/AIV/19/26/4'>Ps. 26:4</a>",
      "comment": "Esther renounces worldly vanity and insists on interior fidelity. In a pagan court, she refuses to let pagan values shape her heart."
    },
    {
      "pk": 19013009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 9,
      "text": "'Put persuasive words in my mouth before the lion, and turn his heart to hate the one who fights against us, so that he and those who agree with him may perish.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "Esther asks for both wisdom in speech and God’s action upon the king’s heart. Salvation here depends on grace at work inside the very seat of power."
    },
    {
      "pk": 19013010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 10,
      "text": "'Deliver us by your hand, and help me, who am alone and have no helper but you, Lord.'",
      "links": "<a href='/AIV/19/109/26'>Ps. 109:26</a>",
      "comment": "She repeats her dependence, highlighting persevering prayer. The repetition itself resists despair and clings to mercy."
    },
    {
      "pk": 19013011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 13,
      "verse": 11,
      "text": "'Remember your covenant and reveal yourself in our distress. Let the nations know that you are the Lord, and that you have not abandoned your people.'",
      "links": "<a href='/AIV/02/2/24'>Ex. 2:24</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "The prayer ends by asking for God’s name to be honored among the nations. Deliverance is not only rescue—it is revelation of God’s faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}


