{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 1,
  "verses": [
    {
      "pk": 19001001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 1,
      "text": "In the days of Ahasuerus—the same Ahasuerus who ruled over one hundred and twenty-seven provinces from India to Cush—",
      "links": "<a href='/AIV/15/6/22'>Ezra 6:22</a>; <a href='/AIV/27/6/1'>Dan. 6:1</a>",
      "comment": "Ahasuerus is traditionally identified with Xerxes I. The extent of his reign is emphasized here. The number 127 signifies a complete and expansive dominion."
    },
    {
      "pk": 19001002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 2,
      "text": "in those days when King Ahasuerus sat on his royal throne in the citadel of Susa,",
      "links": "<a href='/AIV/16/1/1'>Neh. 1:1</a>; <a href='/AIV/27/8/2'>Dan. 8:2</a>",
      "comment": "Susa (Shushan) was the capital of Persia. The royal throne symbolizes absolute authority, hinting at the majesty and power yet also the fallibility of human rulers."
    },
    {
      "pk": 19001003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 3,
      "text": "in the third year of his reign, he held a banquet for all his officials and servants. The army of Persia and Media, the nobles, and the rulers of the provinces were before him,",
      "links": "<a href='/AIV/19/2/1'>Esth. 2:1</a>",
      "comment": "This scene prepares us for the importance of royal feasts in Persian culture and how decisions here echo throughout the story, affecting God’s people."
    },
    {
      "pk": 19001004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 4,
      "text": "as he displayed the riches of his splendid kingdom and the glory of his majesty for many days, one hundred and eighty days in all.",
      "links": "<a href='/AIV/12/20/13'>2 Kgs. 20:13</a>",
      "comment": "Such an extravagant display shows the fleeting nature of earthly glory (cf. 1 John 2:17), encouraging the reader to look for a greater and lasting kingdom."
    },
    {
      "pk": 19001005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 5,
      "text": "When these days were completed, the king gave for all the people present in the citadel of Susa, both great and small, a feast lasting seven days, in the courtyard of the king’s palace.",
      "links": "<a href='/AIV/19/7/2'>Esth. 7:2</a>",
      "comment": "The inclusion of all, great and small, hints at universal invitation—a sign later mirrored in God's inclusive call in salvation history."
    },
    {
      "pk": 19001006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 6,
      "text": "There were white and blue linen curtains held by cords of fine purple linen to silver rings and marble pillars, as well as couches of gold and silver on a mosaic pavement of alabaster, marble, mother of pearl, and precious stones.",
      "links": "<a href='/AIV/11/10/18-21'>1 Kgs. 10:18-21</a>",
      "comment": "The detailed description of materials mirrors the descriptions of the tabernacle and Temple (Ex. 26), suggesting a counterfeit of the true, divine sanctuary."
    },
    {
      "pk": 19001007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 7,
      "text": "Drinks were served in golden vessels of various kinds, and the royal wine was plentiful by the king’s generosity.",
      "links": "<a href='/AIV/19/5/6'>Esth. 5:6</a>",
      "comment": "The abundance of wine foreshadows later events (Esth. 5:6), and echoes feasts in biblical typology (cf. John 2:1-10)."
    },
    {
      "pk": 19001008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 8,
      "text": "The drinking was according to the law; none was compelled. For the king had ordered all the officials of his palace to do according to each man’s pleasure.",
      "links": "",
      "comment": "Unlike many ancient feasts, compulsion was not required here. It subtly suggests freedom, though within the boundaries set by the king, reminiscent of God's law of liberty (James 1:25)."
    },
    {
      "pk": 19001009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 9,
      "text": "Queen Vashti also held a feast for the women in the palace of King Ahasuerus.",
      "links": "",
      "comment": "Vashti's independent celebration signals her dignity and foreshadows her decisive action, which shifts the narrative, showing the impact of individual choices."
    },
    {
      "pk": 19001010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 10,
      "text": "On the seventh day, when the king’s heart was merry with wine, he commanded Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carcas, the seven eunuchs who served in the presence of King Ahasuerus,",
      "links": "",
      "comment": "The number seven is prominent—a biblical number often symbolizing completeness (Genesis 2:2-3; Revelation 1:4). Eunuchs were trusted royal servants, echoing service in the heavenly court."
    },
    {
      "pk": 19001011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 11,
      "text": "to bring Queen Vashti before the king, wearing the royal crown, to display her beauty to the peoples and the officials, for she was lovely to look at.",
      "links": "<a href='/AIV/19/2/17'>Esth. 2:17</a>",
      "comment": "Vashti is asked to be put on display, raising questions about dignity and purity. Her refusal will lead to a providential opening for Esther’s rise."
    },
    {
      "pk": 19001012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 12,
      "text": "But Queen Vashti refused to come at the command of the king delivered by the eunuchs. Then the king became very angry, and his wrath burned within him.",
      "links": "",
      "comment": "Vashti’s refusal is an assertion of her own honor and sets the backdrop for divine providence, as seen when God directs hearts for a greater purpose (Prov. 21:1)."
    },
    {
      "pk": 19001013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 13,
      "text": "Then the king said to the wise men, who understood the times—for this was the king’s procedure toward all who were versed in law and judgment—",
      "links": "<a href='/AIV/13/12/32'>1 Chr. 12:32</a>",
      "comment": "Worldly wisdom is sought, but the text implies God’s wisdom transcends human counsel (James 3:17)."
    },
    {
      "pk": 19001014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 14,
      "text": "the men nearest him being Carshena, Shethar, Admata, Tarshish, Meres, Marsena, and Memucan, the seven princes of Persia and Media, who saw the king's face and sat first in the kingdom:",
      "links": "",
      "comment": "Again, seven chief counselors, paralleling the heavenly court’s order (cf. Rev. 1:20)."
    },
    {
      "pk": 19001015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 15,
      "text": "“According to the law, what is to be done to Queen Vashti, because she has not obeyed the command of King Ahasuerus delivered by the eunuchs?”",
      "links": "",
      "comment": "The appeal to law above personal authority foreshadows the interplay of justice and mercy, bedrocks of biblical governance (Mic. 6:8)."
    },
    {
      "pk": 19001016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 16,
      "text": "Then Memucan said before the king and the officials, \"Queen Vashti has not only wronged the king, but also all the officials and all the people in all the provinces of King Ahasuerus.",
      "links": "",
      "comment": "Memucan broadens the matter, revealing concern about public example—actions in leadership affect the wider community, as taught consistently in the Bible (cf. Rom. 14:7)."
    },
    {
      "pk": 19001017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 17,
      "text": "For the queen's behavior will be known to all women, causing them to look with disdain on their husbands, when it is reported, 'King Ahasuerus commanded Queen Vashti to be brought before him, but she did not come.'\"",
      "links": "",
      "comment": "Social order and tradition are deeply valued, reflecting the biblical principle that authority must be respected (Rom. 13:1-2), though always in harmony with God’s law."
    },
    {
      "pk": 19001018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 18,
      "text": "This very day the noble women of Persia and Media who have heard of the queen’s behavior will respond in the same way to all the king’s officials, and there will be plenty of contempt and wrath.",
      "links": "",
      "comment": "Memucan fears revolution in social customs. Note how quickly legalism attempts to suppress threats, in contrast to the Gospel’s call to love and forgiveness."
    },
    {
      "pk": 19001019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 19,
      "text": "If it pleases the king, let a royal decree be issued by him and let it be written in the laws of Persia and Media so that it cannot be revoked, that Vashti shall never again come before King Ahasuerus, and let the king give her royal position to another who is better than she.",
      "links": "<a href='/AIV/19/3/12'>Esth. 3:12</a>",
      "comment": "Irrevocable law emphasizes the sovereignty and inflexibility of Persian law. Spiritually, it prefigures the transfer of privilege—the new queen will reflect God's mysterious choice of the humble (cf. Luke 1:52)."
    },
    {
      "pk": 19001020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 20,
      "text": "So when the king’s edict is proclaimed throughout his entire kingdom, vast as it is, all women will give honor to their husbands, both great and small.”",
      "links": "",
      "comment": "Focus on widespread proclamation prefigures the idea of universal law, echoed in the New Testament's call to proclaim the Gospel to all nations (Matt. 28:18-20)."
    },
    {
      "pk": 19001021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 21,
      "text": "This advice pleased the king and the officials, and the king did as Memucan proposed.",
      "links": "",
      "comment": "The king’s compliance shows the growing influence of his counselors, suggesting the need for wise, Spirit-led advisers in leadership (Prov. 11:14)."
    },
    {
      "pk": 19001022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 1,
      "verse": 22,
      "text": "He sent letters to all the royal provinces, to each province in its own script and to each people in their own language, that every man should be a master in his own house.",
      "links": "<a href='/AIV/44/2/6-11'>Acts 2:6-11</a>",
      "comment": "Communication in every language anticipates the Pentecost miracle, where the Holy Spirit enables the Gospel to reach all peoples. The theme of true authority in the household and the need for unity under righteous leadership emerges here."
    }
  ],
  "translatedAt": "2025-12-24T05:08:24.997Z"
}