{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 14,
  "verses": [
    {
      "pk": 19014001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 1,
      "heading": "Addition D — Esther Approaches the King",
      "text": "On the third day, Esther put on splendid royal attire and called upon God, who watches over all and saves.",
      "links": "<a href='/AIV/19/5/1'>Esth. 5:1</a>; <a href='/AIV/19/121/4'>Ps. 121:4</a>",
      "comment": "This addition makes Esther’s hidden reliance explicit: her courage is grounded in prayer. The “third day” continues to carry the biblical sense of decisive turning and deliverance."
    },
    {
      "pk": 19014002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 2,
      "text": "She was radiant in beauty, yet her heart was frozen with fear. She took two of her maids with her: she leaned gently on one, while the other followed, carrying her train.",
      "links": "",
      "comment": "The scene highlights both Esther’s dignity and her human weakness. Scripture often shows God working through fragile instruments so that deliverance is clearly His work, not theirs."
    },
    {
      "pk": 19014003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 3,
      "text": "As she passed through the doors, the king was seated on his royal throne, clothed in garments of majesty, shining with gold and precious stones; his face was fierce with anger.",
      "links": "",
      "comment": "The king’s “fierce” look underscores the real risk Esther takes. It sets up the theological point of the addition: the heart of the king is not ultimate—God is."
    },
    {
      "pk": 19014004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 4,
      "text": "Then God changed the king’s spirit to gentleness. He sprang from his throne, took Esther in his arms, and comforted her, saying, 'Take courage; you shall not die.'",
      "links": "<a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "This is the theological centerpiece: God can turn rulers’ hearts (Prov. 21:1). What looked like certain wrath becomes unexpected mercy through providence."
    },
    {
      "pk": 19014005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 5,
      "text": "Esther fainted, and the king supported her and spoke kindly until she regained strength.",
      "links": "",
      "comment": "Her fainting emphasizes the cost of intercession. Deliverance does not come by denying fear, but by bringing fear into the presence of God and pressing forward in obedience."
    },
    {
      "pk": 19014006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 14,
      "verse": 6,
      "text": "Then the king lifted the golden scepter and touched her, and asked again what she desired.",
      "links": "<a href='/AIV/19/5/2'>Esth. 5:2</a>",
      "comment": "The golden scepter remains the sign of acceptance and access. In biblical imagery, it points beyond Persian custom to the mercy by which one draws near and is heard."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}


