{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 11,
  "verses": [
    {
      "pk": 19011001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 11,
      "verse": 1,
      "heading": "Addition A — Prologue (Mordecai’s Dream)",
      "text": "Mordecai son of Jair, son of Shimei, son of Kish, of the tribe of Benjamin, who lived in Susa, had a dream and visions in the night.",
      "links": "<a href='/AIV/19/2/5'>Esth. 2:5</a>",
      "comment": "This prologue frames the whole story as guided by providence. Mordecai’s dream uses symbolic imagery, preparing the reader to see the coming conflict not merely as politics, but as part of a larger spiritual struggle."
    },
    {
      "pk": 19011002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 11,
      "verse": 2,
      "text": "He saw and heard a tumult: voices and uproar, thunder and earthquake, and confusion upon the earth.",
      "links": "<a href='/AIV/27/7/2'>Dan. 7:2</a>; <a href='/AIV/66/6/12'>Rev. 6:12</a>",
      "comment": "The language echoes apocalyptic scenes in Daniel and Revelation, highlighting that the events of Esther, though quiet on the surface, involve upheaval and judgment in the unseen order of history."
    },
    {
      "pk": 19011003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 11,
      "verse": 3,
      "text": "Then two great dragons came forward, both ready to fight; and their cry was so loud that all nations were stirred up to battle against the people of the righteous.",
      "links": "<a href='/AIV/66/12/7'>Rev. 12:7</a>",
      "comment": "The “two dragons” symbolize the coming clash of powers behind the narrative. Scripture often uses dragon imagery to depict violent opposition to God’s people, reminding us that persecution has both human and spiritual dimensions."
    },
    {
      "pk": 19011004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 11,
      "verse": 4,
      "text": "In that day, the righteous people cried out to God, and from their cry there came a little spring; it became a great river with abundant water. There was light and the sun rose.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>; <a href='/AIV/43/7/38'>John 7:38</a>",
      "comment": "The “little spring” becoming a river points to God’s saving work flowing from humble beginnings into overflowing deliverance. Light and sunrise are classic biblical signs of salvation after darkness."
    },
    {
      "pk": 19011005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 11,
      "verse": 5,
      "text": "Mordecai awoke and kept these things in his heart, seeking to understand what God intended to do.",
      "links": "<a href='/AIV/42/2/19'>Luke 2:19</a>",
      "comment": "Like Mary who “treasured” and pondered God’s works (<a href='/AIV/42/2/19'>Luke 2:19</a>), Mordecai responds with attentive discernment. The prologue teaches the reader to watch for God’s hidden hand throughout the book."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}