{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 3,
  "verses": [
    {
      "pk": 19003001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 1,
      "text": "After these things, King Xerxes promoted Haman son of Hammedatha the Agagite, raising him up and placing his seat above all the officials who were with him.",
      "links": "<a href='/AIV/9/15/8'>1 Sam. 15:8</a>",
      "comment": "Haman's lineage as an Agagite links him to Israel's ancient enemies, connecting this conflict with the spiritual struggle found throughout Scripture. The raising up of a single official foreshadows later biblical instances of promotion and authority. The king's action intensifies the tension between good and evil, which resonates with the drama seen throughout salvation history."
    },
    {
      "pk": 19003002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 2,
      "text": "All the king’s servants who were at the king’s gate bowed down and paid honor to Haman, for the king had so commanded concerning him. But Mordecai did not bow down or pay honor.",
      "links": "<a href='/AIV/27/3/12'>Dan. 3:12</a>; <a href='/AIV/2/20/5'>Ex. 20:5</a>",
      "comment": "Mordecai’s refusal to bow mirrors the faithfulness demanded in the law against idolatry and affirms the primacy of divine worship above human commands. This action recalls other biblical figures who remained steadfast under pressure, showing the importance of witness to truth in otherwise hostile environments."
    },
    {
      "pk": 19003003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 3,
      "text": "Then the king’s servants who were at the king’s gate said to Mordecai, 'Why do you disobey the king’s command?'",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>; <a href='/AIV/44/5/29'>Acts 5:29</a>",
      "comment": "The challenge put to Mordecai recalls the questioning of believers who stand against unjust or ungodly edicts. The contrast between obeying human authority and divine law is a recurrent biblical theme, showing the tension lived by God's people throughout history."
    },
    {
      "pk": 19003004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 4,
      "text": "Day after day they spoke to him, but he did not listen to them. Therefore, they told Haman, to see whether Mordecai’s words would stand, for he had told them that he was a Jew.",
      "links": "<a href='/AIV/42/21/12-13'>Luke 21:12-13</a>; <a href='/AIV/2/1/12'>Ex. 1:12</a>",
      "comment": "Mordecai’s identity as a Jew becomes central to the coming conflict, emphasizing the enduring tension between the chosen people and the world. His perseverance points towards the faithful witness required of all believers, especially in the face of ongoing pressure."
    },
    {
      "pk": 19003005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 5,
      "text": "When Haman saw that Mordecai did not bow down or pay him honor, Haman was filled with rage.",
      "links": "<a href='/AIV/40/27/18'>Matt. 27:18</a>; <a href='/AIV/1/4/7'>Gen. 4:7</a>",
      "comment": "Haman’s anger illustrates the destructive power of pride and jealousy—echoes of Cain's envy. This highlights the theme of opposition to righteousness, a motif running throughout the Old and New Testaments, ultimately culminating in the persecution of Christ."
    },
    {
      "pk": 19003006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 6,
      "text": "But he thought it beneath himself to attack only Mordecai. Instead, since they had made known to him Mordecai's people, Haman sought to destroy all the Jews throughout the whole kingdom of Xerxes.",
      "links": "<a href='/AIV/1/37/18-20'>Gen. 37:18-20</a>; <a href='/AIV/40/2/16'>Matt. 2:16</a>",
      "comment": "The plot to destroy an entire people recalls earlier persecutions and anticipates later episodes in salvation history. This foreshadows attacks against the people of God and offers a typology pointing forward to times of trial for the faithful."
    },
    {
      "pk": 19003007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 7,
      "text": "In the first month, the month of Nisan, in the twelfth year of King Xerxes, Pur—that is, the lot—was cast before Haman, day after day, to determine a suitable time. The lot fell on the twelfth month, the month of Adar.",
      "links": "<a href='/AIV/20/16/33'>Prov. 16:33</a>; <a href='/AIV/3/23/1'>Lev. 23:1'</a>",
      "comment": "Casting lots to determine fate reflects ancient practices but also points to divine providence at work, even when hidden. This theme of God guiding history through seemingly random events is echoed throughout biblical narrative."
    },
    {
      "pk": 19003008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 8,
      "text": "Then Haman said to King Xerxes, 'There is a certain people scattered and separated among the peoples in all the provinces of your kingdom. Their laws are different from those of every other people, and they do not keep the king’s laws. It is not fitting for the king to let them remain.'",
      "links": "<a href='/AIV/10/7/5-6'>2 Sam. 7:5-6</a>; <a href='/AIV/44/17/6-7'>Acts 17:6-7</a>",
      "comment": "Haman’s accusation focuses on the distinctiveness of God’s people, a recurring biblical motif. True worship often leads believers to be misunderstood and persecuted by worldly powers, echoing later instances in the early church."
    },
    {
      "pk": 19003009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 9,
      "text": "'If it pleases the king, let a decree be written to destroy them, and I will pay ten thousand talents of silver into the hands of those who oversee the work, to be brought into the king’s treasury.'",
      "links": "<a href='/AIV/40/26/15'>Matt. 26:15</a>; <a href='/AIV/7/16/18'>Judg. 16:18</a>",
      "comment": "The sum offered to enable mass destruction recalls other instances in Scripture where betrayal and injustice are motivated by money. This prefigures betrayals and wrongful plots carried out for earthly gain, contrasting the self-giving love shown by Christ."
    },
    {
      "pk": 19003010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 10,
      "text": "So the king took his signet ring from his hand and gave it to Haman son of Hammedatha the Agagite, the enemy of the Jews.",
      "links": "<a href='/AIV/1/41/42'>Gen. 41:42</a>; <a href='/AIV/27/6/17'>Dan. 6:17</a>",
      "comment": "The giving of the signet ring symbolizes the complete authority given, reminiscent of Joseph's elevation and other transfers of power in biblical history. Such authority, when misused, sets the stage for the drama of deliverance that follows."
    },
    {
      "pk": 19003011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 11,
      "text": "The king said to Haman, 'The silver is yours, and the people too; do with them as you think best.'",
      "links": "<a href='/AIV/2/1/22'>Ex. 1:22</a>",
      "comment": "This absolute delegation reflects a ruler’s detachment and foreshadows themes of stewardship seen in parabolic teachings of Jesus. Authority without discernment leads to injustice, highlighting the need for righteous governance."
    },
    {
      "pk": 19003012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 12,
      "text": "Then the king’s secretaries were summoned on the thirteenth day of the first month, and a decree was written exactly as Haman commanded, to the king’s satraps, the governors of each province, and the officials of every people, to every province in its own script and to every people in their own language. It was written in the name of King Xerxes and sealed with the king’s signet ring.",
      "links": "<a href='/AIV/24/22/10'>Jer. 22:10</a>; <a href='/AIV/44/2/8-11'>Acts 2:8-11</a>",
      "comment": "The meticulous distribution of the decree in every language echoes the universality of later biblical announcements, like Pentecost. Wickedness may seem to gain worldwide reach, but God's providence always protects His people and His plan."
    },
    {
      "pk": 19003013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 13,
      "text": "Letters were sent by couriers to all the king’s provinces, commanding them to destroy, kill, and annihilate all Jews—young and old, children and women—in one day, the thirteenth day of the twelfth month, the month of Adar, and to plunder their goods.",
      "links": "<a href='/AIV/2/1/16'>Ex. 1:16</a>; <a href='/AIV/40/2/16'>Matt. 2:16</a>",
      "comment": "The decree’s severity echoes atrocities against innocent people found throughout Scripture, calling to mind the slaughter of the innocents in the time of Moses and Christ. These stories prefigure the ultimate deliverance God brings through unexpected means."
    },
    {
      "pk": 19003014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 14,
      "text": "A copy of the edict was to be proclaimed as law in every province, made known to all peoples, so that they should be ready for that day.",
      "links": "<a href='/AIV/10/8/15'>2 Sam. 8:15</a>; <a href='/AIV/40/24/44'>Matt. 24:44</a>",
      "comment": "The decree’s demand for readiness points to the theme of watchfulness and preparedness, prominent in Jesus’ teaching on vigilance for God's intervention. The narrative foreshadows the sudden reversals in salvation history and the security found in faithful expectation of deliverance."
    },
    {
      "pk": 19003015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 15,
      "text": "The couriers went out quickly by order of the king, and the decree was issued in the citadel of Susa. As the king and Haman sat down to drink, the city of Susa was thrown into confusion.",
      "links": "<a href='/AIV/23/22/13'>Isa. 22:13</a>; <a href='/AIV/40/27/36'>Matt. 27:36</a>",
      "comment": "While those in authority rest in comfort, the people are thrown into terror—a pattern seen when worldly rulers plot against the innocent. Christ’s own suffering is foreshadowed by a world that often ignores injustice, yet the Lord remains active behind the scenes, working out redemption through His hidden providence."
    },
    {
      "pk": 19003016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 16,
      "heading": "Addition B — Haman’s Edict",
      "text": "The great King Xerxes writes to the satraps of the one hundred and twenty-seven provinces from India to Cush, and to the governors under them, as follows:",
      "links": "<a href='/AIV/19/3/12'>Esth. 3:12</a>; <a href='/AIV/19/8/9'>Esth. 8:9</a>",
      "comment": "This “royal letter” is presented as an official justification for violence. Its polished language masks a policy of genocide, showing how evil often clothes itself in bureaucratic order and persuasive rhetoric."
    },
    {
      "pk": 19003017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 17,
      "text": "When I came to rule over many peoples and to hold sway over the whole world, I was not carried away by my authority, but have aimed to govern fairly and with mildness. I determined to provide for my subjects a life of lasting tranquility, to make my kingdom orderly and safe for travel to its farthest borders, and to restore the peace desired by all people.",
      "links": "",
      "comment": "The edict begins with self-congratulation and “peace” language, a common propaganda move: it frames the coming oppression as necessary for public order rather than as cruelty."
    },
    {
      "pk": 19003018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 18,
      "text": "When I consulted my counselors as to how this might be accomplished, Haman, who excels among us in wisdom, who is outstanding for constant good will and steadfast loyalty, and who has gained a place in the kingdom second only to me,",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>",
      "comment": "Haman is praised as uniquely loyal and wise, illustrating how flattering reputations can be weaponized. Scripture repeatedly warns that wicked counsel can corrupt rulers when discernment is absent."
    },
    {
      "pk": 19003019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 19,
      "text": "brought it to our attention that, mixed among all the nations throughout the world, there is one people of ill will, which by its laws is opposed to every other people and continually disregards the decrees of kings, so that the unity of empire, blamelessly designed by us, cannot be established.",
      "links": "<a href='/AIV/19/3/8'>Esth. 3:8</a>",
      "comment": "This paragraph repeats Haman’s accusation (Esth. 3:8) and turns religious distinctiveness into a political threat. It’s a textbook example of scapegoating: painting a minority as disloyal in order to justify persecution."
    },
    {
      "pk": 19003020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 20,
      "text": "Having noted, therefore, that this nation, and it alone, is continually at variance with all people, lives by strange and foreign laws, is hostile to our government, and does all the harm it can to undermine the stability of the kingdom,",
      "links": "",
      "comment": "The language intensifies into fearmongering and dehumanization. The irony is that the Jews’ “foreign laws” are the covenant commands of God—faithfulness that becomes costly when empires demand absolute conformity."
    },
    {
      "pk": 19003021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 21,
      "text": "we hereby decree that all those who are identified to you in the letters of Haman, who is in charge of the administration and is a second father to us, shall, together with their wives and children, be utterly destroyed by the swords of their enemies, without any pity or mercy, on the fourteenth day of the twelfth month (Adar) of the present year;",
      "links": "<a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "The decree explicitly targets entire families, revealing the totalizing nature of the plot. The date set in Adar ties directly to the narrative reversal later, where the day intended for destruction becomes a day of deliverance."
    },
    {
      "pk": 19003022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 3,
      "verse": 22,
      "text": "so that when these people, whose ill will is of long standing, have gone down into Hades by a violent death on a single day, they may leave our government completely stable and undisturbed for the future.",
      "links": "<a href='/AIV/19/9/1'>Esth. 9:1</a>",
      "comment": "The edict’s goal is “stability” achieved through extermination—an inversion of justice. Esther’s story answers this logic with providence: God overturns the plot, and true peace comes through the protection of the innocent, not their removal."
    }
  ],
  "translatedAt": "2025-12-24T05:09:11.884Z"
}