{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 12,
  "verses": [
    {
      "pk": 19012001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 1,
      "heading": "Addition B — Haman’s Edict",
      "text": "The great King Xerxes writes to the satraps of the one hundred and twenty-seven provinces from India to Cush, and to the governors under them, as follows:",
      "links": "<a href='/AIV/19/3/12'>Esth. 3:12</a>; <a href='/AIV/19/8/9'>Esth. 8:9</a>",
      "comment": "This “royal letter” is presented as an official justification for violence. Its polished language masks a policy of genocide, showing how evil often clothes itself in bureaucratic order and persuasive rhetoric."
    },
    {
      "pk": 19012002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 2,
      "text": "When I came to rule over many peoples and to hold sway over the whole world, I was not carried away by my authority, but have aimed to govern fairly and with mildness. I determined to provide for my subjects a life of lasting tranquility, to make my kingdom orderly and safe for travel to its farthest borders, and to restore the peace desired by all people.",
      "links": "",
      "comment": "The edict begins with self-congratulation and “peace” language, a common propaganda move: it frames the coming oppression as necessary for public order rather than as cruelty."
    },
    {
      "pk": 19012003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 3,
      "text": "When I consulted my counselors as to how this might be accomplished, Haman, who excels among us in wisdom, who is outstanding for constant good will and steadfast loyalty, and who has gained a place in the kingdom second only to me,",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>",
      "comment": "Haman is praised as uniquely loyal and wise, illustrating how flattering reputations can be weaponized. Scripture repeatedly warns that wicked counsel can corrupt rulers when discernment is absent."
    },
    {
      "pk": 19012004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 4,
      "text": "brought it to our attention that, mixed among all the nations throughout the world, there is one people of ill will, which by its laws is opposed to every other people and continually disregards the decrees of kings, so that the unity of empire, blamelessly designed by us, cannot be established.",
      "links": "<a href='/AIV/19/3/8'>Esth. 3:8</a>",
      "comment": "This paragraph repeats Haman’s accusation (Esth. 3:8) and turns religious distinctiveness into a political threat. It’s a textbook example of scapegoating: painting a minority as disloyal in order to justify persecution."
    },
    {
      "pk": 19012005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 5,
      "text": "Having noted, therefore, that this nation, and it alone, is continually at variance with all people, lives by strange and foreign laws, is hostile to our government, and does all the harm it can to undermine the stability of the kingdom,",
      "links": "",
      "comment": "The language intensifies into fearmongering and dehumanization. The irony is that the Jews’ “foreign laws” are the covenant commands of God—faithfulness that becomes costly when empires demand absolute conformity."
    },
    {
      "pk": 19012006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 6,
      "text": "we hereby decree that all those who are identified to you in the letters of Haman, who is in charge of the administration and is a second father to us, shall, together with their wives and children, be utterly destroyed by the swords of their enemies, without any pity or mercy, on the fourteenth day of the twelfth month (Adar) of the present year;",
      "links": "<a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "The decree explicitly targets entire families, revealing the totalizing nature of the plot. The date set in Adar ties directly to the narrative reversal later, where the day intended for destruction becomes a day of deliverance."
    },
    {
      "pk": 19012007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 12,
      "verse": 7,
      "text": "so that when these people, whose ill will is of long standing, have gone down into Hades by a violent death on a single day, they may leave our government completely stable and undisturbed for the future.",
      "links": "<a href='/AIV/19/9/1'>Esth. 9:1</a>",
      "comment": "The edict’s goal is “stability” achieved through extermination—an inversion of justice. Esther’s story answers this logic with providence: God overturns the plot, and true peace comes through the protection of the innocent, not their removal."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}


