{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 8,
  "verses": [
    {
      "pk": 19008001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 1,
      "text": "On that same day King Xerxes gave Queen Esther the house of Haman, the enemy of the Jews. And Mordecai came before the king, for Esther had told what relation he was to her.",
      "links": "<a href='/AIV/19/2/22'>Esth. 2:22</a>; <a href='/AIV/19/7/6'>Esth. 7:6</a>",
      "comment": "By revealing her relationship to Mordecai, Esther places her trust in both the king and God’s providence. This act demonstrates divine guidance at work, a theme seen throughout Scripture, emphasizing faith and obedience (cf. Gen. 45:4; Rom. 8:28)."
    },
    {
      "pk": 19008002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 2,
      "text": "The king took off his signet ring, which he had taken from Haman, and gave it to Mordecai. Esther appointed Mordecai over Haman’s house.",
      "links": "<a href='/AIV/19/3/10'>Esth. 3:10</a>; <a href='/AIV/1/41/41-44'>Gen. 41:41-44</a>",
      "comment": "The signet ring is a symbol of royal authority, echoing Joseph's rise in Egypt. Esther acts as both intercessor and mediator, elevating Mordecai—a foreshadowing of how those faithful to God are raised up. See also Rom. 8:17, where believers become co-heirs with Christ."
    },
    {
      "pk": 19008003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 3,
      "text": "Esther spoke again before the king. She fell at his feet, weeping and pleading with him to put an end to the evil scheme Haman the Agagite had planned against the Jews.",
      "links": "<a href='/AIV/19/4/8'>Esth. 4:8</a>; <a href='/AIV/19/7/3-4'>Esth. 7:3-4</a>",
      "comment": "Esther’s humility and bold intercession prefigure the Church’s relentless prayer before God for deliverance (cf. Rom. 8:26). Her plea for her people highlights the power of persistent intercession."
    },
    {
      "pk": 19008004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 4,
      "text": "The king held out to Esther the golden scepter, so Esther arose and stood before the king.",
      "links": "<a href='/AIV/19/5/2'>Esth. 5:2</a>",
      "comment": "The golden scepter represents royal favor and acceptance, foreshadowing the access believers have to God through grace. This act signals the importance of mediation and proper approach to authority."
    },
    {
      "pk": 19008005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 5,
      "text": "She said, 'If it pleases the king, and if I have found favor in his sight, and if the matter seems right to the king and I am pleasing in his eyes, let an order be written to revoke the letters sent by Haman son of Hammedatha the Agagite, which he wrote to destroy the Jews in all the king’s provinces.'",
      "links": "<a href='/AIV/19/3/12-13'>Esth. 3:12-13</a>",
      "comment": "Esther demonstrates wisdom and humility, couching her request with repeated appeals to the king’s judgment. It reminds us of the reverence owed to God in prayer, as seen in Christ's example (Matt. 6:10)."
    },
    {
      "pk": 19008006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 6,
      "text": "For how can I bear to see the calamity that will come upon my people? Or how can I endure to see the destruction of my family?",
      "links": "<a href='/AIV/19/4/1'>Esth. 4:1</a>",
      "comment": "Esther’s selfless concern parallels the grief of Moses (Ex. 32:32) and Paul (Rom. 9:2-3) for their people. This echoes the suffering of Christ who bears the burden for His people (Heb. 5:7-9)."
    },
    {
      "pk": 19008007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 7,
      "text": "Then King Xerxes said to Queen Esther and to Mordecai the Jew, 'See, I have given Esther the house of Haman, and they have impaled him on the stake because he tried to lay his hand on the Jews.'",
      "links": "<a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "The king formally acknowledges the justice rendered, showing his favor has shifted. This change reveals how divine providence can overturn evil (Prov. 21:1), and is a reminder that God's justice ultimately prevails."
    },
    {
      "pk": 19008008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 8,
      "text": "But you may write as you see fit concerning the Jews, in the king’s name, and seal it with the king’s signet ring. For a document written in the king’s name and sealed with the king’s ring cannot be revoked.",
      "links": "<a href='/AIV/19/1/19'>Esth. 1:19</a>; <a href='/AIV/19/3/12'>Esth. 3:12</a>",
      "comment": "Once the king's decree is sealed, it is irrevocable—just as God's promises are sure and unbreakable (Num. 23:19; Rom. 11:29). This acts as a reminder of God's unchanging faithfulness."
    },
    {
      "pk": 19008009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 9,
      "text": "So the king’s scribes were summoned at that time, in the third month (that is, the month of Sivan), on the twenty-third day. An edict was written, according to all that Mordecai commanded, to the Jews, the satraps, governors, and officials of the provinces from India to Cush—127 provinces—to each province in its own script and to each people in its own language, and to the Jews in their own writing and language.",
      "links": "<a href='/AIV/19/1/1'>Esth. 1:1</a>; <a href='/AIV/19/3/12'>Esth. 3:12</a>",
      "comment": "Just as at Pentecost the Holy Spirit spoke to every nation in their own language (Acts 2:6-11), so here the message reaches everyone without distinction, foreshadowing the universal nature of God’s saving plan."
    },
    {
      "pk": 19008010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 10,
      "text": "He wrote in the name of King Xerxes, sealed it with the king’s signet ring, and sent the letters by mounted couriers riding swift horses bred from the royal stables.",
      "links": "<a href='/AIV/19/3/13-15'>Esth. 3:13-15</a>",
      "comment": "The speed and authority with which the decree is sent highlights the urgency and reliability of God’s word spreading throughout all lands (cf. Ps. 147:15)."
    },
    {
      "pk": 19008011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 11,
      "text": "In these letters the king permitted the Jews in every city to gather and defend their lives, to destroy, kill, and annihilate armed forces of any people or province that might attack them, along with their children and women, and to plunder their goods.",
      "links": "<a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "This is not a call to vengeance, but a divinely sanctioned self-defense. The emphasis on unity in the face of evil recalls the Church’s call to spiritual warfare (Eph. 6:12-18)."
    },
    {
      "pk": 19008012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 12,
      "text": "This would happen on a single day in all the provinces of King Xerxes—on the thirteenth day of the twelfth month (Adar).",
      "links": "<a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "A set day for deliverance points to God’s providential timing in salvation history, culminating ultimately in Christ’s appointed hour (John 12:23, Gal. 4:4)."
    },
    {
      "pk": 19008013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 13,
      "text": "A copy of the written decree was issued as a law in every province and proclaimed to all peoples, that the Jews should be ready on that day to take vengeance on their enemies.",
      "links": "<a href='/AIV/19/8/11'>Esth. 8:11</a>",
      "comment": "The public proclamation of the decree mirrors the way the Gospel is to be proclaimed to all nations (Matt. 28:19), calling all people to be prepared for deliverance."
    },
    {
      "pk": 19008014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 14,
      "text": "Riders mounted on royal horses quickly left, spurred on by the king’s command, and the decree was issued in Susa, the citadel.",
      "links": "<a href='/AIV/19/3/15'>Esth. 3:15</a>",
      "comment": "The rapid transmission of the decree underscores the zeal and care with which God works to save His people. It is reminiscent of how the message of salvation spreads swiftly when empowered by God’s Spirit."
    },
    {
      "pk": 19008015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 15,
      "text": "Mordecai went out from the presence of the king wearing royal robes of blue and white, a large crown of gold, and a purple garment of fine linen. And the city of Susa shouted and rejoiced.",
      "links": "<a href='/AIV/19/3/10'>Esth. 3:10</a>; <a href='/AIV/19/6/8'>Esth. 6:8</a>",
      "comment": "Mordecai’s exaltation and royal garments are reminiscent of priestly and kingly roles, reflecting a motif seen later fulfilled perfectly in Christ, the true King and High Priest (Heb. 4:14; Rev. 19:16)."
    },
    {
      "pk": 19008016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 16,
      "text": "The Jews had light and gladness and joy and honor.",
      "links": "<a href='/AIV/19/4/3'>Esth. 4:3</a>; <a href='/AIV/19/9/17-19'>Esth. 9:17-19</a>",
      "comment": "Light and joy in Scripture symbolize salvation and deliverance (Ps. 27:1; Isa. 60:1), anticipating the true Light to come in Christ (John 8:12)."
    },
    {
      "pk": 19008017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 17,
      "text": "In every province and every city, wherever the king’s command and his decree reached, there was joy and gladness among the Jews, with feasting and celebration. And many of the peoples of the land declared themselves Jews, for fear of the Jews had fallen upon them.",
      "links": "<a href='/AIV/19/9/2'>Esth. 9:2</a>; <a href='/AIV/2/12/38'>Exod. 12:38</a>",
      "comment": "The spread of joy and conversion hints at the prophetic promise that many nations will join God’s people (Isa. 56:6-8). The outward celebration and public witness recalls the visible, communal aspect of worship central throughout Scripture."
    },
    {
      "pk": 19008018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 18,
      "heading": "Addition E — Decree for the Jews",
      "text": "The great King Xerxes writes to the rulers of the one hundred and twenty-seven provinces from India to Cush, and to the governors under them, as follows:",
      "links": "<a href='/AIV/19/8/9'>Esth. 8:9</a>",
      "comment": "This addition presents the reversal as an official royal proclamation. It complements Esther 8 by giving a fuller “letter-style” explanation of the king’s change of policy."
    },
    {
      "pk": 19008019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 19,
      "text": "Many who have been honored with great kindness have become arrogant and sought to harm those who did them good, forgetting that all authority is accountable and that God judges every deed.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "The decree calls out the danger of pride within power. It echoes biblical wisdom: authority is stewardship, and pride invites downfall (Prov. 16:18)."
    },
    {
      "pk": 19008020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 20,
      "text": "For Haman, whom we had advanced above many, abused our trust and tried by deceit and slander to destroy Mordecai—our faithful servant—and the Jews, a people who live peacefully under our rule.",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>; <a href='/AIV/19/6/3'>Esth. 6:3</a>",
      "comment": "The letter reframes Haman’s plot as treachery against both the king and the innocent. It exposes how lies can weaponize political authority against a targeted people."
    },
    {
      "pk": 19008021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 21,
      "text": "But the one who devised this evil has fallen into the judgment he prepared for others. Haman has been executed, and his household has received the punishment fitting for his cruelty.",
      "links": "<a href='/AIV/20/26/27'>Prov. 26:27</a>; <a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "The reversal is stated as moral justice: the plotter is caught in his own trap. This is a repeated scriptural theme and a comfort to the oppressed."
    },
    {
      "pk": 19008022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 22,
      "text": "Therefore we annul the former letters, and we command that the Jews may live by their own laws and gather to defend themselves on the appointed day against those who would attack them.",
      "links": "<a href='/AIV/19/8/11'>Esth. 8:11</a>",
      "comment": "The core of the counter-edict is protection, not aggression: it authorizes lawful self-defense. Providence turns the machinery of empire from oppression to preservation."
    },
    {
      "pk": 19008023,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 23,
      "text": "Let this letter be publicly posted in every city, so that all may know our decision. And let the Jews keep these days as days of gladness and thanksgiving for their deliverance.",
      "links": "<a href='/AIV/19/9/20-22'>Esth. 9:20-22</a>",
      "comment": "The letter ties deliverance to public remembrance. Purim becomes a liturgical memory: God’s rescue is preserved through communal celebration and gratitude."
    },
    {
      "pk": 19008024,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 8,
      "verse": 24,
      "text": "Whoever ignores this decree or aids those who oppose it will bear the penalty of rebellion against the crown.",
      "links": "",
      "comment": "By attaching consequences, the king enforces the protection of an endangered people. Even in an imperfect system, God can compel rulers to restrain violence and uphold justice."
    }
  ],
  "translatedAt": "2025-12-24T05:11:04.845Z"
}