{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 15,
  "verses": [
    {
      "pk": 19015001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 1,
      "heading": "Addition E — Decree for the Jews",
      "text": "The great King Xerxes writes to the rulers of the one hundred and twenty-seven provinces from India to Cush, and to the governors under them, as follows:",
      "links": "<a href='/AIV/19/8/9'>Esth. 8:9</a>",
      "comment": "This addition presents the reversal as an official royal proclamation. It complements Esther 8 by giving a fuller “letter-style” explanation of the king’s change of policy."
    },
    {
      "pk": 19015002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 2,
      "text": "Many who have been honored with great kindness have become arrogant and sought to harm those who did them good, forgetting that all authority is accountable and that God judges every deed.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "The decree calls out the danger of pride within power. It echoes biblical wisdom: authority is stewardship, and pride invites downfall (Prov. 16:18)."
    },
    {
      "pk": 19015003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 3,
      "text": "For Haman, whom we had advanced above many, abused our trust and tried by deceit and slander to destroy Mordecai—our faithful servant—and the Jews, a people who live peacefully under our rule.",
      "links": "<a href='/AIV/19/3/1'>Esth. 3:1</a>; <a href='/AIV/19/6/3'>Esth. 6:3</a>",
      "comment": "The letter reframes Haman’s plot as treachery against both the king and the innocent. It exposes how lies can weaponize political authority against a targeted people."
    },
    {
      "pk": 19015004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 4,
      "text": "But the one who devised this evil has fallen into the judgment he prepared for others. Haman has been executed, and his household has received the punishment fitting for his cruelty.",
      "links": "<a href='/AIV/20/26/27'>Prov. 26:27</a>; <a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "The reversal is stated as moral justice: the plotter is caught in his own trap. This is a repeated scriptural theme and a comfort to the oppressed."
    },
    {
      "pk": 19015005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 5,
      "text": "Therefore we annul the former letters, and we command that the Jews may live by their own laws and gather to defend themselves on the appointed day against those who would attack them.",
      "links": "<a href='/AIV/19/8/11'>Esth. 8:11</a>",
      "comment": "The core of the counter-edict is protection, not aggression: it authorizes lawful self-defense. Providence turns the machinery of empire from oppression to preservation."
    },
    {
      "pk": 19015006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 6,
      "text": "Let this letter be publicly posted in every city, so that all may know our decision. And let the Jews keep these days as days of gladness and thanksgiving for their deliverance.",
      "links": "<a href='/AIV/19/9/20-22'>Esth. 9:20-22</a>",
      "comment": "The letter ties deliverance to public remembrance. Purim becomes a liturgical memory: God’s rescue is preserved through communal celebration and gratitude."
    },
    {
      "pk": 19015007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 15,
      "verse": 7,
      "text": "Whoever ignores this decree or aids those who oppose it will bear the penalty of rebellion against the crown.",
      "links": "",
      "comment": "By attaching consequences, the king enforces the protection of an endangered people. Even in an imperfect system, God can compel rulers to restrain violence and uphold justice."
    }
  ],
  "translatedAt": "2025-12-24T05:11:49.704Z"
}


