{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 4,
  "verses": [
    {
      "pk": 19004001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 1,
      "text": "When Mordecai learned everything that had happened, he tore his clothes, put on sackcloth and ashes, and went out into the midst of the city, crying out with a loud and bitter voice.",
      "links": "<a href='/AIV/16/9/1'>Neh. 9:1</a>; <a href='/AIV/18/2/12'>Job 2:12</a>; <a href='/AIV/23/22/12'>Isa. 22:12</a>",
      "comment": "Mourning through sackcloth and ashes is a biblical sign of repentance and distress (<a href='/AIV/23/22/12'>Isaiah 22:12</a>). Here, Mordecai responds to the edict threatening the Jews, foreshadowing the importance of communal intercession and penance as a spiritual act."
    },
    {
      "pk": 19004002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 2,
      "text": "He came as far as the king’s gate, since no one wearing sackcloth was allowed to enter the king’s gate.",
      "links": "<a href='/AIV/17/2/19'>Esth. 2:19</a>",
      "comment": "The Persian custom barred those in mourning from entering the royal presence, emphasizing the separation between earthly kingdoms and suffering. Spiritually, this reminds us of the need for interior preparation before approaching God’s holiness."
    },
    {
      "pk": 19004003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 3,
      "text": "In every province where the king’s command and decree reached, there was great mourning among the Jews, with fasting, weeping, and lamenting, and many lay in sackcloth and ashes.",
      "links": "<a href='/AIV/27/9/3'>Dan. 9:3</a>; <a href='/AIV/29/2/12'>Joel 2:12</a>",
      "comment": "The Jews’ communal fasting and lamentation prefigure the importance of collective prayer and penance. This sets a precedent for fasting as a spiritual weapon in times of crisis (<a href='/AIV/27/9/3'>Daniel 9:3</a>)."
    },
    {
      "pk": 19004004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 4,
      "text": "When Esther’s maids and eunuchs came and told her, the queen was deeply distressed. She sent clothing to Mordecai to replace his sackcloth, but he would not accept them.",
      "links": "<a href='/AIV/17/2/7'>Esth. 2:7</a>",
      "comment": "Esther’s attempt to clothe Mordecai in regular garments shows her concern, but Mordecai’s refusal reinforces the proper time and place for mourning and fasting, highlighting the spiritual discipline of perseverance in prayer."
    },
    {
      "pk": 19004005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 5,
      "text": "Then Esther summoned Hathach, one of the king’s eunuchs appointed to attend her, and ordered him to find out what was troubling Mordecai and why.",
      "links": "<a href='/AIV/17/2/15'>Esth. 2:15</a>",
      "comment": "Esther’s use of intermediaries reflects the need for communication and mediation, which has a parallel in the tradition of intercessors and advocacy in the spiritual life."
    },
    {
      "pk": 19004006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 6,
      "text": "Hathach went out to Mordecai in the city square in front of the king's gate.",
      "links": "<a href='/AIV/17/2/19'>Esth. 2:19</a>",
      "comment": "The city square as a public place for exchange underscores how spiritual concerns can move from private meditation to public witness."
    },
    {
      "pk": 19004007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 7,
      "text": "Mordecai told him all that had happened, and how Haman had promised to pay ten thousand talents of silver to the king’s treasuries for the destruction of the Jews.",
      "links": "<a href='/AIV/17/3/9'>Esth. 3:9</a>",
      "comment": "The price on the Jewish people’s heads shows the severity of evil, and recalls the way unjust rulers abuse their wealth, which is also denounced in the prophets (<a href='/AIV/23/10/1-2'>Isaiah 10:1-2</a>)."
    },
    {
      "pk": 19004008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 8,
      "text": "He also gave him a copy of the written decree for their destruction, which had been issued in Susa, to show Esther and explain it to her, and told him to instruct her to go in to the king and plead for mercy and petition for her people.",
      "links": "<a href='/AIV/17/3/14'>Esth. 3:14</a>; <a href='/AIV/11/18/39'>1 Kings 18:39</a>",
      "comment": "Mordecai’s insistence on Esther’s intercession foreshadows the importance of advocating for others before rulers, hinting at the necessity of a mediator. This anticipation of intercessory prayer finds fulfillment in Christ’s own mediation for His people (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 19004009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 9,
      "text": "Hathach returned and told Esther what Mordecai had said.",
      "links": "<a href='/AIV/17/4/5'>Esth. 4:5</a>",
      "comment": "The faithful delivery of Mordecai’s message shows the importance of truthfully passing on an urgent spiritual summons."
    },
    {
      "pk": 19004010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 10,
      "text": "Then Esther spoke to Hathach and ordered him to take a message back to Mordecai:",
      "links": "",
      "comment": "Esther’s continued use of an intermediary highlights the need for humble mediation—an important aspect in many spiritual traditions."
    },
    {
      "pk": 19004011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 11,
      "text": "‘All the king’s officials and the people of the king's provinces know that for any man or woman who goes to the king in the inner court without being summoned, there is one law: to be put to death, unless the king extends the golden scepter to them so that they may live. But I have not been called to go to the king for thirty days.’",
      "links": "<a href='/AIV/17/5/2'>Esth. 5:2</a>",
      "comment": "The severity of Persian law demonstrates the peril of approaching authority without invitation. Spiritually, the golden scepter can symbolize the grace through which one finds favor—pointing toward the mercy we receive when seeking access to God."
    },
    {
      "pk": 19004012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 12,
      "text": "When Esther’s message was reported to Mordecai,",
      "links": "",
      "comment": "This brief report sets up Mordecai’s pivotal response, emphasizing how guidance may come through wise counsel in times of crisis."
    },
    {
      "pk": 19004013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 13,
      "text": "Mordecai replied, ‘Do not think that you alone, in the king’s palace, will escape more than any other Jew.",
      "links": "<a href='/AIV/17/7/4'>Esth. 7:4</a>",
      "comment": "Mordecai’s exhortation affirms the unity and shared fate of God’s people, much like how each member of the body of believers is responsible for the welfare of others (<a href='/AIV/46/12/26'>1 Cor. 12:26</a>)."
    },
    {
      "pk": 19004014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 14,
      "text": "For if you keep silent at this time, relief and deliverance will come to the Jews from another place, but you and your father’s house will perish. And who knows whether you have come to the kingdom for just such a time as this?’",
      "links": "<a href='/AIV/01/45/7'>Gen. 45:7</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "Mordecai’s recognition of providence (“for such a time as this”) underlines God’s sovereignty and the importance of vocation. This echoes Joseph’s words (<a href='/AIV/01/45/7'>Genesis 45:7</a>) and points toward how every believer is called for a purpose in God’s plan."
    },
    {
      "pk": 19004015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 15,
      "text": "Then Esther sent this reply to Mordecai:",
      "links": "",
      "comment": "Esther’s response leads into action based on communal discernment, mirroring the way decisions in the community of faith are guided by mutual counsel."
    },
    {
      "pk": 19004016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 16,
      "text": "‘Go, gather all the Jews in Susa, and fast for me; do not eat or drink for three days, night or day. My maids and I will do the same. Then I will go to the king, even though it is against the law; and if I perish, I perish.’",
      "links": "<a href='/AIV/27/6/18'>Dan. 6:18</a>; <a href='/AIV/44/9/9'>Acts 9:9</a>",
      "comment": "Esther calls for communal fasting before her risky intercession, emphasizing the power of united prayer and sacrifice. This also foreshadows the sacrificial willingness required of true disciples (<a href='/AIV/42/22/42'>Luke 22:42</a>)."
    },
    {
      "pk": 19004017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 17,
      "text": "So Mordecai went away and did all that Esther had ordered him.",
      "links": "<a href='/AIV/17/5/1'>Esth. 5:1</a>",
      "comment": "Mordecai’s obedience highlights the harmony that comes when leaders’ directions are followed by the faithful. This mutual submission under God’s guidance anticipates the unity of the people of God in faith and action."
    },
    {
      "pk": 19004018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 18,
      "heading": "Addition C — Prayer of Mordecai",
      "text": "Then Mordecai prayed to the Lord and said, 'Lord, Lord, King Almighty, everything is in your power, and no one can resist you when you will to save.'",
      "links": "<a href='/AIV/14/20/6'>2 Chr. 20:6</a>",
      "comment": "Mordecai begins with adoration and faith in God’s sovereignty. In biblical prayer, remembering who God is comes before naming what we fear."
    },
    {
      "pk": 19004019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 19,
      "text": "'You made heaven and earth and everything under the heavens. You are Lord of all, and there is no one who can oppose you.'",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>",
      "comment": "The prayer anchors hope in creation: the One who made all things can also govern all things. This confession re-centers the heart in the middle of danger."
    },
    {
      "pk": 19004020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 20,
      "text": "'You know all things. You know that I did not refuse to bow to Haman out of pride or contempt. For the sake of my people, I would gladly have honored him; but I would not give to any man the honor due to you alone.'",
      "links": "<a href='/AIV/02/20/3-5'>Ex. 20:3-5</a>",
      "comment": "Mordecai clarifies his motive: fidelity to God, not personal stubbornness. His refusal is rooted in the first commandment—worship belongs to God alone."
    },
    {
      "pk": 19004021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 21,
      "text": "'Now, Lord, do not hand over your inheritance to destruction. We are sold to be destroyed, to be killed, and to be wiped out.'",
      "links": "<a href='/AIV/19/74/2'>Ps. 74:2</a>; <a href='/AIV/19/3/13'>Esth. 3:13</a>",
      "comment": "He pleads for God’s people as God’s own possession—an appeal to covenant mercy. The wording echoes the genocidal decree, turning that threat into a direct petition before the Lord."
    },
    {
      "pk": 19004022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 22,
      "text": "'Hear our cry, have mercy on your people, and turn our mourning into joy, so that we may live and praise your name.'",
      "links": "<a href='/AIV/19/30/11-12'>Ps. 30:11-12</a>",
      "comment": "The goal of deliverance is worship: life restored so God may be praised. This is the movement of the Psalms—lament transformed into thanksgiving."
    },
    {
      "pk": 19004023,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 23,
      "heading": "Addition C — Prayer of Esther",
      "text": "Queen Esther, seized with fear of death, sought refuge in the Lord and prayed,",
      "links": "<a href='/AIV/19/56/3-4'>Ps. 56:3-4</a>",
      "comment": "Esther’s prayer makes explicit what the narrative implies: before she enters the king’s court, she enters prayer. Fear becomes a doorway to faith."
    },
    {
      "pk": 19004024,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 24,
      "text": "'Lord, God of Abraham, God of Isaac, and God of Jacob, blessed are you. Help me, for I am alone and have no helper but you.'",
      "links": "<a href='/AIV/02/3/6'>Ex. 3:6</a>",
      "comment": "She appeals to the God of the covenant and confesses total dependence. Esther’s strength is not her crown, but the Lord who keeps His promises."
    },
    {
      "pk": 19004025,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 25,
      "text": "'You know that I hate the splendor of my position and the pride that surrounds me. I have not sought this honor for myself, and I have not been glad in the feast of the wicked.'",
      "links": "<a href='/AIV/19/26/4'>Ps. 26:4</a>",
      "comment": "Esther renounces worldly vanity and insists on interior fidelity. In a pagan court, she refuses to let pagan values shape her heart."
    },
    {
      "pk": 19004026,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 26,
      "text": "'Put persuasive words in my mouth before the lion, and turn his heart to hate the one who fights against us, so that he and those who agree with him may perish.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "Esther asks for both wisdom in speech and God’s action upon the king’s heart. Salvation here depends on grace at work inside the very seat of power."
    },
    {
      "pk": 19004027,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 27,
      "text": "'Deliver us by your hand, and help me, who am alone and have no helper but you, Lord.'",
      "links": "<a href='/AIV/19/109/26'>Ps. 109:26</a>",
      "comment": "She repeats her dependence, highlighting persevering prayer. The repetition itself resists despair and clings to mercy."
    },
    {
      "pk": 19004028,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 4,
      "verse": 28,
      "text": "'Remember your covenant and reveal yourself in our distress. Let the nations know that you are the Lord, and that you have not abandoned your people.'",
      "links": "<a href='/AIV/02/2/24'>Ex. 2:24</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "The prayer ends by asking for God’s name to be honored among the nations. Deliverance is not only rescue—it is revelation of God’s faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T05:09:33.316Z"
}