{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 2,
  "verses": [
    {
      "pk": 11002001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 1,
      "text": "When David’s time to die drew near, he commanded Solomon his son, saying:",
      "links": "<a href='/AIV/13/28/9'>1 Chr. 28:9</a>; <a href='/AIV/10/23/1-3'>2 Sam. 23:1-3</a>",
      "comment": "David’s final instructions to Solomon show the importance of a father’s guidance. His blessings echo the tradition of passing spiritual and practical wisdom to successors, a practice seen elsewhere in Scripture (Gen. 49)."
    },
    {
      "pk": 11002002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 2,
      "text": "\"I am about to go the way of all the earth. Be strong, and show yourself a man,",
      "links": "<a href='/AIV/06/23/14'>Josh. 23:14</a>; <a href='/AIV/05/31/7'>Deut. 31:7</a>",
      "comment": "David encourages Solomon in words reminiscent of God’s instructions to Joshua. The exhortation to strength and courage is central to biblical leadership (Josh. 1:6-9)."
    },
    {
      "pk": 11002003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 3,
      "text": "and keep the charge of the LORD your God, walking in his ways and keeping his statutes, his commands, his ordinances, and his testimonies, as it is written in the Law of Moses, so that you may prosper in all that you do and wherever you turn;",
      "links": "<a href='/AIV/05/17/18-20'>Deut. 17:18-20</a>; <a href='/AIV/19/1/1-3'>Ps. 1:1-3</a>",
      "comment": "David emphasizes fidelity to God’s law as the path to success. This verse shows both the necessity of observing divine precepts and the blessings that follow—themes seen again in Psalm 1 and throughout the New Testament (e.g., Matt. 7:24-27; Jas. 1:25)."
    },
    {
      "pk": 11002004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 4,
      "text": "that the LORD may fulfill his word which he spoke concerning me, saying, ‘If your sons are careful about their way, walking before me in faithfulness with all their heart and with all their soul, you shall not lack a man on the throne of Israel.’",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>; <a href='/AIV/19/132/11-12'>Ps. 132:11-12</a>",
      "comment": "The conditional promise given to David finds its fulfillment in Christ, the eternal King (see Luke 1:32-33). This reveals the importance of lineage, obedience, and God’s faithfulness despite human failings."
    },
    {
      "pk": 11002005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 5,
      "text": "Moreover, you know what Joab the son of Zeruiah did to me, how he dealt with the two commanders of the armies of Israel, Abner the son of Ner and Amasa the son of Jether, whom he killed, avenging the blood of war in peacetime and putting the blood of war on the belt at his waist and on the sandals on his feet.",
      "links": "<a href='/AIV/10/3/27'>2 Sam. 3:27</a>; <a href='/AIV/10/20/10'>2 Sam. 20:10</a>",
      "comment": "David calls for justice, not personal vengeance, against Joab for his wrongful bloodshed (cf. Gen. 9:6). The king’s role as upholder of righteousness foreshadows Christ as the perfect King who dispenses true justice."
    },
    {
      "pk": 11002006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 6,
      "text": "Act therefore according to your wisdom, but do not let his gray head go down to Sheol in peace.",
      "links": "<a href='/AIV/10/23/6-7'>2 Sam. 23:6-7</a>",
      "comment": "David instructs Solomon to enact just punishment, mirroring the king’s duty to maintain order and righteousness in the kingdom—a principle reflected in St. Paul’s teaching on rulers (Rom. 13:4)."
    },
    {
      "pk": 11002007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 7,
      "text": "But show kindness to the sons of Barzillai the Gileadite, and let them be among those who eat at your table, for with such loyalty they helped me when I fled from Absalom your brother.",
      "links": "<a href='/AIV/10/17/27-29'>2 Sam. 17:27-29</a>; <a href='/AIV/10/19/31-39'>2 Sam. 19:31-39</a>",
      "comment": "Table fellowship symbolizes lasting covenant and favor (Luke 22:28-30). David’s command reflects the virtue of gratitude and illustrates the king’s role as benefactor and protector."
    },
    {
      "pk": 11002008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 8,
      "text": "And there is also with you Shimei the son of Gera, the Benjaminite from Bahurim, who cursed me with a grievous curse on the day I went to Mahanaim. But when he came down to meet me at the Jordan, I swore to him by the LORD, ‘I will not put you to death by the sword.’",
      "links": "<a href='/AIV/10/16/5-13'>2 Sam. 16:5-13</a>; <a href='/AIV/10/19/18-23'>2 Sam. 19:18-23</a>",
      "comment": "Forgiveness is shown by David’s earlier pardon, but prudence is also a kingly virtue. Justice involves both mercy and wise discernment (see Jas. 2:13)."
    },
    {
      "pk": 11002009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 9,
      "text": "Now, therefore, do not hold him guiltless, for you are a wise man; you will know what you ought to do to him, and you shall bring his gray head down with blood to Sheol.",
      "links": "<a href='/AIV/10/21/1'>2 Sam. 21:1</a>",
      "comment": "Solomon’s wisdom is emphasized. Kings are entrusted with difficult decisions, requiring both justice and discernment."
    },
    {
      "pk": 11002010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 10,
      "text": "Then David slept with his fathers and was buried in the city of David.",
      "links": "<a href='/AIV/44/2/29'>Acts 2:29</a>; <a href='/AIV/10/5/7'>2 Sam. 5:7</a>",
      "comment": "‘Slept with his fathers’ is a Hebrew idiom meaning death. The burial in Jerusalem underlines its importance as the center of worship and kingdom—a theme developed in the prophets and fulfilled in Christ."
    },
    {
      "pk": 11002011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 11,
      "text": "The time that David reigned over Israel was forty years; he reigned seven years in Hebron and thirty-three years in Jerusalem.",
      "links": "<a href='/AIV/10/5/4-5'>2 Sam. 5:4-5</a>",
      "comment": "David’s reign symbolizes completeness and foreshadows the eternal reign of the Messiah."
    },
    {
      "pk": 11002012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 12,
      "text": "Then Solomon sat on the throne of David his father, and his kingdom was firmly established.",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "The transfer of the throne solidifies the line of succession and God’s fidelity to His promise, prefiguring an unbroken spiritual authority that Christ fulfills (Luke 1:32)."
    },
    {
      "pk": 11002013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 13,
      "text": "Then Adonijah the son of Haggith came to Bathsheba the mother of Solomon, and she said, 'Do you come in peace?' He said, 'Yes, in peace.'",
      "links": "<a href='/AIV/11/1/5'>1 Kgs. 1:5</a>",
      "comment": "Bathsheba’s mediation foreshadows intercession as an important motif (see John 2:3-5; 1 Tim. 2:1)."
    },
    {
      "pk": 11002014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 14,
      "text": "Then he said, 'I have something to say to you.' She said, 'Speak.'",
      "links": "",
      "comment": "The request for a hearing shows respect, but also a hint of tension from prior events (see 1 Kgs. 1:5-10)."
    },
    {
      "pk": 11002015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 15,
      "text": "He said, 'You know that the kingdom was mine, and all Israel fully expected me to reign. But the kingdom has turned and become my brother’s, for it was from the LORD.'",
      "links": "<a href='/AIV/11/1/5'>1 Kgs. 1:5</a>",
      "comment": "Adonijah’s claim contrasts with God’s choice, highlighting divine sovereignty over kingship (Dan. 2:21)."
    },
    {
      "pk": 11002016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 16,
      "text": "And now I have one request to make of you; do not refuse me.' She said to him, 'Speak.'",
      "links": "",
      "comment": "Persistent intercession is again highlighted, paralleling the role of holy mediators throughout Scripture."
    },
    {
      "pk": 11002017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 17,
      "text": "So he said, 'Please ask King Solomon—he will not refuse you—to give me Abishag the Shunammite as my wife.'",
      "links": "<a href='/AIV/11/1/3-4'>1 Kgs. 1:3-4</a>",
      "comment": "Asking for the king’s concubine was a political move (cf. 2 Sam. 16:21-22), threatening the legitimacy of Solomon’s rule."
    },
    {
      "pk": 11002018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 18,
      "text": "Bathsheba said, 'Very well; I will speak to the king for you.'",
      "links": "",
      "comment": "Bathsheba’s willingness reflects her influential role, foreshadowing the queen mother’s special position in the kingdom (Jer. 13:18)."
    },
    {
      "pk": 11002019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 19,
      "text": "So Bathsheba went to King Solomon to speak to him on behalf of Adonijah. And the king rose to meet her, bowed before her, and sat on his throne. He had a throne brought for the king’s mother, and she sat at his right hand.",
      "links": "<a href='/AIV/19/45/9'>Ps. 45:9</a>; <a href='/AIV/24/13/18'>Jer. 13:18</a>",
      "comment": "The special honor shown to the king’s mother provides a biblical precedent for her unique intercessory role, which will later have spiritual implications for understanding Christ’s own kingdom."
    },
    {
      "pk": 11002020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 20,
      "text": "Then she said, 'I have just one small request to make of you; do not refuse me.' And the king said to her, 'Make your request, my mother, for I will not refuse you.'",
      "links": "<a href='/AIV/43/2/3-5'>John 2:3-5</a>",
      "comment": "Solomon’s response foreshadows the honor and authority the king grants his mother—a theme fulfilled by Mary as the mother of the true King (cf. John 2:3-5)."
    },
    {
      "pk": 11002021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 21,
      "text": "She said, 'Let Abishag the Shunammite be given to Adonijah your brother as his wife.'",
      "links": "",
      "comment": "The queen mother advocates for another, showing the power of intercessory petition."
    },
    {
      "pk": 11002022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 22,
      "text": "King Solomon answered his mother, 'And why do you ask Abishag the Shunammite for Adonijah? Ask for him the kingdom also; for he is my older brother—yes, and for Abiathar the priest and Joab the son of Zeruiah!'",
      "links": "<a href='/AIV/11/1/6-7'>1 Kgs. 1:6-7</a>",
      "comment": "Solomon perceives the political threat. The request is not merely personal but carries dynastic implications."
    },
    {
      "pk": 11002023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 23,
      "text": "Then King Solomon swore by the LORD, saying, 'May God punish me ever so severely if Adonijah has not spoken this word against his own life.'",
      "links": "",
      "comment": "The oath formula expresses seriousness (cf. Ruth 1:17). The sanctity of the Lord’s name marks key decisions in Israel."
    },
    {
      "pk": 11002024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 24,
      "text": "‘Now as the LORD lives, who has established me and set me on the throne of David my father, and who has made me a house as he promised, Adonijah shall be put to death this day.’",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "Solomon’s assertion of divine legitimacy for his reign emphasizes that kingship comes from the Lord. The fulfillment motif carries through to Christ in the Gospels (Matt. 1:1)."
    },
    {
      "pk": 11002025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 25,
      "text": "So King Solomon sent Benaiah the son of Jehoiada, and he struck him down, and he died.",
      "links": "<a href='/AIV/13/27/5-6'>1 Chr. 27:5-6</a>",
      "comment": "Benaiah’s role as executioner demonstrates the king’s authority and the seriousness of rebellion."
    },
    {
      "pk": 11002026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 26,
      "text": "And to Abiathar the priest, the king said, ‘Go to Anathoth, to your fields, for you deserve to die. But I will not put you to death at this time, because you carried the ark of the Lord GOD before my father David, and because you shared in all my father’s affliction.’",
      "links": "<a href='/AIV/09/22/20'>1 Sam. 22:20</a>",
      "comment": "Solomon shows both justice and mercy. The removal of Abiathar foreshadows a change in priestly succession."
    },
    {
      "pk": 11002027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 27,
      "text": "So Solomon removed Abiathar from being priest to the LORD, fulfilling the word of the LORD that he had spoken over the house of Eli in Shiloh.",
      "links": "<a href='/AIV/09/2/31-35'>1 Sam. 2:31-35</a>",
      "comment": "The priestly line of Eli comes to an end, showing the importance of faithfulness in spiritual authority. Prophetically, this prefigures the transition to a new and enduring priesthood in Christ (Heb. 7:23-25)."
    },
    {
      "pk": 11002028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 28,
      "text": "When the news came to Joab—for Joab had supported Adonijah, although he had not supported Absalom—he fled to the tent of the LORD and took hold of the horns of the altar.",
      "links": "<a href='/AIV/02/21/14'>Ex. 21:14</a>",
      "comment": "Seeking asylum at the altar shows a belief in sanctuary, but capital crimes outweighed priestly immunity (cf. Ex. 21:14)."
    },
    {
      "pk": 11002029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 29,
      "text": "And it was told King Solomon, 'Joab has fled to the tent of the LORD, and he is beside the altar.' So Solomon sent Benaiah the son of Jehoiada, saying, 'Go, strike him down.'",
      "links": "",
      "comment": "Sanctuary is no refuge for unjust killers. God’s justice must not be evaded by mere ritual (Matt. 23:27-28)."
    },
    {
      "pk": 11002030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 30,
      "text": "So Benaiah went to the tent of the LORD and said to him, 'The king commands, ‘Come out.’' But he said, 'No, I will die here.' Then Benaiah brought word back to the king, saying, 'This is how Joab answered me.'",
      "links": "",
      "comment": "Joab's refusal displays guilt and fear. Obedience to the king is demanded, prefiguring loyal submission to God’s appointed authorities."
    },
    {
      "pk": 11002031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 31,
      "text": "The king said to him, 'Do as he said, strike him down and bury him, so that you may remove from me and my father’s house the guilt for the blood that Joab shed without cause.'",
      "links": "<a href='/AIV/04/35/33'>Num. 35:33</a>",
      "comment": "Shedding innocent blood defiles the land. Removing bloodguilt is central to justice (Num. 35:33)."
    },
    {
      "pk": 11002032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 32,
      "text": "The LORD will repay him for the blood he shed, because, unknowingly to my father David, he attacked and killed two men more righteous and better than himself—Abner the son of Ner, commander of the army of Israel, and Amasa the son of Jether, commander of the army of Judah.",
      "links": "<a href='/AIV/10/3/27'>2 Sam. 3:27</a>; <a href='/AIV/10/20/10'>2 Sam. 20:10</a>",
      "comment": "God’s retributive justice is underscored. He holds even leaders accountable, reflecting the divine standard given in the Law."
    },
    {
      "pk": 11002033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 33,
      "text": "So their blood shall return upon the head of Joab and his offspring forever. But to David and to his descendants, to his house and his throne, there shall be peace from the LORD forevermore.",
      "links": "<a href='/AIV/19/89/29'>Ps. 89:29</a>",
      "comment": "The curse and blessing formulas stress the seriousness of evil and the enduring nature of God’s chosen line."
    },
    {
      "pk": 11002034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 34,
      "text": "Then Benaiah the son of Jehoiada went up and struck Joab down and killed him. He was buried at his own house in the wilderness.",
      "links": "",
      "comment": "Joab’s solitary burial marks his separation from the community—a consequence of grave sin."
    },
    {
      "pk": 11002035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 35,
      "text": "The king put Benaiah the son of Jehoiada over the army in his place, and Zadok the priest the king put in the place of Abiathar.",
      "links": "<a href='/AIV/09/2/35'>1 Sam. 2:35</a>",
      "comment": "Kingdom offices pass to worthy successors—this echoes the principle of apostolic succession in spiritual offices, establishing continuity in leading God’s people."
    },
    {
      "pk": 11002036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 36,
      "text": "Then the king sent and summoned Shimei and said to him, 'Build yourself a house in Jerusalem and live there, and do not go out from there to any place whatever.",
      "links": "",
      "comment": "Solomon’s gracious restriction is both mercy and safeguard, seeking Shimei’s repentance and loyalty to the crown."
    },
    {
      "pk": 11002037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 37,
      "text": "For on the day you go out and cross the brook Kidron, know for certain that you shall die; your blood shall be on your own head.'",
      "links": "<a href='/AIV/10/15/23'>2 Sam. 15:23</a>",
      "comment": "Crossing Kidron signaled rebellion in David’s flight from Absalom (2 Sam. 15:23). Disobedience here brings self-inflicted judgment."
    },
    {
      "pk": 11002038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 38,
      "text": "And Shimei said to the king, 'The sentence is good. As my lord the king has said, so will your servant do.' So Shimei lived in Jerusalem many days.",
      "links": "",
      "comment": "Submission to authority brings life, even for those once rebellious. It’s a model for spiritual obedience and discipline."
    },
    {
      "pk": 11002039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 39,
      "text": "But after three years, two of Shimei’s servants ran away to Achish son of Maacah, king of Gath. And it was told Shimei, 'Behold, your servants are in Gath.'",
      "links": "",
      "comment": "The number three often marks a period of testing or completion in Scripture."
    },
    {
      "pk": 11002040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 40,
      "text": "And Shimei arose and saddled his donkey and went to Gath to Achish to seek his servants. Shimei went and brought his servants from Gath.",
      "links": "",
      "comment": "Disregarding the king’s command leads to downfall. The consequences of spiritual disobedience echo throughout Scripture."
    },
    {
      "pk": 11002041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 41,
      "text": "And Solomon was told that Shimei had gone from Jerusalem to Gath and returned.",
      "links": "",
      "comment": "Hidden sins are brought to light—God’s justice will not be escaped by stealth (Luke 12:2)."
    },
    {
      "pk": 11002042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 42,
      "text": "The king sent and summoned Shimei and said to him, 'Did I not make you swear by the LORD and warn you, saying, 'Know for sure that on the day you go out and go anywhere, you shall surely die'? And you said to me, 'The sentence is good; I accept.'",
      "links": "",
      "comment": "Swearing by the Lord increases the seriousness of the promise. Breaking such a vow is a grave matter (Matt. 5:33-37)."
    },
    {
      "pk": 11002043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 43,
      "text": "Why then have you not kept your oath to the LORD and the commandment that I gave you?'",
      "links": "",
      "comment": "The king holds Shimei accountable not just to himself, but to the Lord: divine and human authority are deeply connected."
    },
    {
      "pk": 11002044,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 44,
      "text": "The king also said to Shimei, 'You know in your heart all the evil that you did to David my father; so the LORD will return your evil on your own head.'",
      "links": "<a href='/AIV/19/7/16'>Ps. 7:16</a>",
      "comment": "An Old Testament theme: our sins return upon us unless repented, foreshadowing the importance of confession and absolution."
    },
    {
      "pk": 11002045,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 45,
      "text": "But King Solomon shall be blessed, and the throne of David shall be established before the LORD forever.",
      "links": "<a href='/AIV/19/89/4'>Ps. 89:4</a>",
      "comment": "The unconditional aspect of this promise points forward to the everlasting kingdom realized in Jesus Christ (Luke 1:32-33)."
    },
    {
      "pk": 11002046,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 2,
      "verse": 46,
      "text": "Then the king commanded Benaiah the son of Jehoiada, and he went out and struck him down, and he died. So the kingdom was firmly established in the hand of Solomon.",
      "links": "<a href='/AIV/11/2/12'>1 Kgs. 2:12</a>",
      "comment": "The kingdom’s establishment through rightful exercise of authority and removal of rebellion sets the stage for a strong and unified rule—anticipating the unbroken reign of the true Son of David who perfectly combines mercy, justice, and spiritual authority."
    }
  ],
  "translatedAt": "2025-12-24T03:28:38.944Z"
}