{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 6,
  "verses": [
    {
      "pk": 11006001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 1,
      "text": "In the four hundred and eightieth year after the Israelites came out of the land of Egypt, in the fourth year of Solomon’s reign over Israel, in the month of Ziv, which is the second month, he began to build the house of the LORD.",
      "links": "<a href='/AIV/2/12/40-41'>Ex. 12:40-41</a>; <a href='/AIV/14/3/1'>2 Chr. 3:1</a>",
      "comment": "The precision of the date emphasizes the historical reality of this event. Building the house of the LORD fulfilled God's promises; Solomon acts as a king-priest, foreshadowing a greater fulfillment in Christ, who is the true temple (see John 2:19-21)."
    },
    {
      "pk": 11006002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 2,
      "text": "The house that King Solomon built for the LORD was sixty cubits long, twenty cubits wide, and thirty cubits high.",
      "links": "<a href='/AIV/2/26/1'>Ex. 26:1</a>",
      "comment": "The temple's measurements mirror, but surpass, the tabernacle. The increasing size points to the growing revelation and glory of God dwelling among His people."
    },
    {
      "pk": 11006003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 3,
      "text": "The porch in front of the main hall of the house was twenty cubits long, corresponding to the width of the house, and ten cubits deep in front of the house.",
      "links": "<a href='/AIV/14/3/4'>2 Chr. 3:4</a>",
      "comment": "The porch or vestibule provides formal entry into the sanctuary, inviting worshippers into God’s presence. The design invites comparison to Christ, the Door (see John 10:9)."
    },
    {
      "pk": 11006004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 4,
      "text": "He made windows with recessed frames for the house.",
      "links": "<a href='/AIV/14/3/5'>2 Chr. 3:5</a>",
      "comment": "The windows, likely placed high, symbolized the temple as a place filled with divine light—a common spiritual interpretation is the enlightenment brought by the Holy Spirit."
    },
    {
      "pk": 11006005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 5,
      "text": "He built a structure along the wall of the house, running along the walls of the house both of the main hall and the inner sanctuary, and he made side chambers all around.",
      "links": "<a href='/AIV/26/41/5-6'>Ezek. 41:5-6</a>",
      "comment": "These side chambers provided both structural support and space for storing sacred items, showing that divine worship requires preparation and support."
    },
    {
      "pk": 11006006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 6,
      "text": "The lowest chamber was five cubits wide, the middle was six cubits wide, and the third was seven cubits wide; for he made ledges on the outside of the house all around so that the beams would not be inserted into the walls of the house.",
      "links": "",
      "comment": "Distinct levels and careful construction reflected the holiness and order in God’s house, a structure filled with meaning and hierarchy."
    },
    {
      "pk": 11006007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 7,
      "text": "The house was built with stone finished at the quarry, so that neither hammer nor axe nor any iron tool was heard in the house while it was being built.",
      "links": "<a href='/AIV/2/20/25'>Ex. 20:25</a>; <a href='/AIV/5/27/5'>Deut. 27:5</a>",
      "comment": "The silence during construction illustrated reverence and holiness. This prefigures how spiritual growth and the gathering of God’s temple (the Church) often happens quietly, away from the world’s noise."
    },
    {
      "pk": 11006008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 8,
      "text": "The door for the lowest side chamber was on the right side of the house, and they went up by winding stairs to the middle chamber, and from the middle to the third.",
      "links": "",
      "comment": "The upward movement first to the right, then spiraling higher, can be read allegorically as an image of spiritual ascent, ascending towards the holy."
    },
    {
      "pk": 11006009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 9,
      "text": "So Solomon built the house and finished it, and he covered the house with beams and boards of cedar.",
      "links": "<a href='/AIV/14/3/5'>2 Chr. 3:5</a>",
      "comment": "Cedar was a precious material, indicating worth and durability of God’s dwelling. It hints that worship should be directed to God with our best."
    },
    {
      "pk": 11006010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 10,
      "text": "He built the side chambers against the whole house, each five cubits high; and they were attached to the house with cedar beams.",
      "links": "",
      "comment": "Again, the sanctity and strength of the temple are emphasized. The house is being built to last, reflecting the abiding presence of the LORD in the midst of His people."
    },
    {
      "pk": 11006011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 11,
      "text": "Then the word of the LORD came to Solomon:",
      "links": "",
      "comment": "A divine interruption, reminding that the beauty and strength of the structure depend on covenant faithfulness, not just human effort."
    },
    {
      "pk": 11006012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 12,
      "text": "\"Concerning this house you are building: If you walk in My statutes and carry out My judgments and keep all My commandments and walk in them, I will establish My word with you, which I spoke to David your father;",
      "links": "<a href='/AIV/10/7/13'>2 Sam. 7:13</a>; <a href='/AIV/19/89/28-37'>Ps. 89:28-37</a>",
      "comment": "The promise to David and his line depends on faithfulness, echoing the themes of obedience leading to communal blessing. This mirrors how Christ fulfills all obedience (Rom. 5:19)."
    },
    {
      "pk": 11006013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 13,
      "text": "And I will dwell among the children of Israel, and will not forsake My people Israel.\"",
      "links": "<a href='/AIV/3/26/11-12'>Lev. 26:11-12</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s desire is to dwell among His people. This line hints at the future fullness of God’s presence with humanity in Christ (see John 1:14; Rev. 21:3)."
    },
    {
      "pk": 11006014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 14,
      "text": "So Solomon built the house and finished it.",
      "links": "",
      "comment": "A summary statement. The focus on completion underscores the importance of perseverance and fulfillment of God’s calling."
    },
    {
      "pk": 11006015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 15,
      "text": "He lined the inside walls of the house with cedar boards; from the floor of the house to the ceiling he covered the inside with wood, and he covered the floor of the house with planks of cypress.",
      "links": "",
      "comment": "The precious woods used for the interior signify beauty, reverence, and set-apartness for worship. They draw worshippers’ senses upward."
    },
    {
      "pk": 11006016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 16,
      "text": "He built twenty cubits at the rear of the house with cedar boards from the floor to the ceiling; and he built this within as an inner sanctuary, as the Most Holy Place.",
      "links": "<a href='/AIV/2/26/33-34'>Ex. 26:33-34</a>",
      "comment": "This inner sanctuary, the Most Holy Place, is where God’s presence dwelled above the ark, accessible only to the high priest once a year. It foreshadows Christ’s unique mediating role (Heb. 9:12)."
    },
    {
      "pk": 11006017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 17,
      "text": "The house, that is, the main hall in front of the inner sanctuary, was forty cubits long.",
      "links": "",
      "comment": "The relative sizes of the sanctuary and Most Holy Place emphasize the progression into greater holiness."
    },
    {
      "pk": 11006018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 18,
      "text": "The cedar inside the house was carved in the form of gourds and open flowers. All was cedar; there was no stone seen.",
      "links": "",
      "comment": "Carvings of creation recall Eden, symbolizing the restored presence of God with creation through His dwelling. The whole design points to a renewed relationship with pipeline between heaven and earth, as later fulfilled in Christ."
    },
    {
      "pk": 11006019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 19,
      "text": "He prepared an inner sanctuary within the house to set there the ark of the covenant of the LORD.",
      "links": "<a href='/AIV/2/25/21'>Ex. 25:21</a>",
      "comment": "The ark embodied the LORD’s throne and His covenant presence—an anticipation of the definitive indwelling of God among men through Christ (Heb. 9:4-12)."
    },
    {
      "pk": 11006020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 20,
      "text": "The inner sanctuary was twenty cubits long, twenty cubits wide, and twenty cubits high. He overlaid it with pure gold, and overlaid the altar with cedar.",
      "links": "",
      "comment": "The perfect cube design suggests heavenly perfection. The gold overlay denotes the purity and preciousness of God’s actual presence."
    },
    {
      "pk": 11006021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 21,
      "text": "So Solomon overlaid the inside of the house with pure gold. He made chains of gold across the front of the inner sanctuary and overlaid it with gold.",
      "links": "<a href='/AIV/14/3/7-8'>2 Chr. 3:7-8</a>",
      "comment": "The overwhelming use of gold in the Most Holy Place emphasizes the splendor and majesty of divine worship, expressing total dedication to God."
    },
    {
      "pk": 11006022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 22,
      "text": "He overlaid the whole house with gold, until all the house was finished. He also overlaid the entire altar that was by the inner sanctuary with gold.",
      "links": "",
      "comment": "Such lavishness for the altar accentuates the centrality of worship and offering. This urges Christians to offer their best to God, especially in worship—the altar is especially meaningful in the context of sacrifice (see Heb. 13:10)."
    },
    {
      "pk": 11006023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 23,
      "text": "In the inner sanctuary he made two cherubim of olive wood, each ten cubits high.",
      "links": "<a href='/AIV/2/25/18-20'>Ex. 25:18-20</a>",
      "comment": "The cherubim symbolize the divine throne room. Their presence points to worship aided by angelic hosts, a deep tradition connecting earthly and heavenly praise."
    },
    {
      "pk": 11006024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 24,
      "text": "The first cherub was ten cubits high. Both cherubim were of the same size and form.",
      "links": "",
      "comment": "Symmetry and order express beauty and perfection in the service of God, also reflected in liturgical worship traditions."
    },
    {
      "pk": 11006025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 25,
      "text": "The second cherub was also ten cubits. Both cherubim were of the same size and form.",
      "links": "",
      "comment": "This repetition underscores careful adherence to divine instruction—nothing in the sanctuary is by accident."
    },
    {
      "pk": 11006026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 26,
      "text": "The height of one cherub was ten cubits, and so was the other.",
      "links": "",
      "comment": "Uniformity in the cherubim further signals spiritual order and the symmetry of God’s dwelling."
    },
    {
      "pk": 11006027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 27,
      "text": "He placed the cherubim inside the inner sanctuary. Their wings were spread out so that the wing of one touched one wall, and the wing of the other cherub touched the other wall, with their wings touching each other in the middle of the house.",
      "links": "<a href='/AIV/2/25/20'>Ex. 25:20</a>",
      "comment": "The cherubim’s wings encompass the Most Holy Place; liturgically, this hints at both protection of the sacred and the mystery of God’s presence."
    },
    {
      "pk": 11006028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 28,
      "text": "He overlaid the cherubim with gold.",
      "links": "",
      "comment": "Covering even the angels in gold displays the importance and honor of God’s holiness and the heavenly hierarchy."
    },
    {
      "pk": 11006029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 29,
      "text": "He carved all the walls of the house all around with carved figures of cherubim, palm trees, and open flowers, inside and outside.",
      "links": "",
      "comment": "The imagery recalls Eden (Gen. 2), symbolizing the sanctuary as a restored paradise—a vision of union between God and humanity."
    },
    {
      "pk": 11006030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 30,
      "text": "He overlaid the floor of the house with gold, inside and out.",
      "links": "",
      "comment": "The golden floor points to the unapproachable majesty of God, with every part of the sanctuary expressing supernatural glory."
    },
    {
      "pk": 11006031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 31,
      "text": "For the entrance to the inner sanctuary he made doors of olive wood; the lintel and doorposts were one fifth of the wall.",
      "links": "",
      "comment": "The use of olive wood may symbolize peace/anointing, suggestive of the sanctuary as a place of both sacrifice and blessing."
    },
    {
      "pk": 11006032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 32,
      "text": "He carved on them cherubim, palm trees, and open flowers, and overlaid them with gold; he spread gold over the cherubim and the palm trees.",
      "links": "",
      "comment": "Repetition of paradise imagery on the doors highlights the sanctity and beauty of entering God’s presence, much like a spiritual garden."
    },
    {
      "pk": 11006033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 33,
      "text": "So he made for the entrance to the main hall doorposts of olive wood, one fourth of the wall;",
      "links": "",
      "comment": "The main hall doorposts, grand and massive, stress again the solemnity and sacredness of coming into worship."
    },
    {
      "pk": 11006034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 34,
      "text": "and two doors of cypress wood; the two leaves of one door turned on pivots, and two leaves of the other door turned on pivots.",
      "links": "",
      "comment": "Cypress, a durable wood, contributes to the grandeur. Double doors suggest wide access, but restricted by ritual purity."
    },
    {
      "pk": 11006035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 35,
      "text": "He carved on them cherubim, palm trees, and open flowers; and he overlaid them with gold fitted carefully on the carved work.",
      "links": "",
      "comment": "Each detail—cherubim, palms, flowers, all adorned in gold—shows that even the smallest elements in worship are worthy of utmost care."
    },
    {
      "pk": 11006036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 36,
      "text": "He built the inner court with three rows of cut stone and a row of cedar beams.",
      "links": "",
      "comment": "A fortified enclosure, the inner court was set apart for priestly service. Structure and boundaries marked out sacred space, just as in ordered worship traditions."
    },
    {
      "pk": 11006037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 37,
      "text": "In the fourth year, in the month of Ziv, the foundation of the house of the LORD was laid.",
      "links": "<a href='/AIV/14/3/2'>2 Chr. 3:2</a>",
      "comment": "Records the careful timing of the temple's beginning. In Christian tradition, the foundation points to Christ as the cornerstone (Eph. 2:20)."
    },
    {
      "pk": 11006038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 6,
      "verse": 38,
      "text": "In the eleventh year, in the month Bul, which is the eighth month, the house was finished in all its parts and according to all its plans. So he spent seven years building it.",
      "links": "<a href='/AIV/14/3/2'>2 Chr. 3:2</a>",
      "comment": "Completion in the seventh year alludes to perfect fulfillment and Sabbath rest, suggesting worship as a foretaste of heavenly rest (Heb. 4:9-10). The temple stands as a sign of God’s dwelling with His people—a mystery fully revealed in Christ and continued in His Church."
    }
  ],
  "translatedAt": "2025-12-24T03:30:51.979Z"
}