{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 16,
  "verses": [
    {
      "pk": 11016001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 1,
      "text": "Then the word of the LORD came to Jehu, son of Hanani, against Baasha, saying:",
      "links": "<a href='/AIV/13/7/12'>1 Chr. 7:12</a>; <a href='/AIV/11/15/33'>1 Kgs. 15:33</a>",
      "comment": "God's speaking through prophets reflects His ongoing guidance for Israel—reminding us of the value of both written and living tradition in God's plan for His people."
    },
    {
      "pk": 11016002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 2,
      "text": "\"I raised you up from the dust and made you leader over My people Israel, but you have walked in the way of Jeroboam and caused My people Israel to sin, provoking Me with their sins.\"",
      "links": "<a href='/AIV/11/15/29'>1 Kgs. 15:29</a>; <a href='/AIV/09/2/8'>1 Sam. 2:8</a>",
      "comment": "Leadership is a gift from God, but to misuse it leads others into error. Note the connection to Jeroboam's idolatry (see 1 Kgs. 12:28-30)."
    },
    {
      "pk": 11016003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 3,
      "text": "\"So now I will sweep away Baasha and his house, and I will make your family like the family of Jeroboam, son of Nebat.\"",
      "links": "<a href='/AIV/11/14/10'>1 Kgs. 14:10</a>; <a href='/AIV/11/15/29'>1 Kgs. 15:29</a>",
      "comment": "God demonstrates His justice by removing evil dynasties, showing the serious consequences of persistent sin."
    },
    {
      "pk": 11016004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 4,
      "text": "\"Anyone belonging to Baasha who dies in the city, the dogs will eat; and anyone who dies in the field, the birds of the air will eat.\"",
      "links": "<a href='/AIV/11/14/11'>1 Kgs. 14:11</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "A vivid expression of disgrace, tying Baasha's fate to previous judgments (see Jeroboam). Warning against leading others astray."
    },
    {
      "pk": 11016005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 5,
      "text": "The rest of the acts of Baasha, and what he did, and his might, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/12/14/28'>2 Kgs. 14:28</a>",
      "comment": "Reference to another historical source underscores the trustworthiness of tradition that preserves God’s actions throughout history."
    },
    {
      "pk": 11016006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 6,
      "text": "And Baasha slept with his fathers and was buried at Tirzah. And Elah his son reigned in his place.",
      "links": "<a href='/AIV/11/15/21'>1 Kgs. 15:21</a>",
      "comment": "Dynastic succession often brings hope for renewal, but must align with fidelity to God."
    },
    {
      "pk": 11016007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 7,
      "text": "Moreover, the word of the LORD came by the prophet Jehu son of Hanani against Baasha and his house, both because of all the evil he had done in the sight of the LORD, provoking Him to anger with the work of his hands, and because he became like the house of Jeroboam, and struck it down.",
      "links": "<a href='/AIV/11/15/27'>1 Kgs. 15:27</a>, <a href='/AIV/11/14/10'>1 Kgs. 14:10</a>",
      "comment": "Righteousness matters for both acts and intentions. The mention of a prophet reinforces the authoritative role of spiritual successors throughout salvation history."
    },
    {
      "pk": 11016008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 8,
      "text": "In the twenty-sixth year of Asa king of Judah, Elah son of Baasha became king over Israel in Tirzah, and he reigned two years.",
      "links": "<a href='/AIV/11/15/33'>1 Kgs. 15:33</a>",
      "comment": "Note the contrast between the length and fate of rulers who follow God versus those who do not."
    },
    {
      "pk": 11016009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 9,
      "text": "His servant Zimri, commander of half his chariots, conspired against him. While Elah was in Tirzah, drinking himself drunk in the house of Arza, who was over the household in Tirzah,",
      "links": "<a href='/AIV/11/20/16'>1 Kgs. 20:16</a>",
      "comment": "The king’s negligence and indulgence leave him vulnerable—a caution about stewardship and temperance, virtues praised throughout Scripture."
    },
    {
      "pk": 11016010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 10,
      "text": "Zimri came in and struck him down and killed him in the twenty-seventh year of Asa king of Judah, and Zimri reigned in his place.",
      "links": "<a href='/AIV/11/16/15'>1 Kgs. 16:15</a>",
      "comment": "Zimri's swift coup again illustrates how unrighteous rule brings instability and judgment."
    },
    {
      "pk": 11016011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 11,
      "text": "As soon as he was king and sat on the throne, he struck down all the house of Baasha. He did not leave him one man, neither relatives nor friends.",
      "links": "<a href='/AIV/11/14/14'>1 Kgs. 14:14</a>",
      "comment": "Total destruction of dynasties is a pattern in Israel for kings whose hearts stray. This prefigures both the radical call to holiness and the danger of unchecked authority."
    },
    {
      "pk": 11016012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 12,
      "text": "Zimri destroyed all the house of Baasha, according to the word of the LORD, which He spoke against Baasha by Jehu the prophet,",
      "links": "<a href='/AIV/11/16/3'>1 Kgs. 16:3</a>, <a href='/AIV/11/16/7'>1 Kgs. 16:7</a>",
      "comment": "God's words are always fulfilled, affirming both His justice and His faithfulness to true prophecy and succession."
    },
    {
      "pk": 11016013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 13,
      "text": "For all the sins of Baasha and the sins of Elah his son, which they sinned and made Israel to sin, provoking the LORD God of Israel to anger with their idols.",
      "links": "<a href='/AIV/02/20/2-5'>Ex. 20:2-5</a>; <a href='/AIV/11/12/30'>1 Kgs. 12:30</a>",
      "comment": "Idolatry is the root of the nation's downfall, calling to mind the commandments and the spiritual worship required of God's people."
    },
    {
      "pk": 11016014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 14,
      "text": "Now the rest of the acts of Elah, and all that he did, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/11/16/5'>1 Kgs. 16:5</a>",
      "comment": "Historical record-keeping supports preservation of truth, just as the Church carefully guards her records over time."
    },
    {
      "pk": 11016015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 15,
      "text": "In the twenty-seventh year of Asa king of Judah, Zimri ruled seven days in Tirzah. Now the army was encamped against Gibbethon of the Philistines.",
      "links": "<a href='/AIV/11/15/27'>1 Kgs. 15:27</a>",
      "comment": "Zimri’s reign was brief, highlighting the instability of kingdoms built on rebellion."
    },
    {
      "pk": 11016016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 16,
      "text": "When the army heard that Zimri had conspired and killed the king, all Israel made Omri, the commander of the army, king over Israel that day in the camp.",
      "links": "<a href='/AIV/11/16/2'>1 Kgs. 16:2</a>",
      "comment": "The people's reaction to Zimri’s coup shows the importance of proper appointment and authority, foreshadowing divine order."
    },
    {
      "pk": 11016017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 17,
      "text": "So Omri went up from Gibbethon, and all Israel with him, and they besieged Tirzah.",
      "links": "<a href='/AIV/07/9/50-53'>Judg. 9:50-53</a>",
      "comment": "Siege warfare is often a sign of divided leadership. Israel needs unity—a theme fulfilled in later restoration under faithful kings."
    },
    {
      "pk": 11016018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 18,
      "text": "When Zimri saw that the city was taken, he went into the citadel of the king’s house and burned the king’s house over himself with fire, and died,",
      "links": "<a href='/AIV/07/9/54'>Judg. 9:54</a>",
      "comment": "His self-destruction represents the utter collapse of unrighteous rule, and points to the gravity of despair apart from faith."
    },
    {
      "pk": 11016019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 19,
      "text": "Because of his sins which he committed, doing evil in the sight of the LORD, walking in the way of Jeroboam, and in his sin which he caused Israel to commit.",
      "links": "<a href='/AIV/11/15/34'>1 Kgs. 15:34</a>",
      "comment": "Sin begets sin; bad leadership corrupts others. The need for conversion and steadfast leadership is clear."
    },
    {
      "pk": 11016020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 20,
      "text": "Now the rest of the acts of Zimri, and his conspiracy which he made, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/11/16/14'>1 Kgs. 16:14</a>",
      "comment": "Records preserve even infamous acts; fullness of tradition includes both the virtuous and the sinful—for warning and instruction."
    },
    {
      "pk": 11016021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 21,
      "text": "Then the people of Israel were divided into two parts: half of the people followed Tibni the son of Ginath, to make him king, and half followed Omri.",
      "links": "<a href='/AIV/11/12/20'>1 Kgs. 12:20</a>",
      "comment": "Schism brings chaos, showing the importance of unity rooted in God’s rightful appointment."
    },
    {
      "pk": 11016022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 22,
      "text": "But the people who followed Omri prevailed against the people who followed Tibni son of Ginath. So Tibni died, and Omri became king.",
      "links": "<a href='/AIV/11/15/27'>1 Kgs. 15:27</a>",
      "comment": "Victory for Omri underscores God’s providence working even through political struggle, guiding history toward fulfillment."
    },
    {
      "pk": 11016023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 23,
      "text": "In the thirty-first year of Asa king of Judah, Omri began to reign over Israel and reigned twelve years; six years he reigned in Tirzah.",
      "links": "<a href='/AIV/11/15/33'>1 Kgs. 15:33</a>",
      "comment": "Regnal dates provide historical structure, further authenticating the biblical record’s reliability."
    },
    {
      "pk": 11016024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 24,
      "text": "Omri bought the hill of Samaria from Shemer for two talents of silver; he built on the hill, and called the name of the city that he built Samaria, after the name of Shemer, the owner of the hill.",
      "links": "<a href='/AIV/12/3/6'>2 Kgs. 3:6</a>;<a href='/AIV/13/7/28'>1 Chr. 7:28</a>",
      "comment": "Foundation of Samaria will play a critical role in Israel’s history, and later in Christ’s ministry, demonstrating the interconnectedness of God’s unfolding plan."
    },
    {
      "pk": 11016025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 25,
      "text": "But Omri did evil in the eyes of the LORD, and did worse than all who were before him.",
      "links": "<a href='/AIV/11/16/30'>1 Kgs. 16:30</a>; <a href='/AIV/11/21/25'>1 Kgs. 21:25</a>",
      "comment": "Each generation is called to greater fidelity; decline marks the need for a restoration in holiness."
    },
    {
      "pk": 11016026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 26,
      "text": "For Omri walked in all the way of Jeroboam son of Nebat, and in his sins which he made Israel to sin; provoking the LORD God of Israel with their idols.",
      "links": "<a href='/AIV/11/12/30'>1 Kgs. 12:30</a>",
      "comment": "Spiritual corruption spreads inward and outward; points to the consequences of false worship and its lasting effects."
    },
    {
      "pk": 11016027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 27,
      "text": "Now the rest of the acts of Omri which he did, and his might which he showed, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/12/8/37'>2 Kgs. 8:37</a>",
      "comment": "Legacy preserved in annals, instructing future generations to learn from both the failures and strengths of previous rulers."
    },
    {
      "pk": 11016028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 28,
      "text": "So Omri slept with his fathers, and was buried in Samaria. And Ahab his son reigned in his place.",
      "links": "<a href='/AIV/11/22/40'>1 Kgs. 22:40</a>",
      "comment": "Ahab's ascension sets the stage for the crisis and prophetic intervention that foreshadows the ultimate coming of the Messiah."
    },
    {
      "pk": 11016029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 29,
      "text": "In the thirty-eighth year of Asa king of Judah, Ahab son of Omri became king over Israel; and Ahab son of Omri reigned over Israel in Samaria twenty-two years.",
      "links": "<a href='/AIV/11/22/41'>1 Kgs. 22:41</a>",
      "comment": "Ahab’s long reign signals an era of challenge and revelation, preparing for Elijah’s prophetic ministry."
    },
    {
      "pk": 11016030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 30,
      "text": "And Ahab son of Omri did evil in the sight of the LORD, more than all who were before him.",
      "links": "<a href='/AIV/11/16/25'>1 Kgs. 16:25</a>; <a href='/AIV/11/21/25'>1 Kgs. 21:25</a>",
      "comment": "The escalation of wickedness serves as a dramatic backdrop for God’s plans of intervention—see how God meets sin with even greater grace."
    },
    {
      "pk": 11016031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 31,
      "text": "And as if it were a trivial thing for him to walk in the sins of Jeroboam son of Nebat, he took as wife Jezebel the daughter of Ethbaal king of the Sidonians, and went and served Baal and worshipped him.",
      "links": "<a href='/AIV/11/18/19'>1 Kgs. 18:19</a>; <a href='/AIV/12/9/22'>2 Kgs. 9:22</a>",
      "comment": "Intermarriage with pagan royalty and Baal worship corrupts Israel’s faith, foreshadowing the spiritual struggle underlying all salvation history."
    },
    {
      "pk": 11016032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 32,
      "text": "He set up an altar for Baal in the house of Baal, which he built in Samaria.",
      "links": "<a href='/AIV/11/12/33'>1 Kgs. 12:33</a>; <a href='/AIV/07/6/25'>Judg. 6:25</a>",
      "comment": "Corrupt worship leads the nation astray—the house built for Baal contrasts the true worship of the LORD, later restored through Elijah."
    },
    {
      "pk": 11016033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 33,
      "text": "And Ahab made an Asherah. Ahab did more to provoke the LORD God of Israel to anger than all the kings of Israel who were before him.",
      "links": "<a href='/AIV/07/3/7'>Judg. 3:7</a>; <a href='/AIV/11/21/26'>1 Kgs. 21:26</a>",
      "comment": "The Asherah is a symbol of pagan fertility worship. This deepens Israel’s apostasy, heightening the impending need for prophetic correction."
    },
    {
      "pk": 11016034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 16,
      "verse": 34,
      "text": "In his days, Hiel of Bethel built Jericho. He laid its foundation at the cost of Abiram his firstborn, and set up its gates at the cost of Segub his youngest son, according to the word of the LORD, which He spoke by Joshua son of Nun.",
      "links": "<a href='/AIV/06/6/26'>Josh. 6:26</a>; <a href='/AIV/11/13/2'>1 Kgs. 13:2</a>",
      "comment": "The curse fulfilled at Jericho highlights the enduring truth of God’s spoken word through His servants; historical fulfillment affirms the reliability of prophecy."
    }
  ],
  "translatedAt": "2025-12-24T03:37:51.066Z"
}