{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 18,
  "verses": [
    {
      "pk": 11018001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 1,
      "text": "After many days, the word of the LORD came to Elijah in the third year, saying, 'Go, present yourself to Ahab, and I will send rain upon the land.'",
      "links": "<a href='/AIV/42/4/25'>Luke 4:25</a>; <a href='/AIV/59/5/17'>James 5:17</a>",
      "comment": "Three years of drought recall God's discipline and his sovereign timing. The Lord's word initiates renewal, highlighting God's control over creation, a sign pointing to the greater spiritual authority fully revealed in the New Covenant."
    },
    {
      "pk": 11018002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 2,
      "text": "So Elijah went to present himself to Ahab. Now the famine was severe in Samaria.",
      "links": "<a href='/AIV/11/17/1'>1 Kgs 17:1</a>",
      "comment": "The severity of the famine shows the depth of judgment but also prepares the people for repentance and restoration, something echoed repeatedly in the history of Israel."
    },
    {
      "pk": 11018003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 3,
      "text": "Ahab called for Obadiah, who was over his household. (Now Obadiah feared the LORD greatly,",
      "links": "<a href='/AIV/11/16/9'>1 Kgs 16:9</a>",
      "comment": "Obadiah is shown as a righteous leader in a wicked house, much like Daniel in Babylon, foreshadowing the call to holiness even within corrupt systems."
    },
    {
      "pk": 11018004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 4,
      "text": "for when Jezebel was cutting off the prophets of the LORD, Obadiah had taken a hundred prophets and hidden them by fifties in a cave, and fed them with bread and water.)",
      "links": "<a href='/AIV/11/19/10'>1 Kgs 19:10</a>",
      "comment": "Jezebel's persecution of the prophets highlights the ongoing battle between true and false worship. Obadiah's preservation of the prophets through bread and water subtly points to the ongoing provision and sustenance of God's true ministers (cf. 1 Kgs 19:6)."
    },
    {
      "pk": 11018005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 5,
      "text": "Ahab said to Obadiah, 'Go through the land to all the springs of water and to all the brooks; perhaps we may find grass to keep the horses and mules alive, and not have to kill any of the livestock.'",
      "links": "<a href='/AIV/11/17/6'>1 Kgs 17:6</a>",
      "comment": "Ahab is worried primarily about preserving his animals, not about repentance. Spiritual blindness often prioritizes worldly concerns over obedience to God."
    },
    {
      "pk": 11018006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 6,
      "text": "So they divided the land between them to pass through it. Ahab went one way by himself, and Obadiah went another way by himself.",
      "links": "<a href='/AIV/09/16/4'>1 Sam 16:4</a>",
      "comment": "Splitting up the search underscores the desperation of the situation and the king’s reliance on human effort instead of turning to the Lord."
    },
    {
      "pk": 11018007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 7,
      "text": "And as Obadiah was on the way, suddenly Elijah met him. Obadiah recognized him, fell on his face, and said, 'Is it really you, my lord Elijah?'",
      "links": "<a href='/AIV/11/17/2'>1 Kgs 17:2</a>",
      "comment": "Obadiah's reverence for Elijah, the prophet, reflects Israel's tendency to honor those who truly speak for God."
    },
    {
      "pk": 11018008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 8,
      "text": "He answered him, 'It is I. Go, say to your master, “Elijah is here.”'",
      "links": "",
      "comment": "Elijah identifies himself openly, showing his trust in God’s will. The openness of his approach prefigures the forthright proclamation seen in John the Baptist’s ministry (Mark 1:4)."
    },
    {
      "pk": 11018009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 9,
      "text": "But Obadiah said, 'How have I sinned, that you would give me into the hand of Ahab, to kill me?'",
      "links": "",
      "comment": "Obadiah’s fear reveals the extent of Ahab’s wrath, but also shows the faith needed to act courageously in difficult circumstances."
    },
    {
      "pk": 11018010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 10,
      "text": "As surely as the LORD your God lives, there is no nation or kingdom where my master has not sent to seek you; and when they said, 'He is not here,' he made that kingdom or nation swear that they had not found you.",
      "links": "",
      "comment": "The earnest pursuit of Elijah throughout the nations prefigures the broader search for truth and the relentless pursuit by worldly powers to silence God’s voice."
    },
    {
      "pk": 11018011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 11,
      "text": "And now you say, 'Go, tell your master, “Elijah is here!”'",
      "links": "",
      "comment": "The repetition of the command highlights Obadiah’s hesitation and the threat he perceives in carrying the prophet’s message."
    },
    {
      "pk": 11018012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 12,
      "text": "It may be that as soon as I leave you, the Spirit of the LORD will carry you to a place I do not know. So when I come and tell Ahab and he cannot find you, he will kill me—though I your servant have feared the LORD from my youth.",
      "links": "<a href='/AIV/12/2/16'>2 Kgs 2:16</a>",
      "comment": "Obadiah’s fear also attests to God’s mysterious ways; his Spirit is not bounded by man’s plans. Faith and obedience, begun in youth, sustain during trials."
    },
    {
      "pk": 11018013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 13,
      "text": "Was it not told my lord what I did when Jezebel killed the prophets of the LORD, how I hid a hundred men of the LORD’s prophets by fifties in a cave, and fed them with bread and water?",
      "links": "",
      "comment": "The act of hiding and feeding prophets illustrates sacrificial service for the sacred, a theme that carries forward into the ministry of deacons (cf. Acts 6:1–6)."
    },
    {
      "pk": 11018014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 14,
      "text": "And now you say, 'Go, tell your master, “Elijah is here!”' He will surely kill me.",
      "links": "",
      "comment": "Obadiah’s repetition underscores the gravity and risk involved in obedience to the prophet’s word."
    },
    {
      "pk": 11018015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 15,
      "text": "Elijah said, 'As the LORD of hosts lives, before whom I stand, I will surely present myself to him today.'",
      "links": "<a href='/AIV/11/17/1'>1 Kgs 17:1</a>",
      "comment": "Elijah’s profession of standing before the Lord highlights a priestly, mediatorial role—anticipating the mediatorship fulfilled perfectly in Christ (1 Tim 2:5)."
    },
    {
      "pk": 11018016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 16,
      "text": "So Obadiah went to meet Ahab, and told him; and Ahab went to meet Elijah.",
      "links": "",
      "comment": "Obadiah demonstrates obedience despite fear, modeling true faith in action."
    },
    {
      "pk": 11018017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 17,
      "text": "When Ahab saw Elijah, Ahab said to him, 'Is it you, the troubler of Israel?'",
      "links": "<a href='/AIV/45/8/7'>Rom 8:7</a>",
      "comment": "Ahab’s accusation flips the truth; it is the rejection of God that causes trouble, not the messenger. This inversion of truth echoes throughout the Gospels regarding Jesus (John 7:12)."
    },
    {
      "pk": 11018018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 18,
      "text": "And he answered, 'I have not troubled Israel; but you and your father’s house have, because you have abandoned the commandments of the LORD and have followed the Baals.'",
      "links": "<a href='/AIV/11/16/31'>1 Kgs 16:31</a>;<a href='/AIV/05/11/16'>Deut 11:16</a>",
      "comment": "Elijah points to idolatry as the root of Israel’s troubles. Obedience to God's commands is central; the apostolic succession depends on this faithfulness."
    },
    {
      "pk": 11018019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 19,
      "text": "Now therefore send and gather all Israel to me at Mount Carmel, and the 450 prophets of Baal and the 400 prophets of Asherah, who eat at Jezebel’s table.'",
      "links": "<a href='/AIV/11/16/33'>1 Kgs 16:33</a>",
      "comment": "The assembly on Mount Carmel is a summons to a public test of true worship versus idolatry—a central theme that continues in discerning authentic leadership and doctrine."
    },
    {
      "pk": 11018020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 20,
      "text": "So Ahab sent to all the people of Israel and gathered the prophets together at Mount Carmel.",
      "links": "",
      "comment": "Ahab’s compliance sets the stage for a dramatic showdown, similar to the public confrontations seen in the ministry of Jesus and the apostles."
    },
    {
      "pk": 11018021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 21,
      "text": "Elijah came near to all the people and said, 'How long will you waver between two opinions? If the LORD is God, follow him; but if Baal, then follow him.' But the people did not answer him a word.",
      "links": "<a href='/AIV/06/24/15'>Josh 24:15</a>;<a href='/AIV/40/6/24'>Matt 6:24</a>",
      "comment": "Elijah challenges the people to fidelity, calling for a wholehearted decision—a principle fundamental to authentic belief and practice."
    },
    {
      "pk": 11018022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 22,
      "text": "Then Elijah said to the people, 'I, even I only, am left as a prophet of the LORD; but Baal’s prophets are four hundred fifty men.'",
      "links": "<a href='/AIV/11/19/10'>1 Kgs 19:10</a>",
      "comment": "The singularity of true prophets against the many of Baal draws attention to the value of unity and continuity in true doctrine."
    },
    {
      "pk": 11018023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 23,
      "text": "'Let two bulls be given to us, and let them choose one bull for themselves, cut it in pieces, and lay it on the wood, but put no fire to it. I will prepare the other bull and lay it on the wood, and put no fire to it.'",
      "links": "",
      "comment": "The established terms guarantee fairness but also highlight the means of worship God Himself determines, reflecting the importance of right liturgy."
    },
    {
      "pk": 11018024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 24,
      "text": "'Then you call on the name of your god, and I will call on the name of the LORD. The God who answers by fire, he is God.' And all the people answered, 'It is well spoken.'",
      "links": "<a href='/AIV/03/9/24'>Lev 9:24</a>; <a href='/AIV/11/18/38'>1 Kgs 18:38</a>",
      "comment": "Calling on God's name, and God answering by fire, anticipates later supernatural confirmations in apostolic ministry (Acts 2:3)."
    },
    {
      "pk": 11018025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 25,
      "text": "Elijah said to the prophets of Baal, 'Choose for yourselves one bull and prepare it first, for you are many; and call on the name of your god, but put no fire to it.'",
      "links": "",
      "comment": "By giving them first choice, Elijah prevents any later accusations of trickery, reinforcing the fairness and legitimacy of true worship."
    },
    {
      "pk": 11018026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 26,
      "text": "So they took the bull that was given them, and they prepared it and called on the name of Baal from morning until noon, saying, 'O Baal, answer us!' But there was no voice, and no one answered. They limped around the altar that they had made.",
      "links": "",
      "comment": "The silence emphasizes the powerlessness of false religion, in stark contrast with God’s living presence among His people."
    },
    {
      "pk": 11018027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 27,
      "text": "At noon Elijah mocked them, saying, 'Cry aloud, for he is a god. Either he is musing, or he is busy, or he is on a journey, or perhaps he is asleep and must be awakened.'",
      "links": "<a href='/AIV/19/115/4-8'>Ps 115:4-8</a>",
      "comment": "Elijah’s taunt exposes the absurdity of idol worship. The difference between the true God and idols is both theological and experiential."
    },
    {
      "pk": 11018028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 28,
      "text": "So they cried aloud and cut themselves, according to their custom, with swords and lances, until the blood gushed out on them.",
      "links": "<a href='/AIV/03/19/28'>Lev 19:28</a>",
      "comment": "Their self-mutilation is a forbidden practice in the law of Moses; it reveals the ultimate futility and error in forms of worship unauthorized by divine command."
    },
    {
      "pk": 11018029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 29,
      "text": "As midday passed, they raved on until the time of the offering of the evening sacrifice, but there was no voice, no one answered, no one paid attention.",
      "links": "",
      "comment": "The failure of Baal’s prophets at the time of the evening sacrifice—the traditional hour for public prayer—emphasizes the necessity for God-ordained worship."
    },
    {
      "pk": 11018030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 30,
      "text": "Then Elijah said to all the people, 'Come near to me.' And all the people came near to him. And he repaired the altar of the LORD that had been torn down.",
      "links": "<a href='/AIV/07/6/24'>Judg 6:24</a>",
      "comment": "Restoring the altar symbolizes the reestablishment of right worship—a pattern and image of return to divinely instituted practices."
    },
    {
      "pk": 11018031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 31,
      "text": "Elijah took twelve stones, according to the number of the tribes of the sons of Jacob, to whom the word of the LORD came, saying, 'Israel shall be your name.'",
      "links": "<a href='/AIV/01/32/28'>Gen 32:28</a>",
      "comment": "The twelve stones represent the unity and wholeness of God’s chosen people in worship. Even in division, the priestly and prophetic action recalls the original, undivided people of God."
    },
    {
      "pk": 11018032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 32,
      "text": "With the stones he built an altar in the name of the LORD. And he made a trench around the altar, as great as would contain two measures of seed.",
      "links": "",
      "comment": "Building the altar 'in the name of the LORD' recalls worship authorized and sanctified by God—prefiguring Christ as the ultimate altar (Heb 13:10)."
    },
    {
      "pk": 11018033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 33,
      "text": "He put the wood in order, cut the bull in pieces, and laid it on the wood. And he said, 'Fill four jars with water and pour it on the burnt offering and on the wood.'",
      "links": "",
      "comment": "The drenching with water heightens the miracle to come, showing the supernatural nature of true worship and sacrifice."
    },
    {
      "pk": 11018034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 34,
      "text": "And he said, 'Do it a second time.' And they did it a second time. And he said, 'Do it a third time.' And they did it a third time.",
      "links": "",
      "comment": "The triple pouring of water anticipates later Trinitarian patterns in biblical revelation (cf. Matt 28:19)."
    },
    {
      "pk": 11018035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 35,
      "text": "The water ran around the altar and filled the trench also with water.",
      "links": "",
      "comment": "The abundance of water makes the coming fire more undeniably divine in origin and echoes later images of water and Spirit in Christian baptism (cf. John 3:5)."
    },
    {
      "pk": 11018036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 36,
      "text": "At the time of the offering of the evening sacrifice, Elijah the prophet came near and said, 'O LORD, God of Abraham, Isaac, and Israel, let it be known this day that you are God in Israel, and that I am your servant, and that I have done all these things at your word.'",
      "links": "<a href='/AIV/02/3/6'>Exod 3:6</a>",
      "comment": "Elijah’s prayer grounds his mission in obedience to God, not personal initiative. This exemplifies the ministry rooted in divine commissioning."
    },
    {
      "pk": 11018037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 37,
      "text": "'Answer me, O LORD, answer me, that this people may know that you, O LORD, are God, and that you have turned their hearts back.'",
      "links": "<a href='/AIV/19/51/13'>Ps 51:13</a>",
      "comment": "Restoration of hearts is a prophetic foreshadowing of true conversion and repentance, ultimately fulfilled in the New Covenant."
    },
    {
      "pk": 11018038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 38,
      "text": "Then the fire of the LORD fell and consumed the burnt offering, the wood, the stones, and the dust, and licked up the water that was in the trench.",
      "links": "<a href='/AIV/03/9/24'>Lev 9:24</a>",
      "comment": "The divine fire consuming the offering serves as God's affirmation, recalling God's acceptance of sacrifice in the priestly tradition and ultimately Christ's sacrifice."
    },
    {
      "pk": 11018039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 39,
      "text": "When all the people saw it, they fell on their faces and said, 'The LORD, he is God; the LORD, he is God.'",
      "links": "",
      "comment": "The double acclamation confirms the confession of faith—a corporate, public act reminiscent of the liturgy and worship seen throughout the Scriptures."
    },
    {
      "pk": 11018040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 40,
      "text": "Elijah said to them, 'Seize the prophets of Baal; let not one of them escape.' And they seized them, and Elijah brought them down to the brook Kishon and slaughtered them there.",
      "links": "<a href='/AIV/02/22/20'>Exod 22:20</a>",
      "comment": "The judgment on the false prophets enacts the Old Testament penalty for idolatry, highlighting the seriousness of true doctrine and worship."
    },
    {
      "pk": 11018041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 41,
      "text": "Then Elijah said to Ahab, 'Go up, eat and drink, for there is a sound of the rushing of rain.'",
      "links": "",
      "comment": "Elijah’s authoritative pronouncement of rain marks the end of judgment and the beginning of renewal—a motif realized spiritually by the outpouring of grace."
    },
    {
      "pk": 11018042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 42,
      "text": "So Ahab went up to eat and drink. And Elijah went up to the top of Mount Carmel. He bowed himself down on the earth and put his face between his knees.",
      "links": "",
      "comment": "Elijah’s posture of humility and prayer models deep intercession, an essential element in the life of the church—especially in seasons of renewal."
    },
    {
      "pk": 11018043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 43,
      "text": "He said to his servant, 'Go up now, look toward the sea.' And he went up and looked and said, 'There is nothing.' And he said, 'Go again,' seven times.",
      "links": "",
      "comment": "Perseverance in prayer—marked here by the number seven, symbolizing fullness and completion—a pattern reflected in later spiritual disciplines."
    },
    {
      "pk": 11018044,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 44,
      "text": "And at the seventh time he said, 'Behold, a little cloud like a man’s hand is rising from the sea.' And he said, 'Go up, say to Ahab, “Prepare your chariot and go down, lest the rain stop you.”'",
      "links": "",
      "comment": "The small cloud growing into a great rain is a biblical image of God’s grace starting in seeming weakness and culminating in abundance—an image fitting the spread of the kingdom."
    },
    {
      "pk": 11018045,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 45,
      "text": "In a little while the heavens grew black with clouds and wind, and there was a great rain. And Ahab rode and went to Jezreel.",
      "links": "",
      "comment": "The assurance and fulfillment of God's word brings about healing and restoration, typifying the outpouring of spiritual blessings."
    },
    {
      "pk": 11018046,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 18,
      "verse": 46,
      "text": "And the hand of the LORD was on Elijah, and he girded up his loins and ran before Ahab to the entrance of Jezreel.",
      "links": "<a href='/AIV/11/18/12'>1 Kgs 18:12</a>",
      "comment": "Elijah’s supernatural strength brings the chapter to a close, displaying the vitality and mission of those empowered by God's Spirit for leadership and prophetic action."
    }
  ],
  "translatedAt": "2025-12-24T03:39:37.363Z"
}