{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 14,
  "verses": [
    {
      "pk": 11014001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 1,
      "text": "At that time, Abijah the son of Jeroboam became sick.",
      "links": "<a href='/AIV/11/11/39'>1Kgs 11:39</a>",
      "comment": "Jeroboam's household, once promised a dynasty if faithful (<a href='/AIV/11/11/38'>1Kgs 11:38</a>), faces judgment for sin. The sickness of Abijah is an omen of coming consequences."
    },
    {
      "pk": 11014002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 2,
      "text": "Jeroboam said to his wife, \"Get up and disguise yourself, so that no one will know you're Jeroboam's wife, and go to Shiloh. There is Ahijah the prophet, who told me I would be king over this people.",
      "links": "<a href='/AIV/09/3/20'>1Sam 3:20</a>; <a href='/AIV/11/11/29'>1Kgs 11:29</a>",
      "comment": "Jeroboam entrusted his fate to Ahijah, the prophet who first predicted his ascent. The attempt at disguise signals a fear or respect for the prophet's authority."
    },
    {
      "pk": 11014003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 3,
      "text": "Take with you ten loaves, some cakes, and a jar of honey, and go to him. He will tell you what will become of the boy.",
      "links": "<a href='/AIV/09/9/7'>1Sam 9:7</a>",
      "comment": "Bringing gifts to a prophet was customary, showing honor and hope of favor. References to gifts for prophets recall episodes like Saul visiting Samuel (<a href='/AIV/09/9/7'>1Sam 9:7</a>)."
    },
    {
      "pk": 11014004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 4,
      "text": "Jeroboam’s wife did so. She got up and went to Shiloh, and came to the house of Ahijah. Now Ahijah could not see, for his eyes were dim from age.",
      "links": "<a href='/AIV/01/27/1'>Gen 27:1</a>",
      "comment": "Ahijah's blindness evokes Isaac's in Genesis, where God’s will is revealed despite human limitations (<a href='/AIV/01/27/1'>Gen 27:1</a>)."
    },
    {
      "pk": 11014005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 5,
      "text": "But the LORD had said to Ahijah, \"Here is the wife of Jeroboam coming to ask you about her son, for he is sick. You shall speak to her as it is, for when she comes, she will pretend to be someone else.\"",
      "links": "<a href='/AIV/09/16/7'>1Sam 16:7</a>",
      "comment": "God's knowledge transcends human plans. The LORD reveals hidden things, showing prophetic authority that isn't fooled by outward appearance, similar to Samuel and David (<a href='/AIV/09/16/7'>1Sam 16:7</a>)."
    },
    {
      "pk": 11014006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 6,
      "text": "So when Ahijah heard the sound of her footsteps as she came in the door, he said, \"Come in, wife of Jeroboam. Why are you pretending to be someone else? I have been sent to you with harsh news.",
      "links": "",
      "comment": "Ahijah, led by divine revelation, exposes the disguise and declares God's intent to deliver judgment. Prophets are messengers whether the news is welcome or not."
    },
    {
      "pk": 11014007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 7,
      "text": "Go, tell Jeroboam, 'This is what the LORD, the God of Israel, says: \"I raised you up from among the people and made you ruler over My people Israel.",
      "links": "<a href='/AIV/11/11/31'>1Kgs 11:31</a>; <a href='/AIV/09/12/8'>1Sam 12:8</a>",
      "comment": "God makes clear that it was His sovereign will that exalted Jeroboam, reminding us of divine election—a theme fulfilled in Christ’s calling of His apostles."
    },
    {
      "pk": 11014008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 8,
      "text": "\"I tore the kingdom from the house of David and gave it to you, but you have not been like My servant David, who kept My commandments and followed Me with all his heart, doing only what was right in My eyes.",
      "links": "<a href='/AIV/11/11/33'>1Kgs 11:33</a>; <a href='/AIV/09/13/14'>1Sam 13:14</a>",
      "comment": "David's whole-hearted devotion sets the standard for kingship—pointing ultimately to Christ, the perfect King. The language of 'servant' and 'heart' resonates with spiritual integrity and the ideal of godly leadership."
    },
    {
      "pk": 11014009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 9,
      "text": "But you have done more evil than all who were before you. You have gone and made for yourself other gods and images, provoking Me to anger, and you have cast Me behind your back.",
      "links": "<a href='/AIV/04/14/23'>Num 14:23</a>; <a href='/AIV/11/12/28'>1Kgs 12:28</a>",
      "comment": "Jeroboam's idolatry reaches a new height; 'cast Me behind your back' suggests deliberate rejection. Spiritual readings see this as a warning against self-made religion and the need for humility before divine truth."
    },
    {
      "pk": 11014010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 10,
      "text": "Therefore, behold, I will bring disaster upon the house of Jeroboam, and will cut off every male, whether slave or free, in Israel, and will sweep away the house of Jeroboam as one sweeps away dung until it is all gone.",
      "links": "<a href='/AIV/11/15/29'>1Kgs 15:29</a>",
      "comment": "The judgment is total—the destruction of dynasty and descendants. The vivid imagery underscores the gravity of idolatry. Later fulfillment in Baasha’s massacre (<a href='/AIV/11/15/29'>1Kgs 15:29</a>)."
    },
    {
      "pk": 11014011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 11,
      "text": "Anyone belonging to Jeroboam who dies in the city shall be eaten by dogs, and anyone who dies in the field, the birds of the air shall eat. For the LORD has spoken it.\"",
      "links": "<a href='/AIV/11/16/4'>1Kgs 16:4</a>; <a href='/AIV/09/17/44'>1Sam 17:44</a>",
      "comment": "Refusal of decent burial signifies curse and loss of honor, a motif echoed in Jezebel’s fate (<a href='/AIV/11/21/23'>1Kgs 21:23</a>). This recalls spiritual consequences of persisting in rebellion."
    },
    {
      "pk": 11014012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 12,
      "text": "Arise, go to your house. As soon as your feet enter the city, the child will die.",
      "links": "",
      "comment": "Prophetic foreknowledge signals both God's justice and mercy—Abijah’s death is immediate, but comes with implications for the future of the royal line."
    },
    {
      "pk": 11014013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 13,
      "text": "All Israel will mourn for him and bury him, for he alone of Jeroboam’s family shall come to the grave, because in him there is found something pleasing to the LORD, the God of Israel, in the house of Jeroboam.",
      "links": "<a href='/AIV/11/13/30'>1Kgs 13:30</a>",
      "comment": "Abijah receives honor in burial, showing God’s attention to the heart. This connects with God’s care for the righteous even amidst judgment (<a href='/AIV/11/13/30'>1Kgs 13:30</a>). Spiritual readings see foreshadowing of the importance of family and tradition in faith communities."
    },
    {
      "pk": 11014014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 14,
      "text": "Moreover, the LORD will raise up for Himself a king over Israel who will cut off the house of Jeroboam—this very day. What? Even now!",
      "links": "<a href='/AIV/11/15/29'>1Kgs 15:29</a>",
      "comment": "God continues His plan; a new ruler is already prepared to complete this prophecy. God's sovereignty over kings and nations is highlighted, ultimately fulfilled in Christ the King."
    },
    {
      "pk": 11014015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 15,
      "text": "The LORD will strike Israel, so it will shake as a reed in water. He will uproot Israel from this good land He gave to their ancestors and scatter them beyond the Euphrates, because they have made Asherah poles, provoking the LORD to anger.",
      "links": "<a href='/AIV/05/28/64'>Deut 28:64</a>; <a href='/AIV/12/17/6'>2Kgs 17:6</a>",
      "comment": "Foreshadows later exile and scattering due to idolatry. Physical movements express spiritual realities—fidelity to God is required for security."
    },
    {
      "pk": 11014016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 16,
      "text": "And He will give up Israel on account of the sins of Jeroboam, which he made Israel to commit.",
      "links": "<a href='/AIV/12/17/22'>2Kgs 17:22</a>",
      "comment": "Collective consequences for Jeroboam’s sin. Shows the weight of leadership's actions upon the people—a theme echoing the importance of communal responsibility and tradition in the faithful maintaining unity."
    },
    {
      "pk": 11014017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 17,
      "text": "Then Jeroboam’s wife arose and departed, and came to Tirzah. As soon as she entered the threshold of the house, the child died.",
      "links": "",
      "comment": "Fulfillment is immediate, demonstrating the truth of God’s word spoken through the prophet. Spiritual interpretations see God's mercy even in judgment."
    },
    {
      "pk": 11014018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 18,
      "text": "And all Israel buried him and mourned for him, as the LORD had spoken by His servant Ahijah the prophet.",
      "links": "<a href='/AIV/11/13/29'>1Kgs 13:29</a>",
      "comment": "As prophesied, the people mourn for Abijah. The role of the prophet is affirmed. Mourning and burial recall proper respect for the dead, a theme rich in later faith traditions."
    },
    {
      "pk": 11014019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 19,
      "text": "Now the rest of the acts of Jeroboam, how he fought and how he reigned, behold, they are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "<a href='/AIV/13/1/1'>1Chr 1:1</a>; <a href='/AIV/11/15/7'>1Kgs 15:7</a>",
      "comment": "Ancient records show the complexity of his reign—the struggle between worldly power and obedience to God."
    },
    {
      "pk": 11014020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 20,
      "text": "Jeroboam reigned twenty-two years. Then he rested with his fathers, and Nadab his son became king in his place.",
      "links": "<a href='/AIV/11/15/25'>1Kgs 15:25</a>",
      "comment": "'Rested with his fathers' is a euphemism for death, also pointing to ideas of continuity and inheritance of leadership—echoes of apostolic succession and tradition."
    },
    {
      "pk": 11014021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 21,
      "text": "Meanwhile, Rehoboam, the son of Solomon, reigned in Judah. Rehoboam was forty-one years old when he began to reign, and he reigned seventeen years in Jerusalem, the city the LORD had chosen out of all the tribes of Israel to put His name there. His mother’s name was Naamah the Ammonite.",
      "links": "<a href='/AIV/11/11/13'>1Kgs 11:13</a>; <a href='/AIV/14/12/13'>2Chr 12:13</a>",
      "comment": "Jerusalem’s unique role as chosen city prefigures deeper theological truths about God's dwelling among His people. The mention of Naamah highlights the impact of foreign influences on Israel’s faith."
    },
    {
      "pk": 11014022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 22,
      "text": "Judah did evil in the sight of the LORD, and they provoked Him to jealousy with their sins, more than all their fathers had done.",
      "links": "<a href='/AIV/07/2/11'>Judg 2:11</a>",
      "comment": "The pattern of falling away repeats, echoing the cycles of apostasy in Judges (<a href='/AIV/07/2/11'>Judg 2:11</a>). Spiritual readings see this as a warning about communal fidelity and the importance of shared values and tradition."
    },
    {
      "pk": 11014023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 23,
      "text": "For they also built high places, sacred pillars, and Asherah poles on every high hill and under every green tree.",
      "links": "<a href='/AIV/05/12/2'>Deut 12:2</a>",
      "comment": "Prohibited forms of worship are described. High places and Asherah poles violate God’s command for singular, unified worship, highlighting the danger of fragmented practice."
    },
    {
      "pk": 11014024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 24,
      "text": "There were also male cult prostitutes in the land. They did according to all the abominations of the nations that the LORD had driven out before the children of Israel.",
      "links": "<a href='/AIV/05/23/17'>Deut 23:17</a>",
      "comment": "Sexual immorality tied to idolatrous practice corrupts the nation. The reference to the nations driven out shows the contrast between what God desires and the world's patterns."
    },
    {
      "pk": 11014025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 25,
      "text": "In the fifth year of King Rehoboam, Shishak king of Egypt came up against Jerusalem.",
      "links": "<a href='/AIV/14/12/2'>2Chr 12:2</a>",
      "comment": "Foreign invasion as judgment is a recurring motif—God uses even pagan kings to discipline His people."
    },
    {
      "pk": 11014026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 26,
      "text": "He took away the treasures of the house of the LORD and the treasures of the king’s house. He took everything; he also took all the shields of gold that Solomon had made.",
      "links": "<a href='/AIV/11/10/17'>1Kgs 10:17</a>",
      "comment": "Loss of treasures signifies both material and spiritual decline—a result of abandoning rightful worship and unity."
    },
    {
      "pk": 11014027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 27,
      "text": "King Rehoboam made shields of bronze in their place and committed them to the hands of the captains of the guard who guarded the entrance to the king’s house.",
      "links": "",
      "comment": "Replacement with bronze signs a diminished glory—an outward show that lacks inward substance, an allegory for spiritual imitation versus authentic faith."
    },
    {
      "pk": 11014028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 28,
      "text": "And whenever the king entered the house of the LORD, the guards carried them and then brought them back to the guardroom.",
      "links": "",
      "comment": "Maintenance of ceremony despite decline reflects persistence in external rituals—inviting reflection on the necessity for both outward and inward devotion."
    },
    {
      "pk": 11014029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 29,
      "text": "Now the rest of the acts of Rehoboam, and all that he did, are written in the Book of the Chronicles of the Kings of Judah.",
      "links": "<a href='/AIV/14/12/15'>2Chr 12:15</a>",
      "comment": "Reference to historical records highlights the importance of memory and tradition—essential for the continuity of faith and leadership."
    },
    {
      "pk": 11014030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 30,
      "text": "And there was continual war between Rehoboam and Jeroboam.",
      "links": "<a href='/AIV/11/15/6'>1Kgs 15:6</a>",
      "comment": "Division and constant conflict display the danger of schism in God’s people—implications for the call to unity and faithfulness."
    },
    {
      "pk": 11014031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 14,
      "verse": 31,
      "text": "And Rehoboam rested with his fathers and was buried with his fathers in the city of David. His mother’s name was Naamah the Ammonite. And Abijah his son became king in his place.",
      "links": "<a href='/AIV/14/13/1'>2Chr 13:1</a>",
      "comment": "The succession narrative underscores the enduring line through David’s house, pointing to promised fullness in the Messiah—who will unite the divided kingdom and fulfill God’s plan through His people."
    }
  ],
  "translatedAt": "2025-12-24T03:36:38.644Z"
}