{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 19,
  "verses": [
    {
      "pk": 11019001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 1,
      "text": "Ahab told Jezebel everything that Elijah had done, and how he had killed all the prophets with the sword.",
      "links": "<a href='/AIV/11/18/40'>1Kgs 18:40</a>",
      "comment": "This verse recalls the dramatic events on Mount Carmel, where Elijah defeated the prophets of Baal. The completeness of Elijah’s actions sets the scene for Jezebel’s reaction."
    },
    {
      "pk": 11019002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 2,
      "text": "Then Jezebel sent a messenger to Elijah, saying, 'May the gods deal with me, be it ever so severely, if by this time tomorrow I do not make your life like that of one of them.'",
      "links": "<a href='/AIV/8/3/17'>Ruth 3:17</a>",
      "comment": "Jezebel’s oath reflects her resolve and enmity against Elijah. Notice the pagan invocation and her intent to kill. The text illustrates the violence faced by prophetic figures—see also other threats against prophets in <a href='/AIV/24/38/6'>Jeremiah 38:6</a>."
    },
    {
      "pk": 11019003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 3,
      "text": "Elijah was afraid, and he arose and ran for his life. He went to Beersheba, which belongs to Judah, and left his servant there.",
      "links": "<a href='/AIV/1/21/14'>Gen 21:14</a>; <a href='/AIV/9/8/14'>1 Sam 8:14</a>",
      "comment": "Elijah’s flight into the territory of Judah reflects both his fear and the isolation of God’s prophets. He leaves his servant behind, emphasizing his solitude—a theme found in the lives of many biblical prophets and saints."
    },
    {
      "pk": 11019004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 4,
      "text": "But he went a day’s journey into the wilderness, and came and sat down under a broom tree. And he prayed that he might die, and said, 'It is enough. Now, O LORD, take my life, for I am no better than my ancestors.'",
      "links": "<a href='/AIV/6/7/16'>Judg 7:16</a>; <a href='/AIV/18/7/15'>Job 7:15</a>",
      "comment": "Like Job and Moses before him, Elijah expresses despair before God. This deep honesty and surrender highlight the prophet’s reliance on God even in suffering, foreshadowing Christ’s agony in Gethsemane (<a href='/AIV/41/14/34'>Mark 14:34</a>)."
    },
    {
      "pk": 11019005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 5,
      "text": "Then he lay down and slept under the broom tree. Suddenly, an angel touched him and said to him, 'Arise and eat.'",
      "links": "<a href='/AIV/9/19/5'>1 Sam 19:5</a>; <a href='/AIV/42/22/43'>Luke 22:43</a>",
      "comment": "Divine aid comes through an angel, reminding us of God’s mercy and providence. Angels are recurring messengers throughout scripture, like during Christ’s agony—see <a href='/AIV/42/22/43'>Luke 22:43</a>."
    },
    {
      "pk": 11019006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 6,
      "text": "He looked, and there by his head was a cake baked on hot stones, and a jar of water. So he ate and drank and lay down again.",
      "links": "<a href='/AIV/2/16/4'>Ex 16:4</a>; <a href='/AIV/19/78/25'>Ps 78:25</a>",
      "comment": "Like the manna from heaven, this simple meal provided by God sustains Elijah. It is a sign of divine care and foreshadows heavenly bread—see <a href='/AIV/43/6/51'>John 6:51</a>."
    },
    {
      "pk": 11019007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 7,
      "text": "The angel of the LORD came back a second time and touched him, and said, 'Arise and eat, because the journey is too much for you.'",
      "links": "<a href='/AIV/2/23/20'>Ex 23:20</a>",
      "comment": "A second visit and meal signify God’s ongoing support for those He calls. The repetition often points to a spiritual strengthening, indicative of the grace provided for a spiritual journey (<a href='/AIV/46/10/13'>1 Cor 10:13</a>)."
    },
    {
      "pk": 11019008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 8,
      "text": "So he arose, ate and drank, and went in the strength of that food forty days and forty nights to Horeb, the mountain of God.",
      "links": "<a href='/AIV/2/3/1'>Ex 3:1</a>; <a href='/AIV/40/4/2'>Matt 4:2</a>",
      "comment": "The forty-day journey echoes the forty years of Israel in the wilderness and Jesus’ fast. Horeb (Sinai) is the site of divine encounters—laying groundwork for the revelation to follow."
    },
    {
      "pk": 11019009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 9,
      "text": "There he entered a cave and spent the night. And the word of the LORD came to him, 'What are you doing here, Elijah?'",
      "links": "<a href='/AIV/2/33/22'>Ex 33:22</a>",
      "comment": "The cave evokes Moses’ experience at Sinai, emphasizing continuity of revelation. The direct question prepares Elijah for deeper spiritual insight, a pattern found in many encounters between God and man."
    },
    {
      "pk": 11019010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 10,
      "text": "He replied, 'I have been very zealous for the LORD God Almighty, but the Israelites have forsaken Your covenant, torn down Your altars, and killed Your prophets with the sword. I alone am left, and they seek to take my life.'",
      "links": "<a href='/AIV/11/18/4'>1Kgs 18:4</a>; <a href='/AIV/45/11/3'>Rom 11:3</a>",
      "comment": "Elijah’s lament is referenced by Paul in Romans, showing the enduring struggle of God’s servants. This verse also prefigures the feeling of isolation Jesus felt in His passion."
    },
    {
      "pk": 11019011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 11,
      "text": "The LORD said, 'Go out and stand on the mountain in the presence of the LORD, for the LORD is about to pass by.' A great and strong wind tore the mountains apart and broke the rocks before the LORD, but the LORD was not in the wind. After the wind there was an earthquake, but the LORD was not in the earthquake.",
      "links": "<a href='/AIV/2/33/21-22'>Ex 33:21-22</a>; <a href='/AIV/19/46/2'>Ps 46:2</a>",
      "comment": "God often works in ways contrary to human expectation. The manifestations echo Sinai’s theophanies, but deeper revelation is not found in dramatic signs."
    },
    {
      "pk": 11019012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 12,
      "text": "After the earthquake came a fire, but the LORD was not in the fire. And after the fire came a still small voice.",
      "links": "<a href='/AIV/11/18/38'>1Kgs 18:38</a>; <a href='/AIV/43/6/63'>John 6:63</a>",
      "comment": "God chooses to speak gently. The 'still small voice' points to the intimacy of true revelation, paralleling Christ’s private teachings and how He reveals Himself most profoundly not always in public spectacle."
    },
    {
      "pk": 11019013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 13,
      "text": "When Elijah heard it, he wrapped his face in his cloak and went out and stood at the entrance of the cave. And a voice said to him, 'What are you doing here, Elijah?'",
      "links": "<a href='/AIV/2/3/6'>Ex 3:6</a>",
      "comment": "Elijah’s act of covering his face is a sign of reverence before God, just as Moses did. This gesture points to the mystery and majesty of God’s presence, encountered in humility."
    },
    {
      "pk": 11019014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 14,
      "text": "He replied, 'I have been very zealous for the LORD God Almighty, but the Israelites have forsaken Your covenant, torn down Your altars, and killed Your prophets with the sword. I alone am left, and they seek to take my life.'",
      "links": "<a href='/AIV/11/19/10'>1Kgs 19:10</a>",
      "comment": "Repeating the lament, Elijah’s persistence is answered by ongoing divine guidance. Perseverance in prayer, even with repeated complaints, is a mark of authentic relationship with God."
    },
    {
      "pk": 11019015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 15,
      "text": "The LORD said to him, 'Go back the way you came, and go to the wilderness of Damascus. When you arrive, anoint Hazael to be king over Aram.'",
      "links": "<a href='/AIV/12/8/13'>2Kgs 8:13</a>; <a href='/AIV/9/10/1'>1 Sam 10:1</a>",
      "comment": "The command to anoint reveals God’s sovereign guidance in secular matters, and the prophetic role in anointing leaders is remarkable. This shows that spiritual authority may transcend national boundaries."
    },
    {
      "pk": 11019016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 16,
      "text": "You shall also anoint Jehu son of Nimshi to be king over Israel, and anoint Elisha son of Shaphat from Abel Meholah to succeed you as prophet.",
      "links": "<a href='/AIV/12/9/1-6'>2Kgs 9:1-6</a>; <a href='/AIV/4/27/18'>Num 27:18</a>",
      "comment": "Succession is emphasized here—prophetic and royal authority both pass by anointing, underscoring the importance of continuity and transmission of grace and office."
    },
    {
      "pk": 11019017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 17,
      "text": "It shall come to pass that whoever escapes the sword of Hazael, Jehu will kill; and whoever escapes the sword of Jehu, Elisha will put to death.",
      "links": "<a href='/AIV/12/10/11'>2Kgs 10:11</a>",
      "comment": "Judgment is thorough; all agents execute God’s justice. This verse demonstrates how God accomplishes His purposes through multiple instruments and succession of leadership."
    },
    {
      "pk": 11019018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 18,
      "text": "Yet I will leave seven thousand in Israel, all the knees that have not bowed to Baal, and every mouth that has not kissed him.",
      "links": "<a href='/AIV/45/11/4'>Rom 11:4</a>; <a href='/AIV/27/3/7'>Dan 3:7</a>",
      "comment": "The number seven thousand indicates a faithful remnant. Despite apparent apostasy, God always preserves a core of true worshippers—a theme echoed in Paul’s letter to the Romans."
    },
    {
      "pk": 11019019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 19,
      "text": "So Elijah went from there and found Elisha son of Shaphat. He was plowing with twelve pairs of oxen, and he himself was driving the twelfth pair. Elijah came over to him and threw his cloak around him.",
      "links": "<a href='/AIV/4/20/24'>Num 20:24</a>; <a href='/AIV/12/2/8'>2Kgs 2:8</a>",
      "comment": "Elijah passes his mantle by placing his cloak on Elisha—a sign of spiritual succession, reminiscent of Moses to Joshua. This act foreshadows later passing of spiritual authority in the early Church."
    },
    {
      "pk": 11019020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 20,
      "text": "Elisha left the oxen, ran after Elijah, and said, 'Let me kiss my father and mother goodbye, and then I will follow you.' Elijah replied, 'Go back—what have I done to you?'",
      "links": "<a href='/AIV/42/9/61'>Luke 9:61-62</a>",
      "comment": "Elisha’s request is echoed in the radical demands of discipleship made by Jesus, urging followers to forsake all for the call. The ties of family versus the call of God is a frequent theme—see <a href='/AIV/42/9/62'>Luke 9:62</a>."
    },
    {
      "pk": 11019021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 19,
      "verse": 21,
      "text": "So Elisha returned and took his pair of oxen and sacrificed them. He boiled their flesh with the equipment and gave it to the people, and they ate. Then he arose and followed Elijah and served him.",
      "links": "<a href='/AIV/8/22/17'>1 Sam 22:17</a>; <a href='/AIV/43/21/15'>John 21:15</a>",
      "comment": "Elisha’s total renunciation—sacrificing his oxen—shows complete detachment and dedication. Such a gesture mirrors acts of surrender and service found in the call of the apostles, prefiguring later signs of obedience and service in the Church."
    }
  ],
  "translatedAt": "2025-12-24T03:40:01.441Z"
}