{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 10,
  "verses": [
    {
      "pk": 11010001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 1,
      "text": "When the queen of Sheba heard of the fame of Solomon concerning the name of the LORD, she came to test him with hard questions.",
      "links": "<a href='/AIV/14/9/1'>2 Chr. 9:1</a>; <a href='/AIV/40/12/42'>Matt. 12:42</a>",
      "comment": "The visit of the queen of Sheba shows the renown of Solomon's wisdom and God's glory revealed to the nations. Jesus references her in Matthew 12:42, drawing a connection between the wisdom of Solomon and Himself, who is Wisdom incarnate."
    },
    {
      "pk": 11010002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 2,
      "text": "She came to Jerusalem with a very great caravan, with camels carrying spices, very much gold, and precious stones. When she came to Solomon, she spoke with him about everything that was on her heart.",
      "links": "<a href='/AIV/19/72/10-15'>Ps. 72:10-15</a>",
      "comment": "Her journey foreshadows the drawing of the Gentiles to the Davidic king. The gifts she brings are echoed in Psalm 72 as well as the gifts brought to Jesus in Matthew 2:11, showing the king's global significance."
    },
    {
      "pk": 11010003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 3,
      "text": "Solomon answered all her questions; there was nothing hidden from the king which he could not explain to her.",
      "links": "<a href='/AIV/19/119/99-100'>Ps. 119:99-100</a>",
      "comment": "Solomon's wisdom is a type of Christ, the fullness of wisdom, as Paul says in Colossians 2:3. The king's insight overshadows the spiritual leadership that guides God's people."
    },
    {
      "pk": 11010004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 4,
      "text": "When the queen of Sheba saw all the wisdom of Solomon, the house that he had built,",
      "links": "<a href='/AIV/14/9/3-4'>2 Chr. 9:3-4</a>",
      "comment": "Solomon's house here refers both to his palace and—symbolically—the ordered people of God gathered in worship. This foreshadows the New Testament ecclesia, the household of faith."
    },
    {
      "pk": 11010005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 5,
      "text": "the food at his table, the seating of his officials, the attendance of his servants, their clothing, his cupbearers, the burnt offerings he offered at the house of the LORD, she was left breathless.",
      "links": "<a href='/AIV/14/9/4'>2 Chr. 9:4</a>",
      "comment": "The queen is astonished especially at the worship and liturgy offered. Order and beauty in worship reflect the glory of the heavenly King; earthly worship points to heavenly realities."
    },
    {
      "pk": 11010006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 6,
      "text": "She said to the king, 'The report was true that I heard in my own land about your words and your wisdom,",
      "links": "",
      "comment": "The truth of Solomon’s wisdom draws the Gentile queen to seek him—a symbol of the nations seeking the revelation of God through his chosen king."
    },
    {
      "pk": 11010007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 7,
      "text": "'but I did not believe the reports until I came and my own eyes saw it. Behold, the half was not told me; your wisdom and prosperity surpass the report which I heard.",
      "links": "<a href='/AIV/18/42/5'>Job 42:5</a>",
      "comment": "Personal experience leads from doubt to faith. As Job discovered, seeing God's work firsthand is more powerful than report. This is echoed in Christian encounter with divine mysteries."
    },
    {
      "pk": 11010008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 8,
      "text": "'Happy are your men! Happy are your servants, who continually stand before you and hear your wisdom!",
      "links": "<a href='/AIV/19/144/15'>Ps. 144:15</a>",
      "comment": "Happiness is found in being near the wise king, just as blessedness comes from remaining in the presence of the true King, Christ (Matt. 5:1-12)."
    },
    {
      "pk": 11010009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 9,
      "text": "'Blessed be the LORD your God, who has delighted in you, setting you on the throne of Israel! Because the LORD loves Israel forever, he has made you king, that you may execute justice and righteousness.'",
      "links": "<a href='/AIV/19/72/1-2'>Ps. 72:1-2</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "She recognizes God's choosing and the king’s purpose—justice and righteousness. This role finds its fulfilment in Jesus, whose kingdom is everlasting and truly just."
    },
    {
      "pk": 11010010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 10,
      "text": "Then she gave the king one hundred and twenty talents of gold, a very large quantity of spices, and precious stones. Never again came such an abundance of spices as those the queen of Sheba gave to King Solomon.",
      "links": "<a href='/AIV/19/72/15'>Ps. 72:15</a>; <a href='/AIV/40/2/11'>Matt. 2:11</a>",
      "comment": "Her gifts prefigure the Magi’s offerings to Jesus. Gifts to the king reflect the response of the nations to God's anointed One."
    },
    {
      "pk": 11010011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 11,
      "text": "Moreover, the fleet of ships from Hiram, which brought gold from Ophir, also brought great amounts of almug wood and precious stones from Ophir.",
      "links": "<a href='/AIV/9/9/27'>2 Sam. 8:10</a>; <a href='/AIV/14/2/8'>2 Chr. 2:8</a>",
      "comment": "Solomon’s wide-ranging trade connections reveal God’s blessing and the role of Israel as a light to the nations, foreshadowing the universal reach of the new covenant."
    },
    {
      "pk": 11010012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 12,
      "text": "The king made of the almug wood supports for the house of the LORD and for the king’s house, also lyres and harps for singers. Never again came such almug wood, nor was it seen to this day.",
      "links": "<a href='/AIV/10/6/5'>2 Sam. 6:5</a>",
      "comment": "Worship is enhanced by art and music, showing that giving God the best from creation is deeply biblical. The beauty of worship points to the glory of God Himself."
    },
    {
      "pk": 11010013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 13,
      "text": "King Solomon gave to the queen of Sheba all she desired, whatever she asked, besides what he gave her from his royal bounty. Then she returned to her own land, she and her servants.",
      "links": "<a href='/AIV/14/9/12'>2 Chr. 9:12</a>",
      "comment": "Solomon’s generosity reflects the generosity of God’s kingdom. In the New Testament, Christ grants spiritual gifts abundantly to His people."
    },
    {
      "pk": 11010014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 14,
      "text": "The weight of gold that came to Solomon in one year was six hundred and sixty-six talents of gold,",
      "links": "<a href='/AIV/14/9/13'>2 Chr. 9:13</a>; <a href='/AIV/66/13/18'>Rev. 13:18</a>",
      "comment": "The symbolic number, 666, later being the number of the beast in Revelation, hints at the dangers of earthly wealth and the temptation to idolatry when earthly splendor overshadows true wisdom."
    },
    {
      "pk": 11010015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 15,
      "text": "besides what came from the traders and the business of the merchants, and from all the kings of Arabia and the governors of the land.",
      "links": "",
      "comment": "Israel attracts wealth from all nations. God’s promise to Abraham, that all nations will be blessed in his offspring (Gen. 22:18), is being fulfilled through Solomon."
    },
    {
      "pk": 11010016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 16,
      "text": "King Solomon made two hundred large shields of beaten gold; six hundred shekels of gold went into each shield.",
      "links": "<a href='/AIV/14/9/15'>2 Chr. 9:15</a>",
      "comment": "The opulent shields are both symbols of royal authority and God’s provision, hinting at the earthly splendor that, if misused, can tempt rulers away from humble service to God."
    },
    {
      "pk": 11010017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 17,
      "text": "He also made three hundred small shields of beaten gold; three minas of gold went into each shield. The king put them in the House of the Forest of Lebanon.",
      "links": "<a href='/AIV/7/9/15'>Judg. 9:15</a>",
      "comment": "House of the Forest of Lebanon was a royal armory and palace. The display of gold signifies royal majesty and prosperity, but a warning remains against pride and misplaced trust in wealth."
    },
    {
      "pk": 11010018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 18,
      "text": "The king made a great throne of ivory and overlaid it with the finest gold.",
      "links": "<a href='/AIV/14/9/17'>2 Chr. 9:17</a>",
      "comment": "The throne is a symbol of divinely-ordained kingship. The king's seat recalls God's own throne (e.g., Is. 6:1; Rev. 4), hinting at the authority that endures in Christ’s everlasting reign."
    },
    {
      "pk": 11010019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 19,
      "text": "The throne had six steps, and the throne had a rounded back; there were armrests on each side of the seat, and two lions standing beside the armrests,",
      "links": "",
      "comment": "Lions symbolize strength, kingship, and the tribe of Judah (Gen. 49:9). Christ, the Lion of Judah, fulfills all royal imagery in Scripture (Rev. 5:5)."
    },
    {
      "pk": 11010020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 20,
      "text": "and twelve lions stood on the steps, one on each end of a step, on the six steps. Nothing like it was made for any other kingdom.",
      "links": "",
      "comment": "The number twelve echoes the tribes of Israel and the apostles in the New Testament. Thrones in Revelation 4:4 further connect kingship with spiritual authority."
    },
    {
      "pk": 11010021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 21,
      "text": "All King Solomon’s drinking vessels were gold, and all the vessels of the House of the Forest of Lebanon were pure gold. None were of silver—it was considered as nothing in the days of Solomon.",
      "links": "<a href='/AIV/14/9/20'>2 Chr. 9:20</a>",
      "comment": "Extraordinary wealth and feasting foreshadow the Messianic banquet (Is. 25:6; Rev. 19:9), but the narrative also subtly critiques excess."
    },
    {
      "pk": 11010022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 22,
      "text": "For the king had a fleet of ships at sea with the fleet of Hiram. Every three years the ships brought gold, silver, ivory, apes, and peacocks.",
      "links": "<a href='/AIV/14/9/21'>2 Chr. 9:21</a>",
      "comment": "International trade under Solomon echoes the promise of the nations coming to Jerusalem (Is. 60:5-10), yet again foreshadowing the gathering of all peoples into God’s kingdom."
    },
    {
      "pk": 11010023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 23,
      "text": "So King Solomon surpassed all the kings of the earth in riches and in wisdom.",
      "links": "<a href='/AIV/19/72/11'>Ps. 72:11</a>",
      "comment": "His superiority represents the glory of God’s anointed king, but the New Testament reveals that Christ Himself surpasses even Solomon (Matt. 12:42)."
    },
    {
      "pk": 11010024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 24,
      "text": "The whole earth sought the presence of Solomon to hear his wisdom, which God had put into his heart.",
      "links": "<a href='/AIV/40/12/42'>Matt. 12:42</a>",
      "comment": "Universal pilgrimage to Solomon foreshadows the universal movement toward Christ, the Word and Wisdom of God."
    },
    {
      "pk": 11010025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 25,
      "text": "Every one of them brought his present—articles of silver and gold, garments, armor, spices, horses, and mules, year after year.",
      "links": "<a href='/AIV/19/68/29'>Ps. 68:29</a>",
      "comment": "The tribute from the nations is prophetic of all people bringing their gifts and service to the one King, which is fulfilled in the worship and unity of the church across the world."
    },
    {
      "pk": 11010026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 26,
      "text": "Solomon gathered together chariots and horsemen. He had fourteen hundred chariots and twelve thousand horsemen, whom he stationed in the chariot cities and with the king himself in Jerusalem.",
      "links": "<a href='/AIV/14/9/25'>2 Chr. 9:25</a>; <a href='/AIV/5/17/16'>Deut. 17:16</a>",
      "comment": "Solomon’s accumulation of military strength exceeds the warnings of Deuteronomy 17:16. Such strength, if not guided by faith, can lead a ruler astray from full trust in God’s providence."
    },
    {
      "pk": 11010027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 27,
      "text": "The king made silver as common in Jerusalem as stones, and cedars as plentiful as the sycamores of the lowland.",
      "links": "<a href='/AIV/14/9/27'>2 Chr. 9:27</a>",
      "comment": "The abundance is remarkable, but also hints at the prosperity that tempts the heart away from spiritual priorities if not properly ordered."
    },
    {
      "pk": 11010028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 28,
      "text": "Solomon’s horses were imported from Egypt and Kue, and the king’s traders received them from Kue for a price.",
      "links": "<a href='/AIV/14/9/28'>2 Chr. 9:28</a>",
      "comment": "Egyptian horses, a symbol of royal might, again recall Deut. 17:16’s caution. Spiritual leadership must ultimately trust in the LORD, not merely in earthly means."
    },
    {
      "pk": 11010029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 10,
      "verse": 29,
      "text": "A chariot was imported from Egypt for six hundred shekels of silver, and a horse for one hundred and fifty. So they exported them to all the kings of the Hittites and the kings of Syria.",
      "links": "<a href='/AIV/14/9/28'>2 Chr. 9:28</a>",
      "comment": "The international trade in horses and chariots underscores Israel’s influence but also points to the dangers of worldly power, which must be balanced with spiritual faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T03:34:08.198Z"
}