{
  "book": "Ecclesiastes",
  "bookAbbreviation": "Eccl",
  "chapter": 9,
  "verses": [
    {
      "pk": 1932190,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 1,
      "text": "So I reflected on all this and concluded that the righteous and the wise, as well as their deeds, are in God's hands. No one knows whether love or hatred awaits them; everything lies ahead.",
      "links": "<a href='/AIV/18/12/10'>Job 12:10</a>; <a href='/AIV/19/31/15'>Ps. 31:15</a>",
      "comment": "In affirming that all is in the hands of God, the verse stresses divine providence. The mystery of destiny mirrors related wisdom texts (cf. Job 12:10)."
    },
    {
      "pk": 1932191,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 2,
      "text": "Everything happens to everyone alike: the same event comes to the righteous and the wicked, to the good and the sinful, to the clean and unclean, to those who sacrifice and those who do not. As with the good, so with the sinner; as with those who swear, so with those who fear oaths.",
      "links": "<a href='/AIV/40/5/45'>Matt. 5:45</a>; <a href='/AIV/19/73/13-14'>Ps. 73:13-14</a>",
      "comment": "This verse underscores the universal fate of mankind—death and suffering—regardless of moral standing (cf. Matt. 5:45). It challenges superficial distinctions, preparing for deeper reflections on justice and grace."
    },
    {
      "pk": 1932192,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 3,
      "text": "This is an evil in all that is done under the sun: that the same destiny befalls everyone. Also, the hearts of the children of men are full of evil, and madness is in their hearts while they live, and afterward they go to the dead.",
      "links": "<a href='/AIV/1/6/5'>Gen. 6:5</a>; <a href='/AIV/24/17/9'>Jer. 17:9</a>",
      "comment": "The universality of death and the wickedness of humanity are emphatically stated (cf. Gen. 6:5; Jer. 17:9). This pessimism sets the scene for the need of redemption and points toward Christ’s ultimate victory over death."
    },
    {
      "pk": 1932193,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 4,
      "text": "But to all who are joined to the living, there is hope—for a living dog is better than a dead lion.",
      "links": "<a href='/AIV/19/115/17'>Ps. 115:17</a>",
      "comment": "Living is portrayed as a superior state compared to death, regardless of one’s status (lion or dog). This anticipation of resurrection and persistence subtly invites reflection on the value of earthly life as a preparation for what comes after."
    },
    {
      "pk": 1932194,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 5,
      "text": "For the living know that they will die, but the dead know nothing; they have no further reward, for their memory is forgotten.",
      "links": "<a href='/AIV/19/6/5'>Ps. 6:5</a>",
      "comment": "The dead are pictured as cut off from earthly experience. The verse is not a metaphysical statement about the afterlife, but about the limits of earthly awareness, paralleling similar motifs in Psalms (Ps. 6:5)."
    },
    {
      "pk": 1932195,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 6,
      "text": "Both their love and their hate and their jealousy have vanished; never again will they have a share in anything done under the sun.",
      "links": "<a href='/AIV/19/88/10-12'>Ps. 88:10-12</a>",
      "comment": "All passions and influences of the dead cease as regards the affairs of earthly life. The phrase 'under the sun' keeps the focus on temporal existence."
    },
    {
      "pk": 1932196,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 7,
      "text": "Go, eat your bread with joy and drink your wine with a glad heart, for God has already approved what you do.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/42/15/23'>Luke 15:23</a>",
      "comment": "This advice affirms the goodness of creation and the legitimacy of enjoying life’s gifts (cf. Ps. 104:15). The affirmation of ‘God has already approved’ subtly points to a sacramental vision of ordinary life that carries deeper spiritual meaning."
    },
    {
      "pk": 1932197,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 8,
      "text": "Let your garments always be white, and let oil not be lacking upon your head.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/66/3/4-5'>Rev. 3:4-5</a>",
      "comment": "White garments and oil are symbols of purity, festivity, and blessing. In the New Testament, white garments signify holiness and victory (Rev. 3:4-5). Oil often hints at spiritual anointing and kingship."
    },
    {
      "pk": 1932198,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 9,
      "text": "Enjoy life with the wife whom you love, all the days of your fleeting life that God has given you under the sun; for this is your portion in life and in your toil under the sun.",
      "links": "<a href='/AIV/20/5/18'>Prov. 5:18</a>; <a href='/AIV/1/2/24'>Gen. 2:24</a>",
      "comment": "Marriage is affirmed as a divine gift (cf. Gen. 2:24; Prov. 5:18). The sanctity of marital love points beyond mere pleasure, echoing higher mysteries connected to Christ and the Church (Eph. 5:32, implied)."
    },
    {
      "pk": 1932199,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 10,
      "text": "Whatever your hand finds to do, do it with your strength. For there is no work or planning or knowledge or wisdom in Sheol, where you are going.",
      "links": "<a href='/AIV/19/146/2'>Ps. 146:2</a>; <a href='/AIV/40/25/21'>Matt. 25:21</a>",
      "comment": "The verse urges diligence in earthly life, for the afterlife (‘Sheol’) is seen here as a place beyond one’s earthly deeds. It also foreshadows Christ’s teaching on faithful stewardship (Matt. 25:21)."
    },
    {
      "pk": 1932200,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 11,
      "text": "Again I saw under the sun that the race is not to the swift, nor the battle to the strong, nor bread to the wise, nor riches to the discerning, nor favor to those with knowledge, but time and chance happen to all.",
      "links": "<a href='/AIV/10/14/19'>2 Sam. 14:19</a>; <a href='/AIV/45/9/16'>Rom. 9:16</a>",
      "comment": "The limits of human effort are noted. Success is not guaranteed by talents or wisdom alone, reinforcing dependence on divine providence (cf. Rom. 9:16)—a truth fulfilled in the mysteries of grace."
    },
    {
      "pk": 1932201,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 12,
      "text": "For man does not know his time. Like fish caught in a cruel net, or birds trapped in a snare, so men are ensnared in an evil time, when it falls suddenly upon them.",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "Life’s unpredictability is likened to sudden traps. The underlying lesson is to remain vigilant and prepared—a wisdom echoed in Christ’s parables about readiness (e.g., Matt. 24:42)."
    },
    {
      "pk": 1932202,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 13,
      "text": "I have also seen this illustration of wisdom under the sun, and it struck me greatly:",
      "links": "",
      "comment": "The author turns to a story that reinforces the value of wisdom, even when overlooked by the world."
    },
    {
      "pk": 1932203,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 14,
      "text": "There was a small city with a few men in it, and a mighty king came against it, surrounded it, and built great siege works against it.",
      "links": "<a href='/AIV/20/21/22'>Prov. 21:22</a>",
      "comment": "This historical anecdote parallels narratives elsewhere in Scripture about wisdom outshining power (Prov. 21:22), setting up the punchline about the importance of wisdom."
    },
    {
      "pk": 1932204,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 15,
      "text": "But there was found in it a poor wise man, and he by his wisdom saved the city. Yet no one remembered that poor man.",
      "links": "<a href='/AIV/19/107/43'>Ps. 107:43</a>; <a href='/AIV/40/13/57'>Matt. 13:57</a>",
      "comment": "Wisdom’s impact is potent, though often unappreciated. The theme connects with the role of prophets and the suffering servant motif—pointing toward Christ who was despised yet was the source of true salvation."
    },
    {
      "pk": 1932205,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 16,
      "text": "So I said, ‘Wisdom is better than strength.’ Yet the wisdom of the poor man is despised, and his words are not heeded.",
      "links": "<a href='/AIV/20/8/11'>Prov. 8:11</a>; <a href='/AIV/46/1/27'>1 Cor. 1:27</a>",
      "comment": "This illustrates the spiritual principle that God chooses the weak to shame the strong (1 Cor. 1:27). The exaltation of wisdom over worldly power foreshadows Christ’s way of humility."
    },
    {
      "pk": 1932206,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 17,
      "text": "The words of the wise, spoken quietly, are more to be heeded than the shouts of a ruler among fools.",
      "links": "<a href='/AIV/20/15/1'>Prov. 15:1</a>",
      "comment": "Gentle wisdom is of greater value than loud foolishness. This principle is found throughout Scripture, resonating with Christ’s own teaching style and the still, small voice of guidance (cf. 1 Kings 19:12, implied)."
    },
    {
      "pk": 1932207,
      "translation": "AIV",
      "book": 21,
      "chapter": 9,
      "verse": 18,
      "text": "Wisdom is better than weapons of war, but one sinner can destroy much good.",
      "links": "<a href='/AIV/20/16/32'>Prov. 16:32</a>; <a href='/AIV/1/3/6'>Gen. 3:6</a>",
      "comment": "Wisdom is presented as superior to mere power. Yet the destructive power of sin is real—harkening back to humanity’s fall (Gen. 3:6). This hints at both personal responsibility and the wider communal effects of sin, setting the stage for the necessity of redemption."
    }
  ],
  "translatedAt": "2025-12-23T06:11:12.589Z"
}