{
  "book": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 19,
  "verses": [
    {
      "pk": 1941901,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 1,
      "text": "The LORD spoke to Moses and to Aaron, saying,",
      "links": "<a href='/ESV/2/12/43'>Ex. 12:43</a>",
      "comment": "Direct address, setting context; same as original."
    },
    {
      "pk": 1941902,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 2,
      "text": "This is the statute of the law that the LORD has commanded: Tell the Israelites to bring you a red heifer, without defect, in which there is no blemish, and on which no yoke has ever been put.",
      "links": "<a href='/ESV/4/8/7'>Num. 8:7</a>; <a href='/ESV/22/5/2'>Song 5:2</a>",
      "comment": "Maintains all ritual requirements from the text."
    },
    {
      "pk": 1941903,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 3,
      "text": "You shall give it to Eleazar the priest, and he shall take it outside the camp, and it shall be slaughtered before him.",
      "links": "<a href='/ESV/3/16/27'>Lev. 16:27</a>",
      "comment": "Follows the original order and persons involved."
    },
    {
      "pk": 1941904,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 4,
      "text": "Eleazar the priest shall take some of its blood with his finger and sprinkle some of its blood toward the front of the tent of meeting seven times.",
      "links": "<a href='/ESV/3/8/11'>Lev. 8:11</a>",
      "comment": "Sprinkling of blood: ritual cleansing."
    },
    {
      "pk": 1941905,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 5,
      "text": "The heifer shall be burned in his sight. Its hide, its flesh, its blood, and its dung shall be burned.",
      "links": "<a href='/ESV/3/4/12'>Lev. 4:12</a>",
      "comment": "Note explicit mention of the whole heifer."
    },
    {
      "pk": 1941906,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 6,
      "text": "And the priest shall take cedar wood, hyssop, and scarlet yarn, and throw them onto the fire burning the heifer.",
      "links": "<a href='/ESV/3/14/4'>Lev. 14:4</a>; <a href='/ESV/3/14/6'>Lev. 14:6</a>",
      "comment": "Materials added to fire for purification as found in Leviticus."
    },
    {
      "pk": 1941907,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 7,
      "text": "Then the priest shall wash his clothes and bathe his body in water, and afterward he may come into the camp. The priest shall be unclean until evening.",
      "links": "<a href='/ESV/3/16/28'>Lev. 16:28</a>",
      "comment": "Ritual uncleanness until sunset."
    },
    {
      "pk": 1941908,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 8,
      "text": "The one who burns the heifer shall wash his clothes in water and bathe his body in water and shall be unclean until evening.",
      "links": "<a href='/ESV/4/19/7'>Num. 19:7</a>",
      "comment": "Parallel to previous verse; emphasizes ritual process."
    },
    {
      "pk": 1941909,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 9,
      "text": "And a man who is clean shall gather up the ashes of the heifer and place them outside the camp in a clean place, and they shall be kept for the congregation of the Israelites for water for impurity; it is a purification offering.",
      "links": "<a href='/ESV/4/19/17'>Num. 19:17</a>",
      "comment": "Clarifies the ashes' use in purification."
    },
    {
      "pk": 1941910,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 10,
      "text": "The one who gathers the ashes of the heifer shall wash his clothes and be unclean until evening. This shall be a lasting statute for the Israelites and for the foreigner who dwells among them.",
      "links": "<a href='/ESV/3/16/29'>Lev. 16:29</a>",
      "comment": "Applies ritual law to resident aliens as in original."
    },
    {
      "pk": 1941911,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 11,
      "text": "Whoever touches the dead body of any person shall be unclean for seven days.",
      "links": "<a href='/ESV/4/5/2'>Num. 5:2</a>",
      "comment": "Clarity of cause and duration of uncleanness."
    },
    {
      "pk": 1941912,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 12,
      "text": "He shall purify himself with the water on the third day and on the seventh day, and then he will be clean. But if he does not purify himself on the third and seventh days, he will not be clean.",
      "links": "<a href='/ESV/4/8/7'>Num. 8:7</a>; <a href='/ESV/3/15/13'>Lev. 15:13</a>",
      "comment": "Emphasizes necessity of purification at specified times."
    },
    {
      "pk": 1941913,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 13,
      "text": "Whoever touches a dead person, the body of anyone who has died, and does not purify himself, defiles the tabernacle of the LORD, and that person shall be cut off from Israel, because the water for impurity was not sprinkled on him. He remains unclean; his uncleanness is still on him.",
      "links": "<a href='/ESV/3/15/31'>Lev. 15:31</a>",
      "comment": "Clarifies consequence of neglecting purification."
    },
    {
      "pk": 1941914,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 14,
      "text": "This is the law when someone dies in a tent: everyone who comes into the tent and everyone who is in the tent shall be unclean for seven days.",
      "links": "<a href='/ESV/4/19/11'>Num. 19:11</a>",
      "comment": "States law for deaths occurring indoors."
    },
    {
      "pk": 1941915,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 15,
      "text": "And every open vessel that has no cover fastened on it is unclean.",
      "links": "<a href='/ESV/3/11/32'>Lev. 11:32</a>",
      "comment": "Applies uncleanness to unsealed containers."
    },
    {
      "pk": 1941916,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 16,
      "text": "Whoever in the open field touches someone who was killed with a sword or someone who died naturally, or touches a human bone or a grave, shall be unclean for seven days.",
      "links": "<a href='/ESV/4/19/11'>Num. 19:11</a>",
      "comment": "Applies uncleanness to those in contact with bones or graves."
    },
    {
      "pk": 1941917,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 17,
      "text": "For the unclean person, they shall take some ashes from the burnt purification offering and put fresh water on them in a vessel.",
      "links": "<a href='/ESV/4/19/9'>Num. 19:9</a>",
      "comment": "Combining ashes and water for purification as prescribed."
    },
    {
      "pk": 1941918,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 18,
      "text": "And a clean person shall take hyssop, dip it in the water, and sprinkle it on the tent, on all the vessels, on the people who were there, and on anyone who touched a bone, a grave, or a dead body.",
      "links": "<a href='/ESV/2/12/22'>Ex. 12:22</a>; <a href='/ESV/3/14/6'>Lev. 14:6</a>",
      "comment": "Purification ritual extended in detail."
    },
    {
      "pk": 1941919,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 19,
      "text": "And the clean person shall sprinkle it on the unclean on the third day and on the seventh day; and on the seventh day he shall purify him, and he shall wash his clothes, and bathe himself in water, and at evening he will be clean.",
      "links": "<a href='/ESV/3/15/13'>Lev. 15:13</a>",
      "comment": "Details the purification schedule and final steps."
    },
    {
      "pk": 1941920,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 20,
      "text": "But the person who is unclean and does not purify himself shall be cut off from the assembly, because he has defiled the sanctuary of the LORD. The water for impurity has not been sprinkled on him; he is unclean.",
      "links": "<a href='/ESV/3/15/31'>Lev. 15:31</a>",
      "comment": "Repeat of severe consequence for neglect of ritual."
    },
    {
      "pk": 1941921,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 21,
      "text": "This shall be a perpetual statute for them: The one who sprinkles the water for impurity shall wash his clothes, and the one who touches the water for impurity will be unclean until evening.",
      "links": "<a href='/ESV/4/19/10'>Num. 19:10</a>",
      "comment": "Statute applies universally and perpetually."
    },
    {
      "pk": 1941922,
      "translation": "AIV",
      "book": 4,
      "chapter": 19,
      "verse": 22,
      "text": "And whatever the unclean person touches shall be unclean, and anyone who touches it shall be unclean until evening.",
      "links": "<a href='/ESV/3/15/7'>Lev. 15:7</a>",
      "comment": "Final verse emphasizing transfer of uncleanness; unchanged in meaning."
    }
  ],
  "translatedAt": "2025-12-20T09:33:07.114Z"
}