{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 24,
  "verses": [
    {
      "pk": 4024001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 1,
      "text": "When Balaam saw that it pleased the LORD to bless Israel, he did not go, as at other times, to seek omens, but he set his face toward the wilderness.",
      "links": "<a href='/AIV/4/23/27'>Num. 23:27</a>; <a href='/AIV/5/18/10'>Deut. 18:10</a>",
      "comment": "Balaam stops seeking omens, showing the superiority of divine revelation over pagan divination. The shift from superstition to obedience reflects a sanctified approach to discerning God's will."
    },
    {
      "pk": 4024002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 2,
      "text": "Balaam lifted up his eyes and saw Israel encamped tribe by tribe, and the Spirit of God came upon him.",
      "links": "<a href='/AIV/4/2/2'>Num. 2:2</a>; <a href='/AIV/9/11/6'>Judg. 11:29</a>",
      "comment": "The Spirit of God coming upon Balaam, a foreign prophet, prefigures the universality of God's plan and His ability to speak through unexpected vessels, foreshadowing the outpouring of the Spirit upon all nations."
    },
    {
      "pk": 4024003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 3,
      "text": "He took up his oracle and said: \"The oracle of Balaam the son of Beor, the oracle of the man whose eye is opened,\"",
      "links": "<a href='/AIV/4/23/7'>Num. 23:7</a>",
      "comment": "Balaam asserts the authenticity of his vision—his opened eye denotes spiritual discernment granted by God, not human insight."
    },
    {
      "pk": 4024004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 4,
      "text": "\"the oracle of him who hears the words of God, who sees the vision of the Almighty, falling down with eyes uncovered:\"",
      "links": "<a href='/AIV/4/22/31'>Num. 22:31</a>",
      "comment": "The description emphasizes that true prophecy is received through humility and openness to God's revelation."
    },
    {
      "pk": 4024005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 5,
      "text": "\"How beautiful are your tents, O Jacob, your dwelling places, O Israel!\"",
      "links": "<a href='/AIV/19/84/1'>Ps. 84:1</a>",
      "comment": "Balaam is moved to admiration by the order and sanctity of Israel's camp, suggesting the beauty of worship and unity in God's people."
    },
    {
      "pk": 4024006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 6,
      "text": "\"Like valleys stretched out, like gardens beside a river, like aloes planted by the LORD, like cedars beside the waters.\"",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Images of growth and fruitfulness highlight God's blessing on Israel. The river motif often symbolizes the Spirit and grace."
    },
    {
      "pk": 4024007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 7,
      "text": "\"Water shall flow from his buckets, and his seed shall be in many waters; his king shall be higher than Agag, and his kingdom shall be exalted.\"",
      "links": "<a href='/AIV/10/8/1'>1 Sam. 8:1</a>; <a href='/AIV/19/72/8'>Ps. 72:8</a>",
      "comment": "References to royal exaltation prefigure the coming Messianic king. The water and seed imagery connect to baptism and spiritual fruitfulness."
    },
    {
      "pk": 4024008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 8,
      "text": "\"God brings him out of Egypt; he has the strength of a wild ox. He shall devour the nations, his adversaries, and shall break their bones in pieces and pierce them with his arrows.\"",
      "links": "<a href='/AIV/4/23/22'>Num. 23:22</a>",
      "comment": "The passage underscores the victorious strength God gives to His people, while physically referring to Israel, spiritually this finds fulfillment in Christ's ultimate victory over sin and evil."
    },
    {
      "pk": 4024009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 9,
      "text": "\"He crouched, he lay down like a lion, like a lioness; who will rouse him? Blessed are those who bless you, and cursed are those who curse you.\"",
      "links": "<a href='/AIV/1/49/9'>Gen. 49:9</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>",
      "comment": "Echoing Jacob's blessing, the lion points to the Messianic king (see Rev. 5:5), and the promise of blessing and curse recalls the Abrahamic covenant."
    },
    {
      "pk": 40240010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 10,
      "text": "Balak's anger burned against Balaam, and he struck his hands together. Balak said to Balaam, \"I called you to curse my enemies, but look, you have blessed them these three times!\"",
      "links": "<a href='/AIV/4/23/11'>Num. 23:11</a>",
      "comment": "Frustration is shown at God's blessing. Prophecies cannot be manipulated for selfish gain—divine truth is unchangeable."
    },
    {
      "pk": 40240011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 11,
      "text": "\"So then, flee to your own place! I said I would greatly honor you, but, look, the LORD has held you back from honor.\"",
      "links": "<a href='/AIV/4/22/17'>Num. 22:17</a>",
      "comment": "Contrast between man's promise and God's honor—true honor comes from faithfulness to God's word, not worldly rewards."
    },
    {
      "pk": 40240012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 12,
      "text": "Balaam replied to Balak, \"Did I not tell your messengers whom you sent to me,\"",
      "links": "<a href='/AIV/4/22/38'>Num. 22:38</a>",
      "comment": "Balaam’s consistency in his response highlights the immutability of God’s message."
    },
    {
      "pk": 40240013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 13,
      "text": "\"If Balak were to give me his house full of silver and gold, I could not go beyond the command of the LORD, to do either good or bad of my own will. What the LORD speaks, that I will speak.\"",
      "links": "<a href='/AIV/4/22/18'>Num. 22:18</a>",
      "comment": "Emphasis on obedience to God over material gain foreshadows the call for discipleship and placing God's commands above earthly desires (cf. Matt. 6:33)."
    },
    {
      "pk": 40240014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 14,
      "text": "\"Now, look, I am going back to my people. Come, I will advise you what this people will do to your people in the latter days.\"",
      "links": "<a href='/AIV/4/31/29'>Deut. 31:29</a>",
      "comment": "The reference to 'latter days' carries prophetic weight, suggesting fulfillment in future ages."
    },
    {
      "pk": 40240015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 15,
      "text": "He took up his oracle and said: \"The oracle of Balaam the son of Beor, the oracle of the man whose eye is opened,\"",
      "links": "<a href='/AIV/4/24/3'>Num. 24:3</a>",
      "comment": "Repeated refrain signals the solemnity and authority of the prophecy."
    },
    {
      "pk": 40240016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 16,
      "text": "\"the oracle of him who hears the words of God, and knows the knowledge of the Most High, who sees the vision of the Almighty, falling down with eyes uncovered:\"",
      "links": "<a href='/AIV/4/24/4'>Num. 24:4</a>; <a href='/AIV/1/14/19'>Gen. 14:19</a>",
      "comment": "Here Balaam describes deep spiritual insight—knowing the knowledge of the Most High—hinting at more profound spiritual realities accessible through revelation."
    },
    {
      "pk": 40240017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 17,
      "text": "\"I see him, but not now; I behold him, but not near. A star will come out of Jacob, and a scepter will arise out of Israel. It shall crush the forehead of Moab, and shatter all the sons of Sheth.\"",
      "links": "<a href='/AIV/40/2/2'>Matt. 2:2</a>; <a href='/AIV/19/110/2'>Ps. 110:2</a>; <a href='/AIV/23/9/6'>Isa. 9:6-7</a>",
      "comment": "This is a key Messianic prophecy. The 'star' and 'scepter' point to the coming anointed king—fulfilled in Christ, whose kingdom will reign over all nations. The Magi's star (Matt. 2:2) directly references this."
    },
    {
      "pk": 40240018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 18,
      "text": "\"Edom shall be dispossessed; Seir, his enemies, also shall be dispossessed, while Israel does valiantly.\"",
      "links": "<a href='/AIV/10/8/14'>2 Sam. 8:14</a>",
      "comment": "Victory over Edom and Seir mirrors God’s sovereignty over the nations—fulfilled partially in David's reign, but ultimately in the spiritual kingdom of Christ."
    },
    {
      "pk": 40240019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 19,
      "text": "\"Out of Jacob shall come one who will rule, and he will destroy the survivors of cities.\"",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>",
      "comment": "The ruler from Jacob finds ultimate fulfillment in Jesus, whose authority is exercised through both mercy and righteous judgment."
    },
    {
      "pk": 40240020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 20,
      "text": "Then Balaam saw Amalek and took up his oracle and said: \"Amalek was the first among the nations, but he shall come to destruction.\"",
      "links": "<a href='/AIV/9/15/2-3'>1 Sam. 15:2-3</a>",
      "comment": "Amalek, though prominent, faces divine judgment—demonstrating that human power cannot prevent ultimate defeat apart from God’s will."
    },
    {
      "pk": 40240021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 21,
      "text": "He saw the Kenite and took up his oracle and said: \"Your dwelling place is secure, and your nest is set in the rock;\"",
      "links": "<a href='/AIV/7/4/11'>Judg. 4:11</a>",
      "comment": "The Kenites’ safety is relative and ultimately not absolute; only faithfulness to God offers enduring security."
    },
    {
      "pk": 40240022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 22,
      "text": "\"Nevertheless, Kain shall be burned when Asshur takes you away captive.\"",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>",
      "comment": "Even a strong people like the Kenites will fall unless under God’s protection; pointing toward the need for steadfast union with God’s chosen means of grace."
    },
    {
      "pk": 40240023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 23,
      "text": "He took up his oracle and said, \"Alas, who shall live when God does this?\"",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>",
      "comment": "This rhetorical lament underlines God’s ultimate authority over history and salvation."
    },
    {
      "pk": 40240024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 24,
      "text": "\"But ships shall come from Kittim and shall afflict Asshur and Eber, and they, too, shall come to destruction.\"",
      "links": "<a href='/AIV/27/11/30'>Dan. 11:30</a>",
      "comment": "The distant prophecies about nations and judgment point to a broad vision of God’s sovereignty and the destiny of all peoples."
    },
    {
      "pk": 40240025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 24,
      "verse": 25,
      "text": "Then Balaam rose and returned to his own place, and Balak also went his way.",
      "links": "<a href='/AIV/4/31/8'>Num. 31:8</a>",
      "comment": "Balaam and Balak part ways; the fulfillment of these prophecies reminds us that God's word always prevails. Fidelity to the totality of revelation is crucial for rightly understanding salvation history."
    }
  ],
  "translatedAt": "2025-12-24T01:48:16.909Z"
}