{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 6,
  "verses": [
    {
      "pk": 4006001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/3/10/8'>Leviticus 10:8</a>",
      "comment": "This section opens another segment of laws delivered by God to Moses for the people of Israel. The phrase 'The LORD spoke to Moses' echoes the repeated structure found throughout the Pentateuch. God’s direct communication underlines His authority over ritual practices."
    },
    {
      "pk": 4006002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 2,
      "text": "Speak to the Israelites and say to them: If a man or a woman makes a special vow, the vow of a Nazirite, to dedicate themselves to the LORD,",
      "links": "<a href='/AIV/7/13/5'>Judges 13:5</a>; <a href='/AIV/16/1/11'>Nehemiah 1:11</a>",
      "comment": "The Nazirite vow was available to both men and women, emphasizing a call to personal holiness and devotion. This voluntary consecration is similar to later practices of vows or acts of consecration in Christian tradition."
    },
    {
      "pk": 4006003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 3,
      "text": "he must abstain from wine and strong drink; he must not drink vinegar made from wine or strong drink, nor shall he drink any juice of grapes, or eat grapes, fresh or dried.",
      "links": "<a href='/AIV/7/13/7'>Judges 13:7</a>",
      "comment": "The Nazirite was called to a rigorous regimen of abstinence, particularly from any product of the vine, symbolizing separation from earthly pleasures for a higher purpose."
    },
    {
      "pk": 4006004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 4,
      "text": "All the days of his vow of separation, he shall eat nothing that is made from the grapevine, not even the seeds or the skins.",
      "links": "<a href='/AIV/7/13/14'>Judges 13:14</a>",
      "comment": "The strict prohibition included even the smallest part of the grape, reinforcing the thoroughness of the Nazirite’s dedication. Symbolically, it can be understood as a call to purity in every aspect of life."
    },
    {
      "pk": 4006005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 5,
      "text": "Throughout the days of his vow of separation, no razor shall touch his head. He must be holy until the days are fulfilled for which he separates himself to the LORD; he shall let the locks of hair of his head grow long.",
      "links": "<a href='/AIV/7/16/17'>Judges 16:17</a>",
      "comment": "Growing one’s hair was a visible sign of the Nazirite’s vow, marking him as set apart. Holiness here is not just internal but is also made manifest externally."
    },
    {
      "pk": 4006006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 6,
      "text": "All the days that he separates himself to the LORD, he must not go near a dead body.",
      "links": "<a href='/AIV/3/21/1'>Leviticus 21:1</a>",
      "comment": "Contact with death caused ritual impurity. Not approaching a dead body further increased the level of consecration, paralleling priestly purity."
    },
    {
      "pk": 4006007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 7,
      "text": "Not even for his father or his mother, for his brother or his sister, if they die, shall he make himself unclean, because his dedication to God is upon his head.",
      "links": "<a href='/AIV/3/21/11'>Leviticus 21:11</a>",
      "comment": "The Nazirite’s dedication takes precedence over even the closest of family ties, reflecting the primacy of one’s relationship with God."
    },
    {
      "pk": 4006008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 8,
      "text": "All the days of his separation he is holy to the LORD.",
      "links": "<a href='/AIV/19/4/3'>Psalm 4:3</a>",
      "comment": "Holiness here means being set apart for God. The idea of being dedicated to the Lord echoes throughout later spiritual practices—living a life marked by God’s presence."
    },
    {
      "pk": 4006009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 9,
      "text": "If someone dies very suddenly beside him, making his Nazirite head unclean, he must shave his head on the day of his cleansing; on the seventh day he shall shave it.",
      "links": "<a href='/AIV/3/14/9'>Leviticus 14:9</a>",
      "comment": "Unexpected defilement requires ritual cleansing and shaving of the hair, symbolizing renewal and a recommitment to the vow."
    },
    {
      "pk": 4006010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 10,
      "text": "On the eighth day he shall bring two turtledoves or two young pigeons to the priest, to the entrance of the Tent of Meeting.",
      "links": "<a href='/AIV/3/15/14'>Leviticus 15:14</a>",
      "comment": "Offerings required for purification involve birds, similar to other rites for ceremonial uncleanness. The role of the priest as mediator is central here."
    },
    {
      "pk": 4006011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 11,
      "text": "The priest shall offer one as a sin offering and the other as a burnt offering, making atonement for him, because he sinned by reason of the dead body. He shall consecrate his head that same day.",
      "links": "<a href='/AIV/3/5/6'>Leviticus 5:6</a>; <a href='/AIV/3/4/26'>Leviticus 4:26</a>",
      "comment": "The pairing of sin and burnt offerings highlight atonement and reconciliation, themes central to the sacrificial system, later fulfilled in Christ’s ultimate sacrifice (cf. Hebrews 9:13-14)."
    },
    {
      "pk": 4006012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 12,
      "text": "He shall rededicate to the LORD the days of his vow, and must bring a year-old male lamb as a guilt offering. The former days will not be counted, because his Nazirite was defiled.",
      "links": "<a href='/AIV/3/5/15'>Leviticus 5:15</a>",
      "comment": "Purity is necessary for a valid vow. Past days lost through defilement must be restored, highlighting the importance of perseverance and commitment in spiritual devotion."
    },
    {
      "pk": 4006013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 13,
      "text": "This is the law for the Nazirite when the time of his separation is completed: he shall be brought to the entrance of the Tent of Meeting.",
      "links": "<a href='/AIV/9/1/22'>1 Samuel 1:22</a>",
      "comment": "The Nazirite returns to public worship at the conclusion of their vow, a reminder of the communal aspect of faith and the need for accountability through priests."
    },
    {
      "pk": 4006014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 14,
      "text": "And he shall bring his offerings to the LORD: a male lamb a year old without blemish as a burnt offering, a ewe lamb a year old without blemish as a sin offering, and a ram without blemish as a peace offering;",
      "links": "<a href='/AIV/3/1/10'>Leviticus 1:10</a>; <a href='/AIV/3/3/6'>Leviticus 3:6</a>",
      "comment": "Triple offerings—burnt, sin, and peace—represent total dedication, forgiveness, and restored fellowship. This sacrificial variety evokes the fullness of reconciliation found in Christ."
    },
    {
      "pk": 4006015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 15,
      "text": "and a basket of unleavened bread: cakes of fine flour mixed with oil and unleavened wafers spread with oil, together with their grain offering and their drink offerings.",
      "links": "<a href='/AIV/3/2/4'>Leviticus 2:4</a>",
      "comment": "Unleavened bread and oil link back to Passover and the recurring themes of purity and the Spirit."
    },
    {
      "pk": 4006016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 16,
      "text": "The priest shall present them before the LORD and offer his sin offering and his burnt offering.",
      "links": "<a href='/AIV/3/8/14'>Leviticus 8:14</a>",
      "comment": "The priest’s role in presenting and offering sacrifices highlights the necessity for priestly mediation, later fulfilled supremely by Christ, the true High Priest (cf. Hebrews 4:14)."
    },
    {
      "pk": 4006017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 17,
      "text": "He shall offer the ram as a sacrifice of peace to the LORD, with the basket of unleavened bread. The priest shall offer also the grain offering and the drink offering.",
      "links": "<a href='/AIV/3/7/13'>Leviticus 7:13</a>",
      "comment": "Peace offerings signify restored relationship and communion, a foreshadowing of spiritual peace given through Christ."
    },
    {
      "pk": 4006018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 18,
      "text": "And the Nazirite shall shave the dedicated hair at the entrance of the Tent of Meeting, and take the hair and put it on the fire under the peace offering sacrifice.",
      "links": "<a href='/AIV/7/16/19'>Judges 16:19</a>",
      "comment": "Burning the hair with the offering symbolizes the complete offering of oneself, body and soul, to God—a pattern for total spiritual self-surrender."
    },
    {
      "pk": 4006019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 19,
      "text": "Then the priest shall take the boiled shoulder of the ram and one unleavened cake from the basket and one unleavened wafer, and put them into the hands of the Nazirite after he has shaved his dedicated hair.",
      "links": "<a href='/AIV/3/8/26'>Leviticus 8:26</a>",
      "comment": "The laying of sacrificial food into the hands identifies the Nazirite personally with his offering, showing union between person and sacrifice."
    },
    {
      "pk": 4006020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 20,
      "text": "And the priest shall wave them as a wave offering before the LORD; they are holy for the priest, together with the breast and the thigh. After that the Nazirite may drink wine.",
      "links": "<a href='/AIV/3/10/15'>Leviticus 10:15</a>",
      "comment": "Wave offerings are a gesture of dedication, and the restoration of wine marks the conclusion of consecration—echoing later Christian practices of ritual fasting followed by blessed sacramental feasting."
    },
    {
      "pk": 4006021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 21,
      "text": "This is the law of the Nazirite who vows an offering to the LORD for his separation, and in addition to whatever else his hand may afford. According to the vow which he takes, so he must do, in addition to the law of his separation.",
      "links": "<a href='/AIV/19/76/11'>Psalm 76:11</a>",
      "comment": "Personal offerings were not limited by the law; generosity and devotion could go beyond the minimum, signifying a spirituality that allows for extravagant personal devotion."
    },
    {
      "pk": 4006022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 22,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/3/9/1'>Leviticus 9:1</a>",
      "comment": "A new divine address, marking the transition to the priestly blessing, a significant liturgical moment."
    },
    {
      "pk": 4006023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 23,
      "text": "Speak to Aaron and his sons, saying, ‘In this way you shall bless the Israelites. Say to them:",
      "links": "<a href='/AIV/3/9/22'>Leviticus 9:22</a>",
      "comment": "Aaron and his sons, the ordained priests, are commissioned as mediators of God’s blessing, an essential role echoed in Christian preaching and sacramental ministry."
    },
    {
      "pk": 4006024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 24,
      "text": "‘The LORD bless you and keep you;",
      "links": "<a href='/AIV/19/121/7'>Psalm 121:7</a>; <a href='/AIV/19/67/1'>Psalm 67:1</a>",
      "comment": "God’s blessing is protective and sustaining. This priestly formula is still used in Christian liturgy and prayer, highlighting continuity of tradition."
    },
    {
      "pk": 4006025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 25,
      "text": "the LORD make his face shine upon you and be gracious to you;",
      "links": "<a href='/AIV/19/31/16'>Psalm 31:16</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "To have God’s face shine upon one is a sign of favor and presence, spiritually fulfilled in Christ, the true Light and embodiment of grace."
    },
    {
      "pk": 4006026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 26,
      "text": "the LORD lift up his countenance upon you and give you peace.’",
      "links": "<a href='/AIV/19/4/6'>Psalm 4:6</a>; <a href='/AIV/23/9/6'>Isaiah 9:6</a>",
      "comment": "Peace here is 'shalom'—fullness of life in communion with God, ultimately brought through Christ’s own peace (John 14:27). The lifting up of God’s countenance refers to the fullness of blessing and favor."
    },
    {
      "pk": 4006027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 6,
      "verse": 27,
      "text": "So they shall put my name on the Israelites, and I will bless them.",
      "links": "<a href='/AIV/23/43/7'>Isaiah 43:7</a>; <a href='/AIV/40/28/19'>Matthew 28:19</a>",
      "comment": "Putting God’s name on the people signifies a special relationship, spiritual identity, and inheritance. In Christian practice, this is echoed in the invocation of the Trinitarian name at baptism, marking believers as God’s own people."
    }
  ],
  "translatedAt": "2025-12-24T01:31:40.430Z"
}