{
  "book": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 30,
  "verses": [
    {
      "pk": 3003001,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 1,
      "text": "Moses spoke to the heads of the tribes of the sons of Israel, saying, 'This is the word that the Lord has commanded:'",
      "links": "<a href='/AIV/2/12/21'>Ex. 12:21</a>; <a href='/AIV/3/4/15'>Lev. 4:15</a>",
      "comment": "‘Heads of the tribes’ refers to the leaders among Israel; see also Num. 1:4 for context."
    },
    {
      "pk": 3003002,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 2,
      "text": "'If a man vows a vow to the Lord, or swears an oath to bind himself with a binding obligation, he must not break his word. He must do everything he has spoken.'",
      "links": "<a href='/AIV/3/27/2'>Lev. 27:2</a>; <a href='/AIV/5/23/21'>Deut. 23:21–23</a>; <a href='/AIV/19/15/4'>Ps. 15:4</a>; <a href='/AIV/40/5/33-37'>Matt. 5:33–37</a>",
      "comment": "The words ‘binding obligation’ translate ‘issar’, a solemn kind of binding oath. See also Ecc. 5:4-5."
    },
    {
      "pk": 3003003,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 3,
      "text": "'If a woman vows a vow to the Lord and binds herself by a pledge, while still in her father’s house in her youth,'",
      "links": "<a href='/AIV/3/27/2'>Lev. 27:2</a>; <a href='/AIV/4/6/2'>Num. 6:2</a>",
      "comment": "'In her father’s house in her youth' refers to an unmarried young woman under her father's authority."
    },
    {
      "pk": 3003004,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 4,
      "text": "'and her father hears her vow and her pledge by which she has bound herself, but her father says nothing to her, then all her vows will stand, and every pledge by which she has bound herself will stand.'",
      "links": "<a href='/AIV/4/30/7'>Num. 30:7</a>; <a href='/AIV/4/30/11'>Num. 30:11</a>",
      "comment": "The father’s silence means he agrees, so the vow is valid."
    },
    {
      "pk": 3003005,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 5,
      "text": "'But if her father forbids her on the day he hears, none of her vows or pledges by which she has bound herself will stand. And the Lord will forgive her, because her father has forbidden her.'",
      "links": "<a href='/AIV/4/30/8'>Num. 30:8</a>",
      "comment": "'Forgive her' indicates she is not guilty, since the father’s authority supersedes her vow."
    },
    {
      "pk": 3003006,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 6,
      "text": "'If she marries while her vows or rash promises by which she has bound herself are still upon her,'",
      "links": "<a href='/AIV/4/30/10'>Num. 30:10</a>",
      "comment": "‘Rash promises’ translates a Hebrew word for unconsidered or impulsive oaths."
    },
    {
      "pk": 3003007,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 7,
      "text": "'and her husband hears about it and says nothing to her on the day he hears, then her vows will stand and her pledges by which she has bound herself will stand.'",
      "links": "<a href='/AIV/4/30/4'>Num. 30:4</a>; <a href='/AIV/4/30/14'>Num. 30:14</a>",
      "comment": "Similar principle as with the father: silence means consent."
    },
    {
      "pk": 3003008,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 8,
      "text": "'But if, on the day her husband hears, he forbids her, then he makes void her vow that was on her and the rash agreement by which she bound herself, and the Lord will forgive her.'",
      "links": "<a href='/AIV/4/30/5'>Num. 30:5</a>",
      "comment": "The husband’s authority can also annul her vow if acted upon immediately."
    },
    {
      "pk": 3003009,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 9,
      "text": "'But any vow of a widow or of a divorced woman, anything by which she has bound herself, will stand against her.'",
      "links": "<a href='/AIV/3/5/29'>Lev. 5:4–5</a>",
      "comment": "Without father or husband, she is responsible for her own vows."
    },
    {
      "pk": 3003010,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 10,
      "text": "'If a woman in her husband’s house vows a vow or binds herself by a pledge with an oath,'",
      "links": "<a href='/AIV/4/30/6'>Num. 30:6</a>",
      "comment": "Now considering a married woman making a vow after marriage."
    },
    {
      "pk": 3003011,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 11,
      "text": "'and her husband hears of it and says nothing to her and does not forbid her, then all her vows will stand, and every pledge by which she has bound herself will stand.'",
      "links": "<a href='/AIV/4/30/7'>Num. 30:7</a>; <a href='/AIV/4/30/14'>Num. 30:14</a>",
      "comment": "Repeats the principle: silence means the vow stands."
    },
    {
      "pk": 3003012,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 12,
      "text": "'But if her husband makes them void on the day he hears them, then whatever comes out of her lips concerning her vows or pledges will not stand. Her husband has made them void, and the Lord will forgive her.'",
      "links": "<a href='/AIV/4/30/8'>Num. 30:8</a>",
      "comment": "Annulment must be immediate—on the day he hears."
    },
    {
      "pk": 3003013,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 13,
      "text": "'Every vow and every binding oath to humble herself, her husband may establish or her husband may make void.'",
      "links": "<a href='/AIV/4/30/7'>Num. 30:7</a>",
      "comment": "‘To humble herself’—refers to afflicting oneself, often with fasting or sacrifice (see Lev. 16:29)."
    },
    {
      "pk": 3003014,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 14,
      "text": "'But if her husband says nothing to her from day to day, then he establishes all her vows or all her pledges that are upon her; he has established them because he said nothing to her on the day he heard them.'",
      "links": "<a href='/AIV/4/30/7'>Num. 30:7</a>",
      "comment": "Ongoing silence is treated as agreement."
    },
    {
      "pk": 3003015,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 15,
      "text": "'But if he makes them null and void after he has heard them, then he will bear her iniquity.'",
      "links": "<a href='/AIV/3/5/1'>Lev. 5:1</a>",
      "comment": "If he annuls later, the responsibility for breaking the vow falls on the husband."
    },
    {
      "pk": 3003016,
      "translation": "AIV",
      "book": 4,
      "chapter": 30,
      "verse": 16,
      "text": "These are the statutes that the Lord commanded Moses, concerning a man and his wife and a father and his daughter, while she is in her youth in her father’s house.",
      "links": "<a href='/AIV/4/30/1'>Num. 30:1</a>",
      "comment": "Summary statement of the statutes given in this passage."
    }
  ],
  "translatedAt": "2025-12-20T09:38:36.873Z"
}