{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 13,
  "verses": [
    {
      "pk": 4013001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/2/3/4'>Ex. 3:4</a>",
      "comment": "God initiates the mission with Moses, showing divine initiative and authority. The pattern of God speaking to Moses is a consistent theme (see Ex. 3:4) that foreshadows the role of authoritative mediators in guiding God's people."
    },
    {
      "pk": 4013002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 2,
      "text": "\"Send men to spy out the land of Canaan, which I am giving to the children of Israel. From each tribe of their fathers you shall send a man, everyone a leader among them.\"",
      "links": "<a href='/AIV/4/34/1-2'>Num. 34:1-2</a>; <a href='/AIV/5/1/22-25'>Deut. 1:22-25</a>",
      "comment": "Notice God emphasizes that He is giving the land, showing the gift and promise depend on His will, not merely human effort. Leaders from each tribe are chosen, indicating the necessity of united and structured leadership among God's people."
    },
    {
      "pk": 4013003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 3,
      "text": "So Moses sent them from the Wilderness of Paran, according to the command of the LORD; all of them men who were heads of the children of Israel.",
      "links": "<a href='/AIV/4/10/12'>Num. 10:12</a>; <a href='/AIV/4/12/16'>Num. 12:16</a>",
      "comment": "The sending is 'according to the command of the LORD,' highlighting that the mission's legitimacy comes from divine authority, not from human decision alone. Spiritual missions must have legitimate authority."
    },
    {
      "pk": 4013004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 4,
      "text": "These were their names: from the tribe of Reuben, Shammua the son of Zaccur;",
      "links": "<a href='/AIV/4/34/17-29'>Num. 34:17-29</a>",
      "comment": "The naming of each representative underscores the importance of order and structure within the people of God."
    },
    {
      "pk": 4013005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 5,
      "text": "from the tribe of Simeon, Shaphat the son of Hori;",
      "links": "<a href='/AIV/4/34/20'>Num. 34:20</a>",
      "comment": "Each tribe’s identity is recognized and valued by listing their leaders individual by name."
    },
    {
      "pk": 4013006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 6,
      "text": "from the tribe of Judah, Caleb the son of Jephunneh;",
      "links": "<a href='/AIV/6/14/6'>Josh. 14:6</a>",
      "comment": "Caleb is later commended for his faith and loyalty, setting a model for obedience to God's promise. See his perseverance in Joshua 14:6."
    },
    {
      "pk": 4013007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 7,
      "text": "from the tribe of Issachar, Igal the son of Joseph;",
      "links": "<a href='/AIV/4/34/26'>Num. 34:26</a>",
      "comment": "Issachar’s inclusion highlights each tribe’s participation in the mission, symbolizing unity and the necessity of collective action."
    },
    {
      "pk": 4013008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 8,
      "text": "from the tribe of Ephraim, Hoshea the son of Nun;",
      "links": "<a href='/AIV/6/1/1'>Josh. 1:1</a>",
      "comment": "Hoshea (later called Joshua) is a key Christological figure. His name, meaning 'The LORD saves,' points forward to Jesus (whose Hebrew name Yeshua is equivalent)."
    },
    {
      "pk": 4013009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 9,
      "text": "from the tribe of Benjamin, Palti the son of Raphu;",
      "links": "<a href='/AIV/4/34/21'>Num. 34:21</a>",
      "comment": "Each tribe, even the smaller ones, is represented equally before God."
    },
    {
      "pk": 4013010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 10,
      "text": "from the tribe of Zebulun, Gaddiel the son of Sodi;",
      "links": "<a href='/AIV/4/34/25'>Num. 34:25</a>",
      "comment": "Zebulun’s representative participates in the collective mission, representing the unity demanded among the people."
    },
    {
      "pk": 4013011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 11,
      "text": "from the tribe of Joseph, that is, from the tribe of Manasseh, Gaddi the son of Susi;",
      "links": "<a href='/AIV/4/34/23'>Num. 34:23</a>",
      "comment": "The distinction between Joseph’s two tribes (Ephraim and Manasseh) reflects how God’s promises are distributed among His people in ordered succession."
    },
    {
      "pk": 4013012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 12,
      "text": "from the tribe of Dan, Ammiel the son of Gemalli;",
      "links": "<a href='/AIV/4/34/22'>Num. 34:22</a>",
      "comment": "Dan’s participation illustrates the totality of the community being represented."
    },
    {
      "pk": 4013013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 13,
      "text": "from the tribe of Asher, Sethur the son of Michael;",
      "links": "<a href='/AIV/4/34/27'>Num. 34:27</a>",
      "comment": "Asher is included, highlighting full participation in the mission."
    },
    {
      "pk": 4013014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 14,
      "text": "from the tribe of Naphtali, Nahbi the son of Vophsi;",
      "links": "<a href='/AIV/4/34/28'>Num. 34:28</a>",
      "comment": "Even the less prominent tribes share responsibility in God’s plan, illustrating the importance of each member in the community."
    },
    {
      "pk": 4013015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 15,
      "text": "from the tribe of Gad, Geuel the son of Machi.",
      "links": "<a href='/AIV/4/34/24'>Num. 34:24</a>",
      "comment": "The list confirms the completeness with which God calls His people to act, reflecting the way God's people are called together by name."
    },
    {
      "pk": 4013016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 16,
      "text": "These are the names of the men whom Moses sent to spy out the land. And Moses called Hoshea the son of Nun, Joshua.",
      "links": "<a href='/AIV/6/2/1'>Josh. 2:1</a>; <a href='/AIV/5/32/44'>Deut. 32:44</a>",
      "comment": "Moses gives Hoshea the name Joshua, or 'The LORD saves,' prefiguring the role of anointed deliverers and the naming power of God’s authoritative representatives. Joshua is a clear type of Christ, both leading God's people into the Promised Land."
    },
    {
      "pk": 4013017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 17,
      "text": "Moses sent them to spy out the land of Canaan and said to them, 'Go up into the Negev and go up into the hill country,",
      "links": "<a href='/AIV/4/21/1'>Num. 21:1</a>; <a href='/AIV/6/2/1'>Josh. 2:1</a>",
      "comment": "Moses gives detailed instructions, reflecting close oversight and ordered mission—obedience to rightful authority is a repeated biblical theme."
    },
    {
      "pk": 4013018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 18,
      "text": "and see what the land is, and whether the people who dwell in it are strong or weak, whether they are few or many,",
      "links": "<a href='/AIV/5/1/24'>Deut. 1:24</a>",
      "comment": "They are to evaluate both the land and its inhabitants. The report is sought from authoritative witnesses sent by Moses, highlighting the importance of valid testimony."
    },
    {
      "pk": 4013019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 19,
      "text": "and whether the land that they dwell in is good or bad, and whether the cities they dwell in are camps or strongholds,",
      "links": "<a href='/AIV/4/32/9'>Num. 32:9</a>",
      "comment": "The mission includes discerning spiritual as well as practical realities—both the physical state and the security (or weakness) of the cities."
    },
    {
      "pk": 4013020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 20,
      "text": "and whether the land is rich or poor, whether there are trees in it or not. Be courageous, and bring back some of the fruit of the land.\" Now it was the time of the first ripe grapes.",
      "links": "<a href='/AIV/4/13/23'>Num. 13:23</a>",
      "comment": "Moses encourages courage and the bringing of fruit as tangible evidence of the land’s abundance—a key sign of God’s blessing and promise. Spiritual courage is necessary for obedience."
    },
    {
      "pk": 4013021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 21,
      "text": "So they went up and spied out the land from the Wilderness of Zin as far as Rehob, near Lebo-hamath.",
      "links": "<a href='/AIV/4/34/3-9'>Num. 34:3-9</a>",
      "comment": "Their route gives geographical precision to the promised territory, marking the physical boundaries of God's promise."
    },
    {
      "pk": 4013022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 22,
      "text": "They went up into the Negev and came to Hebron; Ahiman, Sheshai, and Talmai, the descendants of Anak, were there. (Now Hebron was built seven years before Zoan in Egypt.)",
      "links": "<a href='/AIV/6/14/15'>Josh. 14:15</a>; <a href='/AIV/1/23/2'>Gen. 23:2</a>",
      "comment": "Reference to the 'descendants of Anak' emphasizes the formidable obstacles to be faced. Hebron’s antiquity links it to Abraham (Gen. 23:2), showing the deep historical connection between promise and fulfillment."
    },
    {
      "pk": 4013023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 23,
      "text": "They came to the Valley of Eshcol, and cut down from there a branch with a single cluster of grapes. They carried it on a pole between two of them; they also brought some pomegranates and figs.",
      "links": "<a href='/AIV/4/13/24'>Num. 13:24</a>",
      "comment": "The abundance of the fruit is a sign of God’s generosity and faithfulness. The pole bearing the cluster foreshadows miraculous abundance and is reminiscent of the spiritual blessings connected with the Promised Land."
    },
    {
      "pk": 4013024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 24,
      "text": "That place was called the Valley of Eshcol, because of the cluster that the people of Israel cut down from there.",
      "links": "<a href='/AIV/4/32/9'>Num. 32:9</a>",
      "comment": "Naming the valley based on God’s provision demonstrates commemorating and remembering God's works in salvation history."
    },
    {
      "pk": 4013025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 25,
      "text": "At the end of forty days they returned from spying out the land.",
      "links": "<a href='/AIV/4/14/34'>Num. 14:34</a>; <a href='/AIV/40/4/2'>Matt. 4:2</a>",
      "comment": "The forty days prefigure times of testing and preparation in Scripture (see also Jesus' forty days in the desert, Matt. 4:2)."
    },
    {
      "pk": 4013026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 26,
      "text": "They came back to Moses and Aaron and to all the congregation of the children of Israel in the wilderness of Paran, at Kadesh. They brought them word, and showed them the fruit of the land.",
      "links": "<a href='/AIV/4/20/1'>Num. 20:1</a>",
      "comment": "Testimony is given in the presence of recognized leaders and the whole assembly, an image of accountability and the collective discernment of the community."
    },
    {
      "pk": 4013027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 27,
      "text": "And they told him, \"We came to the land to which you sent us. It truly flows with milk and honey, and this is its fruit.",
      "links": "<a href='/AIV/2/3/8'>Ex. 3:8</a>; <a href='/AIV/5/26/9'>Deut. 26:9</a>",
      "comment": "The fulfillment of God’s promise is visible: abundance in the Promised Land, a sign of God’s overflowing grace and provision."
    },
    {
      "pk": 4013028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 28,
      "text": "However, the people who live in the land are strong, and the cities are fortified and very large. Moreover, we saw the descendants of Anak there.",
      "links": "<a href='/AIV/4/13/22'>Num. 13:22</a>",
      "comment": "A realistic but fearful report. Human obstacles often cause wavering even when God's grace is evident—faith must triumph over fear."
    },
    {
      "pk": 4013029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 29,
      "text": "The Amalekites dwell in the land of the Negev. The Hittites, the Jebusites, and the Amorites dwell in the hill country; and the Canaanites dwell by the sea and along the Jordan.\"",
      "links": "<a href='/AIV/1/15/18-21'>Gen. 15:18-21</a>",
      "comment": "Listing the peoples fulfills prophecy (Gen. 15:18–21) and reaffirms the challenge—the faith of the people will be tested as they seek to possess the promise."
    },
    {
      "pk": 4013030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 30,
      "text": "But Caleb quieted the people before Moses and said, \"Let us go up at once and occupy it, for we are well able to overcome it.\"",
      "links": "<a href='/AIV/6/14/6-9'>Josh. 14:6-9</a>",
      "comment": "Caleb’s faith-filled response stands as a model for bold trust in God—this example of active obedience in response to God’s Word prefigures Christian courage and confidence required by genuine faith."
    },
    {
      "pk": 4013031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 31,
      "text": "But the men who had gone up with him said, \"We are not able to go up against the people, for they are stronger than we are.\"",
      "links": "<a href='/AIV/4/14/1-4'>Num. 14:1-4</a>",
      "comment": "Unbelief and fear can spread in the community, influencing and undermining faith. This moment contrasts with Caleb’s trust."
    },
    {
      "pk": 4013032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 32,
      "text": "So they brought to the people of Israel a bad report of the land that they had spied out, saying, \"The land, through which we have gone to spy it out, is a land that devours its inhabitants, and all the people whom we saw in it are of great height.",
      "links": "<a href='/AIV/4/32/9'>Num. 32:9</a>",
      "comment": "The negative report demonstrates how fear and lack of faith can distort the perception of God’s promises. Notice the seriousness with which false or discouraging reports are treated in community life."
    },
    {
      "pk": 4013033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 13,
      "verse": 33,
      "text": "And there we saw the Nephilim (the sons of Anak, who come from the Nephilim), and we seemed to ourselves like grasshoppers, and so we seemed to them.\"",
      "links": "<a href='/AIV/1/6/4'>Gen. 6:4</a>; <a href='/AIV/4/14/36-37'>Num. 14:36-37</a>",
      "comment": "Invoking the Nephilim (see Gen. 6:4) shows a sense of overwhelming fear. Reliance on God’s appointed leaders and the community is meant to guard against such despair. The tension between the gift of God’s promise and the hesitancy of the people anticipates the struggle between doubt and faith both individually and corporately. The land is to be entered not by mere human effort, but by steadfast obedience and faith—paralleling the Christian journey to spiritual fulfillment by participating in the promises of God through the guidance of the one visible people of God."
    }
  ],
  "translatedAt": "2025-12-24T01:36:38.447Z"
}