{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 21,
  "verses": [
    {
      "pk": 4021001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 1,
      "text": "When the Canaanite king of Arad, who lived in the Negev, heard that Israel was coming by the way of Atharim, he fought against Israel and took some of them captive.",
      "links": "<a href='/AIV/06/12/14'>Josh. 12:14</a>",
      "comment": "The Negev is the southern desert. The Israelites faced opposition as they approached the Promised Land. The spiritual battle for God's promise is evident."
    },
    {
      "pk": 4021002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 2,
      "text": "Israel made a vow to the Lord and said, 'If You will indeed give this people into my hand, then I will devote their cities to destruction.'",
      "links": "<a href='/AIV/10/5/21'>2 Sam. 5:21</a>; <a href='/AIV/03/27/28-29'>Lev. 27:28-29</a>",
      "comment": "The vow reflects consecration of victory to God. The act of devoting things to destruction shows complete obedience and surrender to God's will, a principle foundational in establishing unity in worship."
    },
    {
      "pk": 4021003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 3,
      "text": "The Lord listened to the voice of Israel and gave up the Canaanites. They devoted them and their cities to destruction. So the place was called Hormah.",
      "links": "<a href='/AIV/04/14/45'>Num. 14:45</a>; <a href='/AIV/07/1/17'>Judg. 1:17</a>",
      "comment": "Hormah means 'destruction.' God's faithfulness in answering prayer based on a faith-filled vow is demonstrated. The name change solidifies the event, a recurring theme in Israel's history."
    },
    {
      "pk": 4021004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 4,
      "text": "They traveled from Mount Hor by the way to the Red Sea, to go around the land of Edom, but the people grew impatient along the way.",
      "links": "<a href='/AIV/04/20/22'>Num. 20:22</a>; <a href='/AIV/05/2/1'>Deut. 2:1</a>",
      "comment": "The route shows historical accuracy. Their impatience points to their reliance on divine providence and human weakness in the journey."
    },
    {
      "pk": 4021005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 5,
      "text": "The people spoke against God and against Moses, 'Why have you brought us up out of Egypt to die in the wilderness? There is no bread and no water, and we detest this miserable food!'",
      "links": "<a href='/AIV/04/11/6'>Num. 11:6</a>; <a href='/AIV/04/14/2'>Num. 14:2</a>",
      "comment": "The recurring theme of ingratitude and rebellion against God's provision. Spiritually, this foreshadows the need for a new and better bread from heaven."
    },
    {
      "pk": 4021006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 6,
      "text": "Then the Lord sent fiery serpents among the people, and they bit the people, so that many Israelites died.",
      "links": "<a href='/AIV/05/8/15'>Deut. 8:15</a>; <a href='/AIV/23/14/29'>Isa. 14:29</a>",
      "comment": "Fiery serpents: likely venomous snakes. The event underlines both judgment for sin and the need for divine intervention."
    },
    {
      "pk": 4021007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 7,
      "text": "The people came to Moses and said, 'We have sinned, for we have spoken against the Lord and against you. Pray to the Lord, that He take away the serpents from us.' So Moses prayed for the people.",
      "links": "<a href='/AIV/02/8/8'>Ex. 8:8</a>; <a href='/AIV/01/20/17'>Gen. 20:17</a>",
      "comment": "Confession of sin precedes healing. Moses' role as intercessor foreshadows the need for a human mediator and points ahead to the ultimate Intercessor."
    },
    {
      "pk": 4021008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 8,
      "text": "The Lord said to Moses, 'Make a fiery serpent and set it on a pole, and everyone who is bitten, when he looks at it, shall live.'",
      "links": "<a href='/AIV/43/3/14-15'>John 3:14-15</a>; <a href='/AIV/12/18/4'>2 Kgs. 18:4</a>",
      "comment": "The serpent on a pole prefigures the cross of Christ (John 3:14). Healing comes through obedient faith, looking upon the sign God provides."
    },
    {
      "pk": 4021009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 9,
      "text": "So Moses made a bronze serpent and put it on a pole. Whenever a serpent bit anyone, if he looked at the bronze serpent, he lived.",
      "links": "<a href='/AIV/43/3/14-15'>John 3:14-15</a>",
      "comment": "Bronze often symbolizes judgment. The populace is healed not by magic, but by faith; this foreshadows sacramental means of grace—physical signs conveying spiritual realities."
    },
    {
      "pk": 4021010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 10,
      "text": "The people of Israel traveled on and camped in Oboth.",
      "links": "<a href='/AIV/04/33/43'>Num. 33:43</a>",
      "comment": "A short transition denoting the progress of Israel's journey. Oboth is referenced also in the wilderness itinerary."
    },
    {
      "pk": 4021011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 11,
      "text": "They set out from Oboth and camped at Iye-abarim, in the wilderness beyond Moab, toward the sunrise.",
      "links": "<a href='/AIV/04/33/44'>Num. 33:44</a>",
      "comment": "Iye-abarim means 'ruins of Abarim.' The geographical mention shows historical reliability."
    },
    {
      "pk": 4021012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 12,
      "text": "From there they set out and camped in the valley of Zered.",
      "links": "<a href='/AIV/05/2/13'>Deut. 2:13</a>",
      "comment": "The Zered valley is another key stopping point in Israel's journey."
    },
    {
      "pk": 4021013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 13,
      "text": "From there they set out and camped on the other side of the Arnon, which is in the wilderness that extends from the territory of the Amorites. For the Arnon is the border of Moab, between Moab and the Amorites.",
      "links": "<a href='/AIV/05/2/24'>Deut. 2:24</a>",
      "comment": "This geographical border detail is foundational for understanding later Israelite–Amorite relationships."
    },
    {
      "pk": 4021014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 14,
      "text": "Therefore it is said in the Book of the Wars of the Lord, 'Waheb in Suphah and the valleys of the Arnon,",
      "links": "",
      "comment": "The 'Book of the Wars of the Lord' is an ancient source no longer extant. Its citation here confirms the record of Israel's journey."
    },
    {
      "pk": 4021015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 15,
      "text": "and the slope of the valleys that stretches to the seat of Ar, and leans to the border of Moab.'",
      "links": "",
      "comment": "These poetic lines further describe the region, adding to Israel’s corporate memory of God’s victories."
    },
    {
      "pk": 4021016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 16,
      "text": "From there, they went to Beer; that is the well where the Lord said to Moses, 'Gather the people together, and I will give them water.'",
      "links": "<a href='/AIV/02/17/6'>Ex. 17:6</a>",
      "comment": "Beer means 'well.' God’s promise to provide water typifies the spiritual refreshment God offers His people, prefiguring greater blessings yet to come."
    },
    {
      "pk": 4021017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 17,
      "text": "Then Israel sang this song: 'Spring up, O well! Sing to it!'",
      "links": "<a href='/AIV/19/105/2'>Ps. 105:2</a>",
      "comment": "A song of praise for God’s provision. Music and song are integral to worship and praise in Israel's experience."
    },
    {
      "pk": 4021018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 18,
      "text": "The well that the leaders dug, that the nobles of the people hollowed out with the scepter and their staffs.' From the wilderness they went on to Mattanah,",
      "links": "",
      "comment": "Emphasizes the unity of leaders and people in receiving God’s blessing. Leadership and community acting together is a repeated pattern."
    },
    {
      "pk": 4021019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 19,
      "text": "and from Mattanah to Nahaliel, and from Nahaliel to Bamoth,",
      "links": "",
      "comment": "Travel log—maintaining careful record of God’s guidance."
    },
    {
      "pk": 4021020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 20,
      "text": "and from Bamoth to the valley that is in the territory of Moab, by the top of Pisgah, which looks down on the desert.",
      "links": "<a href='/AIV/05/3/27'>Deut. 3:27</a>",
      "comment": "Pisgah is the peak where Moses would see the Promised Land. The mountain-top perspective highlights God’s guidance."
    },
    {
      "pk": 4021021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 21,
      "text": "Israel sent messengers to Sihon king of the Amorites, saying,",
      "links": "<a href='/AIV/05/2/26'>Deut. 2:26</a>",
      "comment": "Israel first seeks peaceful passage, demonstrating restraint before resorting to war."
    },
    {
      "pk": 4021022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 22,
      "text": "'Let us pass through your land. We will not turn aside into field or vineyard; we will not drink water from a well. We will go by the King’s Highway until we have passed through your territory.'",
      "links": "<a href='/AIV/04/20/17'>Num. 20:17</a>",
      "comment": "The King’s Highway was a major trade route. Israel respects private property, demonstrating a principle of justice."
    },
    {
      "pk": 4021023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 23,
      "text": "But Sihon would not allow Israel to pass through his territory. Instead, Sihon gathered all his people and went out against Israel in the wilderness, and came to Jahaz and fought against Israel.",
      "links": "<a href='/AIV/05/2/30'>Deut. 2:30</a>",
      "comment": "Sihon’s rejection initiates conflict. Throughout Scripture, God uses human resistance to fulfill His promises."
    },
    {
      "pk": 4021024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 24,
      "text": "Israel struck him with the edge of the sword, and took possession of his land from the Arnon to the Jabbok, as far as the Ammonites, because the border of the Ammonites was fortified.",
      "links": "<a href='/AIV/07/11/13'>Judg. 11:13</a>",
      "comment": "The full conquest is a sign of God's blessing and the gradual realization of His promise to Abraham."
    },
    {
      "pk": 4021025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 25,
      "text": "Israel took all these cities, and Israel settled in all the cities of the Amorites, in Heshbon and in all its villages.",
      "links": "<a href='/AIV/06/13/21-22'>Josh. 13:21-22</a>",
      "comment": "The conquest and settlement anticipate Israel’s eventual inheritance of the whole land. The unity and continuity of the people is stressed."
    },
    {
      "pk": 4021026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 26,
      "text": "For Heshbon was the city of Sihon the king of the Amorites, who had fought against the former king of Moab and taken all his land out of his hand as far as the Arnon.",
      "links": "<a href='/AIV/24/48/45'>Jer. 48:45</a>",
      "comment": "Historical note showing how shifting powers in Canaan set the stage for Israel’s possession of the land."
    },
    {
      "pk": 4021027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 27,
      "text": "Therefore the poets say: 'Come to Heshbon; let it be built, the city of Sihon established.'",
      "links": "",
      "comment": "A national song commemorates Sihon’s rule and Israel's victory—poetry is used to memorialize God’s work."
    },
    {
      "pk": 4021028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 28,
      "text": "'Fire went out from Heshbon, flame from the city of Sihon. It devoured Ar of Moab, the lords of the heights of the Arnon.'",
      "links": "",
      "comment": "Metaphorical language (‘fire’) for military conquest, a common poetic device pointing to God’s sovereign direction of history."
    },
    {
      "pk": 4021029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 29,
      "text": "Woe to you, O Moab! You are undone, O people of Chemosh! He has made his sons fugitives, and his daughters captives, to an Amorite king, Sihon.",
      "links": "<a href='/AIV/07/11/24'>Judg. 11:24</a>",
      "comment": "A mocking lament over Moab’s defeat and Chemosh—Moab’s god—illustrates the futility of idols compared to the Lord’s power."
    },
    {
      "pk": 4021030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 30,
      "text": "So we overthrew them; Heshbon as far as Dibon perished, and we laid waste as far as Nophah, fire spreading as far as Medeba.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "Corporate identity—'we overthrew'—stresses Israel’s unity in their divine mission."
    },
    {
      "pk": 4021031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 31,
      "text": "Thus Israel lived in the land of the Amorites.",
      "links": "<a href='/AIV/04/32/33'>Num. 32:33</a>",
      "comment": "Settlement fulfills God's earlier assurance that His people would possess the land promised to their ancestors."
    },
    {
      "pk": 4021032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 32,
      "text": "Moses sent spies to Jazer, and they captured its villages and drove out the Amorites who were there.",
      "links": "<a href='/AIV/05/3/14'>Deut. 3:14</a>",
      "comment": "Under Moses’ guidance, new regions are brought under Israelite control, paralleling the apostolic mission to spread righteousness and the true faith."
    },
    {
      "pk": 4021033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 33,
      "text": "Then they turned and went up by the road to Bashan. Og king of Bashan came out against them, he and all his people, to do battle at Edrei.",
      "links": "<a href='/AIV/05/3/1'>Deut. 3:1</a>",
      "comment": "The battle against Og, a mighty king, foreshadows ongoing spiritual warfare and God's power to deliver His people."
    },
    {
      "pk": 4021034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 34,
      "text": "The Lord said to Moses, 'Do not fear him, for I have given him into your hand, and all his people, and his land. Do to him as you did to Sihon king of the Amorites, who lived at Heshbon.'",
      "links": "<a href='/AIV/05/3/2'>Deut. 3:2</a>",
      "comment": "God’s assurance eliminates fear. Victory is not by might alone, but by God’s promise and His chosen leader’s obedience—reflecting authority appointed from above."
    },
    {
      "pk": 4021035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 21,
      "verse": 35,
      "text": "So they struck him, and his sons and all his people, until there was no survivor left. And they possessed his land.",
      "links": "<a href='/AIV/05/3/3'>Deut. 3:3</a>",
      "comment": "Total victory underscores the completeness of God’s deliverance for His people, a foreshadowing of Christ's ultimate victory."
    }
  ],
  "translatedAt": "2025-12-24T01:43:07.873Z"
}