{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 14,
  "verses": [
    {
      "pk": 4014001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 1,
      "text": "Then all the congregation lifted up their voices and cried aloud, and the people wept that night.",
      "links": "<a href='/AIV/02/16/2'>Ex. 16:2</a>; <a href='/AIV/04/11/1'>Num. 11:1</a>",
      "comment": "The intensity of the people’s response echoes earlier instances in Exodus and Numbers where the Israelites complain in the wilderness. This sets the stage for a moment of crisis, revealing the human tendency toward fear and disbelief even after experiencing God's mighty deeds."
    },
    {
      "pk": 4014002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 2,
      "text": "All the children of Israel murmured against Moses and Aaron; the whole congregation said to them, 'Would that we had died in the land of Egypt! Or would that we had died in this wilderness!'",
      "links": "<a href='/AIV/02/16/3'>Ex. 16:3</a>; <a href='/AIV/04/20/3'>Num. 20:3</a>",
      "comment": "Israel’s longing for Egypt and despair recalls the recurrent motif of grumbling. Spiritually, it shows our struggle in trusting God’s plan, especially when it demands perseverance. Such murmuring echoes humanity’s tendency to long for the familiar even in bondage, instead of trusting divine providence."
    },
    {
      "pk": 4014003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 3,
      "text": "'Why is the LORD bringing us into this land, to fall by the sword? Our wives and our children will become plunder. Wouldn’t it be better for us to go back to Egypt?'",
      "links": "<a href='/AIV/02/14/11'>Ex. 14:11</a>; <a href='/AIV/05/1/27'>Deut. 1:27</a>",
      "comment": "The people’s fear and complaint show a lack of faith in God’s protective promise, despite the evidence of past deliverance. This attitude reflects a spiritual challenge: trusting in God even when circumstances seem threatening."
    },
    {
      "pk": 4014004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 4,
      "text": "And they said to one another, 'Let us appoint a leader and return to Egypt.'",
      "links": "<a href='/AIV/04/16/1'>Num. 16:1</a>; <a href='/AIV/02/4/13'>Ex. 4:13</a>",
      "comment": "The desire to replace Moses and reverse the Exodus represents rebellion against God’s chosen authority and His salvific plan. This is a subtle indicator of the importance of divinely appointed leadership, a principle that continues throughout both Testaments."
    },
    {
      "pk": 4014005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 5,
      "text": "Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.",
      "links": "<a href='/AIV/04/16/22'>Num. 16:22</a>; <a href='/AIV/06/7/6'>Josh. 7:6</a>",
      "comment": "Moses and Aaron respond with humble intercession. Prostration is used here as an act of reverence and prayer, signaling leadership’s role in mediation between God and His people."
    },
    {
      "pk": 4014006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 6,
      "text": "And Joshua son of Nun, and Caleb son of Jephunneh, who were among those who spied out the land, tore their clothes.",
      "links": "<a href='/AIV/01/37/29'>Gen. 37:29</a>; <a href='/AIV/09/13/31'>2 Kings 13:31</a>",
      "comment": "Tearing clothes is a sign of deep grief and protest. The two men show their righteous indignation at the people’s lack of faith, establishing them as models of steadfast allegiance to God’s promise."
    },
    {
      "pk": 4014007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 7,
      "text": "They spoke to all the congregation of the children of Israel, saying, 'The land which we passed through to spy it out is an exceedingly good land.'",
      "links": "<a href='/AIV/04/13/27'>Num. 13:27</a>; <a href='/AIV/05/8/7'>Deut. 8:7</a>",
      "comment": "Joshua and Caleb affirm the goodness of God’s gift, contrasting trust and faithfulness with the rest of the assembly’s fear."
    },
    {
      "pk": 4014008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 8,
      "text": "'If the LORD delights in us, He will bring us into this land and give it to us—a land flowing with milk and honey.'",
      "links": "<a href='/AIV/02/3/8'>Ex. 3:8</a>; <a href='/AIV/19/147/11'>Ps. 147:11</a>",
      "comment": "Divine favor is presented as the key to inheritance, not human strength. The promise of a land flowing with milk and honey foreshadows blessings poured upon those who trust in the Lord’s covenant."
    },
    {
      "pk": 4014009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 9,
      "text": "Only, do not rebel against the LORD. And do not fear the people of the land, for they are bread for us. Their protection has departed from them, and the LORD is with us. Do not fear them.",
      "links": "<a href='/AIV/06/2/9'>Josh. 2:9</a>; <a href='/AIV/23/8/10'>Isa. 8:10</a>",
      "comment": "Faith conquers fear. The assurance of divine presence echoes God’s promise to never abandon His people, a theme later fulfilled and expanded through Christ."
    },
    {
      "pk": 4014010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 10,
      "text": "But all the congregation said to stone them with stones. Then the glory of the LORD appeared in the tent of meeting to all the children of Israel.",
      "links": "<a href='/AIV/03/9/23'>Lev. 9:23</a>; <a href='/AIV/04/16/19'>Num. 16:19</a>",
      "comment": "Divine intervention interrupts the violence planned against God’s faithful. The glory appearing in the tent highlights the close connection between God’s dwelling and His actions, setting up later developments regarding God’s presence among His people."
    },
    {
      "pk": 4014011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 11,
      "text": "The LORD said to Moses, 'How long will this people despise Me? How long will they not believe in Me, despite all the signs that I have done among them?'",
      "links": "<a href='/AIV/02/16/28'>Ex. 16:28</a>; <a href='/AIV/40/12/39'>Matt. 12:39</a>",
      "comment": "God’s lament parallels Jesus’ later grief over unbelief (see Matt. 23:37). The signs performed by God should have induced faith—pointing forward to the greater signs brought by Christ."
    },
    {
      "pk": 4014012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 12,
      "text": "'I will strike them with pestilence and disinherit them; and I will make of you a nation greater and mightier than they.'",
      "links": "<a href='/AIV/01/6/7'>Gen. 6:7</a>; <a href='/AIV/02/32/10'>Ex. 32:10</a>",
      "comment": "God expresses righteous judgment, yet gives Moses the opportunity for intercession—a recurring biblical principle where a mediator’s prayer can move God’s mercy on behalf of the people."
    },
    {
      "pk": 4014013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 13,
      "text": "But Moses said to the LORD, 'Then the Egyptians will hear it! For by Your power You brought up this people from among them.'",
      "links": "<a href='/AIV/02/32/12'>Ex. 32:12</a>; <a href='/AIV/19/106/23'>Ps. 106:23</a>",
      "comment": "Moses mediates on behalf of the people, reminding God of His reputation and past deliverance. This intercessory role prefigures the greater mediator, Christ."
    },
    {
      "pk": 4014014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 14,
      "text": "'And they will tell the inhabitants of this land. They have heard that You, LORD, are in the midst of this people—for You, LORD, are seen face to face, and Your cloud stands over them, and You go before them in a pillar of cloud by day and a pillar of fire by night.'",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>; <a href='/AIV/02/33/9-11'>Ex. 33:9-11</a>",
      "comment": "Moses appeals to the witness of nations regarding God’s presence. The cloud and fire symbolize God’s guiding presence, which is a precursor to Christ as the true light and guide for His people (John 8:12)."
    },
    {
      "pk": 4014015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 15,
      "text": "'If You kill this people as one man, then the nations which have heard of Your fame will say,'",
      "links": "<a href='/AIV/26/36/20'>Ezek. 36:20</a>; <a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "Moses continues his intercession, motivated by concern for the honor of God among the nations—highlighting the universal scope of God’s promise."
    },
    {
      "pk": 4014016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 16,
      "text": "'Because the LORD was not able to bring this people into the land which He promised them by oath, therefore He killed them in the wilderness.'",
      "links": "<a href='/AIV/04/13/2'>Num. 13:2</a>; <a href='/AIV/05/9/28'>Deut. 9:28</a>",
      "comment": "Moses highlights the importance that God's faithfulness to His promises be recognized by all, prefiguring the reliability of Christ’s promises to the Church."
    },
    {
      "pk": 4014017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 17,
      "text": "'Now, please, let the power of my Lord be great, just as You have spoken, saying,'",
      "links": "<a href='/AIV/04/23/19'>Num. 23:19</a>; <a href='/AIV/19/145/8'>Ps. 145:8</a>",
      "comment": "Moses refers back to God’s own declaration of mercy and justice, showing the effectiveness of praying according to God's revealed nature."
    },
    {
      "pk": 4014018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 18,
      "text": "'The LORD is slow to anger and abounding in steadfast love, forgiving iniquity and transgression, but He will by no means clear the guilty, visiting the iniquity of the fathers upon the children to the third and fourth generation.'",
      "links": "<a href='/AIV/02/34/6-7'>Ex. 34:6-7</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "Here, God’s nature as merciful yet just is declared. This passage shapes the biblical understanding of mercy and justice which is to be fulfilled in Christ, who embodies both perfectly (John 1:17)."
    },
    {
      "pk": 4014019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 19,
      "text": "'Please pardon the iniquity of this people according to the greatness of Your steadfast love, just as You have forgiven this people from Egypt even until now.'",
      "links": "<a href='/AIV/19/106/43-45'>Ps. 106:43-45</a>; <a href='/AIV/23/43/25'>Isa. 43:25</a>",
      "comment": "Moses appeals directly for forgiveness, relying on God’s demonstrated mercy. Intercession remains central both in the Old and New Testaments, highlighted in the ministry of apostles and fulfilled perfectly in Christ’s priestly ministry."
    },
    {
      "pk": 4014020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 20,
      "text": "So the LORD said, 'I have pardoned according to your word.'",
      "links": "<a href='/AIV/19/99/8'>Ps. 99:8</a>; <a href='/AIV/19/106/44'>Ps. 106:44</a>",
      "comment": "Divine forgiveness comes in response to true intercession, a theme which will find its fulfillment in the New Covenant through Christ’s atonement."
    },
    {
      "pk": 4014021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 21,
      "text": "'But truly, as I live and as all the earth shall be filled with the glory of the LORD,'",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>; <a href='/AIV/23/6/3'>Isa. 6:3</a>",
      "comment": "God’s plan is universal—His glory will fill the earth, prefiguring the world-wide spread of the gospel and the fullness of divine worship as prophesied in Isaiah."
    },
    {
      "pk": 4014022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 22,
      "text": "'None of the men who have seen My glory and My signs which I did in Egypt and in the wilderness, and have tested Me these ten times, and have not obeyed My voice,'",
      "links": "<a href='/AIV/19/78/40-41'>Ps. 78:40-41</a>; <a href='/AIV/58/3/7-11'>Heb. 3:7-11</a>",
      "comment": "Repeated testing and disobedience provoke judgment, paralleling Psalm 78 and Hebrews 3’s warnings about hardening one’s heart after witnessing God’s works."
    },
    {
      "pk": 4014023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 23,
      "text": "'Surely they shall not see the land which I swore to give to their fathers; none of those who despised Me shall see it.'",
      "links": "<a href='/AIV/05/1/35'>Deut. 1:35</a>; <a href='/AIV/58/4/6'>Heb. 4:6</a>",
      "comment": "God’s judgment is clear: unbelief leads to exclusion from promise. The spiritual lesson is enduring—faith and fidelity secure God’s inheritance, a principle echoed in the teachings about perseverance in the New Testament."
    },
    {
      "pk": 4014024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 24,
      "text": "'But My servant Caleb, because he had a different spirit and has followed Me fully, him I will bring into the land where he went, and his descendants shall possess it.'",
      "links": "<a href='/AIV/06/14/9-14'>Josh. 14:9-14</a>; <a href='/AIV/04/32/12'>Num. 32:12</a>",
      "comment": "Caleb's wholehearted faith brings the reward. Spiritual and literal interpretation: those who follow God's will completely inherit divine blessings and promises."
    },
    {
      "pk": 4014025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 25,
      "text": "'Now, the Amalekites and the Canaanites dwell in the valleys. Tomorrow, turn and set out into the wilderness by the way of the Red Sea.'",
      "links": "<a href='/AIV/04/13/29'>Num. 13:29</a>; <a href='/AIV/05/1/40'>Deut. 1:40</a>",
      "comment": "God’s command demonstrates the consequences of Israel’s rebellion—they must turn from promised rest to wandering again. It highlights the need for obedience and submission to divine direction."
    },
    {
      "pk": 4014026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 26,
      "text": "And the LORD spoke to Moses and to Aaron, saying,",
      "links": "<a href='/AIV/04/12/1'>Num. 12:1</a>; <a href='/AIV/04/16/20'>Num. 16:20</a>",
      "comment": "This introduces a new divine message, reinforcing Moses and Aaron’s unique leadership roles as recipients of divine revelation."
    },
    {
      "pk": 4014027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 27,
      "text": "'How long shall this wicked congregation grumble against Me? I have heard the complaints of the children of Israel which they make against Me.'",
      "links": "<a href='/AIV/04/14/2'>Num. 14:2</a>; <a href='/AIV/19/106/25'>Ps. 106:25</a>",
      "comment": "God again expresses disapproval of grumbling, showing that habitual complaints signify deeper spiritual sickness."
    },
    {
      "pk": 4014028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 28,
      "text": "'Say to them, \"As I live,\" says the LORD, \"just as you have spoken in My ears, so I will do to you:\"'",
      "links": "<a href='/AIV/04/26/65'>Num. 26:65</a>; <a href='/AIV/19/78/29-31'>Ps. 78:29-31</a>",
      "comment": "God’s judgment will mirror Israel’s own expressed fears, relating spiritual consequences to words and attitudes."
    },
    {
      "pk": 4014029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 29,
      "text": "'Your dead bodies shall fall in this wilderness; all of you who were numbered, according to your whole number, from twenty years old and upward, who have grumbled against Me.'",
      "links": "<a href='/AIV/04/1/46'>Num. 1:46</a>; <a href='/AIV/04/26/64-65'>Num. 26:64-65</a>",
      "comment": "The rebellion’s consequence is temporal judgment—death in the wilderness. Theologically, this stresses the seriousness of rejecting God’s directive and parallels the New Testament’s warning against neglecting salvation (Heb. 2:3)."
    },
    {
      "pk": 4014030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 30,
      "text": "'Surely you shall not come into the land in which I swore to settle you, except Caleb son of Jephunneh and Joshua son of Nun.'",
      "links": "<a href='/AIV/06/14/30'>Josh. 14:30</a>; <a href='/AIV/04/26/65'>Num. 26:65</a>",
      "comment": "Only those who trust and obey—Caleb and Joshua—enter the promise, a model for spiritual inheritance of eternal life as taught by Jesus and the apostles."
    },
    {
      "pk": 4014031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 31,
      "text": "'But your little ones, whom you said would become plunder, I will bring in; and they shall know the land which you have rejected.'",
      "links": "<a href='/AIV/05/1/39'>Deut. 1:39</a>; <a href='/AIV/19/22/30'>Ps. 22:30</a>",
      "comment": "God reverses their fears—the next generation inherits the land. The concept of generational blessing and redemption reflects God’s continuing providence and plan."
    },
    {
      "pk": 4014032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 32,
      "text": "'But as for you, your dead bodies shall fall in this wilderness.'",
      "links": "<a href='/AIV/04/14/29'>Num. 14:29</a>; <a href='/AIV/05/2/15'>Deut. 2:15</a>",
      "comment": "God reiterates the judgment on the faithless generation, emphasizing the serious consequences of disbelief."
    },
    {
      "pk": 4014033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 33,
      "text": "'And your children will be shepherds in the wilderness forty years, and will bear the consequences of your unfaithfulness, until your dead bodies lie in the wilderness.'",
      "links": "<a href='/AIV/04/32/13'>Num. 32:13</a>; <a href='/AIV/19/95/10'>Ps. 95:10</a>",
      "comment": "Forty years of wandering symbolize both punishment and preparation. This period anticipates the spiritual discipline and purification, paralleling themes found in Christ’s forty days in the wilderness."
    },
    {
      "pk": 4014034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 34,
      "text": "'According to the number of the days in which you spied out the land, forty days, for each day a year, you shall bear your iniquities forty years, and you will know My displeasure.'",
      "links": "<a href='/AIV/04/13/25'>Num. 13:25</a>; <a href='/AIV/26/4/6'>Ezek. 4:6</a>",
      "comment": "Biblical numbers here are symbolic and literal. The punishment fits the length of their doubt, highlighting divine justice."
    },
    {
      "pk": 4014035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 35,
      "text": "'I, the LORD, have spoken. Surely I will do all this to this evil congregation that has gathered against Me; in this wilderness they shall be consumed, and there they shall die.'",
      "links": "<a href='/AIV/19/78/34'>Ps. 78:34</a>; <a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "God’s oath ensures judgment, emphasizing His sovereignty and the seriousness of rebellion against His word."
    },
    {
      "pk": 4014036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 36,
      "text": "The men whom Moses sent to spy out the land, who returned and made all the congregation grumble against him by bringing a bad report about the land,",
      "links": "<a href='/AIV/04/13/32'>Num. 13:32</a>; <a href='/AIV/04/14/2'>Num. 14:2</a>",
      "comment": "Those who led the rebellion against God’s plan bear particular responsibility. Leadership carries grave accountability for influencing others, a principle echoed throughout Scripture."
    },
    {
      "pk": 4014037,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 37,
      "text": "Even those men who brought out the evil report about the land died by plague before the LORD.",
      "links": "<a href='/AIV/04/16/49'>Num. 16:49</a>; <a href='/AIV/19/106/26'>Ps. 106:26</a>",
      "comment": "Immediate judgment falls on the faithless spies, reflecting both God’s justice and the real consequences for leading the community astray."
    },
    {
      "pk": 4014038,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 38,
      "text": "Only Joshua son of Nun and Caleb son of Jephunneh remained alive among those men who went to spy out the land.",
      "links": "<a href='/AIV/04/26/65'>Num. 26:65</a>; <a href='/AIV/06/14/30'>Josh. 14:30</a>",
      "comment": "Joshua and Caleb, standing firm in faith, are preserved. Their survival points to God’s special favor on those who remain steadfast, prefiguring the preservation of the faithful remnant in salvation history."
    },
    {
      "pk": 4014039,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 39,
      "text": "When Moses spoke these words to all the children of Israel, the people mourned greatly.",
      "links": "<a href='/AIV/04/11/33-34'>Num. 11:33-34</a>; <a href='/AIV/19/106/43'>Ps. 106:43</a>",
      "comment": "The people’s mourning reflects the consequence of their choices. Repentance often follows recognition of divine judgment, a recurring theme in the Old and New Testaments."
    },
    {
      "pk": 4014040,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 40,
      "text": "And early in the morning they rose up and went to the top of the hill country, saying, 'Here we are. We will go up to the place which the LORD has promised. For we have sinned.'",
      "links": "<a href='/AIV/05/1/41'>Deut. 1:41</a>; <a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "Their confession, though sincere, is matched by ill-timed action. True repentance must be expressed in humble obedience, not in presumption."
    },
    {
      "pk": 4014041,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 41,
      "text": "But Moses said, 'Why do you now transgress the command of the LORD? For that will not succeed.'",
      "links": "<a href='/AIV/05/1/42'>Deut. 1:42</a>; <a href='/AIV/28/6/7'>Hos. 6:7</a>",
      "comment": "Moses warns against presumption—acting outside of God’s command never results in true blessing, a principle for discernment and humility."
    },
    {
      "pk": 4014042,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 42,
      "text": "'Do not go up, for the LORD is not among you, lest you be defeated by your enemies.'",
      "links": "<a href='/AIV/05/1/42'>Deut. 1:42</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "The absence of God’s presence guarantees failure. Only in union with divine will can victory and blessing be secured."
    },
    {
      "pk": 4014043,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 43,
      "text": "'For there the Amalekites and the Canaanites are before you, and you shall fall by the sword. Because you have turned back from following the LORD, the LORD will not be with you.'",
      "links": "<a href='/AIV/04/13/29'>Num. 13:29</a>; <a href='/AIV/07/6/1'>Judg. 6:1</a>",
      "comment": "Turning from God’s direction leads to defeat. This highlights the necessity of following God’s established way, which, in the fullness of time, is perfectly revealed through Christ."
    },
    {
      "pk": 4014044,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 44,
      "text": "But they presumed to go up to the hill country, though neither the ark of the covenant of the LORD nor Moses departed from the camp.",
      "links": "<a href='/AIV/05/1/43'>Deut. 1:43</a>; <a href='/AIV/09/7/2'>2 Sam. 7:2</a>",
      "comment": "The absence of the ark and Moses signifies the loss of God’s presence and authorized leadership. The principle of mediated presence, still essential in Christian theology, is foremost here."
    },
    {
      "pk": 4014045,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 14,
      "verse": 45,
      "text": "Then the Amalekites and the Canaanites who lived in that hill country came down and defeated them and pursued them as far as Hormah.",
      "links": "<a href='/AIV/05/1/44'>Deut. 1:44</a>; <a href='/AIV/07/1/17'>Judg. 1:17</a>",
      "comment": "Disaster results when the people attempt action apart from God’s command. Hormah, meaning 'devotion to destruction,' becomes a warning that only by humble submission and union with God’s will can His people prosper. This anticipates the necessity of obedience found in Christ’s own words and example."
    }
  ],
  "translatedAt": "2025-12-24T01:38:13.557Z"
}