{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 32,
  "verses": [
    {
      "pk": 14032001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 1,
      "text": "After these deeds of faithfulness, Sennacherib king of Assyria came and invaded Judah. He set up camp against the fortified cities, intending to break through and conquer them.",
      "links": "<a href='/AIV/12/18/13'>2 Kings 18:13</a>; <a href='/AIV/23/36/1'>Isaiah 36:1</a>",
      "comment": "The author highlights Sennacherib’s attack as a test that follows Hezekiah’s faithfulness, showing how faithfulness does not prevent trials. This introduces the pattern that God’s people are often tested in their faith (cf. James 1:2-3)."
    },
    {
      "pk": 14032002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 2,
      "text": "When Hezekiah saw that Sennacherib had come and intended to make war against Jerusalem,",
      "links": "<a href='/AIV/12/18/17'>2 Kings 18:17</a>",
      "comment": "Hezekiah’s recognition of the threat sets up his response as a model for leadership under pressure, anticipating both practical and spiritual measures."
    },
    {
      "pk": 14032003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 3,
      "text": "he consulted with his officials and his warriors about stopping the water of the springs outside the city, and they agreed with him.",
      "links": "<a href='/AIV/12/20/20'>2 Chronicles 20:20</a>; <a href='/AIV/23/22/9-11'>Isaiah 22:9-11</a>",
      "comment": "Hezekiah’s consultation models wise governance, acting in harmony with the counsel of the community. Compare to the wisdom of many counselors (Prov. 15:22)."
    },
    {
      "pk": 14032004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 4,
      "text": "A large crowd gathered, and they stopped all the springs and the brook that flowed through the land, saying, 'Why should the kings of Assyria come and find plenty of water?'",
      "links": "<a href='/AIV/12/20/20'>2 Chronicles 20:20</a>; <a href='/AIV/23/22/9-11'>Isaiah 22:9-11</a>",
      "comment": "Blocking the water supply is both practical defense and a sign of communal action. This united effort reflects the strength found in the visible faith community."
    },
    {
      "pk": 14032005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 5,
      "text": "He strengthened himself, built up the entire wall that was broken, raised it higher, built towers, and built another wall outside. He also reinforced the Millo in the city of David and made plentiful weapons and shields.",
      "links": "<a href='/AIV/16/3/15'>Nehemiah 3:15</a>; <a href='/AIV/10/5/9'>2 Samuel 5:9</a>",
      "comment": "Hezekiah’s preparation was thorough, not only spiritually but materially. This integration of faith and works prefigures the call to combine prayer and action (cf. James 2:17)."
    },
    {
      "pk": 14032006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 6,
      "text": "He appointed military commanders over the people, assembled them in the square at the city gate, and encouraged them, saying,",
      "links": "<a href='/AIV/05/20/3-4'>Deut. 20:3-4</a>",
      "comment": "Hezekiah’s public address echoes the tradition of Israel’s leaders encouraging the people before battle, reminding them of God’s faithfulness in history."
    },
    {
      "pk": 14032007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 7,
      "text": "'Be strong and courageous! Do not be afraid or terrified because of the king of Assyria or the vast army that is with him, for there is One greater with us than with him.'",
      "links": "<a href='/AIV/06/1/9'>Joshua 1:9</a>; <a href='/AIV/12/6/16'>2 Kings 6:16</a>",
      "comment": "The call to courage recalls God’s words to Joshua. ‘One greater with us’ looks forward to God-with-us (Emmanuel), a theme fulfilled in Christ (cf. Matthew 1:23)."
    },
    {
      "pk": 14032008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 8,
      "text": "‘With him is only an arm of flesh, but with us is the LORD our God to help us and fight our battles.’ The people gained confidence from the words of Hezekiah king of Judah.",
      "links": "<a href='/AIV/10/8/47'>2 Samuel 8:47</a>; <a href='/AIV/05/20/4'>Deut. 20:4</a>",
      "comment": "The sharp distinction between human strength and relying on God is a recurring biblical theme. Hezekiah’s assurance echoes spiritual warfare, relying on the power of God rather than human ability (cf. 2 Corinthians 10:4)."
    },
    {
      "pk": 14032009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 9,
      "text": "After this, Sennacherib king of Assyria, while he was laying siege to Lachish with all his forces, sent his servants to Jerusalem, to Hezekiah king of Judah and to all the people there, saying,",
      "links": "<a href='/AIV/12/18/17'>2 Kings 18:17-35</a>; <a href='/AIV/23/36/2-20'>Isaiah 36:2-20</a>",
      "comment": "Here begins the psychological warfare intended to instill fear. The chronicler shifts the focus from the military threat to the spiritual trial."
    },
    {
      "pk": 14032010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 10,
      "text": "'This is what Sennacherib king of Assyria says: “On what are you basing your confidence that you remain in Jerusalem under siege?”'",
      "links": "<a href='/AIV/12/18/19'>2 Kings 18:19</a>;",
      "comment": "The enemy questions the foundation of Judah’s faith, echoing the ancient temptation to doubt God’s promises (Genesis 3:1)."
    },
    {
      "pk": 14032011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 32,
      "verse": 11,
      "text": "'Isn’t Hezekiah misleading you, to let you die by famine and thirst, when he says, "
    }
  ],
  "translatedAt": "2025-12-24T04:37:45.895Z"
}