{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 35,
  "verses": [
    {
      "pk": 14035001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 1,
      "text": "Josiah kept the Passover to the LORD in Jerusalem. They slaughtered the Passover lambs on the fourteenth day of the first month.",
      "links": "<a href='/AIV/2/12/1-27'>Ex. 12:1-27</a>; <a href='/AIV/12/23/21-23'>2 Kings 23:21-23</a>",
      "comment": "Josiah's observance of Passover closely follows the instructions given to Moses, emphasizing faithfulness to God's commands and the importance of liturgical worship."
    },
    {
      "pk": 14035002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 2,
      "text": "He appointed the priests to their duties and encouraged them to serve in the house of the LORD.",
      "links": "<a href='/AIV/3/8/30'>Lev. 8:30</a>; <a href='/AIV/11/8/4'>1 Kings 8:4</a>",
      "comment": "Josiah strengthens the priestly ministry and their sacred roles, highlighting proper ecclesial order and authority within worship."
    },
    {
      "pk": 14035003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 3,
      "text": "He said to the Levites who taught all Israel and were holy to the LORD, 'Put the holy ark in the house that Solomon son of David built. You no longer need to carry it on your shoulders. Now serve the LORD your God and His people Israel.'",
      "links": "<a href='/AIV/13/15/2'>1 Chr. 15:2</a>; <a href='/AIV/11/6/1-2'>1 Kings 6:1-2</a>",
      "comment": "The Levites, as teachers and custodians of worship, set the Ark in its proper solemn place—a reminder of the sacredness of God's presence among His people."
    },
    {
      "pk": 14035004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 4,
      "text": "'Prepare yourselves by your ancestral divisions, according to the written instructions of David king of Israel and the writings of Solomon his son.'",
      "links": "<a href='/AIV/13/24/3-19'>1 Chr. 24:3-19</a>; <a href='/AIV/11/28/12-19'>1 Chr. 28:12-19</a>",
      "comment": "Orderly and hierarchical worship structure, derived from authoritative tradition and royal instructions, ensures continuity and fidelity in service."
    },
    {
      "pk": 14035005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 5,
      "text": "'Stand in the holy place according to the divisions of your ancestors, for your brothers the people, and provide for each division of the family of the Levites.'",
      "links": "<a href='/AIV/4/3/6-9'>Num. 3:6-9</a>; <a href='/AIV/13/23/2-4'>1 Chr. 23:2-4</a>",
      "comment": "Emphasizes unity and service within the Body of believers, modeling the spiritual communion and the sharing of sacred responsibilities."
    },
    {
      "pk": 14035006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 6,
      "text": "'Slaughter the Passover lambs, consecrate yourselves, and prepare for your brothers, doing as the word of the LORD through Moses commands.'",
      "links": "<a href='/AIV/2/12/21'>Ex. 12:21</a>; <a href='/AIV/3/8/6'>Lev. 8:6</a>",
      "comment": "Sacrificial offerings are performed in accordance with divine regulation. The exhortation to consecrate prefigures later ideas of priestly sanctity and sacramental preparation."
    },
    {
      "pk": 14035007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 7,
      "text": "Josiah contributed to the people lambs and young goats, all for Passover offerings for all who were present, totaling thirty thousand, plus three thousand cattle. These came from the king's own possessions.",
      "links": "<a href='/AIV/12/23/9'>2 Kings 23:9</a>",
      "comment": "The king provides generously for the sacrificial feast, recalling the royal stewardship of God's people and the centrality of sacrifice in communal worship."
    },
    {
      "pk": 14035008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 8,
      "text": "His officials also freely gave to the people, the priests, and the Levites. Hilkiah, Zechariah, and Jehiel, leaders of God's house, provided to the priests two thousand six hundred Passover offerings and three hundred cattle.",
      "links": "<a href='/AIV/13/9/11'>1 Chr. 9:11</a>",
      "comment": "The generosity extends through all ranks, emphasizing the cooperation and common participation in worship among God's people and leaders."
    },
    {
      "pk": 14035009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 9,
      "text": "Conaniah and his brothers Shemaiah and Nethanel, and Hashabiah, Jeiel, and Jozabad, leaders of the Levites, gave to the Levites five thousand Passover offerings and five hundred cattle.",
      "links": "<a href='/AIV/13/25/1-6'>1 Chr. 25:1-6</a>",
      "comment": "The Levite leaders provide material support, highlighting responsibility of spiritual leaders to care for both the spiritual and material needs."
    },
    {
      "pk": 14035010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 10,
      "text": "So the service was prepared, and the priests stood in their places, and the Levites in their divisions, as the king commanded.",
      "links": "<a href='/AIV/13/6/31'>1 Chr. 6:31</a>",
      "comment": "Order and obedience in worship form a central theme, pointing toward the need for proper authority and service."
    },
    {
      "pk": 14035011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 11,
      "text": "They slaughtered the Passover lambs, and the priests sprinkled the blood handed to them, while the Levites skinned the animals.",
      "links": "<a href='/AIV/3/7/14'>Lev. 7:14</a>; <a href='/AIV/3/17/11'>Lev. 17:11</a>",
      "comment": "Priestly mediation of sacrifice and sprinkling of blood foreshadows both the centrality of sacramental worship and Christ’s mediation as the ultimate High Priest."
    },
    {
      "pk": 14035012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 12,
      "text": "They separated the burnt offerings so each family division could offer them to the LORD, as written in the book of Moses; they did likewise with the cattle.",
      "links": "<a href='/AIV/3/1/3-17'>Lev. 1:3-17</a>",
      "comment": "Adherence to the Mosaic Law shows reverence for divine instruction preserved through tradition."
    },
    {
      "pk": 14035013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 13,
      "text": "They roasted the Passover offerings with fire as prescribed, and boiled the holy offerings in pots, kettles, and pans, serving them quickly to all the people.",
      "links": "<a href='/AIV/2/12/8-9'>Ex. 12:8-9</a>; <a href='/AIV/3/6/28'>Lev. 6:28</a>",
      "comment": "Faithful observance of ritual detail demonstrates love for God through obedience; the meal’s communal nature points toward a future holy banquet."
    },
    {
      "pk": 14035014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 14,
      "text": "Afterward they prepared for themselves and for the priests, because the priests were busy with the burnt offerings and fat until night. So the Levites prepared for themselves and for the priests, sons of Aaron.",
      "links": "<a href='/AIV/3/7/15'>Lev. 7:15</a>",
      "comment": "Levites serve the priests, reinforcing the spirit of selfless service and ministerial hierarchy in the spiritual community."
    },
    {
      "pk": 14035015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 15,
      "text": "The singers, descendants of Asaph, were in their places, following the commands of David, Asaph, Heman, and Jeduthun, the king’s seer. The gatekeepers were at each gate; they did not have to leave their duties, because their fellow Levites prepared for them.",
      "links": "<a href='/AIV/13/25/1-7'>1 Chr. 25:1-7</a>; <a href='/AIV/13/9/17'>1 Chr. 9:17</a>",
      "comment": "Music and worship are integral, guided by sacred tradition and organized liturgy. Gatekeepers’ fidelity ensures uninterrupted worship—making each role vital."
    },
    {
      "pk": 14035016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 16,
      "text": "So all the service of the LORD was prepared that day to keep the Passover and to present burnt offerings on the altar of the LORD, as Josiah had commanded.",
      "links": "<a href='/AIV/12/23/24'>2 Kings 23:24</a>",
      "comment": "The festival is marked by complete obedience, reflecting the harmony that comes from submission to divine authority and tradition, prefiguring the spiritual unity found in the Church."
    },
    {
      "pk": 14035017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 17,
      "text": "And the Israelites who were present kept the Passover at that time and the Feast of Unleavened Bread for seven days.",
      "links": "<a href='/AIV/2/12/15-20'>Ex. 12:15-20</a>",
      "comment": "Seven-day celebration recalls God's creation and the completeness of God’s saving work. Unleavened Bread points toward purification and readiness to receive God’s blessings."
    },
    {
      "pk": 14035018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 18,
      "text": "There had not been a Passover like it in Israel since Samuel the prophet; none of the kings of Israel had kept such a Passover as Josiah did, along with the priests, the Levites, and all Judah and Israel who were present, and the inhabitants of Jerusalem.",
      "links": "<a href='/AIV/9/30/26'>2 Chr. 30:26</a>; <a href='/AIV/9/35/1'>2 Chr. 35:1</a>",
      "comment": "Josiah’s Passover is remembered as an exceptional moment of renewal, emphasizing the power of rediscovered tradition and the blessings of unity in the faith community."
    },
    {
      "pk": 14035019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 19,
      "text": "This Passover was kept in the eighteenth year of Josiah’s reign.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>",
      "comment": "The timing is provided to root Josiah’s reforms in history, supporting the reliability and continuity of sacred tradition and leadership."
    },
    {
      "pk": 14035020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 20,
      "text": "After all this, when Josiah had set the temple in order, Necho king of Egypt came up to fight at Carchemish on the Euphrates, and Josiah went out to confront him.",
      "links": "<a href='/AIV/12/23/29'>2 Kings 23:29</a>",
      "comment": "Josiah’s zeal for God leads him to take action during international conflict, but his story turns from religious reform to tragic confrontation—a warning about discernment and obedience."
    },
    {
      "pk": 14035021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 21,
      "text": "But Necho sent messengers to him, saying, 'What do I have to do with you, king of Judah? I am not coming against you today, but against another power. God told me to hurry; so refrain from opposing God, or He will destroy you.'",
      "links": "<a href='/AIV/1/20/1-2'>Gen. 20:1-2</a>",
      "comment": "Necho’s message claims divine guidance, showing that God can work through unexpected sources to accomplish His will, and warns against confusing one’s own plans with God’s purposes."
    },
    {
      "pk": 14035022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 22,
      "text": "But Josiah would not turn away from him, but disguised himself to fight. He did not listen to Necho’s words from the mouth of God, and went to fight in the plain of Megiddo.",
      "links": "<a href='/AIV/12/23/29'>2 Kings 23:29</a>; <a href='/AIV/7/5/19'>Judg. 5:19</a>",
      "comment": "Josiah’s tragic decision to ignore Necho, who spoke words from God, is a reminder of the need for humility and discernment, even for the most zealous leaders."
    },
    {
      "pk": 14035023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 23,
      "text": "The archers shot King Josiah. The king said to his servants, 'Take me away, for I am badly wounded.'",
      "links": "<a href='/AIV/12/22/33'>2 Kings 22:33</a>; <a href='/AIV/12/23/30'>2 Kings 23:30</a>",
      "comment": "Josiah’s wounding fulfills the warnings given, illustrating the consequences of mistaken zeal and the vulnerability even of righteous leaders."
    },
    {
      "pk": 14035024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 24,
      "text": "So his servants carried him out of the chariot and took him to Jerusalem; and he died and was buried in the tombs of his fathers. All Judah and Jerusalem mourned for Josiah.",
      "links": "<a href='/AIV/12/23/30'>2 Kings 23:30</a>; <a href='/AIV/9/21/20'>2 Chr. 21:20</a>",
      "comment": "The mourning of Josiah unites the people in sorrow, echoing the deep connections between leaders and their communities—a prelude to the solidarity found in shared faith."
    },
    {
      "pk": 14035025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 25,
      "text": "Jeremiah composed a lament for Josiah. To this day, all the singing men and women speak of Josiah in their laments. It became customary in Israel, and they are written in the Laments.",
      "links": "<a href='/AIV/24/22/10'>Jer. 22:10</a>; <a href='/AIV/25/1/1-2'>Lam. 1:1-2</a>",
      "comment": "The sorrowful tradition of lamentation endures, preserving memory of the righteous and connecting the present community with its spiritual heritage—hinting at the importance of sacred remembrance."
    },
    {
      "pk": 14035026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 26,
      "text": "The rest of the acts of Josiah, and his good deeds according to what is written in the law of the LORD,",
      "links": "<a href='/AIV/12/23/25'>2 Kings 23:25</a>; <a href='/AIV/9/34/14'>2 Chr. 34:14</a>",
      "comment": "Josiah’s devotion is recorded in sacred history, reinforcing the enduring value of faithful adherence to God’s law—the written legacy of holiness."
    },
    {
      "pk": 14035027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 35,
      "verse": 27,
      "text": "and his acts, from first to last, are written in the Book of the Kings of Israel and Judah.",
      "links": "<a href='/AIV/12/23/28'>2 Kings 23:28</a>; <a href='/AIV/13/29/29'>1 Chr. 29:29</a>",
      "comment": "Sacred writing preserves the memory of God’s work through His people, pointing to the importance of tradition as a means of keeping faith alive and vibrant for future generations."
    }
  ],
  "translatedAt": "2025-12-24T04:39:35.420Z"
}