{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 35,
  "verses": [
    {
      "pk": 1933500,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 1,
      "text": "Josiah kept the Passover to the LORD in Jerusalem. They slaughtered the Passover lamb on the fourteenth day of the first month.",
      "links": "<a href='/AIV/2/12/6'>Exod. 12:6</a>; <a href='/AIV/14/30/15'>2 Chr. 30:15</a>",
      "comment": "Verse repeats the timing established in Exodus for Passover."
    },
    {
      "pk": 1933501,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 2,
      "text": "He appointed the priests to their positions and encouraged them in their service in the house of the LORD.",
      "links": "<a href='/AIV/4/18/28'>Num. 18:28</a>; <a href='/AIV/13/23/13'>1 Chr. 23:13</a>",
      "comment": "Josiah strengthens the priestly order for the festival."
    },
    {
      "pk": 1933502,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 3,
      "text": "He said to the Levites who taught all Israel, who were holy to the LORD, 'Put the holy ark in the house that Solomon the son of David, king of Israel, built. It will no longer be a burden on your shoulders. Serve now the LORD your God and His people Israel.'",
      "links": "<a href='/AIV/11/8/6'>1 Kgs. 8:6</a>; <a href='/AIV/13/15/2'>1 Chr. 15:2</a>",
      "comment": "The Ark is returned to the temple; the Levites' role transitions from carrying the Ark to temple service."
    },
    {
      "pk": 1933503,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 4,
      "text": "'Prepare yourselves according to your fathers' houses, by your divisions, as written in the Law of Moses and as commanded by David king of Israel and his son Solomon.'",
      "links": "<a href='/AIV/4/3/15'>Num. 3:15</a>; <a href='/AIV/13/24/1-19'>1 Chr. 24:1–19</a>",
      "comment": "References the Mosaic and Davidic orders for Levitical divisions."
    },
    {
      "pk": 1933504,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 5,
      "text": "'Stand in the holy place according to the groupings of the father's households of your brothers the lay people, and let there be for each division of the father's house of the Levites.'",
      "links": "<a href='/AIV/13/9/17-27'>1 Chr. 9:17–27</a>",
      "comment": "Levites to organize according to the divisions for service."
    },
    {
      "pk": 1933505,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 6,
      "text": "'Slaughter the Passover lamb, sanctify yourselves, and prepare for your brothers, to do according to the word of the LORD by Moses.'",
      "links": "<a href='/AIV/2/12/6'>Exod. 12:6</a>; <a href='/AIV/4/9/2-14'>Num. 9:2–14</a>",
      "comment": "Passover is prepared strictly by Mosaic instructions."
    },
    {
      "pk": 1933506,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 7,
      "text": "Then Josiah gave to the lay people, lambs and young goats from the flock, all for Passover offerings to all who were present, totaling thirty thousand, and three thousand bulls; these were from the king’s possessions.",
      "links": "<a href='/AIV/13/29/21'>1 Chr. 29:21</a>",
      "comment": "Josiah’s generosity for Passover sacrifices is emphasized."
    },
    {
      "pk": 1933507,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 8,
      "text": "His officials gave willingly to the people, to the priests, and to the Levites. Hilkiah, Zechariah, and Jehiel, the officials of God’s house, gave to the priests Passover offerings—two thousand six hundred from the flock, and three hundred bulls.",
      "links": "<a href='/AIV/14/31/13'>2 Chr. 31:13</a>",
      "comment": "Additional gifts for the Passover from the religious leaders."
    },
    {
      "pk": 1933508,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 9,
      "text": "Koneniah also, and Shemaiah and Nethanel his brothers, and Hashabiah and Jeiel and Jozabad, the leaders of the Levites, gave to the Levites for Passover offerings five thousand from the flock and five hundred bulls.",
      "links": "",
      "comment": "Further contributions from leading Levites."
    },
    {
      "pk": 1933509,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 10,
      "text": "So the service was prepared, and the priests stood in their places, and the Levites in their divisions, according to the king’s command.",
      "links": "",
      "comment": "Order and preparation are emphasized."
    },
    {
      "pk": 1933510,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 11,
      "text": "They slaughtered the Passover lambs, and the priests sprinkled the blood with their hands, while the Levites flayed the animals.",
      "links": "<a href='/AIV/2/12/6-28'>Exod. 12:6–28</a>",
      "comment": "Describes the ritual roles in the sacrifice."
    },
    {
      "pk": 1933511,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 12,
      "text": "And they set aside the burnt offerings, to give them by groups to the families of the lay people, to offer to the LORD, as it is written in the book of Moses. They did the same with the bulls.",
      "links": "<a href='/AIV/3/3/2'>Lev. 3:2</a>; <a href='/AIV/4/9/12-13'>Num. 9:12–13</a>",
      "comment": "Actions carried out as written in the Law."
    },
    {
      "pk": 1933512,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 13,
      "text": "And they roasted the Passover lamb with fire according to the regulation, and boiled the holy offerings in pots, in kettles, and in pans, and carried them quickly to all the lay people.",
      "links": "<a href='/AIV/2/12/8-9'>Exod. 12:8–9</a>",
      "comment": "Distinct preparation methods for Passover lamb and other offerings."
    },
    {
      "pk": 1933513,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 14,
      "text": "Afterward, they prepared portions for themselves and for the priests, because the priests, the sons of Aaron, were offering the burnt offerings and the fat until night; therefore, the Levites prepared for themselves and for the priests, the sons of Aaron.",
      "links": "<a href='/AIV/3/1/5-9'>Lev. 1:5–9</a>",
      "comment": "Priests worked continually, so Levites assisted them."
    },
    {
      "pk": 1933514,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 15,
      "text": "The singers, the sons of Asaph, were at their stations according to the command of David, Asaph, Heman, and Jeduthun the king’s seer; and the gatekeepers were at every gate. They did not need to leave their posts, for their brothers the Levites prepared for them.",
      "links": "<a href='/AIV/13/25/1-8'>1 Chr. 25:1–8</a>",
      "comment": "Levites ensured all support staff were cared for."
    },
    {
      "pk": 1933515,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 16,
      "text": "So all the service of the LORD was prepared that day, to keep the Passover and to offer burnt offerings on the altar of the LORD, as commanded by King Josiah.",
      "links": "",
      "comment": "Summary verse: all preparations were in order as commanded."
    },
    {
      "pk": 1933516,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 17,
      "text": "And the people of Israel who were present kept the Passover at that time, and the Feast of Unleavened Bread for seven days.",
      "links": "<a href='/AIV/2/12/15'>Exod. 12:15</a>",
      "comment": "Feast of Unleavened Bread observed alongside Passover."
    },
    {
      "pk": 1933517,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 18,
      "text": "There had not been kept such a Passover in Israel since the days of Samuel the prophet; none of the kings of Israel had kept such a Passover as Josiah kept, with the priests, the Levites, all Judah and Israel who were present, and the inhabitants of Jerusalem.",
      "links": "<a href='/AIV/12/23/21-23'>2 Kgs. 23:21–23</a>",
      "comment": "The magnitude of this Passover sets it apart in the nation's history."
    },
    {
      "pk": 1933518,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 19,
      "text": "In the eighteenth year of the reign of Josiah this Passover was kept.",
      "links": "",
      "comment": "Gives the chronological anchor for the event."
    },
    {
      "pk": 1933519,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 20,
      "text": "After all this, when Josiah had prepared the temple, Necho king of Egypt went up to fight at Carchemish on the Euphrates, and Josiah went out against him.",
      "links": "<a href='/AIV/24/46/2'>Jer. 46:2</a>; <a href='/AIV/12/23/29'>2 Kgs. 23:29</a>",
      "comment": "Josiah involves himself in the regional conflict."
    },
    {
      "pk": 1933520,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 21,
      "text": "But Necho sent messengers to him, saying, 'What have I to do with you, king of Judah? I am not coming against you today, but against the house with which I am at war; and God has commanded me to hurry. Stop opposing God, who is with me, so He will not destroy you.'",
      "links": "",
      "comment": "Necho claims divine authorization for his campaign."
    },
    {
      "pk": 1933521,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 22,
      "text": "Nevertheless, Josiah did not turn away from him, but disguised himself to fight with him. He did not listen to the words of Necho from the mouth of God, but came to fight in the plain of Megiddo.",
      "links": "<a href='/AIV/12/9/29'>2 Kgs. 9:29</a>",
      "comment": "Josiah is portrayed as ignoring God's warning through Necho."
    },
    {
      "pk": 1933522,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 23,
      "text": "And the archers shot King Josiah; the king said to his servants, 'Take me away, for I am severely wounded.'",
      "links": "<a href='/AIV/12/22/34'>2 Kgs. 22:34</a>",
      "comment": "Standard translation of phrase for serious injury by archers."
    },
    {
      "pk": 1933523,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 24,
      "text": "So his servants took him out of the chariot and put him in the second chariot he had, and brought him to Jerusalem. He died and was buried in the tombs of his fathers. All Judah and Jerusalem mourned for Josiah.",
      "links": "<a href='/AIV/12/23/30'>2 Kgs. 23:30</a>",
      "comment": "Parallel with 2 Kings; highlights national mourning."
    },
    {
      "pk": 1933524,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 25,
      "text": "Jeremiah composed a lament for Josiah. And all the singers, male and female, have spoken of Josiah in their laments to this day. They made these a custom in Israel; and, behold, they are written in the Laments.",
      "links": "<a href='/AIV/25/4/20'>Lam. 4:20</a>",
      "comment": "Refers to lost laments, highlights Jeremiah's influence."
    },
    {
      "pk": 1933525,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 26,
      "text": "Now the rest of the acts of Josiah, and his good deeds, according to what is written in the Law of the LORD,",
      "links": "",
      "comment": "Transition to summary of Josiah's reign."
    },
    {
      "pk": 1933526,
      "translation": "AIV",
      "book": 14,
      "chapter": 35,
      "verse": 27,
      "text": "and his acts, first to last, they are written in the Book of the Kings of Israel and Judah.",
      "links": "<a href='/AIV/12/23/28'>2 Kgs. 23:28</a>",
      "comment": "Official source reference for further history."
    }
  ],
  "translatedAt": "2025-12-22T19:28:05.131Z"
}