{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 12,
  "verses": [
    {
      "pk": 14012001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 1,
      "text": "After Rehoboam’s rule was firmly established, he and all Israel abandoned the law of the LORD.",
      "links": "<a href='/AIV/11/14/22-24'>1 Kings 14:22-24</a>; <a href='/AIV/14/11/17'>2Chr 11:17</a>",
      "comment": "Note that the turning away from God is a collective failure, emphasizing the communal aspect of faithfulness. This highlights the importance of corporate worship and obedience, which finds fulfillment in the united body of believers as one Church. See also the call for national repentance in Joel 2:12-17."
    },
    {
      "pk": 14012002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 2,
      "text": "In the fifth year of King Rehoboam, Shishak king of Egypt came up against Jerusalem because they had been unfaithful to the LORD.",
      "links": "<a href='/AIV/11/14/25'>1 Kings 14:25</a>; <a href='/AIV/14/7/19'>2Chr 7:19</a>",
      "comment": "God allows foreign enemies to discipline His people when they turn away, showing both His justice and mercy. This foreshadows divine chastisement seen in the New Testament, such as Heb. 12:5-11, which calls believers to accept correction within God's family."
    },
    {
      "pk": 14012003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 3,
      "text": "He came with twelve hundred chariots, sixty thousand horsemen, and countless troops who came with him from Egypt—Libyans, Sukkites, and Cushites.",
      "links": "<a href='/AIV/11/10/28-29'>1 Kings 10:28-29</a>; <a href='/AIV/19/105/23'>Ps. 105:23</a>",
      "comment": "This immense army symbolizes the overwhelming power of worldly forces when God's people abandon Him. The inclusion of various nations prefigures the later gathering of all peoples under the one kingdom of God (cf. Rev. 5:9)."
    },
    {
      "pk": 14012004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 4,
      "text": "Shishak captured the fortified cities of Judah and came as far as Jerusalem.",
      "links": "<a href='/AIV/14/11/5-12'>2Chr 11:5-12</a>; <a href='/AIV/19/60/1'>Ps. 60:1</a>",
      "comment": "Jerusalem, the heart of worship, is directly threatened. The vulnerability of the center of true worship points to the need for spiritual vigilance and persevering prayer—protecting the faith, as seen in Eph. 6:13-18."
    },
    {
      "pk": 14012005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 5,
      "text": "Then Shemaiah the prophet came to Rehoboam and the leaders of Judah, who had gathered in Jerusalem because of Shishak, and said to them, 'This is what the LORD says: You have abandoned Me, so I have abandoned you to Shishak.'",
      "links": "<a href='/AIV/14/11/2'>2Chr 11:2</a>; <a href='/AIV/09/8/7'>1 Sam. 8:7</a>",
      "comment": "Prophetic warning reminds us that apostolic guidance is crucial for the people of God. To abandon God’s authoritative voice leads to spiritual defeat (Acts 2:42)."
    },
    {
      "pk": 14012006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 6,
      "text": "Then the rulers of Israel and the king humbled themselves and said, 'The LORD is just.'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>; <a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "Humility and repentance are necessary responses to divine correction, as seen throughout both Old and New Testaments (cf. Luke 15:18-19). The act of humbling oneself before God leads to restoration."
    },
    {
      "pk": 14012007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 7,
      "text": "When the LORD saw that they humbled themselves, the word of the LORD came to Shemaiah: 'They have humbled themselves; I will not destroy them, but will soon grant them some deliverance. My anger will not be poured out on Jerusalem through Shishak.'",
      "links": "<a href='/AIV/19/34/18'>Ps. 34:18</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "God responds to sincere repentance with mercy, sparing Jerusalem. This pattern of forgiveness anticipates the sacramental means of grace and reconciliation given to the Church (cf. John 20:22-23)."
    },
    {
      "pk": 14012008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 8,
      "text": "'Nevertheless, they will become servants to Shishak, so they may learn the difference between serving Me and serving the kings of other lands.'",
      "links": "<a href='/AIV/05/28/47-48'>Deut. 28:47-48</a>; <a href='/AIV/19/81/11-12'>Ps. 81:11-12</a>",
      "comment": "Earthly discipline teaches reliance on true worship and service to God. This lesson leads to valuing the sacred mysteries and observances that keep us aligned with God's covenant."
    },
    {
      "pk": 14012009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 9,
      "text": "So Shishak king of Egypt attacked Jerusalem and took away the treasures of the LORD’s temple and the treasures of the king's palace. He took everything, including the gold shields Solomon had made.",
      "links": "<a href='/AIV/11/10/16-17'>1 Kings 10:16-17</a>; <a href='/AIV/14/9/15-16'>2Chr 9:15-16</a>",
      "comment": "Loss of temple treasures signifies the spiritual impoverishment that follows idolatry. The visible, material reality points to the invisible loss of grace when God's people neglect the divine presence (cf. Heb. 6:4-6)."
    },
    {
      "pk": 14012010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 10,
      "text": "King Rehoboam made bronze shields to replace them and entrusted them to the officers of the guard who guarded the entrance to the king's palace.",
      "links": "<a href='/AIV/11/14/27'>1 Kings 14:27</a>",
      "comment": "Bronze replaces gold—a lesser substitute, showing how disobedience leads to a loss of glory. Only full restoration, as promised through the Messiah, restores spiritual riches (cf. Rev. 21:18-27)."
    },
    {
      "pk": 14012011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 11,
      "text": "Whenever the king entered the LORD’s temple, the guards would carry the shields, and afterward return them to the guardroom.",
      "links": "<a href='/AIV/14/9/29'>2Chr 9:29</a>",
      "comment": "Despite diminished glory, ritual observance continues. The continuity of worship, even after decline, underscores the significance of liturgical patterns through which God continues to work."
    },
    {
      "pk": 14012012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 12,
      "text": "Because Rehoboam humbled himself, the LORD’s anger turned away from him, and he was not totally destroyed. Indeed, there was still good in Judah.",
      "links": "<a href='/AIV/14/19/3'>2Chr 19:3</a>; <a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "God always preserves a remnant and recognizes sincere repentance. The possibility of restoration through humility is echoed in the parable of the prodigal son (Luke 15:20-24)."
    },
    {
      "pk": 14012013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 13,
      "text": "King Rehoboam strengthened his position in Jerusalem and continued to reign. He was forty-one years old when he became king, and he reigned seventeen years in Jerusalem, the city the LORD had chosen from all the tribes of Israel to put His Name there. His mother’s name was Naamah the Ammonite.",
      "links": "<a href='/AIV/11/14/21'>1 Kings 14:21</a>; <a href='/AIV/14/6/6'>2Chr 6:6</a>",
      "comment": "Jerusalem, chosen by God, is the center of worship and covenantal presence. This foreshadows the establishment of the one, visible Church as the center of Christ’s Kingdom (cf. Matt. 16:18-19)."
    },
    {
      "pk": 14012014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 14,
      "text": "But he did evil because he had not set his heart to seek the LORD.",
      "links": "<a href='/AIV/14/15/2'>2Chr 15:2</a>; <a href='/AIV/19/119/2'>Ps. 119:2</a>",
      "comment": "Seeking the LORD with one’s heart is essential. The failure to commit inwardly leads to outward sin, reminding us of the importance of both faith and works working together (James 2:17-18)."
    },
    {
      "pk": 14012015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 15,
      "text": "The acts of Rehoboam, from beginning to end, are written in the histories of Shemaiah the prophet and Iddo the seer, including records of their continual wars. There was constant war between Rehoboam and Jeroboam.",
      "links": "<a href='/AIV/14/13/22'>2Chr 13:22</a>; <a href='/AIV/11/14/30'>1 Kings 14:30</a>",
      "comment": "Constant conflict results when God’s people are divided. The unity prayed for by Christ in John 17:21 is the solution to strife among believers, emphasizing the importance of visible unity."
    },
    {
      "pk": 14012016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 12,
      "verse": 16,
      "text": "Rehoboam rested with his fathers and was buried in the city of David. His son Abijah became king in his place.",
      "links": "<a href='/AIV/14/13/1'>2Chr 13:1</a>; <a href='/AIV/11/14/31'>1 Kings 14:31</a>",
      "comment": "The succession of kings demonstrates the lineage through which God preserves His promise. Ultimately, this line leads to Christ, the true King, who establishes His everlasting Kingdom (cf. Luke 1:32-33)."
    }
  ],
  "translatedAt": "2025-12-24T04:27:45.050Z"
}