{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 26,
  "verses": [
    {
      "pk": 14026001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 1,
      "text": "All the people of Judah took Uzziah, who was sixteen years old, and made him king in place of his father Amaziah.",
      "links": "<a href='/AIV/12/14/21'>2 Kings 14:21</a>; <a href='/AIV/23/6/1'>Isaiah 6:1</a>",
      "comment": "Uzziah's youth highlights God often calls those who seem unprepared by human standards, a theme repeated in both Old and New Testaments (cf. 1 Samuel 16:11-13; Luke 1:48)."
    },
    {
      "pk": 14026002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 2,
      "text": "He rebuilt Eloth and restored it to Judah after Amaziah the king slept with his fathers.",
      "links": "<a href='/AIV/12/14/22'>2 Kings 14:22</a>; <a href='/AIV/10/8/14'>2 Samuel 8:14</a>",
      "comment": "Eloth was a significant port city, reflecting strategic concern for the kingdom's economic strength. The restoration points to wise stewardship and care for communal well-being, prefiguring spiritual renewal."
    },
    {
      "pk": 14026003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 3,
      "text": "Uzziah was sixteen years old when he began to reign, and he reigned fifty-two years in Jerusalem. His mother's name was Jecoliah of Jerusalem.",
      "links": "<a href='/AIV/12/15/2'>2 Kings 15:2</a>",
      "comment": "Long reigns often point to periods of stability or blessing. The mention of the mother is consistent with biblical tradition emphasizing family heritage (cf. Proverbs 1:8)."
    },
    {
      "pk": 14026004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 4,
      "text": "He did what was right in the eyes of the LORD, just as his father Amaziah had done.",
      "links": "<a href='/AIV/12/15/3'>2 Kings 15:3</a>; <a href='/AIV/14/25/2'>2Chr 25:2</a>",
      "comment": "Obedience to God brings blessing, but as seen elsewhere, partial obedience eventually leads to consequences. This calls to deeper, wholehearted fidelity to God's will."
    },
    {
      "pk": 14026005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 5,
      "text": "He sought God in the days of Zechariah, who instructed him in the fear of God. While he sought the LORD, God made him prosper.",
      "links": "<a href='/AIV/14/24/20'>2Chr 24:20</a>; <a href='/AIV/19/1/1-3'>Psalm 1:1-3</a>",
      "comment": "Spiritual guidance and the fear of the Lord lead to prosperity—a recurring biblical principle, echoing the importance of ongoing instruction and spiritual mentorship (Hebrews 13:17)."
    },
    {
      "pk": 14026006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 6,
      "text": "He went out and made war against the Philistines and broke down the wall of Gath, the wall of Jabneh, and the wall of Ashdod. Then he built cities in the area of Ashdod and among the Philistines.",
      "links": "<a href='/AIV/09/5/1'>1 Samuel 5:1</a>; <a href='/AIV/13/18/1'>1Chr 18:1</a>",
      "comment": "Uzziah's military successes emphasize the importance of defending the faith and expanding righteous influence. Building cities symbolizes cultivation of spiritual life and community."
    },
    {
      "pk": 14026007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 7,
      "text": "God helped him against the Philistines, against the Arabians who lived in Gur-baal, and against the Meunites.",
      "links": "<a href='/AIV/14/20/1'>2Chr 20:1</a>; <a href='/AIV/10/8/13'>2 Samuel 8:13</a>",
      "comment": "Victory is credited to God, not human strength, affirming that the Lord's providence is central (cf. Psalm 20:7). These victories prefigure spiritual triumphs over powers of darkness."
    },
    {
      "pk": 14026008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 8,
      "text": "The Ammonites paid tribute to Uzziah, and his fame spread as far as the border of Egypt, for he became very strong.",
      "links": "<a href='/AIV/10/8/2'>2 Samuel 8:2</a>; <a href='/AIV/11/10/1'>1 Kings 10:1</a>",
      "comment": "Tribute signifies submission to Uzziah's rule, and his fame represents how righteousness can have far-reaching impact—symbolic of the spread of the Gospel (Matthew 28:19)."
    },
    {
      "pk": 14026009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 9,
      "text": "Uzziah built towers in Jerusalem at the Corner Gate, at the Valley Gate, and at the Angle, and fortified them.",
      "links": "<a href='/AIV/16/3/13'>Nehemiah 3:13</a>; <a href='/AIV/14/25/23'>2Chr 25:23</a>",
      "comment": "Physical fortifications reflect spiritual fortification—the call to build strong defenses against temptation and falsehood (Ephesians 6:11-18)."
    },
    {
      "pk": 14026010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 10,
      "text": "He built towers in the wilderness and dug many cisterns, for he had many herds both in the lowland and in the plain. He had farmers and vine dressers in the hills and fertile land, for he loved the soil.",
      "links": "<a href='/AIV/05/8/7'>Deuteronomy 8:7</a>; <a href='/AIV/19/65/9-13'>Psalm 65:9-13</a>",
      "comment": "Care for agriculture and creation echoes the original vocation of Adam, stewardship of creation (Genesis 2:15). Love of the soil hints at sacramental overtones in Scripture (Genesis 1:29)."
    },
    {
      "pk": 14026011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 11,
      "text": "Moreover, Uzziah had an army organized for war, divided according to the number and lists made by Jeiel the secretary and Maaseiah the officer, under the direction of Hananiah, one of the king’s commanders.",
      "links": "<a href='/AIV/14/17/14'>2Chr 17:14</a>; <a href='/AIV/13/27/32'>1Chr 27:32</a>",
      "comment": "Organizational skill and delegation reflects wisdom in administration, reminiscent of the apostolic structure of the early Church (Acts 6:1-6)."
    },
    {
      "pk": 14026012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 12,
      "text": "The total number of family leaders over the mighty men of valor was 2,600.",
      "links": "<a href='/AIV/13/7/9'>1Chr 7:9</a>",
      "comment": "Emphasizing leadership by families, foreshadowing spiritual headship and responsibility within the household (Ephesians 5:23; 1 Timothy 3:5)."
    },
    {
      "pk": 14026013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 13,
      "text": "Under their command was an army of 307,500, who could make war with mighty power, helping the king against the enemy.",
      "links": "<a href='/AIV/14/17/18'>2Chr 17:18</a>; <a href='/AIV/19/144/1'>Psalm 144:1</a>",
      "comment": "A strong, prepared army signifies the need for the faithful to be prepared and ready to defend truth (cf. 2 Timothy 2:3-4)."
    },
    {
      "pk": 14026014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 14,
      "text": "Uzziah prepared for all the army shields, spears, helmets, coats of mail, bows, and stones for slinging.",
      "links": "<a href='/AIV/09/17/40'>1 Samuel 17:40</a>; <a href='/AIV/13/12/8'>1Chr 12:8</a>",
      "comment": "The careful provision of armor and weapons recalls Paul’s metaphor for spiritual armor (Ephesians 6:13-17), linking physical battle to spiritual warfare."
    },
    {
      "pk": 14026015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 15,
      "text": "In Jerusalem he made machines, invented by skilled men, to be on the towers and on the corners, to shoot arrows and large stones. So his fame spread far, for he was marvelously helped until he became strong.",
      "links": "<a href='/AIV/14/1/5'>2Chr 1:5</a>; <a href='/AIV/19/118/7'>Psalm 118:7</a>",
      "comment": "Human ingenuity is given by God for good purposes, mirroring the gifts of the Spirit for the edification of the body. Fame here parallels the spread of faith when God’s help is recognized."
    },
    {
      "pk": 14026016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 16,
      "text": "But when Uzziah was strong, his heart became proud to his destruction. He was unfaithful to the LORD his God and entered the temple of the LORD to burn incense on the altar of incense.",
      "links": "<a href='/AIV/04/16/40'>Numbers 16:40</a>; <a href='/AIV/19/18/27'>Psalm 18:27</a>",
      "comment": "Pride leads to downfall. Uzziah’s unlawful act reflects the importance of sacred ministry reserved for those called to it, emphasizing holy boundaries and reverence for divine order—foreshadowing spiritual authority in the New Testament (Hebrews 5:4)."
    },
    {
      "pk": 14026017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 17,
      "text": "Azariah the priest went in after him, and with eighty priests of the LORD, men of courage.",
      "links": "<a href='/AIV/02/28/1'>Exodus 28:1</a>; <a href='/AIV/14/24/20'>2Chr 24:20</a>",
      "comment": "The priests’ boldness to confront the king upholds the integrity of sacred rites, indicating spiritual leadership is not subordinate to temporal powers, but to God alone."
    },
    {
      "pk": 14026018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 18,
      "text": "They opposed Uzziah and said to him, \"It is not for you, Uzziah, to burn incense to the LORD, but for the priests, the descendants of Aaron, who are consecrated to burn incense. Leave the sanctuary, for you have acted unfaithfully, and it will not bring you honor from the LORD God.\"",
      "links": "<a href='/AIV/04/18/1-7'>Numbers 18:1-7</a>; <a href='/AIV/03/10/1'>Leviticus 10:1-3</a>",
      "comment": "This underscores the role of set-apart ministers (Aaronic priesthood), pointing ahead to continuity of sacred ministry. The call to leave the sanctuary maintains purity and order in worship (cf. 1 Timothy 4:14)."
    },
    {
      "pk": 14026019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 19,
      "text": "Then Uzziah became angry. He had a censer in his hand to burn incense, but while he was angry with the priests, leprosy broke out on his forehead in the presence of the priests in the house of the LORD, by the altar of incense.",
      "links": "<a href='/AIV/03/13/44'>Leviticus 13:44</a>; <a href='/AIV/04/12/10'>Numbers 12:10</a>",
      "comment": "Unlawful intrusion into sacred space led to judgment, with leprosy symbolizing separation from community. It also serves as a stark warning about the seriousness of profaning the sacred."
    },
    {
      "pk": 14026020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 20,
      "text": "Azariah the chief priest and all the priests looked at him, and behold, he was leprous on his forehead. They hurried him out, and he himself was eager to leave because the LORD had struck him.",
      "links": "<a href='/AIV/03/13/45-46'>Leviticus 13:45-46</a>",
      "comment": "Immediate exclusion due to leprosy reflects the need for purity before God. Sacred ministerial authority is shown here in the protection of the sanctuary and community."
    },
    {
      "pk": 14026021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 21,
      "text": "King Uzziah was a leper until the day of his death, and he lived in a separate house, excluded from the house of the LORD. Jotham his son was over the king’s household and governed the people of the land.",
      "links": "<a href='/AIV/12/15/5'>2 Kings 15:5</a>; <a href='/AIV/03/14/1-9'>Leviticus 14:1-9</a>",
      "comment": "Uzziah’s isolation due to leprosy hints at the cost of spiritual pride and underscores the necessity of sacramental reconciliation. The transfer of leadership prefigures the passing on of spiritual authority and continuity."
    },
    {
      "pk": 14026022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 22,
      "text": "Now the rest of the acts of Uzziah, from first to last, Isaiah the prophet, the son of Amoz, wrote.",
      "links": "<a href='/AIV/23/1/1'>Isaiah 1:1</a>; <a href='/AIV/12/15/6'>2 Kings 15:6</a>",
      "comment": "Reference to Isaiah the prophet connects this history with prophecy, showing how God's actions in history are interpreted and preserved by inspired witness (2 Peter 1:21)."
    },
    {
      "pk": 14026023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 26,
      "verse": 23,
      "text": "Uzziah slept with his fathers, and they buried him with his fathers in the field of burial that belonged to the kings, for they said, \"He is a leper.\" Then Jotham his son became king in his place.",
      "links": "<a href='/AIV/12/15/7'>2 Kings 15:7</a>; <a href='/AIV/14/27/1'>2Chr 27:1</a>",
      "comment": "Uzziah’s burial outside the royal tombs marks the enduring consequences of spiritual error. Yet, the succession of Jotham demonstrates restoration and continuity of rightful authority, echoing the principle of apostolic succession in spiritual governance."
    }
  ],
  "translatedAt": "2025-12-24T04:34:19.898Z"
}