{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 6,
  "verses": [
    {
      "pk": 14006001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 1,
      "text": "Then Solomon said, 'The LORD has said that he would dwell in thick darkness.'",
      "links": "<a href='/AIV/2/20/21'>Exod. 20:21</a>; <a href='/AIV/11/8/12'>1 Kgs. 8:12</a>",
      "comment": "Solomon begins his prayer by recalling God’s presence in the darkness at Sinai, emphasizing God's transcendence."
    },
    {
      "pk": 14006002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 2,
      "text": "'But I have indeed built you a dwelling, a house for you to abide in forever.'",
      "links": "<a href='/AIV/2/25/8'>Exod. 25:8</a>; <a href='/AIV/1/17/12'>1 Chr. 17:12</a>",
      "comment": "Solomon contrasts God's transcendence with the building of the temple, a place for God's presence among his people—a foreshadowing of the Incarnation (John 1:14)."
    },
    {
      "pk": 14006003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 3,
      "text": "Then the king turned around and blessed all the assembly of Israel, while all the assembly of Israel stood.",
      "links": "<a href='/AIV/1/29/20'>1 Chr. 29:20</a>; <a href='/AIV/11/8/14'>1 Kgs. 8:14</a>",
      "comment": "Solomon acts as both king and mediator, blessing the people—prefiguring Christ, the true mediator (1 Tim. 2:5)."
    },
    {
      "pk": 14006004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 4,
      "text": "He said, 'Blessed be the LORD, the God of Israel, who has by his hand fulfilled what he spoke with his mouth to David my father, saying,'",
      "links": "<a href='/AIV/10/7/5-16'>2 Sam. 7:5-16</a>",
      "comment": "Solomon credits God’s faithfulness in fulfilling His covenant with David, crucial to redemptive history and ultimately fulfilled in Christ."
    },
    {
      "pk": 14006005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 5,
      "text": "'From the day I brought my people out of the land of Egypt, I chose no city from all the tribes of Israel in which to build a house, that my name might be there, and I chose no man as prince over my people Israel;'",
      "links": "<a href='/AIV/9/11/8'>1 Sam. 11:8</a>; <a href='/AIV/10/7/6-7'>2 Sam. 7:6-7</a>",
      "comment": "God's choosing of both place (Jerusalem/Temple) and ruler underscores divine initiative—preparing for the ultimate King and worship in Spirit and truth (John 4:23)."
    },
    {
      "pk": 14006006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 6,
      "text": "'but I have chosen Jerusalem, that my name may be there, and I have chosen David to be over my people Israel.'",
      "links": "<a href='/AIV/1/28/4'>1 Chr. 28:4</a>",
      "comment": "God’s special election of Jerusalem anticipates it as the spiritual center in salvation history."
    },
    {
      "pk": 14006007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 7,
      "text": "'Now it was in the heart of David my father to build a house for the name of the LORD, the God of Israel.'",
      "links": "<a href='/AIV/1/17/1'>1 Chr. 17:1</a>; <a href='/AIV/10/7/2'>2 Sam. 7:2</a>",
      "comment": "The desire for a permanent place of worship reflects a heart after God—God valued David’s intent even more than the action."
    },
    {
      "pk": 14006008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 8,
      "text": "'But the LORD said to David my father, “You did well to have it in your heart to build a house for my name,”'",
      "links": "<a href='/AIV/11/8/18'>1 Kgs. 8:18</a>",
      "comment": "God honors David’s intention, another example that He sees the heart (1 Sam. 16:7)."
    },
    {
      "pk": 14006009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 9,
      "text": "'Nevertheless, you shall not build the house, but your son who will come from your body, he shall build the house for my name.'",
      "links": "<a href='/AIV/1/22/8-10'>1 Chr. 22:8-10</a>",
      "comment": "Solomon, as David's son, uniquely fulfills this, yet ultimately points to the Son of David—Jesus—who builds God’s church (Matt. 16:18)."
    },
    {
      "pk": 14006010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 10,
      "text": "'Now the LORD has fulfilled his word that he spoke, for I have arisen in the place of David my father and sit on the throne of Israel, as the LORD promised, and I have built the house for the name of the LORD, the God of Israel.'",
      "links": "<a href='/AIV/11/8/20'>1 Kgs. 8:20</a>",
      "comment": "Solomon’s enthronement and the Temple’s completion is a short-term fulfillment, with messianic overtones."
    },
    {
      "pk": 14006011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 11,
      "text": "'And there I have set the ark, in which is the covenant of the LORD that he made with the people of Israel.'",
      "links": "<a href='/AIV/2/25/21'>Exod. 25:21</a>; <a href='/AIV/2/40/20'>Exod. 40:20</a>",
      "comment": "The Ark in the Temple is the sign of God’s covenant presence—a prefiguration of God dwelling among His people in Christ (John 1:14)."
    },
    {
      "pk": 14006012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 12,
      "text": "Then he stood before the altar of the LORD in the presence of all the assembly of Israel and spread out his hands.",
      "links": "<a href='/AIV/3/9/26'>Lev. 9:26</a>; <a href='/AIV/11/8/22'>1 Kgs. 8:22</a>",
      "comment": "Solomon's posture indicates reverence and petition, anticipating priestly intercession."
    },
    {
      "pk": 14006013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 13,
      "text": "For Solomon had made a bronze platform five cubits long, five cubits wide and three cubits high, and had placed it in the midst of the court. He stood on it, then knelt down on his knees in the presence of all the assembly of Israel, spread out his hands toward heaven,",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>",
      "comment": "Solomon’s kneeling suggests deep humility and sets a precedent for physical expressions of prayer in worship."
    },
    {
      "pk": 14006014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 14,
      "text": "and said, 'O LORD, God of Israel, there is no God like you in heaven or on earth, keeping covenant and steadfast love for your servants who walk before you with all their heart,",
      "links": "<a href='/AIV/5/7/9'>Deut. 7:9</a>; <a href='/AIV/19/86/8'>Ps. 86:8</a>",
      "comment": "Solomon acknowledges God’s uniqueness and faithful love, paralleling themes found throughout the Psalms."
    },
    {
      "pk": 14006015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 15,
      "text": "you who have kept with your servant David my father what you declared to him. You spoke with your mouth and with your hand have fulfilled it, as it is this day.",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>",
      "comment": "God’s faithfulness in both word and action is central to Solomon’s prayer."
    },
    {
      "pk": 14006016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 16,
      "text": "'Now therefore, LORD, God of Israel, keep for your servant David my father what you have promised him, saying, “You shall never fail to have a man before me to sit on the throne of Israel, if only your sons pay attention to their way, to walk in my law as you have walked before me.”'",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/19/89/29-30'>Ps. 89:29-30</a>",
      "comment": "The enduring promise to David is both conditional in the short term (obedience) and unconditional in its messianic fulfillment."
    },
    {
      "pk": 14006017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 17,
      "text": "'Now therefore, O LORD, God of Israel, let your word be confirmed, which you have spoken to your servant David.'",
      "links": "<a href='/AIV/19/132/11'>Ps. 132:11</a>",
      "comment": "Solomon appeals to God's faithfulness, echoing themes of trust in God’s promises."
    },
    {
      "pk": 14006018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 18,
      "text": "'But will God indeed dwell with mankind on the earth? Behold, heaven and the highest heaven cannot contain you; how much less this house that I have built!'",
      "links": "<a href='/AIV/19/113/5-6'>Ps. 113:5-6</a>; <a href='/AIV/11/8/27'>1 Kgs. 8:27</a>",
      "comment": "Solomon recognizes the limitations of the Temple, anticipating the mystery of God dwelling among us in Christ (John 1:14)."
    },
    {
      "pk": 14006019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 19,
      "text": "'Yet have regard to the prayer of your servant and to his plea, O LORD my God, listening to the cry and to the prayer which your servant prays before you,",
      "links": "<a href='/AIV/19/17/6'>Ps. 17:6</a>",
      "comment": "Solomon humbly requests that God hear his intercession, reinforcing the power and necessity of prayer."
    },
    {
      "pk": 14006020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 20,
      "text": "that your eyes may be open day and night toward this house, the place where you have promised to put your name, to listen to the prayer that your servant offers toward this place.",
      "links": "<a href='/AIV/11/9/3'>1 Kgs. 9:3</a>",
      "comment": "Solomon emphasizes God’s continual presence and the privilege of praying toward the house dedicated to His Name."
    },
    {
      "pk": 14006021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 21,
      "text": "And listen to the pleas of your servant and of your people Israel, when they pray toward this place. May you hear from heaven, your dwelling place, and when you hear, forgive.",
      "links": "<a href='/AIV/19/5/7'>Ps. 5:7</a>; <a href='/AIV/19/130/4'>Ps. 130:4</a>",
      "comment": "Here is a powerful assurance of forgiveness tied to genuine prayer and repentance. Forgiveness flows from God’s presence among His people."
    },
    {
      "pk": 14006022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 22,
      "text": "'If anyone sins against his neighbor and is required to take an oath, and comes to swear before your altar in this house,",
      "links": "<a href='/AIV/3/6/3'>Lev. 6:3</a>",
      "comment": "Solomon references the role of the altar in oath-making, affirming God as the ultimate judge."
    },
    {
      "pk": 14006023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 23,
      "text": "then hear from heaven and act. Judge your servants, repaying the guilty by bringing his conduct on his own head, and vindicating the righteous by rewarding him according to his righteousness.",
      "links": "<a href='/AIV/19/18/20'>Ps. 18:20</a>; <a href='/AIV/5/25/1'>Deut. 25:1</a>",
      "comment": "God’s justice is central, and the invocation of reward for righteousness anticipates the final judgment."
    },
    {
      "pk": 14006024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 24,
      "text": "'If your people Israel are defeated before the enemy because they have sinned against you, but they turn again and acknowledge your name, pray and plead with you in this house,",
      "links": "<a href='/AIV/3/26/17'>Lev. 26:17</a>; <a href='/AIV/19/44/10'>Ps. 44:10</a>",
      "comment": "Repentance is key to restoration—a pattern that recurs throughout Scripture and is fulfilled in the call to conversion."
    },
    {
      "pk": 14006025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 25,
      "text": "then hear from heaven, forgive the sin of your people Israel, and bring them again to the land which you gave to them and to their fathers.",
      "links": "<a href='/AIV/5/30/5'>Deut. 30:5</a>",
      "comment": "God’s forgiveness brings not only spiritual but also tangible restoration—anticipating the full renewal in the Messiah."
    },
    {
      "pk": 14006026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 26,
      "text": "'When heaven is shut up and there is no rain because they have sinned against you, if they pray toward this place, and confess your name, and turn from their sin when you afflict them,",
      "links": "<a href='/AIV/5/11/17'>Deut. 11:17</a>; <a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "National crises become occasions for corporate repentance, reinforcing the depth of communal sin and the mercy of God."
    },
    {
      "pk": 14006027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 27,
      "text": "then hear in heaven and forgive the sin of your servants, your people Israel, when you teach them the good way in which they should walk, and send rain upon your land, which you have given to your people as an inheritance.",
      "links": "<a href='/AIV/19/25/8-9'>Ps. 25:8-9</a>",
      "comment": "Restoration comes not only through forgiveness but also guidance—hinting at the teaching ministry that will find its fullness in Christ (Matt. 28:20)."
    },
    {
      "pk": 14006028,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 28,
      "text": "'If there is famine in the land, if there is pestilence, if there is blight or mildew, locust or caterpillar; if their enemies besiege them in the land at their gates, whatever plague or whatever sickness there is,",
      "links": "<a href='/AIV/3/26/19-20'>Lev. 26:19-20</a>",
      "comment": "Solomon lists diverse afflictions, underlining the need for God’s help in all circumstances."
    },
    {
      "pk": 14006029,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 29,
      "text": "whatever prayer, whatever plea is made by any man or by all your people Israel, each knowing his own affliction and his own pain and stretching out his hands toward this house,",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "God cares for the individual and communal petitions, foreshadowing the intercessory power within worship."
    },
    {
      "pk": 14006030,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 30,
      "text": "then hear from heaven your dwelling place and forgive, and render to each whose heart you know, according to all his ways (for you alone know the hearts of the children of mankind),",
      "links": "<a href='/AIV/10/16/7'>1 Sam. 16:7</a>; <a href='/AIV/19/139/1-2'>Ps. 139:1-2</a>",
      "comment": "God’s omniscience and personalized justice are highlighted, foundational for understanding divine judgment and mercy."
    },
    {
      "pk": 14006031,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 31,
      "text": "that they may fear you and walk in your ways all the days that they live in the land that you gave to our fathers.",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>",
      "comment": "The goal of forgiveness and restoration is reverent obedience—a recurring biblical theme."
    },
    {
      "pk": 14006032,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 32,
      "text": "'Also concerning the foreigner, who is not of your people Israel but comes from a far country for the sake of your great name and your mighty hand and your outstretched arm, if he comes and prays toward this house,",
      "links": "<a href='/AIV/5/4/6-7'>Deut. 4:6-7</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "God’s house is a house of prayer for all nations (Isa. 56:7), signaling the universal scope of His salvation."
    },
    {
      "pk": 14006033,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 33,
      "text": "then hear from heaven your dwelling place, and do according to all for which the foreigner calls to you, in order that all the peoples of the earth may know your name and fear you, as do your people Israel, and that they may know that this house which I have built is called by your name.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>",
      "comment": "The mission to the nations is based in God’s universal name, fulfilled perfectly in the spread of the Gospel (Matt. 28:19)."
    },
    {
      "pk": 14006034,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 34,
      "text": "'If your people go out to battle against their enemies, by whatever way you send them, and they pray to you toward this city that you have chosen and the house that I have built for your name,",
      "links": "<a href='/AIV/1/5/20'>1 Chr. 5:20</a>",
      "comment": "Facing towards Jerusalem in prayer displays the centrality of worship and God’s chosen presence."
    },
    {
      "pk": 14006035,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 35,
      "text": "then hear from heaven their prayer and their plea, and uphold their cause.",
      "links": "<a href='/AIV/19/20/1-2'>Ps. 20:1-2</a>",
      "comment": "God’s intervention in the affairs of His people in response to prayer is a recurring biblical promise."
    },
    {
      "pk": 14006036,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 36,
      "text": "'If they sin against you—for there is no one who does not sin—and you are angry with them and give them over to an enemy, so that they are carried away captive to a land far or near,",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Solomon’s universal statement about sin lays the foundation for the doctrine of original sin."
    },
    {
      "pk": 14006037,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 37,
      "text": "yet if they come to their senses in the land to which they have been carried captive, and repent and plead with you in the land of their captivity, saying, “We have sinned, we have acted perversely and wickedly,”",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>; <a href='/AIV/27/9/5'>Dan. 9:5</a>",
      "comment": "Genuine contrition expressed here anticipates New Testament teaching on repentance (Luke 15:17-18)."
    },
    {
      "pk": 14006038,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 38,
      "text": "if they turn with all their heart and with all their soul in the land of their captivity where they have been carried captive, and pray toward their land, which you gave to their fathers, the city that you have chosen and the house that I have built for your name,",
      "links": "<a href='/AIV/5/30/2'>Deut. 30:2</a>",
      "comment": "Wholehearted conversion is required; even in exile, God’s mercy is available to the penitent."
    },
    {
      "pk": 14006039,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 39,
      "text": "then hear from heaven, your dwelling place, their prayer and their pleas, and maintain their cause and forgive your people who have sinned against you.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Forgiveness after exile reveals God’s ongoing willingness to restore His repentant people."
    },
    {
      "pk": 14006040,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 40,
      "text": "Now, O my God, let your eyes be open and your ears attentive to the prayer offered in this place.",
      "links": "<a href='/AIV/11/8/52'>1 Kgs. 8:52</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "Echoes earlier prayer, emphasizing God’s continual presence and attentiveness."
    },
    {
      "pk": 14006041,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 41,
      "text": "And now arise, O LORD God, and come to your resting place, you and the ark of your might. Let your priests, O LORD God, be clothed with salvation, and let your faithful people rejoice in what is good.",
      "links": "<a href='/AIV/19/132/8-9'>Ps. 132:8-9</a>",
      "comment": "Priestly ministry is at the heart of Temple worship. Priestly garments point to spiritual realities later fulfilled in the high priestly ministry of Christ (Heb. 4:14)."
    },
    {
      "pk": 14006042,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 6,
      "verse": 42,
      "text": "O LORD God, do not turn away the face of your anointed one. Remember your steadfast love for David your servant.",
      "links": "<a href='/AIV/19/132/10'>Ps. 132:10</a>",
      "comment": "The 'anointed' refers to the king (Messiah), with a view toward God’s eternal promise to David—pointing to the true Christ, the Son of David."
    }
  ],
  "translatedAt": "2025-12-24T04:24:32.510Z"
}