{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 10,
  "verses": [
    {
      "pk": 14010001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 1,
      "text": "Rehoboam went to Shechem, for all Israel had come to Shechem to make him king.",
      "links": "<a href='/AIV/11/12/1'>1 Kings 12:1</a>",
      "comment": "Shechem was historically a central and significant location for the tribes of Israel (see Genesis 12:6; Joshua 24:1). The gathering of 'all Israel' underscores the united expectation of the people for their king."
    },
    {
      "pk": 14010002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 2,
      "text": "When Jeroboam son of Nebat heard of this—for he was in Egypt, where he had fled from King Solomon—he returned from Egypt.",
      "links": "<a href='/AIV/11/11/40'>1 Kings 11:40</a>;<a href='/AIV/11/12/2'>1 Kings 12:2</a>",
      "comment": "Jeroboam's return fulfills the prophetic word about the division of the kingdom (see 1 Kings 11:29–39). The Divine Providence works even through exile and political movements."
    },
    {
      "pk": 14010003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 3,
      "text": "They sent for him, and Jeroboam and all Israel came and spoke to Rehoboam, saying,",
      "links": "<a href='/AIV/11/12/3'>1 Kings 12:3</a>",
      "comment": "The united act of sending for Jeroboam reveals his rising influence and the people's readiness to seek change in leadership."
    },
    {
      "pk": 14010004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 4,
      "text": "'Your father made our yoke heavy. Now therefore, lighten the hard labor and the heavy yoke he put on us, and we will serve you.'",
      "links": "<a href='/AIV/11/12/4'>1 Kings 12:4</a>",
      "comment": "The plea for relief reflects burdensome policies under Solomon. This passage explores the nature of just leadership and compassion; it can be linked spiritually to Christ’s teaching about His yoke being easy (Matt. 11:29–30)."
    },
    {
      "pk": 14010005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 5,
      "text": "He said to them, 'Come back to me in three days.' So the people departed.",
      "links": "<a href='/AIV/11/12/5'>1 Kings 12:5</a>",
      "comment": "Three days often symbolizes a period of discernment or testing in Scripture (see Jonah 1:17; Matthew 12:40)."
    },
    {
      "pk": 14010006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 6,
      "text": "Then King Rehoboam consulted the elders who had served his father Solomon, saying, 'How do you advise me to answer these people?'",
      "links": "<a href='/AIV/11/12/6'>1 Kings 12:6</a>",
      "comment": "Seeking counsel from elders emphasizes the biblical value of tradition and wisdom handed down (see Proverbs 11:14, Hebrews 13:7). This points to the importance of apostolic succession in leadership and teaching."
    },
    {
      "pk": 14010007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 7,
      "text": "They answered, 'If you will be kind to these people and please them, speaking good words to them, they will be your servants forever.'",
      "links": "<a href='/AIV/11/12/7'>1 Kings 12:7</a>",
      "comment": "The elders' advice is rooted in humility and service—a concept Jesus later perfected as the true Servant King (Mark 10:45; John 13:14-15)."
    },
    {
      "pk": 14010008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 8,
      "text": "But he rejected the advice of the elders and consulted the young men who had grown up with him and were now attending him.",
      "links": "<a href='/AIV/11/12/8'>1 Kings 12:8</a>",
      "comment": "Rejecting traditional wisdom can lead to division. This contrasts with the value of continuity in Apostolic teaching and authority (2 Thess. 2:15; 2 Tim. 2:2)."
    },
    {
      "pk": 14010009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 9,
      "text": "'He asked them, \"What is your advice? How should we answer these people who have said to me, 'Lighten the yoke your father put on us'?\" '",
      "links": "<a href='/AIV/11/12/9'>1 Kings 12:9</a>",
      "comment": "The king’s choice to seek multiple counsels is not wrong, but his failure was ignoring wise tradition for peer opinion—a timeless warning for the Church."
    },
    {
      "pk": "AIV",
      "translation": 14,
      "book": "2 Chronicles",
      "bookName": "2Chr",
      "bookAbbreviation": 10,
      "chapter": 16,
      "verse": "When all Israel saw that the king would not listen to them, the people answered the king, 'What share do we have in David? We have no inheritance in the son of Jesse. Everyone to your tents, O Israel! Look after your own house, O David!' And all Israel departed to their tents.",
      "text": "<a href='/AIV/11/12/15'>1 Kings 12:15</a>; <a href='/AIV/11/11/29-31'>1 Kings 11:29-31</a>",
      "'Your father made our yoke heavy, but you make it lighter for us'—say to them, 'My little finger is thicker than my father's loins!''\"'\"": "links",
      "<a href='/AIV/11/12/10'>1 Kings 12:10</a>": "comment",
      "The young men respond with arrogant rhetoric, suggesting even harsher rule. This foreshadows division when true authority and pastoral care are rejected in favor of prideful leadership (see James 3:13-18; Ezekiel 34:2-4).": 14010011,
      "links": "<a href='/AIV/11/12/16'>1 Kings 12:16</a>; <a href='/AIV/10/20/1'>2 Samuel 20:1</a>",
      "comment": "This complaint echoes earlier rifts in Israel's history. The Davidic monarchy had a universal significance—Jesus ultimately fulfills the true, undivided reign over God's people (Luke 1:32-33; Acts 2:30-36)."
    },
    {
      "pk": 14010017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 17,
      "text": "But as for the Israelites who lived in the cities of Judah, Rehoboam still reigned over them.",
      "links": "<a href='/AIV/11/12/17'>1 Kings 12:17</a>",
      "comment": "A faithful remnant remains under Rehoboam—a pattern of God preserving a people even through schism, with hints towards the importance of visible unity under rightful authority (see Romans 11:5)."
    },
    {
      "pk": 14010018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 18,
      "text": "Then King Rehoboam sent Hadoram, who was in charge of forced labor, but the Israelites stoned him to death. King Rehoboam quickly mounted his chariot and fled to Jerusalem.",
      "links": "<a href='/AIV/11/12/18'>1 Kings 12:18</a>",
      "comment": "Violent rejection of Hadoram shows the depth of the rupture. Historically, forced labor was a grievance, but spiritually, God's people must not be driven apart by oppression (Ezekiel 34:4)."
    },
    {
      "pk": 14010019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 10,
      "verse": 19,
      "text": "So Israel has been in rebellion against the house of David to this day.",
      "links": "<a href='/AIV/11/12/19'>1 Kings 12:19</a>",
      "comment": "This summarizes the enduring division of God's people—a division finally reconciled in Christ, the true Son of David, who calls all nations to unity and one faith (John 17:20-23; Eph. 2:14-16)."
    }
  ],
  "translatedAt": "2025-12-24T04:26:44.806Z"
}