{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 28,
  "verses": [
    {
      "pk": 2802801,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 1,
      "text": "Ahaz was twenty years old when he became king, and he reigned sixteen years in Jerusalem. He did not do what was right in the sight of the LORD, as his ancestor David had done.",
      "links": "<a href='/AIV/12/16/2'>2 Kings 16:2</a>; <a href='/AIV/14/27/2'>2 Chronicles 27:2</a>",
      "comment": "Maintains 'did not do what was right' from Hebrew idiom."
    },
    {
      "pk": 2802802,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 2,
      "text": "Instead, he walked in the ways of the kings of Israel, and even made molten images for the Baals.",
      "links": "<a href='/AIV/11/12/28'>1 Kings 12:28</a>; <a href='/AIV/14/21/6'>2 Chronicles 21:6</a>",
      "comment": "'Molten images' translates the term for cast metal idols."
    },
    {
      "pk": 2802803,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 3,
      "text": "He burned incense in the Valley of Ben Hinnom and burned his sons with fire, according to the abominations of the nations whom the LORD had driven out before the people of Israel.",
      "links": "<a href='/AIV/03/18/21'>Leviticus 18:21</a>; <a href='/AIV/12/16/3'>2 Kings 16:3</a>",
      "comment": "'Burned his sons with fire' refers to child sacrifice."
    },
    {
      "pk": 2802804,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 4,
      "text": "He sacrificed and burned incense on the high places, on the hills, and under every green tree.",
      "links": "<a href='/AIV/11/14/23'>1 Kings 14:23</a>; <a href='/AIV/12/16/4'>2 Kings 16:4</a>",
      "comment": "High places were locations of illegitimate worship."
    },
    {
      "pk": 2802805,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 5,
      "text": "Therefore, the LORD his God handed him over to the king of Aram, who defeated him and took many captives to Damascus. He was also given into the hand of the king of Israel, who struck him with a great blow.",
      "links": "<a href='/AIV/23/7/1'>Isaiah 7:1</a>; <a href='/AIV/12/16/5'>2 Kings 16:5</a>",
      "comment": "'Handed him over' uses Hebrew phrase for God allowing defeat."
    },
    {
      "pk": 2802806,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 6,
      "text": "Pekah the son of Remaliah killed one hundred and twenty thousand in Judah in one day, all brave men, because they had forsaken the LORD, the God of their fathers.",
      "links": "<a href='/AIV/12/15/27'>2 Kings 15:27</a>; <a href='/AIV/23/9/21'>Isaiah 9:21</a>",
      "comment": "Large number reflects Hebrew usage and literary emphasis."
    },
    {
      "pk": 2802807,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 7,
      "text": "Zichri, a mighty man of Ephraim, killed Maaseiah the king's son, Azrikam the overseer of the palace, and Elkanah, the next in authority to the king.",
      "links": "<a href='/AIV/13/11/11'>1 Chronicles 11:11</a>",
      "comment": "Titles kept close to Hebrew for clarity."
    },
    {
      "pk": 2802808,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 8,
      "text": "The people of Israel took captive two hundred thousand of their relatives—women, sons, and daughters. They also took a great deal of plunder from them and brought it to Samaria.",
      "links": "<a href='/AIV/14/11/4'>2 Chronicles 11:4</a>",
      "comment": "'Relatives' translates 'brothers,' referring to fellow Israelites."
    },
    {
      "pk": 2802809,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 9,
      "text": "But a prophet of the LORD was there, named Oded. He went out to meet the army coming to Samaria and said to them, “Because the LORD, the God of your fathers, was angry with Judah, he handed them over to you. But you have slaughtered them in a rage that has reached up to heaven.",
      "links": "<a href='/AIV/11/18/13'>1 Kings 18:13</a>",
      "comment": "'Reached up to heaven' is a Hebrew idiom for excessive wrongdoing."
    },
    {
      "pk": 2802810,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 10,
      "text": "Now you intend to enslave the people of Judah and Jerusalem as your male and female slaves. But are you yourselves not also guilty before the LORD your God?",
      "links": "<a href='/AIV/03/25/39'>Leviticus 25:39</a>; <a href='/AIV/14/6/37'>2 Chronicles 6:37</a>",
      "comment": "Ensures a direct reference to enslaving kin."
    },
    {
      "pk": 2802811,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 11,
      "text": "Now listen to me! Send back the captives you have taken from your relatives, for the LORD’s fierce anger is upon you.",
      "links": "<a href='/AIV/14/19/2'>2 Chronicles 19:2</a>",
      "comment": "Hebrew 'return the captives' paraphrased for clarity."
    },
    {
      "pk": 2802812,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 12,
      "text": "Then some of the chief men of the people of Ephraim—Azariah the son of Johanan, Berechiah the son of Meshillemoth, Jehizkiah the son of Shallum, and Amasa the son of Hadlai—stood up against those coming from the war.",
      "links": "<a href='/AIV/14/19/8'>2 Chronicles 19:8</a>",
      "comment": "Names and structure retained as in Hebrew."
    },
    {
      "pk": 2802813,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 13,
      "text": "They said to them, “Do not bring the captives here, for you are planning to bring on us guilt before the LORD, adding to our sins and guilt. For our guilt is already great, and there is fierce wrath against Israel.”",
      "links": "<a href='/AIV/03/19/17'>Leviticus 19:17</a>",
      "comment": "'Planning to bring on us guilt' is close to Hebrew wording."
    },
    {
      "pk": 2802814,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 14,
      "text": "So the armed men left the captives and the plunder before the officials and all the assembly.",
      "links": "<a href='/AIV/04/31/48'>Numbers 31:48-54</a>",
      "comment": "Assembly here refers to the gathered people."
    },
    {
      "pk": 2802815,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 15,
      "text": "Then the men who were mentioned by name got up, took the captives, and with the plunder clothed all who were naked among them. They gave them clothes and sandals, food and drink, and anointed them. They led all the weak among them on donkeys and brought them to their relatives at Jericho, the city of palms. Then they returned to Samaria.",
      "links": "<a href='/AIV/06/6/26'>Joshua 6:26</a>; <a href='/AIV/42/10/34'>Luke 10:34</a>",
      "comment": "'City of palms' is a phrase for Jericho per Hebrew idiom."
    },
    {
      "pk": 2802816,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 16,
      "text": "At that time King Ahaz sent to the kings of Assyria for help.",
      "links": "<a href='/AIV/12/16/7'>2 Kings 16:7</a>",
      "comment": "'Kings' plural matches some manuscripts, reference is to king of Assyria."
    },
    {
      "pk": 2802817,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 17,
      "text": "For again the Edomites had come and attacked Judah and carried away captives.",
      "links": "<a href='/AIV/14/21/8'>2 Chronicles 21:8</a>",
      "comment": "'Again' reflects repeated attacks per context."
    },
    {
      "pk": 2802818,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 18,
      "text": "The Philistines also had raided the cities of the lowland and the Negev of Judah, and had captured Beth Shemesh, Aijalon, Gederoth, Soco with its villages, Timnah with its villages, Gimzo with its villages, and they settled there.",
      "links": "<a href='/AIV/14/17/11'>2 Chronicles 17:11</a>",
      "comment": "City list kept as in Hebrew with 'villages.'"
    },
    {
      "pk": 2802819,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 19,
      "text": "For the LORD humbled Judah because of Ahaz king of Israel, for he had caused Judah to act without restraint and had been very unfaithful to the LORD.",
      "links": "<a href='/AIV/12/16/10'>2 Kings 16:10-18</a>",
      "comment": "'Act without restraint' translates phrase for moral chaos."
    },
    {
      "pk": 2802820,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 20,
      "text": "So Tiglath-Pileser king of Assyria came against him and oppressed him instead of strengthening him.",
      "links": "<a href='/AIV/12/16/7'>2 Kings 16:7-9</a>",
      "comment": "Uses historical name as in original."
    },
    {
      "pk": 2802821,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 21,
      "text": "Even though Ahaz took some things from the house of the LORD, from the palace of the king, and from the princes, and gave them to the king of Assyria, it did not help him.",
      "links": "<a href='/AIV/12/16/8'>2 Kings 16:8</a>",
      "comment": "Emphasizes the futility of Ahaz’s bribe."
    },
    {
      "pk": 2802822,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 22,
      "text": "In the time of his distress, this same King Ahaz acted even more unfaithfully toward the LORD.",
      "links": "<a href='/AIV/14/28/19'>2 Chronicles 28:19</a>",
      "comment": "Keeps the Hebrew word order for emphasis."
    },
    {
      "pk": 2802823,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 23,
      "text": "For he sacrificed to the gods of Damascus that had defeated him, saying, \"Because the gods of the kings of Aram helped them, I will sacrifice to them so that they may help me.\" But they were the ruin of him and of all Israel.",
      "links": "<a href='/AIV/12/16/12'>2 Kings 16:12-13</a>",
      "comment": "Keeps quotation and explains the logic of Ahaz’s error."
    },
    {
      "pk": 2802824,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 24,
      "text": "Ahaz gathered together the vessels of the house of God, and cut in pieces the vessels of the house of God. He shut up the doors of the house of the LORD and made for himself altars in every corner of Jerusalem.",
      "links": "<a href='/AIV/12/16/17'>2 Kings 16:17-18</a>",
      "comment": "Matches Hebrew for destruction of sacred items."
    },
    {
      "pk": 2802825,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 25,
      "text": "In every city of Judah he made high places to burn incense to other gods, and provoked the LORD, the God of his fathers, to anger.",
      "links": "<a href='/AIV/14/33/17'>2 Chronicles 33:17</a>",
      "comment": "'Provoked to anger' keeps Hebrew phrase for God's response."
    },
    {
      "pk": 2802826,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 26,
      "text": "Now the rest of his acts and all his ways, from first to last, are written in the Book of the Kings of Judah and Israel.",
      "links": "<a href='/AIV/12/16/19'>2 Kings 16:19</a>",
      "comment": "'Book of the Kings of Judah and Israel' as per Hebrew."
    },
    {
      "pk": 2802827,
      "translation": "AIV",
      "book": 14,
      "chapter": 28,
      "verse": 27,
      "text": "So Ahaz slept with his fathers, and they buried him in the city, in Jerusalem, but they did not bring him into the tombs of the kings of Israel. His son Hezekiah became king in his place.",
      "links": "<a href='/AIV/12/16/20'>2 Kings 16:20</a>",
      "comment": "'Slept with his fathers' keeps standard Hebrew euphemism for death."
    }
  ],
  "translatedAt": "2025-12-22T11:08:09.838Z"
}