{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 22,
  "verses": [
    {
      "pk": 1933500,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 1,
      "text": "The people of Jerusalem made Ahaziah, his youngest son, king in his place, because the raiding party that came with the Arabians to the camp had killed all the older sons. So Ahaziah son of Jehoram became king of Judah.",
      "links": "<a href='/AIV/14/21/17'>2 Chr. 21:17</a>; <a href='/AIV/12/8/24'>2 Kgs. 8:24</a>",
      "comment": "Faithful rendering; preserves reason for Ahaziah's selection."
    },
    {
      "pk": 1933501,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 2,
      "text": "Ahaziah was twenty-two years old when he became king, and he reigned one year in Jerusalem. His mother’s name was Athaliah, a granddaughter of Omri.",
      "links": "<a href='/AIV/12/8/26'>2 Kgs. 8:26</a>",
      "comment": "Age given as 22 per most Hebrew manuscripts; some versions read 42."
    },
    {
      "pk": 1933502,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 3,
      "text": "He also walked in the ways of Ahab’s house, because his mother advised him to act wickedly.",
      "links": "<a href='/AIV/12/8/27'>2 Kgs. 8:27</a>",
      "comment": "Consistent with original; 'advised to act wickedly' matches common rendering."
    },
    {
      "pk": 1933503,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 4,
      "text": "He did what was evil in the sight of the LORD, like the house of Ahab, for after his father’s death they were his counselors, to his destruction.",
      "links": "<a href='/AIV/12/8/27'>2 Kgs. 8:27</a>",
      "comment": "‘To his destruction’ reflects intent of Hebrew, showing resulting consequence."
    },
    {
      "pk": 1933504,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 5,
      "text": "He also followed their counsel and went with Joram the son of Ahab, king of Israel, to fight against Hazael king of Aram at Ramoth Gilead. The Arameans wounded Joram.",
      "links": "<a href='/AIV/12/8/28'>2 Kgs. 8:28</a>",
      "comment": "‘Aram’ is the modern equivalent for ‘Syria’ in many translations."
    },
    {
      "pk": 1933505,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 6,
      "text": "Joram returned to Jezreel to recover from the wounds the Arameans had given him at Ramah when he fought against Hazael king of Aram. Ahaziah the son of Jehoram, king of Judah, went down to Jezreel to visit Joram son of Ahab, because he was wounded.",
      "links": "<a href='/AIV/12/8/29'>2 Kgs. 8:29</a>",
      "comment": "Follows original structure closely; place names preserved."
    },
    {
      "pk": 1933506,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 7,
      "text": "Now through God’s will the downfall of Ahaziah was brought about by his visit to Joram. When he arrived, he went out with Joram to meet Jehu the son of Nimshi, whom the LORD had anointed to destroy the house of Ahab.",
      "links": "<a href='/AIV/12/9/21'>2 Kgs. 9:21</a>",
      "comment": "'Through God's will' restates Hebrew for clarity in modern English."
    },
    {
      "pk": 1933507,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 8,
      "text": "As Jehu was executing judgment on the house of Ahab, he found the leaders of Judah and the sons of Ahaziah’s relatives, who were attending to Ahaziah, and killed them.",
      "links": "<a href='/AIV/12/10/12-14'>2 Kgs. 10:12–14</a>",
      "comment": "‘Leaders’ interprets ‘princes’; ‘attending to’ is modern phrase for ‘serving’."
    },
    {
      "pk": 1933508,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 9,
      "text": "He searched for Ahaziah, and they captured him while he was hiding in Samaria. They brought him to Jehu and put him to death. They buried him, for they said, “He is the grandson of Jehoshaphat, who sought the LORD with all his heart.” So there was no one left in the house of Ahaziah who could rule.",
      "links": "<a href='/AIV/12/9/27-28'>2 Kgs. 9:27–28</a>; <a href='/AIV/14/17/4'>2 Chr. 17:4</a>",
      "comment": "Clarity added in phrase 'house of Ahaziah who could rule.'"
    },
    {
      "pk": 1933509,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 10,
      "text": "When Athaliah, the mother of Ahaziah, saw that her son was dead, she arose and destroyed all the royal heirs of the house of Judah.",
      "links": "<a href='/AIV/12/11/1'>2 Kgs. 11:1</a>",
      "comment": "‘Destroyed’ is the standard translation for the Hebrew ‘to put to death’."
    },
    {
      "pk": 1933510,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 11,
      "text": "But Jehosheba, the daughter of the king, took Joash, the son of Ahaziah, and stole him away from among the king’s sons who were being killed, and put him and his nurse in a bedroom. So Jehosheba, the daughter of King Jehoram and wife of Jehoiada the priest (for she was Ahaziah’s sister), hid him from Athaliah so she did not kill him.",
      "links": "<a href='/AIV/12/11/2'>2 Kgs. 11:2</a>",
      "comment": "Expanded for clarity on relationships per Hebrew."
    },
    {
      "pk": 1933511,
      "translation": "AIV",
      "book": 14,
      "chapter": 22,
      "verse": 12,
      "text": "He was hidden with them in the house of God for six years, while Athaliah reigned over the land.",
      "links": "<a href='/AIV/12/11/3'>2 Kgs. 11:3</a>",
      "comment": "‘House of God’ translates the Hebrew for Temple."
    }
  ],
  "translatedAt": "2025-12-22T11:05:46.465Z"
}