{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 34,
  "verses": [
    {
      "pk": 14034001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 1,
      "text": "Josiah was eight years old when he became king, and he reigned in Jerusalem for thirty-one years.",
      "links": "<a href='/AIV/12/22/1'>2 Kings 22:1</a>",
      "comment": "Josiah's early age as king emphasizes God's ability to work through all people, regardless of age. His long reign foreshadows the reign of Christ (Isaiah 9:7)."
    },
    {
      "pk": 14034002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 2,
      "text": "He did what was right in the eyes of the LORD and walked in the ways of his ancestor David. He did not turn aside to the right or the left.",
      "links": "<a href='/AIV/11/15/5'>1 Kings 15:5</a>; <a href='/AIV/19/119/3'>Psalm 119:3</a>",
      "comment": "The straight path echoes the theme of obedience and faithfulness (Deut. 5:32). David is the model of kingship, ultimately fulfilled in Christ."
    },
    {
      "pk": 14034003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 3,
      "text": "In the eighth year of his reign, while he was still young, he began to seek the God of his father David. In the twelfth year, he began to cleanse Judah and Jerusalem of the high places, the Asherah poles, carved idols, and cast images.",
      "links": "<a href='/AIV/19/22/10'>Psalm 22:10</a>; <a href='/AIV/7/6/25'>Judges 6:25</a>",
      "comment": "Josiah's pursuit of God at a young age shows the importance of early devotion. His cleansing work reflects the role of spiritual discipline and purification, foreshadowing New Covenant sanctification."
    },
    {
      "pk": 14034004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 4,
      "text": "They broke down the altars of the Baals in his presence. He cut down the incense altars that were above them and smashed the Asherah poles, the carved idols, and cast images to pieces, scattering them on the graves of those who had sacrificed to them.",
      "links": "<a href='/AIV/2/23/24'>Exodus 23:24</a>; <a href='/AIV/28/10/2'>Hosea 10:2</a>",
      "comment": "The destruction of idols and altars is a clear call to remove sin from the community. The scattering on graves is an act of defilement, signifying the seriousness of idolatry."
    },
    {
      "pk": 14034005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 5,
      "text": "He burned the bones of the priests on their altars, so he cleansed Judah and Jerusalem.",
      "links": "<a href='/AIV/12/23/16-20'>2 Kings 23:16-20</a>",
      "comment": "By burning the bones, Josiah profoundly purifies the land, signifying a complete break from former idolatrous practices—a type of total spiritual renewal."
    },
    {
      "pk": 14034006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 6,
      "text": "In the cities of Manasseh, Ephraim, Simeon, and as far as Naphtali, in their ruins all around,",
      "links": "<a href='/AIV/14/15/9'>2 Chr. 15:9</a>",
      "comment": "Josiah's reforms extend beyond Judah, indicating a desire for unity among God’s people, prefiguring the gathering together of all believers."
    },
    {
      "pk": 14034007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 7,
      "text": "he broke down the altars and Asherah poles, smashed the idols to powder, and cut to pieces all the incense altars throughout all the land of Israel. Then he returned to Jerusalem.",
      "links": "<a href='/AIV/12/23/15'>2 Kings 23:15</a>",
      "comment": "Josiah’s return to Jerusalem signals a centering on true worship, foreshadowing the restoration and unity of worship in the New Covenant."
    },
    {
      "pk": 14034008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 8,
      "text": "In the eighteenth year of his reign, when he had purified the land and the house, he sent Shaphan son of Azaliah, Maaseiah governor of the city, and Joah son of Joahaz the recorder, to repair the house of the LORD his God.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>",
      "comment": "The focus on repairing the temple points to the importance of sacred spaces and right worship, both physically and spiritually."
    },
    {
      "pk": 14034009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 9,
      "text": "They came to Hilkiah the high priest, and gave him the money that had been brought into the house of God, which the Levites, the keepers of the door, had gathered from Manasseh and Ephraim, and from the entire remnant of Israel, as well as from all Judah, Benjamin, and the inhabitants of Jerusalem.",
      "links": "<a href='/AIV/3/27/30'>Leviticus 27:30</a>; <a href='/AIV/12/12/4'>2 Kings 12:4</a>",
      "comment": "The levitical role and the stewardship of offerings emphasize the continuity of sacred tradition and the importance of authority in spiritual matters."
    },
    {
      "pk": 14034010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 10,
      "text": "They delivered it into the hands of the workmen who had the oversight of the house of the LORD. These gave it to the workers who did the work in the house of the LORD, repairing and restoring the temple.",
      "links": "<a href='/AIV/12/12/11-14'>2 Kings 12:11-14</a>",
      "comment": "Proper stewardship and restoration of sacred places highlights the value of maintaining liturgical and communal worship."
    },
    {
      "pk": 14034011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 11,
      "text": "They gave it to the craftsmen and builders to buy cut stone and timber for beams, and for flooring the buildings which the kings of Judah had let go to ruin.",
      "links": "<a href='/AIV/16/2/8'>Nehemiah 2:8</a>",
      "comment": "The specific details show a concern not just for function but for beauty and order in worship, reflecting the principle that God is glorified by the best offerings."
    },
    {
      "pk": 14034012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 12,
      "text": "The men did the work faithfully. Over them were appointed Jahath and Obadiah, Levites of the sons of Merari, and Zechariah and Meshullam, of the sons of the Kohathites, to have oversight. The Levites, all who were skilled with instruments of music,",
      "links": "<a href='/AIV/13/6/31-48'>1 Chr. 6:31-48</a>",
      "comment": "The role of oversight, music, and Levites here shows the value of service, hierarchy, and liturgical worship in spiritual life."
    },
    {
      "pk": 14034013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 13,
      "text": "were over the burden-bearers and supervised all who did the work in every kind of service. Some of the Levites were scribes, officers, and gatekeepers.",
      "links": "<a href='/AIV/13/23/4'>1 Chr. 23:4</a>",
      "comment": "Different ministries and roles support the functioning of the whole community—a sign of the spiritual gifts in the body of Christ (cf. 1 Cor. 12:4-7)."
    },
    {
      "pk": 14034014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 14,
      "text": "While they were bringing out the money that had been brought into the house of the LORD, Hilkiah the priest found the Book of the Law of the LORD given by Moses.",
      "links": "<a href='/AIV/12/22/8'>2 Kings 22:8</a>; <a href='/AIV/5/31/24-26'>Deut. 31:24-26</a>",
      "comment": "The rediscovery of the Law shows the abiding authority of God’s revelation and the central role of sacred Scripture for guiding God’s people."
    },
    {
      "pk": 14034015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 15,
      "text": "Then Hilkiah said to Shaphan the scribe, 'I have found the Book of the Law in the house of the LORD.' Hilkiah gave the book to Shaphan.",
      "links": "<a href='/AIV/12/22/10'>2 Kings 22:10</a>",
      "comment": "Scripture is handed on through trusted leaders—showing the importance of faithful transmission and interpretation."
    },
    {
      "pk": 14034016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 16,
      "text": "Shaphan brought the book to the king, and reported to the king, 'All that was committed to your servants, they are doing.'",
      "links": "<a href='/AIV/12/22/9-10'>2 Kings 22:9-10</a>",
      "comment": "Obedience to the king’s commands is seen, paralleling the theme of obedience to Christ as the true king."
    },
    {
      "pk": 14034017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 17,
      "text": "'They have poured out the money that was found in the house of the LORD and have put it into the hands of those who oversee and do the work.'",
      "links": "<a href='/AIV/12/12/11'>2 Kings 12:11</a>",
      "comment": "Stewardship and accountability in the use of offerings is commended—mirroring the virtue of transparency and honesty in spiritual leadership."
    },
    {
      "pk": 14034018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 18,
      "text": "Then Shaphan the scribe told the king, 'Hilkiah the priest has given me a book.' And Shaphan read it aloud before the king.",
      "links": "<a href='/AIV/12/22/10'>2 Kings 22:10</a>",
      "comment": "Proclamation of the Word to the king highlights the necessity of public reading and hearing of Scripture."
    },
    {
      "pk": 14034019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 19,
      "text": "When the king heard the words of the Law, he tore his clothes.",
      "links": "<a href='/AIV/12/22/11'>2 Kings 22:11</a>; <a href='/AIV/18/1/20'>Job 1:20</a>",
      "comment": "Tearing clothes is a sign of repentance and grief. The Word convicts hearts, pointing toward the call to penance."
    },
    {
      "pk": 14034020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 20,
      "text": "The king commanded Hilkiah, Ahikam son of Shaphan, Abdon son of Micah, Shaphan the scribe, and Asaiah, the king’s servant, saying,",
      "links": "<a href='/AIV/12/22/12'>2 Kings 22:12</a>",
      "comment": "The king’s gathering of leaders to seek God’s guidance reflects the unity and authority needed for interpreting divine revelation."
    },
    {
      "pk": 14034021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 21,
      "text": "'Go, inquire of the LORD for me and for those who are left in Israel and Judah, concerning the words of this book that has been found. For great is the wrath of the LORD that is poured out on us, because our ancestors have not kept the word of the LORD, to do according to all that is written in this book.'",
      "links": "<a href='/AIV/5/28/15-68'>Deut. 28:15-68</a>; <a href='/AIV/2/32/33'>Ex. 32:33</a>",
      "comment": "Seeking God’s direction in community matters shows both humility and the significance of consulting authorized spiritual mediators."
    },
    {
      "pk": 14034022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 22,
      "text": "So Hilkiah and those the king had designated went to Huldah the prophetess, the wife of Shallum son of Tokhath, son of Hasrah, keeper of the wardrobe; she lived in Jerusalem in the Second Quarter. They spoke to her about this.",
      "links": "<a href='/AIV/12/22/14'>2 Kings 22:14</a>",
      "comment": "Huldah’s role as prophetess is notable. Though rare, God sometimes chooses women for prophetic ministry in sacred history. The seeking of the prophet reflects tradition and liturgical mediation."
    },
    {
      "pk": 14034023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 23,
      "text": "She said to them, 'This is what the LORD, the God of Israel, says: Tell the man who sent you to me,",
      "links": "<a href='/AIV/12/22/15'>2 Kings 22:15</a>",
      "comment": "God answers through appointed messengers, reinforcing the concept of authoritative, divinely appointed intermediaries."
    },
    {
      "pk": 14034024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 24,
      "text": "'This is what the LORD says: I am about to bring disaster on this place and its people—all the curses written in the book that have been read before the king of Judah—'",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "The spoken curse refers to covenant consequences—the justice of God against sin, a grave reality replaced by the grace offered in the New Covenant through Christ’s sacrifice."
    },
    {
      "pk": 14034025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 25,
      "text": "'because they have forsaken me and burned incense to other gods, provoking me to anger with all that their hands have made. My wrath will be poured out on this place and will not be quenched.'",
      "links": "<a href='/AIV/19/78/58'>Psalm 78:58</a>; <a href='/AIV/24/7/20'>Jer. 7:20</a>",
      "comment": "Idolatry’s serious consequences are here made explicit—reminding believers to guard against spiritual compromise."
    },
    {
      "pk": 14034026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 26,
      "text": "'But to the king of Judah who sent you to inquire of the LORD, say this: This is what the LORD, the God of Israel, says concerning the words you have heard:",
      "links": "<a href='/AIV/12/22/18'>2 Kings 22:18</a>",
      "comment": "God’s personalization of His response shows the intimacy and mercy offered to those who humbly seek Him."
    },
    {
      "pk": 14034027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 27,
      "text": "'Because your heart was tender and you humbled yourself before God when you heard His words against this place and its people, and you tore your clothes and wept before Me, I have heard you,' says the LORD.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/23/57/15'>Isaiah 57:15</a>",
      "comment": "True repentance receives divine attention. Humility is a requirement for receiving grace—the reason for postures of penance in worship."
    },
    {
      "pk": 14034028,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 28,
      "text": "'Therefore I will gather you to your ancestors, and you will be buried in peace. Your eyes will not see all the calamity I am going to bring on this place and its inhabitants.' So they took her answer back to the king.",
      "links": "<a href='/AIV/19/37/37'>Ps. 37:37</a>",
      "comment": "Even with righteous leaders, consequences for national sin may remain, but God’s mercy is shown to the humble and faithful."
    },
    {
      "pk": 14034029,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 29,
      "text": "Then the king sent and gathered all the elders of Judah and Jerusalem.",
      "links": "<a href='/AIV/12/23/1'>2 Kings 23:1</a>",
      "comment": "Ceremonial gatherings of leaders point to the visible, united, and hierarchical nature of the assembly of God’s people."
    },
    {
      "pk": 14034030,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 30,
      "text": "The king went up to the house of the LORD with all the men of Judah, the people of Jerusalem, the priests, and the Levites—all the people from the greatest to the least. He read aloud in their hearing all the words of the Book of the Covenant that had been found in the house of the LORD.",
      "links": "<a href='/AIV/5/31/11-13'>Deut. 31:11-13</a>",
      "comment": "Corporate, public proclamation of Scripture points to the liturgical pattern of worship, important in both Old and New Covenants."
    },
    {
      "pk": 14034031,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 31,
      "text": "The king stood by his pillar and made a covenant before the LORD, to follow the LORD and to keep His commands, decrees, and statutes, with all his heart and with all his soul, and to perform the words of the covenant that were written in this book.",
      "links": "<a href='/AIV/5/6/4-6'>Deut. 6:4-6</a>; <a href='/AIV/19/119/10'>Ps. 119:10</a>",
      "comment": "Renewing covenant as a community foreshadows Christ renewing the New Covenant through His Paschal Mystery and the communal recitation of creeds."
    },
    {
      "pk": 14034032,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 32,
      "text": "He made all who were present in Jerusalem and Benjamin to stand with him. The inhabitants of Jerusalem acted according to the covenant of God, the God of their ancestors.",
      "links": "<a href='/AIV/6/24/25'>Joshua 24:25</a>",
      "comment": "Liturgical covenant renewal helped establish a people united around the Law, a model for unity in faith and doctrine."
    },
    {
      "pk": 14034033,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 34,
      "verse": 33,
      "text": "Josiah removed all the abominations from all the lands that belonged to the Israelites and made all who were found in Israel serve the LORD their God. All his days they did not turn away from following the LORD, the God of their ancestors.",
      "links": "<a href='/AIV/5/13/4'>Deut. 13:4</a>; <a href='/AIV/12/23/24-25'>2 Kings 23:24-25</a>",
      "comment": "Josiah’s reforms unified religious practice and fostered obedience. The theme of one faith under one shepherd prefigures Christ’s shepherding of the New Covenant community (John 10:16)."
    }
  ],
  "translatedAt": "2025-12-24T04:39:07.610Z"
}