{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 28,
  "verses": [
    {
      "pk": 14028001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 1,
      "text": "Ahaz was twenty years old when he became king, and he ruled sixteen years in Jerusalem. He did not do what was right in the eyes of the LORD, as his ancestor David had done.",
      "links": "<a href='/AIV/12/16/2'>2 Kgs. 16:2</a>; <a href='/AIV/14/29/2'>2 Chr. 29:2</a>",
      "comment": "Ahaz is contrasted with David, the model king, to highlight his failure. Notice the biblical pattern of measuring kings by David’s standard (see <a href='/AIV/13/29/17'>1 Chr. 29:17</a>). This motif points to the need for the ideal Davidic King, later fulfilled in Christ (<a href='/AIV/40/1/1'>Matt. 1:1</a>)."
    },
    {
      "pk": 14028002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 2,
      "text": "Instead, he followed the ways of the kings of Israel and even made metal images for the Baals.",
      "links": "<a href='/AIV/12/16/3'>2 Kgs. 16:3</a>; <a href='/AIV/07/2/11'>Judg. 2:11</a>",
      "comment": "Imitating the northern kingdom brought apostasy. The worship of Baals involves idolatry, forbidden in the Ten Commandments (<a href='/AIV/02/20/3-6'>Exod. 20:3-6</a>), showing the danger of syncretism leading Israel astray."
    },
    {
      "pk": 14028003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 3,
      "text": "He burned incense in the Valley of the Son of Hinnom and burned his sons as an offering, following the detestable practices of the nations whom the LORD drove out before the Israelites.",
      "links": "<a href='/AIV/12/16/3'>2 Kgs. 16:3</a>; <a href='/AIV/03/18/21'>Lev. 18:21</a>; <a href='/AIV/24/7/31'>Jer. 7:31</a>",
      "comment": "Child sacrifice is described here, showing the extreme corruption of worship. The Valley of Hinnom (Gehenna) would later symbolize eternal separation from God (<a href='/AIV/40/5/22'>Matt. 5:22</a>)."
    },
    {
      "pk": 14028004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 4,
      "text": "He sacrificed and burned incense on the high places, on the hills, and under every green tree.",
      "links": "<a href='/AIV/12/16/4'>2 Kgs. 16:4</a>; <a href='/AIV/05/12/2'>Deut. 12:2</a>",
      "comment": "High places and worship under ‘every green tree’ refer to illicit worship outside the temple, showing disregard for the centralization of worship commanded in the Law (<a href='/AIV/05/12/13-14'>Deut. 12:13-14</a>)."
    },
    {
      "pk": 14028005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 5,
      "text": "So the LORD his God handed him over to the king of Aram, who defeated him and took many captives to Damascus. He was also handed over to the king of Israel, who inflicted heavy casualties on him.",
      "links": "<a href='/AIV/12/16/5'>2 Kgs. 16:5</a>; <a href='/AIV/23/7/1'>Isa. 7:1</a>",
      "comment": "Judgment falls on Ahaz for his unfaithfulness. The LORD allows foreign powers to defeat Judah—an important Old Testament theme where military disaster reveals spiritual decay."
    },
    {
      "pk": 14028006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 6,
      "text": "Pekah son of Remaliah killed one hundred twenty thousand in Judah in one day—all brave men—because they had forsaken the LORD, the God of their ancestors.",
      "links": "<a href='/AIV/12/16/5'>2 Kgs. 16:5</a>; <a href='/AIV/23/7/1'>Isa. 7:1</a>",
      "comment": "A massive defeat in one day points to divine judgment. Forsaking the LORD always brings destruction (cf. <a href='/AIV/03/26/17'>Lev. 26:17</a>)."
    },
    {
      "pk": 14028007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 7,
      "text": "Zikri, a powerful man from Ephraim, killed Maaseiah the king’s son, Azrikam the officer in charge of the palace, and Elkanah, the king’s second in command.",
      "links": "<a href='/AIV/14/21/2'>2 Chr. 21:2</a>",
      "comment": "Even the royal family and officials fall. This underscores how spiritual infidelity destabilizes society at every level."
    },
    {
      "pk": 14028008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 8,
      "text": "The people of Israel took captive two hundred thousand of their relatives—women, sons, and daughters. They also took away much plunder, which they brought to Samaria.",
      "links": "<a href='/AIV/12/16/6'>2 Kgs. 16:6</a>",
      "comment": "This tragic civil war and captivity of kin illustrate the consequences of division within God’s people."
    },
    {
      "pk": 14028009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 9,
      "text": "But a prophet of the LORD was there, whose name was Oded. He went out to meet the army returning to Samaria and said to them, 'Because the LORD, the God of your ancestors, was angry with Judah, He gave them into your hand. But you have slaughtered them with a fury that reaches up to heaven.'",
      "links": "<a href='/AIV/14/15/1-8'>2 Chr. 15:1-8</a>; <a href='/AIV/01/4/10'>Gen. 4:10</a>",
      "comment": "Prophets mediate God’s will, often rebuking both Israelites and Judeans. The phrase 'reaches up to heaven' recalls Genesis 4:10."
    },
    {
      "pk": 14028010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 10,
      "text": "'Now you intend to subjugate the people of Judah and Jerusalem as your slaves. But are you yourselves not also guilty of sins against the LORD your God?'",
      "links": "<a href='/AIV/04/32/23'>Num. 32:23</a>",
      "comment": "Oded’s reminder is a warning: those who execute God's judgment are not exempt from their own sin. This suggests a universal need for repentance and mercy."
    },
    {
      "pk": 14028011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 11,
      "text": "Now listen to me! Send back your fellow Israelites you have taken as prisoners, for the fierce anger of the LORD rests on you.",
      "links": "<a href='/AIV/14/30/9'>2 Chr. 30:9</a>",
      "comment": "Breaking the unity of God’s people invites divine anger. Restoring relationships and justice is always possible through repentance."
    },
    {
      "pk": 14028012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 12,
      "text": "Then some leaders of Ephraim—Azariah son of Johanan, Berechiah son of Meshillemoth, Jehizkiah son of Shallum, and Amasa son of Hadlai—stood up against those returning from the war.",
      "links": "",
      "comment": "Lay and clan leaders intervene, showing the importance of communal conscience to correct leaders’ mistakes."
    },
    {
      "pk": 14028013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 13,
      "text": "They said to them, 'You shall not bring the captives here, for you intend to add to our sins and guilt before the LORD. Our guilt is already great, and there is fierce wrath against Israel.'",
      "links": "",
      "comment": "Recognition of communal guilt foreshadows the idea of corporate responsibility, and points toward the importance of collective repentance, as later seen in New Testament gatherings (<a href='/AIV/44/2/37-41'>Acts 2:37-41</a>)."
    },
    {
      "pk": 14028014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 14,
      "text": "So the armed men left the prisoners and the spoils before the officials and all the congregation.",
      "links": "",
      "comment": "The people respond obediently to godly leadership, setting an example of humility before God's commands."
    },
    {
      "pk": 14028015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 15,
      "text": "The men mentioned by name took the prisoners, and from the spoil they clothed all who were naked. They gave them clothing and sandals, food and drink, and anointed them. They led all the weak on donkeys and brought them to their relatives at Jericho, the city of palm trees. Then they returned to Samaria.",
      "links": "<a href='/AIV/42/10/29-37'>Luke 10:29-37</a>",
      "comment": "The act of mercy toward enemies foreshadows Christ's teaching in the parable of the Good Samaritan. Corporal works of mercy are deeply rooted in biblical tradition here."
    },
    {
      "pk": 14028016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 16,
      "text": "At that time King Ahaz sent to the kings of Assyria for help.",
      "links": "<a href='/AIV/12/16/7'>2 Kgs. 16:7</a>",
      "comment": "Ahaz trusts foreign powers instead of God, a recurring error in biblical history illustrating misplaced faith."
    },
    {
      "pk": 14028017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 17,
      "text": "For the Edomites had returned, attacked Judah and carried away captives.",
      "links": "<a href='/AIV/14/21/8-10'>2 Chr. 21:8-10</a>",
      "comment": "Foreign incursions are often permitted by God as a means of discipline or wakeup call to repentance."
    },
    {
      "pk": 14028018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 18,
      "text": "The Philistines also raided the cities of the lowland and the Negev of Judah. They captured Beth-shemesh, Aijalon, Gederoth, Soco with its villages, Timnah with its villages, and Gimzo with its villages, and settled there.",
      "links": "<a href='/AIV/07/13/1'>Judg. 13:1</a>",
      "comment": "The loss of cities to old enemies shows the cost of abandoning the covenant. Their settling is a symbol of spiritual erosion—where God’s people neglect fidelity, others take root."
    },
    {
      "pk": 14028019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 19,
      "text": "For the LORD humbled Judah because of Ahaz king of Israel, for he encouraged moral corruption in Judah and was most unfaithful to the LORD.",
      "links": "<a href='/AIV/03/26/19'>Lev. 26:19</a>; <a href='/AIV/20/16/18-19'>Prov. 16:18-19</a>",
      "comment": "Moral leadership, or the lack of it, affects the entire nation. 'Humbled' means subjected to discipline; pride and infidelity lead to downfall."
    },
    {
      "pk": 14028020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 20,
      "text": "So Tiglath-pileser king of Assyria came against him and oppressed him instead of strengthening him.",
      "links": "<a href='/AIV/12/16/7'>2 Kgs. 16:7</a>; <a href='/AIV/23/7/17'>Isa. 7:17</a>",
      "comment": "Worldly alliances trap rather than save. Only dependence on God brings true security."
    },
    {
      "pk": 14028021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 21,
      "text": "Though Ahaz took some things from the house of the LORD and from the palace and officials, and gave them to the king of Assyria, it did not help him.",
      "links": "<a href='/AIV/12/16/8'>2 Kgs. 16:8</a>",
      "comment": "Plundering God’s house to purchase security is fruitless—a sharp lesson. Temporal solutions never suffice for spiritual problems."
    },
    {
      "pk": 14028022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 22,
      "text": "Even in his time of trouble, King Ahaz became even more unfaithful to the LORD.",
      "links": "<a href='/AIV/14/33/12-13'>2 Chr. 33:12-13</a>",
      "comment": "Rather than turning back in humility, Ahaz’s heart hardens. Compare the contrasting repentance of Manasseh later."
    },
    {
      "pk": 14028023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 23,
      "text": "He sacrificed to the gods of Damascus who had defeated him, thinking, 'Because the gods of the kings of Aram helped them, I will sacrifice to them so they may help me.' But they caused the downfall of both him and all Israel.",
      "links": "<a href='/AIV/14/25/14-15'>2 Chr. 25:14-15</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "False worship brings destruction, not deliverance. The folly of idolatry is exposed again (<a href='/AIV/19/135/15-18'>Ps. 135:15-18</a>)."
    },
    {
      "pk": 14028024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 24,
      "text": "Ahaz gathered the articles from the house of God, cut them in pieces, shut the doors of the LORD’s temple, and made for himself altars in every corner of Jerusalem.",
      "links": "<a href='/AIV/14/29/3'>2 Chr. 29:3</a>",
      "comment": "Closing the temple signifies a total break with the covenant. Multiple altars represent competing authorities—whereas true faith is unified in worship."
    },
    {
      "pk": 14028025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 25,
      "text": "He made high places in every city of Judah to burn incense to other gods, and provoked the LORD, the God of his ancestors, to anger.",
      "links": "<a href='/AIV/05/12/2-4'>Deut. 12:2-4</a>",
      "comment": "Centralized worship is replaced by factional altars, highlighting the importance of keeping pure liturgical worship, as laid out in the Law."
    },
    {
      "pk": 14028026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 26,
      "text": "Now the rest of the acts of Ahaz, from first to last, are written in the Book of the Kings of Judah and Israel.",
      "links": "<a href='/AIV/14/27/7'>2 Chr. 27:7</a>",
      "comment": "The chronicler refers to other sources, a sign of careful biblical historiography."
    },
    {
      "pk": 14028027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 28,
      "verse": 27,
      "text": "Ahaz rested with his ancestors and was buried in the city, in Jerusalem, but they did not bring him into the tombs of the kings of Israel. And Hezekiah his son reigned in his place.",
      "links": "<a href='/AIV/12/16/20'>2 Kgs. 16:20</a>; <a href='/AIV/14/26/23'>2 Chr. 26:23</a>",
      "comment": "Ahaz’s burial outside the royal tombs is a sign of disgrace. Hezekiah’s succession sets the stage for renewal and reform, showing God’s faithfulness to restore through the lineage of David—a messianic hope fulfilled in Jesus (<a href='/AIV/40/1/9-11'>Matt. 1:9-11</a>), unbroken through failures and repentance of kings."
    }
  ],
  "translatedAt": "2025-12-24T04:35:21.954Z"
}