{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 31,
  "verses": [
    {
      "pk": 2003101,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 1,
      "text": "When all this was finished, all Israel who were present went out to the cities of Judah, and broke down the pillars, cut down the Asherah poles, and destroyed the high places and the altars throughout all Judah and Benjamin, and in Ephraim and Manasseh, until they had destroyed them all. Then all the sons of Israel returned, each to his own possession, to their cities.",
      "links": "<a href='/AIV/12/18/4'>2 Kings 18:4</a>; <a href='/AIV/14/30/14'>2 Chr. 30:14</a>",
      "comment": "Retains the double emphasis on the thorough removal of idolatrous items."
    },
    {
      "pk": 2003102,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 2,
      "text": "Hezekiah appointed the divisions of the priests and the Levites according to their divisions, each according to his service, that is, for the burnt offerings and peace offerings, to minister, to give thanks, and to praise at the gates of the camp of the LORD.",
      "links": "<a href='/AIV/13/24/1'>1 Chr. 24:1–19</a>; <a href='/AIV/14/8/14'>2 Chr. 8:14</a>",
      "comment": "Reflects the original Hebrew word for 'order' as 'divisions' for clarity."
    },
    {
      "pk": 2003103,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 3,
      "text": "The king contributed from his own possessions for the morning and evening burnt offerings, the burnt offerings for the Sabbaths, the New Moons, and the appointed feasts, as it is written in the law of the LORD.",
      "links": "<a href='/AIV/04/28/3'>Num. 28:3–8</a>; <a href='/AIV/03/23/1'>Lev. 23:1–38</a>",
      "comment": "Shows Hezekiah’s personal involvement in restoring temple worship."
    },
    {
      "pk": 2003104,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 4,
      "text": "He commanded the people who lived in Jerusalem to give the portion due to the priests and the Levites, so that they could devote themselves to the law of the LORD.",
      "links": "<a href='/AIV/04/18/8'>Num. 18:8–21</a>",
      "comment": "Makes clear the intent: enabling the priests and Levites' full ministry."
    },
    {
      "pk": 2003105,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 5,
      "text": "As soon as the command was issued, the sons of Israel gave in abundance the firstfruits of grain, wine, oil, honey, and of all the produce of the field. And they brought in abundantly the tithe of everything.",
      "links": "<a href='/AIV/03/27/30'>Lev. 27:30</a>; <a href='/AIV/05/18/4'>Deut. 18:4</a>",
      "comment": "Explicitly includes 'honey' as a firstfruit, as found in the Hebrew."
    },
    {
      "pk": 2003106,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 6,
      "text": "The sons of Israel and Judah who lived in the cities of Judah also brought a tithe of cattle and sheep, and a tithe of the holy things which were consecrated to the LORD their God; they laid them in heaps.",
      "links": "<a href='/AIV/03/27/32'>Lev. 27:32</a>",
      "comment": "Clarifies 'heaps,' matching the original description."
    },
    {
      "pk": 2003107,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 7,
      "text": "In the third month they began to pile up the heaps, and finished them in the seventh month.",
      "links": "<a href='/AIV/02/23/16'>Ex. 23:16</a>",
      "comment": "Specifies months according to the Hebrew (third to seventh)."
    },
    {
      "pk": 2003108,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 8,
      "text": "When Hezekiah and the officials came and saw the heaps, they blessed the LORD and his people Israel.",
      "links": "<a href='/AIV/01/14/19'>Gen. 14:19</a>",
      "comment": "Blessing of both God and people retained as per original order."
    },
    {
      "pk": 2003109,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 9,
      "text": "Hezekiah asked the priests and the Levites about the heaps.",
      "links": "<a href='/AIV/14/34/9'>2 Chr. 34:9</a>",
      "comment": "Concise and straightforward to match Qal imperfect in Hebrew."
    },
    {
      "pk": 2003110,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 10,
      "text": "Azariah the chief priest, of the house of Zadok, answered him and said, “Since the people began to bring the contributions into the house of the LORD, we have had plenty to eat and there is much left over, for the LORD has blessed his people; and what is left is this great abundance.”",
      "links": "<a href='/AIV/09/2/18'>1 Sam. 2:18</a>",
      "comment": "Directly attributes abundance to the LORD’s blessing."
    },
    {
      "pk": 2003111,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 11,
      "text": "Then Hezekiah commanded them to prepare rooms in the house of the LORD, and they prepared them.",
      "links": "<a href='/AIV/16/13/8'>Neh. 13:8–9</a>",
      "comment": "Keeps original phrasing, noting storerooms are for offerings."
    },
    {
      "pk": 2003112,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 12,
      "text": "They faithfully brought in the offerings, the tithes, and the dedicated things; Conaniah the Levite was in charge over them, and Shimei his brother was second.",
      "links": "<a href='/AIV/14/29/12'>2 Chr. 29:12</a>",
      "comment": "Maintains the chain of authority among Levites as in Hebrew."
    },
    {
      "pk": 2003113,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 13,
      "text": "Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismakiah, Mahath, and Benaiah were overseers under the hand of Conaniah and Shimei his brother, by appointment of King Hezekiah; and Azariah was chief in the house of God.",
      "links": "<a href='/AIV/14/29/12'>2 Chr. 29:12</a>",
      "comment": "Names retained and oversight explained per original."
    },
    {
      "pk": 2003114,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 14,
      "text": "Kore the son of Imnah the Levite, the keeper of the east gate, was over the freewill offerings of God, to distribute the contributions of the LORD and the most holy things.",
      "links": "<a href='/AIV/03/7/16'>Lev. 7:16–18</a>",
      "comment": "Keeps titles literal; 'most holy things' matches Hebrew terminology."
    },
    {
      "pk": 2003115,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 15,
      "text": "Under his responsibility were Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah, in the cities of the priests, to faithfully distribute the portions to their brothers, both young and old by divisions.",
      "links": "<a href='/AIV/14/23/18'>2 Chr. 23:18</a>",
      "comment": "Distributing portions 'by divisions' matches priestly allocation."
    },
    {
      "pk": 2003116,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 16,
      "text": "Besides those who were listed by genealogy, males three years old and older, all who entered the house of the LORD for daily service, according to their tasks and divisions.",
      "links": "<a href='/AIV/04/4/3'>Num. 4:3</a>",
      "comment": "Direct union of legal and genealogical requirements."
    },
    {
      "pk": 2003117,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 17,
      "text": "The genealogical record of the priests was according to their families, and the Levites from twenty years old and upward, by their divisions.",
      "links": "<a href='/AIV/04/8/24'>Num. 8:24</a>",
      "comment": "Emphasizes age and division fidelity."
    },
    {
      "pk": 2003118,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 18,
      "text": "Those listed by genealogy included all their little children, their wives, their sons, and their daughters—the whole assembly. For in their faithfulness they set themselves apart as holy.",
      "links": "<a href='/AIV/03/22/11'>Lev. 22:11</a>",
      "comment": "Brings out that whole family benefited, with holiness specified."
    },
    {
      "pk": 2003119,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 19,
      "text": "Also, for the sons of Aaron, the priests, who lived in the fields of the common lands of their cities, there were men appointed by name to distribute portions to every male among the priests and to all who were listed by genealogies among the Levites.",
      "links": "<a href='/AIV/04/35/2'>Num. 35:2</a>",
      "comment": "Specifies duties among rural priests and their genealogy."
    },
    {
      "pk": 2003120,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 20,
      "text": "Thus Hezekiah did throughout all Judah. He did what was good and right and faithful before the LORD his God.",
      "links": "<a href='/AIV/14/29/2'>2 Chr. 29:2</a>",
      "comment": "Trio of obedience adjectives preserved as in the original."
    },
    {
      "pk": 2003121,
      "translation": "AIV",
      "book": 14,
      "chapter": 31,
      "verse": 21,
      "text": "In every work that he began in the service of the house of God and in the law and the commandments, to seek his God, he did with all his heart, and so he prospered.",
      "links": "<a href='/AIV/06/1/7'>Josh. 1:7</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "'With all his heart' follows original and shows cause of prosperity."
    }
  ],
  "translatedAt": "2025-12-22T11:09:27.322Z"
}