{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 21,
  "verses": [
    {
      "pk": 14021001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 1,
      "text": "Jehoshaphat rested with his fathers and was buried with them in the city of David, and Jehoram his son became king in his place.",
      "links": "<a href='/AIV/14/20/34'>2Chr 20:34</a>; <a href='/AIV/12/8/16-17'>2 Kings 8:16-17</a>",
      "comment": "The phrase 'rested with his fathers' is a Hebraic way of describing death, signifying continuity in God's covenant with David's line (2Sam 7:12)."
    },
    {
      "pk": 14021002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 2,
      "text": "Jehoram had brothers, sons of Jehoshaphat: Azariah, Jehiel, Zechariah, Azariah, Michael, and Shephatiah. All these were sons of Jehoshaphat, king of Israel.",
      "links": "<a href='/AIV/14/22/1'>2Chr 22:1</a>",
      "comment": "The listing of brothers highlights the significance of legitimate succession and unity in the royal house (cf. 1Chr 3:11-12). The recurrence of names may indicate a family devotion to God or tradition."
    },
    {
      "pk": 14021003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 3,
      "text": "Their father gave them many gifts of silver, gold, and valuable things, as well as fortified cities in Judah, but he gave the kingdom to Jehoram because he was the firstborn.",
      "links": "<a href='/AIV/13/5/1-2'>1Chr 5:1-2</a>",
      "comment": "Despite gifts to his other sons, only the firstborn receives the throne. This affirms the ancient tradition of primogeniture, which anticipates biblical leadership structures (see Num 27:19-21 for the importance of orderly succession)."
    },
    {
      "pk": 14021004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 4,
      "text": "When Jehoram had established his rule over his father's kingdom, he put all his brothers to the sword, along with some of the officials of Israel.",
      "links": "<a href='/AIV/12/8/16'>2 Kings 8:16</a>; <a href='/AIV/13/3/1-2'>1Chr 3:1-2</a>",
      "comment": "Jehoram's murder of his brothers shows the tragic results of power corrupting leaders. Contrasted with Christ (cf. Phil 2:6-8), who lays down His life for others, Jehoram takes life to secure his own position."
    },
    {
      "pk": 14021005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 5,
      "text": "Jehoram was thirty-two years old when he became king, and he reigned eight years in Jerusalem.",
      "links": "<a href='/AIV/12/8/17'>2 Kings 8:17</a>",
      "comment": "The short reign, relative to other kings, signals the consequences of Jehoram's actions. His age and years of rule are consistent with historical records in parallel accounts."
    },
    {
      "pk": 14021006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 6,
      "text": "He walked in the ways of the kings of Israel, just as the house of Ahab had done, for he had married a daughter of Ahab. He did what was evil in the sight of the LORD.",
      "links": "<a href='/AIV/12/8/18'>2 Kings 8:18</a>; <a href='/AIV/11/16/30-33'>1 Kings 16:30-33</a>",
      "comment": "Jehoram's marriage ties Judah to the idolatry of Israel, leading to spiritual ruin. The union mirrors warnings about marrying outside the faith (Deut 7:3-4), emphasizing how spiritual faithfulness preserves true worship."
    },
    {
      "pk": 14021007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 7,
      "text": "Yet the LORD was not willing to destroy the house of David, because of the covenant he had made with David, and since he had promised to give a lamp to him and to his sons forever.",
      "links": "<a href='/AIV/10/7/16'>2 Sam 7:16</a>; <a href='/AIV/19/132/11-12'>Ps 132:11-12</a>",
      "comment": "God's faithfulness to His covenant preserves David's line despite human failures. The 'lamp' anticipates the Messianic hope fulfilled in Christ (Luke 1:32-33). This perpetual dynasty prefigures God’s unbroken promise carried on through visible leadership in His people."
    },
    {
      "pk": 14021008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 8,
      "text": "In his days Edom rebelled against the rule of Judah and set up a king over themselves.",
      "links": "<a href='/AIV/12/8/20'>2 Kings 8:20</a>",
      "comment": "Edom’s revolt underlines Judah’s weakened state due to Jehoram’s unfaithfulness. Political disunity often follows spiritual disunity, a pattern evident throughout redemptive history."
    },
    {
      "pk": 14021009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 9,
      "text": "Then Jehoram went out with his officers and all his chariots. He rose up by night and attacked the Edomites who had surrounded him and the chariot commanders.",
      "links": "<a href='/AIV/12/8/21'>2 Kings 8:21</a>",
      "comment": "Jehoram barely escapes defeat, a sign that military might cannot replace God’s favor. His limited success underscores the need for faithfulness to God above mere political maneuvering."
    },
    {
      "pk": 14021010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 10,
      "text": "So Edom has been in rebellion against Judah to this day. At that time Libnah also revolted from his rule, because he had forsaken the LORD, the God of his fathers.",
      "links": "<a href='/AIV/12/8/22'>2 Kings 8:22</a>",
      "comment": "The writer connects political loss to spiritual apostasy, showing that turning away from God has tangible consequences. This principle fulfills Deut 28:20 regarding curses for covenant infidelity."
    },
    {
      "pk": 14021011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 11,
      "text": "Moreover, Jehoram made high places in the hills of Judah and caused the people of Jerusalem to practice harlotry and led Judah astray.",
      "links": "<a href='/AIV/14/28/4'>2Chr 28:4</a>",
      "comment": "High places symbolize worship corrupted by foreign practices. ‘Harlotry’ is a frequent biblical metaphor for idolatry (Hos 1:2), showing that true worship is exclusive and regulated by God."
    },
    {
      "pk": 14021012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 12,
      "text": "A letter came to him from Elijah the prophet, saying, 'Thus says the LORD, the God of David your father: “Because you have not walked in the ways of Jehoshaphat your father or in the ways of Asa king of Judah,”'",
      "links": "<a href='/AIV/12/1/17-18'>2 Kings 1:17-18</a>",
      "comment": "This unusual mention of Elijah to a southern king emphasizes the continuity of God’s prophetic authority. Elijah’s words recall the centrality of faithfulness and the unique role of authoritative correction within the community of believers."
    },
    {
      "pk": 14021013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 13,
      "text": "'but have walked in the ways of the kings of Israel, and have made Judah and the inhabitants of Jerusalem go astray, just as the house of Ahab led Israel astray, and also have killed your brothers, your father’s family, who were better than yourself,'",
      "links": "<a href='/AIV/12/8/18'>2 Kings 8:18</a>",
      "comment": "Elijah explicitly links Jehoram’s guilt to his idolatry and fratricide. Prophetic rebuke reaffirms the seriousness of leading God’s people astray, paralleling New Testament warnings (James 3:1)."
    },
    {
      "pk": 14021014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 14,
      "text": "behold, the LORD will bring a great calamity on your people, your sons, your wives, and all your possessions,",
      "links": "<a href='/AIV/19/78/61'>Ps 78:61</a>; <a href='/AIV/26/14/16'>Ezek 14:16</a>",
      "comment": "The prophecy reveals that leadership’s sin can bring communal judgment. There is an ancient principle here of solidarity—corporate responsibility—which finds fulfillment in Christ’s redemptive solidarity with humanity (Rom 5:17-19)."
    },
    {
      "pk": 14021015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 15,
      "text": "and you yourself will suffer severe sickness, a disease of your bowels, until your bowels come out because of the illness, day by day.'",
      "links": "<a href='/AIV/14/13/20'>2Chr 13:20</a>",
      "comment": "God’s judgment is specific and personal, underlining the seriousness of Jehoram’s sin. Such dramatic punishment serves as a warning to rulers who turn from God, and a contrast to Christ, who bears the Father’s wrath for others."
    },
    {
      "pk": 14021016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 16,
      "text": "And the LORD stirred up against Jehoram the spirit of the Philistines and the Arabs who are near the Ethiopians.",
      "links": "<a href='/AIV/14/17/11'>2Chr 17:11</a>",
      "comment": "Enemies rise at God’s direction to execute judgment—a theme seen throughout the Old Testament (cf. Hab 1:6). This reasserts God’s sovereignty over the nations."
    },
    {
      "pk": 14021017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 17,
      "text": "They came up against Judah, invaded it, and carried away all the possessions they found belonging to the king’s house, as well as his sons and wives, so that not one son was left to him except Jehoahaz, his youngest son.",
      "links": "<a href='/AIV/14/22/1'>2Chr 22:1</a>",
      "comment": "Judgment strikes deeply, yet one son remains, preserving David’s line. This preservation is central to Messianic promise, showing God’s faithfulness even amid severe chastisement—hinting at the mystery of suffering and redemption in God’s plan."
    },
    {
      "pk": 14021018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 18,
      "text": "After all this, the LORD struck him in his bowels with an incurable disease.",
      "links": "<a href='/AIV/14/21/15'>2Chr 21:15</a>",
      "comment": "Jehoram’s incurable disease is divine judgment, reminiscent of the plagues on Egypt (Exod 9:11). God’s justice is severe but purposeful, reminding the people to seek reconciliation and repentance."
    },
    {
      "pk": 14021019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 19,
      "text": "In course of time, at the end of two years, his bowels came out because of his disease, and he died in great pain. His people made no fire for him, like the fires made for his fathers.",
      "links": "<a href='/AIV/14/16/14'>2Chr 16:14</a>",
      "comment": "The lack of honor at his burial signals total disgrace (cf. Jer 22:19). The contrast with the respect shown to previous kings is meant as a moral lesson in godly leadership."
    },
    {
      "pk": 14021020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 21,
      "verse": 20,
      "text": "He was thirty-two years old when he began to reign, and he reigned in Jerusalem eight years. He departed without being desired. They buried him in the city of David, but not in the tombs of the kings.",
      "links": "<a href='/AIV/14/24/25'>2Chr 24:25</a>; <a href='/AIV/14/16/14'>2Chr 16:14</a>",
      "comment": "His exclusion from the royal tombs marks final rejection. This closes a lesson of accountability and hope: though individuals fail, God’s promise to His people stands. The enduring covenant points to a coming King whose reign is everlasting (cf. Isa 9:7; Luke 1:32-33)."
    }
  ],
  "translatedAt": "2025-12-24T04:32:02.132Z"
}