{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 29,
  "verses": [
    {
      "pk": 14029001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 1,
      "text": "Hezekiah became king when he was twenty-five years old, and he reigned in Jerusalem twenty-nine years. His mother’s name was Abijah, daughter of Zechariah.",
      "links": "<a href='/AIV/12/18/2'>2 Kings 18:2</a>",
      "comment": "Hezekiah’s reign begins a major spiritual renewal in Judah, showing how God uses young leaders for restoration. His mother Abijah’s ancestry suggests faithful influence."
    },
    {
      "pk": 14029002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 2,
      "text": "He did what was right in the eyes of Yahweh, just as his ancestor David had done.",
      "links": "<a href='/AIV/11/15/5'>1 Kings 15:5</a>",
      "comment": "Hezekiah is praised for his faithfulness, echoing David’s obedience. This establishes a standard of covenantal faithfulness closely linked to proper worship and leadership structure."
    },
    {
      "pk": 14029003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 3,
      "text": "In the first month of the first year of his reign, he opened the doors of the house of Yahweh and repaired them.",
      "links": "<a href='/AIV/14/28/24'>2 Chr. 28:24</a>",
      "comment": "Hezekiah’s urgent priority was restoring worship, reversing his father’s neglect. This signifies the restoration of access to God, reminiscent of Christ restoring the way to the Father (John 14:6)."
    },
    {
      "pk": 14029004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 4,
      "text": "He brought the priests and the Levites together and assembled them in the square to the east.",
      "links": "<a href='/AIV/16/8/1'>Neh. 8:1'</a>",
      "comment": "The gathering of the priests and Levites underscores the necessity of appointed leaders in worship. It foreshadows the importance of apostolic succession and ordained ministry."
    },
    {
      "pk": 14029005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 5,
      "text": "He said to them, 'Listen to me, Levites. Now consecrate yourselves and consecrate the house of Yahweh, the God of your ancestors. Remove all impurity from the holy place.'",
      "links": "<a href='/AIV/03/11/44'>Lev. 11:44</a>; <a href='/AIV/14/15/8'>2 Chr. 15:8</a>",
      "comment": "Preparation through consecration is key for worship. The removal of impurity relates to spiritual purification that anticipates Christian sacramental life."
    },
    {
      "pk": 14029006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 6,
      "text": "For our fathers have been unfaithful; they did evil in the eyes of Yahweh our God. They abandoned Him, turned their faces away from Yahweh’s dwelling, and turned their backs on Him.",
      "links": "<a href='/AIV/11/9/6'>1 Kings 9:6</a>; <a href='/AIV/14/28/6'>2 Chr. 28:6</a>",
      "comment": "The sin of previous generations led to the decline of worship and relationship with God. Hezekiah’s confession models proper repentance and humility."
    },
    {
      "pk": 14029007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 7,
      "text": "They also shut the doors of the vestibule, put out the lamps, and did not burn incense or offer burnt offerings in the holy place to the God of Israel.",
      "links": "<a href='/AIV/02/30/7'>Ex. 30:7</a>; <a href='/AIV/14/28/24'>2 Chr. 28:24</a>",
      "comment": "Neglect of the temple worship points to the necessity of continual liturgical practice. The regular offering of incense and burnt offerings prefigures the perpetual prayer and sacrifice in Christian worship."
    },
    {
      "pk": 14029008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 8,
      "text": "So the wrath of Yahweh came upon Judah and Jerusalem. He made them a cause for terror, astonishment, and ridicule, as you see with your own eyes.",
      "links": "<a href='/AIV/24/19/8'>Jer. 19:8</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "God’s judgment is a consequence of persistent sin, serving as a warning of both temporal and spiritual consequences for abandoning His ways."
    },
    {
      "pk": 14029009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 9,
      "text": "Our fathers have fallen by the sword, and our sons, daughters, and wives are taken captive because of this.",
      "links": "<a href='/AIV/14/28/5'>2 Chr. 28:5</a>",
      "comment": "Corporate faithfulness or unfaithfulness affects entire communities, illustrating the importance of intergenerational responsibility for the faith."
    },
    {
      "pk": 14029010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 10,
      "text": "Now it is in my heart to make a covenant with Yahweh, the God of Israel, so that His fierce anger may turn away from us.",
      "links": "<a href='/AIV/02/24/7'>Ex. 24:7</a>; <a href='/AIV/24/31/31'>Jer. 31:31</a>",
      "comment": "Hezekiah’s intention to renew covenant highlights God’s desire for a restored relationship. This anticipates the New Covenant brought by Christ (Luke 22:20)."
    },
    {
      "pk": 14029011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 11,
      "text": "'My sons, do not be negligent now, for Yahweh has chosen you to stand before Him, to serve Him and to be His ministers and burn incense.'",
      "links": "<a href='/AIV/04/16/9'>Num. 16:9</a>; <a href='/AIV/02/28/1'>Ex. 28:1</a>",
      "comment": "The idea of chosen ministers intent on serving God signals the special calling of a priestly ministry and emphasizes ordained roles within worship."
    },
    {
      "pk": 14029012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 12,
      "text": "Then the Levites arose: Mahath son of Amasai and Joel son of Azariah, of the sons of the Kohathites; Kish son of Abdi and Azariah son of Jehallelel, among the sons of Merari;",
      "links": "<a href='/AIV/04/3/17-20'>Num. 3:17-20</a>",
      "comment": "Levitical families act upon their calling, illustrating obedience and proper religious order passed down through the generations."
    },
    {
      "pk": 14029013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 13,
      "text": "and of the Gershonites: Joah son of Zimmah and Eden son of Joah;",
      "links": "<a href='/AIV/04/3/21'>Num. 3:21</a>",
      "comment": "The Gershonites also participate, upholding the corporate aspect of priestly responsibility."
    },
    {
      "pk": 14029014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 14,
      "text": "and of the sons of Elizaphan: Shimri and Jeuel; and of the sons of Asaph: Zechariah and Mattaniah;",
      "links": "<a href='/AIV/04/3/30'>Num. 3:30</a>; <a href='/AIV/13/6/39'>1 Chr. 6:39</a>",
      "comment": "Musical leaders like Asaph’s descendants remind us of the integral role of music in worship and liturgy."
    },
    {
      "pk": 14029015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 15,
      "text": "They assembled their brothers, consecrated themselves, and went in, as the king had commanded according to the words of Yahweh, to cleanse the house of Yahweh.",
      "links": "<a href='/AIV/03/8/6'>Lev. 8:6</a>; <a href='/AIV/04/8/7'>Num. 8:7</a>",
      "comment": "Actual consecration and cleansing underscores both inner and outer preparation. It prefigures Christ’s cleansing of the Temple (John 2:15-16) and spiritual purification in the Church."
    },
    {
      "pk": 14029016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 16,
      "text": "The priests went into the inner part of Yahweh’s house to cleanse it, and brought out all the uncleanness they found in the temple of Yahweh to the court of the house of Yahweh, and the Levites took it out to the Kidron Valley.",
      "links": "<a href='/AIV/11/15/13'>1 Kings 15:13</a>; <a href='/AIV/14/15/16'>2 Chr. 15:16</a>",
      "comment": "This purification of the sanctuary represents a physical and spiritual renewal, signifying the absolute necessity of both for right worship."
    },
    {
      "pk": 14029017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 17,
      "text": "They began to consecrate on the first day of the first month, and by the eighth day of the month they came to the porch of Yahweh. Then they consecrated the house of Yahweh in eight days, and finished on the sixteenth day of the first month.",
      "links": "<a href='/AIV/03/8/33'>Lev. 8:33</a>",
      "comment": "The careful, timed process points to the seriousness of purification and the order required in liturgical practice, similar to sacramental preparation."
    },
    {
      "pk": 14029018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 18,
      "text": "They came to King Hezekiah and said, 'We have cleansed the whole house of Yahweh, the altar of burnt offering and all its utensils, and the table for the bread of the Presence with all its utensils.'",
      "links": "<a href='/AIV/03/24/6'>Lev. 24:6</a>; <a href='/AIV/02/25/30'>Ex. 25:30</a>",
      "comment": "The bread of the Presence foreshadows the Eucharistic presence in later Christian worship. Cleansing these indicates both the restoration of right worship and the real presence of God."
    },
    {
      "pk": 14029019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 19,
      "text": "'We have also prepared and consecrated all the utensils that King Ahaz had cast aside when he was unfaithful. They are now before the altar of Yahweh.'",
      "links": "<a href='/AIV/14/28/24'>2 Chr. 28:24</a>",
      "comment": "Restoration of the utensils used in worship symbolizes renewal and reconciliation, much as Christian liturgy restores full communion."
    },
    {
      "pk": 14029020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 20,
      "text": "Then King Hezekiah rose early, gathered the officials of the city, and went up to the house of Yahweh.",
      "links": "<a href='/AIV/19/122/1'>Ps. 122:1</a>",
      "comment": "Hezekiah’s zeal and the participation of city leaders highlight communal worship and the necessity of leadership in the spiritual life."
    },
    {
      "pk": 14029021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 21,
      "text": "They brought seven bulls, seven rams, seven lambs, and seven male goats as a sin offering for the kingdom, for the sanctuary, and for Judah. Hezekiah commanded the priests, sons of Aaron, to offer them on the altar of Yahweh.",
      "links": "<a href='/AIV/03/4/32'>Lev. 4:32</a>",
      "comment": "The prescribed sacrifices for sin echo the need for atonement through priestly mediation, preparing the way for the ultimate sacrifice of Christ."
    },
    {
      "pk": 14029022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 22,
      "text": "So they slaughtered the bulls, and the priests took the blood and sprinkled it on the altar. Then they slaughtered the rams and sprinkled the blood on the altar. Then they slaughtered the lambs and sprinkled the blood on the altar.",
      "links": "<a href='/AIV/03/1/5'>Lev. 1:5</a>; <a href='/AIV/58/9/21-22'>Heb. 9:21-22</a>",
      "comment": "The ritual sprinkling of blood was a sign of cleansing and atonement, pointing forward to the blood of the New Covenant (Mat. 26:28; Heb. 9:14)."
    },
    {
      "pk": 14029023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 23,
      "text": "They brought the male goats for the sin offering before the king and the assembly, and they laid their hands on them.",
      "links": "<a href='/AIV/03/4/24'>Lev. 4:24</a>; <a href='/AIV/03/16/21'>Lev. 16:21</a>",
      "comment": "Laying hands on the offering indicates transfer of sin and intercession, anticipating the belief in mediation for forgiveness."
    },
    {
      "pk": 14029024,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 24,
      "text": "The priests slaughtered them and offered their blood on the altar as a sin offering to make atonement for all Israel. For the king had commanded that the burnt offering and the sin offering be made for all Israel.",
      "links": "<a href='/AIV/03/6/30'>Lev. 6:30</a>",
      "comment": "The command for atonement for 'all Israel' demonstrates the importance of universal, corporate atonement, foreshadowing Christ’s all-encompassing sacrifice."
    },
    {
      "pk": 14029025,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 25,
      "text": "He stationed the Levites in the house of Yahweh with cymbals, harps, and lyres, as commanded by David, Gad the king’s seer, and Nathan the prophet. This command came from Yahweh through His prophets.",
      "links": "<a href='/AIV/13/23/5'>1 Chr. 23:5</a>; <a href='/AIV/13/25/1'>1 Chr. 25:1</a>",
      "comment": "Music, instituted by David and confirmed by prophetic revelation, is shown as divinely ordained for liturgical worship, reflecting order and harmony in God’s house."
    },
    {
      "pk": 14029026,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 26,
      "text": "The Levites stood with the instruments of David, and the priests with the trumpets.",
      "links": "<a href='/AIV/13/15/16'>1 Chr. 15:16</a>",
      "comment": "Levites and priests together indicate the integrated roles in worship, foreshadowing structured liturgy and the sacramental order."
    },
    {
      "pk": 14029027,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 27,
      "text": "Hezekiah gave the command to offer the burnt offering on the altar. As the burnt offering began, singing to Yahweh began, accompanied by trumpets and instruments of David, king of Israel.",
      "links": "<a href='/AIV/13/29/21'>1 Chr. 29:21</a>",
      "comment": "Worship intensifies with both sacrifice and music, pointing to the liturgical union of prayer, music, and offering in Christian worship."
    },
    {
      "pk": 14029028,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 28,
      "text": "The whole assembly worshiped, the singers sang, and the trumpets sounded. All this continued until the burnt offering was finished.",
      "links": "<a href='/AIV/19/150/6'>Ps. 150:6</a>",
      "comment": "A united assembly in worship reflects the ideal of communal praise and prayer, which is emphasized in Christian tradition."
    },
    {
      "pk": 14029029,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 29,
      "text": "When the offering was completed, the king and everyone present knelt and worshiped.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>",
      "comment": "Physically kneeling demonstrates reverence and humility, reminding us of postures in Christian liturgical practice."
    },
    {
      "pk": 14029030,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 30,
      "text": "King Hezekiah and the officials commanded the Levites to sing praises to Yahweh with the words of David and Asaph. They sang praises joyfully and bowed in worship.",
      "links": "<a href='/AIV/19/72/20'>Ps. 72:20</a>; <a href='/AIV/19/50/1'>Ps. 50:1</a>",
      "comment": "Singing the Psalms, inspired by David and Asaph, underscores the deep tradition of scriptural prayer and praise, continued in Christian worship."
    },
    {
      "pk": 14029031,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 31,
      "text": "Hezekiah said, 'You have consecrated yourselves to Yahweh. Now come near and bring sacrifices and thank offerings to Yahweh’s house.' So the assembly brought sacrifices and thank offerings, and all whose hearts were willing brought burnt offerings.",
      "links": "<a href='/AIV/03/7/11'>Lev. 7:11</a>; <a href='/AIV/14/30/22'>2 Chr. 30:22</a>",
      "comment": "Voluntary offerings represent joyful return to right worship. This prefigures the freedom to offer oneself to God, as in spiritual sacrifice (Romans 12:1)."
    },
    {
      "pk": 14029032,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 32,
      "text": "The number of burnt offerings the assembly brought was seventy bulls, one hundred rams, and two hundred lambs—all these for burnt offerings to Yahweh.",
      "links": "<a href='/AIV/04/7/88'>Num. 7:88</a>",
      "comment": "The specific numbers indicate both order and abundance, showing the generosity that marks restored faith."
    },
    {
      "pk": 14029033,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 33,
      "text": "The consecrated offerings were six hundred bulls and three thousand sheep.",
      "links": "<a href='/AIV/04/7/87'>Num. 7:87</a>",
      "comment": "The multiplication of offerings gestures toward the overflowing grace that follows true repentance and worship."
    },
    {
      "pk": 14029034,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 34,
      "text": "But there were too few priests to skin all the burnt offerings, so their brothers the Levites helped them until the work was completed and until the priests had consecrated themselves. For the Levites had been more diligent to consecrate themselves than the priests.",
      "links": "<a href='/AIV/04/18/2-3'>Num. 18:2-3</a>",
      "comment": "The cooperation of Levites and priests during this overwhelming task points to lay participation with ordained leadership, reminiscent of spiritual works carried out in unison."
    },
    {
      "pk": 14029035,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 35,
      "text": "There were also many burnt offerings, with the fat of the peace offerings and the drink offerings for the burnt offerings. So the service of the house of Yahweh was reestablished.",
      "links": "<a href='/AIV/03/3/6-11'>Lev. 3:6-11</a>; <a href='/AIV/04/15/5-7'>Num. 15:5-7</a>",
      "comment": "Reestablishment of worship marks the triumph of faithfulness and the reinstitution of proper liturgy after apostasy."
    },
    {
      "pk": 14029036,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 29,
      "verse": 36,
      "text": "Hezekiah and all the people rejoiced because God had prepared the people, for the work was accomplished quickly.",
      "links": "<a href='/AIV/19/126/2'>Ps. 126:2</a>; <a href='/AIV/16/6/15-16'>Neh. 6:15-16</a>",
      "comment": "Spiritual renewal is always the work of God, and the joy that follows restoration is an enduring sign of His presence among His people. The speed and unity of reformation show the power of communal obedience, which aligns with apostolic tradition."
    }
  ],
  "translatedAt": "2025-12-24T04:36:03.135Z"
}