{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 31,
  "verses": [
    {
      "pk": 14031001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 1,
      "text": "When all this was finished, all Israel who were present went out to the cities of Judah and broke in pieces the pillars, cut down the Asherah poles, and threw down the high places and the altars throughout all Judah and Benjamin, as well as in Ephraim and Manasseh, until they had destroyed them all. Then all the people of Israel returned to their own cities, each to his own possession.",
      "links": "<a href='/AIV/14/30/14'>2Chr 30:14</a>; <a href='/AIV/12/18/4'>2Ki 18:4</a>",
      "comment": "The people's destruction of idolatrous objects reflects thorough repentance and restoration of true worship, an essential theme leading to renewal throughout salvation history. The zeal here parallels the call for all believers to eliminate sin and false worship from their lives (<a href='/AIV/46/10/14'>1 Cor 10:14</a>)."
    },
    {
      "pk": 14031002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 2,
      "text": "Hezekiah appointed the divisions of the priests and Levites, each according to their service, as priests and Levites for burnt offerings and peace offerings, to serve, to give thanks, and to praise at the gates of the camp of the LORD.",
      "links": "<a href='/AIV/04/18/21-24'>Num 18:21-24</a>; <a href='/AIV/13/23/6'>1Chr 23:6</a>",
      "comment": "Hezekiah restores the order of ministry in accordance with the law of Moses. The clear roles reflect a divinely-instituted order in worship, reminiscent of New Testament teaching on ministry and sacramental worship."
    },
    {
      "pk": 14031003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 3,
      "text": "He appointed the king's portion from his own possessions for burnt offerings, for the morning and evening burnt offerings, and the burnt offerings for the Sabbaths, the New Moons, and the appointed feasts, as it is written in the Law of the LORD.",
      "links": "<a href='/AIV/03/6/9'>Lev 6:9</a>; <a href='/AIV/04/28/2-8'>Num 28:2-8</a>",
      "comment": "Hezekiah's personal provision for offerings points to the importance of official leaders setting a spiritual example. His obedience fulfills the Mosaic Law, a prefiguration of Christ fulfilling the law and providing the perfect sacrifice (see <a href='/AIV/40/5/17'>Matt 5:17</a>)."
    },
    {
      "pk": 14031004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 4,
      "text": "He commanded the people living in Jerusalem to give the portion due to the priests and the Levites, so that they might devote themselves to the law of the LORD.",
      "links": "<a href='/AIV/04/18/8-12'>Num 18:8-12</a>; <a href='/AIV/16/13/10'>Neh 13:10</a>",
      "comment": "By supporting the priests materially, the people enable undistracted service to God. This anticipates the New Testament principle of providing for those dedicated to ministry (<a href='/AIV/54/5/17-18'>1 Tim 5:17-18</a>)."
    },
    {
      "pk": 14031005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 5,
      "text": "As soon as the command was given, the people of Israel gave in abundance the firstfruits of grain, wine, oil, honey, and all the produce of the field, and they brought in abundantly the tithe of everything.",
      "links": "<a href='/AIV/03/27/30'>Lev 27:30</a>; <a href='/AIV/04/18/21'>Num 18:21</a>",
      "comment": "The outpouring of firstfruits and tithes shows renewed zeal in generosity to God. Tithing signaled reverence, and anticipated the fullness of giving that believers are called to show, not just in material goods but in their lives (see <a href='/AIV/47/9/7'>2 Cor 9:7</a>)."
    },
    {
      "pk": 14031006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 6,
      "text": "The people of Israel and Judah who lived in the cities of Judah also brought in the tithe of cattle and sheep, and the tithe of dedicated things that had been consecrated to the LORD their God, and laid them in heaps.",
      "links": "<a href='/AIV/03/27/32'>Lev 27:32</a>",
      "comment": "Dedicating their material wealth illustrates the total consecration expected from the faithful, prefiguring the living sacrifices Christians are called to make (<a href='/AIV/45/12/1'>Rom 12:1</a>)."
    },
    {
      "pk": 14031007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 7,
      "text": "In the third month they began to lay the heaps, and they finished them in the seventh month.",
      "links": "<a href='/AIV/03/23/16-24'>Lev 23:16-24</a>",
      "comment": "The timing highlights the faithfulness of the people over several months, showing sustained commitment. Symbolically, this points to the pattern of faithful stewardship and obedience."
    },
    {
      "pk": 14031008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 8,
      "text": "When Hezekiah and the officials came and saw the heaps, they blessed the LORD and His people Israel.",
      "links": "<a href='/AIV/01/14/19'>Gen 14:19</a>",
      "comment": "Hezekiah and the leaders recognize God’s faithfulness and the people’s generous response, issuing a blessing. The mutual exchange of blessing is a pattern seen from Abraham onward."
    },
    {
      "pk": 14031009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 9,
      "text": "Hezekiah asked the priests and the Levites about the heaps,",
      "links": "",
      "comment": "Hezekiah’s inquiry demonstrates accountable stewardship of the offerings, mirroring later Christian emphasis on transparency and responsibility in handling gifts for the ministry."
    },
    {
      "pk": 14031010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 10,
      "text": "and Azariah the chief priest, from the house of Zadok, answered him, 'Since the people began to bring the offerings into the house of the LORD, we have had enough to eat and plenty to spare, for the LORD has blessed His people, and this great amount is left over.'",
      "links": "<a href='/AIV/01/26/12'>Gen 26:12</a>; <a href='/AIV/39/3/10'>Mal 3:10</a>",
      "comment": "God’s blessing exceeds mere sufficiency, providing abundance so that His ministers are never lacking. This mirrors Christ’s later miracles of abundance (see <a href='/AIV/43/6/11-13'>John 6:11-13</a>)."
    },
    {
      "pk": 14031011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 11,
      "text": "Hezekiah commanded that chambers be prepared in the house of the LORD, and they prepared them.",
      "links": "<a href='/AIV/16/13/4-5'>Neh 13:4-5</a>",
      "comment": "Preparation of storage in God’s house for offerings shows reverence for sacred things. The principle of setting apart sacred space remains central to divine worship throughout Scripture."
    },
    {
      "pk": 14031012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 12,
      "text": "They faithfully brought in the offerings, the tithes, and the dedicated things. Conaniah the Levite was put in charge over them, and Shimei his brother was second.",
      "links": "<a href='/AIV/04/18/26'>Num 18:26</a>",
      "comment": "Entrusting the tithes to faithful Levites shows the importance of worthy ministers. Proper stewardship and clear lines of service reflect the orderliness of God’s sacred ministry."
    },
    {
      "pk": 14031013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 13,
      "text": "Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah were overseers under the hand of Conaniah and Shimei his brother, by appointment of King Hezekiah, and Azariah was the chief officer of the house of God.",
      "links": "<a href='/AIV/13/15/18'>1Chr 15:18</a>",
      "comment": "Ordained leadership with assigned responsibilities reflects divinely-ordered ministry. Leadership, oversight, and hierarchy are consistent scriptural themes for governing God’s people."
    },
    {
      "pk": 14031014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 14,
      "text": "Kore son of Imnah the Levite, the keeper of the eastern gate, was over the freewill offerings to God, distributing the offerings of the LORD and the most holy things.",
      "links": "<a href='/AIV/13/9/18-19'>1Chr 9:18-19</a>",
      "comment": "The administration of freewill offerings and the ‘most holy things’ underscores reverence for the sacred and proper administration, seen as an enduring liturgical principle."
    },
    {
      "pk": 14031015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 15,
      "text": "Under him were Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah in the cities of the priests, with trust, to distribute the portions to their brothers, great and small alike.",
      "links": "<a href='/AIV/04/18/8'>Num 18:8</a>",
      "comment": "Faithful persons are entrusted with distributing offerings to all levels of ministry. This anticipates the inclusive care and solidarity of believers in the new covenant (<a href='/AIV/44/2/44-45'>Acts 2:44-45</a>)."
    },
    {
      "pk": 14031016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 16,
      "text": "Besides those whose genealogy was listed, the males from three years old and upward, all who entered the house of the LORD for their daily service, according to their duties by their divisions.",
      "links": "<a href='/AIV/13/23/24-27'>1Chr 23:24-27</a>",
      "comment": "Genealogical order and age requirements for service demonstrate order and discipline in worship, reflecting the wisdom of established tradition and continuity."
    },
    {
      "pk": 14031017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 17,
      "text": "They were enrolled by genealogy, the priests by their ancestral households, and the Levites from twenty years old and upward, by their duties and their divisions.",
      "links": "<a href='/AIV/04/4/3'>Num 4:3</a>; <a href='/AIV/13/23/27'>1Chr 23:27</a>",
      "comment": "Clear genealogical records were needed for priestly ministry. This ancestral qualification foreshadows the unbroken continuity of spiritual leadership in God’s people."
    },
    {
      "pk": 14031018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 18,
      "text": "As well as for all their little children, their wives, and their sons and daughters, through the whole assembly—for they were entrusted with themselves faithfully in the holy things.",
      "links": "",
      "comment": "Provision for priests’ families as part of the assembly shows the wholeness of God’s household. This hints toward the communal nature of faith and responsibility for dependents."
    },
    {
      "pk": 14031019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 19,
      "text": "As for the sons of Aaron, the priests, who were in the fields of the common land assigned to their cities, in every city, men who were designated by name were to give portions to every male among the priests and to everyone listed by genealogy among the Levites.",
      "links": "<a href='/AIV/06/21/9-42'>Josh 21:9-42</a>",
      "comment": "Distributing to priests and Levites throughout the land ensured that sacred worship and service extended beyond a single temple location, a foreshadowing of the universal call to holiness."
    },
    {
      "pk": 14031020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 20,
      "text": "Hezekiah did this throughout all Judah, and he did what was good and right and faithful before the LORD his God.",
      "links": "<a href='/AIV/12/18/5'>2Ki 18:5</a>",
      "comment": "Hezekiah's leadership is commended for faithfulness and righteousness—hallmarks of true reformation and spiritual authority. His example foreshadows Christ, the faithful king and high priest."
    },
    {
      "pk": 14031021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 31,
      "verse": 21,
      "text": "And in every work that he undertook in the service of the house of God, and in the law and in the commandments, seeking his God, he did it with all his heart, and he prospered.",
      "links": "<a href='/AIV/06/1/7-8'>Josh 1:7-8</a>; <a href='/AIV/19/1/1-3'>Ps 1:1-3</a>",
      "comment": "Wholehearted devotion in both law and worship leads to blessing and success. This supports the enduring principle that authentic faith is lived out in both belief and practice—a union of faith and works, as James teaches (<a href='/AIV/59/2/14-26'>James 2:14-26</a>)."
    }
  ],
  "translatedAt": "2025-12-24T04:37:08.063Z"
}