{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 4,
  "verses": [
    {
      "pk": 14004001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 1,
      "text": "He made an altar of bronze, twenty cubits long, twenty cubits wide, and ten cubits high.",
      "links": "<a href='/AIV/11/6/20-22'>1 Kings 6:20-22</a>; <a href='/AIV/02/27/1-2'>Ex. 27:1-2</a>",
      "comment": "This altar, much larger than Moses' bronze altar (Ex. 27:1), points to the increasing grandeur of worship required of Israel as the kingdom grew. The altar symbolizes the place where atonement for sin is made, prefiguring the ultimate sacrifice of Christ on the cross."
    },
    {
      "pk": 14004002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 2,
      "text": "He made the sea of cast metal, circular in shape, ten cubits from rim to rim, five cubits tall, and thirty cubits in circumference.",
      "links": "<a href='/AIV/03/16/24'>Lev. 16:24</a>; <a href='/AIV/11/7/23'>1 Kings 7:23</a>",
      "comment": "The 'sea' served for ceremonial washing by the priests before ministering (Ex. 30:18-20). Water is a powerful symbol of spiritual purification and preparation for encountering God, foreshadowing the role of sacraments in Christian life, particularly baptism (Tit. 3:5)."
    },
    {
      "pk": 14004003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 3,
      "text": "Below the rim were figures of gourds encircling it—ten every cubit, all the way around the sea. The gourds were cast in two rows in one piece with the sea.",
      "links": "<a href='/AIV/11/7/24'>1 Kings 7:24</a>",
      "comment": "The ornamental gourds underline the beauty and order of God’s house. The sea, with its lavish decoration, reflects the perfection God desires in worship. The unity of casting shows how worship and sanctification are inseparable and not merely external."
    },
    {
      "pk": 14004004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 4,
      "text": "It stood on twelve oxen, three facing north, three facing west, three facing south, and three facing east. The sea was set upon them, and all their hindquarters were inward.",
      "links": "<a href='/AIV/04/02/2'>Num. 2:2</a>; <a href='/AIV/11/7/25'>1 Kings 7:25</a>",
      "comment": "The twelve oxen represent the twelve tribes of Israel, indicating that the spiritual life of the whole community supports the worship of God. This highlights the unity and universality intended for God’s covenant people. Early Christian commentators interpreted this as the foundation of the apostolic church."
    },
    {
      "pk": 14004005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 5,
      "text": "It was handbreadth thick, and its rim was made like the rim of a cup, like a lily blossom. It could hold three thousand baths.",
      "links": "<a href='/AIV/11/7/26'>1 Kings 7:26</a>",
      "comment": "The large capacity of the sea suggests abundance of God's grace and provision for purification. The lily shape points to beauty and purity, connecting to spiritual renewal and foreshadowing the cleansing given in the New Covenant (John 15:3)."
    },
    {
      "pk": 14004006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 6,
      "text": "He made ten basins. He placed five on the right and five on the left, to rinse what was used for the burnt offerings. The sea was for the priests to wash in.",
      "links": "<a href='/AIV/02/30/18-21'>Ex. 30:18-21</a>; <a href='/AIV/11/7/38-39'>1 Kings 7:38-39</a>",
      "comment": "The separation between the sea for priestly purification and the basins for offerings stresses the importance of distinct roles and reverence in worship—a lesson on the sacred structure God designs for his people."
    },
    {
      "pk": 14004007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 7,
      "text": "He made ten golden lampstands according to their specifications, and set them in the temple, five on the right and five on the left.",
      "links": "<a href='/AIV/02/25/31-37'>Ex. 25:31-37</a>; <a href='/AIV/66/01/12'>Rev. 1:12</a>",
      "comment": "Lampstands symbolize the light of God’s presence and the necessity of continual illumination from God. In the New Testament, lampstands represent the churches (Rev. 1:20), teaching that the apostolic community is to radiate Christ’s light to the world."
    },
    {
      "pk": 14004008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 8,
      "text": "He made ten tables and placed them in the temple, five on the right side and five on the left. He also made a hundred gold bowls.",
      "links": "<a href='/AIV/11/7/48-49'>1 Kings 7:48-49</a>",
      "comment": "The ten tables correspond to abundance in offerings and fellowship. Early interpretation sees the tables pointing to the heavenly feast and the bowls symbolizing the vessels for the sacred mysteries."
    },
    {
      "pk": 14004009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 9,
      "text": "He made the court of the priests, and the great court, and doors for the court, and overlaid the doors with bronze.",
      "links": "<a href='/AIV/02/27/9-17'>Ex. 27:9-17</a>",
      "comment": "The courts marked spaces for priestly service and the gathering of the people. The distinction of the priestly area reflects the special calling of ministers set apart for sacred service."
    },
    {
      "pk": 14004010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 10,
      "text": "He set the sea on the southeast side of the temple.",
      "links": "<a href='/AIV/11/7/39'>1 Kings 7:39</a>",
      "comment": "The specific placement of the sea has symbolic meaning. Water flowing from the temple’s east recalls images of living water flowing from God’s house (Ezek. 47:1-2), pointing to Christ as the source of spiritual life (John 7:37-39)."
    },
    {
      "pk": 14004011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 11,
      "text": "Huram also made the pots, shovels, and basins. So Huram finished making all the work that he did for King Solomon for the temple of God:",
      "links": "<a href='/AIV/11/7/40'>1 Kings 7:40</a>",
      "comment": "The mention of Huram, a craftsman, highlights the role of skilled artisans in building the house of God, suggesting that beauty and art are fitting responses to God's glory."
    },
    {
      "pk": 14004012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 12,
      "text": "the two pillars, the bowls, the two capitals on the top of the pillars, and the two latticeworks to cover the two bowls of the capitals which were on top of the pillars;",
      "links": "<a href='/AIV/11/7/41-42'>1 Kings 7:41-42</a>",
      "comment": "The pillars and their ornate decorations call to mind the stability and beauty of the faith, and the pillars are often later understood spiritually as representing apostles or church leaders supporting the temple."
    },
    {
      "pk": 14004013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 13,
      "text": "and the four hundred pomegranates for the two latticeworks—two rows of pomegranates for each latticework, to cover the two bowls of the capitals on the pillars.",
      "links": "<a href='/AIV/02/28/33-34'>Ex. 28:33-34</a>",
      "comment": "Pomegranates are symbols of fruitfulness and life. Their abundant presence around the temple evokes themes of spiritual abundance and fidelity."
    },
    {
      "pk": 14004014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 14,
      "text": "He also made the stands and the basins on the stands,",
      "links": "<a href='/AIV/11/7/43'>1 Kings 7:43</a>",
      "comment": "The stands for the basins facilitated preparation and cleansing, a reminder of the many details that go into preparing for true worship."
    },
    {
      "pk": 14004015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 15,
      "text": "the one sea and the twelve oxen under it.",
      "links": "<a href='/AIV/04/02/2'>Num. 2:2</a>",
      "comment": "Repeating the motif, the twelve oxen bear the sea, signifying all God's people supporting the life of worship and purity together, under guidance from chosen leaders."
    },
    {
      "pk": 14004016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 16,
      "text": "He made also the pots, shovels, forks, and all their utensils. Huram-abi made all these articles for King Solomon for the house of the Lord, out of polished bronze.",
      "links": "<a href='/AIV/02/27/19'>Ex. 27:19</a>",
      "comment": "The narrative repeats the array of vessels required, emphasizing the richness and fullness of temple worship. Tools for sacrifice and service are essential, highlighting the central role of sacred ministry."
    },
    {
      "pk": 14004017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 17,
      "text": "The king cast them in clay molds in the plain of the Jordan, between Succoth and Zeredah.",
      "links": "<a href='/AIV/11/7/46'>1 Kings 7:46</a>",
      "comment": "Casting large articles in clay molds signifies that even that which is destined for holy use has humble material origins. This recalls how God uses the ordinary to bring forth the extraordinary (cf. 2 Cor. 4:7)."
    },
    {
      "pk": 14004018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 18,
      "text": "Solomon made all these articles in such great quantity that the weight of the bronze could not be determined.",
      "links": "<a href='/AIV/11/7/47'>1 Kings 7:47</a>",
      "comment": "The abundance of bronze indicates the great resources poured into honoring God. There is never a limit to the glory that should be given to God (cf. Rev. 5:12-13)."
    },
    {
      "pk": 14004019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 19,
      "text": "Solomon also made all the furnishings that were in God’s house: the golden altar, the tables on which to set out the bread of the Presence,",
      "links": "<a href='/AIV/02/25/30'>Ex. 25:30</a>; <a href='/AIV/40/12/4'>Matt. 12:4</a>",
      "comment": "The bread of the Presence prefigures Christ as the Bread of Life (John 6:35). These elements were later fulfilled in the eucharistic teaching of Jesus, where bread and wine become a means of communion with God (Luke 22:19-20)."
    },
    {
      "pk": 14004020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 20,
      "text": "the lampstands of pure gold with their lamps, to burn before the inner sanctuary as prescribed;",
      "links": "<a href='/AIV/02/25/31-40'>Ex. 25:31-40</a>; <a href='/AIV/43/08/12'>John 8:12</a>",
      "comment": "Lampstands burning continually point to the ceaseless praise before God, fulfilled in the unending worship of the church and the invitation to walk as children of Light (Eph. 5:8)."
    },
    {
      "pk": 14004021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 21,
      "text": "the flowers, the lamps, and the gold tongs, all of purest gold;",
      "links": "<a href='/AIV/11/7/49'>1 Kings 7:49</a>",
      "comment": "Each small detail, made of the purest gold, further shows how nothing in God’s presence is left to chance or disorder—a call to holiness in every aspect of faith and worship."
    },
    {
      "pk": 14004022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 4,
      "verse": 22,
      "text": "the snuffers, the bowls, the dishes for incense, and the firepans, of pure gold. The doors of the temple: the inner doors for the Most Holy Place, and the doors of the main hall of the temple, were all overlaid with gold.",
      "links": "<a href='/AIV/02/30/1-10'>Ex. 30:1-10</a>; <a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>",
      "comment": "The use of gold and emphasis on access to the sanctuary foreshadow both the holiness and openness of God’s dwelling. Through Christ, believers can enter the sanctuary (Heb. 10:19-22; cf. Matt. 27:51), making visible worship a pattern of heavenly reality."
    }
  ],
  "translatedAt": "2025-12-24T04:23:17.265Z"
}