{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 11,
  "verses": [
    {
      "pk": 14011001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 1,
      "text": "When Rehoboam came to Jerusalem, he assembled the house of Judah and Benjamin, one hundred and eighty thousand chosen warriors, to fight against Israel and return the kingdom to Rehoboam.",
      "links": "<a href='/AIV/11/12/21'>1 Kgs 12:21</a>",
      "comment": "Rehoboam's instinct is to reclaim by force what was lost, echoing human impulses to self-rule apart from God's will. This showcases God’s sovereignty over the fate of Israel’s kingdom."
    },
    {
      "pk": 14011002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 2,
      "text": "But the word of the Lord came to Shemaiah the man of God, saying,",
      "links": "<a href='/AIV/13/26/6'>1 Chr 26:6</a>; <a href='/AIV/11/12/22'>1 Kgs 12:22</a>",
      "comment": "Shemaiah is recognized as a true prophet, acting as a messenger between God and the king. This mediation between God and the nation is an Old Testament prototype of the prophetic and priestly offices."
    },
    {
      "pk": 14011003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 3,
      "text": "\"Speak to Rehoboam the son of Solomon, king of Judah, and to all Israel in Judah and Benjamin, saying,",
      "links": "<a href='/AIV/11/12/23'>1 Kgs 12:23</a>",
      "comment": "Prophetic words are not given in a vacuum but are relayed to specific leaders and the gathered people. God remains deeply involved with His covenant community."
    },
    {
      "pk": 14011004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 4,
      "text": "'Thus says the Lord, You shall not go up or fight against your brothers. Return every man to his house, for this thing is from Me.'\" So they obeyed the words of the Lord and turned back from going against Jeroboam.",
      "links": "<a href='/AIV/11/11/31'>1 Kgs 11:31</a>; <a href='/AIV/11/12/24'>1 Kgs 12:24</a>",
      "comment": "The division of the kingdom was allowed by God for His purpose. Obedience to the divine command overrides political ambition—a sign of true submission to God's authority. The theme of unity and faith in divine authority prefigures the call to obedience and unity in the New Covenant church."
    },
    {
      "pk": 14011005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 5,
      "text": "Rehoboam lived in Jerusalem and built cities for defense in Judah.",
      "links": "<a href='/AIV/14/8/2'>2 Chr 8:2-6</a>",
      "comment": "In response to God’s control, Rehoboam strengthens the cities, turning to defensible order and structured authority for the nation’s safety—anticipating the value later placed on strong, established tradition and visible institutions."
    },
    {
      "pk": 14011006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 6,
      "text": "He built Bethlehem, Etam, Tekoa,",
      "links": "<a href='/AIV/06/15/59'>Josh 15:59</a>; <a href='/AIV/01/35/19'>Gen 35:19</a>",
      "comment": "These cities would become part of the spiritual and physical defense of Judah, signifying the importance of safeguarding both faith and community."
    },
    {
      "pk": 14011007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 7,
      "text": "Beth-zur, Soco, Adullam,",
      "links": "<a href='/AIV/06/15/58-59'>Josh 15:58-59</a>",
      "comment": "Each fortified city had its own legacy and was strategically important. Building cities for defense also has a spiritual analogy—building up the faith community with strong foundations."
    },
    {
      "pk": 14011008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 8,
      "text": "Gath, Mareshah, Ziph,",
      "links": "<a href='/AIV/06/15/44,55'>Josh 15:44,55</a>",
      "comment": "These were in the lowlands and southern regions, reinforcing the importance of reaching all boundaries with strongholds, foreshadowing the later mission to secure the fullness of the people of God."
    },
    {
      "pk": 14011009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 9,
      "text": "Adoraim, Lachish, Azekah,",
      "links": "<a href='/AIV/06/15/35,39'>Josh 15:35,39</a>",
      "comment": "Each city served as a stronghold amidst instability—illustrating the security that comes in a divinely ordered structure."
    },
    {
      "pk": 14011010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 10,
      "text": "Zorah, Aijalon, and Hebron, which are in Judah and Benjamin, fortified cities.",
      "links": "<a href='/AIV/06/15/33,52,54'>Josh 15:33,52,54</a>",
      "comment": "The mention of Benjamin's cities underlines unity amidst tribal divisions and God’s enduring covenant with David’s house (<a href='/AIV/10/7/12-16'>2 Sam 7:12-16</a>)."
    },
    {
      "pk": 14011011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 11,
      "text": "He made the fortifications strong, appointed commanders, and supplied them with food, oil, and wine.",
      "links": "<a href='/AIV/10/17/27-29'>2 Sam 17:27-29</a>",
      "comment": "Rehoboam ensures provision and leadership, building an ordered, sacramental society where bread and wine imply both material and potential spiritual nourishment—a foreshadowing of Christ’s future institution."
    },
    {
      "pk": 14011012,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 12,
      "text": "He put shields and spears in every city and made them exceedingly strong. So Judah and Benjamin belonged to him.",
      "links": "<a href='/AIV/09/17/45-47'>1 Sam 17:45-47</a>",
      "comment": "The emphasis is on defense and belonging, signifying the call to preserve faith and unity entrusted to leaders; a recurring theme in all ages of God’s people."
    },
    {
      "pk": 14011013,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 13,
      "text": "The priests and Levites who were throughout all Israel came and stood with him from all their regions.",
      "links": "<a href='/AIV/05/18/6-8'>Deut 18:6-8</a>; <a href='/AIV/11/12/31'>1 Kgs 12:31</a>",
      "comment": "The faithful priests and Levites leave the northern kingdom to serve where the Lord’s altar is. True worshipers are drawn to unity around legitimate sacrificial worship and authority—showing the enduring importance of right worship and apostolic succession."
    },
    {
      "pk": 14011014,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 14,
      "text": "For the Levites had left their pasture lands and possessions and went to Judah and Jerusalem, because Jeroboam and his sons had rejected them from serving as priests to the Lord.",
      "links": "<a href='/AIV/11/12/27-31'>1 Kgs 12:27-31</a>",
      "comment": "They forsake earthly gain for faithfulness to true worship. This self-denial and pilgrimage foreshadow Christ's own call to leave everything for the sake of the Kingdom (<a href='/AIV/40/19/29'>Matt 19:29</a>). Faith and worship are meant to cost something."
    },
    {
      "pk": 14011015,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 15,
      "text": "And Jeroboam appointed his own priests for the high places, for the goat idols, and for the calves that he had made.",
      "links": "<a href='/AIV/11/12/31'>1 Kgs 12:31</a>; <a href='/AIV/02/32/4'>Exod 32:4</a>",
      "comment": "Illegitimate worship undermines God’s intent for His people—a warning against schism and false doctrine. The text illustrates the consequences of breaking from authentic worship and authority (<a href='/AIV/43/4/22'>John 4:22</a>)."
    },
    {
      "pk": 14011016,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 16,
      "text": "And those from all the tribes of Israel, who set their hearts to seek the LORD, the God of Israel, came to Jerusalem to sacrifice to the LORD, the God of their fathers.",
      "links": "<a href='/AIV/05/12/11'>Deut 12:11</a>; <a href='/AIV/11/12/27'>1 Kgs 12:27</a>",
      "comment": "All true worshipers gather in Jerusalem, united in right faith and sacrifice. This points to the later unity and universality of God’s people in true worship centered on the one sacrifice, fulfilled in Christ (<a href='/AIV/58/10/11-14'>Heb 10:11-14</a>)."
    },
    {
      "pk": 14011017,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 17,
      "text": "So they strengthened the kingdom of Judah, and supported Rehoboam, the son of Solomon, for three years, for they walked in the way of David and Solomon those three years.",
      "links": "<a href='/AIV/10/5/10'>2 Sam 5:10</a>",
      "comment": "Faithfulness strengthens the community and its leaders. There is blessing in unity under divinely appointed authority, echoing the principle of apostolic foundation (<a href='/AIV/49/2/20'>Eph 2:20</a>)."
    },
    {
      "pk": 14011018,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 18,
      "text": "Rehoboam took as wife Mahalath, daughter of Jerimoth son of David, and of Abihail, daughter of Eliab son of Jesse.",
      "links": "<a href='/AIV/13/3/6-8'>1 Chr 3:6-8</a>",
      "comment": "Rehoboam’s marriage strengthens ties within the Davidic lineage. The Davidic promises are preserved in this house, ultimately fulfilled in Jesus, son of David (<a href='/AIV/40/1/1'>Matt 1:1</a>)."
    },
    {
      "pk": 14011019,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 19,
      "text": "She bore him sons: Jeush, Shemariah, and Zaham.",
      "links": "<a href='/AIV/13/3/23'>1 Chr 3:23</a>",
      "comment": "The chronicler carefully records descendants, signaling the importance of succession and continuity—a theme carried into the New Covenant’s emphasis on a living tradition."
    },
    {
      "pk": 14011020,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 20,
      "text": "After her, he took Maacah the daughter of Absalom, who bore him Abijah, Attai, Ziza, and Shelomith.",
      "links": "<a href='/AIV/13/3/10'>1 Chr 3:10</a>",
      "comment": "The presence of royal names reveals the preservation of the Messianic line, underscoring typology pointing to Christ, the perfect Son of David."
    },
    {
      "pk": 14011021,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 21,
      "text": "Rehoboam loved Maacah the daughter of Absalom more than all his other wives and concubines. He had eighteen wives and sixty concubines, and fathered twenty-eight sons and sixty daughters.",
      "links": "<a href='/AIV/11/11/3'>1 Kgs 11:3</a>",
      "comment": "Rehoboam followed some customs of his father and grandfather, yet the chronicler records these with little praise. The Gospel elevates the dignity of marriage to a sacrament reflecting the union between Christ and His Church (<a href='/AIV/49/5/31-32'>Eph 5:31-32</a>)."
    },
    {
      "pk": 14011022,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 22,
      "text": "Rehoboam appointed Abijah, the son of Maacah, as chief, leader among his brothers. He intended to make him king.",
      "links": "<a href='/AIV/13/3/10'>1 Chr 3:10</a>",
      "comment": "Succession through chosen leadership shows intentionality in passing on the royal line, a pattern reflected in carefully chosen leaders throughout salvation history (<a href='/AIV/44/1/24-26'>Acts 1:24-26</a>)."
    },
    {
      "pk": 14011023,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 11,
      "verse": 23,
      "text": "He acted wisely and dispersed some of his sons throughout all the regions of Judah and Benjamin, in every fortified city, and gave them abundant provisions, and found many wives for them.",
      "links": "<a href='/AIV/13/3/23'>1 Chr 3:23</a>",
      "comment": "Wise rule distributes authority and resource for the good of the whole community. This wisdom foreshadows the later sharing of responsibility among the overseers of God’s people (<a href='/AIV/44/20/28'>Acts 20:28</a>)."
    }
  ],
  "translatedAt": "2025-12-24T04:27:25.584Z"
}