{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 34,
  "verses": [
    {
      "pk": 1933401,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 1,
      "text": "Josiah was eight years old when he became king, and he reigned in Jerusalem thirty-one years.",
      "links": "<a href='/AIV/12/22/1'>2 Kings 22:1</a>",
      "comment": "See also 2 Kings 22:1. The age and length of Josiah's reign are consistent with the Hebrew text."
    },
    {
      "pk": 1933402,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 2,
      "text": "He did what was right in the eyes of the Lord and walked in the ways of his father David; he did not turn aside to the right or to the left.",
      "links": "<a href='/AIV/12/22/2'>2 Kings 22:2</a>; <a href='/AIV/11/3/6'>1 Kings 3:6</a>",
      "comment": "'Father' David means ancestor, as in common biblical usage."
    },
    {
      "pk": 1933403,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 3,
      "text": "In the eighth year of his reign, while he was still young, he began to seek the God of his father David; and in the twelfth year he began to purge Judah and Jerusalem of the high places, the Asherah poles, the carved images, and metal idols.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>; <a href='/AIV/14/15/8'>2 Chr. 15:8</a>",
      "comment": "The term 'Asherah poles' translates the Hebrew asherim."
    },
    {
      "pk": 1933404,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 4,
      "text": "They tore down the altars of the Baals in his presence, and he chopped down the incense altars that stood above them; he broke up the Asherah poles, the carved images, and the metal idols, ground them to powder, and scattered the dust over the graves of those who had sacrificed to them.",
      "links": "<a href='/AIV/12/23/4'>2 Kings 23:4</a>; <a href='/AIV/14/15/16'>2 Chr. 15:16</a>",
      "comment": "The verbs reflect energetic destruction as described in the Hebrew."
    },
    {
      "pk": 1933405,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 5,
      "text": "He burned the bones of the priests on their altars and so cleansed Judah and Jerusalem.",
      "links": "<a href='/AIV/12/23/16'>2 Kings 23:16</a>",
      "comment": "This reflects an act of desecration against pagan altars."
    },
    {
      "pk": 1933406,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 6,
      "text": "In the towns of Manasseh, Ephraim, Simeon, and as far as Naphtali—in their ruins all around—",
      "links": "<a href='/AIV/12/23/19'>2 Kings 23:19</a>",
      "comment": "'Ruins' (literally, 'in their desolated places') reflects the destruction in the northern kingdom."
    },
    {
      "pk": 1933407,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 7,
      "text": "he tore down the altars and the Asherah poles, ground the idols to powder, and cut to pieces all the incense altars throughout all the land of Israel. Then he returned to Jerusalem.",
      "links": "<a href='/AIV/12/23/15-20'>2 Kings 23:15–20</a>",
      "comment": "Indicates Josiah's reforms stretched even into the former northern territory."
    },
    {
      "pk": 1933408,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 8,
      "text": "In the eighteenth year of his reign, after he had cleansed the land and the temple, he sent Shaphan son of Azaliah, Maaseiah the governor of the city, and Joah son of Joahaz the recorder, to repair the house of the Lord his God.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>",
      "comment": "'House of the Lord' is the temple; this matches the 2 Kings parallel account."
    },
    {
      "pk": 1933409,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 9,
      "text": "They came to Hilkiah the high priest and delivered the money that had been brought into the house of God, which the Levites, the doorkeepers, had collected from Manasseh, Ephraim, all the remnant of Israel, and from all Judah, Benjamin, and the inhabitants of Jerusalem.",
      "links": "<a href='/AIV/12/22/4'>2 Kings 22:4</a>",
      "comment": "Lists all contributing tribes, showing the collection included the northern tribes."
    },
    {
      "pk": 1933410,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 10,
      "text": "They handed it over to those appointed to supervise the work on the house of the Lord, who gave it to the workmen repairing and restoring the house of the Lord.",
      "links": "<a href='/AIV/12/22/5'>2 Kings 22:5</a>",
      "comment": "'appointed' means literally 'given into the hand of the overseers.'"
    },
    {
      "pk": 1933411,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 11,
      "text": "They gave it to the carpenters and the builders to buy dressed stones and timber for beams, and to repair the buildings the kings of Judah had let fall into ruin.",
      "links": "<a href='/AIV/12/22/6'>2 Kings 22:6</a>",
      "comment": "The word 'beams' translates the Hebrew 'for couplings and beams for the houses.'"
    },
    {
      "pk": 1933412,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 12,
      "text": "The men did the work faithfully. Their overseers were Jahath and Obadiah, Levites of the sons of Merari; and Zechariah and Meshullam, of the sons of the Kohathites, to supervise. Other Levites, all who were skilled with instruments of music,",
      "links": "<a href='/AIV/13/6/44-47'>1 Chronicles 6:44–47</a>",
      "comment": "Skilled Levites for music were involved in oversight, per the Hebrew structure."
    },
    {
      "pk": 1933413,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 13,
      "text": "were in charge of the laborers and supervised all the workers in every kind of service. Some of the Levites were scribes, officials, and gatekeepers.",
      "links": "<a href='/AIV/13/23/4-5'>1 Chronicles 23:4–5</a>",
      "comment": "Lists main Levitical duties."
    },
    {
      "pk": 1933414,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 14,
      "text": "While they were bringing out the money brought into the house of the Lord, Hilkiah the priest found the Book of the Law of the Lord given by Moses.",
      "links": "<a href='/AIV/12/22/8'>2 Kings 22:8</a>",
      "comment": "The phrase 'Book of the Law of the Lord given by Moses' renders literally the Hebrew."
    },
    {
      "pk": 1933415,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 15,
      "text": "Hilkiah announced to Shaphan the scribe, \"I have found the Book of the Law in the house of the Lord.\" And Hilkiah gave the book to Shaphan.",
      "links": "<a href='/AIV/12/22/8'>2 Kings 22:8</a>",
      "comment": "The announcement is quoted as in the Hebrew text."
    },
    {
      "pk": 1933416,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 16,
      "text": "Shaphan brought the book to the king and gave a report to the king, saying, \"Your servants are doing all that was commanded them.\"",
      "links": "<a href='/AIV/12/22/9'>2 Kings 22:9</a>",
      "comment": "Holds closely to the original dialogue format."
    },
    {
      "pk": 1933417,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 17,
      "text": "\"They have poured out the money that was found in the house of the Lord and have delivered it into the hands of the overseers and those who do the work.\"",
      "links": "<a href='/AIV/12/22/9'>2 Kings 22:9</a>",
      "comment": "Rendered as direct speech for clarity, in line with the Hebrew."
    },
    {
      "pk": 1933418,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 18,
      "text": "Then Shaphan the scribe told the king, \"Hilkiah the priest has given me a book.\" Shaphan read from it before the king.",
      "links": "<a href='/AIV/12/22/10'>2 Kings 22:10</a>",
      "comment": "The phrase 'read from it' captures the partial reading in Hebrew."
    },
    {
      "pk": 1933419,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 19,
      "text": "When the king heard the words of the Law, he tore his clothes.",
      "links": "<a href='/AIV/12/22/11'>2 Kings 22:11</a>; <a href='/AIV/15/9/3'>Ezra 9:3</a>",
      "comment": "Tearing clothes is a sign of grief or distress."
    },
    {
      "pk": 1933420,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 20,
      "text": "Then the king commanded Hilkiah, Ahikam son of Shaphan, Abdon son of Micah, Shaphan the scribe, and Asaiah, the king's servant, saying,",
      "links": "<a href='/AIV/12/22/12'>2 Kings 22:12</a>",
      "comment": "'Abdon son of Micah' is called 'Achbor' in 2 Kings 22:12—this translation preserves the Chronicler’s name."
    },
    {
      "pk": 1933421,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 21,
      "text": "\"Go, inquire of the Lord for me and for the remnant in Israel and in Judah concerning the words of the book that has been found. For great is the Lord's wrath that is poured out on us, because our fathers have not kept the word of the Lord, to do all that is written in this book.\"",
      "links": "<a href='/AIV/12/22/13'>2 Kings 22:13</a>",
      "comment": "Reflects the threat of divine judgment for disobedience."
    },
    {
      "pk": 1933422,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 22,
      "text": "So Hilkiah and those the king had appointed went to Huldah the prophetess, the wife of Shallum son of Tokhath, son of Hasrah, keeper of the wardrobe—she lived in Jerusalem, in the Second Quarter—and they spoke to her about this.",
      "links": "<a href='/AIV/12/22/14'>2 Kings 22:14</a>",
      "comment": "'Second Quarter' translates 'Mishneh,' likely a district of Jerusalem."
    },
    {
      "pk": 1933423,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 23,
      "text": "She said to them, \"Thus says the Lord, the God of Israel: Tell the man who sent you to me,",
      "links": "<a href='/AIV/12/22/15'>2 Kings 22:15</a>",
      "comment": "Prophetic message formula is preserved."
    },
    {
      "pk": 1933424,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 24,
      "text": "'Thus says the Lord: Behold, I will bring disaster upon this place and upon its inhabitants—all the curses that are written in the book which they have read before the king of Judah—'",
      "links": "<a href='/AIV/12/22/16'>2 Kings 22:16</a>; <a href='/AIV/05/28/15'>Deut. 28:15ff</a>",
      "comment": "Alludes to the covenant curses found in the Torah."
    },
    {
      "pk": 1933425,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 25,
      "text": "'because they have forsaken me and have burned incense to other gods, so that they aroused my anger with all the works of their hands. Therefore, my wrath will be poured out on this place, and it will not be quenched.'",
      "links": "<a href='/AIV/11/14/9-10'>1 Kings 14:9-10</a>",
      "comment": "'My wrath will not be quenched' appears in the Hebrew as part of God’s judgment."
    },
    {
      "pk": 1933426,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 26,
      "text": "'But to the king of Judah, who sent you to inquire of the Lord, thus you shall say to him: Thus says the Lord, the God of Israel: Regarding the words you have heard,",
      "links": "<a href='/AIV/12/22/18'>2 Kings 22:18</a>",
      "comment": "This transition closely follows the Hebrew and parallel passage."
    },
    {
      "pk": 1933427,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 27,
      "text": "'Because your heart was tender and you humbled yourself before God when you heard his words against this place and its inhabitants, and because you humbled yourself before me, tore your clothes, and wept before me, I also have heard you, declares the Lord.'",
      "links": "<a href='/AIV/12/22/19'>2 Kings 22:19</a>",
      "comment": "God’s acceptance of Josiah’s repentance is explicit in the Hebrew."
    },
    {
      "pk": 1933428,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 28,
      "text": "'Behold, I will gather you to your fathers, and you shall be gathered to your grave in peace. Your eyes shall not see all the disaster that I will bring on this place and its inhabitants.' So they brought back this word to the king.",
      "links": "<a href='/AIV/12/22/20'>2 Kings 22:20</a>",
      "comment": "'Gathered to your fathers' is an idiom for death and burial."
    },
    {
      "pk": 1933429,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 29,
      "text": "Then the king sent and gathered all the elders of Judah and Jerusalem.",
      "links": "<a href='/AIV/12/23/1'>2 Kings 23:1</a>",
      "comment": "The king's call to gather the elders is literal in the original."
    },
    {
      "pk": 1933430,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 30,
      "text": "The king went up to the house of the Lord, and all the men of Judah, the inhabitants of Jerusalem, the priests and the Levites, and all the people, both great and small. He read in their hearing all the words of the Book of the Covenant which had been found in the house of the Lord.",
      "links": "<a href='/AIV/12/23/2'>2 Kings 23:2</a>",
      "comment": "The phrase 'great and small' follows the typical Hebrew form."
    },
    {
      "pk": 1933431,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 31,
      "text": "Then the king stood in his place and made a covenant before the Lord, to walk after the Lord, to keep his commandments, his testimonies, and his statutes, with all his heart and all his soul, to perform the words of the covenant that were written in this book.",
      "links": "<a href='/AIV/05/6/5'>Deut. 6:5</a>; <a href='/AIV/12/23/3'>2 Kings 23:3</a>",
      "comment": "'Stood in his place' means 'stood by his pillar,' a formal area in the temple."
    },
    {
      "pk": 1933432,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 32,
      "text": "He made all who were present in Jerusalem and Benjamin stand to it. So the inhabitants of Jerusalem did according to the covenant of God, the God of their fathers.",
      "links": "<a href='/AIV/14/15/12-15'>2 Chr. 15:12–15</a>",
      "comment": "'Stand to it' means entering into covenantal agreement."
    },
    {
      "pk": 1933433,
      "translation": "AIV",
      "book": 14,
      "chapter": 34,
      "verse": 33,
      "text": "Josiah removed all the abominations from all the territories that belonged to the children of Israel, and he made all who were present in Israel serve the Lord their God. All his days they did not turn aside from following the Lord, the God of their fathers.",
      "links": "<a href='/AIV/12/23/4-25'>2 Kings 23:4–25</a>",
      "comment": "Summarizes Josiah’s reforms and the nation's faithfulness during his reign."
    }
  ],
  "translatedAt": "2025-12-22T19:27:28.039Z"
}