{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 5,
  "verses": [
    {
      "pk": 2005001,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 1,
      "text": "So all the work that Solomon did for the house of the LORD was finished. Solomon brought in the things that his father David had dedicated—the silver, the gold, and all the vessels—and put them in the treasuries of the house of God.",
      "links": "<a href='/ESV/11/7/51'>1 Kings 7:51</a>; <a href='/ESV/13/18/11'>1 Chron. 18:11</a>",
      "comment": "Closely follows the Hebrew structure; 'dedicated things' clarified as 'things that his father David had dedicated.'"
    },
    {
      "pk": 2005002,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 2,
      "text": "Then Solomon gathered the elders of Israel and all the heads of the tribes, the leaders of the fathers’ houses of the people of Israel, in Jerusalem to bring up the ark of the covenant of the LORD out of the city of David, which is Zion.",
      "links": "<a href='/ESV/11/8/1'>1 Kings 8:1</a>; <a href='/ESV/10/6/12'>2 Sam. 6:12</a>",
      "comment": "‘City of David, which is Zion’ retained for accuracy."
    },
    {
      "pk": 2005003,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 3,
      "text": "And all the men of Israel assembled before the king at the feast that is in the seventh month.",
      "links": "<a href='/ESV/03/23/34'>Lev. 23:34</a>; <a href='/ESV/16/8/2'>Neh. 8:2</a>",
      "comment": "'Feast in the seventh month' refers to the Feast of Booths/Tabernacles."
    },
    {
      "pk": 2005004,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 4,
      "text": "And all the elders of Israel came, and the Levites took up the ark.",
      "links": "<a href='/ESV/11/8/3'>1 Kings 8:3</a>",
      "comment": "No additional note; direct translation."
    },
    {
      "pk": 2005005,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 5,
      "text": "They brought up the ark, the tent of meeting, and all the holy vessels that were in the tent; the Levitical priests brought them up.",
      "links": "<a href='/ESV/04/4/5-15'>Num. 4:5-15</a>",
      "comment": "‘Levitical priests’ is more precise than just ‘priests’ to clarify tribal identity."
    },
    {
      "pk": 2005006,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 6,
      "text": "King Solomon and all the congregation of Israel, who had assembled before him, were before the ark, sacrificing so many sheep and oxen that they could not be counted or numbered for multitude.",
      "links": "<a href='/ESV/11/8/5'>1 Kings 8:5</a>",
      "comment": "Literal rendering of the impossibility of counting the sacrifices."
    },
    {
      "pk": 2005007,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 7,
      "text": "Then the priests brought the ark of the covenant of the LORD to its place, in the inner sanctuary of the house, in the Most Holy Place, under the wings of the cherubim.",
      "links": "<a href='/ESV/11/6/23-28'>1 Kings 6:23-28</a>",
      "comment": "‘Most Holy Place’ is a common rendering for ‘Holy of Holies.’"
    },
    {
      "pk": 2005008,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 8,
      "text": "For the cherubim spread out their wings over the place of the ark, so that the cherubim covered both the ark and its poles from above.",
      "links": "<a href='/ESV/02/25/20'>Ex. 25:20</a>",
      "comment": "Direct translation; no change to original meaning."
    },
    {
      "pk": 2005009,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 9,
      "text": "And the poles were so long that the ends of the poles were seen from the Holy Place in front of the inner sanctuary, but they could not be seen from outside. And they are there to this day.",
      "links": "<a href='/ESV/11/8/8'>1 Kings 8:8</a>",
      "comment": "Includes 'to this day,' indicating the time of writing."
    },
    {
      "pk": 2005010,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 10,
      "text": "There was nothing in the ark except the two tablets that Moses put there at Horeb, where the LORD made a covenant with the people of Israel when they came out of Egypt.",
      "links": "<a href='/ESV/05/10/2'>Deut. 10:2</a>; <a href='/ESV/02/34/1'>Ex. 34:1</a>",
      "comment": "'Horeb' is the same as Sinai; no other items mentioned for clarity."
    },
    {
      "pk": 2005011,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 11,
      "text": "And when the priests came out of the Holy Place—for all the priests who were present had consecrated themselves, without regard to their divisions—",
      "links": "<a href='/ESV/11/8/10'>1 Kings 8:10</a>",
      "comment": "The parenthetical structure mirrors the original Hebrew style; 'without regard to their divisions' reflects the literal sense."
    },
    {
      "pk": 2005012,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 12,
      "text": "and all the Levitical singers—Asaph, Heman, Jeduthun, their sons and relatives, clothed in fine linen, with cymbals, harps, and lyres—were standing east of the altar, and with them a hundred and twenty priests blowing trumpets;",
      "links": "<a href='/ESV/13/16/41-42'>1 Chron. 16:41-42</a>",
      "comment": "Names of Levitical singers preserved. 'Relatives' as a more precise modern term for 'brothers.'"
    },
    {
      "pk": 2005013,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 13,
      "text": "and it was the duty of the trumpeters and singers to make themselves heard in unison in praise and thanksgiving to the LORD. When the song was raised, with trumpets and cymbals and other musical instruments, in praise to the LORD, 'For he is good, for his steadfast love endures forever,' the house, the house of the LORD, was filled with a cloud,",
      "links": "<a href='/ESV/19/136/1'>Ps. 136:1</a>; <a href='/ESV/11/8/10'>1 Kings 8:10</a>",
      "comment": "'Steadfast love' is a faithful, common translation of 'chesed.'"
    },
    {
      "pk": 2005014,
      "translation": "AIV",
      "book": 14,
      "chapter": 5,
      "verse": 14,
      "text": "so that the priests could not stand to minister because of the cloud, for the glory of the LORD filled the house of God.",
      "links": "<a href='/ESV/02/40/35'>Ex. 40:35</a>; <a href='/ESV/11/8/11'>1 Kings 8:11</a>",
      "comment": "Simple, direct rendering; clarifies the reason for priestly inability to stand was ‘the cloud’ (the glory)."
    }
  ],
  "translatedAt": "2025-12-22T10:59:57.894Z"
}