{
  "book": 14,
  "bookName": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 19,
  "verses": [
    {
      "pk": 14019001,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 1,
      "text": "Jehoshaphat, king of Judah, returned safe to his house in Jerusalem.",
      "links": "<a href='/AIV/11/22/27-28'>1 Kgs 22:27-28</a>;<a href='/AIV/14/18/28'>2 Chr 18:28</a>",
      "comment": "Jehoshaphat's safe return highlights God's protection for faithful leaders, despite past mistakes (see 2 Chr 18). The journey home after spiritual battles is often symbolic of repentance and return to right worship."
    },
    {
      "pk": 14019002,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 2,
      "text": "Then Jehu, son of Hanani the seer, went out to meet him, and said to King Jehoshaphat, 'Should you help the wicked and love those who hate the LORD? Because of this, wrath has come upon you from the LORD.'",
      "links": "<a href='/AIV/11/16/1'>1 Kgs 16:1</a>;<a href='/AIV/19/139/21-22'>Ps. 139:21-22</a>;<a href='/AIV/14/18/1'>2 Chr 18:1</a>",
      "comment": "Jehu the prophet confronts Jehoshaphat for his alliance with Ahab—a warning against compromising with evil. The phrase 'wrath has come' points to God's justice, foreshadowing judgment but leaving room for repentance and restoration."
    },
    {
      "pk": 14019003,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 3,
      "text": "Nevertheless, some good is found in you, for you have removed the Asherah poles from the land and have set your heart to seek God.",
      "links": "<a href='/AIV/14/17/6'>2 Chr 17:6</a>;<a href='/AIV/05/16/21'>Deut. 16:21</a>",
      "comment": "Despite failings, Jehoshaphat is commended for purging idolatry and his sincere pursuit of God. Setting his heart to seek God displays the role of personal intention and disciplined worship, an important Old Testament theme that foreshadows Christ's call to pure devotion (Matt 6:33)."
    },
    {
      "pk": 14019004,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 4,
      "text": "So Jehoshaphat lived in Jerusalem and again went out among the people, from Beersheba as far as the hill country of Ephraim, and brought them back to the LORD, the God of their ancestors.",
      "links": "<a href='/AIV/06/21/1'>Josh. 21:1</a>;<a href='/AIV/14/15/8-9'>2 Chr 15:8-9</a>",
      "comment": "Jehoshaphat's ministry of restoration covers the full land, reflecting a shepherd-like concern for spiritual unity. His action echoes the role of spiritual leaders to draw people together in the true worship and apostolic faith passed down from the fathers."
    },
    {
      "pk": 14019005,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 5,
      "text": "He appointed judges in the land, in each of the fortified cities of Judah, city by city.",
      "links": "<a href='/AIV/05/16/18'>Deut. 16:18</a>;<a href='/AIV/02/18/25-26'>Ex. 18:25-26</a>",
      "comment": "Appointing judges shows a concern for justice at every level of society, which mirrors the biblical pattern of local and universal governance within the community of faith."
    },
    {
      "pk": 14019006,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 6,
      "text": "He said to the judges, 'Consider what you are doing. You judge not for man but for the LORD, who is with you in your giving of judgment.'",
      "links": "<a href='/AIV/05/1/17'>Deut. 1:17</a>;<a href='/AIV/20/29/26'>Prov. 29:26</a>",
      "comment": "This principle—that judges serve under divine authority—foreshadows the Christian understanding of leaders acting on behalf of God. It elevates the importance of righteous judgment and points toward the ultimate Judge, Christ (John 5:22)."
    },
    {
      "pk": 14019007,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 7,
      "text": "Now then, let the fear of the LORD be upon you. Be careful what you do, for there is no injustice with the LORD our God, nor partiality or taking of bribes.",
      "links": "<a href='/AIV/05/10/17'>Deut. 10:17</a>;<a href='/AIV/45/2/11'>Rom. 2:11</a>",
      "comment": "The command to act in the fear of God and reflect His justice and impartiality undergirds the call for integrity among those with spiritual authority, an enduring principle in apostolic tradition (see Acts 10:34)."
    },
    {
      "pk": 14019008,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 8,
      "text": "Moreover, in Jerusalem Jehoshaphat appointed some of the Levites, priests, and heads of families of Israel to give judgment for the LORD and to settle disputes. They lived in Jerusalem.",
      "links": "<a href='/AIV/05/17/9'>Deut. 17:9</a>;<a href='/AIV/14/29/4'>2 Chr 29:4</a>",
      "comment": "The combination of Levites, priests, and elders in judgment shows a unified system of authority in faith and morals. This marks a spiritual order that corresponds to later structures recognized in the apostolic age (Acts 15:2, 6)."
    },
    {
      "pk": 14019009,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 9,
      "text": "He commanded them, saying, 'Thus you shall do in the fear of the LORD, in faithfulness, and with your whole heart.'",
      "links": "<a href='/AIV/05/6/5'>Deut. 6:5</a>;<a href='/AIV/13/28/9'>1 Chr 28:9</a>",
      "comment": "Ministry in faithfulness and with the whole heart prefigures Christ's summary of the law (Mark 12:30). Serving in the fear of God and full sincerity remains central to true spiritual service."
    },
    {
      "pk": 14019010,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 10,
      "text": "Whenever any dispute comes to you from your brothers who live in their cities, concerning blood or law or commandment, statutes or ordinances, you are to warn them, so that they do not become guilty before the LORD and wrath does not come upon you and your brothers. Do this, and you will not be guilty.",
      "links": "<a href='/AIV/05/17/8-12'>Deut. 17:8-12</a>;<a href='/AIV/03/19/17'>Lev. 19:17</a>",
      "comment": "The role of warning and correction given to the appointed leaders aligns with the scriptural model of spiritual authority entrusted with guarding doctrine and morals. This anticipates the ministry of binding and loosing given to the apostles (Matt 16:19; John 20:23)."
    },
    {
      "pk": 14019011,
      "translation": "AIV",
      "book": 14,
      "bookName": "2 Chronicles",
      "bookAbbreviation": "2Chr",
      "chapter": 19,
      "verse": 11,
      "text": "And behold, Amariah the chief priest is over you in all matters of the LORD, and Zebadiah the son of Ishmael, the ruler of the house of Judah, in all the king's matters. The Levites will serve as officers before you. Be strong and act courageously. May the LORD be with the upright.",
      "links": "<a href='/AIV/15/2/2'>Ezra 2:2</a>;<a href='/AIV/06/1/9'>Josh. 1:9</a>",
      "comment": "Here, the distinction between spiritual and civil authority is affirmed, yet they work in harmony. The central role of the chief priest prefigures the leadership structure Christ established among the apostles and continues in unified apostolic succession. The encouragement to be strong and act courageously recalls the promise of God's presence to those who uphold truth and unity (Josh 1:9)."
    }
  ],
  "translatedAt": "2025-12-24T04:30:56.770Z"
}