{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 23,
  "verses": [
    {
      "pk": 2392301,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 1,
      "text": "In the seventh year, Jehoiada showed strength and made a covenant with the captains of hundreds: Azariah son of Jeroham, Ishmael son of Jehohanan, Azariah son of Obed, Maaseiah son of Adaiah, and Elishaphat son of Zichri.",
      "links": "<a href='/AIV/12/11/4'>2 Kings 11:4</a>",
      "comment": "Lists the names as in the Masoretic text, matching the parallel account in 2 Kings."
    },
    {
      "pk": 2392302,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 2,
      "text": "They traveled throughout Judah and gathered the Levites and leading fathers of Israel from all the cities, and they came to Jerusalem.",
      "links": "<a href='/AIV/12/11/4'>2 Kings 11:4</a>",
      "comment": "The mention of Levites is a Chronicles-only detail, highlighting priestly roles."
    },
    {
      "pk": 2392303,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 3,
      "text": "All the congregation made a covenant with the king in the house of God. Jehoiada said to them, \"See, the king's son shall reign, as the LORD spoke concerning the descendants of David.\"",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>; <a href='/AIV/13/17/12'>1 Chr. 17:12</a>",
      "comment": "Direct reference to God's promise about David's line."
    },
    {
      "pk": 2392304,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 4,
      "text": "\"This is what you are to do: one third of you, priests and Levites entering on the Sabbath, will guard the doors.",
      "links": "<a href='/AIV/12/11/5'>2 Kings 11:5</a>",
      "comment": "Explicates the division of duties among the Levites."
    },
    {
      "pk": 2392305,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 5,
      "text": "One third will be stationed at the king’s palace, and another third at the Foundation Gate. All the people will be in the courtyards of the house of the LORD.",
      "links": "<a href='/AIV/12/11/6'>2 Kings 11:6</a>",
      "comment": "Specific gate names may differ in translations; 'Foundation Gate' is literal."
    },
    {
      "pk": 2392306,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 6,
      "text": "\"Let no one enter the house of the LORD except the priests and those Levites who serve; let all the rest of the people guard their assigned duties outside.",
      "links": "<a href='/AIV/4/18/7'>Num. 18:7</a>",
      "comment": "Highlights the set-apartness of priests and Levites for temple service."
    },
    {
      "pk": 2392307,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 7,
      "text": "The Levites shall surround the king, each with weapons in hand; anyone who tries to enter the house shall be put to death. You must stay close to the king wherever he goes.",
      "links": "<a href='/AIV/12/11/8'>2 Kings 11:8</a>",
      "comment": "Follows MT text—emphasizes security detail for the king."
    },
    {
      "pk": 2392308,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 8,
      "text": "So the Levites and all Judah did exactly as Jehoiada the priest commanded. Each man took his men who were on duty on the Sabbath, together with those who were off duty, because Jehoiada did not dismiss any division.",
      "links": "<a href='/AIV/12/11/9'>2 Kings 11:9</a>",
      "comment": "Keeps language from Hebrew text about active and relieved divisions."
    },
    {
      "pk": 2392309,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 9,
      "text": "Jehoiada the priest gave the commanders of hundreds the spears and large and small shields that King David had dedicated, which were in the house of God.",
      "links": "<a href='/AIV/12/11/10'>2 Kings 11:10</a>; <a href='/AIV/13/18/7-9'>1 Chr. 18:7-9</a>",
      "comment": "Matches parallel texts about David's dedicated arms."
    },
    {
      "pk": 2392310,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 10,
      "text": "He stationed all the people, every man with his weapon in hand, from the south side of the temple to the north side, beside the altar and the temple, surrounding the king.",
      "links": "<a href='/AIV/12/11/11'>2 Kings 11:11</a>",
      "comment": "Describes the defensive arrangement of men, matching Kings."
    },
    {
      "pk": 2392311,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 11,
      "text": "Then they brought out the king's son and put the crown on him, and gave him the testimony. They made him king. Jehoiada and his sons anointed him and said, \"Long live the king!\"",
      "links": "<a href='/AIV/12/11/12'>2 Kings 11:12</a>; <a href='/AIV/5/17/18-20'>Deut. 17:18-20</a>",
      "comment": "\"Testimony\" here refers to the law scroll, as given to Israel's kings."
    },
    {
      "pk": 2392312,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 12,
      "text": "When Athaliah heard the noise of the people running and cheering the king, she came to the house of the LORD, to the people.",
      "links": "<a href='/AIV/12/11/13'>2 Kings 11:13</a>",
      "comment": "Maintains the original's sense of urgency and confusion."
    },
    {
      "pk": 2392313,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 13,
      "text": "She looked, and there was the king standing by his pillar at the entrance. The officers and the trumpeters were beside him, and all the people rejoiced and blew trumpets, and the singers with musical instruments led the singing. Then Athaliah tore her clothes and cried, \"Treason! Treason!\"",
      "links": "<a href='/AIV/12/11/14'>2 Kings 11:14</a>",
      "comment": "\"Pillar at the entrance\" echoes the Hebrew, a significant place for the king."
    },
    {
      "pk": 2392314,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 14,
      "text": "Jehoiada the priest brought out the captains over hundreds who were set over the army and said, \"Take her out between the ranks, and kill anyone who follows her.\" For the priest had said, \"Do not put her to death in the house of the LORD.\"",
      "links": "<a href='/AIV/12/11/15'>2 Kings 11:15</a>",
      "comment": "Translation clarifies that Athaliah is led out away from the holy place for execution."
    },
    {
      "pk": 2392315,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 15,
      "text": "So they seized her; and when she arrived at the entrance to the Horse Gate by the king’s palace, they put her to death there.",
      "links": "<a href='/AIV/12/11/16'>2 Kings 11:16</a>",
      "comment": "Chronicles adds the detail about the Horse Gate location more specifically than Kings."
    },
    {
      "pk": 2392316,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 16,
      "text": "Jehoiada made a covenant between himself, all the people, and the king, that they would be the LORD’s people.",
      "links": "<a href='/AIV/12/11/17'>2 Kings 11:17</a>; <a href='/AIV/2/19/5'>Gen. 19:5</a>",
      "comment": "Covenant language is emphasized, a central theme in Chronicles."
    },
    {
      "pk": 2392317,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 17,
      "text": "All the people went to the house of Baal and tore it down. They broke its altars and images to pieces and killed Mattan, the priest of Baal, in front of the altars.",
      "links": "<a href='/AIV/12/11/18'>2 Kings 11:18</a>",
      "comment": "Violent cleansing of idolatry is presented directly as in Hebrew."
    },
    {
      "pk": 2392318,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 18,
      "text": "Jehoiada set the duties of the house of the LORD under the Levites, whom David had appointed over the house of the LORD, to offer burnt offerings to the LORD, as it is written in the Law of Moses, with rejoicing and singing according to David’s commands.",
      "links": "<a href='/AIV/4/28/2'>Num. 28:2</a>; <a href='/AIV/13/23/3-32'>1 Chr. 23:3-32</a>",
      "comment": "Rolling together Mosaic and Davidic instructions for Levites."
    },
    {
      "pk": 2392319,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 19,
      "text": "He stationed gatekeepers at the gates of the house of the LORD, so that no one who was unclean in any way could enter.",
      "links": "<a href='/AIV/4/18/4-7'>Num. 18:4-7</a>",
      "comment": "Gatekeepers' role in maintaining purity is emphasized."
    },
    {
      "pk": 2392320,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 20,
      "text": "He took the commanders of hundreds, the nobles, the rulers of the people, and all the people of the land, and brought the king down from the house of the LORD. They came through the Upper Gate to the king’s palace and set the king on the royal throne.",
      "links": "<a href='/AIV/12/11/19'>2 Kings 11:19</a>",
      "comment": "Keeps the spatial details from Hebrew, describing the coronation."
    },
    {
      "pk": 2392321,
      "translation": "AIV",
      "book": 14,
      "chapter": 23,
      "verse": 21,
      "text": "So all the people of the land rejoiced, and the city was quiet after Athaliah had been put to death by the sword.",
      "links": "<a href='/AIV/12/11/20'>2 Kings 11:20</a>",
      "comment": "Simple, direct—closing the chapter with the restoration of order."
    }
  ],
  "translatedAt": "2025-12-22T11:06:07.445Z"
}