{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 30,
  "verses": [
    {
      "pk": 2303001,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 1,
      "text": "Hezekiah sent word to all Israel and Judah, and also wrote letters to Ephraim and Manasseh, inviting them to come to the house of the LORD in Jerusalem to celebrate the Passover to the LORD, the God of Israel.",
      "links": "<a href='/AIV/02/12/1-28'>Ex. 12:1-28</a>; <a href='/AIV/12/23/21-23'>2 Kings 23:21-23</a>",
      "comment": "Invitation extended to both Judah and the northern tribes; in Ex. 12 and 2 Kings the Passover instructions are referenced."
    },
    {
      "pk": 2303002,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 2,
      "text": "The king and his officials, and all the assembly in Jerusalem, had decided to celebrate the Passover in the second month.",
      "links": "<a href='/AIV/04/09/6-13'>Num. 9:6-13</a>",
      "comment": "Passover usually held in first month; Num. 9:6-13 permits second month due to purification issues."
    },
    {
      "pk": 2303003,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 3,
      "text": "They had not been able to celebrate it at the regular time because not enough priests had consecrated themselves and the people had not gathered at Jerusalem.",
      "links": "<a href='/AIV/03/15/1-33'>Lev. 15:1-33</a>",
      "comment": "Ritual purity was needed for participation; Lev. 15 gives purity laws."
    },
    {
      "pk": 2303004,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 4,
      "text": "This plan seemed right to the king and to the whole assembly.",
      "links": "<a href='/AIV/09/18/14'>1 Sam. 18:14</a>",
      "comment": "Consensus sought among leadership and people."
    },
    {
      "pk": 2303005,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 5,
      "text": "So they decided to make a proclamation throughout all Israel, from Beersheba to Dan, inviting everyone to come to Jerusalem to celebrate the Passover to the LORD, the God of Israel, for many had not been celebrating it as prescribed.",
      "links": "<a href='/AIV/07/20/1'>Judg. 20:1</a>; <a href='/AIV/11/04/25'>1 Kings 4:25</a>",
      "comment": "Beersheba to Dan denotes the full length of Israel."
    },
    {
      "pk": 2303006,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 6,
      "text": "Messengers went out with the king’s letters throughout all Israel and Judah, saying: 'People of Israel, return to the LORD, the God of Abraham, Isaac, and Israel, so that he may return to those of you who have escaped from the hands of the kings of Assyria.'",
      "links": "<a href='/AIV/09/07/03'>1 Sam. 7:3</a>; <a href='/AIV/12/15/29'>2 Kings 15:29</a>",
      "comment": "Assyria referenced as threat to northern tribes, not directly in Judah."
    },
    {
      "pk": 2303007,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 7,
      "text": "'Do not be like your fathers and your brothers, who were unfaithful to the LORD, the God of their ancestors, so that he made them an object of horror, as you see today.'",
      "links": "<a href='/AIV/12/17/7-18'>2 Kings 17:7-18</a>",
      "comment": "Reference to past apostasy that led to judgment."
    },
    {
      "pk": 2303008,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 8,
      "text": "'Do not be stiff-necked as your ancestors were, but submit to the LORD and come to his sanctuary, which he has consecrated forever. Serve the LORD your God, so that his fierce anger will turn away from you.'",
      "links": "<a href='/AIV/01/32/25'>Ex. 32:9</a>; <a href='/AIV/05/09/27'>Deut. 9:27'</a>",
      "comment": "'Stiff-necked' is a common biblical figure for stubbornness."
    },
    {
      "pk": 2303009,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 9,
      "text": "'If you return to the LORD, then your brothers and your children will be shown compassion by those who led them captive, and will return to this land. For the LORD your God is gracious and compassionate. If you turn back to him, he will not turn his face away from you.'",
      "links": "<a href='/AIV/19/78/38'>Ps. 78:38</a>; <a href='/AIV/02/34/6'>Ex. 34:6</a>",
      "comment": "Promise of restoration and God's compassion."
    },
    {
      "pk": 2303010,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 10,
      "text": "So the messengers went from city to city through the land of Ephraim and Manasseh, even as far as Zebulun, but the people laughed at them and mocked them.",
      "links": "<a href='/AIV/12/17/14'>2 Kings 17:14</a>",
      "comment": "Response of some northern Israelites was ridicule."
    },
    {
      "pk": 2303011,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 11,
      "text": "Nevertheless, some from Asher, Manasseh, and Zebulun humbled themselves and came to Jerusalem.",
      "links": "<a href='/AIV/19/34/2'>Ps. 34:2</a>; <a href='/AIV/12/23/15'>2 Kings 23:15</a>",
      "comment": "A remnant responds positively to the invitation."
    },
    {
      "pk": 2303012,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 12,
      "text": "The hand of God was on Judah to give them one heart, so that they obeyed the word of the king and the officials, as commanded by the LORD.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "Unity of heart attributed to God’s sovereign action."
    },
    {
      "pk": 2303013,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 13,
      "text": "A large crowd gathered in Jerusalem to celebrate the Feast of Unleavened Bread in the second month—a very great assembly.",
      "links": "<a href='/AIV/02/12/15-20'>Ex. 12:15-20</a>; <a href='/AIV/03/23/6'>Lev. 23:6</a>",
      "comment": "Passover and Unleavened Bread often closely linked."
    },
    {
      "pk": 2303014,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 14,
      "text": "They removed the altars that were in Jerusalem and took away all the incense altars, throwing them into the Kidron Valley.",
      "links": "<a href='/AIV/12/23/4-6'>2 Kings 23:4-6</a>",
      "comment": "Destruction of idolatrous and illicit worship places as preparation."
    },
    {
      "pk": 2303015,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 15,
      "text": "They slaughtered the Passover lambs on the fourteenth day of the second month. The priests and Levites, ashamed of themselves, consecrated themselves and brought burnt offerings to the house of the LORD.",
      "links": "<a href='/AIV/02/12/6'>Ex. 12:6</a>; <a href='/AIV/03/08/14'>Lev. 8:14</a>",
      "comment": "Lavish priestly repentance shows prior neglect."
    },
    {
      "pk": 2303016,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 16,
      "text": "They took their places as prescribed by the Law of Moses, the man of God. The priests splashed the blood received from the Levites.",
      "links": "<a href='/AIV/03/01/5'>Lev. 1:5</a>; <a href='/AIV/04/08/19'>Num. 8:19</a>",
      "comment": "'Splashed the blood' translates ritual offering procedure."
    },
    {
      "pk": 2303017,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 17,
      "text": "Since many in the assembly had not consecrated themselves, the Levites had to slaughter the Passover lambs for everyone who was not clean enough to offer them to the LORD.",
      "links": "<a href='/AIV/04/09/6-13'>Num. 9:6-13</a>; <a href='/AIV/03/15/28'>Lev. 15:28</a>",
      "comment": "Levites assist because many participants lack ritual purity."
    },
    {
      "pk": 2303018,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 18,
      "text": "A large number of the people, especially those from Ephraim, Manasseh, Issachar, and Zebulun, had not purified themselves, yet they ate the Passover meal in violation of what was written. But Hezekiah prayed for them, saying, 'May the LORD who is good forgive everyone,'",
      "links": "<a href='/AIV/03/15/31'>Lev. 15:31</a>; <a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "Hezekiah intercedes for ritual violation, highlighting grace."
    },
    {
      "pk": 2303019,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 19,
      "text": "'who sets his heart to seek God—the LORD, the God of his ancestors—even though he is not pure according to the rules of the sanctuary.'",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>",
      "comment": "Emphasizes heart over ritual in seeking God."
    },
    {
      "pk": 2303020,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 20,
      "text": "And the LORD listened to Hezekiah and healed the people.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>",
      "comment": "God’s acceptance of Hezekiah’s intercession."
    },
    {
      "pk": 2303021,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 21,
      "text": "So the Israelites who were present in Jerusalem celebrated the Feast of Unleavened Bread for seven days with great joy. The Levites and the priests praised the LORD day after day, singing to the LORD with loud instruments.",
      "links": "<a href='/AIV/03/23/6-8'>Lev. 23:6-8</a>; <a href='/AIV/19/150/3'>Ps. 150:3</a>",
      "comment": "Joy and song form key elements of the celebration."
    },
    {
      "pk": 2303022,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 22,
      "text": "Hezekiah spoke encouragingly to all the Levites who showed skill in serving the LORD. They ate together throughout the feast, offering peace offerings and giving thanks to the LORD, the God of their fathers.",
      "links": "<a href='/AIV/03/07/11-21'>Lev. 7:11-21</a>; <a href='/AIV/19/92/1'>Ps. 92:1</a>",
      "comment": "Emphasizes both worship skill and communal fellowship."
    },
    {
      "pk": 2303023,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 23,
      "text": "Then the whole assembly decided to celebrate for seven more days, so they celebrated joyfully for another seven days.",
      "links": "<a href='/AIV/08/03/7'>Ruth 3:7</a>",
      "comment": "Celebration extended beyond Law’s requirement, expressing great enthusiasm."
    },
    {
      "pk": 2303024,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 24,
      "text": "Hezekiah king of Judah supplied for the assembly one thousand bulls and seven thousand sheep, and the officials gave the assembly one thousand bulls and ten thousand sheep, and a great number of priests consecrated themselves.",
      "links": "<a href='/AIV/03/23/36-37'>Lev. 23:36-37</a>",
      "comment": "Abundance of sacrificial animals highlights the scale of celebration."
    },
    {
      "pk": 2303025,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 25,
      "text": "All the congregation of Judah rejoiced, along with the priests, Levites, all who had come from Israel, and the foreigners who had come from the land of Israel or were living in Judah.",
      "links": "<a href='/AIV/02/12/48-49'>Ex. 12:48-49</a>",
      "comment": "Sojourners included in celebration as permitted in the Law."
    },
    {
      "pk": 2303026,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 26,
      "text": "There was great joy in Jerusalem, for since the days of Solomon son of David king of Israel nothing like this had happened in Jerusalem.",
      "links": "<a href='/AIV/11/08/65'>1 Kings 8:65</a>",
      "comment": "Comparison with Solomon’s dedication; marks an exceptional revival."
    },
    {
      "pk": 2303027,
      "translation": "AIV",
      "book": 14,
      "chapter": 30,
      "verse": 27,
      "text": "Then the priests and the Levites stood up to bless the people, and their voice was heard, and their prayer reached heaven, God’s holy dwelling place.",
      "links": "<a href='/AIV/19/20/1-2'>Ps. 20:1-2</a>",
      "comment": "Priestly blessing echoes Numbers 6:23-27; prayer is effectual and received by God."
    }
  ],
  "translatedAt": "2025-12-22T11:09:07.378Z"
}