{
  "book": "2 Chronicles",
  "bookAbbreviation": "2Chr",
  "chapter": 26,
  "verses": [
    {
      "pk": 1932301,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 1,
      "text": "Then all the people of Judah took Uzziah, who was sixteen years old, and made him king in place of his father Amaziah.",
      "links": "<a href='/AIV/12/14/21'>2 Kgs. 14:21</a>",
      "comment": "Uzziah is also called Azariah in 2 Kings 14:21. The original Hebrew text supports the translation."
    },
    {
      "pk": 1932302,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 2,
      "text": "He rebuilt Eloth and restored it to Judah after the king slept with his fathers.",
      "links": "<a href='/AIV/11/9/26'>1 Kgs. 9:26</a>; <a href='/AIV/12/14/22'>2 Kgs. 14:22</a>",
      "comment": "\"Slept with his fathers\" is a Hebrew expression for dying."
    },
    {
      "pk": 1932303,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 3,
      "text": "Uzziah was sixteen years old when he began to reign, and he reigned fifty-two years in Jerusalem. His mother’s name was Jecoliah of Jerusalem.",
      "links": "<a href='/AIV/12/15/2'>2 Kgs. 15:2</a>",
      "comment": "Verse follows the parallel text in 2 Kings 15:2."
    },
    {
      "pk": 1932304,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 4,
      "text": "He did what was right in the eyes of the Lord, just as his father Amaziah had done.",
      "links": "<a href='/AIV/12/14/3'>2 Kgs. 14:3</a>",
      "comment": "Standard phrase for a king's evaluation."
    },
    {
      "pk": 1932305,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 5,
      "text": "He set himself to seek God in the days of Zechariah, who instructed him in the fear of God. And as long as he sought the Lord, God made him prosper.",
      "links": "<a href='/AIV/13/22/19'>1 Chr. 22:19</a>",
      "comment": "\"Instructed him\" preserves ambiguity found in Hebrew."
    },
    {
      "pk": 1932306,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 6,
      "text": "He went out and fought against the Philistines and broke down the wall of Gath, the wall of Jabneh, and the wall of Ashdod, and built cities around Ashdod and among the Philistines.",
      "links": "<a href='/AIV/07/1/18'>Judg. 1:18</a>",
      "comment": "\"Built cities\" can also mean \"established settlements.\""
    },
    {
      "pk": 1932307,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 7,
      "text": "God helped him against the Philistines, against the Arabians who lived in Gur Baal, and against the Meunites.",
      "links": "<a href='/AIV/13/4/41'>1 Chr. 4:41</a>",
      "comment": "The Meunites may be related to those in 2 Chr. 20:1."
    },
    {
      "pk": 1932308,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 8,
      "text": "The Ammonites paid tribute to Uzziah, and his fame spread even to the entrance of Egypt, for he became very strong.",
      "links": "<a href='/AIV/10/8/2'>2 Sam. 8:2</a>; <a href='/AIV/19/60/8'>Ps. 60:8</a>",
      "comment": "\"Tribute\" refers to payments for protection or submission."
    },
    {
      "pk": 1932309,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 9,
      "text": "Uzziah built towers in Jerusalem at the Corner Gate, at the Valley Gate, and at the Angle, and fortified them.",
      "links": "<a href='/AIV/16/3/13'>Neh. 3:13</a>; <a href='/AIV/16/3/24-25'>Neh. 3:24–25</a>",
      "comment": "The \"Angle\" refers to a turning point in the city wall."
    },
    {
      "pk": 1932310,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 10,
      "text": "He built towers in the wilderness and dug many cisterns, for he had many livestock, both in the lowlands and in the plain. He had farmers and vineyard workers in the hills and in the fertile fields, for he loved the soil.",
      "links": "<a href='/AIV/09/8/12'>1 Sam. 8:12</a>",
      "comment": "Metaphorical use of \"loved the soil\" means he cared for agriculture."
    },
    {
      "pk": 1932311,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 11,
      "text": "Moreover, Uzziah had an army of trained warriors, fit for service, who went out by divisions according to the musters made by Jeiel the scribe and Maaseiah the officer, under the direction of Hananiah, one of the king’s commanders.",
      "links": "<a href='/AIV/13/27/32'>1 Chr. 27:32-34</a>",
      "comment": "\"Fit for service\" translates the Hebrew phrase \"coming out for battle by bands.\""
    },
    {
      "pk": 1932312,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 12,
      "text": "The whole number of the heads of fathers' houses, mighty men of valor, was two thousand six hundred.",
      "links": "<a href='/AIV/04/1/4'>Num. 1:4</a>",
      "comment": "\"Heads of fathers' houses\" refers to clan leaders."
    },
    {
      "pk": 1932313,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 13,
      "text": "Under their command was an army of 307,500 men who could make war with mighty power, to help the king against the enemy.",
      "links": "<a href='/AIV/13/12/21'>1 Chr. 12:21</a>",
      "comment": "Large army reflects the Chronicler's focus on Judah's strength."
    },
    {
      "pk": 1932314,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 14,
      "text": "Uzziah prepared for all the army shields, spears, helmets, coats of armor, bows, and stones for slinging.",
      "links": "<a href='/AIV/09/17/49'>1 Sam. 17:49-50</a>",
      "comment": "\"Coats of armor\" translates \"coats of mail.\""
    },
    {
      "pk": 1932315,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 15,
      "text": "In Jerusalem he made machines, invented by skillful men, to be on the towers and the corners, to shoot arrows and great stones. And his fame spread far, for he was marvelously helped, until he was strong.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1'; <a href='/AIV/19/75/6-7'>Ps. 75:6-7</a>",
      "comment": "\"Machines\" refers to war engines (Heb. hebel), interpreted as ancient artillery."
    },
    {
      "pk": 1932316,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 16,
      "text": "But when he was strong, his heart was lifted up to his destruction, for he was unfaithful to the Lord his God and entered the temple of the Lord to burn incense on the altar of incense.",
      "links": "<a href='/AIV/04/16/40'>Num. 16:40</a>; <a href='/AIV/04/18/7'>Num. 18:7</a>",
      "comment": "\"Lifted up\" means "
    },
    {
      "pk": 1932317,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 17,
      "text": "But Azariah the priest went in after him, and with him eighty priests of the Lord, men of valor.",
      "links": "<a href='/AIV/04/16/39'>Num. 16:39-40</a>",
      "comment": "\"Men of valor\" means brave or courageous priests."
    },
    {
      "pk": 1932318,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 18,
      "text": "They withstood King Uzziah and said to him, \"It is not for you, Uzziah, to burn incense to the Lord, but for the priests, the sons of Aaron, who are set apart to burn incense. Leave the sanctuary, for you have been unfaithful, and it will bring you no honor from the Lord God.\"",
      "links": "<a href='/AIV/02/30/7'>Ex. 30:7-8</a>; <a href='/AIV/04/16/40'>Num. 16:40</a>",
      "comment": "Refers directly to priestly restrictions found in the Law."
    },
    {
      "pk": 1932319,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 19,
      "text": "Then Uzziah was angry. Now he had a censer in his hand to burn incense, and while he was angry with the priests, leprosy broke out on his forehead in the presence of the priests in the house of the Lord, by the altar of incense.",
      "links": "<a href='/AIV/03/13/43-46'>Lev. 13:43-46</a>",
      "comment": "\"Leprosy\" refers to a skin disease, not necessarily what is known today as leprosy."
    },
    {
      "pk": 1932320,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 20,
      "text": "Azariah the chief priest and all the priests looked at him, and behold, he was leprous on his forehead. So they rushed him out quickly, and he himself hurried to go out, because the Lord had struck him.",
      "links": "<a href='/AIV/03/13/45'>Lev. 13:45-46</a>",
      "comment": "\"Struck him\" is a term for divine judgment."
    },
    {
      "pk": 1932321,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 21,
      "text": "King Uzziah was a leper to the day of his death, and lived in a separate house, because he was cut off from the house of the Lord. And his son Jotham was over the king’s household, governing the people of the land.",
      "links": "<a href='/AIV/03/13/46'>Lev. 13:46</a>; <a href='/AIV/12/15/5'>2 Kgs. 15:5</a>",
      "comment": "\"Separate house\" signifies forced isolation due to ritual impurity."
    },
    {
      "pk": 1932322,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 22,
      "text": "Now the rest of the acts of Uzziah, from first to last, Isaiah the prophet the son of Amoz wrote.",
      "links": "<a href='/AIV/23/1/1'>Isa. 1:1</a>",
      "comment": "Indicates Isaiah’s historical record as a source for Uzziah’s reign."
    },
    {
      "pk": 1932323,
      "translation": "AIV",
      "book": 14,
      "chapter": 26,
      "verse": 23,
      "text": "Uzziah slept with his fathers, and they buried him with his fathers in the burial field belonging to the kings, for they said, \"He is a leper.\" And Jotham his son reigned in his place.",
      "links": "<a href='/AIV/12/15/7'>2 Kgs. 15:7</a>",
      "comment": "\"Burial field belonging to the kings\" specifies Uzziah was not buried with other kings due to his disease."
    }
  ],
  "translatedAt": "2025-12-22T11:07:29.576Z"
}