{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 12,
  "verses": [
    {
      "pk": 22001201,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 1,
      "text": "When Jonathan saw that the time was favorable, he chose men and sent them to Rome to renew and confirm friendship with them.",
      "links": "<a href='/AIV/44/8/17'>1 Macc. 8:17</a>",
      "comment": "Jonathan seeks diplomatic ties with Rome, as Judas had done before him, continuing the strategy of securing alliances for Israel's survival."
    },
    {
      "pk": 22001202,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 2,
      "text": "He also sent letters to the Spartans and other places, following what had been done by his brothers Judas and Jonathan, to establish unity and peace.",
      "links": "<a href='/AIV/44/12/6'>1 Macc. 12:6</a>; <a href='/AIV/44/12/20'>1 Macc. 12:20</a>",
      "comment": "The outreach to the Spartans emphasizes the desire for solidarity among distant kinsmen; some traditions claim the Spartans had Israelite origins (cf. 1 Macc. 12:20-23)."
    },
    {
      "pk": 22001203,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 3,
      "text": "So Jonathan’s messengers went to Rome and entered the senate hall, presenting their message and confirming friendship and alliance,",
      "links": "<a href='/AIV/44/8/19-21'>1 Macc. 8:19-21</a>",
      "comment": "Jonathan renews the covenant with Rome, reflecting how ancient Israel at times relied on foreign alliances (cf. Isaiah 30:1-5; yet God's ultimate desire is for Israel’s reliance to rest in Him)."
    },
    {
      "pk": 22001204,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 4,
      "text": "and the Romans received the ambassadors in peace.",
      "links": "<a href='/AIV/44/8/22'>1 Macc. 8:22</a>",
      "comment": "Roman recognition of Jewish independence provided security for Israel, showing God's providence in history."
    },
    {
      "pk": 22001205,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 5,
      "text": "Jonathan sent letters to the Spartans in these terms:",
      "links": "",
      "comment": "Jonathan pursues relationships with other peoples, underlining Israel's awareness of wider kinship."
    },
    {
      "pk": 22001206,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 6,
      "text": "\"Jonathan the high priest, and the council of the elders, and the priests, and the rest of the Jewish people, send greetings to their brothers, the Spartans.\"",
      "links": "<a href='/AIV/44/12/20'>1 Macc. 12:20</a>",
      "comment": "The high priest acts as both spiritual and civic leader. Note the strong emphasis on 'brotherhood' between nations, an important theme in the unity of God's people."
    },
    {
      "pk": 22001207,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 7,
      "text": "\"In former times, letters were sent to Onias the high priest from Arius, who was king among you, stating that you are our kinsmen, as is recorded among our public archives.\"",
      "links": "<a href='/AIV/44/12/20-23'>1 Macc. 12:20-23</a>",
      "comment": "This supposed kinship between Jews and Spartans has been debated; it illustrates the ancient world's sense of common ancestry among nations."
    },
    {
      "pk": 22001208,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 8,
      "text": "\"It has been found written concerning you that you are our brothers. Therefore, we seek to renew this friendship and unity with you.\"",
      "links": "<a href='/AIV/44/12/19-23'>1 Macc. 12:19-23</a>",
      "comment": "The theme of unity is underlined—see John 17:21 for Christ's high-priestly prayer for the unity of all believers."
    },
    {
      "pk": 22001209,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 9,
      "text": "\"We do not need these things, having for our encouragement the holy books which are in our hands.\"",
      "links": "<a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "The reliance on the 'holy books' points to the Scriptures as a source of encouragement—foreshadowing the New Covenant rooted in Scripture and tradition."
    },
    {
      "pk": 22001210,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 10,
      "text": "\"We have sought to send for the renewal of brotherhood and friendship, lest we become strangers to you, for much time has passed since you sent us communication.\"",
      "links": "",
      "comment": "Maintaining longstanding bonds is important in biblical tradition; the emphasis on tradition and ongoing relationships underscores continuity in faith communities."
    },
    {
      "pk": 22001211,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 11,
      "text": "\"At every moment we remember you and your people in our sacrifices and prayers, as is proper and right.\"",
      "links": "<a href='/AIV/44/12/44'>1 Macc. 12:44</a>; <a href='/AIV/19/20/4'>Ps. 20:4</a>",
      "comment": "Sacrifice and prayer for others highlight the importance of intercession—see 2 Macc. 12:43-45 for related practices."
    },
    {
      "pk": 22001212,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 12,
      "text": "\"We rejoice in your glory.\"",
      "links": "<a href='/AIV/50/2/17-18'>Phil. 2:17-18</a>",
      "comment": "Joy in the well-being and honor of others reflects the communal spirit fostered among God's people."
    },
    {
      "pk": 22001213,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 13,
      "text": "\"But many hardships and wars have come upon us, so that the kings around us have fought against us.\"",
      "links": "<a href='/AIV/16/9/32'>Neh. 9:32</a>",
      "comment": "Suffering and warfare are recurring themes for the remnant of God's people, prefiguring the Church's struggle in the world (see John 16:33)."
    },
    {
      "pk": 22001214,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 14,
      "text": "\"We did not wish to trouble you or others of our allies and friends during these conflicts.\"",
      "links": "<a href='/AIV/44/5/17'>1 Macc. 5:17</a>",
      "comment": "Jonathan’s policy is one of peace and self-reliance—compare with Paul’s exhortation to 'live at peace with everyone' (Rom. 12:18)."
    },
    {
      "pk": 22001215,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 15,
      "text": "\"For we have help from heaven, and we have been saved from our enemies, and our enemies have been humbled.\"",
      "links": "<a href='/AIV/19/44/6-7'>Ps. 44:6-7</a>",
      "comment": "Divine assistance in battle is a central biblical motif; victory is attributed to God’s providence."
    },
    {
      "pk": 22001216,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 16,
      "text": "\"So we have chosen Numenius son of Antiochus, and Antipater son of Jason, and sent them to the Romans to renew our former friendship and alliance with them.\"",
      "links": "<a href='/AIV/44/12/1'>1 Macc. 12:1</a>",
      "comment": "Renewing alliances for peace and mutual defense reflects ancient Israel's practical politics."
    },
    {
      "pk": 22001217,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 17,
      "text": "\"And we have ordered them also to go to you and greet you, and deliver this letter to you concerning the renewal of our relationship.\"",
      "links": "",
      "comment": "This verse emphasizes intentionality and transparency in relations—a biblical value."
    },
    {
      "pk": 22001218,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 18,
      "text": "\"It is our desire, therefore, that you will also send us a reply to these matters.\"",
      "links": "",
      "comment": "Desire for mutual engagement encourages deeper communion among the faithful."
    },
    {
      "pk": 22001219,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 19,
      "text": "This is the copy of the letter that they sent to the Spartans: \"Jonathan the high priest, and the council of the elders, and the priests, and the rest of the people of the Jews, to the Spartans, our brothers, greetings.\"",
      "links": "<a href='/AIV/44/12/6'>1 Macc. 12:6</a>",
      "comment": "The second mention of this letter repeats the importance of written tradition in conveying truth and unity. Early Christians would carry forward this emphasis on apostolic letters."
    },
    {
      "pk": 22001220,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 20,
      "text": "\"Already in the time of Arius your king, our brothers, it was written concerning you and Onias the high priest,\"",
      "links": "<a href='/AIV/44/12/7'>1 Macc. 12:7</a>",
      "comment": "Affirming kinship through ancient written records reminds us that divine revelation is entrusted to Scripture, preserved through official stewardship."
    },
    {
      "pk": 22001221,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 21,
      "text": "\"that you are our kinsmen. Therefore, we have written to you to renew our brotherhood and friendship.\"",
      "links": "<a href='/AIV/44/12/8'>1 Macc. 12:8</a>",
      "comment": "Renewed commitment echoes covenant faithfulness in the Old and New Testaments."
    },
    {
      "pk": 22001222,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 22,
      "text": "\"We are writing to you at this moment. In the time of harvest and in the time of gathering produce, we remember you.\"",
      "links": "",
      "comment": "The mention of feasts and harvests recalls Old Testament festivals, fulfilled spiritually in the church's liturgical life."
    },
    {
      "pk": 22001223,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 23,
      "text": "\"Therefore, respond favorably to us, and we will reciprocate the same.\"",
      "links": "",
      "comment": "Christian charity finds its roots in the reciprocity of love described here."
    },
    {
      "pk": 22001224,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 24,
      "text": "Now, Jonathan heard that the officers of Demetrius had returned with an even larger army than before to wage war against him.",
      "links": "<a href='/AIV/44/11/62'>1 Macc. 11:62</a>",
      "comment": "The battles against foreign oppressors are representative of spiritual warfare (cf. Ephesians 6:12)."
    },
    {
      "pk": 22001225,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 25,
      "text": "So he marched out from Jerusalem and met them at Hamath, for he did not allow them to invade his land.",
      "links": "",
      "comment": "Defending the land foreshadows the protective function of spiritual leaders."
    },
    {
      "pk": 22001226,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 26,
      "text": "He sent spies to their camp, and they returned and reported to him that the enemy was setting up to ambush him that night in the mountains.",
      "links": "",
      "comment": "Vigilance in leadership—Jesus' exhortation to 'watch and pray' carries forward this principle."
    },
    {
      "pk": 22001227,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 27,
      "text": "When the sun set, Jonathan ordered his troops to stay awake and with their weapons at hand, ready to fight throughout the night.",
      "links": "",
      "comment": "Spiritual readiness in the darkness points to Christian watchfulness (cf. Matthew 25:1-13)."
    },
    {
      "pk": 22001228,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 28,
      "text": "Jonathan surrounded the camp, and the enemy realized that he knew about their plans; they panicked, set fires in their camp, and fled.",
      "links": "",
      "comment": "Wisdom and discernment in battle reflect the gifts of the Spirit (see Isaiah 11:2)."
    },
    {
      "pk": 22001229,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 29,
      "text": "Jonathan and his men saw the flames burning from the enemy camp as it disappeared into the distance.",
      "links": "",
      "comment": "Divine providence scatters the plans of God’s enemies."
    },
    {
      "pk": 22001230,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 30,
      "text": "Jonathan pursued them, but he could not catch up with them, for they had crossed the river Eleutherus.",
      "links": "",
      "comment": "Crossing rivers as borders often marks the limit of campaigns (cf. Joshua 3:15-17)."
    },
    {
      "pk": 22001231,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 31,
      "text": "Then Jonathan turned aside against the Arabians called Zabadeans, struck them down, and took their possessions as plunder.",
      "links": "",
      "comment": "Military actions against hostile tribes continue here; see Genesis 34:27-29 for a similar pattern of seizing plunder."
    },
    {
      "pk": 22001232,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 32,
      "text": "He then set out for Damascus, traveling through the entire region.",
      "links": "",
      "comment": "Jonathan’s authority spanned beyond Israel proper; Damascus would later feature in Paul's conversion (Acts 9:1-6)."
    },
    {
      "pk": 22001233,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 33,
      "text": "Meanwhile, Simon continued his campaign and advanced as far as Ashkelon and the neighboring strongholds.",
      "links": "",
      "comment": "Simon’s parallel campaign with Jonathan illustrates leadership succession and shared responsibility."
    },
    {
      "pk": 22001234,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 34,
      "text": "He then turned to Joppa and took control of it, for he had heard that the people intended to hand the city over to the supporters of Demetrius. He stationed a garrison there to guard it.",
      "links": "",
      "comment": "Securing strategic locations is essential in both military and spiritual struggles. Joppa would also be significant in Peter’s ministry (Acts 10:9-16)."
    },
    {
      "pk": 22001235,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 35,
      "text": "Jonathan returned to Jerusalem and assembled the elders of the people to consider their next steps.",
      "links": "",
      "comment": "The assembly of elders prefigures collegial forms of church governance."
    },
    {
      "pk": 22001236,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 36,
      "text": "He planned to build strongholds in Judea and make the city walls taller and strengthen defenses against future attacks.",
      "links": "",
      "comment": "Fortifying the city recalls the call to 'build up the Church,' as the community’s spiritual defense against evil."
    },
    {
      "pk": 22001237,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 37,
      "text": "So he gathered the builders and raised the wall of Jerusalem higher, enclosing it completely, and reinforced it with strong towers.",
      "links": "",
      "comment": "The care for the holy city echoes the future message of the New Jerusalem (Revelation 21:2)."
    },
    {
      "pk": 22001238,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 38,
      "text": "He sent Simon, his brother, and stationed him at Joppa to hold the city,",
      "links": "",
      "comment": "Assignment of trusted family members to key roles shows a pattern echoed by apostolic succession."
    },
    {
      "pk": 22001239,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 39,
      "text": "and Simon occupied Joppa and took control of it.",
      "links": "",
      "comment": "The repeated note of Simon’s control underlines the success of this secure stewardship."
    },
    {
      "pk": 22001240,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 40,
      "text": "Trypho attempted to become king of Asia and put on the crown. He plotted to kill Antiochus so that he could take power for himself.",
      "links": "",
      "comment": "Trypho's ambition stands in contrast with God-ordained kingship; selfish power-grabs are condemned in Scripture (cf. 1 Samuel 8:7)."
    },
    {
      "pk": 22001241,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 41,
      "text": "Jonathan learned that Trypho had gathered a large army to come against him.",
      "links": "",
      "comment": "Repeated threats test the vigilance and faith of God’s leaders."
    },
    {
      "pk": 22001242,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 42,
      "text": "Trypho sent envoys to Jonathan, saying, \"We are not here to attack you; instead, we wish to make peace.\"",
      "links": "",
      "comment": "Deceptive words are a recurring danger for the faithful (cf. Genesis 3:1-4)."
    },
    {
      "pk": 22001243,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 43,
      "text": "\"Send men as hostages and come out to meet me in Ptolemais, and I will return the cities and soldiers that we have taken from you.\"",
      "links": "",
      "comment": "The hostage tactic shows the use of leverage in ancient diplomacy."
    },
    {
      "pk": 22001244,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 44,
      "text": "Jonathan trusted Trypho and did as he requested, sending his soldiers as hostages and going to Ptolemais.",
      "links": "",
      "comment": "Trusting unworthy leaders is often condemned in Scripture; see Proverbs 25:19."
    },
    {
      "pk": 22001245,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 45,
      "text": "But Trypho seized Jonathan and all who came with him, killing them.",
      "links": "",
      "comment": "The betrayal and execution recalls other biblical betrayals (e.g., Judas’ betrayal; cf. Matthew 26:47-50)."
    },
    {
      "pk": 22001246,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 46,
      "text": "Trypho sent his troops and cavalry into Galilee and the great plain to destroy all Jonathan’s supporters.",
      "links": "",
      "comment": "Persecution seeks to stamp out the faithful, yet God preserves a remnant (cf. Romans 11:5)."
    },
    {
      "pk": 22001247,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 47,
      "text": "But when Simon heard that Trypho had assembled a large army to invade him, he gathered those who fought for Jonathan and readied them for battle.",
      "links": "",
      "comment": "Leadership passes to Simon, a continuation of the family’s mission—a pattern of succession."
    },
    {
      "pk": 22001248,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 48,
      "text": "The enemy forces, realizing Simon was ready to fight, became fearful and retreated.",
      "links": "",
      "comment": "God often uses the courage and unity of His people to turn the enemy away (cf. Joshua 1:9)."
    },
    {
      "pk": 22001249,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 49,
      "text": "Trypho was furious over his failure and withdrew to rejoin his army.",
      "links": "",
      "comment": "Pride and anger typically lead to defeat (Proverbs 16:18)."
    },
    {
      "pk": 22001250,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 50,
      "text": "Simon buried Jonathan in Modein, the family tomb his ancestors had built. All Israel mourned him with great lamentation.",
      "links": "<a href='/AIV/44/2/70'>1 Macc. 2:70</a>",
      "comment": "The importance of burial sites and communal mourning highlights respect for the dead and memory of the righteous (cf. Sirach 44:10-15)."
    },
    {
      "pk": 22001251,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 51,
      "text": "They mourned Jonathan for many days, lamenting him greatly.",
      "links": "",
      "comment": "Mourning for leaders follows biblical precedent (cf. Genesis 50:10 for Jacob’s mourning)."
    },
    {
      "pk": 22001252,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 52,
      "text": "Simon built a monument over the grave of his father and his brothers, tall enough to be seen from a distance, with polished stone at the front and back.",
      "links": "<a href='/AIV/44/13/27-30'>1 Macc. 13:27-30</a>",
      "comment": "Erecting a monument memorializes the faithful departed. Such tradition of commemorating the saints continues among Christians."
    },
    {
      "pk": 22001253,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 53,
      "text": "He built seven pyramids, facing one another, for his father, his mother, and his four brothers,",
      "links": "",
      "comment": "These seven tombs are unique memorials. Seven is a biblical number of perfection and covenant (cf. Genesis 2:2-3; Revelation 1:4), reminding us of God's ongoing faithfulness through generations."
    }
  ],
  "translatedAt": "2025-12-23T09:29:59.702Z"
}