{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 16,
  "verses": [
    {
      "pk": 20160101,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 1,
      "text": "John went up from Gazara and told his father Simon what Cendebeus was doing.",
      "links": "<a href='/AIV/44/15/39'>1 Macc. 15:39</a>",
      "comment": "John is fulfilling a filial duty by reporting urgent news to Simon, emphasizing the responsibility of leadership within the family and community."
    },
    {
      "pk": 20160102,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 2,
      "text": "Simon called his two oldest sons, Judas and John, and said to them, 'My brothers and I and my father's house have fought the enemies of Israel from our youth until now and have succeeded in delivering Israel many times.'",
      "links": "<a href='/AIV/44/2/42-48'>1 Macc. 2:42–48</a>",
      "comment": "Simon recalls his family's faithful service to God and Israel, showing the importance of generational fidelity in leadership."
    },
    {
      "pk": 20160103,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 3,
      "text": "'But now that I am old, you, instead of me and my brother, go out and fight for our nation, and may heaven help you.'",
      "links": "<a href='/AIV/44/3/18'>1 Macc. 3:18</a>",
      "comment": "'Heaven' hints at divine providence supporting virtuous action—a theme echoed throughout Scripture as God empowers the faithful."
    },
    {
      "pk": 20160104,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 4,
      "text": "So he recruited twenty thousand soldiers and cavalry and marched against Cendebeus. They spent the night at Modein.",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "The organized military action led by Simon’s sons shows strategic leadership, which God often uses to preserve His people."
    },
    {
      "pk": 20160105,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 5,
      "text": "Rising early, they advanced into the plain. There, a large army approached them, infantry accompanied by cavalry, men arrayed in ranks.",
      "links": "<a href='/AIV/44/3/13'>1 Macc. 3:13</a>",
      "comment": "Their early rising recalls vigilance—an oft-praised trait among leaders in Scripture, foreshadowing spiritual readiness."
    },
    {
      "pk": 20160106,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 6,
      "text": "John positioned his forces with the infantry facing the enemy and the cavalry hidden behind.",
      "links": "<a href='/AIV/44/13/47'>1 Macc. 13:47</a>",
      "comment": "John shows prudence and tactical wisdom, virtues promoted both in the Old and New Testaments for spiritual and temporal leaders."
    },
    {
      "pk": 20160107,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 7,
      "text": "When the cavalry of Cendebeus charged out into the open, the infantry ran ahead; but all the cavalry followed close behind.",
      "links": "<a href='/AIV/44/9/11'>1 Macc. 9:11</a>",
      "comment": "Details of battle emphasize the discipline and unity crucial for victory—paralleling the need for unity among believers."
    },
    {
      "pk": 20160108,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 8,
      "text": "John and his men blew the trumpets. Cendebeus and his army retreated, and many of them fell; the rest fled to the stronghold.",
      "links": "<a href='/AIV/44/4/40'>1 Macc. 4:40</a>",
      "comment": "The trumpet signals both military action and divine intervention; throughout Scripture, trumpets often accompany God’s mighty acts (see <a href='/AIV/2/19/16'>Ex. 19:16</a>, <a href='/AIV/6/6/20'>Josh. 6:20</a>)."
    },
    {
      "pk": 20160109,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 9,
      "text": "Judas's brother was wounded, but John pursued them until Cendebeus reached Kedron, which he and his men had fortified.",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "Even amidst hardship, John persists, a sign of perseverance—echoing biblical teachings on endurance (see <a href='/AIV/58/12/1'>Heb. 12:1</a>)."
    },
    {
      "pk": 20160110,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 10,
      "text": "Some of the enemy fell, and the rest escaped into the towers, which John then set on fire.",
      "links": "<a href='/AIV/44/11/41'>1 Macc. 11:41</a>",
      "comment": "The destruction of the towers is a decisive act; it signals both victory and purification—fire as a biblical symbol of cleansing (<a href='/AIV/39/3/2'>Mal. 3:2</a>)."
    },
    {
      "pk": 20160111,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 11,
      "text": "So John and his forces were victorious.",
      "links": "",
      "comment": "The victory is presented as divinely-assisted, reflecting the biblical pattern of God empowering those who trust Him."
    },
    {
      "pk": 20160112,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 12,
      "text": "Simon was visiting the cities of Judea, attending to their needs. He went down to Jericho, he and his sons Mattathias and Judas.",
      "links": "<a href='/AIV/44/13/33'>1 Macc. 13:33</a>",
      "comment": "Simon’s pastoral care of Judea foreshadows the spiritual oversight later provided by apostolic leadership (<a href='/AIV/44/12/6'>1 Macc. 12:6</a>)."
    },
    {
      "pk": 20160113,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 13,
      "text": "When the son of Abubus had been made governor at Ptolemais, he schemed against Simon and his sons.",
      "links": "<a href='/AIV/44/15/39'>1 Macc. 15:39</a>",
      "comment": "Political intrigue and betrayal echo a frequent biblical theme, warning of the corruption within fallen human institutions."
    },
    {
      "pk": 20160114,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 14,
      "text": "While Simon was visiting the cities and working for their well-being, he went down to Jericho with Mattathias and Judas, his sons, in the seventy-second year, in the eleventh month, called Shebat.",
      "links": "<a href='/AIV/44/13/41'>1 Macc. 13:41</a>",
      "comment": "The narrative provides historical precision, emphasizing the authenticity of events, much as seen in other scriptural historical accounts."
    },
    {
      "pk": 20160115,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 15,
      "text": "The son of Abubus invited Simon and his sons to a banquet at the small fortress of Dok, which he had built. They ate and drank, but the son of Abubus and his men rose up and murdered Simon, his two sons, and some of his servants.",
      "links": "<a href='/AIV/44/7/27'>1 Macc. 7:27</a>",
      "comment": "The treachery at the meal echoes other biblical betrayals at table, foreshadowing greater betrayals (see <a href='/AIV/40/26/23'>Matt. 26:23</a>)."
    },
    {
      "pk": 20160116,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 16,
      "text": "He committed great treachery and repaid good with evil.",
      "links": "<a href='/AIV/20/17/13'>Prov. 17:13</a>",
      "comment": "The moral judgment here emphasizes the biblical principle that evil betrays those who perform acts of kindness, reminiscent of the Psalms and Proverbs."
    },
    {
      "pk": 20160117,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 17,
      "text": "Then the son of Abubus wrote and sent letters to the king, seeking reinforcements to turn over Simon’s country and cities to him.",
      "links": "<a href='/AIV/44/9/25'>1 Macc. 9:25</a>",
      "comment": "Political ambition and alliance with the secular king is presented as a betrayal of the community; such temptations for worldly power remain a challenge for the faithful."
    },
    {
      "pk": 20160118,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 18,
      "text": "He dispatched others to Gazara to kill John, and sent letters to the military commanders inviting them to join him and promising gifts of silver, gold, and rewards.",
      "links": "<a href='/AIV/44/11/57'>1 Macc. 11:57</a>",
      "comment": "The lure of wealth corrupts even those called to serve—reminding us of scriptural warnings about the dangers of riches (<a href='/AIV/54/6/10'>1 Tim. 6:10</a>)."
    },
    {
      "pk": 20160119,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 19,
      "text": "But others went ahead to Gazara to kill John, and his men held the gates shut and killed those who had come.",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "John’s survival and the defense of the city highlight God’s continuing providence for leaders who shepherd His people."
    },
    {
      "pk": 20160120,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 20,
      "text": "John learned of his father’s and brothers’ deaths, and when news came he mourned deeply.",
      "links": "<a href='/AIV/44/2/70'>1 Macc. 2:70</a>",
      "comment": "Mourning the loss of loved ones illustrates the human and spiritual reality of grief in Scripture (cf. <a href='/AIV/19/42/3'>Ps. 42:3</a>)."
    },
    {
      "pk": 20160121,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 21,
      "text": "He seized the men who had tried to assassinate him and executed them. In this way, he repaid their plot.",
      "links": "<a href='/AIV/44/7/25'>1 Macc. 7:25</a>",
      "comment": "Justice is swift; though the Old Testament often demanded retribution, readers may discern deeper spiritual lessons on mercy and justice."
    },
    {
      "pk": 20160122,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 22,
      "text": "As for the rest of John’s deeds, his wars, and the acts of valor he performed, how he built walls and achieved victory—",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "Summary statements such as this create a sense of closure and invite reflection on the leaders who prepared the way for future fulfillment."
    },
    {
      "pk": 20160123,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 23,
      "text": "Behold, these are recorded in the tribe annals, and in the archives kept from the time he became high priest after his father.",
      "links": "<a href='/AIV/44/13/42'>1 Macc. 13:42</a>",
      "comment": "John’s succession to the high priesthood points to the enduring institution of sacred leadership passed down by laying on of hands—a sign of continuity strongly valued in apostolic tradition."
    },
    {
      "pk": 20160124,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 24,
      "text": "He was high priest until the people were led into captivity and the kingdom of Israel was destroyed.",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "This lament for lost leadership and captivity sets the stage for restored hope through the Messiah. The loss of the priesthood and kingship lays the groundwork for Christ as High Priest and King, fulfilling Old Testament prophecy (see <a href='/AIV/19/110/4'>Ps. 110:4</a>, <a href='/AIV/58/7/17'>Heb. 7:17</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:32:40.716Z"
}