{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 7,
  "verses": [
    {
      "pk": 710701,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 1,
      "text": "In the one hundred and fifty-first year, Demetrius son of Seleucus escaped from Rome and came up with a few men to a coastal city, where he began to take power.",
      "links": "<a href='/AIV/44/1/10'>1 Macc. 1:10</a>",
      "comment": "Demetrius I Soter's return from exile marks a political turning point, parallel to the frequent leadership changes in the Seleucid Empire."
    },
    {
      "pk": 710702,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 2,
      "text": "As he entered the royal palace of his ancestors, the forces seized Antiochus and Lysias, to bring them to him.",
      "links": "<a href='/AIV/44/6/14'>1 Macc. 6:14</a>",
      "comment": "Demetrius reclaims royal authority, fulfilling the theme of rightful succession in Israel’s history."
    },
    {
      "pk": 710703,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 3,
      "text": "When he was informed of their capture, he said, 'Do not let me see their faces.'",
      "links": "",
      "comment": "The execution of rivals reflects the harsh reality of ancient politics."
    },
    {
      "pk": 710704,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 4,
      "text": "So the army killed them. Demetrius then took his seat on the throne of his kingdom.",
      "links": "",
      "comment": "Their deaths finalized Demetrius's control, showing the fragility of secular power compared to true, divinely appointed authority."
    },
    {
      "pk": 710705,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 5,
      "text": "Then all the lawless and wicked Israelites gathered and came to him, with Alcimus, who wanted to be high priest.",
      "links": "<a href='/AIV/44/6/21'>1 Macc. 6:21</a>",
      "comment": "Alcimus’s ambition underscores the distinction between holy vocation and mere political appointment. True spiritual leadership flows from God, not political manipulation (see <a href='/AIV/4/17/5-7'>Num. 17:5-7</a>)."
    },
    {
      "pk": 710706,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 6,
      "text": "They accused the people to the king, saying, 'Judas and his brothers have destroyed all your friends and have driven us out of our land.'",
      "links": "<a href='/AIV/44/2/17'>1 Macc. 2:17</a>",
      "comment": "This is a classic example of slander against the faithful remnant, reminiscent of similar acts in Nehemiah’s time (<a href='/AIV/16/6/6-7'>Neh. 6:6-7</a>)."
    },
    {
      "pk": 710707,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 7,
      "text": "'Now, therefore, send a man whom you trust, let him go and see the destruction Judas has caused among us and in the king’s country, and let him punish them and all who help them.'",
      "links": "",
      "comment": "A political appeal for suppression of the faithful, similar to later accounts in Acts (<a href='/AIV/44/4/1-3'>Acts 4:1-3</a>) where authorities oppose those loyal to God."
    },
    {
      "pk": 710708,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 8,
      "text": "So the king chose Bacchides, one of the king's Friends, governor of Beyond the River, a powerful man loyal to the king.",
      "links": "",
      "comment": "Bacchides is trusted with a major task requiring both civil and military authority."
    },
    {
      "pk": 710709,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 9,
      "text": "He sent him with the ungodly Alcimus, whom he made high priest, and ordered him to avenge the king on the Israelites.",
      "links": "<a href='/AIV/44/2/42'>1 Macc. 2:42</a>",
      "comment": "Alcimus is installed as high priest by royal decree, not by God's choice. This contrast shows the importance of valid, divinely-instituted authority in spiritual leadership."
    },
    {
      "pk": 710710,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 10,
      "text": "So Bacchides and Alcimus came to the land of Judah with a large army, sending messengers with deceitful speeches of peace.",
      "links": "",
      "comment": "The offer of false peace is a recurring temptation; believers are reminded to discern true from false teaching (<a href='/AIV/24/28/9'>Jer. 28:9</a>)."
    },
    {
      "pk": 710711,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 11,
      "text": "But the people did not trust their words, for they remembered what they did to the men of Darius, who had come before.",
      "links": "<a href='/AIV/44/6/62'>1 Macc. 6:62</a>",
      "comment": "Memory of past betrayals helps guard against deception; wisdom and prudence are commended here."
    },
    {
      "pk": 710712,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 12,
      "text": "Yet some scribes gathered to Alcimus and Bacchides, seeking justice.",
      "links": "",
      "comment": "Some, perhaps seeking peace, approach the new rulers. Even among the faithful, there are always some tempted to seek compromise."
    },
    {
      "pk": 710713,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 13,
      "text": "The Hasideans were the first among Israel’s sons to seek peace with them, saying,",
      "links": "<a href='/AIV/44/1/62'>1 Macc. 1:62</a>",
      "comment": "Hasideans were pious Jews, eager for religious purity and peace but in danger of naiveté regarding political cunning."
    },
    {
      "pk": 710714,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 14,
      "text": "'A priest from the family of Aaron has come with the army; he will not harm us.'",
      "links": "<a href='/AIV/3/8/1'>Lev. 8:1</a>",
      "comment": "Their trust in a priestly figure hints at the deep longing for holy leadership. Yet, discernment is still needed, as not all who claim authority are truly faithful (see also <a href='/AIV/40/7/15'>Matt. 7:15</a>)."
    },
    {
      "pk": 710715,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 15,
      "text": "He spoke peacefully to them and swore an oath: 'We will not harm you or your friends.'",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "Even oaths may be broken; surface displays of peace can hide evil intent."
    },
    {
      "pk": 710716,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 16,
      "text": "But as soon as they trusted him, he seized sixty of them and killed them in a single day, according to what is written:",
      "links": "<a href='/AIV/24/41/7'>Jer. 41:7</a>",
      "comment": "\"Betrayal by those in authority is a recurring theme in Israel’s history. This tragic event foreshadows Christ’s betrayal and the necessity for steadfast faith even when authorities fail.\""
    },
    {
      "pk": 710717,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 17,
      "text": "'The flesh of your saints they have thrown, and their blood they have shed around Jerusalem, and there was no one to bury them.'",
      "links": "<a href='/AIV/19/79/2-3'>Ps. 79:2-3</a>",
      "comment": "This citation of Psalm 79 highlights the ongoing lament for the faithful who suffer at the hands of oppressors; an image fulfilled in ultimate form in the sufferings of Jesus and the early Church."
    },
    {
      "pk": 710718,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 18,
      "text": "Then the fear and dread of them fell on the people, who said, 'There is no truth or justice in them! They broke their agreement and oath.'",
      "links": "",
      "comment": "The people’s cry reflects the deep need for trustworthy leadership founded on truth—ultimately provided in the new covenant."
    },
    {
      "pk": 710719,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 19,
      "text": "Bacchides left Jerusalem and camped at Beth-zaith. He sent men to seize many of the deserters who had joined him, as well as some of the people, and killed them, throwing them into the great pit.",
      "links": "",
      "comment": "The brutality underscores the seriousness of apostasy and the price of compromise with evil."
    },
    {
      "pk": 710720,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 20,
      "text": "He put Alcimus in charge of the country and left a force with him to support him. Bacchides returned to the king.",
      "links": "",
      "comment": "Here, political and religious powers are united under illegitimate leadership, in contrast with the union of spiritual and royal authority found in Christ."
    },
    {
      "pk": 710721,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 21,
      "text": "Alcimus struggled to retain the high priesthood.",
      "links": "",
      "comment": "Alcimus, lacking true spiritual authority, struggles to maintain control, revealing the importance of valid succession in leadership."
    },
    {
      "pk": 710722,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 22,
      "text": "Many lawless men of Israel gathered around him, gaining power over the land.",
      "links": "",
      "comment": "Corruption spreads, showing the consequences when spiritual authority is abused or perverted."
    },
    {
      "pk": 710723,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 23,
      "text": "Judas and his brothers saw that the troubles grew and that Alcimus and his supporters were increasing in power.",
      "links": "",
      "comment": "The persistence of faithful opposition to wrongful rulers calls to mind God’s preservation of a faithful remnant."
    },
    {
      "pk": 710724,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 24,
      "text": "Judas saw that Alcimus was oppressing the faithful, so he prayed for God’s help, for he was determined not to hand over the people to these evil men.",
      "links": "<a href='/AIV/19/94/1-4'>Ps. 94:1-4</a>",
      "comment": "Reliance on divine assistance in times of crisis is a foundational theme for all who follow God."
    },
    {
      "pk": 710725,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 25,
      "text": "Alcimus saw that Judas and his followers were growing mighty, and that he could not resist them; so he returned to the king, accusing them of great crimes.",
      "links": "",
      "comment": "Unjust accusations against God’s people point ahead to the false charges against Christ."
    },
    {
      "pk": 710726,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 26,
      "text": "Then the king sent Nicanor, one of his top generals, who hated and bore great enmity against Israel, and commanded him to destroy the people.",
      "links": "<a href='/AIV/44/3/38'>1 Macc. 3:38</a>",
      "comment": "Nicanor’s mission prefigures both anti-Jewish persecution and later persecutions throughout Church history."
    },
    {
      "pk": 710727,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 27,
      "text": "Nicanor came to Jerusalem with a large army, and sent friendly messages to Judas and his brothers with deceitful words, saying,",
      "links": "",
      "comment": "Deceitful diplomacy was a common tactic; the faithful must remain vigilant."
    },
    {
      "pk": 710728,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 28,
      "text": "'Let there be no war between us. I will come with just a few men to meet you in peace.'",
      "links": "",
      "comment": "Feigning friendship, Nicanor attempts to trap Judas through guile, highlighting the need for discernment."
    },
    {
      "pk": 710729,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 29,
      "text": "He came to Judas, and they greeted each other peaceably. But the enemy was preparing to take Judas by force.",
      "links": "",
      "comment": "An example of treachery masked as diplomacy; true peace is rooted only in God."
    },
    {
      "pk": 710730,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 30,
      "text": "Judas learned that Nicanor’s visit was deceptive, and he was afraid of being ambushed. So he left Nicanor, refusing to see him again.",
      "links": "",
      "comment": "Prudence and wisdom saved Judas, just as Jesus withdrew at times from those seeking to kill him (<a href='/AIV/43/7/1'>John 7:1</a>)."
    },
    {
      "pk": 710731,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 31,
      "text": "Nicanor realized his plan was exposed, and went out to fight Judas at Capharsalama.",
      "links": "",
      "comment": "Open conflict follows failed deception."
    },
    {
      "pk": 710732,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 32,
      "text": "About five hundred men of Nicanor’s army fell, and the rest fled to the city of David.",
      "links": "",
      "comment": "The victory of the faithful, even when outnumbered, echoes God’s frequent deliverance of his people."
    },
    {
      "pk": 710733,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 33,
      "text": "After these events, Nicanor went up to Mount Zion. Some priests came out of the temple to greet him in peace and show him the burnt offering being made for the king.",
      "links": "<a href='/AIV/44/4/38'>1 Macc. 4:38</a>",
      "comment": "Priests making offerings for the king reflect the Jewish practice of praying and sacrificing for leaders; a tradition continued by the Church through prayer for civil authorities (<a href='/AIV/54/2/1-2'>1 Tim. 2:1-2</a>)."
    },
    {
      "pk": 710734,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 34,
      "text": "Nicanor mocked and ridiculed them and defiled them, speaking arrogantly and swearing in anger,",
      "links": "",
      "comment": "The arrogance of those opposed to God recalls the mockery suffered by Christ and the righteous (see <a href='/AIV/19/22/7'>Ps. 22:7</a>)."
    },
    {
      "pk": 710735,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 35,
      "text": "'If Judas and his army are not delivered into my hand immediately, I will level this House of God to the ground, break down the altar, and build here a splendid temple to Dionysus.'",
      "links": "<a href='/AIV/27/9/27'>Dan. 9:27</a>",
      "comment": "Threatening the Temple with pagan worship is a blasphemous act that foreshadows the abomination of desolation. The promise of a rebuilt pagan temple calls to mind Daniel’s prophecy and later desecrations."
    },
    {
      "pk": 710736,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 36,
      "text": "Having spoken thus, he left in great anger.",
      "links": "",
      "comment": "Opposition to true worship is often fueled by rage and pride."
    },
    {
      "pk": 710737,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 37,
      "text": "The priests went in and stood before the altar and temple, weeping and praying:",
      "links": "",
      "comment": "The priestly intercession for deliverance is a profound image of Christ’s high priestly office (see <a href='/AIV/58/7/24-25'>Heb. 7:24-25</a>)."
    },
    {
      "pk": 710738,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 38,
      "text": "'Lord, you chose this house to bear your name and to be a house of prayer and supplication for your people.'",
      "links": "<a href='/AIV/10/7/13'>2 Sam. 7:13</a>; <a href='/AIV/23/56/7'>Isa. 56:7</a>",
      "comment": "The Temple as a house of prayer reflects the continuity of God’s dwelling with his people. Jesus later declares the temple to be a house of prayer (<a href='/AIV/40/21/13'>Matt. 21:13</a>)."
    },
    {
      "pk": 710739,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 39,
      "text": "'Take vengeance on this man and his army, and let them fall by the sword. Remember their blasplemies, and do not allow them to continue.'",
      "links": "<a href='/AIV/19/74/18,22'>Ps. 74:18,22</a>",
      "comment": "The prayer for justice appeals to God’s defense of his holy name and sanctuary."
    },
    {
      "pk": 710740,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 40,
      "text": "Nicanor set out from Jerusalem and camped at Beth-horon. The Syrian army joined him there.",
      "links": "<a href='/AIV/6/10/10'>Josh. 10:10</a>",
      "comment": "Beth-horon is historically associated with decisive battles in Israel’s history."
    },
    {
      "pk": 710741,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 41,
      "text": "Judas camped at Adasa with three thousand men. He prayed, saying,",
      "links": "",
      "comment": "Judas continually seeks God’s help, modeling a life of prayer and dependence for Christian leadership."
    },
    {
      "pk": 710742,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 42,
      "text": "'O Lord, when those sent by the king of Assyria blasphemed, your angel went out and struck down one hundred and eighty-five thousand of them.'",
      "links": "<a href='/AIV/12/19/35'>2 Kings 19:35</a>",
      "comment": "Recalling God’s miraculous deliverance links the present struggle to God’s past interventions."
    },
    {
      "pk": 710743,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 43,
      "text": "'Thus destroy this army before us today, so that the rest may know he has spoken wickedly against your sanctuary. Judge him according to his wickedness.'",
      "links": "",
      "comment": "The plea for justice is anchored in zeal for God’s house, reminiscent of Christ cleansing the Temple (<a href='/AIV/43/2/14-17'>John 2:14-17</a>)."
    },
    {
      "pk": 710744,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 44,
      "text": "On the thirteenth day of Adar, the armies fought. Nicanor’s army was defeated, and Nicanor himself fell first in the battle.",
      "links": "",
      "comment": "The victory is recorded as occurring in Adar, a detail which foreshadows the feast day commemorating this victory."
    },
    {
      "pk": 710745,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 45,
      "text": "Then, when his army saw Nicanor had fallen, they threw down their arms and fled.",
      "links": "",
      "comment": "Leadership often determines the fate of armies and peoples; similarly, Christ’s victory brings about the ultimate defeat of evil."
    },
    {
      "pk": 710746,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 46,
      "text": "The Israelites pursued them for a day’s journey from Adasa to Gazara, blowing the signal trumpets.",
      "links": "<a href='/AIV/4/10/9'>Num. 10:9</a>",
      "comment": "Blowing trumpets is both a military and a liturgical act, symbolizing God’s intervention."
    },
    {
      "pk": 710747,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 47,
      "text": "People came out from all the villages of Judea, surrounding the fugitives and cutting them down; they all perished.",
      "links": "",
      "comment": "The thoroughness of the victory reflects God’s decisive interventions in history."
    },
    {
      "pk": 710748,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 48,
      "text": "Then the Israelites returned with joy and took spoils from the fallen.",
      "links": "<a href='/AIV/2/15/1-2'>Ex. 15:1-2</a>",
      "comment": "Victory leads to rejoicing—a foreshadowing of the spiritual joy promised to the faithful."
    },
    {
      "pk": 710749,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 49,
      "text": "They celebrated that day with great gladness, declaring that it would be remembered each year on the thirteenth day of Adar.",
      "links": "<a href='/AIV/17/9/20-21'>Esther 9:20-21</a>",
      "comment": "The institution of a memorial feast points to the enduring need for liturgical celebration of God’s deliverance, prefiguring Christian feasts and communal worship."
    },
    {
      "pk": 710750,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 50,
      "text": "Thus the land of Judah had rest for a short time.",
      "links": "",
      "comment": "Rest is given after victory, though only temporarily. It anticipates the perfect, everlasting rest promised in Christ (<a href='/AIV/58/4/9'>Heb. 4:9</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:25:06.421Z"
}