{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 1,
  "verses": [
    {
      "pk": 20001001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 1,
      "text": "After Alexander the Macedonian, the son of Philip, who came from the land of Kittim, defeated Darius, king of the Persians and Medes, he became king in his place, beginning his reign over Greece.",
      "links": "<a href='/AIV/27/8/5-7'>Dan. 8:5-7</a>",
      "comment": "Alexander's rise to power fulfills prophecy regarding the expansion of Greek rule (Daniel 8). 'Kittim' is a term used for western lands, often linked with the Greeks or Romans."
    },
    {
      "pk": 20001002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 2,
      "text": "He fought many battles, captured strongholds, and killed the kings of the earth.",
      "links": "<a href='/AIV/27/8/8'>Dan. 8:8</a>",
      "comment": "Emphasizes Alexander's military prowess. This sets the stage for understanding the turmoil into which the Jewish nation will be drawn."
    },
    {
      "pk": 20001003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 3,
      "text": "He advanced to the ends of the earth, and took spoils from many nations. The earth grew quiet before him; kings were terrified and submitted to him.",
      "links": "<a href='/AIV/27/7/6'>Dan. 7:6</a>",
      "comment": "The extent of Alexander’s conquest foreshadows the coming trials faced by God’s people as predicted in Daniel."
    },
    {
      "pk": 20001004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 4,
      "text": "He became exalted, and his heart was lifted up.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Alexander’s pride is noted. This pride will set the scene for the decline and division of his kingdom."
    },
    {
      "pk": 20001005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 5,
      "text": "He gathered a great army, dominated regions, nations, and their rulers, and they paid him tribute.",
      "links": "",
      "comment": "The consolidation of power by a pagan king contrasts later with the covenant faithfulness required of Israel."
    },
    {
      "pk": 20001006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 6,
      "text": "But after all this, he fell ill and sensed that he was dying.",
      "links": "<a href='/AIV/19/49/10'>Ps. 49:10</a>",
      "comment": "Even the mightiest rulers succumb to mortality, reminding readers of God’s ultimate sovereignty."
    },
    {
      "pk": 20001007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 7,
      "text": "So he summoned his distinguished officers, those who had been trained from youth, and divided his kingdom among them while he was still alive.",
      "links": "<a href='/AIV/27/8/22'>Dan. 8:22</a>",
      "comment": "As prophesied in Daniel, Alexander’s empire splits among his generals, paving the way for future struggles over Israel."
    },
    {
      "pk": 20001008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 8,
      "text": "After Alexander reigned twelve years, he died.",
      "links": "",
      "comment": "Alexander died at a young age (around 32), a historical event marking the passing of worldly glory."
    },
    {
      "pk": 20001009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 9,
      "text": "His officers ruled each in his own place.",
      "links": "",
      "comment": "The divided rule foreshadows the political instability to come."
    },
    {
      "pk": 20001010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 10,
      "text": "From them came forth a sinful root, Antiochus Epiphanes, son of King Antiochus. He had been a hostage in Rome, and he became king in the one hundred thirty-seventh year of the Greek kingdom.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>",
      "comment": "Antiochus Epiphanes, the chief villain of 1 Maccabees, is depicted as a ‘sinful root,’ fulfilling Daniel's prophecy. His reign marks a direct threat to Israel’s faithfulness."
    },
    {
      "pk": 20001011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 11,
      "text": "In those days, certain renegades emerged from Israel, misleading many. They said, 'Let us make a treaty with the nations around us, for since we separated from them, many evils have come upon us.'",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>",
      "comment": "Renegades seek assimilation with pagan nations, warning against abandoning faith under pressure—an ever-relevant temptation for God’s people."
    },
    {
      "pk": 20001012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 12,
      "text": "They found this proposal pleasing.",
      "links": "",
      "comment": "Acquiescence to compromise paves the way for further apostasy."
    },
    {
      "pk": 20001013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 13,
      "text": "Some of the people, eager for prestige, went to the king, who authorized them to adopt the customs of the Gentiles.",
      "links": "",
      "comment": "Pursuit of worldly status leads to cooperation with foreign powers at the cost of fidelity to God."
    },
    {
      "pk": 20001014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 14,
      "text": "So they built a gymnasium in Jerusalem, following Gentile custom.",
      "links": "",
      "comment": "The gymnasium symbolizes Hellenistic cultural influence, which included pagan religious practices and values."
    },
    {
      "pk": 20001015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 15,
      "text": "They removed the marks of circumcision, abandoned the holy covenant, allied themselves with the Gentiles, and sold themselves to do evil.",
      "links": "<a href='/AIV/03/26/15'>Lev. 26:15</a>",
      "comment": "Abandoning circumcision and the covenant demonstrates a total rejection of God’s commands. Assimilation here foreshadows challenges churches have faced throughout history."
    },
    {
      "pk": 20001016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 16,
      "text": "When Antiochus had established his kingdom, he determined to rule over Egypt so that he might reign over both kingdoms.",
      "links": "",
      "comment": "The desire to unite territories led Antiochus into further wars, aligning with the prophecies found in Daniel (see Dan. 11)."
    },
    {
      "pk": 20001017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 17,
      "text": "So he invaded Egypt with a great army, with chariots and elephants, horsemen, and a large fleet.",
      "links": "",
      "comment": "Details about military strength reflect historical accuracy, showing the pressure brought upon Israel from regional powers."
    },
    {
      "pk": 20001018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 18,
      "text": "He fought with the king of Egypt, and the king of Egypt fled before him; many were slain.",
      "links": "",
      "comment": "The narrative is consistent with the historical campaigns of Antiochus IV Epiphanes."
    },
    {
      "pk": 20001019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 19,
      "text": "He captured the fortified cities of Egypt and plundered the land.",
      "links": "",
      "comment": "Plundering echoes earlier Scriptures where God’s people suffered at the hands of foreign powers."
    },
    {
      "pk": 20001020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 20,
      "text": "After Antiochus defeated Egypt, he returned in the one hundred forty-third year and went up against Israel and came to Jerusalem with a strong force.",
      "links": "",
      "comment": "The return of Antiochus to Jerusalem sets up the crisis for faithful Israelites who would refuse to abandon God's law."
    },
    {
      "pk": 20001021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 21,
      "text": "He arrogantly entered the sanctuary and took the golden altar, the lampstand for the light, and all its utensils.",
      "links": "<a href='/AIV/02/25/31-39'>Ex. 25:31-39</a>",
      "comment": "The lampstand and altar are holy objects (Exodus 25). Their desecration foreshadows the need for sanctification, which Christ would ultimately fulfill."
    },
    {
      "pk": 20001022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 22,
      "text": "He took the table for the bread of the Presence, the cups for drink offerings, the bowls, the golden censers, the curtain, the crowns, and the golden decoration on the front of the temple. He stripped it all away.",
      "links": "<a href='/AIV/02/25/23-30'>Ex. 25:23-30</a>",
      "comment": "This detailed pillaging illustrates profanation of the sacred. Later, Christ cleanses and fulfills the true temple (cf. John 2:19)."
    },
    {
      "pk": 20001023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 23,
      "text": "He took the silver and gold, the precious vessels, and hidden treasures he found.",
      "links": "",
      "comment": "Antiochus’s greed echoes earlier temple desecrations (see 2 Kings 25:13-17)."
    },
    {
      "pk": 20001024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 24,
      "text": "Taking it all, he returned to his own land. He shed much blood and spoke with great arrogance.",
      "links": "",
      "comment": "Antiochus’s pride and violence foreshadow the persecution of the faithful throughout salvation history."
    },
    {
      "pk": 20001025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 25,
      "text": "There was mourning everywhere in Israel:",
      "links": "",
      "comment": "The desolation of Israel prefigures the sorrow the faithful experience in times of persecution."
    },
    {
      "pk": 20001026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 26,
      "text": "Rulers and elders groaned, young women and men lost their strength, and the beauty of the women faded.",
      "links": "",
      "comment": "Poetic language expressing total national distress, common in the Psalms and Prophets."
    },
    {
      "pk": 20001027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 27,
      "text": "Every bridegroom took up lamentation, the bride sat mourning in her chamber.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>",
      "comment": "The destruction of joy and celebration mirrors judgment themes in the prophets."
    },
    {
      "pk": 20001028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 28,
      "text": "The land trembled for its inhabitants, all the household of Jacob was clothed with shame.",
      "links": "",
      "comment": "Reflects the spiritual and physical consequences of profanation and faithlessness."
    },
    {
      "pk": 20001029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 29,
      "text": "After two years, the king sent a chief collector of tribute to the cities of Judah, and he entered Jerusalem with a large force.",
      "links": "",
      "comment": "Heavy taxation enforced by violence often led to further impoverishment and unrest."
    },
    {
      "pk": 20001030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 30,
      "text": "He spoke peaceably to them, but deceitfully, and they believed him. Then he fell upon the city suddenly, struck it with a great blow, and destroyed many people of Israel.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "The strategy of false promises followed by treachery is a repeating theme in Scripture."
    },
    {
      "pk": 20001031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 31,
      "text": "He plundered the city, burned it with fire, tore down its houses and surrounding walls.",
      "links": "",
      "comment": "Destruction of Jerusalem foreshadows later devastations—both physical and spiritual—that demand eventual restoration."
    },
    {
      "pk": 20001032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 32,
      "text": "They took captives, and seized women and children, and property, and made slaves of them.",
      "links": "",
      "comment": "A common outcome in ancient wars. This increases the suffering and highlights the total nature of oppression."
    },
    {
      "pk": 20001033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 33,
      "text": "Then they fortified the City of David with a great and strong wall and powerful towers, and it became their citadel.",
      "links": "",
      "comment": "Foreign rule now rests right in David’s historic stronghold—spiritually significant for the line of the Messiah."
    },
    {
      "pk": 20001034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 34,
      "text": "They stationed sinful men there, men who were renegades. They grew strong within the citadel.",
      "links": "",
      "comment": "These renegades betray the faith, setting up an internal, as well as external, threat to the true teaching and worship."
    },
    {
      "pk": 20001035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 35,
      "text": "They stored up arms and food and, gathering the spoils of Jerusalem, laid them up there. They became a great snare.",
      "links": "",
      "comment": "The citadel functions as a base for continued oppression, intensifying the need for deliverance."
    },
    {
      "pk": 20001036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 36,
      "text": "It became an ambush against the sanctuary, a constant evil adversary for Israel.",
      "links": "",
      "comment": "Conflict now rests at the heart of Israel’s religious life, prefiguring spiritual struggles Christians endure."
    },
    {
      "pk": 20001037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 37,
      "text": "They shed innocent blood all around the sanctuary and defiled the holy place.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "The shedding of blood in the sanctuary recalls lament Psalms that ask God for restoration."
    },
    {
      "pk": 20001038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 38,
      "text": "The inhabitants of Jerusalem fled because of them, and she became a dwelling for strangers, foreign to her own offspring, and her children abandoned her.",
      "links": "",
      "comment": "Abandonment of Jerusalem establishes the depth of desecration. Loss of rightful heirs prefigures spiritual exile."
    },
    {
      "pk": 20001039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 39,
      "text": "Her sanctuary lay desolate like a wilderness. Her feasts were turned into mourning, her Sabbaths into shame, her honor into contempt.",
      "links": "",
      "comment": "A reversal of Israel’s joy and worship. Restoration of worship becomes a central theme—the renewal of true worship finds fulfillment later in Jesus (see John 4:23-24)."
    },
    {
      "pk": 20001040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 40,
      "text": "Her former glory was as great as her present dishonor is now, and her greatness was turned into mourning.",
      "links": "",
      "comment": "Echoes lament prophecies (see Lamentations). The reversal heightens the dramatic need for redemption."
    },
    {
      "pk": 20001041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 41,
      "text": "Then the king wrote to his whole kingdom, commanding all to become one people,",
      "links": "",
      "comment": "Antiochus imposes religious uniformity—a foreshadowing of later attempts in history to make the Church conform to state power."
    },
    {
      "pk": 20001042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 42,
      "text": "and that each one should give up his own customs.",
      "links": "",
      "comment": "Dissolving religious identity is a perennial temptation. Faithfulness requires resisting such pressures."
    },
    {
      "pk": 20001043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 43,
      "text": "All the nations were in agreement according to the command of the king.",
      "links": "",
      "comment": "Popular consensus does not determine truth; the remnant will be faithful, as in times past (see Rom. 11:4-5)."
    },
    {
      "pk": 20001044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 44,
      "text": "Many from Israel agreed to his worship; they sacrificed to idols and profaned the Sabbath.",
      "links": "<a href='/AIV/02/20/8-11'>Ex. 20:8-11</a>",
      "comment": "Abandonment of the Sabbath and idolatry represents fundamental unfaithfulness against the commandments."
    },
    {
      "pk": 20001045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 45,
      "text": "The king sent letters by messengers to Jerusalem and the towns of Judah, ordering them to follow practices foreign to their own land,",
      "links": "",
      "comment": "Direct royal mandates sought to eradicate distinctive faith practices, confronting Israel with a choice for or against God."
    },
    {
      "pk": 20001046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 46,
      "text": "to forbid burnt offerings, sacrifices, and drink offerings in the sanctuary, to desecrate Sabbaths and feasts,",
      "links": "",
      "comment": "Aiming at the heart of worship, Antiochus attacks sacrifice—the means by which Israel maintains fellowship with God. Compare this with Christ's perfect Sacrifice (Heb. 10:12)."
    },
    {
      "pk": 20001047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 47,
      "text": "to defile the sanctuary and the priests,",
      "links": "",
      "comment": "The sanctity of priests is central; defiling them undermines the means of grace to the people. Symbolically, the attack is both on leaders and worship."
    },
    {
      "pk": 20001048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 48,
      "text": "to build pagan altars, sacred groves, and shrines for idols, to sacrifice swine and unclean animals,",
      "links": "<a href='/AIV/03/11/7'>Lev. 11:7</a>",
      "comment": "Swine were regarded as unclean (Leviticus 11). The imposition of such sacrifices signifies total rejection of God’s law."
    },
    {
      "pk": 20001049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 49,
      "text": "to leave their sons uncircumcised and to defile themselves with every kind of impurity and profanation,",
      "links": "<a href='/AIV/01/17/9-14'>Gen. 17:9-14</a>",
      "comment": "Neglect of circumcision is neglect of God’s everlasting covenant. For the Church, circumcision foreshadows baptism (see Col. 2:11-12)."
    },
    {
      "pk": 20001050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 50,
      "text": "so that they should forget the law and change all the statutes.",
      "links": "<a href='/AIV/19/119/16'>Ps. 119:16</a>",
      "comment": "The deliberate suppression of God’s law is the ultimate aim of these persecutions."
    },
    {
      "pk": 20001051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 51,
      "text": "Whoever did not obey the command of the king was to die.",
      "links": "",
      "comment": "Martyrdom emerges as the only choice for the truly faithful. This anticipates Jesus’ call to take up the cross (see Lk 9:23)."
    },
    {
      "pk": 20001052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 52,
      "text": "In these words, he wrote to his entire kingdom. He appointed inspectors over all the people, and he compelled the cities of Judah to offer sacrifice, city by city.",
      "links": "",
      "comment": "Decentralized enforcement of false worship increases the pressure on individual communities and families."
    },
    {
      "pk": 20001053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 53,
      "text": "Many of the people, everyone who abandoned the law, joined them, and they committed evil in the land.",
      "links": "",
      "comment": "Apostasy spreads rapidly when leaders and communities compromise faith for safety or approval."
    },
    {
      "pk": 20001054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 54,
      "text": "On the fifteenth day of the month Kislev, in the one hundred forty-fifth year, they erected the desolating sacrilege upon the altar of burnt offering. They built pagan altars throughout the towns of Judah on every side.",
      "links": "<a href='/AIV/27/12/11'>Dan. 12:11</a>; <a href='/AIV/41/13/14'>Mark 13:14</a>",
      "comment": "The 'desolating sacrilege' refers to the 'abomination of desolation' spoken of by Daniel and later by Jesus, showing prophetic fulfillment and spiritual typology."
    },
    {
      "pk": 20001055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 55,
      "text": "They burned incense at the doors of their houses and in the streets.",
      "links": "",
      "comment": "Worship was desecrated even in what should have been private and sacred spaces."
    },
    {
      "pk": 20001056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 56,
      "text": "They tore up the books of the law and burned them with fire.",
      "links": "<a href='/AIV/24/36/23'>Jer. 36:23</a>",
      "comment": "Destruction of the Scriptures is meant to sever Israel’s connection with God. The importance of preserving Scripture remains central to the Church’s mission."
    },
    {
      "pk": 20001057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 57,
      "text": "If anyone was found with a book of the covenant or if anyone kept the law, he was condemned to death by the king’s decree.",
      "links": "",
      "comment": "Demonstrates how clinging to revelation brings persecution, anticipating the courage of later witnesses to the faith (martyrs)."
    },
    {
      "pk": 20001058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 58,
      "text": "They kept persecuting Israel, anyone found monthly in the cities,",
      "links": "",
      "comment": "Persecution is systematic and ongoing, reflecting the endurance the faithful must show."
    },
    {
      "pk": 20001059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 59,
      "text": "On the twenty-fifth day of each month, they sacrificed on the altar that was over the altar of burnt offering.",
      "links": "",
      "comment": "These profane sacrifices mock the worship God prescribed, increasing the call for restoration."
    },
    {
      "pk": 20001060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 60,
      "text": "Women who had circumcised their children were put to death according to the decree.",
      "links": "",
      "comment": "Targeting families for upholding the covenant starkly reveals the depth of the evil the faithful face."
    },
    {
      "pk": 20001061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 61,
      "text": "Their infants were hanged from their mothers’ necks. Their families and those who circumcised them were killed.",
      "links": "",
      "comment": "Extreme persecution hints at the kind of suffering later Christians endure, especially for fidelity to the sacraments and commandments."
    },
    {
      "pk": 20001062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 62,
      "text": "Yet many in Israel stood firm and resolved in their hearts not to eat unclean food.",
      "links": "<a href='/AIV/27/1/8'>Dan. 1:8</a>",
      "comment": "The remnant's steadfastness recalls Daniel and his friends, showing the spiritual importance of obedience even under trial."
    },
    {
      "pk": 20001063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 63,
      "text": "They chose to die rather than be defiled by food or to profane the holy covenant. And so, they died.",
      "links": "<a href='/AIV/58/11/35-38'>Heb. 11:35-38</a>",
      "comment": "Voluntary martyrdom for God’s law foreshadows the witness of the saints who would likewise choose faithfulness over life, ultimately imitating Christ’s own perfect fidelity even unto death."
    },
    {
      "pk": 20001064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 1,
      "verse": 64,
      "text": "Great wrath came upon Israel.",
      "links": "",
      "comment": "The chapter closes with a note of judgment, heightening the anticipation for God's intervention and the restoration of the faithful. The fullness of restoration comes ultimately not just through national deliverance, but through the Redeemer, Jesus Christ."
    }
  ],
  "translatedAt": "2025-12-24T05:13:03.322Z"
}