{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 15,
  "verses": [
    {
      "pk": 1915011,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 1,
      "text": "Antiochus, son of Demetrius the king, sent a letter from the islands of the sea to Simon, the leader of the priests and to the people of the Jews.",
      "links": "<a href='/AIV/44/13/32'>1 Macc. 13:32</a>; <a href='/AIV/44/14/1'>1 Macc. 14:1</a>",
      "comment": "Antiochus VII becomes the new Seleucid ruler and communicates directly with the Jewish leadership. This formal recognition affirms the authority of Simon and the Jewish nation."
    },
    {
      "pk": 1915012,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 2,
      "text": "The contents of the letter were as follows: 'King Antiochus to Simon, chief priest and leader of the Jews, and to the Jewish nation, greetings.'",
      "links": "<a href='/AIV/44/15/1'>1 Macc. 15:1</a>",
      "comment": "Simon is addressed as high priest and ethnarch, showing his recognized religious and civil authority—a sign of unity between spiritual and temporal leadership, foreshadowing New Testament themes of the shepherd guiding the flock."
    },
    {
      "pk": 1915013,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 3,
      "text": "'Some troublemakers have usurped the kingdom of our ancestors; but I intend to reclaim it and restore it as it was before. I have recruited a large army and equipped warships.'",
      "links": "<a href='/AIV/44/11/13'>1 Macc. 11:13</a>; <a href='/AIV/44/14/3'>1 Macc. 14:3</a>",
      "comment": "Antiochus expresses his intent to restore legitimate rule—echoing the biblical theme of rightful kingship, as seen with David and Solomon (2 Sam. 7; 1 Kings 1)."
    },
    {
      "pk": 1915014,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 4,
      "text": "'I plan to land and pursue those who have destroyed our country and devastated many cities within my kingdom.'",
      "links": "<a href='/AIV/44/11/70'>1 Macc. 11:70</a>",
      "comment": "Restoration and justice are at the forefront of Antiochus's statement, reflecting God’s promise to restore Israel after exile (Jer. 29:10–14)."
    },
    {
      "pk": 1915015,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 5,
      "text": "'Therefore, I confirm to you all the exemptions granted to you by previous kings, and I allow you to print your own money for your nation.'",
      "links": "<a href='/AIV/44/10/29'>1 Macc. 10:29</a>; <a href='/AIV/44/13/36'>1 Macc. 13:36</a>",
      "comment": "The right to mint currency symbolizes national identity and religious freedom, reminiscent of the autonomy granted by Persian kings to Ezra and Nehemiah (Ezra 7:12–26; Neh. 2:7–8)."
    },
    {
      "pk": 1915016,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 6,
      "text": "'I permit you to be free from royal taxes and other tributes formerly paid to me, which I cancel from this day.'",
      "links": "<a href='/AIV/44/10/31'>1 Macc. 10:31</a>",
      "comment": "Exemption from tribute is significant as it provides economic relief and affirms a covenant-like relationship, recalling God’s favor and provision for His people (Lev. 25:10)."
    },
    {
      "pk": 1915017,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 7,
      "text": "'Moreover, I grant you authority over the Temple in Jerusalem, and you may appoint your leaders for the defense and governance of your region.'",
      "links": "<a href='/AIV/44/10/42'>1 Macc. 10:42</a>",
      "comment": "The temple’s governance is central, signifying the importance of worship and religious offices—pointing ahead to Christ as the ultimate High Priest and the Church's guardianship of sacred mysteries (Heb. 7:26–28)."
    },
    {
      "pk": 1915018,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 8,
      "text": "'Any fortress you have built or possess shall remain yours.'",
      "links": "<a href='/AIV/44/10/32'>1 Macc. 10:32</a>",
      "comment": "The right to fortify and defend points to God’s protection of His people, echoing Psalm 91:2."
    },
    {
      "pk": 1915019,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 9,
      "text": "'Any debts you owe to the royal treasury, now or in the future, are cancelled forever.'",
      "links": "<a href='/AIV/44/10/33'>1 Macc. 10:33</a>",
      "comment": "Total forgiveness of debt is a foreshadowing of the spiritual forgiveness found in Christ, as affirmed in the Lord’s Prayer (Matt. 6:12)."
    },
    {
      "pk": 1915020,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 10,
      "text": "'When I have reclaimed my kingdom, I will reward you and your nation, and your temple shall be held in honor across all the earth.'",
      "links": "<a href='/AIV/44/14/9'>1 Macc. 14:9</a>; <a href='/AIV/19/72/17'>Ps. 72:17</a>",
      "comment": "The global honor of the temple anticipates the Church’s universal spiritual significance (Isa. 56:7; John 4:21–24)."
    },
    {
      "pk": 1915021,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 11,
      "text": "Antiochus sent a golden wreath and a palm branch to Simon, together with the invitation to join in peace, maintaining dignity for himself and his people.",
      "links": "<a href='/AIV/44/13/41'>1 Macc. 13:41</a>",
      "comment": "Symbols of victory and peace—golden wreath and palm—mirror New Testament imagery associated with Christ's triumph and the palm branches at His entry into Jerusalem (John 12:13)."
    },
    {
      "pk": 1915022,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 12,
      "text": "He accepted Simon and showed him honor, counting him a faithful ally.",
      "links": "<a href='/AIV/44/10/20'>1 Macc. 10:20</a>",
      "comment": "Simon is recognized as a trusted partner, setting precedent for harmonious relations between faith and civil rule."
    },
    {
      "pk": 1915023,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 13,
      "text": "Demetrius, however, when he returned to his kingdom, found it opposed by Antiochus, and he fled out of the land.",
      "links": "<a href='/AIV/44/14/1'>1 Macc. 14:1</a>",
      "comment": "Political instability among the Seleucid leaders mirrors the changing powers throughout Old Testament history and God’s guidance amid turmoil (Dan. 2:21)."
    },
    {
      "pk": 1915024,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 14,
      "text": "Antiochus secured the throne of his ancestors, and so the land was quiet under his rule.",
      "links": "<a href='/AIV/44/10/52'>1 Macc. 10:52</a>",
      "comment": "The restoration of order foreshadows the peace brought by God’s chosen king, echoing Messianic expectations (Isa. 9:6–7)."
    },
    {
      "pk": 1915025,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 15,
      "text": "Trypho had fled to Dor on the coast, and Simon sent two thousand chosen men, and large sums of silver and gold, to Antiochus, asking him to let his troops leave the country, because Trypho was causing disorder.",
      "links": "<a href='/AIV/44/13/12'>1 Macc. 13:12</a>",
      "comment": "Simon’s diplomatic initiative demonstrates the leader’s role in securing peace through negotiation and sacrifice."
    },
    {
      "pk": 1915026,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 16,
      "text": "But Antiochus did not grant Simon’s request; instead, he gave orders for his officers to refuse all of Simon’s gifts.",
      "links": "<a href='/AIV/44/10/60'>1 Macc. 10:60</a>",
      "comment": "The king’s rejection highlights the limitations of human alliances, calling to mind that true deliverance comes from God alone (Ps. 146:3)."
    },
    {
      "pk": 1915027,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 17,
      "text": "He sent Athenobius, one of his friends, to discuss the matter with Simon.",
      "links": "<a href='/AIV/44/14/22'>1 Macc. 14:22</a>",
      "comment": "Athenobius functions as a royal envoy in ongoing negotiations."
    },
    {
      "pk": 1915028,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 18,
      "text": "Athenobius visited Simon and declared, 'You are holding Joppa, Gazara, and the Citadel in Jerusalem, cities that belong to the kingdom.'",
      "links": "<a href='/AIV/44/13/43'>1 Macc. 13:43</a>",
      "comment": "Claims to territorial rights underlines the tension between secular authority and religious autonomy—a narrative that anticipates later conflicts between church and state."
    },
    {
      "pk": 1915029,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 19,
      "text": "'Release these towns, and the tribute-tax collected from their districts.'",
      "links": "<a href='/AIV/44/10/30'>1 Macc. 10:30</a>",
      "comment": "The demand for tribute recalls Old Testament tensions over land and sovereignty (Num. 34:13)."
    },
    {
      "pk": 1915030,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 20,
      "text": "'If you refuse, pay a hundred talents of silver for Joppa and Gazara, and two hundred talents for the Citadel.'",
      "links": "<a href='/AIV/11/10/10'>1 Kings 10:10</a>",
      "comment": "Material compensation for territory reflects the cost of sovereignty and recalls tributes paid by Israel to foreign powers (2 Kings 23:33)."
    },
    {
      "pk": 1915031,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 21,
      "text": "Athenobius, seeing Simon’s wealth and the lavish table set before him, was amazed.",
      "links": "<a href='/AIV/44/14/48'>1 Macc. 14:48</a>",
      "comment": "Simon’s visible prosperity recalls the blessing bestowed on God's faithful servants (Ps. 128:1–2)."
    },
    {
      "pk": 1915032,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 22,
      "text": "Simon responded, 'We have not taken foreign lands, nor are we holding anything that does not belong to our fathers.'",
      "links": "<a href='/AIV/06/14/6'>Josh. 14:6</a>",
      "comment": "Simon appeals to ancestral heritage, asserting legitimacy—this echoes the biblical genealogy and inheritance central to Jewish identity (Gen. 12:7, Ex. 6:8)."
    },
    {
      "pk": 1915033,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 23,
      "text": "'But when our enemies unjustly took possession of these lands, we recovered them for our nation.'",
      "links": "<a href='/AIV/09/07/14'>1 Sam. 7:14</a>",
      "comment": "Restoration of lost inheritance echoes God restoring the Promised Land to Israel after conquest and exile."
    },
    {
      "pk": 1915034,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 24,
      "text": "'Regarding Joppa and Gazara, both caused much trouble to our people and are now in our possession.'",
      "links": "<a href='/AIV/44/13/43'>1 Macc. 13:43</a>; <a href='/AIV/44/13/52'>1 Macc. 13:52</a>",
      "comment": "The resolution of internal threats enables peace and security for the nation."
    },
    {
      "pk": 1915035,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 25,
      "text": "'We offer one hundred talents in compensation for these cities.'",
      "links": "<a href='/AIV/44/15/20'>1 Macc. 15:20</a>",
      "comment": "Simon’s offer is reasonable, showing a willingness to seek just and peaceful solutions."
    },
    {
      "pk": 1915036,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 26,
      "text": "Athenobius returned to the king and relayed Simon’s words and the splendor he had seen. The king was furious.",
      "links": "<a href='/AIV/44/10/60'>1 Macc. 10:60</a>",
      "comment": "The king’s wrath at Simon’s prosperity indicates the jealousy faced by God’s people when they are blessed (Gen. 26:14, Matt. 5:10–12)."
    },
    {
      "pk": 1915037,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 27,
      "text": "Trypho embarked on a ship and fled to Orthosia.",
      "links": "<a href='/AIV/44/13/12'>1 Macc. 13:12</a>",
      "comment": "Trypho’s retreat marks another turn in the ongoing power struggle."
    },
    {
      "pk": 1915038,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 28,
      "text": "The king appointed Cendebeus as commander of the coastland troops, and gave him troops and cavalry.",
      "links": "<a href='/AIV/44/10/65'>1 Macc. 10:65</a>",
      "comment": "Cendebeus’s appointment illustrates how secular powers attempt to control territory important to God’s people."
    },
    {
      "pk": 1915039,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 29,
      "text": "Cendebeus arrived at Jamnia and began to provoke the Israelites, invading Judea and capturing people and livestock.",
      "links": "<a href='/AIV/44/10/77'>1 Macc. 10:77</a>",
      "comment": "The invasion recalls earlier conflicts with foreign nations who oppressed Israel—a recurring theme in redemptive history."
    },
    {
      "pk": 1915040,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 30,
      "text": "He rebuilt the fortress at Kedron and stationed troops there to raid the highways.",
      "links": "<a href='/AIV/42/10/30'>Luke 10:30</a>",
      "comment": "Highway raiders disrupt the peace, demonstrating the necessity for vigilant leadership and protection of the faithful."
    },
    {
      "pk": 1915041,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 31,
      "text": "John, son of Simon, gathered the men from his father’s territory and attacked Kedron, destroying it and driving out the invaders.",
      "links": "<a href='/AIV/44/13/53'>1 Macc. 13:53</a>",
      "comment": "The defense of territory by John, Simon’s son, shows the importance of generational faithfulness and leadership—anticipates succession and apostolic continuity."
    },
    {
      "pk": 1915042,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 32,
      "text": "Cendebeus withdrew and returned to the king.",
      "links": "<a href='/AIV/44/15/28'>1 Macc. 15:28</a>",
      "comment": "Retreat of hostile forces emphasizes God’s deliverance for those who trust in Him."
    },
    {
      "pk": 1915043,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 33,
      "text": "Simon sent men to visit the cities of Judea and care for the people.",
      "links": "<a href='/AIV/44/13/33'>1 Macc. 13:33</a>",
      "comment": "Simon’s pastoral concern prefigures the shepherd imagery of Christ and the apostles (John 10:11; Acts 20:28)."
    },
    {
      "pk": 1915044,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 34,
      "text": "He and his sons gave their undivided effort to strengthen the cities, fortify the land, and guard against harm.",
      "links": "<a href='/AIV/44/13/52'>1 Macc. 13:52</a>",
      "comment": "Family involvement in preservation mirrors biblical themes of household faith, echoing Joshua’s declaration (Josh. 24:15)."
    },
    {
      "pk": 1915045,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 35,
      "text": "The people marveled at Simon’s leadership and his sons’ valor, praising them for the welfare they brought to Israel.",
      "links": "<a href='/AIV/44/14/7'>1 Macc. 14:7</a>",
      "comment": "Commendation of Simon’s leadership anticipates the honor given to just rulers and shepherds (Prov. 29:2; 1 Tim. 5:17)."
    },
    {
      "pk": 1915046,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 36,
      "text": "Simon governed uprightly, seeking the good of his nation and earning lasting peace.",
      "links": "<a href='/AIV/19/72/2'>Ps. 72:2</a>",
      "comment": "Just governance connects to Messianic prophecies of a righteous ruler (Isa. 9:7; Ps. 72:1–4)."
    },
    {
      "pk": 1915047,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 37,
      "text": "Antiochus, angry at Simon's resistance, began planning further campaigns against Judea.",
      "links": "<a href='/AIV/44/15/26'>1 Macc. 15:26</a>",
      "comment": "Ongoing hostility against God’s people is persistent throughout salvation history and stands as a typology for the Church’s struggles."
    },
    {
      "pk": 1915048,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 38,
      "text": "He sent Cendebeus with a larger army to attack Judea and instruct him to keep Simon under threat.",
      "links": "<a href='/AIV/44/15/28'>1 Macc. 15:28</a>",
      "comment": "The escalation of conflict demands steadfast faith and unity within the people of God."
    },
    {
      "pk": 1915049,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 39,
      "text": "Cendebeus set up camp at Jamnia, sent out raiding parties, and constructed fortifications at Kedron.",
      "links": "<a href='/AIV/44/15/29'>1 Macc. 15:29</a>",
      "comment": "The building of strongholds echoes the strategic preparations of ancient Israel (Num. 32:16)."
    },
    {
      "pk": 1915050,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 40,
      "text": "He positioned guards along the roads and began raiding nearby towns in Judea.",
      "links": "<a href='/AIV/07/05/6'>Judg. 5:6</a>",
      "comment": "Hostile patrols represent threats to the safety and freedom of God's people—foreshadowing the spiritual vigilance needed to protect faith from opposition."
    },
    {
      "pk": 1915051,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 41,
      "text": "This was how Cendebeus provoked war with Judea, causing great hardship for the land.",
      "links": "<a href='/AIV/44/12/41'>1 Macc. 12:41</a>",
      "comment": "The suffering brought by war highlights the cycle of conflict and deliverance—a theme that runs through Biblical history and finds fulfillment in Christ's ultimate victory over evil (Rev. 19:11–16)."
    }
  ],
  "translatedAt": "2025-12-23T09:32:19.952Z"
}