{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 13,
  "verses": [
    {
      "pk": 250531,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 1,
      "text": "When Simon heard that Trypho was gathering a large army to invade the land of Judah and destroy it,",
      "links": "<a href='/AIV/15/4/1'>Ezra 4:1</a>; <a href='/AIV/16/4/7-8'>Neh. 4:7-8</a>",
      "comment": "Simon steps up as a protector of the people, reminiscent of Nehemiah and other deliverers Israel had in times of crisis. Trypho plotting destruction continues the cycle of oppression and deliverance in Israel’s history."
    },
    {
      "pk": 250532,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 2,
      "text": "he saw that the people were terrified and trembling, so he went up to Jerusalem and gathered the people together.",
      "links": "<a href='/AIV/15/7/9'>Ezra 7:9</a>; <a href='/AIV/16/7/5'>Neh. 7:5</a>",
      "comment": "Simon’s leadership in rallying the people echoes the role of godly leaders throughout Scripture who gather God’s people for encouragement and direction."
    },
    {
      "pk": 250533,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 3,
      "text": "He encouraged them, saying, 'You know all the things I, my brothers, and my father’s house have done for the law and the sanctuary, and the wars and hardships we have witnessed.'",
      "links": "<a href='/AIV/14/29/5'>2 Chr. 29:5</a>; <a href='/AIV/58/11/32-34'>Heb. 11:32–34</a>",
      "comment": "Simon reminds them of the legacy of faithfulness, similar to the ‘cloud of witnesses’ in Hebrews 11."
    },
    {
      "pk": 250534,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 4,
      "text": "'All my brothers have died for the cause of Israel, and I alone am left.'",
      "links": "<a href='/AIV/58/11/35-37'>Heb. 11:35–37</a>",
      "comment": "Simon’s recognition of the price his family has paid underscores the cost of discipleship and leadership in serving God’s people."
    },
    {
      "pk": 250535,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 5,
      "text": "'But God forbid that I should abandon them in their time of trouble. Not now, nor ever!'",
      "links": "<a href='/AIV/19/27/9'>Ps. 27:9</a>; <a href='/AIV/58/13/5'>Heb. 13:5</a>",
      "comment": "Faithful leadership is committed, mirroring God’s own promise never to leave or forsake His people."
    },
    {
      "pk": 250536,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 6,
      "text": "'Far be it from me to spare my own life when trouble threatens my nation and my holy place.'",
      "links": "<a href='/AIV/19/69/9'>Ps. 69:9</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Simon’s willingness to lay down his life points ahead to the ultimate Good Shepherd who lays down his life for the flock (John 10:11)."
    },
    {
      "pk": 250537,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 7,
      "text": "'With God’s help, we will not let the law, the temple, or our way of life be trampled underfoot by the nations.'",
      "links": "<a href='/AIV/19/44/17'>Ps. 44:17</a>; <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "Confidence in divine aid recalls Paul’s affirmation that if God is for us, who can be against us?"
    },
    {
      "pk": 250538,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 8,
      "text": "Then the people were inspired by these words and responded with a great shout:",
      "links": "<a href='/AIV/07/6/34'>Judg. 6:34</a>; <a href='/AIV/16/2/18'>Neh. 2:18</a>",
      "comment": "The Spirit often moves God’s people to courage and unity through the words of righteous leaders."
    },
    {
      "pk": 250539,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 9,
      "text": "'You are our leader in place of your brothers. Lead us in fighting for the nation, and we will do all that you say.'",
      "links": "<a href='/AIV/06/1/16-18'>Josh. 1:16-18</a>",
      "comment": "The people’s acclamation of Simon as leader echoes collective recognition of legitimate authority among God’s people."
    },
    {
      "pk": 250540,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 10,
      "text": "So Simon gathered all able men and quickly completed the walls of Jerusalem, strengthening its defense.",
      "links": "<a href='/AIV/16/6/15'>Neh. 6:15</a>",
      "comment": "Building and fortifying the city is reminiscent of Nehemiah’s rebuilding of Jerusalem, a work pleasing to God."
    },
    {
      "pk": 250541,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 11,
      "text": "Then he sent Jonathan, son of Absalom, with a considerable force to Joppa, after he had driven out those who were there. He remained and secured the city.",
      "links": "<a href='/AIV/06/19/46'>Josh. 19:46</a>",
      "comment": "Joppa was an important seaport, and securing it was critical for trade and defense."
    },
    {
      "pk": 250542,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 12,
      "text": "Meanwhile, Trypho left Ptolemais with a large army to invade the land of Judah, bringing Jonathan as a prisoner with him.",
      "links": "<a href='/AIV/44/12/48'>1 Macc. 12:48</a>",
      "comment": "Trypho’s aggression exemplifies ongoing external threats to Israel’s autonomy and faith."
    },
    {
      "pk": 250543,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 13,
      "text": "But Simon encamped at Adida, facing the plain.",
      "links": "<a href='/AIV/06/10/12'>Josh. 10:12</a>",
      "comment": "Positioning troops strategically to block the enemy, showing prudence in both warfare and leadership."
    },
    {
      "pk": 250544,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 14,
      "text": "When Trypho learned that Simon had taken the place of his brother Jonathan and would fight him, he sent messengers to say:",
      "links": "<a href='/AIV/44/12/41'>1 Macc. 12:41</a>",
      "comment": "The adversary attempts negotiations, often a biblical pattern preceding betrayal or conflict."
    },
    {
      "pk": 250545,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 15,
      "text": "'We are holding Jonathan as a prisoner because of the silver owed from his accounts of government. If you send a hundred talents of silver and two of his sons as hostages, he will be released safely.'",
      "links": "<a href='/AIV/44/13/3'>1 Macc. 13:3</a>",
      "comment": "Trypho’s demands echo common ancient practices of ransom and hostages to ensure good faith."
    },
    {
      "pk": 250546,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 16,
      "text": "Though Simon knew they were speaking deceitfully, he sent for the money and the boys so that the people would not blame him if Jonathan was killed.",
      "links": "<a href='/AIV/44/7/10'>1 Macc. 7:10</a>",
      "comment": "Simon’s prudence seeks the welfare of the community, preventing division among God’s people."
    },
    {
      "pk": 250547,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 17,
      "text": "So he sent the hundred talents and the boys, but Trypho broke his promise, did not release Jonathan,",
      "links": "<a href='/AIV/19/52/2-4'>Ps. 52:2-4</a>",
      "comment": "Here we see the duplicity of foreign oppressors, a recurring warning in Scripture to trust in God more than human promises."
    },
    {
      "pk": 250548,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 18,
      "text": "and instead, he inflicted great harm upon the land.",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "Betrayal leads to suffering, yet even these hardships can strengthen God’s people in faith."
    },
    {
      "pk": 250549,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 19,
      "text": "Trypho then set out to invade Dura and enter the land by way of the coast road.",
      "links": "<a href='/AIV/07/2/9'>Judg. 2:9</a>",
      "comment": "Geopolitical strategies impact the fate of God’s people."
    },
    {
      "pk": 250550,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 20,
      "text": "But Simon and his army kept pace with him wherever he went.",
      "links": "<a href='/AIV/44/13/13'>1 Macc. 13:13</a>",
      "comment": "Simon’s persistence and vigilance contrast with enemy treachery."
    },
    {
      "pk": 250551,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 21,
      "text": "Those in the citadel sent messengers to Trypho, urging him to come to them through the wilderness and send them supplies.",
      "links": "<a href='/AIV/44/6/18-20'>1 Macc. 6:18–20</a>",
      "comment": "Jerusalem’s citadel represented the last stronghold of enemy occupation."
    },
    {
      "pk": 250552,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 22,
      "text": "Trypho made ready all his horsemen to go that night, but a heavy snowfall impeded his advance, and he was unable to proceed.",
      "links": "<a href='/AIV/19/147/16-17'>Ps. 147:16–17</a>",
      "comment": "God can use natural circumstances—like snow—to frustrate the plans of the wicked."
    },
    {
      "pk": 250553,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 23,
      "text": "So he departed and went into Gilead.",
      "links": "<a href='/AIV/06/13/8'>Josh. 13:8</a>",
      "comment": "Trypho withdraws, likely due to frustration and divine providence."
    },
    {
      "pk": 250554,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 24,
      "text": "When he reached Bascama, he killed Jonathan, and he was buried there.",
      "links": "<a href='/AIV/44/12/48'>1 Macc. 12:48</a>",
      "comment": "The martyrdom of Jonathan marks another sacrifice in the fight for Israel’s freedom. Compare the righteous suffering of God’s people for a holy purpose."
    },
    {
      "pk": 250555,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 25,
      "text": "Then Trypho turned back and returned to his own land.",
      "links": "<a href='/AIV/44/13/23'>1 Macc. 13:23</a>",
      "comment": "Having killed Jonathan, Trypho’s campaign ends, leaving Israel with yet another martyr leader."
    },
    {
      "pk": 250556,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 26,
      "text": "Simon sent and collected the bones of his brother Jonathan, and he buried him with his ancestors in Modein.",
      "links": "<a href='/AIV/44/2/70'>1 Macc. 2:70</a>; <a href='/AIV/01/50/25'>Gen. 50:25</a>",
      "comment": "Respect for the dead and proper burial is a sign of hope in the resurrection. See also the burial and carrying of Joseph’s bones."
    },
    {
      "pk": 250557,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 27,
      "text": "All Israel wept with great mourning for him and grieved many days.",
      "links": "<a href='/AIV/09/28/3'>1 Sam. 28:3</a>; <a href='/AIV/35/12/21'>Zech. 12:21</a>",
      "comment": "The mourning of Israel for their righteous leaders shows the deep connection between shepherd and people, as Jesus would later weep over Jerusalem (Luke 19:41)."
    },
    {
      "pk": 250558,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 28,
      "text": "Simon set up a monument over Jonathan’s tomb at Modein, built high and visible for all.",
      "links": "<a href='/AIV/44/7/17'>1 Macc. 7:17</a>",
      "comment": "Commemoration of holy men is a tradition seen in monuments for Abraham, Isaac, and Jacob as well (Gen. 35:20)."
    },
    {
      "pk": 250559,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 29,
      "text": "He built seven pyramids, one for his father, his mother, and his four brothers.",
      "links": "<a href='/AIV/44/2/70'>1 Macc. 2:70</a>",
      "comment": "Honoring the whole family signifies the unity and importance of Godly heritage."
    },
    {
      "pk": 250560,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 30,
      "text": "He skillfully surrounded these with impressive columns, setting up armaments for an everlasting memorial for all who sailed by sea.",
      "links": "<a href='/AIV/19/112/6'>Ps. 112:6</a>",
      "comment": "A lasting memorial inspires future generations toward virtue."
    },
    {
      "pk": 250561,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 31,
      "text": "Such was the monument he made at Modein; it remains to this day.",
      "links": "<a href='/AIV/01/35/20'>Gen. 35:20</a>; <a href='/AIV/09/15/12'>1 Sam. 15:12</a>",
      "comment": "Memorials serve as physical witnesses to God’s faithful ones."
    },
    {
      "pk": 250562,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 32,
      "text": "Trypho dealt treacherously with King Antiochus the youth; he killed him,",
      "links": "<a href='/AIV/44/11/39'>1 Macc. 11:39</a>",
      "comment": "Political betrayal is a common theme in empires and kingdoms apart from God."
    },
    {
      "pk": 250563,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 33,
      "text": "and ruled in his place, seizing the crown of Asia and bringing great calamity to the land.",
      "links": "<a href='/AIV/27/7/8'>Dan. 7:8</a>",
      "comment": "Worldly power obtained by wicked means brings suffering (see the little horn of Daniel 7:8)."
    },
    {
      "pk": 250564,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 34,
      "text": "But Simon strengthened the strongholds throughout Judea, securing them with high towers, great gates, and bars. He supplied the fortresses with food.",
      "links": "<a href='/AIV/16/3/1-2'>Neh. 3:1-2</a>",
      "comment": "Physical preparations for defense show prudent stewardship but, in biblical theology, true reliance must be on God."
    },
    {
      "pk": 250565,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 35,
      "text": "He sent ambassadors to King Demetrius to seek peace and secure freedom for the land, because all that Trypho had done was nothing but plunder.",
      "links": "<a href='/AIV/44/10/47'>1 Macc. 10:47</a>",
      "comment": "Diplomacy is sometimes necessary for the welfare of God’s people; see also Daniel’s interactions with Gentile kings."
    },
    {
      "pk": 250566,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 36,
      "text": "King Demetrius responded with a letter, granting him authority over Jewish affairs.",
      "links": "<a href='/AIV/44/10/13-14'>1 Macc. 10:13-14</a>",
      "comment": "A king authorizing authority for Simon reflects a transition toward lawful, respected leadership among Israel’s rulers."
    },
    {
      "pk": 250567,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 37,
      "text": "The contents of the letter were as follows: 'King Demetrius to Simon, high priest and friend of kings, and to the elders and the Jewish people, greetings.'",
      "links": "<a href='/AIV/44/10/18-20'>1 Macc. 10:18-20</a>",
      "comment": "Simon is here recognized as both spiritual and civil leader—‘high priest and head,’ paralleling the role of Melchizedek (Genesis 14:18)."
    },
    {
      "pk": 250568,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 38,
      "text": "'We have received the gold crown and palm branch you sent; we are ready to make peace with you and to write to our officials to grant you release of taxes.'",
      "links": "<a href='/AIV/44/10/29'>1 Macc. 10:29</a>",
      "comment": "A gold crown and palm branch as gifts recall royal symbolism and foreshadow Christ’s triumphal entry (John 12:13)."
    },
    {
      "pk": 250569,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 39,
      "text": "'All the things we have granted you stand firm for you and your people; let the fortresses you have built be yours.'",
      "links": "<a href='/AIV/44/13/34'>1 Macc. 13:34</a>",
      "comment": "Official sanction provides national stability for Israel."
    },
    {
      "pk": 250570,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 40,
      "text": "'We forgive all mistakes and offenses to this day, along with the crown tax you owed; if anything remains, we forgive it out of generosity.'",
      "links": "<a href='/AIV/02/23/11'>Exod. 23:11</a>",
      "comment": "The motif of debt forgiveness hints at jubilee, remission, and foreshadows the forgiveness of sins in Christ (Matthew 6:12)."
    },
    {
      "pk": 250571,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 41,
      "text": "'Let Jerusalem and her territory, her tithes and her taxes, stand apart from the king’s domain.'",
      "links": "<a href='/AIV/44/10/31'>1 Macc. 10:31</a>",
      "comment": "A summary administrative autonomy anticipates the Church’s spiritual autonomy from worldly powers (cf. Acts 5:29)."
    },
    {
      "pk": 250572,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 42,
      "text": "'All who belong to Jerusalem’s ranks, exempt from tribute, are protected from all exactions.'",
      "links": "<a href='/AIV/44/10/38'>1 Macc. 10:38</a>",
      "comment": "God’s faithful are often uniquely protected for sacred service, anticipating the spiritual priesthood of all believers (1 Peter 2:9)."
    },
    {
      "pk": 250573,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 43,
      "text": "'As for those who are qualified to join your army or administration, let them be enrolled.'",
      "links": "<a href='/AIV/44/10/36'>1 Macc. 10:36</a>",
      "comment": "The army and administrative positions reinforce the unity of spiritual service and civil order."
    },
    {
      "pk": 250574,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 44,
      "text": "'Let there be peace between us, and send us assurances as proof of your friendship.'",
      "links": "<a href='/AIV/44/12/1'>1 Macc. 12:1</a>",
      "comment": "Diplomatic peace is a grace, yet Scripture teaches Christ is the ultimate peace between God and man (Eph. 2:14)."
    },
    {
      "pk": 250575,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 45,
      "text": "In the one hundred and seventieth year, the yoke of the nations was removed from Israel,",
      "links": "<a href='/AIV/44/10/1'>1 Macc. 10:1</a>",
      "comment": "This year marks a jubilee of sorts—the end of subservience—and is presented with biblical significance."
    },
    {
      "pk": 250576,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 46,
      "text": "and the people began to write on documents and contracts: 'In the first year of Simon, the great leader and high priest.'",
      "links": "<a href='/AIV/44/13/37'>1 Macc. 13:37</a>",
      "comment": "Chronology now bases itself on Simon’s priestly leadership, reflecting his approved status as both political and spiritual head."
    },
    {
      "pk": 250577,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 47,
      "text": "In those days Simon besieged Gaza, surrounding it with his army and building siege towers.",
      "links": "<a href='/AIV/07/16/21'>Judg. 16:21</a>",
      "comment": "Conquest of stronghold cities follows the pattern of earlier Israelite conquest under Joshua."
    },
    {
      "pk": 250578,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 48,
      "text": "He overran the city, and those who were inside fled. He purified the city of idols and pagan practices and then settled there Jews who would keep the Law. He rebuilt the city and constructed a house for himself there.",
      "links": "<a href='/AIV/05/12/3'>Deut. 12:3</a>; <a href='/AIV/44/13/2'>1 Macc. 13:2</a>",
      "comment": "The cleansing of pagan practices mirrors Israel’s call to holiness and exclusive worship, anticipating the Church’s eventual call to spiritual purity."
    },
    {
      "pk": 250579,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 49,
      "text": "Those who were in the citadel in Jerusalem could no longer leave or enter to buy or sell. They suffered hunger and many perished from famine.",
      "links": "<a href='/AIV/25/4/9-10'>Lam. 4:9-10</a>",
      "comment": "God’s judgment on oppressors often comes in the form of famine or siege, as throughout Israel’s history."
    },
    {
      "pk": 250580,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 50,
      "text": "Then they cried out to Simon for peace, and he granted it. He cast them out and purified the citadel from defilement.",
      "links": "<a href='/AIV/44/13/48'>1 Macc. 13:48</a>",
      "comment": "Purification of the temple mount is a recurring biblical theme, pointing toward spiritual restoration in the new covenant."
    },
    {
      "pk": 250581,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 51,
      "text": "On the twenty-third day of the second month in the one hundred and seventy-first year, with praise and palm branches, lyres, cymbals, harps, hymns and songs, great rejoicing, he entered the city, after having driven out all defilement from it.",
      "links": "<a href='/AIV/03/23/40'>Lev. 23:40</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "The entry with palm branches recalls the feast of Tabernacles and prefigures the triumphal entry of Jesus (John 12:13), linking this event to messianic expectation."
    },
    {
      "pk": 250582,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 52,
      "text": "He ordained that this day should be observed each year with gladness. He strengthened the city’s fortifications and stationed Jews there for defense, along with Arming its watchtowers.",
      "links": "<a href='/AIV/02/12/14'>Exod. 12:14</a>",
      "comment": "Annual commemoration of deliverance echoes the establishment of Israel’s feasts as perpetual memorials—showing the sacramental character of memory in worship."
    },
    {
      "pk": 250583,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 53,
      "text": "Simon thus consolidated his leadership, bringing peace to the land, and his faithfulness and glory endured for all time.",
      "links": "<a href='/AIV/19/89/29'>Ps. 89:29</a>",
      "comment": "The enduring faithfulness of God’s anointed leader is a shadow of the everlasting rule of Christ, who brings true and eternal peace. Kingdom leadership is both temporal and a pointer to the ultimate messianic King."
    }
  ],
  "translatedAt": "2025-12-23T09:31:03.856Z"
}