{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 9,
  "verses": [
    {
      "pk": 109301,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 1,
      "text": "When Demetrius heard that Nicanor and his army had fallen in battle, he sent Bacchides and Alcimus again to the land of Judah, and with them the right wing of his army.",
      "links": "<a href='/AIV/44/7/43-47'>1 Macc. 7:43–47</a>; <a href='/AIV/44/7/5'>1 Macc. 7:5</a>",
      "comment": "The return of Bacchides and Alcimus is a persistent threat against the faithful remnant in Judah."
    },
    {
      "pk": 109302,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 2,
      "text": "They traveled by the road that leads to Gilgal and camped before Mesaloth in Arbela, and they captured it and killed many people.",
      "links": "<a href='/AIV/44/9/62-70'>1 Macc. 9:62–70</a>",
      "comment": "The violence shows the severity of the oppression Israel faced, reminiscent of earlier times when foreign powers threatened God’s people."
    },
    {
      "pk": 109303,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 3,
      "text": "In the first month of the one hundred and fifty-second year, they camped outside Jerusalem.",
      "links": "<a href='/AIV/44/7/1'>1 Macc. 7:1</a>",
      "comment": "The precise dating underlines the historical record; such details help tie events to the fulfillment of God's plan for Israel in history."
    },
    {
      "pk": 109304,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 4,
      "text": "Then they marched on Berea with twenty thousand soldiers and two thousand horsemen.",
      "links": "",
      "comment": "Large numbers reflect the might of the empire, but also highlight God’s deliverance of the faithful even when overwhelmed."
    },
    {
      "pk": 109305,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 5,
      "text": "Judas had his camp in Elasa with about three thousand men; but they had no food prepared as they faced the advance.",
      "links": "<a href='/AIV/44/3/15-25'>1 Macc. 3:15–25</a>",
      "comment": "The faithful are often seemingly outnumbered and unprepared, a recurring biblical theme pointing to trust in divine providence."
    },
    {
      "pk": 109306,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 6,
      "text": "When they saw the size of Bacchides’ army, many were afraid and left the camp, leaving only some, including Judas.",
      "links": "<a href='/AIV/07/7/2-3'>Judg. 7:2–3</a>; <a href='/AIV/44/4/36'>1 Macc. 4:36</a>",
      "comment": "Faithfulness in adversity is honored by God; compare with Gideon's choosing of the few for battle."
    },
    {
      "pk": 109307,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 7,
      "text": "When Judas saw that his army had deserted and that he had to fight with few men, his heart was troubled, because he did not have time to gather them again.",
      "links": "",
      "comment": "Scripture often emphasizes the virtue of steadfast leadership in times of crisis. This foreshadows later leaders who remain faithful even when alone."
    },
    {
      "pk": 109308,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 8,
      "text": "But he said to those who remained, “Let us arise and go against our enemies, perhaps we can prevail.”",
      "links": "<a href='/AIV/09/14/6'>1 Sam. 14:6</a>",
      "comment": "Echoes Jonathan’s faith that the Lord can save by many or by few, emphasizing trust in God’s power."
    },
    {
      "pk": 109309,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 9,
      "text": "But they tried to persuade him, saying, “We are too few; let us wait and seek help. Then we can fight.”",
      "links": "",
      "comment": "Even God’s chosen leaders encounter doubts from their followers, yet faith demands action despite limited resources."
    },
    {
      "pk": 109310,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 10,
      "text": "But Judas replied, “God forbid that we should run away from them. If our time has come, let us die bravely for our brothers and not leave behind our honor.”",
      "links": "<a href='/AIV/44/2/50'>1 Macc. 2:50</a>; <a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Judas’s willingness to lay down his life for his people prefigures Christ’s sacrificial love (cf. John 15:13)."
    },
    {
      "pk": 109311,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 11,
      "text": "So the army of Bacchides came out from their camp and took up positions to advance.",
      "links": "",
      "comment": "As enemy forces move, the narrative builds tension; often in Scripture, God intervenes at moments of apparent defeat."
    },
    {
      "pk": 109312,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 12,
      "text": "The cavalry were divided into two wings. The slingers and archers came ahead, and the strongest of their warriors were at the front, with Bacchides himself on the right.",
      "links": "",
      "comment": "Details of the battle formation resemble patterns found in other ancient armies, giving historical realism to the account."
    },
    {
      "pk": 109313,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 13,
      "text": "When the trumpets sounded, those on the side of Judas also shouted, and the battle began.",
      "links": "<a href='/AIV/06/6/20'>Josh. 6:20</a>",
      "comment": "The sounding of trumpets signals God’s intervention or blessing in battles throughout the Old Testament."
    },
    {
      "pk": 109314,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 14,
      "text": "Judas saw that Bacchides and most of the army were on the right, so he and his warriors attacked the right wing and defeated them.",
      "links": "",
      "comment": "Judas’s tactics often prevailed against larger forces, reminiscent of God granting victory to His anointed servants."
    },
    {
      "pk": 109315,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 15,
      "text": "The left wing, seeing that the right was broken, pursued Judas and his men from behind.",
      "links": "",
      "comment": "The shifting fortune demonstrates both the skill of the enemies and the need for steadfast virtue under pressure."
    },
    {
      "pk": 109316,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 16,
      "text": "The battle raged fiercely, and many were wounded and fell on both sides.",
      "links": "",
      "comment": "The cost of conflict is high, as many of Israel’s woes come as a result of foreign oppression."
    },
    {
      "pk": 109317,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 17,
      "text": "Finally, Judas himself fell, and the rest fled.",
      "links": "<a href='/AIV/44/2/49-50'>1 Macc. 2:49–50</a>",
      "comment": "The death of Judas marks the end of a heroic era. Like Moses before him, he leads but does not enter final victory."
    },
    {
      "pk": 109318,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 18,
      "text": "Jonathan and Simon took the body of their brother and buried him in the tomb of their fathers at Modein.",
      "links": "<a href='/AIV/44/2/70'>1 Macc. 2:70</a>",
      "comment": "The burial in the ancestral tomb highlights continuity and respect for tradition in Israel’s history."
    },
    {
      "pk": 109319,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 19,
      "text": "All Israel mourned for him and wept with great lamentation for many days.",
      "links": "<a href='/AIV/10/1/17'>2 Sam. 1:17</a>; <a href='/AIV/44/4/36'>1 Macc. 4:36</a>",
      "comment": "The mourning of the people shows how God’s chosen leaders are honored in their passing."
    },
    {
      "pk": 109320,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 20,
      "text": "They said, “How is the mighty fallen, who saved Israel in its time of trouble!”",
      "links": "<a href='/AIV/10/1/19-27'>2 Sam. 1:19–27</a>",
      "comment": "The lament echoes David’s mourning for Saul and Jonathan, showing the connection between God’s saving work across generations."
    },
    {
      "pk": 109321,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 21,
      "text": "After the death of Judas, the enemies began to take back all the territory of Israel.",
      "links": "<a href='/AIV/44/3/41'>1 Macc. 3:41</a>",
      "comment": "Without strong, faithful leadership, the people suffer losses—a spiritual truth that highlights the importance of apostolic succession for the faith community."
    },
    {
      "pk": 109322,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 22,
      "text": "All the friends of Judas were pursued, and many were captured and killed.",
      "links": "",
      "comment": "Persecution of the righteous is a theme echoed in the later history of God’s people, including the early church."
    },
    {
      "pk": 109323,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 23,
      "text": "A great distress overtook Israel, such as had not been since the time prophets had ceased to appear among them.",
      "links": "",
      "comment": "The mention of the cessation of prophets points to a period between Old and New Testaments, where expectation of a new revelation is high."
    },
    {
      "pk": 109324,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 24,
      "text": "Then all the friends of Judas gathered and said to Jonathan,",
      "links": "",
      "comment": "Leadership moved by popular acclamation points toward the principle of apostolic succession seen in the acts of the early church."
    },
    {
      "pk": 109325,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 25,
      "text": "“Since your brother Judas has died, choose a man to lead us and continue the work of fighting for our people.”",
      "links": "",
      "comment": "Maintaining leadership after a leader’s death is vital for spiritual and practical continuity."
    },
    {
      "pk": 109326,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 26,
      "text": "So Jonathan, the son of Mattathias, was appointed as leader and governor in the place of Judas.",
      "links": "<a href='/AIV/44/10/15-21'>1 Macc. 10:15–21</a>",
      "comment": "Jonathan’s appointment prefigures structures of authority established by apostolic succession and governance in the New Testament."
    },
    {
      "pk": 109327,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 27,
      "text": "At that time, the enemies of Israel grew stronger than ever, so that those who kept the law had to hide wherever they could.",
      "links": "",
      "comment": "The righteous often suffer persecution, as seen in the lives of saints and martyrs throughout history."
    },
    {
      "pk": 109328,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 28,
      "text": "Now, Bacchides found out about this and pursued those who remained loyal to Jonathan.",
      "links": "",
      "comment": "Opposition is steadfast, yet perseverance is a mark of authentic faith, foreshadowing the perseverance of the church in adversity."
    },
    {
      "pk": 109329,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 29,
      "text": "When Jonathan and Simon, along with their followers, saw this, they retired to the wilderness of Tekoa and camped by the water of the pool.",
      "links": "",
      "comment": "Retreat into the wilderness is a recurring motif for purification and preparation before acts of deliverance."
    },
    {
      "pk": 109330,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 30,
      "text": "Bacchides realized this on the Sabbath, and he and all his army crossed the Jordan.",
      "links": "",
      "comment": "The enemies often disrespect the Sabbath, undermining the sanctity of divine worship—a recurring biblical theme."
    },
    {
      "pk": 109331,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 31,
      "text": "He also brought his brigade on the road towards Jerusalem.",
      "links": "",
      "comment": "Jerusalem’s status as the focal point of attack illustrates its centrality in Israel’s history and theology."
    },
    {
      "pk": 109332,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 32,
      "text": "Jonathan left Simon with his men in the place, while he moved to the city of Beth-basi and fortified it.",
      "links": "",
      "comment": "Delegation of tasks points to orderly governance and the importance of appointed leadership."
    },
    {
      "pk": 109333,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 33,
      "text": "Bacchides mobilized his army, and all those who followed him, and camped near Beth-basi and fought for many days.",
      "links": "",
      "comment": "The siege references the endurance required and the discipline of both sides in lengthy spiritual struggles."
    },
    {
      "pk": 109334,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 34,
      "text": "He made engines of war, but Jonathan left his brother Simon in the city and went out into the country, approaching a place called Chafar.",
      "links": "",
      "comment": "Warfare technologies highlight human ingenuity and perseverance required for victory."
    },
    {
      "pk": 109335,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 35,
      "text": "In the meantime, Simon and those with him left the city and burned the engines of war and attacked Bacchides.",
      "links": "",
      "comment": "Simon’s tactics of surprise and destruction reflect spiritual warfare and prefigure victory by faith."
    },
    {
      "pk": 109336,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 36,
      "text": "They destroyed the siege engines and won, taking back the city.",
      "links": "",
      "comment": "Victory in reclaiming the city is a theme reminiscent of the recovery of Jerusalem in earlier biblical history."
    },
    {
      "pk": 109337,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 37,
      "text": "Now, Ptolemy, son of Dorymenes, sent soldiers to defend the region of Jericho, and Jonathan’s men captured many and their livestock.",
      "links": "",
      "comment": "This event secures material resources, reinforcing God’s provision through righteous leadership."
    },
    {
      "pk": 109338,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 38,
      "text": "Jonathan and Simon’s men attacked and overcame the sons of Jambri, who had killed John, Simon's brother, stealing what he had.",
      "links": "",
      "comment": "Retributive justice is present; restitution for treachery underscores the biblical value of justice and mercy."
    },
    {
      "pk": 109339,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 39,
      "text": "So Jonathan assembled his brother Simon and moved to the camp of the sons of Jambri.",
      "links": "",
      "comment": "Family unity in pursuit of justice is a virtue that echoes through biblical narrative."
    },
    {
      "pk": 109340,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 40,
      "text": "They hid and observed the sons of Jambri celebrating a great wedding procession with music and instruments, heading from Nadabath.",
      "links": "",
      "comment": "Celebratory events often become occasions for decisive action, showing the unpredictability of spiritual warfare."
    },
    {
      "pk": 109341,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 41,
      "text": "Jonathan’s men left their hiding places and attacked the procession, killing many and capturing much property.",
      "links": "",
      "comment": "God’s justice sometimes comes unexpectedly, as seen in the history of Israel."
    },
    {
      "pk": 109342,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 42,
      "text": "The remainder fled to the mountains, and the wedding ended in mourning.",
      "links": "",
      "comment": "The reversal of celebration to mourning is a biblical motif, found in the Prophets and fulfilled in eschatological judgment."
    },
    {
      "pk": 109343,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 43,
      "text": "Thus Jonathan and Simon avenged the blood of their brother John.",
      "links": "",
      "comment": "Atonement for bloodshed echoes the requirement for justice and redemption found throughout Scripture."
    },
    {
      "pk": 109344,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 44,
      "text": "After this, they continued to pursue Bacchides, driving him back until he reached the walls of Jerusalem.",
      "links": "",
      "comment": "The persistence of righteousness in combatting evil is a theme repeated from the earliest biblical stories."
    },
    {
      "pk": 109345,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 45,
      "text": "Bacchides camped at Beth-zur for a long time, rebuilding its defenses.",
      "links": "",
      "comment": "Fortification of cities symbolizes preparation for future battles and spiritual vigilance."
    },
    {
      "pk": 109346,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 46,
      "text": "But Jonathan gathered all those who remained loyal to him in Judea and rebuilt its fortifications.",
      "links": "",
      "comment": "The restoration after devastation shows the role of leadership in rebuilding both spiritually and physically."
    },
    {
      "pk": 109347,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 47,
      "text": "He and Simon, along with their followers, crossed the Jordan and went into the wilderness of Beth-hogla.",
      "links": "",
      "comment": "Crossing the Jordan is a biblical symbol of renewal and transition, echoing Joshua’s entrance into the Promised Land."
    },
    {
      "pk": 109348,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 48,
      "text": "Bacchides knew of this, and on the Sabbath he sent his army to attack their strongholds.",
      "links": "",
      "comment": "Breaking Sabbath law for military action points to disregard for divine commands, foreshadowing later secular powers opposing the faith community."
    },
    {
      "pk": 109349,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 49,
      "text": "Jonathan’s men defended themselves as much as they could, but some in hiding were killed.",
      "links": "",
      "comment": "Martyrdom results from faithfulness; suffering for righteousness is a consistent scriptural theme, prefiguring New Testament martyrdom."
    },
    {
      "pk": 109350,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 50,
      "text": "Bacchides fortified multiple cities in Judea: Jericho, Emmaus, Beth-horon, Bethel, Timnath, Pharathon, and Tephon—all with strong walls and gates.",
      "links": "",
      "comment": "Building fortresses was a measure against future unrest but also symbolizes spiritual strongholds and the need for spiritual defense."
    },
    {
      "pk": 109351,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 51,
      "text": "He stationed garrisons in those cities, and in the surrounding areas, and set guards over the people of Israel.",
      "links": "",
      "comment": "Foreign domination’s reach extended even to local areas, intensifying spiritual and physical oppression."
    },
    {
      "pk": 109352,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 52,
      "text": "He strengthened the walls of Beth-zur, Gazara, and the citadel, setting them with men who hated Israel.",
      "links": "",
      "comment": "Hatred of the righteous by worldly powers is a repeating spiritual principle throughout Scripture."
    },
    {
      "pk": 109353,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 53,
      "text": "He kept prisoners in the citadel and supplied them with provisions.",
      "links": "",
      "comment": "Provision for enemy garrisons maintained oppression, a mark of continuing struggle between good and evil."
    },
    {
      "pk": 109354,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 54,
      "text": "Alcimus demanded that the wall of the inner sanctuary of the temple be torn down. He wanted to destroy the work of the prophets.",
      "links": "",
      "comment": "Desecration of the sanctuary prefigures opposition to priestly ministry and attempts to destroy apostolic teaching."
    },
    {
      "pk": 109355,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 55,
      "text": "But he was struck with fear, and God’s judgment came upon him; his plans were thwarted.",
      "links": "",
      "comment": "Divine intervention displays God’s guardianship of His holy place, and the limits of human ambition against divine will."
    },
    {
      "pk": 109356,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 56,
      "text": "Alcimus suffered, and his mouth was stopped, for he was paralyzed and could no longer speak.",
      "links": "",
      "comment": "God sometimes visits judgment directly, reminding that His authority prevails over those who seek to destroy sacred things."
    },
    {
      "pk": 109357,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 57,
      "text": "He died in agony, and at that time distress left Israel for a little while.",
      "links": "",
      "comment": "Relief from oppression points to God’s mercy and the belief in the restoration of peace through fidelity."
    },
    {
      "pk": 109358,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 58,
      "text": "Bacchides saw that Alcimus was dead, and returned to the king; the land of Judea was peaceful for two years.",
      "links": "",
      "comment": "Temporary peace following the death of oppressors is foil for the need of lasting spiritual foundation and true leadership."
    },
    {
      "pk": 109359,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 59,
      "text": "Then the lawless men plotted against Jonathan, saying, “Now he will have no army, no authority.”",
      "links": "",
      "comment": "Plotting against righteous leadership foreshadows opposition to spiritual authority—even among the ‘insiders’ of the faith."
    },
    {
      "pk": 109360,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 60,
      "text": "So Bacchides was summoned again to Judea by the lawless men.",
      "links": "",
      "comment": "Collusion with secular authorities to undermine spiritual leaders echoes later historical episodes in the early church."
    },
    {
      "pk": 109361,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 61,
      "text": "He came with a large army, secretly sending letters to all of his allies in Judea to seize Jonathan and his followers.",
      "links": "",
      "comment": "Deception and betrayal against righteous leadership repeats the motif of suffering for truth."
    },
    {
      "pk": 109362,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 62,
      "text": "But they realized the plot and captured fifty men of the lawless party and killed them.",
      "links": "",
      "comment": "Justice and discernment characterize spiritual leadership, and the necessity of defending the faithful."
    },
    {
      "pk": 109363,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 63,
      "text": "Jonathan, Simon, and their followers then withdrew to Beth-basi, in the wilderness, rebuilt its walls, and fortified it.",
      "links": "",
      "comment": "Rebuilding and fortification point to restoration and preparation, prefiguring the enduring spiritual house built under apostolic teaching."
    },
    {
      "pk": 109364,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 64,
      "text": "Bacchides came with all his army and camped before Beth-basi; he fought for many days and built engines of war.",
      "links": "",
      "comment": "The endurance of enemies demands perseverance in faith and steadfastness in trial."
    },
    {
      "pk": 109365,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 65,
      "text": "Jonathan left Simon in the city and went out into the country with a few men.",
      "links": "",
      "comment": "Dividing responsibilities is prudent leadership; faith requires delegation and trust in allies."
    },
    {
      "pk": 109366,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 66,
      "text": "He struck down Odomera and his brothers, the sons of Phasiron, in their tents and began to attack and defeat enemy forces.",
      "links": "",
      "comment": "Decisive victory against enemy bands illustrates God’s favor upon proactive faithfulness and leadership."
    },
    {
      "pk": 109367,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 67,
      "text": "Meanwhile Simon and his men attacked and burned the siege engines.",
      "links": "",
      "comment": "Destruction of enemy apparatus points to spiritual tactics against evil strongholds."
    },
    {
      "pk": 109368,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 68,
      "text": "Bacchides was defeated; his plans failed, and anger flared against the lawless men who led him to Judea.",
      "links": "",
      "comment": "Vengeance upon betrayers emphasizes the justice of God and the unreliability of those who oppose the faithful."
    },
    {
      "pk": 109369,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 69,
      "text": "Many of those traitorous Israelites, who had collaborated with Bacchides, were killed by him; Bacchides planned to leave Judea.",
      "links": "",
      "comment": "Punishment of false brethren is a warning for the dangers of division, pointing to the importance of unity under spiritual authority."
    },
    {
      "pk": 109370,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 70,
      "text": "Jonathan made peace with Bacchides and exchanged prisoners.",
      "links": "",
      "comment": "Making peace and exchanging prisoners demonstrates the wisdom and diplomacy that protects God’s people."
    },
    {
      "pk": 109371,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 71,
      "text": "Bacchides left Judea and did not return, and thus the land was at peace.",
      "links": "",
      "comment": "Peace achieved through perseverance and wise negotiation prefigures the ultimate peace offered in the kingdom of God."
    },
    {
      "pk": 109372,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 72,
      "text": "Jonathan lived at Michmash and began to judge the people and eliminate the wicked from Israel.",
      "links": "",
      "comment": "Judging the people and removing the wicked is reminiscent of prophetic and apostolic roles to shepherd the community and maintain purity."
    },
    {
      "pk": 109373,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 73,
      "text": "The events of Jonathan, his battles, acts of bravery, and leadership, are recorded and told again, just as those of Judas, in the annals of the people.",
      "links": "<a href='/AIV/44/2/51-70'>1 Macc. 2:51–70</a>",
      "comment": "The chronicles preserve the memory of faithful leaders, emphasizing tradition and continuity vital for the life of the community."
    }
  ],
  "translatedAt": "2025-12-23T09:26:23.912Z"
}