{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 8,
  "verses": [
    {
      "pk": 8018001,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 1,
      "text": "Now Judas heard of the fame of the Romans, that they were powerful and friendly with those who made alliances with them, and that they accepted all who came to them, forming friendship with many.",
      "links": "<a href='/AIV/44/1/10'>1 Macc. 1:10</a>; <a href='/AIV/44/12/1'>1 Macc. 12:1</a>",
      "comment": "The historical context underscores the appeal of Roman power and diplomacy during the intertestamental period, showing how Israel looked for strong allies in times of distress."
    },
    {
      "pk": 8018002,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 2,
      "text": "He was told about their battles and the valor they showed against the Gauls, how they overcame and subjected them to tribute.",
      "links": "<a href='/AIV/44/8/20'>1 Macc. 8:20</a>",
      "comment": "The Roman defeat of the Gauls served as an example of their military prowess, signifying worldly strength sought for protection; see Proverbs 21:31 for the limits of human strength."
    },
    {
      "pk": 8018003,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 3,
      "text": "He was informed of their deeds in Spain, how they captured the gold and silver mines and took control of the land through persistence and strategy.",
      "links": "<a href='/AIV/44/8/1'>1 Macc. 8:1</a>",
      "comment": "The Romans' conquest and economic expansion is reminiscent of the world's pursuit of treasure, contrasting with the true riches found in wisdom (cf. Proverbs 8:10)."
    },
    {
      "pk": 8018004,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 4,
      "text": "They subdued kings across the earth, even those who rose up against them from the ends of the world; they crushed them and brought destruction to many.",
      "links": "<a href='/AIV/27/2/40'>Daniel 2:40</a>",
      "comment": "Reference to Dan. 2:40 links Rome to the fourth kingdom in Daniel’s prophecy—an anticipation of Christ’s coming kingdom, which would surpass all earthly empires."
    },
    {
      "pk": 8018005,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 5,
      "text": "Philip, Perseus the king of the Greeks, and others who attacked them with great strength were defeated, and Rome took their lands.",
      "links": "<a href='/AIV/44/8/21'>1 Macc. 8:21</a>",
      "comment": "Highlights Rome’s supremacy over the Greek kingdoms, showing historic shifts foretold in Daniel 8."
    },
    {
      "pk": 8018006,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 6,
      "text": "Antiochus the Great, king of Asia, attacked them with a huge army and war elephants, but he was conquered and taken captive.",
      "links": "<a href='/AIV/27/8/21-22'>Daniel 8:21-22</a>",
      "comment": "Antiochus figures prominently in Jewish history, both as a foe and as an archetype of anti-Christ (cf. Daniel 11:21–45)."
    },
    {
      "pk": 8018007,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 7,
      "text": "They removed him and those who succeeded him. Rome imposed heavy tribute, leading those kings to pay annually.",
      "links": "<a href='/AIV/44/8/22'>1 Macc. 8:22</a>",
      "comment": "Rome’s demand for tribute reveals both her dominance and the limitations of earthly rule; Christ teaches to give to Caesar but render to God what is God’s (Matt. 22:21)."
    },
    {
      "pk": 8018008,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 8,
      "text": "Rome conquered the lands of Greece, made them subject, but left them free and gave them self-government.",
      "links": "<a href='/AIV/44/8/3'>1 Macc. 8:3</a>",
      "comment": "Rome’s policy of local autonomy prefigures universal governance with respect to diversity in Christian communities (cf. Acts 15:19–21)."
    },
    {
      "pk": 8018009,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 9,
      "text": "They destroyed kings who arose against them, never allowing any to rise twice against them.",
      "links": "<a href='/AIV/44/8/6'>1 Macc. 8:6</a>",
      "comment": "Shows Rome’s resolve to maintain authority, which spiritually calls to mind the Church’s authority given by Christ to the apostles for spiritual warfare (Matthew 16:18-19)."
    },
    {
      "pk": 8018010,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 10,
      "text": "They secured peace within their borders, and the rest of the world revered their government.",
      "links": "<a href='/AIV/44/8/13'>1 Macc. 8:13</a>",
      "comment": "Peace enforced by Rome foreshadows the messianic hope for lasting peace, fulfilled only in Christ who is our peace (Eph. 2:14)."
    },
    {
      "pk": 8018011,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 11,
      "text": "No one wore a crown or purple in Rome; no one showed off as a king, but all governed together.",
      "links": "<a href='/AIV/44/8/15'>1 Macc. 8:15</a>",
      "comment": "Imitates the idea of shared leadership, analogous to the apostles governing as a college under Christ (see Luke 22:30); the principle of unity and humility in the governing assembly is suggestive of ecclesial order."
    },
    {
      "pk": 8018012,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 12,
      "text": "They had a council of 320 senators who ruled daily, deliberating consistently for the welfare of all.",
      "links": "<a href='/AIV/44/8/15'>1 Macc. 8:15</a>",
      "comment": "The ordered council is a reflection of wise governance; see Exodus 18:17–23 for the principle of shared leadership through elders."
    },
    {
      "pk": 8018013,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 13,
      "text": "They delegate authority year after year, trusting it not to one but many, and their system endures.",
      "links": "<a href='/AIV/44/8/15'>1 Macc. 8:15</a>",
      "comment": "Shared governance is a reminder of the church’s model: leadership is not just individual, but collegial, and endures through succession (Acts 15:6–22)."
    },
    {
      "pk": 8018014,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 14,
      "text": "None of them usurps power or is envious, but each pursues the good of the whole.",
      "links": "<a href='/AIV/44/8/15'>1 Macc. 8:15</a>",
      "comment": "The selflessness and unity here echo the apostolic call to serve without pride, as in 1 Peter 5:2–3."
    },
    {
      "pk": 8018015,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 15,
      "text": "Judas chose Eupolemus son of John, son of Accos, and Jason son of Eleazar, and sent them to Rome to form an alliance and seek protection from Grecian oppression.",
      "links": "<a href='/AIV/44/12/16'>1 Macc. 12:16</a>",
      "comment": "The sending of envoys marks a pivotal moment, showing the value of wise diplomacy in safeguarding the faithful—a principle later reflected in missionary journeys."
    },
    {
      "pk": 8018016,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 16,
      "text": "He acted wisely, hoping Rome would grant them freedom from the yoke of the Greeks.",
      "links": "<a href='/AIV/44/8/1'>1 Macc. 8:1</a>",
      "comment": "A deliberate act seeking freedom, this anticipates the spiritual freedom Christ grants from the bondage of sin (John 8:36)."
    },
    {
      "pk": 8018017,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 17,
      "text": "They traveled to Rome, a great journey, and entered the senate to speak, saying:",
      "links": "<a href='/AIV/44/8/13'>1 Macc. 8:13</a>",
      "comment": "Their approach to the council mirrors the early church sending representatives to governing bodies (Acts 15:2)."
    },
    {
      "pk": 8018018,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 18,
      "text": "\"The people of Judea, their priests, and Judas, have sent us to establish peace and alliance with you, so we may count you as allies and friends.\"",
      "links": "<a href='/AIV/44/8/20'>1 Macc. 8:20</a>",
      "comment": "Here we see the union of the faithful seeking friendship for mutual protection and peace—a type of covenant, as later fulfilled in Christ’s new covenant (Heb. 8:6–13)."
    },
    {
      "pk": 8018019,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 19,
      "text": "This was pleasing to the Romans.",
      "links": "",
      "comment": "Acceptance by Rome marks the beginning of Israel’s relationship with earthly powers, later culminating in the Pax Romana that allowed the church’s gospel to spread."
    },
    {
      "pk": 8018020,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 20,
      "text": "They wrote an agreement on brass tablets and sent it to Jerusalem, so they would have it as a memorial of peace and alliance:",
      "links": "<a href='/AIV/44/12/1'>1 Macc. 12:1</a>; <a href='/AIV/02/24/7-8'>Exod. 24:7-8</a>",
      "comment": "Brass inscription as covenant foreshadows written covenants in Scripture; the alliance echoes Old Testament ritual covenant markings (Exodus 24)."
    },
    {
      "pk": 8018021,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 21,
      "text": "\"May the Romans and Judeans remain allies and friends forever, and if war arises against either, the other shall assist as needed.\"",
      "links": "",
      "comment": "Mutual defense reflects solidarity; spiritually, it points to the communion of saints defending one another through prayer (Romans 15:30)."
    },
    {
      "pk": 8018022,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 22,
      "text": "\"Neither shall one give, supply, or allow food, weapons, or money to the enemy of the other.\"",
      "links": "",
      "comment": "Loyalty and support are central themes—similar to the unity of the faithful in both doctrine and charity (Acts 2:44–45)."
    },
    {
      "pk": 8018023,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 23,
      "text": "\"The Romans have spoken thus to the Judeans: should their nation be oppressed, Rome will fight with them wholeheartedly.\"",
      "links": "",
      "comment": "Kindred action for justice reflects how the righteous should bear one another’s burdens (Galatians 6:2)."
    },
    {
      "pk": 8018024,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 24,
      "text": "\"So too, if Romans are attacked, the Judeans shall help them in sincerity, without deception.\"",
      "links": "",
      "comment": "Sincerity in alliance echoes Christ’s teaching to love one another genuinely (John 13:34)."
    },
    {
      "pk": 8018025,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 25,
      "text": "\"No aid shall be given to the enemy of either; neither shall they provide wheat or weapons to such.\"",
      "links": "",
      "comment": "This mutual defense manifests true loyalty and integrity, foreshadowing the Church’s call to resist evil together (James 4:7)."
    },
    {
      "pk": 8018026,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 26,
      "text": "\"The terms spoken by the Romans to the Judeans are to be held without violation.\"",
      "links": "",
      "comment": "Faithfulness in covenant echoes God's fidelity to His own; those called to follow Christ must keep their word as in Matthew 5:37."
    },
    {
      "pk": 8018027,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 27,
      "text": "In future years, these terms may be added or removed by consensus; what they agree upon is lawful.",
      "links": "",
      "comment": "Lawful consensus mirrors the principle of ongoing discernment and binding decisions in the apostolic council (Acts 15:28)."
    },
    {
      "pk": 8018028,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 28,
      "text": "\"On these tablets, the agreement stands between Rome and Judea.\"",
      "links": "",
      "comment": "The written covenant prefigures the establishment of new and everlasting covenants written on hearts (Jeremiah 31:33; Heb. 8:10)."
    },
    {
      "pk": 8018029,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 29,
      "text": "Judas ended the alliance, and the envoys returned to Jerusalem in joy.",
      "links": "<a href='/AIV/44/8/16'>1 Macc. 8:16</a>",
      "comment": "The return in joy is reminiscent of the disciples’ joy after establishing harmony in the church (Acts 15:30–31)."
    },
    {
      "pk": 8018030,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 30,
      "text": "When the oppressors heard that Rome had become Israel’s ally, they feared greatly.",
      "links": "<a href='/AIV/44/8/1'>1 Macc. 8:1</a>",
      "comment": "The nations’ fear at Rome's alliance foreshadows the opposition faced by the faithful in every age when joined to a powerful spiritual fellowship (Matthew 16:18)."
    },
    {
      "pk": 8018031,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 31,
      "text": "The enemy’s plans against Judah were broken; the land had rest.",
      "links": "<a href='/AIV/44/4/60'>1 Macc. 4:60</a>",
      "comment": "Peace following alliance mirrors the peace given by Christ, which surpasses all understanding (John 14:27)."
    },
    {
      "pk": 8018032,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 32,
      "text": "Thus, the alliance with Rome gave security and hope to Israel in dark days.",
      "links": "<a href='/AIV/23/9/2'>Isaiah 9:2</a>",
      "comment": "Hope in the midst of darkness anticipates the ultimate hope found in the coming Messiah, the true and eternal ally of God’s people (cf. Isaiah 9:2)."
    }
  ],
  "translatedAt": "2025-12-23T09:25:32.015Z"
}