{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 14,
  "verses": [
    {
      "pk": 12041001,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 1,
      "text": "In the one hundred seventy-second year, King Demetrius gathered his army and marched into Media to seek help for his cause against Trypho.",
      "links": "",
      "comment": "The reference to the 172nd year is calculated from the beginning of the Seleucid Era (312 BC), a common timeframe marker in 1 Maccabees. This historical anchor adds to the reliability of the narrative. (Compare Daniel 8:21-22 for other mentions of Hellenistic rulers.)"
    },
    {
      "pk": 12041002,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 2,
      "text": "But as soon as Arsaces, the king of Persia and Media, heard that Demetrius had entered his territory, he sent one of his generals to capture him.",
      "links": "",
      "comment": "Demetrius' capture by Arsaces (also known as Mithridates I) demonstrates the turbulent power struggles that set the stage for the rise of Jewish autonomy under Simon."
    },
    {
      "pk": 12041003,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 3,
      "text": "The general seized Demetrius and took him to Arsaces, who imprisoned him.",
      "links": "",
      "comment": "The defeat and imprisonment of Demetrius mark a turning point, weakening Seleucid opposition against Israel."
    },
    {
      "pk": 12041004,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 4,
      "text": "The land of Judah was at peace all the days of Simon, and he sought what was good for his nation. His people delighted in his authority and glory all his days.",
      "links": "<a href='/AIV/1/14/11'>1 Macc. 14:11</a>; <a href='/AIV/1/14/35'>1 Macc. 14:35</a>",
      "comment": "Simon's reign is remembered as a golden time of peace, reminiscent of the reign of King Solomon (cf. 1 Kings 4:25)."
    },
    {
      "pk": 12041005,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 5,
      "text": "He was known for renewing the splendor of his nation: his authority and glory extended throughout the ages.",
      "links": "",
      "comment": "Simon's efforts to restore the dignity and prestige of Israel echo the restoration imagery found in Isaiah 60:15."
    },
    {
      "pk": 12041006,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 6,
      "text": "He secured control of the land, recovered its borders, and reopened access to Joppa by sea.",
      "links": "<a href='/AIV/7/19/46'>Judges 19:46</a>; <a href='/AIV/9/10/15'>2 Sam. 10:15</a>",
      "comment": "Control over Joppa symbolized economic and strategic revitalization. Joppa had earlier appeared in the stories of Jonah (Jonah 1:3) and the restoration activities of Ezra (Ezra 3:7)."
    },
    {
      "pk": 12041007,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 7,
      "text": "He expelled foreigners from the country, and those who were in the city of David at Jerusalem, who had made themselves a stronghold. He stationed his own men there.",
      "links": "<a href='/AIV/1/13/49'>1 Macc. 13:49</a>",
      "comment": "This represents the continuing struggle for the purification of Israel's sacred spaces, an important theological theme (see Neh. 13:7-9)."
    },
    {
      "pk": 12041008,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 8,
      "text": "He reestablished the city, repaired its ruins, and made its fortifications strong.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>; <a href='/AIV/19/102/16'>Ps. 102:16</a>",
      "comment": "Simon's rebuilding echoes post-exilic restoration, pointing to God's ongoing faithfulness to Jerusalem."
    },
    {
      "pk": 12041009,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 9,
      "text": "The people tilled their land in peace, and the earth gave its produce, and the trees bore their fruit.",
      "links": "<a href='/AIV/3/26/4'>Lev. 26:4</a>; <a href='/AIV/19/67/6'>Ps. 67:6</a>",
      "comment": "This agricultural abundance echoes covenant blessings, reminiscent of Leviticus 26:4 and Deuteronomy 28:4."
    },
    {
      "pk": 12041010,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 10,
      "text": "The elders sat together in the squares, deliberating about what is good, while the young men wore glorious attire and armor.",
      "links": "",
      "comment": "Unity of young and old reflects the order and blessing of a well-governed people (cf. Zechariah 8:4-5)."
    },
    {
      "pk": 12041011,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 11,
      "text": "He supplied food for the cities and furnished them with the means of defense, so that his renown spread to the ends of the earth.",
      "links": "<a href='/AIV/1/5/67'>1 Macc. 5:67</a>",
      "comment": "The renown of Simon hints at the universal destiny of God's people; see also Isaiah 49:6."
    },
    {
      "pk": 12041012,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 12,
      "text": "He brought peace to his land, and Israel rejoiced with great joy.",
      "links": "<a href='/AIV/9/8/15'>2 Sam. 8:15</a>",
      "comment": "Simon's gift of peace foreshadows messianic expectations."
    },
    {
      "pk": 12041013,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 13,
      "text": "No one to attack or threaten them was left in the land. Kings were defeated in those days.",
      "links": "",
      "comment": "Israel's rest from external threats reminds us of the eschatological peace described in Micah 4:4."
    },
    {
      "pk": 12041014,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 14,
      "text": "He strengthened all the humble of his people and sought out the Law, and every lawless and wicked person he removed.",
      "links": "<a href='/AIV/19/119/1-3'>Ps. 119:1-3</a>",
      "comment": "Simon's purification efforts parallel earlier reforms under Josiah (2 Kings 23:25)."
    },
    {
      "pk": 12041015,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 15,
      "text": "He made the sanctuary glorious, and he multiplied the holy vessels.",
      "links": "<a href='/AIV/2/40/9'>Ex. 40:9</a>; <a href='/AIV/19/93/5'>Ps. 93:5</a>",
      "comment": "The restoration and beautification of the sanctuary point to God's dwelling and holiness among His people. The focus on sacred vessels and their abundance alludes to the enduring reverence for sacred material worship."
    },
    {
      "pk": 12041016,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 16,
      "text": "When it was heard in Rome and as far as Sparta that Jonathan was dead, they were deeply grieved.",
      "links": "<a href='/AIV/1/12/2'>1 Macc. 12:2</a>",
      "comment": "Sparta and Rome represent prominent foreign allies; the grief underscores the impact of Jonathan's death outside of Israel."
    },
    {
      "pk": 12041017,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 17,
      "text": "But when they heard that Simon, his brother, was made high priest in his place and ruled over the land and the cities therein,",
      "links": "<a href='/AIV/1/13/41-42'>1 Macc. 13:41–42</a>",
      "comment": "Simon's succession is marked as divinely guided, establishing hereditary priesthood and rule, similar to Melchizedek in Genesis 14:18."
    },
    {
      "pk": 12041018,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 18,
      "text": "They wrote on bronze tablets to renew their friendship and alliance with him, which were read before the assembly in Jerusalem.",
      "links": "<a href='/AIV/1/8/22'>1 Macc. 8:22</a>",
      "comment": "The formalization of alliances had profound implications, positioning Israel among the nations as a polity worthy of international partnership."
    },
    {
      "pk": 12041019,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 19,
      "text": "The copies of these letters were stored with the people and inscribed on bronze for enduring remembrance.",
      "links": "",
      "comment": "This practice of inscribing decrees echoes Deuteronomy 27:2-3, where the Law is written in stone to signify its lasting importance."
    },
    {
      "pk": 12041020,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 20,
      "text": "Then Simon sent men to Sparta carrying the documents to renew their alliance and friendship.",
      "links": "",
      "comment": "Continued international diplomacy highlights Simon’s wisdom and the respected status of God’s people among the nations."
    },
    {
      "pk": 12041021,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 21,
      "text": "They received those who came with honor and decreed that the copy of their words be stored in the records of the people and be handed over to Simon the high priest.",
      "links": "",
      "comment": "This verse reflects the importance of sacred memory and community tradition."
    },
    {
      "pk": 12041022,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 22,
      "text": "After these things, Simon sent Numenius to Rome, carrying a large gold shield weighing one thousand minas, to confirm the alliance and friendship with them.",
      "links": "",
      "comment": "Numenius' embassy and the golden shield display both reverence and honor given to foreign relations, consolidating Israel's status."
    },
    {
      "pk": 12041023,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 23,
      "text": "When the people heard these things, they said, 'With what thanks shall we repay Simon and his sons?'",
      "links": "<a href='/AIV/1/2/61'>1 Macc. 2:61</a>",
      "comment": "Israel’s gratitude for Simon’s leadership is reminiscent of how God’s people praise those who deliver them (cf. Judges 2:16-18)."
    },
    {
      "pk": 12041024,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 24,
      "text": "For he, his brothers, and his father have fought for Israel, have triumphed for them, and have repelled the enemies from Israel.'",
      "links": "<a href='/AIV/1/13/5'>1 Macc. 13:5</a>",
      "comment": "This verse highlights the continuity of salvation history through divinely appointed leaders."
    },
    {
      "pk": 12041025,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 25,
      "text": "They inscribed this record on bronze tablets and set them up on pillars on Mount Zion.",
      "links": "<a href='/AIV/2/23/24'>Ex. 23:24</a>",
      "comment": "Setting up tablets on Mount Zion demonstrates the sacredness of both the message and location."
    },
    {
      "pk": 12041026,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 26,
      "text": "They also made copies to send to Simon and to store in the temple treasury.",
      "links": "",
      "comment": "The centrality of the temple treasury underscores the connection between worship, history, and leadership."
    },
    {
      "pk": 12041027,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 27,
      "text": "This is the account of Simon: In the one hundred seventieth year, at the third month, on the eighteenth day, in Asaramel—",
      "links": "<a href='/AIV/3/23/16'>Lev. 23:16</a>",
      "comment": "Precise dating further authenticates the record, recalling the importance of exact dates in sacred history (e.g., Exodus 12:2)."
    },
    {
      "pk": 12041028,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 28,
      "text": "in a great assembly of priests and people, elders of the nation, and judges, when instructions were given that Simon should be their governor and high priest forever until there should arise a faithful prophet—",
      "links": "",
      "comment": "The union of priestly and civil authority in Simon foreshadows the coming of the One who will combine these roles perfectly (Cf. Zech. 6:13; Heb. 7:1-28). The phrase 'until there should arise a faithful prophet' points to prophetic expectation and the anticipation of future revelation, a subtle anticipation of Christ."
    },
    {
      "pk": 12041029,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 29,
      "text": "they recorded that Simon, the son of Mattathias, from the family of the sons of Joarib, and his brothers risked their lives and resisted the enemies of their people, to preserve their sanctuary and the Law, achieving great glory for their nation.",
      "links": "<a href='/AIV/1/2/1'>1 Macc. 2:1</a>",
      "comment": "Priestly ancestry (the house of Joarib) and defense of the sanctuary are primary qualifications for leadership."
    },
    {
      "pk": 12041030,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 30,
      "text": "Jonathan gathered the people and became their high priest, and when he was united to his people, he did much good for them.",
      "links": "",
      "comment": "The continuation of unity and leadership recalls Christ’s spiritual headship over the Church."
    },
    {
      "pk": 12041031,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 31,
      "text": "When their enemies planned to invade and lay waste to their country and stretch out their hands against their sanctuary,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041032,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 32,
      "text": "Simon fought for his country and spent much of his own wealth to arm the men of his nation and give them wages.",
      "links": "",
      "comment": "Simon’s generosity and personal sacrifice for his people are reminiscent of Christ’s own sacrificial giving (2 Corinthians 8:9)."
    },
    {
      "pk": 12041033,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 33,
      "text": "He fortified the cities of Judea, including Beth-zur by the borders, where the weapons of the enemy had previously been stored, and placed a garrison of Jews there.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041034,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 34,
      "text": "He fortified Joppa on the seacoast and Gazara on the borders of Azotus, where the enemies once lived, and settled Jews there, and provided all that was necessary for their people.",
      "links": "<a href='/AIV/1/13/47-48'>1 Macc. 13:47-48</a>",
      "comment": ""
    },
    {
      "pk": 12041035,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 35,
      "text": "The people saw Simon's faithfulness and the glory he determined to bring to his nation, and they made him their ruler and high priest because of all he had accomplished and his justice and loyalty that he displayed toward his people. He sought at all times to exalt his nation.",
      "links": "",
      "comment": "Simon’s justice and loyalty make him a type that points forward to the true High Priest who becomes both ruler and redeemer (see Hebrews 2:17-18)."
    },
    {
      "pk": 12041036,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 36,
      "text": "In his days things prospered in his hands, so that the Gentiles were driven out of their land, and those in the city of David, in Jerusalem, who had built themselves a citadel, from which they once would sally forth and defile the surroundings of the sanctuary and inflict grave injury on its purity.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041037,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 37,
      "text": "He settled Jews in it and fortified it for the security of the land and the city, and raised its walls.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041038,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 38,
      "text": "King Demetrius also confirmed him in the high priesthood,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041039,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 39,
      "text": "and counted him among his friends, and bestowed upon him great honor.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041040,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 40,
      "text": "For he knew that the Jews were called his friends, allies, and brothers, and Simon was appointed as their leader and high priest because of all these things.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041041,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 41,
      "text": "So the Jews and their priests determined that Simon should be their governor and high priest forever, until there should arise a trustworthy prophet,",
      "links": "<a href='/AIV/5/18/15'>Deut. 18:15</a>",
      "comment": "The absence of a final prophet yet is a theme that prepared hearts for Christ who is Priest, Prophet, and King."
    },
    {
      "pk": 12041042,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 42,
      "text": "and that he should have the authority to appoint officials, care for the holy things, oversee the country, the armor, and the fortresses.",
      "links": "<a href='/AIV/4/3/32'>Num. 3:32</a>",
      "comment": "Simon’s role over holy things prefigures stewardship in the New Covenant; spiritual authority and governance are closely linked."
    },
    {
      "pk": 12041043,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 43,
      "text": "He was to be obeyed by all, and all contracts in the land were to be drawn up in his name, and he was clothed in purple and gold.",
      "links": "",
      "comment": "The royal vestments symbolize both priestly and kingly authority—an important biblical motif later fulfilled in Christ (cf. Rev. 19:16)."
    },
    {
      "pk": 12041044,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 44,
      "text": "And none of the people or any priest was to refuse compliance with any command from him, nor to call an assembly in the country without his authority, nor to clothe himself in purple or wear a gold buckle.",
      "links": "",
      "comment": "This marks a strong central authority, preventing disorder and schism—key for unity among God’s people (Eph. 4:3)."
    },
    {
      "pk": 12041045,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 45,
      "text": "Whoever disobeys or disregards any of these statutes shall be liable to punishment.",
      "links": "",
      "comment": "The severity of judgment underscores the seriousness of obedience and unity."
    },
    {
      "pk": 12041046,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 46,
      "text": "So all the people agreed to confer on Simon the authority to act in accord with these decisions.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041047,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 47,
      "text": "Simon accepted, and was pleased to act as high priest and military leader and governor of the Jews and priests, and to take charge of all authority.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041048,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 48,
      "text": "They inscribed this decree on bronze tablets and placed them on pillars on Mount Zion.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 12041049,
      "translation": "AIV",
      "book": 46,
      "chapter": 14,
      "verse": 49,
      "text": "They made copies to send to Simon and to store in the temple treasury, so that the people of Israel may have a record of these things.",
      "links": "",
      "comment": "The conclusion affirms the value of tradition and tangible record-keeping, echoing biblical patterns of remembrance and transmission (Deut. 6:6-9; 2 Thess. 2:15)."
    }
  ],
  "translatedAt": "2025-12-23T09:31:45.870Z"
}