{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 1,
  "verses": [
    {
      "pk": 2001001,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 1,
      "text": "After Alexander son of Philip, the Macedonian, who came from the land of Kittim, had defeated Darius, king of the Persians and the Medes, he became king in his place, having first ruled in Greece.",
      "links": "<a href='/AIV/27/8/5-7'>Dan. 8:5-7</a>",
      "comment": "Alexander the Great is introduced, fulfilling Daniel's vision about the Greek empire overthrowing the Persians (Daniel 8:5-7)."
    },
    {
      "pk": 2001002,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 2,
      "text": "He waged many wars, conquered strongholds, and killed the kings of the earth.",
      "links": "<a href='/AIV/27/7/6'>Dan. 7:6</a>",
      "comment": "Alexander's military conquests are summarized, establishing the widespread influence of Hellenism."
    },
    {
      "pk": 2001003,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 3,
      "text": "He advanced to the ends of the earth and took spoils from many nations. All the earth was silent before him, and he became exalted and his heart was lifted up.",
      "links": "<a href='/AIV/19/76/8'>Ps. 76:8</a>",
      "comment": "Alexander’s pride and expansion echo biblical warnings against exalting oneself (compare Lucifer in Isa. 14)."
    },
    {
      "pk": 2001004,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 4,
      "text": "He gathered a strong army and ruled over countries, nations, and princes, and they became his subjects.",
      "links": "<a href='/AIV/19/2/8'>Ps. 2:8</a>",
      "comment": "Earthly kingdoms are subject to God's sovereign plan, as prophesied in Psalms and Daniel."
    },
    {
      "pk": 2001005,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 5,
      "text": "After these things he fell sick, and knowing that he was dying, he summoned his officers, noblemen who had been brought up with him from youth, and divided his kingdom among them while he was still alive.",
      "links": "<a href='/AIV/27/8/8'>Dan. 8:8, 11:4</a>",
      "comment": "The dividing of Alexander’s empire sets up the historical background for the Hellenistic period and the crisis for Israel."
    },
    {
      "pk": 2001006,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 6,
      "text": "Alexander reigned twelve years, and then he died.",
      "links": "",
      "comment": "The brevity and intensity of Alexander’s reign highlight the transient nature of worldly power."
    },
    {
      "pk": 2001007,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 7,
      "text": "After his death, they all put on crowns, each in his own place, and the sons after them for many years. They caused much evil on the earth.",
      "links": "<a href='/AIV/27/8/22'>Dan. 8:22</a>",
      "comment": "The divided rule of Alexander’s successors sets the stage for conflict and spiritual decline."
    },
    {
      "pk": 2001008,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 8,
      "text": "Then from them came forth a sinful root—Antiochus Epiphanes, son of King Antiochus. He had been a hostage in Rome. He began to reign in the one hundred and thirty-seventh year of the kingdom of the Greeks.",
      "links": "<a href='/AIV/27/11/21'>Dan. 11:21</a>",
      "comment": "Antiochus Epiphanes is the infamous oppressor prefigured in Daniel’s prophecy (Dan. 11:21)."
    },
    {
      "pk": 2001009,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 9,
      "text": "In those days, certain renegades came out from Israel, and misled many, saying, 'Let us go and make a covenant with the Gentiles around us, for since we separated from them, many evils have come upon us.'",
      "links": "",
      "comment": "The enticement to join with Gentiles mirrors Israel’s persistent temptation towards assimilation and faithlessness in the Old Testament."
    },
    {
      "pk": 2001010,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 10,
      "text": "The proposal pleased them, and some of the people eagerly went to the king, who authorized them to observe the customs of the Gentiles.",
      "links": "<a href='/AIV/02/32/1-6'>Ex. 32:1-6</a>",
      "comment": "Choosing cultural assimilation over God’s law is a recurring downfall of God’s people, echoing the idolatry at Sinai."
    },
    {
      "pk": 2001011,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 11,
      "text": "So they built a gymnasium in Jerusalem, according to the customs of the Gentiles.",
      "links": "",
      "comment": "The gymnasium introduced not only Greek physical culture but also spiritual compromise and impurity."
    },
    {
      "pk": 2001012,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 12,
      "text": "They removed the mark of circumcision, and abandoned the holy covenant. They joined with the Gentiles and sold themselves to do evil.",
      "links": "<a href='/AIV/02/12/48'>Ex. 12:48</a>",
      "comment": "Abandoning circumcision was a total rejection of their covenant with God."
    },
    {
      "pk": 2001013,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 13,
      "text": "When the kingdom was established before Antiochus, he determined to rule over Egypt, so that he might reign over both kingdoms.",
      "links": "<a href='/AIV/27/11/17'>Dan. 11:17</a>",
      "comment": "Antiochus’s ambition for territorial expansion fulfills more of Daniel’s prophecies (Dan. 11)."
    },
    {
      "pk": 2001014,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 14,
      "text": "He invaded Egypt with a mighty army, with chariots, elephants, cavalry, and a large fleet.",
      "links": "",
      "comment": "Elephants were a sign of Hellenistic military might but are a reminder of the futility of trusting in horses and chariots (Ps. 20)."
    },
    {
      "pk": 2001015,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 15,
      "text": "He engaged Ptolemy, king of Egypt, in battle. Ptolemy was afraid before him and fled. Many were killed.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001016,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 16,
      "text": "They captured the fortified cities of Egypt, and Antiochus took the spoils of Egypt.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001017,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 17,
      "text": "After conquering Egypt, he returned in the one hundred and forty-third year. He went up against Israel and entered Jerusalem with a strong force.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001018,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 18,
      "text": "He arrogantly entered the sanctuary and took the golden altar, the lampstand for the light, and all the utensils used there.",
      "links": "<a href='/AIV/02/25/31-39'>Ex. 25:31-39</a>",
      "comment": "The lampstand (menorah) and altar were central for worship as prescribed in Exodus. Antiochus's desecration prefigures later attacks on the temple (see Matthew 24:15)."
    },
    {
      "pk": 2001019,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 19,
      "text": "He took the table for the bread of the Presence, the cups for drink offerings, the bowls, the golden censers, the curtain, the crowns, and the gold decoration on the front of the temple—he stripped everything.",
      "links": "<a href='/AIV/02/25/23-29'>Ex. 25:23-29</a>",
      "comment": "These items were prescribed by God, showing the depth of the desecration. The stealing of sacred items points to a spiritual and physical defilement."
    },
    {
      "pk": 2001020,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 20,
      "text": "He took the silver and the gold, and the precious vessels. He took all the hidden treasures he could find.",
      "links": "",
      "comment": "Material wealth of the temple signified God’s blessing. Its plundering depicts Israel’s spiritual poverty and foreshadows future exiles."
    },
    {
      "pk": 2001021,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 21,
      "text": "He took everything away. Then, with his army, he departed for his own land, having shed much blood and spoken with great arrogance.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001022,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 22,
      "text": "There was great mourning in Israel, in every place where they lived.",
      "links": "<a href='/AIV/25/1/1-2'>Lam. 1:1-2</a>",
      "comment": "The lament over Jerusalem echoes the sadness after the Babylonian exile (Lamentations)."
    },
    {
      "pk": 2001023,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 23,
      "text": "Rulers and elders groaned; young women and men lost strength. The beauty of women faded.",
      "links": "",
      "comment": "Despair descended on all society, from leadership down to all the people, indicating complete devastation."
    },
    {
      "pk": 2001024,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 24,
      "text": "Every bridegroom sang a dirge, and each bride sat mourning in her chamber.",
      "links": "<a href='/AIV/23/24/7'>Isa. 24:7</a>",
      "comment": "Isaiah connects the end of joy with divine judgment. Judah’s sorrow here foreshadows eschatological lament at the world’s end without redemption."
    },
    {
      "pk": 2001025,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 25,
      "text": "The land shook over its inhabitants, and all the people of Jacob were clothed with shame.",
      "links": "",
      "comment": "Shame here is both a social and spiritual result of abandoning the covenant."
    },
    {
      "pk": 2001026,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 26,
      "text": "Great wrath was poured out upon Israel from heaven.",
      "links": "<a href='/AIV/27/9/11'>Dan. 9:11</a>",
      "comment": "God’s wrath is always portrayed as just and righteous whenever His people forsake His law."
    },
    {
      "pk": 2001027,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 27,
      "text": "In the forty-third year, Antiochus returned and went up against Israel and Jerusalem with a mighty force.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001028,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 28,
      "text": "He arrogantly entered the sanctuary and took the golden altar, the lampstand for the light, and all the utensils.",
      "links": "<a href='/AIV/02/25/31-39'>Ex. 25:31-39</a>",
      "comment": ""
    },
    {
      "pk": 2001029,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 29,
      "text": "He took the table for the bread of the Presence, the cups for drink offerings, the bowls, the golden censers, the curtain, the crowns, and the golden ornament on the front of the temple. He stripped everything.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001030,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 30,
      "text": "He took the silver and gold, and the precious vessels. He took all the hidden treasures he found.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001031,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 31,
      "text": "He took everything and returned to his own land. He shed much blood and spoke with great arrogance.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001032,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 32,
      "text": "Israel mourned deeply in every community.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001033,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 33,
      "text": "Rulers and elders groaned, young women and men lost their vigor, and the beauty of the women was dimmed.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001034,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 34,
      "text": "Every bridegroom took up a lament. She who sat in the marriage chamber was in mourning.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001035,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 35,
      "text": "The land was shaken on account of its inhabitants. All the house of Jacob was clothed with shame.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001036,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 36,
      "text": "Then the king sent officials to Athens who delivered the order that the people should adopt the ways of the Gentiles in the land.",
      "links": "",
      "comment": "Athens represents the heart of Greek culture. Imposing its customs is a symbol of the forced assimilation and idol worship Israel faced. Such challenges test the faithfulness of God's people."
    },
    {
      "pk": 2001037,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 37,
      "text": "They built a gymnasium in Jerusalem according to the customs of the Gentiles.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001038,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 38,
      "text": "They removed the marks of circumcision and abandoned the holy covenant. They joined with the Gentiles and sold themselves to do evil.",
      "links": "",
      "comment": "A repeat of earlier apostasies, underscoring the spiritual dangers of conforming to the world (Romans 12:2)."
    },
    {
      "pk": 2001039,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 39,
      "text": "The king then sent letters throughout Jerusalem and the cities of Judah inviting them to observe customs foreign to the land,",
      "links": "",
      "comment": "Recalls similar decrees by Nebuchadnezzar and Darius in the Book of Daniel."
    },
    {
      "pk": 2001040,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 40,
      "text": "and to prohibit burnt offerings, sacrifices, and drink offerings in the sanctuary, to profane sabbaths and feast days,",
      "links": "",
      "comment": "Worship and ritual integrity is under attack. Removing sacrifices foreshadows the end times ‘abomination of desolation’ (Matt 24:15)."
    },
    {
      "pk": 2001041,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 41,
      "text": "to defile the sanctuary and the priests,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001042,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 42,
      "text": "to build altars, sacred groves, and shrines to idols, and to sacrifice pigs and other unclean animals.",
      "links": "<a href='/AIV/03/11/7'>Lev. 11:7</a>",
      "comment": "Sacrificing unclean animals is the height of profanation according to the Law of Moses."
    },
    {
      "pk": 2001043,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 43,
      "text": "They were also to leave their sons uncircumcised. They were to defile themselves with every kind of impurity and profanation,",
      "links": "",
      "comment": "Uncircumcision symbolizes abandoning God’s covenant—spiritual and physical corruption."
    },
    {
      "pk": 2001044,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 44,
      "text": "so that they would forget the law and change all the ordinances.",
      "links": "",
      "comment": "Forgetting God’s law is the worst fate for God’s people, a theme echoed by Jesus’ call to remember the heart of the law (Matt 5:17)."
    },
    {
      "pk": 2001045,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 45,
      "text": "Anyone who did not obey the command of the king would die.",
      "links": "",
      "comment": "Martyrdom for faithfulness begins here, showing suffering is sometimes the only faithful response (see Heb. 11:35-38)."
    },
    {
      "pk": 2001046,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 46,
      "text": "He wrote to all his kingdom to make all the same people, and to abandon their own customs.",
      "links": "",
      "comment": "Attempted unity without truth leads to oppression and tyranny—the opposite of Christ’s unity in diversity (John 17:21)."
    },
    {
      "pk": 2001047,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 47,
      "text": "All the Gentiles accepted the king’s command. Many in Israel were eager to adopt his religion; they sacrificed to idols and profaned the Sabbath.",
      "links": "",
      "comment": "Idolatry and Sabbath-breaking are both foundational covenant violations."
    },
    {
      "pk": 2001048,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 48,
      "text": "The king sent messengers, carrying written orders to Jerusalem and the towns of Judah, to force them to follow practices foreign to the country.",
      "links": "",
      "comment": "State-sponsored apostasy marks a time of purifying for the faithful remnant."
    },
    {
      "pk": 2001049,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 49,
      "text": "They were to stop burnt offerings, sacrifices, and drink offerings in the sanctuary; to profane the sabbaths and feasts;",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001050,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 50,
      "text": "to defile the sanctuary and its priests;",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001051,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 51,
      "text": "to build altars, sacred groves, and shrines for idols, to sacrifice pigs and other unclean animals;",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001052,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 52,
      "text": "and to leave their sons uncircumcised. They were to defile themselves with all kinds of impurity and profanation.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001053,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 53,
      "text": "They were to forget the law and change all the ordinances.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001054,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 54,
      "text": "Anyone who did not obey the word of the king was to be put to death.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001055,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 55,
      "text": "He wrote such words to all his kingdom. He appointed inspectors over all the people, and he commanded the towns of Judah to offer sacrifices, each town at a time.",
      "links": "",
      "comment": "Centralized inspection and forced compliance prefigure later attempts to control worship and conscience."
    },
    {
      "pk": 2001056,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 56,
      "text": "Many of the people—everyone who forsook the law—joined them. They did evil in the land;",
      "links": "",
      "comment": ""
    },
    {
      "pk": 2001057,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 57,
      "text": "they made Israel hide themselves in every place of refuge they had.",
      "links": "",
      "comment": "Persecution sends the faithful into hiding; a pattern continued in early Christianity during Roman persecutions (Acts 8:1-4)."
    },
    {
      "pk": 2001058,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 58,
      "text": "On the fifteenth day of Chislev, in the one hundred and forty-fifth year, they set up an abomination of desolation upon the altar of burnt offering. They built pagan altars throughout the cities of Judah on every side.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The ‘abomination of desolation’ is crucial for both Jewish and Christian prophecy. Jesus refers to this event as a sign of the end (Matt. 24:15)."
    },
    {
      "pk": 2001059,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 59,
      "text": "They burned incense at the doors of the houses and in the streets.",
      "links": "",
      "comment": "Incense for foreign gods was an abomination, formerly reserved for temple worship (cf. Lev. 16:12-13)."
    },
    {
      "pk": 2001060,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 60,
      "text": "They tore in pieces the books of the law which they found and burned them with fire.",
      "links": "",
      "comment": "Public destruction of the law is an attempt to destroy Israel’s faith and identity. Suggested parallel: Jer. 36:23."
    },
    {
      "pk": 2001061,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 61,
      "text": "Anyone found with a book of the covenant, or who held to the law, was condemned to death by the king’s decree.",
      "links": "",
      "comment": "Martyrdom for possessing and keeping the law marks out the faithful remnant."
    },
    {
      "pk": 2001062,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 62,
      "text": "Month after month, they used violence against Israel, against anyone found in the cities.",
      "links": "",
      "comment": "Ongoing persecution highlights the cost of faithfulness. Such suffering is later seen in Acts and Revelation."
    },
    {
      "pk": 2001063,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 63,
      "text": "On the twenty-fifth day of each month, they sacrificed on the altar that was on top of the altar of burnt offering.",
      "links": "",
      "comment": "Sacrificing on a profaned altar is the ultimate insult to God’s true worship, a reminder of later desecrations even in Christian history."
    },
    {
      "pk": 2001064,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 64,
      "text": "Mothers who had circumcised their children were put to death, according to the command; their babies were killed, and their families and those who circumcised them were also executed.",
      "links": "<a href='/AIV/02/1/22'>Ex. 1:22</a>",
      "comment": "The image of mothers sacrificing for their children recalls the faithful women of the Old Testament (Ex. 1:22). This points to sacrificial love—a foreshadowing of Christ’s own sacrifice on behalf of His people."
    }
  ],
  "translatedAt": "2025-12-23T09:19:36.536Z"
}