{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 6,
  "verses": [
    {
      "pk": 1932600,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 1,
      "text": "King Antiochus was traveling through the upper provinces when he heard that the city of Elymais in Persia was known for its great wealth, its silver and gold,",
      "links": "<a href='/AIV/13/3/31'>1 Macc. 3:31</a>;<a href='/AIV/27/11/44'>Dan. 11:44</a>",
      "comment": "This begins with the fate of Antiochus IV Epiphanes. The city of Elymais was renowned for its riches."
    },
    {
      "pk": 1932601,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 2,
      "text": "and that its temple, very rich, contained golden armor, shields, and weapons left there by Alexander, son of Philip, the first king of the Greeks.",
      "links": "<a href='/AIV/13/1/1'>1 Macc. 1:1</a>",
      "comment": "The reference to Alexander echoes the start of 1 Maccabees, grounding the story in real historical figures."
    },
    {
      "pk": 1932602,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 3,
      "text": "Antiochus came and tried to take the city and plunder it, but he could not because his plan became known to the people, who rose up against him in battle. He retreated in great distress to return to Babylon.",
      "links": "",
      "comment": "The king’s greed brings him no gain—echoes the theme of pride leading to downfall (see Proverbs 16:18)."
    },
    {
      "pk": 1932603,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 4,
      "text": "While he was still in Persia, news came to him that the armies that had gone into the land of Judah had been routed,",
      "links": "<a href='/AIV/13/4/35'>1 Macc. 4:35</a>",
      "comment": "News of military defeat adds to Antiochus’s woes, a sign of divine opposition (compare Numbers 14:42-45)."
    },
    {
      "pk": 1932604,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 5,
      "text": "and that Lysias had gone with a powerful army and was forced to flee before the men of Judah, who grew stronger because of their reliance on the Lord.",
      "links": "<a href='/AIV/13/4/35-39'>1 Macc. 4:35-39</a>;<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "The victory comes from placing trust in the Lord, not human strength. See Psalm 20:7 for the same spiritual lesson."
    },
    {
      "pk": 1932605,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 6,
      "text": "They had retaken the arms and the possessions left behind by the defeated armies, and had torn down the abomination that he had built on the altar in Jerusalem, as well as the surrounding sanctuary walls.",
      "links": "<a href='/AIV/13/1/54'>1 Macc. 1:54</a>;<a href='/AIV/27/11/31'>Dan. 11:31</a>",
      "comment": "Restoration of the altar and sanctuary is significant for the holiness of Israel's worship. Compare with Daniel’s prophecy of the ‘abomination of desolation’."
    },
    {
      "pk": 1932606,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 7,
      "text": "They had restored the sanctuary with high walls as before, and Beth-zur, his own city, was also fortified.",
      "links": "<a href='/AIV/13/4/60'>1 Macc. 4:60</a>",
      "comment": "The fortification of the Temple anticipates later practices of preserving sacred places."
    },
    {
      "pk": 1932607,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 8,
      "text": "When the king heard this news, he was shocked and very troubled. He took to his bed, sick with grief, because his plans had failed.",
      "links": "",
      "comment": "Here, the king’s emotional and physical collapse illustrates that opposition to God’s people will ultimately fail."
    },
    {
      "pk": 1932608,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 9,
      "text": "He remained there for many days, his grief growing deeper; then he realized he was going to die.",
      "links": "",
      "comment": "The deathbed scene underscores the theme of divine justice and the fleeting nature of worldly power (compare Luke 12:20)."
    },
    {
      "pk": 1932609,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 10,
      "text": "So he summoned all his friends and said to them, 'Sleep has left my eyes and despair weighs upon my heart.'",
      "links": "",
      "comment": "Antiochus’s confession anticipates the futility of resisting God’s will."
    },
    {
      "pk": 1932610,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 11,
      "text": "'I said to myself: \"To what trouble have I come! Into what a great wave of distress I am now plunged, even though I was beloved and powerful in my reign!\"'",
      "links": "",
      "comment": "The king’s regrets reveal the emptiness of earthly power apart from God’s favor."
    },
    {
      "pk": 1932611,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 12,
      "text": "'Now, I remember the evil I did in Jerusalem, taking away all the golden vessels and sending men to destroy the inhabitants of Judah for no reason.'",
      "links": "<a href='/AIV/13/1/21-24'>1 Macc. 1:21-24</a>",
      "comment": "Antiochus makes a fuller confession of his sin, reminiscent of the repentance God desires (see Daniel 4:34-37)."
    },
    {
      "pk": 1932612,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 13,
      "text": "'I know that is why these troubles have found me, and now I am dying in deep grief in a foreign land.'",
      "links": "",
      "comment": "Antiochus’ misery is a fulfillment of divine retribution for sacrilege (compare Galatians 6:7: ‘whatever a man sows, that he will also reap’)."
    },
    {
      "pk": 1932613,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 14,
      "text": "Then he called for Philip, one of his trusted friends, and appointed him ruler over his entire kingdom.",
      "links": "",
      "comment": "Philip’s elevation hints at the coming instability in the kingdom after Antiochus’s death."
    },
    {
      "pk": 1932614,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 15,
      "text": "He handed over his crown, his robe, and his signet ring, instructing Philip to bring up his son Antiochus and prepare him to be king.",
      "links": "",
      "comment": "A classic dynastic succession—a pattern seen throughout biblical and ancient history."
    },
    {
      "pk": 1932615,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 16,
      "text": "So King Antiochus died there in the year 149.",
      "links": "<a href='/AIV/13/1/10'>1 Macc. 1:10</a>",
      "comment": "The Seleucid dating (year 149 = 163/2 BCE) situates this event firmly in historical chronology."
    },
    {
      "pk": 1932616,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 17,
      "text": "When Lysias heard that the king was dead, he appointed the young Antiochus, whom he brought up from childhood, to be king, naming him Eupator.",
      "links": "",
      "comment": "With the new young king, the kingdom heads for further turmoil—there is no long-lasting peace opposed to God’s order."
    },
    {
      "pk": 1932617,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 18,
      "text": "Meanwhile, the garrison in the citadel were harassing Israel, continually attacking the holy places and trying to strengthen themselves.",
      "links": "<a href='/AIV/13/1/33-36'>1 Macc. 1:33-36</a>",
      "comment": "Persistence of persecution reflects the ongoing battle for God’s people, typologically pointing forward to spiritual warfare (see Ephesians 6:12)."
    },
    {
      "pk": 1932618,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 19,
      "text": "So Judas resolved to destroy them and called the people together to lay siege to the citadel.",
      "links": "<a href='/AIV/13/4/35'>1 Macc. 4:35</a>",
      "comment": "Judas, acting as a faithful deliverer, foreshadows the messianic figure, leading in both physical and spiritual warfare."
    },
    {
      "pk": 1932619,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 20,
      "text": "They gathered together and besieged the citadel in the year 150, building siege platforms and engines.",
      "links": "",
      "comment": "This verse demonstrates Israel’s resourcefulness and determination to reclaim holy ground."
    },
    {
      "pk": 1932620,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 21,
      "text": "But some of the besieged managed to escape, and a few traitorous Israelites joined them.",
      "links": "<a href='/AIV/13/1/11-15'>1 Macc. 1:11-15</a>",
      "comment": "The recurring motif of betrayal—often a spiritual lesson regarding the dangers of disunity among God’s people (John 13:21-27)."
    },
    {
      "pk": 1932621,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 22,
      "text": "They went to the king and said, 'How long will you delay executing justice and avenge our brothers?'",
      "links": "",
      "comment": "These words highlight a distorted demand for human justice, contrasting with God’s righteousness (Romans 12:19)."
    },
    {
      "pk": 1932622,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 23,
      "text": "'We served your fathers, obeyed their commands, and benefited from their victories.'",
      "links": "",
      "comment": "Their rationale for allegiance is self-serving, without reference to higher principles."
    },
    {
      "pk": 1932623,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 24,
      "text": "'But now our brothers have been robbed of our inheritance and driven out by Judas.'",
      "links": "",
      "comment": "Accusations of loss and injustice recall the long historical tensions over land and God’s promises (Genesis 13:14-17)."
    },
    {
      "pk": 1932624,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 25,
      "text": "'Send a man you trust and let him see the devastation done to us and to the king’s territory. Let him punish Judas and his followers for all they have done.'",
      "links": "",
      "comment": "The plea for intervention reflects the pattern of appealing to secular authority when religious fidelity falters."
    },
    {
      "pk": 1932625,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 26,
      "text": "When the king heard this, he became furious and summoned all his friends, the generals, and the commanders of his army.",
      "links": "",
      "comment": "Rulers are often moved more by wrath or politics than by truth or justice."
    },
    {
      "pk": 1932626,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 27,
      "text": "Mercenaries from other kingdoms and islands of the sea flocked to join his forces.",
      "links": "",
      "comment": "The armies of the Gentiles array themselves against the chosen people, a pattern repeated throughout salvation history."
    },
    {
      "pk": 1932627,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 28,
      "text": "His army numbered one hundred thousand foot soldiers, twenty thousand cavalry, and thirty-two war elephants.",
      "links": "",
      "comment": "The staggering numbers emphasize the apparent power of worldly empires against the smaller, faithful remnant."
    },
    {
      "pk": 1932628,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 29,
      "text": "They entered Idumea and set up camp at Beth-zur, where they fought for many days and prepared siege engines.",
      "links": "<a href='/AIV/13/4/29'>1 Macc. 4:29</a>",
      "comment": "Beth-zur was a strategic fortress, frequently mentioned in the Maccabean wars."
    },
    {
      "pk": 1932629,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 30,
      "text": "But Judas marched to Jerusalem with about ten thousand men,",
      "links": "<a href='/AIV/13/4/36'>1 Macc. 4:36</a>",
      "comment": "A small army for a great cause—echoes other biblical accounts where God uses the weak to confound the strong (Judges 7:7)."
    },
    {
      "pk": 1932630,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 31,
      "text": "and saw that the enemy had occupied Beth-zur and was besieging it. He fought and prayed for deliverance.",
      "links": "",
      "comment": "Prayer and action are united; perseverance in crisis is a recurring theme for biblical leaders."
    },
    {
      "pk": 1932631,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 32,
      "text": "The king divided his army, sending some against Beth-zur and keeping some with himself. They set up camp near Beth-zur with their main force.",
      "links": "",
      "comment": "Typical of ancient military strategy—demonstrates tactical planning against God’s people."
    },
    {
      "pk": 1932632,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 33,
      "text": "Then the king rose early and led his army quickly along the road to Beth-zacharias, where his forces met the men of Judah in battle.",
      "links": "<a href='/AIV/13/6/32'>1 Macc. 6:32</a>",
      "comment": "Beth-zacharias becomes a focal point of the conflict."
    },
    {
      "pk": 1932633,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 34,
      "text": "He gave the elephants grape juice and mulberry wine to prepare them for battle.",
      "links": "",
      "comment": "Elephants were used as terrifying war machines in Hellenistic armies."
    },
    {
      "pk": 1932634,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 35,
      "text": "Each elephant carried a strong wooden tower, secured on its back with straps. Inside stood four warriors, along with its Indian driver.",
      "links": "",
      "comment": "The war elephants’ description demonstrates the technological advantage of the empire, heightening the drama of Israel’s resistance."
    },
    {
      "pk": 1932635,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 36,
      "text": "All the animals were positioned amid the infantry lines, creating terror among the enemy lines.",
      "links": "",
      "comment": "The placement of the elephants maximizes psychological warfare."
    },
    {
      "pk": 1932636,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 37,
      "text": "The king’s army was arrayed in two divisions, each with their cavalry and slingers. They made a terrible sound, as they marched and advanced together.",
      "links": "",
      "comment": "A vivid description of ordered, formidable pagan power."
    },
    {
      "pk": 1932637,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 38,
      "text": "Judas and his army faced the king’s forces. With a mighty shout and prayer to God, they began the battle.",
      "links": "",
      "comment": "The invocation of prayer before battle became a lasting religious tradition."
    },
    {
      "pk": 1932638,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 39,
      "text": "As the fighting grew fierce, a huge elephant charged at Judas’s men. Seeing its royal armor, they retreated from the sight.",
      "links": "",
      "comment": "The intimidation was deliberate—fear as a weapon."
    },
    {
      "pk": 1932639,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 40,
      "text": "But one of the warriors, Eleazar, called Avaran, saw the animal was equipped with the king’s armor and believed the king was atop it.",
      "links": "",
      "comment": "Eleazar chooses to take decisive, sacrificial action for his people."
    },
    {
      "pk": 1932640,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 41,
      "text": "He ran boldly into the midst of the formation, slaughtering men to the right and left so that the lines parted before him.",
      "links": "",
      "comment": "The description of Eleazar evokes other biblical heroes making solitary stands (e.g., David and Goliath, 1 Samuel 17)."
    },
    {
      "pk": 1932641,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 42,
      "text": "He crept under the elephant and, thrusting his sword into its belly, killed it. The animal fell on him, and he died there.",
      "links": "",
      "comment": "Eleazar’s heroic self-sacrifice points to the ultimate example of laying down one’s life for others (John 15:13)."
    },
    {
      "pk": 1932642,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 43,
      "text": "When the Israelites saw the king’s forces advancing against them, they fell back.",
      "links": "",
      "comment": "Despite Eleazar’s sacrifice, the battle’s tide does not immediately turn. Spiritual battles rarely have instant victory."
    },
    {
      "pk": 1932643,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 44,
      "text": "The king’s army then went up to Jerusalem to attack them, and the king set up camp in Judea and at Mount Zion.",
      "links": "",
      "comment": "Mount Zion is a symbol of God’s dwelling and the site of the Temple (see Psalm 48:1-2)."
    },
    {
      "pk": 1932644,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 45,
      "text": "He made peace with the people of Beth-zur, who surrendered after a long siege. He stationed troops there to guard the city.",
      "links": "",
      "comment": "Even in defeat, God preserves a remnant."
    },
    {
      "pk": 1932645,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 46,
      "text": "He laid siege to the Temple mount for many days, setting up catapults and siege engines to attack the sanctuary.",
      "links": "",
      "comment": "The attack on the holy place recalls earlier profanations and the importance of the sanctuary."
    },
    {
      "pk": 1932646,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 47,
      "text": "Some of the besieged broke through the lines and, with a few courageous men, burned the siege engines.",
      "links": "",
      "comment": "Acts of bravery contribute to the survival of the holy place."
    },
    {
      "pk": 1932647,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 48,
      "text": "They continued fighting many days.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932648,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 49,
      "text": "Food supplies in the city ran out, and many starved, forcing some to defect to the enemy, while a few remained steadfast.",
      "links": "",
      "comment": "Severe famine tests the faithfulness of the people—comparable to other biblical sieges (2 Kings 6:25-29)."
    },
    {
      "pk": 1932649,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 50,
      "text": "Then the king and his army advanced on Beth-zur a second time, besieging it and negotiating a surrender by covenant. The inhabitants left, and he occupied the city, stationing a garrison there.",
      "links": "",
      "comment": "The making of covenants, even by secular rulers, anticipates the importance of binding agreements mediated through trusted authorities."
    },
    {
      "pk": 1932650,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 51,
      "text": "He turned against the sanctuary again, encamping on Mount Zion.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932651,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 52,
      "text": "He made peace with those in Beth-zur, but continued to attack the sanctuary, building siege engines and towers.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932652,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 53,
      "text": "The defenders lacked food, as it was the seventh year and they had let the fields lie fallow, following the sabbatical law. Many had also taken refuge in Judea from among the Gentiles, using up the remaining supplies.",
      "links": "<a href='/AIV/03/25/4-5'>Lev. 25:4-5</a>",
      "comment": "Following the sabbatical year law showed Israel’s faithfulness; but it brought material hardship, a pattern seen with obedience sometimes leading to temporal trial before final vindication."
    },
    {
      "pk": 1932653,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 54,
      "text": "The temple defenders were in dire straits, and very few remained.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932654,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 55,
      "text": "Then Lysias heard that Philip, whom King Antiochus had trusted to educate his son to rule, had returned from Persia and Media with the intention of seizing the kingdom.",
      "links": "<a href='/AIV/13/6/14'>1 Macc. 6:14</a>",
      "comment": "Rivalries over royal succession often cause worldly powers to turn their attention away from attacking the people of God."
    },
    {
      "pk": 1932655,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 56,
      "text": "Uncertain what to do in this crisis, Lysias called the king and the leaders and urged them, 'Let’s make peace with these people and their city.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932656,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 57,
      "text": "'Let’s agree to let them live according to their own laws, as they did before, for their observance of our laws has brought them suffering.'",
      "links": "<a href='/AIV/13/1/41-49'>1 Macc. 1:41-49</a>",
      "comment": "This negotiation to restore worship foreshadows the enduring right of God’s people to religious liberty, prefiguring the true and full worship that was to come."
    },
    {
      "pk": 1932657,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 58,
      "text": "The king and his officials agreed to these terms, sending peace proposals to the Jews. They accepted the offer,",
      "links": "",
      "comment": "A temporary peace is established, highlighting the role of agreement and negotiation in God’s providence."
    },
    {
      "pk": 1932658,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 59,
      "text": "and swore an oath to live peacefully. But the king then entered Mount Zion,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932659,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 60,
      "text": "and saw the strength of the city’s fortifications. He kept his oath and departed.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932660,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 61,
      "text": "But he broke his word concerning those in the citadel, putting many of them to death and removing their stronghold.",
      "links": "",
      "comment": "Once again, the faithfulness of men is contrasted with the faithfulness of God, who alone keeps covenant perfectly."
    },
    {
      "pk": 1932661,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 62,
      "text": "Then Lysias appointed governors in the region, from among those who remained, and returned to the king.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1932662,
      "translation": "AIV",
      "book": 13,
      "chapter": 6,
      "verse": 63,
      "text": "The king and Lysias returned to Antioch. Thus, the king attacked and subdued Judea, but for a time there was peace.",
      "links": "",
      "comment": "The external peace is always fragile when it is not under the rule of God’s true kingdom. Human rulers come and go, but the promise is that God’s rule—expressed most fully in the kingdom of His Anointed—will one day bring unending peace (Isaiah 9:6-7; Luke 1:32-33)."
    }
  ],
  "translatedAt": "2025-12-23T09:24:19.880Z"
}