{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 10,
  "verses": [
    {
      "pk": 4103101,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 1,
      "text": "In the one hundred and sixtieth year, Alexander, son of Antiochus Epiphanes, went up and seized Ptolemais, and the people welcomed him, and he became king there.",
      "links": "<a href='/AIV/44/1/10'>1 Maccabees 1:10</a>",
      "comment": "Alexander Balas is introduced as a new contender for the Seleucid throne, a political event with huge significance for Judea's fate."
    },
    {
      "pk": 4103102,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 2,
      "text": "But when King Demetrius heard of it, he assembled a very large army and marched out to meet him in battle.",
      "links": "",
      "comment": "Demetrius, fearing for his rule, prepares for conflict."
    },
    {
      "pk": 4103103,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 3,
      "text": "Demetrius also sent a letter to Jonathan with words of peace and high honor, for he said, 'Let us act first to make peace with him, before Alexander does.'",
      "links": "<a href='/AIV/44/9/73'>1 Maccabees 9:73</a>",
      "comment": "Jonathans' reputation had grown, making him a key ally both rival kings wanted."
    },
    {
      "pk": 4103104,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 4,
      "text": "For he remembered all the wrongs Jonathan and his brothers had suffered, and he was amazed at how they had endured his father's persecutions.",
      "links": "<a href='/AIV/44/1/24-33'>1 Maccabees 1:24–33</a>",
      "comment": "Demetrius appeals to old injustices, showing Jonathan's endurance—a foreshadow of suffering for faith."
    },
    {
      "pk": 4103105,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 5,
      "text": "So Demetrius sent to Jonathan, saying, 'You will confirm our alliance, and you will be counted among the king's Friends, and you shall have authority over the four districts, and receive gifts.'",
      "links": "",
      "comment": "'Friends of the king' was a real Seleucid office, signifying trust and political favor."
    },
    {
      "pk": 4103106,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 6,
      "text": "He also instructed his servants to give Jonathan arms, money, and authority to raise forces, so as to strengthen his position.",
      "links": "",
      "comment": "Jonathan receives recognition and resources, highlighting gradual restoration and protection of the holy people."
    },
    {
      "pk": 4103107,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 7,
      "text": "So Jonathan came to Jerusalem and read the letter to all the people, and to the priests, and to those in the fortress.",
      "links": "",
      "comment": "Important communication is made publicly, affirming Jonathan’s legitimate leadership."
    },
    {
      "pk": 4103108,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 8,
      "text": "And the men in the fortress were greatly alarmed when they heard the king had given Jonathan the authority to raise an army.",
      "links": "",
      "comment": "The fortress (Akra) was held by the enemy and hostile to Jonathan’s reforms."
    },
    {
      "pk": 4103109,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 9,
      "text": "But the men turned over to Jonathan the weapons and prisoners they had seized, and he used them to renew his strength.",
      "links": "",
      "comment": "Jonathan regathers strength, reminiscent of God’s mercy restoring His faithful people."
    },
    {
      "pk": 4103110,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 10,
      "text": "Jonathan settled in Jerusalem and began rebuilding and restoring the city.",
      "links": "<a href='/AIV/16/2/17'>Nehemiah 2:17</a>",
      "comment": "Echoes the rebuilding of Jerusalem, a theme fulfilled at several points in salvation history."
    },
    {
      "pk": 4103111,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 11,
      "text": "He told the workers to rebuild the walls and surround Mount Zion with squared stones as a strong fortification. And they did just as he commanded.",
      "links": "<a href='/AIV/44/4/60'>1 Maccabees 4:60</a>",
      "comment": "Restoration of proper worship and of the defensive walls, making Jerusalem secure for God’s people."
    },
    {
      "pk": 4103112,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 12,
      "text": "Some of the foreign forces in fortresses left their positions; only a few remained in Beth-zur, but the wicked deserted their posts, for they had no more food because peace had been established.",
      "links": "<a href='/AIV/44/4/61'>1 Maccabees 4:61</a>",
      "comment": "As foes flee, the restored city is a type of God's ultimate kingdom—purified and secure."
    },
    {
      "pk": 4103113,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 13,
      "text": "But King Alexander sent a message to Jonathan, saying, 'Come to me, and let us make a treaty. For you are to be my friend.'",
      "links": "",
      "comment": "Both rival kings court Jonathan as his influence only grows."
    },
    {
      "pk": 4103114,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 14,
      "text": "So Jonathan went to meet King Alexander at Ptolemais. He was received with honor, and Alexander's officials presented to him silver, gold, and many gifts.",
      "links": "",
      "comment": "Jonathan’s reception marks recognition among the nations of Israel’s unique leadership."
    },
    {
      "pk": 4103115,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 15,
      "text": "Alexander confirmed him in his high priesthood, and ordered his name to be recorded among the King's Friends.",
      "links": "<a href='/AIV/44/9/27'>1 Maccabees 9:27</a>",
      "comment": "Jonathan is here confirmed as high priest—this act connects spiritual leadership and state. The unity of religious and civil authority foreshadows the role of priest and king fulfilled in Christ."
    },
    {
      "pk": 4103116,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 16,
      "text": "And Alexander sent to Jonathan golden vessels and gave him the right to drink from gold cups and to wear purple and a golden brooch.",
      "links": "",
      "comment": "Royal insignia signal special honor; purple was reserved for nobility or kings."
    },
    {
      "pk": 4103117,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 17,
      "text": "So he appointed Jonathan as chief and governor over all his territory, and he returned to Jerusalem in peace and glory.",
      "links": "",
      "comment": "Jonathan combines dual offices—military and spiritual—anticipating the Messianic king-priest."
    },
    {
      "pk": 4103118,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 18,
      "text": "But after these things, some troublemakers and lawless men in Israel rallied together against Jonathan, indignant that he was made high priest.",
      "links": "",
      "comment": "Jealousy and schism appear even among God’s people—foreshadowing later divisions and the need for legitimate authority."
    },
    {
      "pk": 4103119,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 19,
      "text": "So they went to King Demetrius and said, 'Jonathan and his brothers are refusing your commands and have become your enemies.'",
      "links": "",
      "comment": "False accusations against the righteous, a familiar pattern in biblical history. See Joseph in Genesis 37 or Daniel in Daniel 6."
    },
    {
      "pk": 4103120,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 20,
      "text": "But Demetrius, hearing of this, became even more hostile and wrote a harsh letter to Jonathan.",
      "links": "",
      "comment": "Jonathan faces opposition not only from outside Israel, but from within as well."
    },
    {
      "pk": 4103121,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 21,
      "text": "But Jonathan did not answer Demetrius at that time, for he was confident in his alliances.",
      "links": "",
      "comment": "His silence reflects wisdom in the face of provocation and trust in God’s providence."
    },
    {
      "pk": 4103122,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 22,
      "text": "When Demetrius saw his rule slipping away, he gathered an army and encamped in the land of Judea.",
      "links": "",
      "comment": "The threat to Judea increases as the Seleucid struggle intensifies over control of Israel."
    },
    {
      "pk": 4103123,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 23,
      "text": "He sent a message to Jonathan, saying: 'You are the only cause of trouble in my kingdom, and you must surrender the fortresses you have taken.'",
      "links": "",
      "comment": "Demetrius attempts intimidation, but Jonathan, as a just leader, stands firm."
    },
    {
      "pk": 4103124,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 24,
      "text": "But Jonathan paid him no attention, for he had support from his allies.",
      "links": "",
      "comment": "Persistence in faith and unity with allies ensure Jonathan’s success."
    },
    {
      "pk": 4103125,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 25,
      "text": "Then Trypho, who had formerly served under Alexander, turned against him and led many men away, taking Gaza and serving as a rival.",
      "links": "<a href='/AIV/44/11/39-40'>1 Maccabees 11:39-40</a>",
      "comment": "Trypho’s betrayal introduces even more instability in the foreign kingdom’s rule."
    },
    {
      "pk": 4103126,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 26,
      "text": "So Jonathan held all his troops ready for battle and encamped near Joppa. The people of Joppa opened the gates for him, because they feared him, and Jonathan occupied Joppa.",
      "links": "<a href='/AIV/44/12/33'>1 Maccabees 12:33</a>",
      "comment": "Jonathan consolidates his position, reflecting providential favor."
    },
    {
      "pk": 4103127,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 27,
      "text": "When King Alexander heard of these things, he gave Jonathan even greater honors.",
      "links": "",
      "comment": "Earthly kings recognize God’s blessing upon the faithful."
    },
    {
      "pk": 4103128,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 28,
      "text": "He sent him a golden brooch, such as was customarily given only to the king’s closest kinsmen.",
      "links": "",
      "comment": "Special badges signified adoption into the inner circle—a mark of unique favor."
    },
    {
      "pk": 4103129,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 29,
      "text": "And he gave him Ekron and all its surrounding territory as a hereditary possession.",
      "links": "",
      "comment": "Jonathan receives territory as an inheritance—a parallel to the priest-king role and promise to God’s people (see Joshua’s allocation of land)."
    },
    {
      "pk": 4103130,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 30,
      "text": "Then King Alexander wrote to Jonathan, writing as follows:",
      "links": "",
      "comment": "The official decree grants privileges to Jonathan and Israel—underscoring the partnership of throne and altar."
    },
    {
      "pk": 4103131,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 31,
      "text": "'King Alexander, to his brother Jonathan, greetings.'",
      "links": "",
      "comment": "Calling Jonathan 'brother' signals deep alliance between Gentile and Israelite rulers."
    },
    {
      "pk": 4103132,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 32,
      "text": "'We have written to you concerning all the tax remissions made for you and your nation.'",
      "links": "",
      "comment": "A practical gift: the lifting of taxes, for the benefit of the holy nation."
    },
    {
      "pk": 4103133,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 33,
      "text": "'I release you from all tribute and salt tax, and from the crowns, and that which is due to me. All that I release to you from this very day and for all time.'",
      "links": "",
      "comment": "Economic freedom mirrors, in a small way, the gospel principle of true liberty under God."
    },
    {
      "pk": 4103134,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 34,
      "text": "'And all the remissions granted previously remain in force for you and for Jerusalem.'",
      "links": "",
      "comment": "Gracious favor remains in effect—a sign of stable governance."
    },
    {
      "pk": 4103135,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 35,
      "text": "'Let everyone be permitted to make remissions for the Temple, as we have declared.'",
      "links": "",
      "comment": "Temple maintenance, always vital, is given privileged status; this secures proper worship."
    },
    {
      "pk": 4103136,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 36,
      "text": "'Let the holy city be free and all the weapons and fortresses you have built, and keep these as your inheritance.'",
      "links": "",
      "comment": "'Holy city' designates Jerusalem; its freedom protects its sanctity and the centrality of liturgical worship."
    },
    {
      "pk": 4103137,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 37,
      "text": "'No one in the entire kingdom is allowed to enter or meddle with these privileges.'",
      "links": "",
      "comment": "External interference forbidden, ensuring sacred autonomy for Jonathan’s governance."
    },
    {
      "pk": 4103138,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 38,
      "text": "'As for any Jews taken captive among my subjects, I set them free with no payment. All their goods are to be returned, according to the law.'",
      "links": "",
      "comment": "Freedom to captives—anticipates Christ’s liberation of spiritual captives (<a href='/AIV/42/4/18'>Luke 4:18</a>)."
    },
    {
      "pk": 4103139,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 39,
      "text": "'No one in Jerusalem is to be taxed, nor any in the holy city. These gifts are for you and your people, for building and rebuilding the sanctuary.'",
      "links": "",
      "comment": "Again, special protection for the holy city and Temple—ensuring the heart of worship thrives."
    },
    {
      "pk": 4103140,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 40,
      "text": "'Let all the weapons constructed and fortresses built remain in your hands.'",
      "links": "",
      "comment": "Practical security measures granted for the sacred cause."
    },
    {
      "pk": 4103141,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 41,
      "text": "'If any kind of tribute is owed to me or the king, it is to be given entirely to you, for the support of the Temple.'",
      "links": "",
      "comment": "Temple support funded by royal taxes, showing harmony between true faith and civil authority."
    },
    {
      "pk": 4103142,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 42,
      "text": "'From now and forever, no one shall abrogate these privileges.'",
      "links": "",
      "comment": "Stressing perpetuity—echoes God’s covenants to Israel."
    },
    {
      "pk": 4103143,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 43,
      "text": "'Record this document in the official archives, so that Jonathan and his descendants may have enduring rights.'",
      "links": "",
      "comment": "Official documentation makes privileges permanent and hereditary—a key aspect of legitimate authority."
    },
    {
      "pk": 4103144,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 44,
      "text": "King Alexander wrote these letters to Jonathan, sending them to Jerusalem as testimony before the people.",
      "links": "",
      "comment": "The public nature of the decree is meant to show the entire nation God’s providential favor."
    },
    {
      "pk": 4103145,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 45,
      "text": "When Demetrius saw that the king had established Jonathan, he was grieved and tried again to reach out to Jonathan.",
      "links": "",
      "comment": "Demetrius, threatened, makes yet another political maneuver—a sign of insecure, divided power apart from God’s will."
    },
    {
      "pk": 4103146,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 46,
      "text": "He sent him a letter, saying, 'Come, let us make a treaty, and I will give you great honors.'",
      "links": "",
      "comment": "Desperate, Demetrius tries to win Jonathan’s loyalty with worldly promises."
    },
    {
      "pk": 4103147,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 47,
      "text": "'I will give you authority over the many taxes and gifts, so that you and your nation will benefit.'",
      "links": "",
      "comment": "Again, material reward is offered, but Jonathan must discern whether such alliances serve the true faith."
    },
    {
      "pk": 4103148,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 48,
      "text": "But Jonathan turned from him and did not answer his words, for he remembered the wrongs Demetrius had done to Israel.",
      "links": "",
      "comment": "Jonathan acts with wisdom, not seduced by power or revenge, but firm in true allegiance."
    },
    {
      "pk": 4103149,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 49,
      "text": "Then Demetrius became angry at Jonathan and sent a delegation with an unjust demand, saying, 'Hand over the fortresses, for you rule by my permission.'",
      "links": "",
      "comment": "Unjust accusations reflect Demetrius’ lack of moral legitimacy."
    },
    {
      "pk": 4103150,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 50,
      "text": "But Jonathan replied to him with strong words and did not surrender.",
      "links": "",
      "comment": "Jonathan’s steadfastness signals the need for perseverance in the faith, even when pressured by secular authority."
    },
    {
      "pk": 4103151,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 51,
      "text": "And he sent men to Alexander to confirm their alliance and to declare himself his friend.",
      "links": "",
      "comment": "Jonathan invests his loyalty with the one who has shown him and God’s people favor."
    },
    {
      "pk": 4103152,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 52,
      "text": "So Alexander heard this and received Jonathan with high honors.",
      "links": "",
      "comment": "Jonathan, anointed high priest, is honored among the nations."
    },
    {
      "pk": 4103153,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 53,
      "text": "Many other kings gathered around him, desiring to build alliances with him.",
      "links": "",
      "comment": "Nations see God’s blessing and seek connection with his representative—a light to the nations."
    },
    {
      "pk": 4103154,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 54,
      "text": "King Alexander gave his daughter Cleopatra to Jonathan in marriage at Ptolemais, with much glory, as became royal custom.",
      "links": "<a href='/AIV/44/11/9'>1 Maccabees 11:9</a>",
      "comment": "A diplomatic marriage, cementing the alliance with Israel."
    },
    {
      "pk": 4103155,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 55,
      "text": "But the kings gathered for the wedding with much festivity, for it was celebrated with pomp, just as is done for kings and for large nations.",
      "links": "",
      "comment": "The marriage feast recalls similar covenants in Scripture, each teaching the ultimate unity God desires for His people and the nations."
    },
    {
      "pk": 4103156,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 56,
      "text": "Jonathan and King Alexander sat together on the royal dais in their glory, and the princes made offerings and gifts to them.",
      "links": "",
      "comment": "Jonathan is depicted as a true partner in rule, a prefigurement of the royal priesthood."
    },
    {
      "pk": 4103157,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 57,
      "text": "There was great rejoicing in Jerusalem and among the nations, for this marriage meant peace.",
      "links": "",
      "comment": "The peace established through covenant reflects deeper spiritual realities pointing forward to true messianic peace."
    },
    {
      "pk": 4103158,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 58,
      "text": "Then the kings joined together to combat Demetrius, who had set himself against all their alliances.",
      "links": "",
      "comment": "Jonathan’s alliances serve not only Israel’s security but also the wider region’s peace."
    },
    {
      "pk": 4103159,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 59,
      "text": "Alexander and his allies marched out against Demetrius, who faced them with a strong army.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103160,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 60,
      "text": "But Alexander pressed the attack, and Demetrius broke and fled, and his army was routed.",
      "links": "",
      "comment": "Victory is seen as coming to the one who shows true favor to God’s people."
    },
    {
      "pk": 4103161,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 61,
      "text": "Then Alexander sent ambassadors to Jonathan, saying:",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103162,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 62,
      "text": "'Come to me at Ptolemais, so that we may reaffirm our partnership.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103163,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 63,
      "text": "So Jonathan went to Ptolemais with glory, and with plentiful gifts, and was received with honor.",
      "links": "",
      "comment": "Public honor for Jonathan signals the esteem in which Israel is held before the nations—see Deuteronomy 4:6–8."
    },
    {
      "pk": 4103164,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 64,
      "text": "There he joined with Alexander, and they made an agreement of peace, and celebrated together.",
      "links": "",
      "comment": "Their peace is secured by covenant—a hint at the later peace to be brought by Christ, which will reconcile both Jew and Gentile."
    },
    {
      "pk": 4103165,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 65,
      "text": "Then Jonathan’s enemies, the lawless and traitorous men, saw that he had favor from the king and fled.",
      "links": "",
      "comment": "The faithful are ultimately protected, while the faithless are driven away."
    },
    {
      "pk": 4103166,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 66,
      "text": "Alexander ordered that Jonathan’s royal honors be proclaimed throughout all his kingdom, and that all officials show him respect.",
      "links": "",
      "comment": "This honor highlights the proper ordering of both spiritual and civil authority."
    },
    {
      "pk": 4103167,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 67,
      "text": "He also wrote to every city, demanding they receive Jonathan and support him in all he did.",
      "links": "",
      "comment": "Jonathan’s authority is cemented by the law of the land—a sign of divinely appointed order."
    },
    {
      "pk": 4103168,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 68,
      "text": "Then the people gathered to Jonathan in great numbers, for they saw the king’s favor on him.",
      "links": "",
      "comment": "The multitude’s support is not just political—it results from their recognition of God’s blessing."
    },
    {
      "pk": 4103169,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 69,
      "text": "Some lawless men, who had deserted the Law and the Covenant, fled from Israel and gathered together in the coastlands.",
      "links": "",
      "comment": "Those who abandoned the faith and unity of the people are separated—this separation highlights the call for faithful perseverance and unity."
    },
    {
      "pk": 4103170,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 70,
      "text": "Trypho, the supporter of Alexander, also gathered a force in Gaza and rebelled against the king.",
      "links": "",
      "comment": "Sin and rebellion persist in human affairs—showing the need for vigilant leadership."
    },
    {
      "pk": 4103171,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 71,
      "text": "Meanwhile, Jonathan gathered his army and encamped against Gaza.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103172,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 72,
      "text": "Trypho came out of the city with a large army, but Jonathan met him in battle.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103173,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 73,
      "text": "Trypho was defeated, and retreated into the city, and Jonathan surrounded Gaza with his forces, besieging it.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103174,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 74,
      "text": "He set up siege engines and attacked the city day and night, until it was taken.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103175,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 75,
      "text": "The people of Gaza begged Jonathan for peace, and he made peace with them, took the sons of their leaders as hostages, and sent them to Jerusalem. Then he passed through the city unharmed.",
      "links": "",
      "comment": "Jonathan acts as both conqueror and merciful leader, ensuring future obedience."
    },
    {
      "pk": 4103176,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 76,
      "text": "But when Jonathan returned to Jerusalem, he was received with great honor and rejoicing.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103177,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 77,
      "text": "In the one hundred and sixty-fifth year, Demetrius, son of Demetrius, came from Crete to the land of his fathers.",
      "links": "",
      "comment": "A new rival emerges, demonstrating the ongoing chaos in the Gentile world."
    },
    {
      "pk": 4103178,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 78,
      "text": "When King Alexander heard of it, he was grieved and returned to Antioch.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103179,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 79,
      "text": "Then Demetrius appointed Apollonius as governor of southern Coele-Syria. Apollonius gathered a large army and went to Jamnia, to make war against Jonathan.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103180,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 80,
      "text": "He sent messengers to Jonathan, saying, 'You stand alone in opposition, and because of me you mock us. You boast in your power over us on the hills. But if you have confidence in your army, come down to the plain and let us fight face to face. Many from your side have fallen before us.'",
      "links": "",
      "comment": "Apollonius tries to goad Jonathan to open battle, revealing the adversary’s arrogance and self-reliance."
    },
    {
      "pk": 4103181,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 81,
      "text": "'Now I promise that if you come down to the plain, I will do you no harm, but let us fight and see who is stronger.'",
      "links": "",
      "comment": "A mocking challenge, but Jonathan’s trust is in God, not in mere strategy."
    },
    {
      "pk": 4103182,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 82,
      "text": "When Jonathan heard this message, he assembled his army and went out to the plain of Ashdod.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103183,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 83,
      "text": "And the armies of Apollonius appeared before Jonathan in ambush, lying in wait among the mountains.",
      "links": "",
      "comment": "Jonathan is careful of the enemy’s tactics, a reminder of vigilance in spiritual warfare."
    },
    {
      "pk": 4103184,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 84,
      "text": "But Jonathan met them, and his army stood strong, sending forth a rain of arrows and stones.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103185,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 85,
      "text": "The enemy was routed, and Apollonius fled into Ashdod, and Jonathan pursued him, burning the towns along the way.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4103186,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 86,
      "text": "He set fire to the temple of Dagon and all who had taken refuge in it were consumed.",
      "links": "<a href='/AIV/7/16/23'>Judges 16:23</a>; <a href='/AIV/9/5/2'>1 Samuel 5:2</a>",
      "comment": "Dagon's temple—a symbol of idolatry—is destroyed, a type of God overcoming false worship and demonic powers."
    },
    {
      "pk": 4103187,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 87,
      "text": "So those who fell by the sword with those in the fire numbered about eight thousand men.",
      "links": "",
      "comment": "A total rout—God’s victory over His enemies is complete."
    },
    {
      "pk": 4103188,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 88,
      "text": "Then Jonathan took the spoil from the city and returned to Jerusalem with great joy.",
      "links": "",
      "comment": "The righteous are rewarded after faithfulness and battle, foreshadowing the eternal reward for those who persevere."
    },
    {
      "pk": 4103189,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 89,
      "text": "Thus King Alexander increased Jonathan’s honor and wrote to him, saying, 'We make you commander and ruler over all the region, and so you are numbered among the king's Chief Friends.'",
      "links": "",
      "comment": "Jonathan's role as ruler and high priest is confirmed, a unique concentration of spiritual and temporal authority, prefiguring the unity of priesthood and kingship in Christ."
    }
  ],
  "translatedAt": "2025-12-23T09:28:22.582Z"
}