{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 6,
  "verses": [
    {
      "pk": 20006001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 1,
      "text": "King Antiochus was traveling through the upper provinces when he heard that the city of Elymais in Persia was renowned for its riches, silver, and gold.",
      "links": "<a href='/AIV/17/1/2'>Esther 1:2</a>",
      "comment": "Elymais was famous for its wealth. This sets the stage for Antiochus' ambition and foreshadows his downfall, a common biblical theme (see <a href='/AIV/20/16/18'>Prov. 16:18</a>)."
    },
    {
      "pk": 20006002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 2,
      "text": "It was also reported that the temple there was filled with very rich offerings, and that golden shields, armor, and weapons had been left there by Alexander, the son of Philip, who reigned first over the Greeks.",
      "links": "<a href='/AIV/27/8/21'>Dan. 8:21</a>",
      "comment": "Reference to Alexander the Great gives historical context (Dan. 8:21). The temple’s wealth recalls the motif of sacred treasures, seen as signs of favor from God in other Hebrews scriptures."
    },
    {
      "pk": 20006003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 3,
      "text": "So Antiochus came and tried to take the city and plunder it, but he was not able, because his plan became known to those living in the city.",
      "links": "",
      "comment": "Repeated biblical theme: God often frustrates the plans of the proud (Ps. 33:10, <a href='/AIV/19/33/10'>Ps. 33:10</a>)."
    },
    {
      "pk": 20006004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 4,
      "text": "They rose up against him in battle, and he fled and returned in great sorrow to Babylon.",
      "links": "<a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "Babylon, once a seat of power and pride, becomes a place of retreat and defeat for kings—see the fate of Babylon in Isa. 13:19."
    },
    {
      "pk": 20006005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 5,
      "text": "While in Persia, news reached him that the armies sent into the land of Judah had been put to flight:",
      "links": "",
      "comment": "Antiochus' declining fortunes are marked by further bad news, underscoring the divine reversal of arrogant powers (see <a href='/AIV/10/8/14'>2 Sam. 8:14</a> for military reversals)."
    },
    {
      "pk": 20006006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 6,
      "text": "Lysias had gone at the head of a strong army and was forced to flee before the Jews. They had grown stronger by their arms, supplies, and great spoils they took from defeated armies.",
      "links": "<a href='/AIV/7/8/10'>Judg. 8:10</a>",
      "comment": "Victory over a stronger army recalls themes throughout salvation history: faithfulness leads to divine victory (<a href='/AIV/6/6/20'>Joshua 6:20</a>)."
    },
    {
      "pk": 20006007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 7,
      "text": "They had torn down the abomination he had built on the altar in Jerusalem and surrounded the sanctuary with high walls as before, and even Beth-zur, his city.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The 'abomination' refers to the desecration of the temple (Dan. 11:31, Matt. 24:15). The restoration of worship prefigures the cleansing power of Christ, who restores and sanctifies the temple of God's people."
    },
    {
      "pk": 20006008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 8,
      "text": "When the king heard this news, he was deeply shaken, fell sick with grief, and was overwhelmed, because things had not turned out as he had planned.",
      "links": "",
      "comment": "The king's sorrow comes from pride and not recognizing the hand of God in history. Compare Pharaoh's heart in Exodus (<a href='/AIV/2/7/13'>Ex. 7:13</a>)."
    },
    {
      "pk": 20006009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 9,
      "text": "He remained there for many days, growing weaker by the day, until he realized he was dying.",
      "links": "",
      "comment": "Again, the motif of inevitable decline of proud rulers (see <a href='/AIV/19/49/12'>Ps. 49:12</a>)."
    },
    {
      "pk": 20006010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 10,
      "text": "He called for all his friends and said to them, 'Sleep has left my eyes, and my heart is burdened with worry.'",
      "links": "",
      "comment": "Contrast the sleep of the righteous (Ps. 4:8) with the restlessness of the wicked."
    },
    {
      "pk": 20006011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 11,
      "text": "'I said in my heart: To what distress I have come, into what a great storm I am in, now that I am mercifully hated and overwhelmed by sorrow.'",
      "links": "",
      "comment": "The king's confession of his emotional state echoes many lament psalms."
    },
    {
      "pk": 20006012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 12,
      "text": "'I kept nice in my rule, but now I remember the evils I did in Jerusalem. I took all the gold and silver artifacts from its temple and sent men to destroy Judah without reason.'",
      "links": "<a href='/AIV/19/51/3-4'>Ps. 51:3-4</a>",
      "comment": "The king's admission of guilt echoes penitential statements in Psalms (Ps. 51). This moment reveals the possibility of repentance, a central motif throughout salvation history."
    },
    {
      "pk": 20006013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 13,
      "text": "'Because of this, I am suffering these misfortunes, and now I am perishing with deep sorrow in a foreign land.'",
      "links": "<a href='/AIV/23/14/18-20'>Isaiah 14:18-20</a>",
      "comment": "Dying in exile is portrayed in scripture as a sign of judgment—compare fall of Babylonian/Assyrian rulers (Isa 14:18-20)."
    },
    {
      "pk": 20006014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 14,
      "text": "He called for Philip, one of his closest friends, and appointed him over his entire kingdom.",
      "links": "",
      "comment": "Trusting loyal subjects with succession is a major ancient practice—see Solomon and David (<a href='/AIV/11/1/35'>1 Kings 1:35</a>)."
    },
    {
      "pk": 20006015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 15,
      "text": "He gave him his crown, his robe, and his ring, instructing Philip to care for his son Antiochus and to bring him up to be king.",
      "links": "<a href='/AIV/17/3/10'>Esther 3:10</a>; <a href='/AIV/42/15/22'>Luke 15:22</a>",
      "comment": "The giving of crown and ring signals the bestowal of authority (Esther 3:10). The gesture also anticipates symbolic adoption, a precursor to New Testament realities (Luke 15:22)."
    },
    {
      "pk": 20006016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 16,
      "text": "Then King Antiochus died there in the year one hundred and forty-nine.",
      "links": "",
      "comment": "The narrative marks his death by date, signifying a break in history. Biblical tradition often marks the death of a ruler at turning points (see <a href='/AIV/5/34/5'>Deut. 34:5</a> for Moses)."
    },
    {
      "pk": 20006017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 17,
      "text": "When Lysias learned the king had died, he set up the king’s son Antiochus in his place, whom he had brought up as a child, and named him Eupator.",
      "links": "",
      "comment": "The transition of power is a reminder of unstable earthly kingdoms. Compare to biblical succession narratives."
    },
    {
      "pk": 20006018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 18,
      "text": "Now those who were in the citadel at Jerusalem were preventing the Israelites from coming and going in the surrounding area. They sided with the Gentiles so as to inflict as much harm as possible on the Jews.",
      "links": "",
      "comment": "Citadel = the fortress; its occupation recalls enemy strongholds opposing God’s people (see <a href='/AIV/7/6/5'>Judg. 6:5</a>)."
    },
    {
      "pk": 20006019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 19,
      "text": "Judas planned to eliminate them and called the entire people to lay siege to the citadel.",
      "links": "<a href='/AIV/7/20/15'>Judg. 20:15</a>",
      "comment": "The act of gathering for a siege echoes previous Israelite battles—unity against foreign oppressors is key to biblical victory."
    },
    {
      "pk": 20006020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 20,
      "text": "So together they assembled and besieged the citadel in the one hundred and fiftieth year, building siege towers and war machines.",
      "links": "<a href='/AIV/12/25/1'>2 Kings 25:1</a>",
      "comment": "The specific year again marks providential history. Building siege engines shows Israel’s growing military skill, reminiscent of past besieged cities."
    },
    {
      "pk": 20006021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 21,
      "text": "Some of the defenders escaped from the siege and joined with the king, saying, 'How long will you wait before giving judgment and avenging our brothers?'",
      "links": "<a href='/AIV/19/94/1'>Ps. 94:1</a>",
      "comment": "Cry for vengeance is a repeated motif—see pleas for vindication in the Psalms."
    },
    {
      "pk": 20006022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 22,
      "text": "'We held your royal family in honor and followed your commands. We fought fiercely for you.'",
      "links": "",
      "comment": "Demonstrates the complicated loyalties and the consequences of divided allegiances—a theme addressed by Jesus: 'No one can serve two masters' (<a href='/AIV/40/6/24'>Matt. 6:24</a>)."
    },
    {
      "pk": 20006023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 23,
      "text": "'Yet now our fellow citizens have besieged us and are opposed to us. More than any, they have done us harm.'",
      "links": "",
      "comment": "Strife and betrayal among kin are common in biblical narratives, reinforcing the need for unity within God's people."
    },
    {
      "pk": 20006024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 24,
      "text": "'They have looted all we had, and not only us, but those who supported us as well.'",
      "links": "",
      "comment": "Betrayal and plundering within Israel foreshadow later divisions that would be healed in the fullness of God’s unity (<a href='/AIV/43/17/21'>John 17:21</a>)."
    },
    {
      "pk": 20006025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 25,
      "text": "'Now come and give us justice against them.'",
      "links": "",
      "comment": "The desire for justice echoes cries for rescue and deliverance in the Psalms and Prophets."
    },
    {
      "pk": 20006026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 26,
      "text": "The king was angered when he heard this, and he assembled all his friends, the commanders of his army, and those in charge of the cavalry.",
      "links": "",
      "comment": "The king’s resort to his close circle is a mirror to many Old Testament rulers, often shown as acting on council—see <a href='/AIV/11/12/6'>1 Kings 12:6</a>."
    },
    {
      "pk": 20006027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 27,
      "text": "Mercenaries and other allied forces also joined, and they formed a vast army, outnumbering Israel, determined to win back Judea.",
      "links": "",
      "comment": "The outnumbered faithful is a common theme; God’s deliverance is magnified in the weakness of his people (see <a href='/AIV/7/7/2-7'>Judg. 7:2-7</a>)."
    },
    {
      "pk": 20006028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 28,
      "text": "He made his way with all his army to Idumea and besieged Beth-zur for many days, attacking it with siege engines.",
      "links": "",
      "comment": "Beth-zur was a key defensive outpost for Judah. Attacks on fortified cities are a recurring conflict type in biblical narrative."
    },
    {
      "pk": 20006029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 29,
      "text": "But the defenders came out, counterattacked, and burned the siege engines.",
      "links": "",
      "comment": "The resilience of the defenders is reminiscent of miraculous deliverances (see <a href='/AIV/7/15/15'>Judg. 15:15</a>)."
    },
    {
      "pk": 20006030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 30,
      "text": "Then Judas pulled back from the citadel and set up camp at Beth-zechariah, opposite the royal camp.",
      "links": "",
      "comment": "Strategic retreats are not uncommon among biblical leaders (see David in 1 Sam. 23:13)."
    },
    {
      "pk": 20006031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 31,
      "text": "The king rose early in the morning and moved his army hard and fast toward Beth-zechariah. His troops deployed for battle and blew the trumpets.",
      "links": "<a href='/AIV/4/10/9'>Num. 10:9</a>",
      "comment": "Trumpets signaled battle and are frequently used in Israel’s history. See the use of trumpets in driving out the enemy (Num. 10:9, Joshua 6)."
    },
    {
      "pk": 20006032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 32,
      "text": "They showed the elephants the juice of grapes and mulberries, to prepare them for battle.",
      "links": "",
      "comment": "Historical detail: Elephants were war machines in Greek and Asian armies, not mentioned in the Old Testament, highlighting changing eras."
    },
    {
      "pk": 20006033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 33,
      "text": "These beasts were divided among the army, standing by each cohort, with armored soldiers and riders to defend them.",
      "links": "",
      "comment": "Organized military structure is emphasized, the enemy appears formidable."
    },
    {
      "pk": 20006034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 34,
      "text": "They put shields and armor around the elephants, and over each was a special wooden tower, fastened by strong straps, with four mighty men and an Indian driver on each beast.",
      "links": "",
      "comment": "The passage gives a detailed account of ancient warfare, showing the overwhelming force facing the Israelites."
    },
    {
      "pk": 20006035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 35,
      "text": "They made the animals maddened by the sight of grape juice and shields, so that their noise and presence filled the camp with terror.",
      "links": "",
      "comment": "The psychological warfare deployed emphasizes the intensity of the enemy—yet all will be subject to God’s providence."
    },
    {
      "pk": 20006036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 36,
      "text": "The king arranged the rest of his army in two wings, so as to hurl their overwhelming numbers at the enemy, with the cavalry deployed on the two flanks.",
      "links": "",
      "comment": "The enemy’s power reaches its height—biblical battles often turn at such moments, as with Pharaoh at the Red Sea."
    },
    {
      "pk": 20006037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 37,
      "text": "Each elephant had around it a thousand men armed with shields and spears, five hundred horsemen on each flank.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 20006038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 38,
      "text": "These were deployed wherever the beast was, to protect it on every side, never leaving it alone.",
      "links": "",
      "comment": "Vivid description reflects the challenge posed to Israel by the world's armies."
    },
    {
      "pk": 20006039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 39,
      "text": "Thunder rolled through the army when the sun shone on the shields of gold and bronze, making the hills blaze with reflected light, like fiery torches.",
      "links": "<a href='/AIV/2/34/29'>Ex. 34:29</a>",
      "comment": "Light imagery often signals the presence or glory of God, but here is used for the opposite army—implying that only God's true light can bring lasting victory (<a href='/AIV/40/17/2'>Matt. 17:2</a>)."
    },
    {
      "pk": 20006040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 40,
      "text": "A part of the king's army extended to the high hills, and some went low into the valleys, moving in tight formations to intimidate the enemy.",
      "links": "",
      "comment": "The scale and organization of the enemy echo the forces aligned against God's people throughout history."
    },
    {
      "pk": 20006041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 41,
      "text": "Everyone trembled at the noise of their vast army and the clanking of arms; even the ground shook with the sound.",
      "links": "<a href='/AIV/2/19/16'>Ex. 19:16</a>",
      "comment": "Earthquake language recalls God's presence at Sinai (Ex. 19:16). Here, it shows the terror brought by man, but God's presence overshadows all earthly fear."
    },
    {
      "pk": 20006042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 42,
      "text": "Judas and his army drew near and went out to meet the enemy in battle, numbering six hundred men.",
      "links": "",
      "comment": "A meager force versus overwhelming odds—God’s preference for the weak to conquer the strong (see <a href='/AIV/7/7/7'>Judg. 7:7</a>)."
    },
    {
      "pk": 20006043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 43,
      "text": "A man named Eleazar, called Avaran, saw that one of the elephants was larger and had royal armor; he thought the king was on it.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 20006044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 44,
      "text": "He gave his life to save his people and win lasting renown, so he rushed boldly toward the beast, charging into the center of the formation, killing men to the left and to the right.",
      "links": "<a href='/AIV/9/17/50'>1 Sam. 17:50</a>",
      "comment": "Eleazar's sacrifice anticipates stories of self-giving for others (compare David vs. Goliath; ultimately fulfilled in Christ’s own sacrifice). See also <a href='/AIV/43/15/13'>John 15:13</a>."
    },
    {
      "pk": 20006045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 45,
      "text": "He ran beneath the elephant, trusting to God to deliver him, and thrust his sword into its belly, killing it. The beast collapsed and Eleazar died beneath it.",
      "links": "<a href='/AIV/7/16/30'>Judg. 16:30</a>",
      "comment": "Parallels Samson's last act, sacrificing himself for his people (Judg. 16:30). Prophetic foreshadow of ultimate self-offering."
    },
    {
      "pk": 20006046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 46,
      "text": "When the Jews saw the strength of the king and his army, they retreated from them.",
      "links": "",
      "comment": "Despite bravery, sometimes the outcome isn't immediate victory; the narrative gives a realistic picture of faith under trial."
    },
    {
      "pk": 20006047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 47,
      "text": "The king’s army marched up to Jerusalem and pitched camp against Judea and Mount Zion.",
      "links": "<a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "Mount Zion, symbol of God’s dwelling, is again the focal point of attack, echoing the Psalms' assurance of God's chosen place."
    },
    {
      "pk": 20006048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 48,
      "text": "He made peace with those in Beth-zur, who departed from the city, since they had no provisions for a siege—they observed the sabbath and left.",
      "links": "",
      "comment": "The observance of the sabbath affecting battle—a powerful testament to law-keeping even under duress; see Dan. 6 and early Christian martyrdom."
    },
    {
      "pk": 20006049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 49,
      "text": "The king occupied Beth-zur and left a garrison there to hold it.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 20006050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 50,
      "text": "He besieged the sanctuary for many days, erecting siege towers and catapults, fire machines, and stone-throwers on every side.",
      "links": "",
      "comment": "Persistence of assault on the temple prefigures repeated attacks on God’s holy church through history."
    },
    {
      "pk": 20006051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 51,
      "text": "But the defenders held out, knocking down the enemy’s war machines and fighting bravely.",
      "links": "",
      "comment": "Endurance under relentless attack, a constant theme for God’s people."
    },
    {
      "pk": 20006052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 52,
      "text": "However, food supplies in the sanctuary ran short, and they were running out of all essentials, as it was the seventh year and those who had fled to Judea from the Gentiles had devoured the small reserves.",
      "links": "",
      "comment": "The seventh year refers to the sabbatical year (Lev. 25:4), limiting crops and creating hardship—a reminder of living by faith, even in material want."
    },
    {
      "pk": 20006053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 53,
      "text": "Few men remained in the sanctuary, for hunger prevailed; most had scattered in search of food.",
      "links": "",
      "comment": "Similar depictions appear during Jerusalem’s sieges throughout history; spiritual endurance is tested in times of want."
    },
    {
      "pk": 20006054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 54,
      "text": "At that time, Lysias heard that Philip, whom King Antiochus had appointed while still alive to raise his son to rule, had returned from Persia and Media with the intention of assuming control.",
      "links": "",
      "comment": "The intervention of another claimant shows the instability of worldly power structures. This would contrast with the stability of the Kingdom established by Christ (<a href='/AIV/27/2/44'>Dan. 2:44</a>)."
    },
    {
      "pk": 20006055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 55,
      "text": "Lysias hurried to settle matters and proposed a truce with the Jews, offering terms of peace and reasonable concessions.",
      "links": "",
      "comment": "Seeking peace as a pragmatic solution foreshadows later biblical calls for reconciliation (see Rom. 12:18)."
    },
    {
      "pk": 20006056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 56,
      "text": "He agreed with their demands, and upon their promises, pledged on oath to allow them to keep their laws.",
      "links": "",
      "comment": "Oaths have deep significance; see parallels in covenant language and the assurance of promises in Christ (Heb. 6:17-18)."
    },
    {
      "pk": 20006057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 57,
      "text": "The king and Lysias then released the garrison from the citadel, and withdrew their forces.",
      "links": "",
      "comment": "Release of the garrison signals a period of relative peace and restored autonomy for the people of God."
    },
    {
      "pk": 20006058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 58,
      "text": "They returned to the king and redressed in solemn assembly before the Gentile rulers, affirming the peace agreement.",
      "links": "",
      "comment": "Affirmation before Gentiles highlights the public recognition of Israel’s right to their worship—a step forward in salvation history."
    },
    {
      "pk": 20006059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 59,
      "text": "The king and his officials pronounced the Jews granted the rights they had requested, and agreed on good terms with them.",
      "links": "",
      "comment": "The restoration of legal religious practice prefigures the fulfillment in the era of Christ, when the law is written in the hearts (Jer. 31:33)."
    },
    {
      "pk": 20006060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 60,
      "text": "The king and his army then departed, going back to Antioch, and thus ended the fighting in the land of Judah.",
      "links": "",
      "comment": "A reprieve from war echoes sabbath themes and the hope for deliverance."
    },
    {
      "pk": 20006061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 61,
      "text": "King Antiochus kept young Antiochus with him, establishing his rule over the kingdom.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 20006062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 62,
      "text": "Lysias made Philip governor of the province, who then ruled over many regions.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 20006063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 6,
      "verse": 63,
      "text": "Thus Lysias and the king resolved the conflict and established peace, and the Jews lived in their land in relative security for a time.",
      "links": "",
      "comment": "Temporary peace after conflict foreshadows the promise of greater, lasting peace found in the coming of Christ, whose kingdom brings true and eternal security (<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/42/2/14'>Luke 2:14</a>)."
    }
  ],
  "translatedAt": "2025-12-24T05:18:22.440Z"
}