{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 5,
  "verses": [
    {
      "pk": 1953010,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 1,
      "text": "When the nations surrounding them heard that the altar had been rebuilt and the sanctuary dedicated as it was before, they became very angry.",
      "links": "<a href='/AIV/13/17/9'>1 Chr. 17:9</a>; <a href='/AIV/16/4/1'>Neh. 4:1</a>",
      "comment": "The dedication of the sanctuary recalls earlier dedications (see 2 Chr. 7:5). The anger of the nations arises from the restoration of true worship, portending conflict rooted in religious and cultural differences."
    },
    {
      "pk": 1953011,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 2,
      "text": "And they were determined to destroy the descendants of Jacob who lived among them. So they began to kill and persecute the people.",
      "links": "<a href='/AIV/01/27/41'>Gen. 27:41</a>; <a href='/AIV/10/8/1'>2 Sam. 8:1</a>",
      "comment": "The hostility toward the Israelites signifies the longstanding enmity between the people of God and the nations—see the spiritual parallel in John 15:18, where Jesus says, 'If the world hates you, keep in mind that it hated me first.'"
    },
    {
      "pk": 1953012,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 3,
      "text": "Then Judas fought against the sons of Esau in Idumea at Akrabattene, because they besieged Israel, and he struck them with a great blow, took their goods, and remembered the wrongs they had done against his people.",
      "links": "<a href='/AIV/01/36/9'>Gen. 36:9</a>; <a href='/AIV/04/21/1-3'>Num. 21:1-3</a>",
      "comment": "Judas’s response echoes the pattern of divinely sanctioned judgment. The 'sons of Esau' recalls the perpetual conflict between Jacob and Esau—a spiritual parallel to ongoing struggles between the people of God and their adversaries."
    },
    {
      "pk": 1953013,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 4,
      "text": "He also remembered the wickedness of the people of Baean, who were a danger to the people, ambushing them on the roads.",
      "links": "<a href='/AIV/07/5/6'>Judg. 5:6</a>",
      "comment": "Road ambushes represent threats to the community; ancient Israel often had to defend itself on similar circumstances (Judg. 5:6)."
    },
    {
      "pk": 1953014,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 5,
      "text": "He imprisoned them in their towers, besieged them, and completely destroyed them by burning their towers with fire, along with the men inside.",
      "links": "<a href='/AIV/07/1/17'>Judg. 1:17</a>; <a href='/AIV/06/6/24'>Josh. 6:24</a>",
      "comment": "The destruction with fire echoes earlier Old Testament acts of judgment. Such total measures demonstrated the seriousness of the threat to God's people and the lengths needed to protect worship and community."
    },
    {
      "pk": 1953015,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 6,
      "text": "Then he crossed over to the Ammonites and found a strong army and a large number of people, led by Timotheus.",
      "links": "<a href='/AIV/07/11/4-33'>Judg. 11:4-33</a>",
      "comment": "The Ammonites were longstanding enemies, and Timotheus appears as a chief antagonist throughout the Maccabean wars."
    },
    {
      "pk": 1953016,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 7,
      "text": "After many fierce battles with them, they were defeated by him, and he captured Jazer and its villages, then returned to Judea.",
      "links": "<a href='/AIV/06/21/39'>Josh. 21:39</a>; <a href='/AIV/09/10/5'>1 Sam. 10:5</a>",
      "comment": "The victory demonstrates God's favor upon Judas as he delivers the oppressed. Note the cycle of oppression and deliverance found consistently throughout Israel's history (cf. Book of Judges)."
    },
    {
      "pk": 1953017,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 8,
      "text": "But the Gentiles in Gilead gathered together against the Israelites who were in their territory, trying to destroy them. They fled to the stronghold of Dathema.",
      "links": "<a href='/AIV/06/13/25'>Josh. 13:25</a>",
      "comment": "The Israelites living among the Gentiles face frequent persecution, foreshadowing the persecution of the early Church scattered among the nations (cf. Acts 8:1, 4)."
    },
    {
      "pk": 1953018,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 9,
      "text": "They sent letters to Judas and his brothers, saying, 'The Gentiles who surround us have come together to destroy us, and they are preparing to come and seize the stronghold where we have fled. Timotheus is the leader of their army.'",
      "links": "<a href='/AIV/16/6/2'>Neh. 6:2</a>",
      "comment": "Crisis moments often drive the people to seek aid from their leaders, as in the prophetic tradition (see Neh. 6:2)."
    },
    {
      "pk": 1953019,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 10,
      "text": "'Come now and rescue us from their hands, for many of us have already fallen.'",
      "links": "<a href='/AIV/19/79/9'>Ps. 79:9</a>",
      "comment": "This plea for rescue echoes many Psalms, where Israel calls upon God and His agents for deliverance (Ps. 79:9)."
    },
    {
      "pk": 1953020,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 11,
      "text": "'All our brothers who lived in the land of Tob have been killed, the enemy has carried their women and children captive and taken their belongings, and they have destroyed about one thousand men there.'",
      "links": "<a href='/AIV/07/11/3-5'>Judg. 11:3-5</a>",
      "comment": "Reference to the land of Tob recalls the location from which Jephthah was called (Judg. 11:3). The theme of exile and loss recalls the lamentations for Jerusalem (Lamentations 1)."
    },
    {
      "pk": 1953021,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 12,
      "text": "While they were still reading the letter, suddenly other messengers arrived from Galilee, tearing their clothes in distress.",
      "links": "<a href='/AIV/06/7/6'>Josh. 7:6</a>; <a href='/AIV/01/37/29'>Gen. 37:29</a>",
      "comment": "Tearing clothes symbolizes mourning and great distress in Hebrew culture, reflected in multiple Old Testament passages."
    },
    {
      "pk": 1953022,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 13,
      "text": "They reported, 'The people of Ptolemais, Tyre, Sidon, and all Galilee of the Gentiles have united against us, to destroy us.'",
      "links": "<a href='/AIV/06/13/6'>Josh. 13:6</a>; <a href='/AIV/09/5/1'>1 Sam. 5:1</a>",
      "comment": "The northern territories were often troubled by Gentile influence and opposition, reflecting ongoing struggles for fidelity in Israel’s history."
    },
    {
      "pk": 1953023,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 14,
      "text": "When Judas and the people heard these reports, a large assembly gathered to determine what should be done for their fellow brothers who were suffering and besieged.",
      "links": "<a href='/AIV/16/1/4'>Neh. 1:4</a>",
      "comment": "Community discernment in times of crisis is a biblical norm, as seen in Nehemiah's response to reports from Jerusalem (Neh. 1:4)."
    },
    {
      "pk": 1953024,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 15,
      "text": "Judas said to his brother Simon, 'Choose men for yourself, and go rescue our brothers in Galilee. I, with my brother Jonathan, will go to Gilead.'",
      "links": "<a href='/AIV/07/6/14'>Judg. 6:14</a>",
      "comment": "The division of leadership ensures that help can reach both regions under attack, showing the value of apostolic mission and delegation seen in the early Church."
    },
    {
      "pk": 1953025,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 16,
      "text": "He left Joseph son of Zechariah and Azariah as commanders of the people, with orders to guard Judea closely and not to engage the Gentiles until he returned.",
      "links": "<a href='/AIV/04/9/10'>Num. 9:10</a>",
      "comment": "Judas establishes discipline by delegating command but restricting action, emphasizing that some tasks in the faith community require special authority and mission."
    },
    {
      "pk": 1953026,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 17,
      "text": "So three divisions set out: Simon went to Galilee with three thousand soldiers, and Judas to Gilead with eight thousand men.",
      "links": "<a href='/AIV/07/7/16'>Judg. 7:16</a>",
      "comment": "Dividing forces for focused deliverance echoes Gideon's military tactics (Judg. 7:16)."
    },
    {
      "pk": 1953027,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 18,
      "text": "Simon went to Galilee, fought many battles against the Gentiles, defeated them, and drove them out. He pursued them to the gates of Ptolemais, leaving behind about three thousand killed, then gathered the spoils.",
      "links": "<a href='/AIV/07/4/16'>Judg. 4:16</a>",
      "comment": "Simon’s victory and the gathering of spoils recalls the pattern of Old Testament warfare where God’s people are vindicated as in Judges 4:16."
    },
    {
      "pk": 1953028,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 19,
      "text": "He took with him the Jews who were in Galilee and Arbatta, along with their wives and children and all they owned, and brought them back to Judea with great rejoicing.",
      "links": "<a href='/AIV/02/12/37-38'>Ex. 12:37-38</a>",
      "comment": "The return from Galilee is reminiscent of the Exodus from Egypt, where God’s people returned with families and possessions (Ex. 12:37-38)."
    },
    {
      "pk": 1953029,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 20,
      "text": "In the region of Gilead, Judas and his brother Jonathan crossed the Jordan and traveled three days through the wilderness.",
      "links": "<a href='/AIV/04/33/48'>Num. 33:48</a>",
      "comment": "The journey across the Jordan and the wilderness has spiritual implications: transitions and preparation for deliverance, echoing Israel’s own history."
    },
    {
      "pk": 1953030,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 21,
      "text": "The Nabateans welcomed them and told them all that had happened to their fellow Israelites in Gilead:",
      "links": "<a href='/AIV/27/2/49'>Dan. 2:49</a>",
      "comment": "The Nabateans’ hospitality is noteworthy, and fulfills the prophetic theme of Gentile nations at times acting as allies to Israel."
    },
    {
      "pk": 1953031,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 22,
      "text": "‘Many of our Hebrew brothers are besieged in Bozrah, Bosor, Alema, Chaspho, Maked, and Carnaim—all large and fortified cities.’",
      "links": "<a href='/AIV/23/34/6'>Isa. 34:6</a>",
      "comment": "The reference to fortified cities highlights the desperation of God's people, as in Isaiah's references to Edom. Deliverance from strongholds becomes a sign of divine intervention."
    },
    {
      "pk": 1953032,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 23,
      "text": "Even more are besieged in the towns of Gilead. Their enemies have set a date for tomorrow to launch an attack, seize and destroy them all in one day.",
      "links": "<a href='/AIV/19/2/1-2'>Ps. 2:1-2</a>",
      "comment": "The plotting of the enemies against God’s people has both literal and spiritual meaning, with Psalm 2’s nations raging against the Lord as an archetype."
    },
    {
      "pk": 1953033,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 24,
      "text": "Then Judas and his army suddenly marched through the wilderness to Bozrah, captured the city, and killed all the males with the sword; he gathered their spoils and set the city on fire.",
      "links": "<a href='/AIV/06/6/24'>Josh. 6:24</a>",
      "comment": "The utter destruction of Bozrah follows the biblical pattern of judgment on cities hostile to Israel, as in Jericho’s destruction by Joshua."
    },
    {
      "pk": 1953034,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 25,
      "text": "From there he moved at night and reached the fortress.",
      "links": "<a href='/AIV/07/7/19'>Judg. 7:19</a>",
      "comment": "A night approach is often associated with victorious surprise attacks under God’s guidance (Judg. 7:19; see also Christ praying at night: Luke 6:12)."
    },
    {
      "pk": 1953035,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 26,
      "text": "At dawn, they looked up and saw a large army, both men and beasts, with many camels, preparing to attack the stronghold.",
      "links": "<a href='/AIV/07/6/5'>Judg. 6:5</a>",
      "comment": "Camels as a sign of a vast Gentile army recall the Midianite invasion (Judg. 6:5). Large armies represent overwhelming threats, yet God’s salvation comes for the faithful."
    },
    {
      "pk": 1953036,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 27,
      "text": "Judas met them in battle, utterly defeated them, killed the attackers, and they fled.",
      "links": "<a href='/AIV/07/7/22'>Judg. 7:22</a>",
      "comment": "The victory of Judas is similar to Old Testament deliverance when overwhelming odds are faced (Judg. 7:22)."
    },
    {
      "pk": 1953037,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 28,
      "text": "He gathered the spoils, rescued those who were in Bozrah, and moved on to Maked, Chaspho, Bosor, and the other towns of Gilead.",
      "links": "<a href='/AIV/06/12/6-7'>Josh. 12:6-7</a>",
      "comment": "The rescue of Israelites from multiple towns is reminiscent of Joshua’s conquest and the unification of the people in the Promised Land."
    },
    {
      "pk": 1953038,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 29,
      "text": "Afterward he gathered all the Israelites in that region, men, women, and children, with their belongings, a very large company, to bring them back to the land of Judah.",
      "links": "<a href='/AIV/02/12/37'>Ex. 12:37</a>",
      "comment": "A centralizing return to Judah signals faithfulness to the land and the worship at Jerusalem—reflecting the gathering of God's people (see Ezekiel 37:21)."
    },
    {
      "pk": 1953039,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 30,
      "text": "When they reached Ephron, a large, fortified city on the way, the people of the city shut the gates and blocked the entrances with stones.",
      "links": "<a href='/AIV/07/9/46-49'>Judg. 9:46-49</a>",
      "comment": "Refusal of passage forced open combat. This highlights the opposition faced by God's people even in times of pilgrimage, paralleling spiritual struggles today."
    },
    {
      "pk": 1953040,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 31,
      "text": "Judas sent them a message of peace, saying, 'Let us pass through your land to return to our own; no one will harm you.' But they refused.",
      "links": "<a href='/AIV/04/20/14-21'>Num. 20:14-21</a>",
      "comment": "This echoes Moses' peaceful request to Edom, which was also refused, resulting in conflict (Num. 20)."
    },
    {
      "pk": 1953041,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 32,
      "text": "So Judas proclaimed to his army for everyone to take up positions. He fought against the city that day and night until it was taken.",
      "links": "<a href='/AIV/06/6/15-21'>Josh. 6:15-21</a>",
      "comment": "Persevering in battle for the sake of the people again reflects the spiritual perseverance required for the kingdom."
    },
    {
      "pk": 1953042,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 33,
      "text": "He killed every male, destroyed the city, and took all its spoils. He passed through the city over the dead.",
      "links": "<a href='/AIV/06/8/24-27'>Josh. 8:24-27</a>",
      "comment": "Total destruction was often an act of judgment. In spiritual terms, it symbolizes God’s demand for complete dedication and the serious consequences of refusing His will."
    },
    {
      "pk": 1953043,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 34,
      "text": "Then they crossed the Jordan into the great plain opposite Beth-shan.",
      "links": "<a href='/AIV/06/17/11'>Josh. 17:11</a>",
      "comment": "Beth-shan’s mention places the events geographically near the historic battles of Israel."
    },
    {
      "pk": 1953044,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 35,
      "text": "Judas gathered those who lagged behind and encouraged the people throughout the journey until they all arrived in the land of Judah.",
      "links": "<a href='/AIV/04/10/33'>Num. 10:33</a>",
      "comment": "This shepherding leadership recalls Moses' guidance leading the people across the wilderness."
    },
    {
      "pk": 1953045,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 36,
      "text": "With hymns and praise, they offered thanks and blessings to God. None of them were lost, except those who had fallen in battle.",
      "links": "<a href='/AIV/02/15/1,20'>Ex. 15:1,20</a>",
      "comment": "Thanksgiving after deliverance is integral to biblical worship, as seen in the Song of Moses (Ex. 15)."
    },
    {
      "pk": 1953046,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 37,
      "text": "Now Joseph son of Zechariah and Azariah, who had been left in command, heard of Judas and Simon's victories and wanted to make a name for themselves.",
      "links": "<a href='/AIV/09/8/20'>1 Sam. 8:20</a>",
      "comment": "Ambition apart from one’s proper calling can lead to disastrous results (see cases like Saul’s disobedience in 1 Sam. 15)."
    },
    {
      "pk": 1953047,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 38,
      "text": "So they took their men and attacked Jamnia.",
      "links": "<a href='/AIV/07/21/8-12'>Judg. 21:8-12</a>",
      "comment": "An ill-advised attack without proper discernment. Acting apart from legitimate authority brings defeat."
    },
    {
      "pk": 1953048,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 39,
      "text": "But Gorgias and his men came out of the city to meet them in battle.",
      "links": "<a href='/AIV/44/4/1'>1 Macc. 4:1</a>",
      "comment": "Gorgias is a recurring figure representing persistent opposition. Acting prematurely results in facing unsought adversity."
    },
    {
      "pk": 1953049,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 40,
      "text": "Joseph and Azariah were defeated and driven back to the borders of Judea, leaving about two thousand men dead that day.",
      "links": "<a href='/AIV/09/4/10'>1 Sam. 4:10</a>",
      "comment": "This defeat emphasizes that victory and the mission require proper calling, authority, and obedience—a reminder of the importance of true leadership, as in Moses and Aaron’s roles."
    },
    {
      "pk": 1953050,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 41,
      "text": "This disaster happened because they did not listen to Judas and his brothers but acted on their own authority.",
      "links": "<a href='/AIV/04/16/1-35'>Num. 16:1-35</a>",
      "comment": "Disobedience to established leadership brings loss. There’s a spiritual implication for the necessity of submission to true authority in God’s people (Num. 16:1-35, the rebellion of Korah)."
    },
    {
      "pk": 1953051,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 42,
      "text": "But Judas and his brothers were greatly honored by all Israel and by all the Gentiles for their faithfulness and bravery.",
      "links": "<a href='/AIV/06/4/14'>Josh. 4:14</a>",
      "comment": "Honor follows faithfulness and divinely authorized mission. Faithfulness to God and the community brings enduring spiritual fruit."
    },
    {
      "pk": 1953052,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 43,
      "text": "So great was their fame that many gathered to join them.",
      "links": "<a href='/AIV/07/4/10'>Judg. 4:10</a>",
      "comment": "The theme of a growing, unified people echoes forward to the multi-tribal assembly described in Acts and the necessity of remaining in communion for spiritual vigor."
    },
    {
      "pk": 1953053,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 44,
      "text": "Then Judas and his brothers returned to Mount Zion with joy and with their spoils.",
      "links": "<a href='/AIV/19/126/1-3'>Ps. 126:1-3</a>",
      "comment": "Mount Zion symbolizes God’s holy dwelling, and the people’s return with joy mirrors the climactic feel of many Psalms (Ps. 126:1-3)."
    },
    {
      "pk": 1953054,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 45,
      "text": "They sacrificed to God and offered burnt offerings, because he had given them great deliverance and granted them victory.",
      "links": "<a href='/AIV/03/16/6-10'>Lev. 16:6-10</a>; <a href='/AIV/19/54/6'>Ps. 54:6</a>",
      "comment": "Sacrifice follows victory—a consistent type throughout Scripture that points ahead to the ultimate, once-for-all sacrifice in Christ (Heb. 10:10)."
    },
    {
      "pk": 1953055,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 46,
      "text": "Those among the returned Israelites who had escaped death, and their possessions, were gathered together, so that they might be restored to their own homes.",
      "links": "<a href='/AIV/19/68/6'>Ps. 68:6</a>",
      "comment": "The restoration of the people points ahead to God’s faithfulness in bringing His people home, with both physical and spiritual dimensions."
    },
    {
      "pk": 1953056,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 47,
      "text": "The exiles and their loved ones, with their possessions, were brought safely to Judea, singing praise and giving thanks to God.",
      "links": "<a href='/AIV/19/107/2-3'>Ps. 107:2-3</a>",
      "comment": "The gathering of the exiles and the motif of singing praise is key to the identity of God’s chosen people and their thanksgiving—an image fulfilled in both the Church and the eschatological gathering (Rev. 7:9-10)."
    },
    {
      "pk": 1953057,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 48,
      "text": "Now, at that time, they made altars and idols, destroyed the doors of the temple, and burned the porches.",
      "links": "<a href='/AIV/14/36/19'>2 Chr. 36:19</a>",
      "comment": "Desecration of the temple and idolatry were key reasons for exile in Israel’s history (2 Chr. 36:19). Purity in worship remains vital."
    },
    {
      "pk": 1953058,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 49,
      "text": "But he rewarded those who acted faithfully for their devotion to the law.",
      "links": "<a href='/AIV/19/32/10'>Ps. 32:10</a>",
      "comment": "Faithfulness to the law brings blessing—pointing to the spiritual significance of obedience and sanctity."
    },
    {
      "pk": 1953059,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 50,
      "text": "Judas restored the ruined walls of Mount Zion, and with his people encircled the city with high towers, making it secure against its enemies.",
      "links": "<a href='/AIV/16/3/1-32'>Neh. 3:1-32</a>",
      "comment": "Rebuilding the city walls is both a literal and spiritual restoration, occurring after deliverances throughout Israel’s history."
    },
    {
      "pk": 1953060,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 51,
      "text": "He stationed a garrison there to defend it, and he fortified Beth-zur to secure the people, so that it would stand strong in the face of their enemies.",
      "links": "<a href='/AIV/14/11/11'>2 Chr. 11:11</a>",
      "comment": "Establishing garrisons assured physical and spiritual security—so too, Christ appoints shepherds and guardians over the community for continual protection."
    },
    {
      "pk": 1953061,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 52,
      "text": "Now the Gentile nations around them conspired to destroy the Israelites, but they did not succeed, for God's plan was with His people.",
      "links": "<a href='/AIV/19/2/1'>Ps. 2:1</a>",
      "comment": "Man’s plans can never thwart divine providence—God’s sovereignty prevails, seen throughout salvation history."
    },
    {
      "pk": 1953062,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 53,
      "text": "Some of them betrayed their own people and joined the enemies to fight against Judas and his brothers.",
      "links": "<a href='/AIV/13/10/13'>1 Chr. 10:13</a>",
      "comment": "Betrayal from within is a peril often faced by God’s people (cf. 1 Chr. 10:13; Judas Iscariot in the Gospels). Unity is crucial."
    },
    {
      "pk": 1953063,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 54,
      "text": "Judas captured and punished these traitors, purging the evil from among them.",
      "links": "<a href='/AIV/05/17/7'>Deut. 17:7</a>",
      "comment": "Purging evil from the community reflects key biblical mandates to preserve holiness and unity (Deut. 17:7)."
    },
    {
      "pk": 1953064,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 55,
      "text": "Judas and his brothers, with all Israel, gave thanks continually to God, rejoicing over the great things he had done for them.",
      "links": "<a href='/AIV/19/107/8'>Ps. 107:8</a>",
      "comment": "Continual thanksgiving is the hallmark of a faithful community—seen across all of Scripture."
    },
    {
      "pk": 1953065,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 56,
      "text": "During those days there came back to Judas news that Philip, a trusted man under King Antiochus, had returned from Persia and Media, bringing with him a large army intending to take over the government.",
      "links": "<a href='/AIV/27/6/15'>Dan. 6:15</a>",
      "comment": "Political intrigue and shifting powers are a recurring challenge for God’s people, often requiring discernment and faith."
    },
    {
      "pk": 1953066,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 57,
      "text": "And so Judas and his brothers heard of this, and they went out to battle against him.",
      "links": "<a href='/AIV/09/23/27-29'>1 Sam. 23:27-29</a>",
      "comment": "Vigilant defense of the people shows the importance of courageous, decisive leadership."
    },
    {
      "pk": 1953067,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 58,
      "text": "But as they moved their camp to Jerusalem, the army of Gorgias prepared to meet them, and there was a great battle.",
      "links": "<a href='/AIV/44/4/1'>1 Macc. 4:1</a>",
      "comment": "The battles of Gorgias and Judas epitomize the relentless challenges facing those who would be faithful."
    },
    {
      "pk": 1953068,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 59,
      "text": "The Gentiles were defeated and fled to their own lands, and many fell by the sword. Israel won a great victory.",
      "links": "<a href='/AIV/06/12/24'>Josh. 12:24</a>",
      "comment": "By God’s grace, the faithful enjoy victory—demonstrating the spiritual principle that perseverance in God’s call bears fruit."
    },
    {
      "pk": 1953069,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 60,
      "text": "So Judas and his brothers returned to the land of Judah in peace, with joy and with the spoils they had taken.",
      "links": "<a href='/AIV/19/126/1-3'>Ps. 126:1-3</a>",
      "comment": "The motif of peaceful return with joy mirrors Old Testament celebrations after victorious deliverance."
    },
    {
      "pk": 1953070,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 61,
      "text": "They celebrated their deliverance for many days, praising God who had done great things for Israel and for the faithfulness of His servants.",
      "links": "<a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "Extended thanksgiving as a community is integral to Jewish and Christian liturgical tradition."
    },
    {
      "pk": 1953071,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 62,
      "text": "Then, during this time, the faithful leadership of Judas and his brothers was remembered everywhere.",
      "links": "<a href='/AIV/58/13/7'>Heb. 13:7</a>",
      "comment": "True leaders are remembered by their faithfulness and sacrifice; spiritual authority and tradition transmit blessings to future generations."
    },
    {
      "pk": 1953072,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 63,
      "text": "So, the years of rest and peace came upon Israel, for their enemies had been subdued by God’s saving hand.",
      "links": "<a href='/AIV/06/21/44'>Josh. 21:44</a>",
      "comment": "Peace after victory is a sign of God’s favor; it foreshadows the rest Christ brings to His people (Matt. 11:28-29)."
    },
    {
      "pk": 1953073,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 64,
      "text": "Now all Israel dwelt in safety, and each man tended his own vineyard and fig tree with contentment.",
      "links": "<a href='/AIV/11/4/25'>1 Kgs. 4:25</a>",
      "comment": "Describing a messianic age motif found throughout the prophets (Micah 4:4)—an image of peace fulfilled ultimately in Christ’s Kingdom."
    },
    {
      "pk": 1953074,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 65,
      "text": "But in those days, certain Gentiles, jealous of Israel’s peace, stirred up further trouble and threatened the boundaries of Judea.",
      "links": "<a href='/AIV/16/4/7-8'>Neh. 4:7-8</a>",
      "comment": "Even in times of blessing, the world often opposes those aligned with God—spiritual vigilance is necessary."
    },
    {
      "pk": 1953075,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 66,
      "text": "Judas and the assembly prayed to God, who gave them wisdom, and prepared themselves for renewed defense of the people.",
      "links": "<a href='/AIV/09/7/5-10'>1 Sam. 7:5-10</a>",
      "comment": "Communal prayer and seeking wisdom precede significant victories throughout the biblical story (cf. Acts 1:14)."
    },
    {
      "pk": 1953076,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 67,
      "text": "So, strengthened by prayer and by their faith, the people stood firm, committed to the Law of the Lord and to the traditions handed down from their fathers.",
      "links": "<a href='/AIV/05/6/6-9'>Deut. 6:6-9</a>",
      "comment": "Commitment to the law and tradition is central to biblical spirituality; faith and works together produce steadfastness (James 2:22)."
    },
    {
      "pk": 1953077,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 68,
      "text": "And in these days, the fame of Judas and his brothers grew more and more, and the Lord gave them favor in the eyes of his people and all the nations around.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/44/3/1'>1 Macc. 3:1</a>",
      "comment": "The increase in favor and reputation is a biblical sign that God’s blessing rests on faithful leadership and those who preserve the unity and tradition of the people of God."
    }
  ],
  "translatedAt": "2025-12-23T09:23:24.131Z"
}