{
  "book": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 3,
  "verses": [
    {
      "pk": 310301,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 1,
      "text": "Then his son Judas, called Maccabeus, rose up in his place.",
      "links": "<a href='/AIV/44/2/66'>1 Macc. 2:66</a>",
      "comment": "Judas Maccabeus takes leadership after his father's death, fulfilling his father's commission. This succession models the importance of continuity in leadership and faithfulness to God's law."
    },
    {
      "pk": 310302,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 2,
      "text": "And all his brothers helped him, and all those who followed his father stood with him, and they fought for Israel with a joyful heart.",
      "links": "<a href='/AIV/44/2/65-68'>1 Macc. 2:65-68</a>",
      "comment": "Solidarity among brothers echoes themes of unity and the importance of family in carrying out God’s mission."
    },
    {
      "pk": 310303,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 3,
      "text": "He enlarged the glory of his people and put on a breastplate like a warrior; he armed himself with weapons and led the battle, protecting the camp with his sword.",
      "links": "<a href='/AIV/44/2/42'>1 Macc. 2:42</a>",
      "comment": "Judas’s military role is emphasized; this imagery mirrors spiritual warfare passages such as Ephesians 6:11-17, where believers are called to put on the armor of God."
    },
    {
      "pk": 310304,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 4,
      "text": "He was like a lion in his deeds, like a young lion roaring to hunt.",
      "links": "<a href='/AIV/19/7/2'>Ps. 7:2</a>; <a href='/AIV/20/28/1'>Prov. 28:1</a>",
      "comment": "The lion imagery refers to strength and courage—often used in scripture for leaders (see Genesis 49:9 for Judah as a lion’s cub, prefiguring kingship)."
    },
    {
      "pk": 310305,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 5,
      "text": "He hunted down and pursued those who troubled his people; he destroyed the lawless and delivered those who were afflicted.",
      "links": "<a href='/AIV/44/2/44'>1 Macc. 2:44</a>",
      "comment": "A key theme is God’s deliverance through chosen leaders. The defense of the faithful ones against wickedness is central in salvation history (see Judges 2:16)."
    },
    {
      "pk": 310306,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 6,
      "text": "He made the lawless panic and many were cleansed from their sins.",
      "links": "<a href='/AIV/20/21/15'>Prov. 21:15</a>",
      "comment": "Cleansing from sin here refers to restoration through zeal for God’s law, foreshadowing the fuller cleansing found in the Messiah."
    },
    {
      "pk": 310307,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 7,
      "text": "He made many angry kings tremble, and brought joy to Jacob by his deeds; his memory is blessed forever.",
      "links": "<a href='/AIV/19/112/6'>Ps. 112:6</a>; <a href='/AIV/20/10/7'>Prov. 10:7</a>",
      "comment": "‘Memory is blessed forever’ echoes the biblical idea of righteous remembrance, also shown in Hebrews 11."
    },
    {
      "pk": 310308,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 8,
      "text": "He led the people out, destroyed the ungodly, and cleansed Israel.",
      "links": "<a href='/AIV/44/2/47'>1 Macc. 2:47</a>",
      "comment": "Cleansing here has strong liturgical undertones, pointing to the restoration of worship and purity in the people’s life."
    },
    {
      "pk": 310309,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 9,
      "text": "Judas was renowned all over the earth, and all the ungodly were afraid of him.",
      "links": "<a href='/AIV/44/3/7'>1 Macc. 3:7</a>",
      "comment": "The reputation of God’s servant among the nations is a motif seen throughout scripture, pointing ultimately to Christ (cf. Isaiah 49:6)."
    },
    {
      "pk": 310310,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 10,
      "text": "Numerous kings and their armies sought to oppose him.",
      "links": "",
      "comment": "Opposition to God’s chosen is a recurring theme, from David to Jesus (see Psalm 2:2)."
    },
    {
      "pk": 310311,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 11,
      "text": "When Apollonius gathered Gentile armies, with a great force from Samaria to fight against Israel,",
      "links": "<a href='/AIV/44/1/17'>1 Macc. 1:17</a>",
      "comment": "Gentile opposition against the faithful is seen here, a foreshadowing of the universal struggle between good and evil."
    },
    {
      "pk": 310312,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 12,
      "text": "Judas met him, struck him down, and many fell wounded; the rest fled.",
      "links": "<a href='/AIV/44/3/1-3'>1 Macc. 3:1-3</a>",
      "comment": "Victory over enemies emphasizes God’s presence with the faithful remnant."
    },
    {
      "pk": 310313,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 13,
      "text": "He took Apollonius’s sword and fought with it all his life.",
      "links": "",
      "comment": "The enemy’s sword becoming the hero’s weapon is reminiscent of David taking Goliath’s sword (see 1 Samuel 17:51-54)."
    },
    {
      "pk": 310314,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 14,
      "text": "Then Seron, commander of the Syrian army, heard that Judas had gathered a band of loyal men and was ready for battle.",
      "links": "",
      "comment": "Greek and Syrian opposition to Israel reflects the pattern seen throughout the Old Testament."
    },
    {
      "pk": 310315,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 15,
      "text": "He said, “I will make myself famous and take revenge on the sons of Israel who have resisted the king.”",
      "links": "<a href='/AIV/44/1/43'>1 Macc. 1:43</a>",
      "comment": "Seron’s pride echoes Pharaoh’s pride in Exodus 14:4."
    },
    {
      "pk": 310316,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 16,
      "text": "So Seron organized his army, with many impious men joining him, and advanced to the hill country.",
      "links": "",
      "comment": "The alignment of lawless people against God’s people is a motif across salvation history."
    },
    {
      "pk": 310317,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 17,
      "text": "But Judas and his brothers, seeing the danger faced by their nation, said, “Let us defend our people and fight for our Holy Place!”",
      "links": "<a href='/AIV/44/3/40'>1 Macc. 3:40</a>; <a href='/AIV/44/4/36'>1 Macc. 4:36</a>",
      "comment": "The defense of the temple is a core theme; the sanctity of worship spaces remains vital for proper worship."
    },
    {
      "pk": 310318,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 18,
      "text": "The assembly rallied to them, and together they prayed, asking God for his mercy and favor.",
      "links": "<a href='/AIV/44/3/44'>1 Macc. 3:44</a>; <a href='/AIV/19/44/4'>Ps. 44:4</a>",
      "comment": "Collective prayer before battle highlights communal faith and reliance on God—see Acts 1:14."
    },
    {
      "pk": 310319,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 19,
      "text": "Judas said, “Victory does not come from a large army, but from heaven’s strength.”",
      "links": "<a href='/AIV/07/7/7'>Judg. 7:7</a>; <a href='/AIV/09/17/47'>1 Sam. 17:47</a>",
      "comment": "Reminiscent of David’s faith against Goliath; divine providence surpasses human power."
    },
    {
      "pk": 310320,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 20,
      "text": "“Many have been defeated by a few, when heaven willed it. It is not the size of the army, but strength from above.”",
      "links": "<a href='/AIV/07/7/2-8'>Judg. 7:2-8</a>",
      "comment": "Underscores the biblical message: God is the true source of victory."
    },
    {
      "pk": 310321,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 21,
      "text": "“We fight for our lives, for our laws, and for the sanctuary.”",
      "links": "",
      "comment": "Defending the law and sacred space highlights the necessity of worship and obedience to God’s commands."
    },
    {
      "pk": 310322,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 22,
      "text": "“He himself will crush them before us; do not be afraid!”",
      "links": "<a href='/AIV/05/1/29'>Deut. 1:29</a>; <a href='/AIV/05/20/3'>Deut. 20:3</a>",
      "comment": "Echoes Old Testament assurances of God fighting for Israel."
    },
    {
      "pk": 310323,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 23,
      "text": "When Seron’s army climbed into the hills, Judas’s men confronted them.",
      "links": "",
      "comment": "The scene sets the pattern of the faithful facing overwhelming odds."
    },
    {
      "pk": 310324,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 24,
      "text": "With God’s help, Seron’s army was smashed, and pursued down the descent of Beth-horon to the plain.",
      "links": "<a href='/AIV/06/10/10-11'>Josh. 10:10-11</a>",
      "comment": "God’s intervention recalls Joshua's victory at Beth-horon."
    },
    {
      "pk": 310325,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 25,
      "text": "Eight hundred of Seron’s men fell, and the rest fled to the land of the Philistines.",
      "links": "<a href='/AIV/09/4/1'>1 Sam. 4:1</a>",
      "comment": "Philistines are long-time enemies of Israel, and their presence reminds readers of Israel's ongoing spiritual battles."
    },
    {
      "pk": 310326,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 26,
      "text": "Judas and his brothers grew more famous, and fear fell on the surrounding nations.",
      "links": "",
      "comment": "The motif of God-fearing Israel’s enemies is echoed in Ex. 15:14-16."
    },
    {
      "pk": 310327,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 27,
      "text": "King Antiochus heard about these events, and was angry.",
      "links": "<a href='/AIV/44/1/10'>1 Macc. 1:10</a>",
      "comment": "Antiochus’s opposition is a type of worldly power resisting God’s purposes."
    },
    {
      "pk": 310328,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 28,
      "text": "He sent messages throughout all his kingdom, to gather a mighty army.",
      "links": "<a href='/AIV/44/1/17'>1 Macc. 1:17</a>",
      "comment": "The vastness of the enemy heightens the miracle of Israel’s survival."
    },
    {
      "pk": 310329,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 29,
      "text": "He opened his treasury and paid a year’s wages to his entire army, expecting to overwhelm Israel.",
      "links": "",
      "comment": "Financial resources will not guarantee victory over God’s people—see Psalm 20:7."
    },
    {
      "pk": 310330,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 30,
      "text": "The treasury became empty, and he could no longer support his army as he had.",
      "links": "",
      "comment": "Earthly power is transient compared with spiritual strength."
    },
    {
      "pk": 310331,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 31,
      "text": "He became deeply distressed, and decided to go to Persia to collect tribute from his provinces to replenish his money.",
      "links": "<a href='/AIV/27/6/28'>Dan. 6:28</a>",
      "comment": "Persia’s role in biblical history is important, often involving God’s providence for Israel."
    },
    {
      "pk": 310332,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 32,
      "text": "He left Lysias, a nobleman, in charge of the kingdom from the Euphrates River to Egypt.",
      "links": "",
      "comment": "The delegation of authority points toward apostolic succession—an ongoing theme in leadership continuity."
    },
    {
      "pk": 310333,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 33,
      "text": "Lysias was to educate his son Antiochus until his return.",
      "links": "",
      "comment": "A father’s role in formation and training is a biblical motif, underscoring generational teaching."
    },
    {
      "pk": 310334,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 34,
      "text": "He gave Lysias half the army, as well as war elephants, commanding him to conquer Israel and destroy Jerusalem.",
      "links": "<a href='/AIV/44/1/17'>1 Macc. 1:17</a>",
      "comment": "Jerusalem's repeated targeting shows its centrality for spiritual worship, echoing the city’s significance in biblical prophecy."
    },
    {
      "pk": 310335,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 35,
      "text": "He was also to exile the remaining people and settle foreigners in their territory.",
      "links": "",
      "comment": "Forced exile recalls Babylonian captivity, and the threat to pure worship and true faith."
    },
    {
      "pk": 310336,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 36,
      "text": "Lysias and his designated rulers prepared themselves for war against Israel.",
      "links": "",
      "comment": "Subordinates gather for war; echoes other biblical sieges against God’s people."
    },
    {
      "pk": 310337,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 37,
      "text": "He sent Ptolemy, son of Dorymenes, Nicanor, and Gorgias—powerful men with capable armies.",
      "links": "",
      "comment": "The enemy always seems well-equipped, yet victory comes from God."
    },
    {
      "pk": 310338,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 38,
      "text": "They camped in Emmaus, in the plain, assembling a vast army from the Gentile nations.",
      "links": "<a href='/AIV/44/3/40'>1 Macc. 3:40</a>",
      "comment": "Emmaus becomes an important setting for later biblical history (see Luke 24:13)."
    },
    {
      "pk": 310339,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 39,
      "text": "All traders from neighboring lands came, bringing silver and gold, eager to buy Israel’s captives as slaves.",
      "links": "<a href='/AIV/29/3/3'>Joel 3:3</a>",
      "comment": "Enslavement of God’s people recalls Egypt; liberation will have spiritual significance in later scripture."
    },
    {
      "pk": 310340,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 40,
      "text": "Israel’s army saw their overwhelming numbers, feared greatly, and prayed to the Lord to save them.",
      "links": "<a href='/AIV/44/3/18'>1 Macc. 3:18</a>",
      "comment": "The repeated turning to prayer is an essential spiritual discipline, throughout both Old and New Testaments."
    },
    {
      "pk": 310341,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 41,
      "text": "They covered themselves in sackcloth, calling out earnestly to heaven.",
      "links": "<a href='/AIV/32/3/6'>Jonah 3:6</a>; <a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "Sackcloth as a sign of repentance and humility is used in both Old and New Testament practices."
    },
    {
      "pk": 310342,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 42,
      "text": "They lay flat before the altar, begging God to show mercy to Israel.",
      "links": "<a href='/AIV/19/84/1'>Ps. 84:1</a>; <a href='/AIV/44/4/40'>1 Macc. 4:40</a>",
      "comment": "Prostration before the altar signifies deep reverence; such practice is echoed in Jesus’ own actions (see Matthew 26:39)."
    },
    {
      "pk": 310343,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 43,
      "text": "They fasted that day, dressed in sackcloth, and put ashes on their heads, tearing their garments.",
      "links": "<a href='/AIV/23/58/5'>Isaiah 58:5</a>",
      "comment": "Fasting with sackcloth and ashes shows repentance, a theme that recurs in the prophets and is affirmed by Jesus (see Matthew 6:16-18)."
    },
    {
      "pk": 310344,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 44,
      "text": "They opened the scroll of the law to search out God’s will in their time of trouble.",
      "links": "<a href='/AIV/15/9/4'>Ezra 9:4</a>; <a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "Turning to scripture for guidance shows the priority of God’s word in faith decisions—a tradition affirmed by Jesus and the apostles."
    },
    {
      "pk": 310345,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 45,
      "text": "They recognized that the sanctuary was desolate, Jerusalem was ruined, and the altar was desecrated.",
      "links": "<a href='/AIV/44/1/39'>1 Macc. 1:39</a>",
      "comment": "Desolation and desecration of the temple prefigure Jesus' prophecy in Matthew 24:15."
    },
    {
      "pk": 310346,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 46,
      "text": "Unclean people lived in their fortress; the sacred priests had fled.",
      "links": "",
      "comment": "Priests’ absence underscores spiritual crisis when proper worship cannot occur."
    },
    {
      "pk": 310347,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 47,
      "text": "The people mourned, pulling down their garments and crying out to heaven.",
      "links": "",
      "comment": "Physical mourning expresses deep spiritual lament, seen also in Lamentations."
    },
    {
      "pk": 310348,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 48,
      "text": "Then the assembly gathered to deliberate what to do for the survivors, the widows, and the children.",
      "links": "",
      "comment": "Caring for widows and orphans: an enduring command for God’s people—see James 1:27."
    },
    {
      "pk": 310349,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 49,
      "text": "They brought the scroll of the law and begged for God’s aid.",
      "links": "",
      "comment": "Scripture and prayer together have always been foundational practices."
    },
    {
      "pk": 310350,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 50,
      "text": "They prayed, ‘Lord, why have you let us suffer and the nations conquer us?’",
      "links": "",
      "comment": "Crying out in suffering reflects the lament psalms (Ps. 13, Ps. 22)."
    },
    {
      "pk": 310351,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 51,
      "text": "‘We cannot offer the sacrifices you commanded, or fulfill the obligations to your covenant or festival days.’",
      "links": "<a href='/AIV/03/23/1-8'>Lev. 23:1-8</a>",
      "comment": "Loss of regular sacrifice points to the necessity of priesthood and true worship, motivating the community to restore what was lost—a foreshadowing of Christ’s once-for-all sacrifice."
    },
    {
      "pk": 310352,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 52,
      "text": "‘See how the Gentiles have gathered against us to destroy us! You know what they plan against us.’",
      "links": "",
      "comment": "Trust in God’s omniscience, consistent with appeals in Psalms (Ps. 139:1-6)."
    },
    {
      "pk": 310353,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 53,
      "text": "‘How will you endure this, O God? Act for your own honor!’",
      "links": "<a href='/AIV/19/79/5-10'>Ps. 79:5-10</a>",
      "comment": "God’s glory motivates His action, as seen in Exodus 32:12."
    },
    {
      "pk": 310354,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 54,
      "text": "They lifted up their voices and prayed passionately.",
      "links": "",
      "comment": "Unity in loud prayer points towards the power of communal worship (Acts 4:24)."
    },
    {
      "pk": 310355,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 55,
      "text": "Then Judas appointed leaders for the people: over thousands, hundreds, fifties, and tens.",
      "links": "<a href='/AIV/02/18/25'>Ex. 18:25</a>",
      "comment": "Organizing leaders in hierarchical order reflects Mosaic leadership structure."
    },
    {
      "pk": 310356,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 56,
      "text": "He sent home those newly married, building homes, or planting vineyards, as required by the law.",
      "links": "<a href='/AIV/05/20/5-7'>Deut. 20:5-7</a>",
      "comment": "Scripture’s respect for the law even in wartime highlights enduring principles for every generation."
    },
    {
      "pk": 310357,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 57,
      "text": "Then the army camped to the north of Emmaus.",
      "links": "",
      "comment": "Strategic placement underscores preparation and prudent leadership."
    },
    {
      "pk": 310358,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 58,
      "text": "Judas encouraged them, ‘Stand firm and be courageous; be ready in the morning to fight against these enemies who have come against us to destroy our faith and our place.’",
      "links": "<a href='/AIV/06/1/7'>Josh. 1:7</a>; <a href='/AIV/44/3/17'>1 Macc. 3:17</a>",
      "comment": "Encouragement to stand firm echoes God’s words to Joshua, emphasizing perseverance."
    },
    {
      "pk": 310359,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 59,
      "text": "‘It is better to die in battle than to see the ruin and desecration of our people and sanctuary.’",
      "links": "",
      "comment": "Faithfulness unto death foreshadows Christian martyrdom and joining the witness cloud of Hebrews 12:1."
    },
    {
      "pk": 310360,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 60,
      "text": "‘But as God wills, heaven will decide; let us entrust our lives to him and follow his will.’",
      "links": "<a href='/AIV/42/22/42'>Luke 22:42</a>; <a href='/AIV/19/37/5'>Ps. 37:5</a>",
      "comment": "Entrusting oneself to God’s will recalls Jesus in Gethsemane; spiritual surrender is key for every believer."
    }
  ],
  "translatedAt": "2025-12-23T09:21:12.944Z"
}