{
  "book": "Galatians",
  "bookAbbreviation": "Gal",
  "chapter": 1,
  "verses": [
    {
      "pk": 2001001,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle—not from men nor through man, but through Jesus Christ and God the Father who raised him from the dead—",
      "links": "<a href='/ESV/45/1/1'>Romans 1:1</a>; <a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/46/1/1'>1 Corinthians 1:1</a>",
      "comment": "Paul asserts his apostleship comes directly from Jesus Christ and God the Father, emphasizing divine calling rather than human appointment. The mention of resurrection grounds his authority in the core event of Christian faith."
    },
    {
      "pk": 2001002,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 2,
      "text": "and all the brothers who are with me, to the churches of Galatia:",
      "links": "<a href='/AIV/44/16/6'>Acts 16:6</a>; <a href='/AIV/44/18/23'>Acts 18:23</a>",
      "comment": "Paul includes the wider Christian community, signaling unity and shared faith. 'Churches' points to a collective identity rooted in apostolic teaching."
    },
    {
      "pk": 2001003,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 3,
      "text": "Grace to you and peace from God our Father and our Lord Jesus Christ,",
      "links": "<a href='/AIV/45/1/7'>Romans 1:7</a>; <a href='/AIV/46/1/3'>1 Corinthians 1:3</a>",
      "comment": "The greeting connects grace and peace, gifts that come from both the Father and Son, reinforcing the divinity of Christ in his equality with God."
    },
    {
      "pk": 2001004,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 4,
      "text": "who gave himself for our sins, to deliver us from this present evil age, according to the will of our God and Father,",
      "links": "<a href='/AIV/41/10/45'>Mark 10:45</a>; <a href='/AIV/23/53/5-6'>Isaiah 53:5-6</a>; <a href='/AIV/45/8/3'>Romans 8:3</a>",
      "comment": "Jesus’ self-sacrifice fulfills Old Testament prophecy and reveals the redemptive purpose of God. Spiritual deliverance points both to forgiveness and ongoing sanctification."
    },
    {
      "pk": 2001005,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 5,
      "text": "to whom be glory forever and ever. Amen.",
      "links": "<a href='/AIV/45/11/36'>Romans 11:36</a>; <a href='/AIV/54/6/16'>1 Timothy 6:16</a>",
      "comment": "The doxology affirms eternal worship of God, suggesting a pattern of liturgical praise."
    },
    {
      "pk": 2001006,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 6,
      "text": "I am astonished that you are so quickly turning away from the one who called you in the grace of Christ to a different gospel—",
      "links": "<a href='/AIV/47/11/4'>2 Corinthians 11:4</a>; <a href='/AIV/44/20/30'>Acts 20:30</a>",
      "comment": "'Turning away' warns of theological instability. 'Grace of Christ' emphasizes salvation as a gift, countering reliance on human works or alternative teachings."
    },
    {
      "pk": 2001007,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 7,
      "text": "not that there is another, but there are some who trouble you and want to distort the gospel of Christ.",
      "links": "<a href='/AIV/47/2/17'>2 Corinthians 2:17</a>",
      "comment": "Paul clarifies that the true gospel is unique. False teachings are distortions, not valid alternatives."
    },
    {
      "pk": 2001008,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 8,
      "text": "But even if we or an angel from heaven should preach a gospel contrary to what we preached to you, let him be accursed.",
      "links": "<a href='/AIV/47/11/13-15'>2 Corinthians 11:13-15</a>; <a href='/AIV/64/1/9-10'>2 John 9-10</a>",
      "comment": "Paul’s curse on false teachers, even heavenly messengers, shows the gravity of preserving apostolic teaching. Implies authority safeguarded through transmission."
    },
    {
      "pk": 2001009,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 9,
      "text": "As we have said before, so now I say again: If anyone preaches to you a gospel contrary to what you received, let him be accursed.",
      "links": "<a href='/AIV/55/1/13'>2 Timothy 1:13</a>; <a href='/AIV/66/22/18-19'>Revelation 22:18-19</a>",
      "comment": "Repetition underscores the seriousness of doctrine preservation. Receiving the original gospel highlights transmission through the apostolic community."
    },
    {
      "pk": 2001010,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 10,
      "text": "For am I now seeking the approval of men, or of God? Or am I trying to please men? If I were still trying to please men, I would not be a servant of Christ.",
      "links": "<a href='/AIV/52/2/4'>1 Thessalonians 2:4</a>",
      "comment": "Servanthood to Christ requires loyalty above human approval. Spiritual meaning: faithfulness involves even public opposition for God's truth."
    },
    {
      "pk": 2001011,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 11,
      "text": "For I want you to know, brothers, that the gospel I preached is not of human origin.",
      "links": "<a href='/AIV/44/22/14'>Acts 22:14</a>; <a href='/AIV/43/7/16'>John 7:16</a>",
      "comment": "Paul insists the gospel is direct revelation. Emphasizes divine foundation and credibility of apostolic tradition."
    },
    {
      "pk": 2001012,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 12,
      "text": "For I did not receive it from any man, nor was I taught it, but received it through a revelation of Jesus Christ.",
      "links": "<a href='/AIV/44/9/17'>Acts 9:17</a>; <a href='/AIV/44/26/16'>Acts 26:16</a>",
      "comment": "Paul’s unique apostleship is based on a personal encounter with Christ. Highlights both literal and spiritual revelation in Christian life."
    },
    {
      "pk": 2001013,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 13,
      "text": "You have heard of my former way of life in Judaism, how I persecuted the church of God violently and tried to destroy it.",
      "links": "<a href='/AIV/44/7/58-8:3'>Acts 7:58–8:3</a>; <a href='/AIV/50/3/6'>Philippians 3:6</a>",
      "comment": "Paul contrasts his past with his new mission, showing radical change through divine intervention rather than human will."
    },
    {
      "pk": 2001014,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 14,
      "text": "I was advancing in Judaism beyond many of my own age among my people, being extremely zealous for the traditions of my ancestors.",
      "links": "<a href='/AIV/50/3/5'>Philippians 3:5</a>",
      "comment": "Paul's zeal for ancestral tradition reflects sincerity, but highlights the need for transformation by Christ."
    },
    {
      "pk": 2001015,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 15,
      "text": "But when he who set me apart before I was born and called me by his grace,",
      "links": "<a href='/AIV/24/1/5'>Jeremiah 1:5</a>; <a href='/AIV/23/49/1'>Isaiah 49:1</a>",
      "comment": "Divine election and calling are scriptural themes; God’s initiative is both personal and predestined. Cross-reference with prophets’ callings."
    },
    {
      "pk": 2001016,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 16,
      "text": "was pleased to reveal his Son in me, so that I might proclaim him among the nations, I did not immediately consult with flesh and blood,",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/45/1/5'>Romans 1:5</a>",
      "comment": "The phrase 'reveal his Son in me' shows both personal transformation and the basis for mission. Focus on divine rather than human authority."
    },
    {
      "pk": 2001017,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 17,
      "text": "nor did I go up to Jerusalem to those who were apostles before me, but I went away into Arabia, and returned again to Damascus.",
      "links": "<a href='/AIV/44/9/19-25'>Acts 9:19-25</a>",
      "comment": "Paul’s initial isolation stresses the independence of his commission, but later reconciliation with others will point to church unity."
    },
    {
      "pk": 2001018,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 18,
      "text": "Then after three years I went up to Jerusalem to visit Cephas and remained with him fifteen days.",
      "links": "<a href='/AIV/44/9/26'>Acts 9:26</a>; <a href='/AIV/43/1/42'>John 1:42</a>",
      "comment": "'Cephas' (Peter) is visited by Paul, indicating recognition of Peter’s leadership among the apostles."
    },
    {
      "pk": 2001019,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 19,
      "text": "But I saw none of the other apostles except James, the Lord’s brother.",
      "links": "<a href='/AIV/44/15/13'>Acts 15:13</a>; <a href='/AIV/40/13/55'>Matthew 13:55</a>",
      "comment": "Paul’s encounter with James corroborates the continuity between Jesus’ earthly family and the early church leadership."
    },
    {
      "pk": 2001020,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 20,
      "text": "Now what I am writing to you, look, before God, I am not lying.",
      "links": "<a href='/AIV/45/9/1'>Romans 9:1</a>",
      "comment": "Paul’s oath before God strengthens the credibility and integrity of his account."
    },
    {
      "pk": 2001021,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 21,
      "text": "Then I went into the regions of Syria and Cilicia.",
      "links": "<a href='/AIV/44/9/30'>Acts 9:30</a>; <a href='/AIV/44/11/25'>Acts 11:25</a>",
      "comment": "Paul’s missionary activity moves geographically, indicating the spread of the church as global."
    },
    {
      "pk": 2001022,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 22,
      "text": "And I was still unknown by face to the churches of Judea that are in Christ.",
      "links": "<a href='/AIV/44/8/1'>Acts 8:1</a>; <a href='/AIV/44/9/31'>Acts 9:31</a>",
      "comment": "Paul affirms church communities rooted in Christ’s body, even before direct contact."
    },
    {
      "pk": 2001023,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 23,
      "text": "They only heard it said, ‘He who formerly persecuted us now proclaims the faith he once tried to destroy.’",
      "links": "<a href='/AIV/44/9/21'>Acts 9:21</a>",
      "comment": "Paul’s transformation is witness to the power of grace and the authenticity of conversion, reinforcing both the literal and spiritual sense."
    },
    {
      "pk": 2001024,
      "translation": "AIV",
      "book": 9,
      "chapter": 1,
      "verse": 24,
      "text": "And they glorified God because of me.",
      "links": "<a href='/AIV/44/21/20'>Acts 21:20</a>; <a href='/AIV/43/9/3'>John 9:3</a>",
      "comment": "The glory given to God through Paul's changed life indicates that redemption and vocation are points of praise. This ends the chapter by placing spiritual transformation within the wider church, united in worship and mission."
    }
  ],
  "translatedAt": "2025-12-23T03:50:50.452Z"
}