{
  "book": "Galatians",
  "bookAbbreviation": "Gal",
  "chapter": 3,
  "verses": [
    {
      "pk": 350301,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 1,
      "text": "You foolish Galatians! Who has bewitched you, before whose eyes Jesus Christ was publicly portrayed as crucified?",
      "links": "<a href='/AIV/40/27/35-36'>Matt. 27:35–36</a>; <a href='/AIV/45/6/3'>Rom. 6:3</a>",
      "comment": "Paul expresses deep concern for the Galatians, emphasizing the clarity of Christ's sacrificial death—a foundational doctrine for salvation."
    },
    {
      "pk": 350302,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 2,
      "text": "I want to learn this from you: Did you receive the Spirit by works of the law, or by hearing with faith?",
      "links": "<a href='/AIV/45/10/17'>Rom. 10:17</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Paul distinguishes between observance of the Mosaic Law and the hearing of faith as the means for receiving the Holy Spirit, reinforcing the primacy of faith over legalism."
    },
    {
      "pk": 350303,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 3,
      "text": "Are you so foolish? Having begun by the Spirit, are you now being perfected by the flesh?",
      "links": "<a href='/AIV/45/8/3-4'>Rom. 8:3–4</a>",
      "comment": "Paul rebukes the Galatians for attempting to achieve spiritual maturity through human effort after experiencing the Spirit by faith."
    },
    {
      "pk": 350304,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 4,
      "text": "Did you suffer so many things in vain—if indeed it was in vain?",
      "links": "<a href='/AIV/44/14/22'>Acts 14:22</a>",
      "comment": "He urges them to consider their past hardships for the gospel, which should not be rendered meaningless by abandoning the true faith."
    },
    {
      "pk": 350305,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 5,
      "text": "So then, does he who supplies the Spirit to you and works miracles among you do so by works of the law, or by hearing with faith?",
      "links": "<a href='/AIV/46/12/10'>1 Cor. 12:10</a>; <a href='/AIV/44/15/12'>Acts 15:12</a>",
      "comment": "Paul suggests that the continuing work of the Spirit, including miracles, flows from faith, not legal observance."
    },
    {
      "pk": 350306,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 6,
      "text": "Just as Abraham ‘believed God, and it was credited to him as righteousness.’",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/45/4/3'>Rom. 4:3</a>",
      "comment": "Paul quotes Genesis, connecting Abraham’s justification to faith, not works—a foundational Old Testament link."
    },
    {
      "pk": 350307,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 7,
      "text": "So understand that it is those who have faith who are children of Abraham.",
      "links": "<a href='/AIV/45/9/8'>Rom. 9:8</a>; <a href='/AIV/43/8/39'>John 8:39</a>",
      "comment": "Paul emphasizes spiritual kinship to Abraham through faith, which transcends ethnic background."
    },
    {
      "pk": 350308,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 8,
      "text": "And the Scripture, foreseeing that God would justify the Gentiles by faith, preached the gospel beforehand to Abraham, saying, ‘In you all the nations will be blessed.’",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>",
      "comment": "Genesis foretold the global scope of God’s plan, fulfilled in Christ and the Church’s universality."
    },
    {
      "pk": 350309,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 9,
      "text": "So then, those who have faith are blessed along with Abraham, the man of faith.",
      "links": "<a href='/AIV/58/11/6'>Heb. 11:6</a>",
      "comment": "Believers share the blessing promised to Abraham, by virtue of their faith."
    },
    {
      "pk": 350310,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 10,
      "text": "For all who rely on works of the law are under a curse, for it is written, ‘Cursed is everyone who does not continue in all things written in the book of the law, to do them.’",
      "links": "<a href='/AIV/5/27/26'>Deut. 27:26</a>",
      "comment": "Paul cites Deuteronomy, showing the impossibility of perfect law-keeping resulting in a curse, not salvation."
    },
    {
      "pk": 350311,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 11,
      "text": "Now it is evident that no one is justified before God by the law, for, ‘The righteous shall live by faith.’",
      "links": "<a href='/AIV/35/2/4'>Hab. 2:4</a>; <a href='/AIV/45/1/17'>Rom. 1:17</a>",
      "comment": "Paul combines testimony from Habakkuk and Romans to show the centrality of faith for justification from the Old Testament forward."
    },
    {
      "pk": 350312,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 12,
      "text": "But the law is not based on faith; on the contrary, 'The one who does them shall live by them.'",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>",
      "comment": "Paul shows the law’s focus is on doing, not believing, contrasting legalism and faith."
    },
    {
      "pk": 350313,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 13,
      "text": "Christ redeemed us from the curse of the law by becoming a curse for us—because it is written, ‘Cursed is everyone who is hanged on a tree.’",
      "links": "<a href='/AIV/5/21/23'>Deut. 21:23</a>; <a href='/AIV/60/2/24'>1 Pet. 2:24</a>",
      "comment": "By taking the curse upon Himself, Christ fully atones for sin through His crucifixion (substitutionary atonement)."
    },
    {
      "pk": 350314,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 14,
      "text": "He did this so that the blessing of Abraham might come to the Gentiles in Christ Jesus, so that we might receive the promised Spirit through faith.",
      "links": "<a href='/AIV/44/10/45'>Acts 10:45</a>",
      "comment": "Christ’s work opens the blessings of Abraham to all nations, and faith brings the indwelling Spirit."
    },
    {
      "pk": 350315,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 15,
      "text": "Brothers and sisters, even with a human covenant no one annuls it or adds to it once it has been ratified.",
      "links": "<a href='/AIV/58/9/17'>Heb. 9:17</a>",
      "comment": "Paul illustrates God’s unchangeable promises by analogy to human covenants, stressing divine fidelity."
    },
    {
      "pk": 350316,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 16,
      "text": "Now the promises were spoken to Abraham and to his seed. He does not say, ‘and to seeds,’ as if referring to many, but to one, ‘and to your seed’—who is Christ.",
      "links": "<a href='/AIV/1/22/18'>Gen. 22:18</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>",
      "comment": "Paul emphasizes Christ as the fulfillment of God’s singular promise to Abraham."
    },
    {
      "pk": 350317,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 17,
      "text": "What I mean is this: the law, which came four hundred thirty years later, does not annul a covenant previously ratified by God, so as to make the promise void.",
      "links": "<a href='/AIV/2/12/40'>Exod. 12:40</a>",
      "comment": "God’s promise to Abraham precedes and surpasses the law of Moses, showing faith’s primacy."
    },
    {
      "pk": 350318,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 18,
      "text": "For if the inheritance comes by the law, it no longer comes by promise; but God gave it to Abraham by a promise.",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>",
      "comment": "Divine inheritance is gifted through God’s promise, not earned by Law."
    },
    {
      "pk": 350319,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 19,
      "text": "Why then the law? It was added because of transgressions, until the seed should come to whom the promise was made, ordained through angels by the hand of a mediator.",
      "links": "<a href='/AIV/5/33/2'>Deut. 33:2</a>; <a href='/AIV/44/7/53'>Acts 7:53</a>",
      "comment": "Paul explains the law’s temporary role until Christ arrives, and notes angelic mediation—pointing to the law as preparatory, not ultimate."
    },
    {
      "pk": 350320,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 20,
      "text": "Now a mediator is not for one party alone, but God is one.",
      "links": "<a href='/AIV/54/2/5'>1 Tim. 2:5</a>; <a href='/AIV/5/6/4'>Deut. 6:4</a>",
      "comment": "Paul distinguishes God’s unique unity and direct involvement versus mediated law-giving. In theology, Christ is later described as the sole mediator (1 Tim 2:5)."
    },
    {
      "pk": 350321,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 21,
      "text": "Is the law then against the promises of God? Certainly not! For if a law had been given which could give life, then righteousness would truly be by the law.",
      "links": "<a href='/AIV/45/7/7'>Rom. 7:7</a>",
      "comment": "Paul affirms the law’s purpose without denying God’s promise; true life and righteousness come from faith, not law."
    },
    {
      "pk": 350322,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 22,
      "text": "But Scripture imprisoned everything under sin, so that the promise by faith in Jesus Christ might be given to those who believe.",
      "links": "<a href='/AIV/45/3/9-23'>Rom. 3:9–23</a>",
      "comment": "Scripture’s testimony of universal sinfulness leads to the blessing of faith in Christ—the basis of justification for all believers."
    },
    {
      "pk": 350323,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 23,
      "text": "Before faith came, we were held captive under the law, imprisoned until the coming of faith would be revealed.",
      "links": "<a href='/AIV/45/7/6'>Rom. 7:6</a>",
      "comment": "Paul frames the law as a custodian awaiting the revelation of authentic faith, fulfilled in Christ’s coming."
    },
    {
      "pk": 350324,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 24,
      "text": "So then, the law was our guardian until Christ came, so that we might be justified by faith.",
      "links": "<a href='/AIV/45/10/4'>Rom. 10:4</a>",
      "comment": "Paul’s metaphor of the law as a ‘guardian’ (Greek: paidagogos) suggests guidance and preparation until Christ."
    },
    {
      "pk": 350325,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 25,
      "text": "But now that faith has come, we are no longer under a guardian.",
      "links": "<a href='/AIV/54/1/9'>1 Tim. 1:9</a>",
      "comment": "Paul marks a new era: direct relationship with God through faith, no longer mediated by the law."
    },
    {
      "pk": 350326,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 26,
      "text": "For you are all children of God through faith in Christ Jesus.",
      "links": "<a href='/AIV/43/1/12-13'>John 1:12–13</a>",
      "comment": "Baptism into Christ brings adoption as God’s children, presenting a high view of the sacraments as a means of grace."
    },
    {
      "pk": 350327,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 27,
      "text": "For all of you who were baptized into Christ have put on Christ.",
      "links": "<a href='/AIV/45/6/3-4'>Rom. 6:3–4</a>",
      "comment": "Paul points to sacramental baptism as transformative, spiritually clothing believers with Christ—a classic support for the practice’s efficacy."
    },
    {
      "pk": 350328,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 28,
      "text": "There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female; for you are all one in Christ Jesus.",
      "links": "<a href='/AIV/51/3/11'>Col. 3:11</a>",
      "comment": "Christian unity transcends social and ethnic divisions, indicating the universal call to holiness and belonging in the one Church."
    },
    {
      "pk": 350329,
      "translation": "AIV",
      "book": 9,
      "chapter": 3,
      "verse": 29,
      "text": "And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/1/22/18'>Gen. 22:18</a>",
      "comment": "Belonging to Christ makes believers true heirs, fulfilling God’s ancient promise to Abraham spiritually and corporately through the body of Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:51:37.130Z"
}