{
  "book": "Galatians",
  "bookAbbreviation": "Gal",
  "chapter": 4,
  "verses": [
    {
      "pk": 2004001,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 1,
      "text": "I mean that as long as the heir is a child, he is no different from a servant, even though he is lord of all.",
      "links": "<a href='/AIV/48/3/23-29'>Gal. 3:23–29</a>; <a href='/AIV/1/25/23'>Gen. 25:23</a>",
      "comment": "Paul uses the analogy of inheritance to show spiritual immaturity before Christ. This builds on the previous chapter’s teaching about faith surpassing the old Law."
    },
    {
      "pk": 2004002,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 2,
      "text": "But he is under guardians and managers until the date set by his father.",
      "links": "<a href='/AIV/48/3/24'>Gal. 3:24</a>",
      "comment": "This emphasizes divine timing in receiving the fullness of spiritual inheritance. The parallel hints at spiritual guidance and authority in faith."
    },
    {
      "pk": 2004003,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 3,
      "text": "In the same way, when we were children, we were enslaved under the elementary principles of the world.",
      "links": "<a href='/AIV/51/2/8'>Col. 2:8</a>; <a href='/AIV/48/4/9'>Gal. 4:9</a>",
      "comment": "Paul refers to spiritual childhood as bondage to external rites and the law, further clarified later in the chapter."
    },
    {
      "pk": 2004004,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 4,
      "text": "But when the fullness of time had come, God sent His Son, born of a woman, born under the law,",
      "links": "<a href='/AIV/40/1/22-23'>Matt. 1:22–23</a>; <a href='/AIV/23/7/14'>Isa. 7:14</a>",
      "comment": "Paul affirms the incarnation: Christ, truly God and truly man, enters history. See the fulfillment in Isaiah 7:14. The mention of ‘born under the law’ underscores Christ’s complete identification with humanity in its need for redemption."
    },
    {
      "pk": 2004005,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 5,
      "text": "in order to redeem those under the law, so that we might receive adoption as sons.",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/45/8/15'>Rom. 8:15</a>",
      "comment": "Through Christ’s work, believers become sons by adoption, sharing a new spiritual status. This shows the unique family relationship given by God, not merely symbolic but real participation in divine life."
    },
    {
      "pk": 2004006,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 6,
      "text": "And because you are sons, God has sent the Spirit of His Son into our hearts, crying, 'Abba, Father!'",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/41/14/36'>Mark 14:36</a>",
      "comment": "The intimate ‘Abba’ points to a close, son-like relationship with God, expressing the reality of the Spirit’s indwelling. This intimacy surpasses simple legal righteousness; it’s transformative."
    },
    {
      "pk": 2004007,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 7,
      "text": "So you are no longer a servant, but a son; and if a son, then an heir through God.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/48/3/29'>Gal. 3:29</a>",
      "comment": "Paul transitions from servanthood to sonship—a profound change in relational status, inheriting eternal blessings."
    },
    {
      "pk": 2004008,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 8,
      "text": "Formerly, when you did not know God, you were enslaved to those who by nature are not gods.",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>; <a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "Paul references pagan idolatry—false worship and bondage. Spiritual liberation is a major theme."
    },
    {
      "pk": 2004009,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 9,
      "text": "But now that you have come to know God—or rather, to be known by God—how can you turn back again to the weak and worthless elementary principles of the world, whose slaves you wish to be once more?",
      "links": "<a href='/AIV/51/2/20'>Col. 2:20</a>",
      "comment": "The phrase highlights not only knowing God but being known by Him, with an emphasis on divine initiative and calling."
    },
    {
      "pk": 2004010,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 10,
      "text": "You observe days and months and seasons and years.",
      "links": "<a href='/AIV/45/14/5'>Rom. 14:5</a>; <a href='/AIV/51/2/16'>Col. 2:16</a>",
      "comment": "Paul critiques returning to ritual observances, warning against trusting in external practices rather than Christ."
    },
    {
      "pk": 2004011,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 11,
      "text": "I am afraid for you, that perhaps I have labored over you in vain.",
      "links": "",
      "comment": "Paul’s pastoral concern expresses the seriousness of turning from gospel freedom to legalism."
    },
    {
      "pk": 2004012,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 12,
      "text": "Brothers, I beg you, become as I am, for I also have become as you are. You did me no wrong.",
      "links": "<a href='/AIV/1/9/22'>1 Cor. 9:22</a>",
      "comment": "Paul’s invitation is personal, urging mutual humility and empathy for spiritual growth."
    },
    {
      "pk": 2004013,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 13,
      "text": "You know it was because of an illness that I first preached the gospel to you.",
      "links": "",
      "comment": "Paul’s providential suffering was used for spreading the gospel, echoing the theme that God uses weakness for His purpose."
    },
    {
      "pk": 2004014,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 14,
      "text": "And even though my condition was a trial to you, you did not despise me or reject me; instead, you received me as an angel of God, as Christ Jesus Himself.",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>",
      "comment": "Paul equates their welcome with receiving Christ, emphasizing the dignity and spiritual authority of gospel ministers."
    },
    {
      "pk": 2004015,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 15,
      "text": "What has happened to your blessedness? For I testify that, if possible, you would have plucked out your own eyes and given them to me.",
      "links": "",
      "comment": "Paul recalls their original joy and devotion, urging self-sacrificial love among believers."
    },
    {
      "pk": 2004016,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 16,
      "text": "So have I now become your enemy by telling you the truth?",
      "links": "<a href='/AIV/43/8/40'>John 8:40</a>",
      "comment": "The challenge of truth in love: faithful teaching can provoke opposition, but remains necessary."
    },
    {
      "pk": 2004017,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 17,
      "text": "They make much of you, but not sincerely; they want to exclude you, so that you will seek them.",
      "links": "",
      "comment": "Paul critiques false teachers who manipulate by exclusion and flattery, a warning against division."
    },
    {
      "pk": 2004018,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 18,
      "text": "It is good to be zealous in a good thing always, and not only when I am present with you.",
      "links": "",
      "comment": "True zeal for goodness should persist even without spiritual leaders present, reflecting authentic discipleship."
    },
    {
      "pk": 2004019,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 19,
      "text": "My children, for whom I am again in pain of childbirth until Christ is formed in you—",
      "links": "<a href='/AIV/49/4/13'>Eph. 4:13</a>",
      "comment": "Paul depicts a spiritual process as birthing Christ within believers—an image of transformation through inward grace rather than outward observance."
    },
    {
      "pk": 2004020,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 20,
      "text": "I wish I could be present with you now and change my tone, because I am perplexed about you.",
      "links": "",
      "comment": "Paul expresses pastoral longing—a desire for personal guidance and unity. Note the importance of spiritual direction."
    },
    {
      "pk": 2004021,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 21,
      "text": "Tell me, you who want to be under the law, do you not hear the law?",
      "links": "<a href='/AIV/1/21/10-12'>Gen. 21:10–12</a>",
      "comment": "Paul appeals directly to Scripture, exposing misunderstanding among those clinging to the law."
    },
    {
      "pk": 2004022,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 22,
      "text": "For it is written that Abraham had two sons, one by the slave woman and one by the free woman.",
      "links": "<a href='/AIV/1/16/15'>Gen. 16:15</a>; <a href='/AIV/1/21/2'>Gen. 21:2</a>",
      "comment": "Paul invokes Genesis history to illustrate spiritual truths—origin of two covenants, showing continuity with Old Testament revelation."
    },
    {
      "pk": 2004023,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 23,
      "text": "But the son of the slave woman was born according to the flesh, and the son of the free woman through promise.",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/1/18/10'>Gen. 18:10</a>",
      "comment": "The promise distinguishes divine election from mere human effort. Spiritual inheritance comes not by flesh, but by grace."
    },
    {
      "pk": 2004024,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 24,
      "text": "Now this may be interpreted allegorically: these women are two covenants. One is from Mount Sinai, bearing children for slavery; she is Hagar.",
      "links": "<a href='/AIV/2/19/3'>Ex. 19:3</a>",
      "comment": "Paul distinguishes between covenants—law (bondage) and promise (freedom), showing a deeper spiritual reading alongside the literal."
    },
    {
      "pk": 2004025,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 25,
      "text": "Now Hagar represents Mount Sinai in Arabia, and she corresponds to the present Jerusalem, for she is in slavery with her children.",
      "links": "<a href='/AIV/2/19/23'>Ex. 19:23</a>",
      "comment": "Paul contrasts earthly Jerusalem, tied to the law, with spiritual inheritance—implying a new spiritual city and worship."
    },
    {
      "pk": 2004026,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 26,
      "text": "But the Jerusalem above is free, and she is our mother.",
      "links": "<a href='/AIV/58/12/22'>Heb. 12:22</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "Paul introduces the concept of the heavenly city, emphasizing spiritual birth and family, subtly implying both visible and mystical unity among believers."
    },
    {
      "pk": 2004027,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 27,
      "text": "For it is written: 'Rejoice, barren woman who does not bear; break forth and shout, you who are not in labor! For the children of the desolate one will be more than those of her who has a husband.'",
      "links": "<a href='/AIV/23/54/1'>Isa. 54:1</a>",
      "comment": "Isaiah’s prophecy foreshadows the expansion of God’s people beyond Israel, forming a unified spiritual community."
    },
    {
      "pk": 2004028,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 28,
      "text": "Now you, brothers, like Isaac, are children of promise.",
      "links": "<a href='/AIV/1/21/12'>Gen. 21:12</a>; <a href='/AIV/45/9/8'>Rom. 9:8</a>",
      "comment": "Believers inherit through God’s promise, not by lineage—emphasizing the role of divine calling and spiritual rebirth."
    },
    {
      "pk": 2004029,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 29,
      "text": "But as then, the one born according to the flesh persecuted the one born according to the Spirit, so it is now.",
      "links": "<a href='/AIV/1/21/9'>Gen. 21:9</a>",
      "comment": "Paul observes the historical conflict as spiritually ongoing—flesh opposed to Spirit. This hints at visible and invisible struggles in faith life."
    },
    {
      "pk": 2004030,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 30,
      "text": "But what does the Scripture say? 'Cast out the slave woman and her son, for the son of the slave woman shall not inherit with the son of the free woman.'",
      "links": "<a href='/AIV/1/21/10'>Gen. 21:10</a>",
      "comment": "Separation is necessary to preserve spiritual inheritance; this marks a spiritual distinction, not mere exclusion."
    },
    {
      "pk": 2004031,
      "translation": "AIV",
      "book": 48,
      "chapter": 4,
      "verse": 31,
      "text": "So, brothers, we are not children of the slave woman, but of the free woman.",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>",
      "comment": "Paul concludes by affirming freedom in Christ and promise—as sons, not servants. Belonging to the unified household of faith is the outcome."
    }
  ],
  "translatedAt": "2025-12-23T03:52:01.997Z"
}