{
  "book": 62,
  "bookName": "2 Timothy",
  "bookAbbreviation": "2Tim",
  "chapter": 4,
  "verses": [
    {
      "pk": 62004001,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 1,
      "text": "I solemnly charge you before God and Christ Jesus, who will judge the living and the dead, and by his appearing and his kingdom:",
      "links": "<a href='/AIV/45/14/10'>Rom. 14:10</a>; <a href='/AIV/46/4/5'>1 Cor. 4:5</a>; <a href='/AIV/58/9/27-28'>Heb. 9:27-28</a>",
      "comment": "Paul invokes the authority of God and Christ as Judge, emphasizing the seriousness of Timothy's commission. 'Appearing' (Greek: epiphaneia) and 'kingdom' look forward to Christ's return in glory. The recognition of a final judgment links to a belief in bodily resurrection and accountability before God."
    },
    {
      "pk": 62004002,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 2,
      "text": "Preach the word; be ready in season and out of season; reprove, rebuke, and encourage, with all patience and teaching.",
      "links": "<a href='/AIV/51/4/2'>Col. 4:2</a>; <a href='/AIV/56/1/9'>Titus 1:9</a>",
      "comment": "'Preach the word' stresses the primacy and continued mission of publicly proclaiming the message, not opinion. The call to be persistent and use all forms of correction and encouragement shows that the transmission of correct doctrine must always continue, initiated by proper authority."
    },
    {
      "pk": 62004003,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 3,
      "text": "For the time will come when people will not put up with sound teaching, but according to their own desires, they will gather teachers to suit themselves, having itching ears.",
      "links": "<a href='/AIV/54/1/10'>1 Tim. 1:10</a>; <a href='/AIV/55/1/4-7'>2 Tim. 1:4-7</a>",
      "comment": "Paul warns of a coming time of doctrinal instability when people pursue teaching that pleases rather than sanctifies—an enduring concern for apostolic unity and the importance of holding fast to the original, true faith."
    },
    {
      "pk": 62004004,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 4,
      "text": "And they will turn away their ears from the truth and turn aside to myths.",
      "links": "<a href='/AIV/56/1/14'>Titus 1:14</a>; <a href='/AIV/54/4/1'>1 Tim. 4:1</a>",
      "comment": "'Myths' points to invented doctrines and fables outside the authentic tradition. This underlines the necessity of remaining in the community that holds the apostolic deposit of faith."
    },
    {
      "pk": 62004005,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 5,
      "text": "But you, be sober in all things, endure hardship, do the work of an evangelist, fulfill your ministry.",
      "links": "<a href='/AIV/49/4/11'>Eph. 4:11</a>; <a href='/AIV/54/4/5-6'>1 Tim. 4:5-6</a>",
      "comment": "Timothy is called to complete the ministry handed down to him—a model for the ongoing office of apostolic leadership. Perseverance in right teaching and sacrificial service is vital for authentic Christian leadership."
    },
    {
      "pk": 62004006,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 6,
      "text": "For I am already being poured out as a drink offering, and the time of my departure is at hand.",
      "links": "<a href='/AIV/50/2/17'>Phil. 2:17</a>; <a href='/AIV/04/28/24'>Num. 28:24</a>",
      "comment": "Paul likens his coming death to a sacrificial offering, echoing Old Testament temple worship. His willingness to be poured out reflects Christ's own sacrificial love (see <a href='/AIV/40/26/28'>Matt. 26:28</a>)."
    },
    {
      "pk": 62004007,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 7,
      "text": "I have fought the good fight, I have finished the race, I have kept the faith.",
      "links": "<a href='/AIV/46/9/24-25'>1 Cor. 9:24-25</a>; <a href='/AIV/58/12/1-2'>Heb. 12:1-2</a>",
      "comment": "Paul’s language of spiritual combat and athletic perseverance implies a life of discipline and perseverance. 'Kept the faith' shows the significance of remaining steadfast in the faith received, not innovating, but holding to what was handed down (tradition)."
    },
    {
      "pk": 62004008,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 8,
      "text": "From now on there is laid up for me the crown of righteousness, which the Lord, the righteous Judge, will award to me on that day—and not only to me, but to all who have longed for his appearing.",
      "links": "<a href='/AIV/59/1/12'>James 1:12</a>; <a href='/AIV/60/5/4'>1 Peter 5:4</a>",
      "comment": "'Crown of righteousness' recalls reward for fidelity. Paul’s assurance speaks to the glory awaiting all who persevere in faith and love for Christ’s coming. The theme of reward for finishing the race echoes throughout the apostolic writings and encourages hope."
    },
    {
      "pk": 62004009,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 9,
      "text": "Make every effort to come to me quickly,",
      "links": "<a href='/AIV/55/1/4'>2 Tim. 1:4</a>",
      "comment": "Paul’s desire for Timothy’s presence in his final days highlights the importance of personal fellowship and the unity of workers in the gospel."
    },
    {
      "pk": 62004010,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 10,
      "text": "for Demas, in love with this present world, has deserted me and gone to Thessalonica. Crescens has gone to Galatia, Titus to Dalmatia.",
      "links": "<a href='/AIV/51/4/14'>Col. 4:14</a>; <a href='/AIV/56/1/4'>Titus 1:4</a>",
      "comment": "Demas’s desertion out of worldly attraction serves as a caution against love for temporal things. The reference to others sent out highlights the structure and mission of the early church, where leaders were often sent out with apostolic authority."
    },
    {
      "pk": 62004011,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 11,
      "text": "Only Luke is with me. Get Mark and bring him with you, for he is helpful to me in ministry.",
      "links": "<a href='/AIV/51/4/10-14'>Col. 4:10-14</a>; <a href='/AIV/44/12/25'>Acts 12:25</a>",
      "comment": "Paul’s restoration of Mark after earlier dispute (see <a href='/AIV/44/15/37-39'>Acts 15:37–39</a>) demonstrates forgiveness and reconciliation. The mention of ministry (‘diakonia’) stresses participation in the ongoing sacramental ministry established in the apostolic age."
    },
    {
      "pk": 62004012,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 12,
      "text": "Tychicus I have sent to Ephesus.",
      "links": "<a href='/AIV/51/4/7'>Col. 4:7</a>; <a href='/AIV/49/6/21-22'>Eph. 6:21-22</a>",
      "comment": "Tychicus was well trusted as a messenger and stand-in for Paul in various regions, demonstrating the need for organized leaders in the wider Christian community."
    },
    {
      "pk": 62004013,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 13,
      "text": "When you come, bring the cloak that I left with Carpus at Troas, and the books, especially the parchments.",
      "links": "<a href='/AIV/44/20/5-6'>Acts 20:5-6</a>",
      "comment": "Paul’s practical concern for his cloak and writings shows the importance of both physical care and the value of written materials—possibly early Christian writings and parts of the Scriptures themselves."
    },
    {
      "pk": 62004014,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 14,
      "text": "Alexander the coppersmith did me much harm; the Lord will repay him according to his deeds.",
      "links": "<a href='/AIV/45/12/19'>Rom. 12:19</a>",
      "comment": "Entrusting judgment to God reflects Christ’s teaching about forgiveness and divine justice, not seeking personal revenge. The apostolic community maintained discipline, separating those who defied sound doctrine or authority."
    },
    {
      "pk": 62004015,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 15,
      "text": "You too should be on guard against him, for he strongly opposed our message.",
      "links": "<a href='/AIV/54/1/20'>1 Tim. 1:20</a>",
      "comment": "Maintaining vigilance against those who resist the apostolic faith is necessary for the good of the community. Paul’s personal warning encourages Timothy to defend sound teaching against error."
    },
    {
      "pk": 62004016,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 16,
      "text": "At my first defense, no one stood by me, but everyone deserted me. May it not be counted against them.",
      "links": "<a href='/AIV/44/22/30'>Acts 22:30</a>; <a href='/AIV/42/23/34'>Luke 23:34</a>",
      "comment": "Paul’s prayer echoes Christ’s own words on the cross, showing the highest model of forgiveness. This witness of forgiving betrayal advances the unity of the faith and recalls the necessity of reconciliation in the body of believers."
    },
    {
      "pk": 62004017,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 17,
      "text": "But the Lord stood by me and gave me strength, so that through me the message might be fully proclaimed and all the Gentiles might hear. And I was delivered out of the lion's mouth.",
      "links": "<a href='/AIV/44/23/11'>Acts 23:11</a>; <a href='/AIV/19/22/21'>Ps. 22:21</a>",
      "comment": "'The lion's mouth' may recall Daniel’s deliverance (<a href='/AIV/27/6/22'>Dan. 6:22</a>) or symbolize danger and opposition. God’s providence sustains apostolic ministry and ensures the gospel’s universal proclamation."
    },
    {
      "pk": 62004018,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 18,
      "text": "The Lord will rescue me from every evil deed and will bring me safely into his heavenly kingdom. To him be glory forever and ever. Amen.",
      "links": "<a href='/AIV/47/1/10'>2 Cor. 1:10</a>; <a href='/AIV/40/6/13'>Matt. 6:13</a>",
      "comment": "Paul expresses final confidence in God's saving power. The 'heavenly kingdom' theme points to the hope of eternal life, a fulfillment of God’s promises to the faithful."
    },
    {
      "pk": 62004019,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 19,
      "text": "Greet Prisca and Aquila, and the household of Onesiphorus.",
      "links": "<a href='/AIV/44/18/2'>Acts 18:2</a>; <a href='/AIV/55/1/16'>2 Tim. 1:16</a>",
      "comment": "Personal greetings underline the deep familial and communal character of the Christian community. The mention of entire households hints at the communal and sacramental structure of the early gatherings."
    },
    {
      "pk": 62004020,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 20,
      "text": "Erastus stayed in Corinth, and I left Trophimus sick in Miletus.",
      "links": "<a href='/AIV/44/19/22'>Acts 19:22</a>; <a href='/AIV/44/21/29'>Acts 21:29</a>",
      "comment": "The brief reports tie together different missionary journeys and leaders, showing the interconnectedness and delegation among apostolic coworkers."
    },
    {
      "pk": 62004021,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 21,
      "text": "Do your best to come before winter. Eubulus greets you, as do Pudens and Linus and Claudia and all the brothers.",
      "links": "<a href='/AIV/60/5/13'>1 Pet. 5:13</a>",
      "comment": "Paul’s mention of these believers, especially Linus, who early tradition places as a leader of the church in Rome, hints at the continuity of leadership after the apostles."
    },
    {
      "pk": 62004022,
      "translation": "AIV",
      "book": 62,
      "bookName": "2 Timothy",
      "bookAbbreviation": "2Tim",
      "chapter": 4,
      "verse": 22,
      "text": "The Lord be with your spirit. Grace be with you all.",
      "links": "<a href='/AIV/54/6/21'>1 Tim. 6:21</a>; <a href='/AIV/48/6/18'>Gal. 6:18</a>",
      "comment": "Paul closes with a double blessing. The communal 'you all' echoes his universal hope for the believers. Prayer for the Lord’s presence and grace highlights the life of faith and unity the apostolic church sought to foster, a unity essential to the true faith."
    }
  ],
  "translatedAt": "2025-12-24T12:14:53.662Z"
}