{
  "book": "2 Timothy",
  "bookAbbreviation": "2Tim",
  "chapter": 3,
  "verses": [
    {
      "pk": 4203001,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 1,
      "text": "But know this: In the last days, difficult times will come.",
      "links": "<a href='/AIV/40/24/12'>Matt. 24:12</a>; <a href='/AIV/54/4/1'>1 Tim. 4:1</a>",
      "comment": "Paul warns Timothy that troubling times are expected before the end, connecting with Jesus’ own teachings about increasing lawlessness."
    },
    {
      "pk": 4203002,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 2,
      "text": "For people will be lovers of self, lovers of money, boastful, proud, abusive, disobedient to parents, ungrateful, and unholy.",
      "links": "<a href='/AIV/45/1/30'>Rom. 1:30</a>",
      "comment": "Paul lists sins that point to the moral corruption in society—a theme echoed elsewhere in his letters (see also Romans 1)."
    },
    {
      "pk": 4203003,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 3,
      "text": "Without natural affection, unforgiving, slanderers, without self-control, brutal, not loving good,",
      "links": "<a href='/AIV/56/1/12'>Titus 1:12</a>",
      "comment": "A depiction of increasing corrupt behavior, describing those who reject goodness. This is a warning about the dangers of severed relationships and a call to self-mastery."
    },
    {
      "pk": 4203004,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 4,
      "text": "treacherous, reckless, conceited, lovers of pleasure rather than lovers of God,",
      "links": "<a href='/AIV/50/3/19'>Phil. 3:19</a>",
      "comment": "Paul sharpens the contrast between devotion to God versus self-indulgence. This foreshadows the spiritual crisis within the community."
    },
    {
      "pk": 4203005,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 5,
      "text": "having a form of godliness but denying its power. Avoid such people.",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/56/1/16'>Titus 1:16</a>",
      "comment": "Paul distinguishes external religion from true faith empowered by God, warning against hypocrisy. True faith is shown by the transformative power at work within believers."
    },
    {
      "pk": 4203006,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 6,
      "text": "For among them are those who creep into households and capture weak women, burdened with sins and led astray by various desires,",
      "links": "<a href='/AIV/55/2/26'>2 Tim. 2:26</a>",
      "comment": "Paul describes deceivers targeting the vulnerable, cautioning against spiritual manipulation. Note the importance of sound doctrine and protection of the flock."
    },
    {
      "pk": 4203007,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 7,
      "text": "always learning and never able to come to the knowledge of the truth.",
      "links": "<a href='/AIV/56/1/14'>Titus 1:14</a>",
      "comment": "Paul critiques endless teaching apart from truth, hinting at the necessity for authoritative teaching and the need for unity in doctrine."
    },
    {
      "pk": 4203008,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 8,
      "text": "Just as Jannes and Jambres opposed Moses, so also these men oppose the truth—men corrupted in mind and rejected concerning the faith.",
      "links": "<a href='/AIV/2/7/11'>Ex. 7:11–12</a>",
      "comment": "Refers to traditional names given to Pharaoh’s magicians. The parallel highlights ongoing resistance to God’s chosen instruments."
    },
    {
      "pk": 4203009,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 9,
      "text": "But they will not progress much further, for their folly will be obvious to all, as was the folly of those men.",
      "links": "<a href='/AIV/2/8/18-19'>Ex. 8:18-19</a>",
      "comment": "Ultimately, all falsehood is exposed. The community can trust in God’s providential protection of the truth."
    },
    {
      "pk": 4203010,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 10,
      "text": "But you have closely followed my teaching, my way of life, purpose, faith, patience, love, and endurance,",
      "links": "<a href='/AIV/54/4/6'>1 Tim. 4:6</a>",
      "comment": "Timothy is encouraged to imitate Paul’s holistic discipleship—teaching and personal example. Christian leadership transmits the apostolic faith by both word and witness."
    },
    {
      "pk": 4203011,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 11,
      "text": "my persecutions, and sufferings—what happened to me at Antioch, at Iconium, and at Lystra. I endured these persecutions, and out of them all the Lord rescued me.",
      "links": "<a href='/AIV/44/13/14'>Acts 13:14</a>; <a href='/AIV/44/14/19-20'>Acts 14:19-20</a>",
      "comment": "Paul reminds Timothy of his own suffering for the faith, echoing Jesus’ suffering and the promise of perseverance (see also Matt. 5:11-12). The Lord’s deliverance demonstrates His faithfulness."
    },
    {
      "pk": 4203012,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 12,
      "text": "Indeed, all who desire to live godly lives in Christ Jesus will be persecuted.",
      "links": "<a href='/AIV/40/10/22'>Matt. 10:22</a>; <a href='/AIV/43/15/20'>John 15:20</a>",
      "comment": "Suffering is the ordinary path for the faithful, uniting believers with Christ. This is a mark of authenticity for true disciples (cf. John 15:20)."
    },
    {
      "pk": 4203013,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 13,
      "text": "But evil people and impostors will go from bad to worse, deceiving and being deceived.",
      "links": "<a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "Paul predicts the persistence of deception until Christ’s return. The call is to vigilance and perseverance in the truth."
    },
    {
      "pk": 4203014,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 14,
      "text": "But as for you, continue in what you have learned and firmly believed, knowing from whom you learned it,",
      "links": "<a href='/AIV/55/1/13'>2 Tim. 1:13</a>",
      "comment": "Timothy is urged to hold fast to the tradition handed down to him—passed on faithfully through those before him. The importance of apostolic teaching is key for the unity of the Church."
    },
    {
      "pk": 4203015,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 15,
      "text": "and how from childhood you have known the sacred writings, which are able to make you wise for salvation through faith in Christ Jesus.",
      "links": "<a href='/AIV/19/119/98-100'>Ps. 119:98-100</a>",
      "comment": "Here, 'sacred writings' refers to the Scriptures received from the beginning. These point toward salvation fulfilled in Christ. The role of Scripture in passing on faith is highlighted, but also its need for faithful interpretation."
    },
    {
      "pk": 4203016,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 16,
      "text": "All Scripture is breathed out by God and is useful for teaching, for reproof, for correction, and for training in righteousness,",
      "links": "<a href='/AIV/61/1/20-21'>2 Pet. 1:20-21</a>; <a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "Paul affirms the divine inspiration of all Scripture, showing its value for building up believers. The teaching, correction, and training suggest the need for an authoritative guiding interpretation to guard against error."
    },
    {
      "pk": 4203017,
      "translation": "AIV",
      "book": 55,
      "chapter": 3,
      "verse": 17,
      "text": "so that the man of God may be complete, equipped for every good work.",
      "links": "<a href='/AIV/49/2/10'>Eph. 2:10</a>",
      "comment": "The goal of Scripture is practical holiness and readiness for service. Good works, prepared by God, are the fruit of true faith. Formation in both Scripture and tradition leads to a mature, well-equipped believer."
    }
  ],
  "translatedAt": "2025-12-23T04:04:28.042Z"
}