{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 16,
  "verses": [
    {
      "pk": 33016001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 1,
      "text": "The word of the LORD came to me again:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "A frequent phrase in Ezekiel, signaling a new prophetic message directly from God."
    },
    {
      "pk": 33016002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 2,
      "text": "\"Son of man, make known to Jerusalem her abominations,",
      "links": "<a href='/AIV/26/20/4'>Ezek. 20:4</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "God calls Ezekiel to publicly confront Jerusalem (His people) about their sins. 'Son of man' emphasizes Ezekiel's role as a representative of humanity."
    },
    {
      "pk": 33016003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 3,
      "text": "and say, ‘This is what the Lord GOD says to Jerusalem: Your origin and your birth were in the land of the Canaanites; your father was an Amorite and your mother a Hittite.",
      "links": "<a href='/AIV/01/10/15-16'>Gen. 10:15-16</a>; <a href='/AIV/07/1/21'>Judg. 1:21</a>",
      "comment": "The ancestry of Jerusalem is depicted allegorically, highlighting its humble, even pagan roots. This contrasts with later adoption and election by God."
    },
    {
      "pk": 33016004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 4,
      "text": "As for your birth, on the day you were born your navel cord was not cut, nor were you washed with water to cleanse you; you were not rubbed with salt, nor wrapped in cloths.",
      "links": "<a href='/AIV/42/2/7'>Luke 2:7</a>; <a href='/AIV/03/12/3'>Lev. 12:3</a>",
      "comment": "God describes Jerusalem's original state — neglected and unwanted, which underscores God’s gratuitous love and mercy."
    },
    {
      "pk": 33016005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 5,
      "text": "No eye pitied you, to do any of these things for you out of compassion, but you were thrown out into the open field, for you were despised on the day you were born.",
      "links": "<a href='/AIV/19/27/10'>Ps. 27:10</a>",
      "comment": "A metaphor for abandonment, echoing Israel's humble beginnings and reminding us of God's compassion in adopting His people."
    },
    {
      "pk": 33016006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 6,
      "text": "\"When I passed by and saw you kicking and lying in your blood, I said to you in your blood, 'Live!' Yes, I said to you in your blood, 'Live!'\"",
      "links": "<a href='/AIV/26/37/4-6'>Ezek. 37:4-6</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "God’s sovereign intervention and life-giving word. Echoes resurrection imagery and prefigures spiritual rebirth."
    },
    {
      "pk": 33016007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 7,
      "text": "I made you grow like a plant in the field. You grew up and became tall and reached full maturity. Your breasts were formed and your hair had grown, yet you were still naked and bare.",
      "links": "<a href='/AIV/23/5/1-2'>Isa. 5:1-2</a>",
      "comment": "Israel’s growth and development under God’s care. The nakedness emphasizes vulnerability before divine protection and dignity."
    },
    {
      "pk": 33016008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 8,
      "text": "\"Then I passed by you and saw you, and behold, you were at the time for love. So I spread the corner of my garment over you and covered your nakedness. I swore to you and entered into a covenant with you,\" declares the Lord GOD, \"and you became Mine.",
      "links": "<a href='/AIV/08/3/9'>Ruth 3:9</a>; <a href='/AIV/02/6/7'>Exod. 6:7</a>",
      "comment": "Marriage imagery for God's covenant. Spreading a garment symbolizes protection and union. The covenant is the foundation of God’s relationship with His people."
    },
    {
      "pk": 33016009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 9,
      "text": "Then I washed you with water, cleaned off your blood from you, and anointed you with oil.",
      "links": "<a href='/AIV/03/8/12'>Lev. 8:12</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Washing and anointing imagery points to purification rites, prefiguring baptism and spiritual anointing in the New Covenant."
    },
    {
      "pk": 33016010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 10,
      "text": "I clothed you with embroidered cloth and put sandals of fine leather on your feet. I dressed you in fine linen and covered you with silk.",
      "links": "<a href='/AIV/02/28/39'>Exod. 28:39</a>; <a href='/AIV/19/45/9'>Ps. 45:9</a>",
      "comment": "God lavishes His people with nobility and beauty, signifying their dignity and chosen status."
    },
    {
      "pk": 33016011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 11,
      "text": "I adorned you with ornaments, put bracelets on your wrists, and a necklace around your neck.",
      "links": "<a href='/AIV/01/24/30'>Gen. 24:30</a>; <a href='/AIV/22/1/10'>Song 1:10</a>",
      "comment": "Imagery of adornment represents favor and blessing, echoing the gifts bestowed upon God’s beloved."
    },
    {
      "pk": 33016012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 12,
      "text": "I put a ring in your nose, earrings in your ears, and a beautiful crown on your head.",
      "links": "<a href='/AIV/22/7/6'>Song 7:6</a>; <a href='/AIV/19/21/3'>Ps. 21:3</a>",
      "comment": "Nose ring, earrings, and crown signify royalty and beauty—status raised by divine action."
    },
    {
      "pk": 33016013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 13,
      "text": "So you were adorned with gold and silver, and your clothing was fine linen, silk, and embroidered fabric. You ate fine flour, honey, and oil; you were exceedingly beautiful and advanced to regal status.",
      "links": "<a href='/AIV/19/45/13'>Ps. 45:13</a>",
      "comment": "Describes the blessings and prosperity granted to Jerusalem, intended for grateful service and worship."
    },
    {
      "pk": 33016014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 14,
      "text": "Your fame spread among the nations because of your beauty, for it was perfect through the splendor that I had given you,\" declares the Lord GOD.",
      "links": "<a href='/AIV/11/10/24'>1 Kings 10:24</a>; <a href='/AIV/19/48/2'>Ps. 48:2</a>",
      "comment": "As God’s people, Jerusalem’s excellence is a result of divine gift, not self merit; this unity with God's will is essential."
    },
    {
      "pk": 33016015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 15,
      "text": "But you trusted in your beauty and acted like a prostitute because of your fame. You poured out your sexual favors on everyone passing by.",
      "links": "<a href='/AIV/28/2/5'>Hos. 2:5</a>",
      "comment": "The allegory shifts; Israel’s unfaithfulness described as spiritual prostitution, rejecting God for foreign idols and alliances."
    },
    {
      "pk": 33016016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 16,
      "text": "You took some of your garments and made colorful shrines and played the harlot on them. Things like this should never happen and should never be.",
      "links": "<a href='/AIV/02/32/4'>Exod. 32:4</a>; <a href='/AIV/07/8/27'>Judg. 8:27</a>",
      "comment": "The misuse of God's gifts illustrates idolatry. Israel perverts the blessings meant for worship into tools for false worship."
    },
    {
      "pk": 33016017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 17,
      "text": "You also took your beautiful jewels of gold and silver, which I had given you, and made for yourself male images, and played the harlot with them.",
      "links": "<a href='/AIV/02/20/23'>Exod. 20:23</a>",
      "comment": "Making idols with the gifts God provided reflects betrayal and spiritual adultery. The gifts meant to glorify God were misused."
    },
    {
      "pk": 33016018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 18,
      "text": "You took your embroidered garments and covered them, and you set My oil and My incense before them.",
      "links": "<a href='/AIV/02/30/25'>Exod. 30:25</a>",
      "comment": "Offers God’s provisions to idols—misplaced worship. Sacramental imagery distorted by idolatry."
    },
    {
      "pk": 33016019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 19,
      "text": "Also, My bread which I gave you—fine flour, oil, and honey with which I fed you—you offered as a sweet aroma before them. So it was,\" declares the Lord GOD.",
      "links": "<a href='/AIV/03/2/2'>Lev. 2:2</a>",
      "comment": "The very offerings prescribed for God are redirected to idols, showing the depth of spiritual infidelity."
    },
    {
      "pk": 33016020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 20,
      "text": "You took your sons and daughters, whom you bore to Me, and sacrificed them to these idols as food. Was your prostitution not enough?",
      "links": "<a href='/AIV/03/18/21'>Lev. 18:21</a>; <a href='/AIV/19/106/37'>Ps. 106:37</a>",
      "comment": "Child sacrifice to idols, a complete inversion of God’s covenant—the ultimate act of betrayal."
    },
    {
      "pk": 33016021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 21,
      "text": "You slaughtered My children and gave them up in sacrifice to idols.",
      "links": "<a href='/AIV/19/106/37-38'>Ps. 106:37-38</a>",
      "comment": "God claims the children as His own, emphasizing the sanctity and tragedy of these actions."
    },
    {
      "pk": 33016022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 22,
      "text": "And in all your abominations and prostitution you did not remember the days of your youth, when you were naked and bare, lying in your blood.",
      "links": "<a href='/AIV/05/8/2'>Deut. 8:2</a>",
      "comment": "Israel’s forgetting of its dependent origins before God underscores pride and self-reliance, recurring themes of apostasy."
    },
    {
      "pk": 33016023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 23,
      "text": "After all your wickedness—‘Woe, woe to you!’ declares the Lord GOD—",
      "links": "<a href='/AIV/23/3/9'>Isa. 3:9</a>",
      "comment": "\"Woe\" signals deep sorrow and impending judgment, reiterating severity of the people's rebellion."
    },
    {
      "pk": 33016024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 24,
      "text": "you built yourself a raised place and made a lofty platform in every square.",
      "links": "<a href='/AIV/24/2/20'>Jer. 2:20</a>",
      "comment": "The proliferation of idolatrous altars in public spaces highlights shamelessness and widespread apostasy."
    },
    {
      "pk": 33016025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 25,
      "text": "At the head of every street you built your lofty platform and made your beauty abominable, spreading your legs to everyone who passed by and multiplying your acts of prostitution.",
      "links": "<a href='/AIV/24/3/2'>Jer. 3:2</a>",
      "comment": "Explicit imagery drives home the shamelessness of Israel’s spiritual unfaithfulness."
    },
    {
      "pk": 33016026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 26,
      "text": "You acted like a prostitute with the Egyptians, your lustful neighbors, and multiplied your acts of prostitution to provoke Me to anger.",
      "links": "<a href='/AIV/28/7/11'>Hos. 7:11</a>",
      "comment": "Political alliances with Egypt symbolized by sexual immorality—the pursuit of security outside God's covenant."
    },
    {
      "pk": 33016027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 27,
      "text": "So I stretched out My hand against you, restricted your food supply, and delivered you up to the will of those who hated you—the daughters of the Philistines—who were ashamed of your obscene conduct.",
      "links": "<a href='/AIV/07/10/7'>Judg. 10:7</a>",
      "comment": "God’s disciplinary action through enemies; even pagans were appalled by Israel’s sins."
    },
    {
      "pk": 33016028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 28,
      "text": "You also acted like a prostitute with the Assyrians, because you were insatiable. Even then, you were not satisfied.",
      "links": "<a href='/AIV/28/8/9'>Hos. 8:9</a>",
      "comment": "Spiritual adultery continued with Assyria, as Israel sought help from foreign powers, betraying trust in God."
    },
    {
      "pk": 33016029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 29,
      "text": "Then you multiplied your acts of prostitution with Chaldea, the land of merchants, but even with this you were not satisfied.",
      "links": "<a href='/AIV/24/39/3'>Jer. 39:3</a>",
      "comment": "Shows the escalation of Israel’s unfaithfulness, and spiritual dissatisfaction outside the true source."
    },
    {
      "pk": 33016030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 30,
      "text": "\"How sick is your heart,\" declares the Lord GOD, \"when you do all these things, the deeds of a brazen prostitute!",
      "links": "<a href='/AIV/19/73/7'>Ps. 73:7</a>",
      "comment": "The root of the issue is a 'sick heart'—pointing to the need for spiritual healing and transformation."
    },
    {
      "pk": 33016031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 31,
      "text": "When you built your raised places at the head of every street and made your lofty platform in every square, you were unlike a prostitute because you scorned payment.",
      "links": "<a href='/AIV/25/1/1-2'>Lam. 1:1-2</a>",
      "comment": "Israel’s prostitution was worse than others: she gave herself away with no benefit, furthering senselessness of her apostasy."
    },
    {
      "pk": 33016032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 32,
      "text": "\"Adulterous wife, who receives strangers rather than her husband!",
      "links": "<a href='/AIV/28/3/1'>Hos. 3:1</a>",
      "comment": "The marital metaphor intensifies. Israel is depicted as an unfaithful spouse breaking her covenant."
    },
    {
      "pk": 33016033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 33,
      "text": "Prostitutes receive payment, but you give your gifts to all your lovers, bribing them to come to you from every direction to engage in your prostitution.",
      "links": "<a href='/AIV/28/8/9'>Hos. 8:9</a>",
      "comment": "The reversal of natural order—the unfaithful wife pays lovers, signifying the depth of spiritual compromise."
    },
    {
      "pk": 33016034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 34,
      "text": "So your prostitution was different from others—no one sought you to pay. Instead, you gave payment, and none was given to you. Therefore you are different.\"",
      "links": "<a href='/AIV/19/106/20'>Ps. 106:20</a>",
      "comment": "Israel is uniquely unfaithful, showing generosity in idolatry and sin that go beyond common moral collapse."
    },
    {
      "pk": 33016035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 35,
      "text": "\"Therefore, O prostitute, hear the word of the LORD:",
      "links": "<a href='/AIV/28/2/2'>Hos. 2:2</a>",
      "comment": "Direct address; strong language for the purpose of shaking the people into repentance."
    },
    {
      "pk": 33016036,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 36,
      "text": "This is what the Lord GOD says: Because your filth was poured out and your nakedness uncovered through your prostitution with your lovers and because of all your abominable idols, and because of the blood of your children whom you gave to them,",
      "links": "<a href='/AIV/19/106/38'>Ps. 106:38</a>; <a href='/AIV/05/12/31'>Deut. 12:31</a>",
      "comment": "Idolatry and child sacrifice are seen as filth and nakedness, deep offenses before God requiring serious consequence."
    },
    {
      "pk": 33016037,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 37,
      "text": "therefore, behold, I will gather all your lovers with whom you have taken pleasure, all those you loved and all those you hated. I will gather them against you from all around and expose your nakedness to them, so that they see all your nakedness.",
      "links": "<a href='/AIV/23/47/3'>Isa. 47:3</a>",
      "comment": "Judgment will be public, witnessed by all those Israel sought for security, shaming her before the nations."
    },
    {
      "pk": 33016038,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 38,
      "text": "I will judge you as women who commit adultery and shed blood are judged, and I will bring on you the blood of wrath and jealousy.",
      "links": "<a href='/AIV/03/20/10'>Lev. 20:10</a>",
      "comment": "Israel falls under the judgment reserved for adulteresses and murderers, stressing justice and seriousness of covenant violation."
    },
    {
      "pk": 33016039,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 39,
      "text": "I will deliver you into their hands, and they shall tear down your raised platforms and destroy your lofty places. They shall strip you of your clothes, take your fine jewelry, and leave you naked and bare.",
      "links": "<a href='/AIV/25/1/8'>Lam. 1:8</a>",
      "comment": "The destruction of idols and public humiliation come as a consequence—God will allow the lovers to carry out judgment."
    },
    {
      "pk": 33016040,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 40,
      "text": "They shall bring up a crowd against you, stone you, and cut you to pieces with their swords.",
      "links": "<a href='/AIV/05/22/22'>Deut. 22:22</a>; <a href='/AIV/24/39/6'>Jer. 39:6</a>",
      "comment": "Punishment echoes legal sentences for adultery and murder, showing the gravity and justice of divine judgment."
    },
    {
      "pk": 33016041,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 41,
      "text": "They shall burn your houses with fire and execute judgments on you before the eyes of many women. I will stop you from prostitution, and you shall not pay any more.",
      "links": "<a href='/AIV/24/52/13'>Jer. 52:13</a>",
      "comment": "Public destruction to deter further sin; God’s discipline sets boundaries and leads to repentance."
    },
    {
      "pk": 33016042,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 42,
      "text": "So I will satisfy My wrath against you, and My jealousy shall depart from you. I will be calm and will no longer be angry.",
      "links": "<a href='/AIV/19/85/3'>Ps. 85:3</a>",
      "comment": "God’s judgment is ultimately redemptive — it brings an end to anger and sets the stage for renewed relationship."
    },
    {
      "pk": 33016043,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 43,
      "text": "Because you did not remember the days of your youth, but enraged Me with all these things, therefore I will bring your deeds upon your own head,\" declares the Lord GOD. \"Haven't you committed lewdness in addition to all your abominations?",
      "links": "<a href='/AIV/19/9/16'>Ps. 9:16</a>",
      "comment": "Forgetting one's need for God leads to idolatry, and consequences become self-inflicted."
    },
    {
      "pk": 33016044,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 44,
      "text": "\"Behold, everyone who uses proverbs will quote this proverb about you: ‘Like mother, like daughter.’",
      "links": "<a href='/AIV/24/31/29'>Jer. 31:29</a>",
      "comment": "A common proverb, denoting inherited sinfulness; here, the spiritual legacy of unfaithfulness."
    },
    {
      "pk": 33016045,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 45,
      "text": "You are the daughter of your mother, who loathed her husband and her children; and you are the sister of your sisters, who loathed their husbands and their children. Your mother was a Hittite and your father an Amorite.",
      "links": "<a href='/AIV/26/16/3'>Ezek. 16:3</a>",
      "comment": "Echoes earlier verse, emphasizing the root and continuity of spiritual rebellion."
    },
    {
      "pk": 33016046,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 46,
      "text": "Your older sister is Samaria, who lived to the north of you with her daughters; your younger sister, who lived to the south of you, is Sodom and her daughters.",
      "links": "<a href='/AIV/12/17/5'>2 Kings 17:5</a>; <a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>",
      "comment": "Jerusalem is compared to Samaria and Sodom — infamous for their own sins — to show the familial connection in rebellion."
    },
    {
      "pk": 33016047,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 47,
      "text": "Not only did you follow their ways and do their abominations, but you became even more corrupt in all your conduct than they were.",
      "links": "<a href='/AIV/24/32/32'>Jer. 32:32</a>",
      "comment": "Jerusalem exceeded the sins of her ‘sisters.’ This heightens the urgency for repentance."
    },
    {
      "pk": 33016048,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 48,
      "text": "As I live,\" declares the Lord GOD, \"your sister Sodom and her daughters have not done as you and your daughters have done.",
      "links": "<a href='/AIV/01/19/5'>Gen. 19:5</a>",
      "comment": "Even Sodom, the archetype of wickedness, is surpassed by Jerusalem. The comparison shows the seriousness of her sin."
    },
    {
      "pk": 33016049,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 49,
      "text": "Behold, this was the sin of your sister Sodom: arrogance, excess of food, and prosperous ease, but she did not aid the poor and needy.",
      "links": "<a href='/AIV/01/13/13'>Gen. 13:13</a>",
      "comment": "Sodom’s sins are broadened beyond sexual immorality to social injustice—neglect of charity becomes central to judgment."
    },
    {
      "pk": 33016050,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 50,
      "text": "They were haughty and committed abomination before Me. Therefore I removed them when I saw it.",
      "links": "<a href='/AIV/01/19/13'>Gen. 19:13</a>",
      "comment": "God’s judgment falls after repeated disregard for His commands, linking pride with abomination."
    },
    {
      "pk": 33016051,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 51,
      "text": "Samaria has not committed half of your sins; but you have multiplied your abominations more than they have and have made your sisters seem righteous by all the abominations you have done.",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>",
      "comment": "Jerusalem’s sins eclipse Samaria’s, intensifying the charge and linking communal holiness to God's reputation."
    },
    {
      "pk": 33016052,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 52,
      "text": "Bear your disgrace, for you have made your sisters appear righteous. Because of your sins in which you acted more abominably than they did, they are more justified than you. Be ashamed, then, and bear your disgrace, for you have made your sisters appear righteous.",
      "links": "<a href='/AIV/19/119/39'>Ps. 119:39</a>",
      "comment": "Shame is used here as a necessary tool for repentance, a first step toward reconciliation with God."
    },
    {
      "pk": 33016053,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 53,
      "text": "\"I will restore the fortunes of Sodom and her daughters and the fortunes of Samaria and her daughters, and I will restore your fortunes along with them,",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>",
      "comment": "A promise of restoration emerges in judgment — God’s mercy is sovereign, proposing a future of renewed grace."
    },
    {
      "pk": 33016054,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 54,
      "text": "so that you may bear your disgrace and be ashamed of all you have done, whenever you comfort them.",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>",
      "comment": "Restoration does not remove the memory of sin—humility and communal consolation are part of the healing process."
    },
    {
      "pk": 33016055,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 55,
      "text": "Your sisters, Sodom and her daughters, will return to their former state, and Samaria and her daughters will return to their former state, and you and your daughters will return to your former state.",
      "links": "<a href='/AIV/24/30/3'>Jer. 30:3</a>",
      "comment": "The renewal and restoration foretold is universal, not exclusive to Israel, hinting at the future inclusiveness of salvation."
    },
    {
      "pk": 33016056,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 56,
      "text": "Did you not talk about your sister Sodom in the days of your pride,",
      "links": "<a href='/AIV/19/123/4'>Ps. 123:4</a>",
      "comment": "Israel’s pride led her to judge others, forgetting her own vulnerability to sin."
    },
    {
      "pk": 33016057,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 57,
      "text": "before your wickedness was exposed? Now you are an object of reproach to the daughters of Syria and all those around her, and the daughters of the Philistines—those who despise you.",
      "links": "<a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "The reversal is poetic justice — those Israel scorned now mock and despise her."
    },
    {
      "pk": 33016058,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 58,
      "text": "You must bear the penalty of your lewdness and your abominations,\" declares the LORD.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Justice and repentance go hand in hand. Consequence is necessary for growth and reconciliation."
    },
    {
      "pk": 33016059,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 59,
      "text": "\"For this is what the Lord GOD says: I will deal with you as you have done—you who have despised the oath by breaking the covenant.",
      "links": "<a href='/AIV/26/16/8'>Ezek. 16:8</a>; <a href='/AIV/26/20/37'>Ezek. 20:37</a>",
      "comment": "Breaking the covenant – God responds with justice, but it is justice aiming at restoration, not annihilation."
    },
    {
      "pk": 33016060,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 60,
      "text": "\"Yet I will remember My covenant with you in the days of your youth, and I will establish an everlasting covenant with you.",
      "links": "<a href='/AIV/01/9/16'>Gen. 9:16</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "God’s faithfulness endures despite human brokenness. This prophecy points toward a future, everlasting covenant—a spiritual fulfillment seen in Christ and the Church."
    },
    {
      "pk": 33016061,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 61,
      "text": "Then you will remember your ways and be ashamed, when you receive your sisters, both your older and your younger, and I give them to you as daughters, but not on account of My covenant with you.",
      "links": "<a href='/AIV/23/60/4'>Isa. 60:4</a>",
      "comment": "Universal restoration—true repentance, humility, and communal family; points toward spiritual motherhood and unity in the Church."
    },
    {
      "pk": 33016062,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 62,
      "text": "I will establish My covenant with you, and you shall know that I am the LORD,",
      "links": "<a href='/AIV/26/37/26'>Ezek. 37:26</a>",
      "comment": "Knowledge of God comes through the new and everlasting covenant—a theme fulfilled in Christ’s redeeming work."
    },
    {
      "pk": 33016063,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 16,
      "verse": 63,
      "text": "that you may remember and be ashamed, and never open your mouth again because of your disgrace, when I forgive you all that you have done, declares the Lord GOD.\"",
      "links": "<a href='/AIV/24/33/8'>Jer. 33:8</a>; <a href='/AIV/41/2/5-12'>Mark 2:5-12</a>",
      "comment": "Final verse focuses on God’s mercy—true repentance leads to forgiveness. Foreshadows Jesus’ ministry of forgiveness and the binding of all into one spiritual family."
    }
  ],
  "translatedAt": "2025-12-24T09:06:32.423Z"
}