{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 14,
  "verses": [
    {
      "pk": 33014001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 1,
      "text": "Some elders of Israel came to me and sat down before me.",
      "links": "<a href='/AIV/33/8/1'>Ezek. 8:1</a>",
      "comment": "Here, like in Ezekiel 8:1, the leaders of Israel approach Ezekiel for guidance. Their seeking of counsel echoes a pattern where God's representatives mediate between Him and the people (Ex. 18:15-19)."
    },
    {
      "pk": 33014002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 2,
      "text": "Then the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/30/3/7'>Amos 3:7</a>",
      "comment": "Throughout prophecy, God reveals His will through His chosen prophets (see also Amos 3:7), underlining the necessity of a divinely appointed authority for authentic revelation."
    },
    {
      "pk": 33014003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 3,
      "text": "Son of man, these men have set up idols in their hearts and placed the stumbling block of their iniquity before their faces. Should I really let Myself be consulted by them?",
      "links": "<a href='/AIV/19/44/20'>Ps. 44:20-21</a>; <a href='/AIV/24/6/20'>Jer. 6:20</a>",
      "comment": "God knows the heart (Ps. 44:20-21). Idolatry here is inward, foreshadowing Christ's teaching that sin first takes root in the heart (Matt. 5:27-28)."
    },
    {
      "pk": 33014004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 4,
      "text": "Therefore speak to them and say to them, 'Thus says the Lord GOD: Every person from the house of Israel who sets up his idols in his heart and places the stumbling block of his sin before his face, and then comes to the prophet—I, the LORD, will answer him according to the multitude of his idols.'",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Answering according to their idols means God allows people to experience the consequences of their inner rebellion (Rom. 1:24-25). The necessity of coming to God with true repentance begins to emerge."
    },
    {
      "pk": 33014005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 5,
      "text": "This is so I may seize the house of Israel by their hearts, because they have all turned away from Me through their idols.",
      "links": "<a href='/AIV/28/7/16'>Hos. 7:16</a>",
      "comment": "God desires not just outward obedience but the conversion of the heart, a theme fulfilled in the new covenant (Jer. 31:33; Heb. 8:10)."
    },
    {
      "pk": 33014006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 6,
      "text": "Therefore say to the house of Israel, 'Thus says the Lord GOD: Repent and turn away from your idols, and turn your faces away from all your abominations.'",
      "links": "<a href='/AIV/26/18/30'>Ezek. 18:30</a>; <a href='/AIV/40/4/17'>Matt. 4:17</a>",
      "comment": "A call to repentance, echoing John the Baptist and Jesus (Matt. 4:17), showing the continuity of God's demand for inner conversion and purity."
    },
    {
      "pk": 33014007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 7,
      "text": "For anyone of the house of Israel, or the foreigners who dwell in Israel, who separates himself from Me and sets up idols in his heart, putting the stumbling block of his sin before his face, and then comes to a prophet to inquire for himself of Me—I, the LORD, will answer him Myself.",
      "links": "<a href='/AIV/05/10/17-19'>Deut. 10:17-19</a>",
      "comment": "Both Israelites and foreigners are held to the same standard, anticipating the later inclusion of the Gentiles (Acts 10:34-35). Direct answer from God stresses the seriousness of seeking Him with integrity."
    },
    {
      "pk": 33014008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 8,
      "text": "I will set My face against that person. I will make him a sign and a proverb, and I will cut him off from the midst of My people. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/03/17/10'>Lev. 17:10</a>; <a href='/AIV/19/34/16'>Ps. 34:16</a>",
      "comment": "Divine judgment includes separation from God's people, signifying the grave danger of persistent, unrepentant sin. This also foreshadows excommunication, which is meant as a medicinal, corrective measure for repentance (1 Cor. 5:5)."
    },
    {
      "pk": 33014009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 9,
      "text": "If the prophet is deceived and speaks a word, I, the LORD, have deceived that prophet. I will stretch out My hand against him and will destroy him from the midst of My people Israel.",
      "links": "<a href='/AIV/05/13/1-5'>Deut. 13:1-5</a>",
      "comment": "God allows false prophets to arise as a test (Deut. 13:3), indicating the necessity of discernment, authentic teaching, and established authority."
    },
    {
      "pk": 33014010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 10,
      "text": "They will bear their punishment—the punishment of the prophet and the punishment of the one who inquired—",
      "links": "<a href='/AIV/03/20/6'>Lev. 20:6</a>",
      "comment": "Accountability is mutual: both the deceiver and the deceived are responsible. This highlights the importance of adherence to sound teaching and tradition (2 Tim. 4:3-4)."
    },
    {
      "pk": 33014011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 11,
      "text": "so that the house of Israel may no longer go astray from Me, nor defile themselves any more with all their transgressions. Then they will be My people, and I will be their God, declares the Lord GOD.",
      "links": "<a href='/AIV/03/26/12'>Lev. 26:12</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/66/21/7'>Rev. 21:7</a>",
      "comment": "The recurring covenant formula points ahead to the renewal of God’s people through a purified relationship, later seen in the Church as the ‘people of God’. Spiritual and communal restoration are both implied."
    },
    {
      "pk": 33014012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 12,
      "text": "The word of the LORD came to me, saying:",
      "links": "",
      "comment": "The sequence signals a shift to a new prophetic message; prophetic revelation often comes at critical moments to guide the community."
    },
    {
      "pk": 33014013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 13,
      "text": "Son of man, if a land sins against Me by being unfaithful, and I stretch out My hand against it and break its supply of bread, send famine upon it, and cut off from it both man and beast,",
      "links": "<a href='/AIV/02/7/18'>Ex. 7:18</a>; <a href='/AIV/26/5/16'>Ezek. 5:16-17</a>",
      "comment": "National infidelity brings judgment affecting all, reminiscent of the covenant curses (Deut. 28:23-24). The land’s fate is intertwined with the virtue of its people."
    },
    {
      "pk": 33014014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 14,
      "text": "even if these three men—Noah, Daniel, and Job—were in it, they would deliver only themselves by their righteousness, declares the Lord GOD.",
      "links": "<a href='/AIV/01/6/8-9'>Gen. 6:8-9</a>; <a href='/AIV/27/6/4'>Dan. 6:4</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "The personal righteousness of these figures cannot save others from collective judgment—a warning against relying solely on the holiness of past saints rather than personal conversion. Yet, their place in salvation history anticipates later intercessory roles, as seen in 1 Tim. 2:1-2."
    },
    {
      "pk": 33014015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 15,
      "text": "If I cause wild beasts to pass through the land and they bereave it, and it becomes desolate, so no one passes through because of the beasts,",
      "links": "<a href='/AIV/03/26/22'>Lev. 26:22</a>",
      "comment": "Wild beasts are an instrument of judgment (Lev. 26:22), showing God’s sovereignty over creation and history."
    },
    {
      "pk": 33014016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 16,
      "text": "even if these three men were in it, as I live, declares the Lord GOD, they would not deliver either sons or daughters; they alone would be delivered, but the land would be desolate.",
      "links": "<a href='/AIV/24/15/1'>Jer. 15:1</a>",
      "comment": "The limited intercessory effect highlights personal responsibility in salvation, yet still validates the principle of intercession and mediation."
    },
    {
      "pk": 33014017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 17,
      "text": "Or if I bring a sword upon that land and say, ‘Let a sword pass through the land,’ and I cut off both man and beast from it,",
      "links": "<a href='/AIV/03/26/25'>Lev. 26:25</a>",
      "comment": "Judgment by the sword is another covenant curse (Lev. 26:25), intensifying the warning regarding national guilt."
    },
    {
      "pk": 33014018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 18,
      "text": "even if these three men were in it, as I live, declares the Lord GOD, they would not deliver sons or daughters, but they themselves would be delivered.",
      "links": "",
      "comment": "Repeated for emphasis: righteousness does not transfer automatically among family members."
    },
    {
      "pk": 33014019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 19,
      "text": "Or if I send a plague into that land, and pour out My fury upon it in blood, to cut off from it man and beast,",
      "links": "<a href='/AIV/26/5/17'>Ezek. 5:17</a>",
      "comment": "God is just in His judgments, which include pestilence. The repeated theme is meant to evoke repentance before disaster."
    },
    {
      "pk": 33014020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 20,
      "text": "even if Noah, Daniel, and Job were in it, as I live, declares the Lord GOD, they would deliver neither son nor daughter; they would deliver only themselves by their righteousness.",
      "links": "<a href='/AIV/18/42/9'>Job 42:9-10</a>",
      "comment": "Ultimately, each is judged according to his own relationship with God, though the memory of the righteous has enduring significance for the community."
    },
    {
      "pk": 33014021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 21,
      "text": "For thus says the Lord GOD: How much more when I send upon Jerusalem My four severe judgments—the sword, famine, wild beasts, and plague—to cut off from it man and beast!",
      "links": "<a href='/AIV/26/5/17'>Ezek. 5:17</a>; <a href='/AIV/66/6/8'>Rev. 6:8</a>",
      "comment": "These four judgments symbolize the totality of divine wrath (Rev. 6:8). Jerusalem, as the focal point of worship, is held to strict standards—a theme that connects to the later role of the holy city in redemption."
    },
    {
      "pk": 33014022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 22,
      "text": "Yet, look, in it will be left a remnant—sons and daughters who will be brought out. Look on their ways and their actions, and you will be comforted regarding the disaster I have brought upon Jerusalem, concerning all that I have brought on it.",
      "links": "<a href='/AIV/23/10/20-21'>Isa. 10:20-21</a>; <a href='/AIV/45/11/5'>Rom. 11:5</a>",
      "comment": "The doctrine of the remnant pervades both Old and New Testament, showing God’s mercy even in judgment. The faithful remnant becomes the means by which God’s plan continues—echoed in the Church as the continuation of Israel, God’s gathered people."
    },
    {
      "pk": 33014023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 14,
      "verse": 23,
      "text": "They will comfort you when you see their ways and their actions. You will know that I have not done without reason all that I have done in it, declares the Lord GOD.",
      "links": "<a href='/AIV/26/20/42'>Ezek. 20:42</a>",
      "comment": "In witnessing the remnant’s faithfulness, God’s justice is vindicated. Divine providence ensures that all things are directed by His wisdom, for the ultimate good of those who belong to Him (Rom. 8:28)."
    }
  ],
  "translatedAt": "2025-12-24T09:05:25.059Z"
}