{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 48,
  "verses": [
    {
      "pk": 33048001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 1,
      "text": "Now, these are the names of the tribes: from the northern border, next to the way of Hethlon as one goes to Hamath, to Hazar Enan at the border of Damascus, northward beside Hamath, from the east side to the west: one portion for Dan.",
      "links": "<a href='/AIV/04/34/8-9'>Num. 34:8-9</a>",
      "comment": "Ezekiel begins the detailed division of the land among the twelve tribes, emphasizing the restoration of Israel. The specificity recalls the original land allocations in Numbers. The spiritual interpretation sees this as a symbol of God's order and care for His people."
    },
    {
      "pk": 33048002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 2,
      "text": "Next to the territory of Dan, from the east side to the west: one portion for Asher.",
      "links": "<a href='/AIV/06/19/24'>Josh. 19:24</a>",
      "comment": "Each tribe receives its allotted inheritance, reflecting the unity and diversity of God's people."
    },
    {
      "pk": 33048003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 3,
      "text": "Next to the territory of Asher, from the east side to the west: one portion for Naphtali.",
      "links": "<a href='/AIV/06/19/32'>Josh. 19:32</a>",
      "comment": "The order begins from north to south, suggesting completeness in God's promise."
    },
    {
      "pk": 33048004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 4,
      "text": "Next to the territory of Naphtali, from the east side to the west: one portion for Manasseh.",
      "links": "<a href='/AIV/06/17/1'>Josh. 17:1</a>",
      "comment": "The unique division, unlike Joshua's time, foreshadows a reunited and restored people."
    },
    {
      "pk": 33048005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 5,
      "text": "Next to the territory of Manasseh, from the east side to the west: one portion for Ephraim.",
      "links": "<a href='/AIV/06/16/5'>Josh. 16:5</a>",
      "comment": "Manasseh and Ephraim, both sons of Joseph, are included separately, representing the full inclusion of all God's children."
    },
    {
      "pk": 33048006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 6,
      "text": "Next to the territory of Ephraim, from the east side to the west: one portion for Reuben.",
      "links": "<a href='/AIV/06/13/15'>Josh. 13:15</a>",
      "comment": "Reuben, once lost preeminence due to his sin (Gen. 49:3-4), here receives his portion, showing God's mercy and restoration."
    },
    {
      "pk": 33048007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 7,
      "text": "Next to the territory of Reuben, from the east side to the west: one portion for Judah.",
      "links": "<a href='/AIV/01/49/10'>Gen. 49:10</a>; <a href='/AIV/06/15/1'>Josh. 15:1</a>",
      "comment": "Judah, the royal line, is placed centrally, pointing to the coming Messiah, ultimately fulfilled in Christ (see Gen. 49:10)."
    },
    {
      "pk": 33048008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 8,
      "text": "Next to the territory of Judah, from the east side to the west, shall be the district you are to set apart, twenty-five thousand cubits wide and as long as each tribal portion, from the east side to the west; the sanctuary shall be in the midst of it.",
      "links": "<a href='/AIV/26/45/1-4'>Ezek. 45:1-4</a>",
      "comment": "This holy district includes a special place for the sanctuary, a sign of God's presence among His people. In the New Covenant, Christ Himself becomes the true sanctuary (John 2:19-21)."
    },
    {
      "pk": 33048009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 9,
      "text": "The district you shall set apart for the LORD shall be twenty-five thousand cubits long and ten thousand wide.",
      "links": "<a href='/AIV/26/45/1'>Ezek. 45:1</a>",
      "comment": "The measurements emphasize the holiness required for serving and worshiping God. The physical temple foreshadows the spiritual temple, the Church, built on Christ."
    },
    {
      "pk": 33048010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 10,
      "text": "These are the measurements: to the priests shall belong the holy portion, twenty-five thousand cubits long on the north side, ten thousand wide on the west, ten thousand on the east, and twenty-five thousand the length on the south; and the sanctuary of the LORD shall be in the midst.",
      "links": "<a href='/AIV/26/45/4'>Ezek. 45:4</a>",
      "comment": "Priests serve in the heart of the sanctuary, showing leadership and mediation between God and His people, a principle continued in the New Covenant's ordained ministers."
    },
    {
      "pk": 33048011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 11,
      "text": "It shall be for the priests who are sanctified from the sons of Zadok, who kept My charge, who did not go astray when the people of Israel went astray, as the Levites did.",
      "links": "<a href='/AIV/26/40/46'>Ezek. 40:46</a>",
      "comment": "The sons of Zadok are singled out for their faithfulness; this stresses the importance of spiritual fidelity among God's leaders (cf. 1 Pet. 2:9)."
    },
    {
      "pk": 33048012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 12,
      "text": "It will be a most holy portion beside the border of the Levites.",
      "links": "<a href='/AIV/26/45/3-4'>Ezek. 45:3-4</a>",
      "comment": "The 'most holy' status sets the priesthood apart. Holiness is both a call and a gift, fulfilled in Christ the eternal High Priest."
    },
    {
      "pk": 33048013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 13,
      "text": "Alongside the territory of the priests, the Levites will have an area twenty-five thousand cubits long and ten thousand wide. The length will be twenty-five thousand and the width ten thousand.",
      "links": "<a href='/AIV/26/45/5'>Ezek. 45:5</a>",
      "comment": "Levites also have a special allotment, indicating the importance of those set apart for service. In the spiritual sense, all God's people are called to serve."
    },
    {
      "pk": 33048014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 14,
      "text": "They must not sell or exchange any of it, and this best part of the land must not pass into other hands, for it is holy to the LORD.",
      "links": "<a href='/AIV/03/25/34'>Lev. 25:34</a>",
      "comment": "The commands protect the sacredness of the priestly and Levite inheritances, emphasizing stability and faithfulness in ministry."
    },
    {
      "pk": 33048015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 15,
      "text": "The remainder, five thousand cubits wide, bordering the holy district, will be for common use by the city, for dwellings and open land. The city will be in the center.",
      "links": "<a href='/AIV/26/45/6'>Ezek. 45:6</a>",
      "comment": "The city is set within the sacred space, suggesting the unity of worship and daily life—a sign fulfilled in the new Jerusalem (Rev. 21:2–3)."
    },
    {
      "pk": 33048016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 16,
      "text": "These are its measurements: the north side four thousand five hundred cubits, the south side four thousand five hundred, the east side four thousand five hundred, and the west side four thousand five hundred.",
      "links": "<a href='/AIV/26/48/30'>Ezek. 48:30</a>",
      "comment": "The city's dimensions emphasize symmetry and order, reflecting God's divine plan. (Compare to the design of the city in Rev. 21:16.)"
    },
    {
      "pk": 33048017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 17,
      "text": "The open land around the city will be two hundred fifty cubits to the north, two hundred fifty cubits to the south, two hundred fifty cubits to the east, and two hundred fifty cubits to the west.",
      "links": "",
      "comment": "This open land serves as a buffer, protecting the sanctity of the city, symbolizing the call to holiness."
    },
    {
      "pk": 33048018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 18,
      "text": "The remainder, parallel to the holy district, will be ten thousand cubits eastward and ten thousand westward. It will produce food for the workers of the city.",
      "links": "",
      "comment": "Provision is made for sustenance. The union of spiritual worship and temporal necessities reflects the Church's role in both serving spiritual and physical needs (Acts 6:1-4)."
    },
    {
      "pk": 33048019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 19,
      "text": "The workers of the city, from all the tribes of Israel, shall farm it.",
      "links": "",
      "comment": "Everyone participates in the care of the city; a type of the communion of all believers in the one body of Christ."
    },
    {
      "pk": 33048020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 20,
      "text": "All of the holy district, together with the city property, will be a square of twenty-five thousand cubits by twenty-five thousand cubits. You shall set apart the holy district along with the city property.",
      "links": "",
      "comment": "The square shape was symbolic of perfection and completion; God’s people dwelling in the fullness of His plan."
    },
    {
      "pk": 33048021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 21,
      "text": "The land that is left on either side of the holy district and the city will belong to the prince. It will extend from the twenty-five thousand cubits of the district to the east border and to the west border—parallel to the tribal portions. It will belong to the prince. The holy district and the temple sanctuary will be in the middle of it.",
      "links": "<a href='/AIV/26/44/3'>Ezek. 44:3</a>; <a href='/AIV/26/45/7-8'>Ezek. 45:7–8</a>",
      "comment": "The prince represents spiritual and civil leadership in harmony. The prince's land is centrally located, underscoring the unity of worship and governance under one head."
    },
    {
      "pk": 33048022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 22,
      "text": "So the rest of the land from the property of the Levites and the city, between the tribal portions, will belong to the prince. It will be in the center, between the border of Judah and the border of Benjamin, and will belong to the prince.",
      "links": "<a href='/AIV/26/45/7'>Ezek. 45:7</a>",
      "comment": "This central leadership anticipates the unified kingdom under Christ, who is priest, prophet, and king."
    },
    {
      "pk": 33048023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 23,
      "text": "As for the rest of the tribes: from the east side to the west, Benjamin, one portion.",
      "links": "<a href='/AIV/06/18/11'>Josh. 18:11</a>",
      "comment": "Benjamin's portion echoes the unity of the tribes, each with a secure inheritance."
    },
    {
      "pk": 33048024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 24,
      "text": "Next to the territory of Benjamin, from the east side to the west, Simeon, one portion.",
      "links": "<a href='/AIV/06/19/1'>Josh. 19:1</a>",
      "comment": "Simeon is restored among the tribes, reinforcing God's faithfulness to the whole nation."
    },
    {
      "pk": 33048025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 25,
      "text": "Next to the territory of Simeon, from the east side to the west, Issachar, one portion.",
      "links": "<a href='/AIV/06/19/17'>Josh. 19:17</a>",
      "comment": "Systematic listing underlines the fullness of God's promise."
    },
    {
      "pk": 33048026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 26,
      "text": "Next to the territory of Issachar, from the east side to the west, Zebulun, one portion.",
      "links": "<a href='/AIV/06/19/10'>Josh. 19:10</a>",
      "comment": "Each tribe's inclusion points to the universality of God's plan of salvation."
    },
    {
      "pk": 33048027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 27,
      "text": "Next to the territory of Zebulun, from the east side to the west, Gad, one portion.",
      "links": "<a href='/AIV/06/13/24'>Josh. 13:24</a>",
      "comment": "Gad is the southernmost tribe, completing the order from north to south."
    },
    {
      "pk": 33048028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 28,
      "text": "Beside the territory of Gad, at the south border, the border will run from Tamar to the waters of Meribah Kadesh, to the Brook of Egypt, and to the Great Sea.",
      "links": "<a href='/AIV/04/34/5'>Num. 34:5</a>",
      "comment": "The external borders align with the ancient Promised Land. Theologically, these borders signify the fullness of God's kingdom."
    },
    {
      "pk": 33048029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 29,
      "text": "This is the land you are to allot as an inheritance to the tribes of Israel, and these are their portions, declares the Lord GOD.",
      "links": "",
      "comment": "The inheritance given is irrevocable—God’s gifts and call are without repentance (Rom. 11:29)."
    },
    {
      "pk": 33048030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 30,
      "text": "These are the exits of the city: On the north side, which is four thousand five hundred cubits long,",
      "links": "",
      "comment": "City gates symbolize openness and access; the Church is open to all nations (Is. 2:2; Rev. 21:25)."
    },
    {
      "pk": 33048031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 31,
      "text": "There will be three gates: one gate for Reuben, one gate for Judah, and one gate for Levi.",
      "links": "",
      "comment": "12 gates correspond to the 12 tribes, echoing the gates in Revelation’s new Jerusalem (Rev. 21:12). Levi here receives a gate, reminding us of the enduring role of priestly ministry."
    },
    {
      "pk": 33048032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 32,
      "text": "On the east side, four thousand five hundred cubits, three gates: one gate for Joseph, one gate for Benjamin, one gate for Dan.",
      "links": "",
      "comment": "Joseph is mentioned by name, rather than through his sons, symbolizing restoration of unity."
    },
    {
      "pk": 33048033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 33,
      "text": "On the south side, which is four thousand five hundred cubits by measurement, three gates: one gate for Simeon, one gate for Issachar, and one gate for Zebulun.",
      "links": "",
      "comment": "This completes the distribution, symbolizing wholeness and inclusion in God's city."
    },
    {
      "pk": 33048034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 34,
      "text": "On the west side, four thousand five hundred cubits, three gates: one gate for Gad, one gate for Asher, and one gate for Naphtali.",
      "links": "",
      "comment": "All the tribes are given a gate, showing the equal access for all children of God to the holy city (Rev. 21:12–14)."
    },
    {
      "pk": 33048035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 48,
      "verse": 35,
      "text": "The entire circumference of the city will be eighteen thousand cubits. And the name of the city from that day will be, 'The LORD is There.'",
      "links": "<a href='/AIV/24/33/16'>Jer. 33:16</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "The new name, 'The LORD is There' (YHWH Shammah), signifies God's perpetual indwelling among His people. The fullness of this prophecy is realized in the Incarnation—God dwelling with humanity (John 1:14; Rev. 21:3). The Church, as the visible dwelling of God on earth, foreshadows this ultimate fulfillment."
    }
  ],
  "translatedAt": "2025-12-24T09:26:53.429Z"
}