{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 37,
  "verses": [
    {
      "pk": 33037001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 1,
      "text": "The hand of the LORD was upon me, and He carried me out by the Spirit of the LORD and set me down in the middle of a valley; it was full of bones.",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>; <a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "Ezekiel suddenly experiences a vision under the direct influence of God's Spirit. This verse sets up a supernatural context, marking divine initiative. Compare with similar prophetic experiences in Ezekiel 3 and Ezekiel 8."
    },
    {
      "pk": 33037002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 2,
      "text": "He led me back and forth among them, and I saw a huge number of bones lying across the valley, and they were very dry.",
      "links": "<a href='/AIV/26/6/5'>Ezek. 6:5</a>; <a href='/AIV/19/22/15'>Ps. 22:15</a>",
      "comment": "Walking among the bones symbolizes the total desolation and apparent hopelessness of Israel's situation. Dryness highlights their long separation from life."
    },
    {
      "pk": 33037003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 3,
      "text": "Then He said to me, 'Son of man, can these bones live?' And I answered, 'Lord GOD, You know.'",
      "links": "<a href='/AIV/26/39/17'>Ezek. 39:17</a>; <a href='/AIV/24/32/17'>Jer. 32:17</a>",
      "comment": "'Son of man' is a common address to Ezekiel, emphasizing his humanity. His humble answer shows dependence on God's wisdom and power, a theological posture foundational for Christian faith."
    },
    {
      "pk": 33037004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 4,
      "text": "Then He said to me, 'Prophesy over these bones and say to them: Dry bones, hear the word of the LORD.'",
      "links": "<a href='/AIV/26/6/5'>Ezek. 6:5</a>; <a href='/AIV/40/8/8-13'>Matt. 8:8-13</a>",
      "comment": "The command emphasizes the power of God's word, which brings life even to the dead. Compare with Christ's authority over death in Matthew 8."
    },
    {
      "pk": 33037005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 5,
      "text": "This is what the Lord GOD says to these bones: I will cause breath to enter you, and you will come to life.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/26/36/27'>Ezek. 36:27</a>",
      "comment": "The use of 'breath' (Hebrew: 'ruach') echoes the original creation when God breathed life into Adam (Genesis 2:7), foreshadowing spiritual renewal through the Spirit."
    },
    {
      "pk": 33037006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 6,
      "text": "I will put tendons on you and make flesh grow upon you, and cover you with skin; then I will put breath in you, and you will come to life. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/26/11/19'>Ezek. 11:19</a>",
      "comment": "The step-by-step restoration points to a bodily resurrection, hinting at the hope beyond death. 'You will know that I am the LORD' expresses the purpose: revelation of God's divine power."
    },
    {
      "pk": 33037007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 7,
      "text": "So I prophesied as I was commanded, and as I prophesied there was a noise and a rattling, and the bones came together, bone to bone.",
      "links": "<a href='/AIV/26/3/22'>Ezek. 3:22</a>; <a href='/AIV/19/104/30'>Ps. 104:30</a>",
      "comment": "The vision dramatically shifts from death to movement, symbolizing God's sovereign power at work through human obedience."
    },
    {
      "pk": 33037008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 8,
      "text": "And I saw tendons and flesh appear on them, and skin covered them, but there was no breath in them.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/26/36/27'>Ezek. 36:27</a>",
      "comment": "This verse shows that restoration of physical form alone is not sufficient; the Spirit’s life-giving breath is essential, reflecting theological themes of new birth."
    },
    {
      "pk": 33037009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 9,
      "text": "Then He said to me, 'Prophesy to the breath; prophesy, son of man, and say to the breath, Thus says the Lord GOD: Come from the four winds, and breathe into these slain, that they may live.'",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/43/20/22'>John 20:22</a>",
      "comment": "The invocation of the four winds carries a universal implication of God's Spirit reaching all. Note the parallel to Jesus breathing on His disciples in John 20:22."
    },
    {
      "pk": 33037010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 10,
      "text": "So I prophesied as He commanded me, and breath entered them; and they came to life and stood up on their feet—a vast army.",
      "links": "<a href='/AIV/26/10/19'>Ezek. 10:19</a>; <a href='/AIV/66/20/5'>Rev. 20:5</a>",
      "comment": "The restored army represents the people of God brought back to spiritual life—a motif carried into resurrection imagery in Revelation."
    },
    {
      "pk": 33037011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 11,
      "text": "Then He said to me, 'Son of man, these bones are the whole house of Israel. They say, Our bones are dried up, our hope is lost, we are completely cut off.'",
      "links": "<a href='/AIV/19/31/12'>Ps. 31:12</a>; <a href='/AIV/25/3/54'>Lam. 3:54</a>",
      "comment": "The interpretation is explicitly given: the vision is about the restoration of Israel, who are despairing in exile, believing themselves beyond hope."
    },
    {
      "pk": 33037012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 12,
      "text": "Therefore prophesy and say to them: This is what the Lord GOD says: Behold, I will open your graves and bring you up from them, My people, and bring you back to the land of Israel.",
      "links": "<a href='/AIV/26/36/24'>Ezek. 36:24</a>; <a href='/AIV/43/5/28-29'>John 5:28-29</a>",
      "comment": "The reference to opening graves foreshadows bodily resurrection and the return from exile, both understood literally and typologically in Christian thought."
    },
    {
      "pk": 33037013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 13,
      "text": "And you will know that I am the LORD, when I open your graves and bring you up from them, My people.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/43/11/43-44'>John 11:43-44</a>",
      "comment": "Recognizing God's identity through His miraculous acts is a recurring theme. See parallels in Jesus raising Lazarus from the dead."
    },
    {
      "pk": 33037014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 14,
      "text": "I will put My Spirit in you, and you will live, and I will settle you in your own land. Then you will know that I, the LORD, have spoken, and I have done it, declares the LORD.",
      "links": "<a href='/AIV/26/36/27'>Ezek. 36:27</a>; <a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "Putting God's Spirit in them anticipates New Testament fulfillment at Pentecost. Note also the promise of restored land, symbolizing the unity and permanence of God's people."
    },
    {
      "pk": 33037015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 15,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "A new oracle begins, emphasizing that all instruction comes directly from God, a consistent expression of prophetic authority."
    },
    {
      "pk": 33037016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 16,
      "text": "'Son of man, take a stick and write on it: For Judah and for the children of Israel associated with him. Then take another stick and write on it: For Joseph, the stick of Ephraim, and for all the house of Israel associated with him.'",
      "links": "<a href='/AIV/1/49/10'>Gen. 49:10</a>; <a href='/AIV/11/12/20'>1 Kings 12:20</a>",
      "comment": "Judah and Joseph (Ephraim) refer to the southern and northern kingdoms, separated after Solomon. The use of 'stick' anticipates later symbolic actions."
    },
    {
      "pk": 33037017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 17,
      "text": "'Then join them into one stick, so that they become one in your hand.'",
      "links": "<a href='/AIV/26/37/22'>Ezek. 37:22</a>; <a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "The act represents reunion—God’s plan to restore unity among His people, an enduring hallmark of authentic ecclesial tradition."
    },
    {
      "pk": 33037018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 18,
      "text": "'When your people ask you, Will you not tell us what these things mean to you?'",
      "links": "<a href='/AIV/26/24/19'>Ezek. 24:19</a>",
      "comment": "Symbolic actions often prompted questions from onlookers, allowing the prophet to explain profound theological truths."
    },
    {
      "pk": 33037019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 19,
      "text": "'Say to them, This is what the Lord GOD says: Behold, I am about to take the stick of Joseph, which is in the hand of Ephraim, and the tribes of Israel associated with him, and I will join it with the stick of Judah, and make them one stick, so they will be one in My hand.'",
      "links": "<a href='/AIV/11/11/31'>1 Kings 11:31</a>; <a href='/AIV/26/37/16-17'>Ezek. 37:16-17</a>",
      "comment": "God Himself accomplishes the reunification of the divided kingdom—a sign of sovereign intervention and foreshadowing of unity among God’s chosen."
    },
    {
      "pk": 33037020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 20,
      "text": "The sticks on which you write will be in your hand before their eyes.",
      "links": "<a href='/AIV/26/12/6'>Ezek. 12:6</a>; <a href='/AIV/26/24/24'>Ezek. 24:24</a>",
      "comment": "The visible sign offers confirmation, making God's promise tangible and clear to all."
    },
    {
      "pk": 33037021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 21,
      "text": "Then say to them, 'This is what the Lord GOD says: See, I will take the children of Israel from among the nations where they have gone, and will gather them from all around, and bring them to their own land.'",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "The regathering from exile highlights God’s faithfulness and echoes His historic covenants with Israel."
    },
    {
      "pk": 33037022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 22,
      "text": "'And I will make them one nation in the land, on the mountains of Israel, and one king will rule over all of them; they will no longer be two nations nor divided into two kingdoms.'",
      "links": "<a href='/AIV/26/34/23-24'>Ezek. 34:23-24</a>; <a href='/AIV/25/1/1'>Lam. 1:1</a>",
      "comment": "The promise of one king points forward to the messianic expectation, fulfilled spiritually through the unity of faith under Christ."
    },
    {
      "pk": 33037023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 23,
      "text": "'They will no longer defile themselves with their idols or detestable things or with any of their transgressions; but I will save them from all their sinful backsliding and will cleanse them. Then they will be My people, and I will be their God.'",
      "links": "<a href='/AIV/26/36/25'>Ezek. 36:25</a>; <a href='/AIV/19/51/2'>Ps. 51:2</a>",
      "comment": "Divine cleansing suggests an interior transformation—renewal of heart and spirit—which is foundational to authentic communion with God."
    },
    {
      "pk": 33037024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 24,
      "text": "'My servant David will be king over them, and they will all have one shepherd. They will follow My judgments and be careful to obey My statutes.'",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Referring to David as shepherd and king points to the messianic role, ultimately fulfilled in Jesus as the Good Shepherd (John 10:11), and the continuity of true leadership in the visible Church."
    },
    {
      "pk": 33037025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 25,
      "text": "'They will live in the land that I gave to My servant Jacob, the land in which your ancestors lived. They and their children and their children's children will dwell there forever, and David My servant will be their prince forever.'",
      "links": "<a href='/AIV/1/35/12'>Gen. 35:12</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "The eternal dwelling and princely leadership anticipate both earthly and heavenly fulfillment—perpetual unity and succession echoing the enduring structure of Christ’s people."
    },
    {
      "pk": 33037026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 26,
      "text": "'I will make a covenant of peace with them; it will be an everlasting covenant. I will establish them, increase them, and set My sanctuary among them forever.'",
      "links": "<a href='/AIV/26/16/60'>Ezek. 16:60</a>; <a href='/AIV/58/10/19'>Heb. 10:19</a>",
      "comment": "An everlasting covenant is progressively revealed throughout Scripture. The sanctuary’s permanent presence signifies God’s dwelling with His people, both literally and spiritually."
    },
    {
      "pk": 33037027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 27,
      "text": "'My dwelling place will be with them; I will be their God, and they will be My people.'",
      "links": "<a href='/AIV/26/11/20'>Ezek. 11:20</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "This pledge climaxes in Revelation, where God dwells with His people eternally. It hints at a visible, united community set apart for worship and holiness."
    },
    {
      "pk": 33037028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 37,
      "verse": 28,
      "text": "'Then the nations will know that I am the LORD who sets Israel apart, when My sanctuary is among them forever.'",
      "links": "<a href='/AIV/26/36/23'>Ezek. 36:23</a>; <a href='/AIV/66/21/22'>Rev. 21:22</a>",
      "comment": "God’s visible sanctuary is a sign for all nations. Its permanence points to an everlasting, holy order and a singular, visible worship—foreshadowing universal fulfillment in Christ’s people."
    }
  ],
  "translatedAt": "2025-12-24T09:19:06.504Z"
}