{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 24,
  "verses": [
    {
      "pk": 33024001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 1,
      "text": "In the ninth year, in the tenth month, on the tenth day of the month, the word of the LORD came to me:",
      "links": "<a href='/AIV/12/25/1'>2 Kings 25:1</a>; <a href='/AIV/24/52/4'>Jeremiah 52:4</a>",
      "comment": "This verse marks a pivotal historical moment—the start of Jerusalem's siege. The precise dating shows God acts within real human history."
    },
    {
      "pk": 33024002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 2,
      "text": "“Son of man, write down today’s date, for today the king of Babylon has begun his siege against Jerusalem.”",
      "links": "<a href='/AIV/24/39/1'>Jeremiah 39:1</a>; <a href='/AIV/24/52/4-5'>Jeremiah 52:4-5</a>",
      "comment": "Ezekiel is to record this crucial event, showing the significance of prophecy being fulfilled on a known day. It shows God's sovereignty over history."
    },
    {
      "pk": 33024003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 3,
      "text": "“Speak this parable to the rebellious house and say to them: ‘This is what the Lord GOD says: Set a pot on the fire, set it on, and pour water into it.’”",
      "links": "<a href='/AIV/26/3/7-9'>Ezekiel 3:7-9</a>; <a href='/AIV/23/1/5-6'>Isaiah 1:5-6</a>",
      "comment": "The 'rebellious house' is Israel. The pot image begins a parable—with the pot symbolizing Jerusalem. This method of prophetic teaching is seen through Ezekiel's ministry."
    },
    {
      "pk": 33024004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 4,
      "text": "‘Put in it the pieces of meat, every good piece – thigh and shoulder. Fill it with the best bones.’",
      "links": "<a href='/AIV/24/6/13'>Jeremiah 6:13</a>",
      "comment": "The best cuts represent Jerusalem's elite. The fullness symbolizes the whole city involved in judgment, connecting God's justice to all people—regardless of status."
    },
    {
      "pk": 33024005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 5,
      "text": "‘Take the choicest of the flock, pile the wood underneath the pot, bring it to a boil, and cook the bones in it.’",
      "links": "<a href='/AIV/26/22/18-22'>Ezekiel 22:18-22</a>",
      "comment": "The sacrificial language links to the holiness of God's judgment. Heat and boiling suggest purification—a theme throughout both Old and New Testaments."
    },
    {
      "pk": 33024006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 6,
      "text": "‘Therefore, this is what the Lord GOD says: Woe to the bloody city, to the pot whose corrosion is in it and whose corrosion has not gone out! Empty it piece by piece; no lot has fallen on it.’",
      "links": "<a href='/AIV/26/22/2'>Ezekiel 22:2</a>; <a href='/AIV/23/1/15'>Isaiah 1:15</a>",
      "comment": "Corrosion and blood emphasize Jerusalem’s sin. God’s judgment is impartial—each piece judged, suggesting original sin and spiritual accountability."
    },
    {
      "pk": 33024007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 7,
      "text": "‘For her blood is inside her; she put it on the bare rock, she did not pour it out on the ground to cover it with dust.’",
      "links": "<a href='/AIV/01/4/10'>Genesis 4:10</a>; <a href='/AIV/19/79/3'>Psalm 79:3</a>",
      "comment": "The exposed blood signifies unrepentant sin, echoing Cain's murder (Genesis 4:10). Israel’s public sin requires public judgment, a theme fulfilled in Christ's Passion."
    },
    {
      "pk": 33024008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 8,
      "text": "‘So I have put her blood on bare rock, so that it should not be covered, to bring wrath and to take vengeance. I have set her blood on bare rock, that it may not be covered.’",
      "links": "<a href='/AIV/26/5/8-9'>Ezekiel 5:8-9</a>",
      "comment": "Divine justice requires full revelation. This displays God's wrath and retributive justice, ultimately pointing toward Christ, who atones for exposed sin."
    },
    {
      "pk": 33024009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 9,
      "text": "‘Therefore, this is what the Lord GOD says: Woe to the bloody city! I myself will make the pile great.’",
      "links": "<a href='/AIV/26/9/8'>Ezekiel 9:8</a>",
      "comment": "God Himself enacts judgment—there is no escape, highlighting the seriousness of sin and the need for mediation between God and mankind."
    },
    {
      "pk": 33024010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 10,
      "text": "‘Heap on the wood, kindle the fire, boil the meat well, mix in the spices, and let the bones be burned.’",
      "links": "<a href='/AIV/26/39/9-10'>Ezekiel 39:9-10</a>",
      "comment": "This thorough burning signifies complete purification, reminiscent of sacrificial rites—pointing to the fullness of spiritual cleansing through divine grace."
    },
    {
      "pk": 33024011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 11,
      "text": "‘Then set the empty pot on the coals so it may become hot and its bronze may glow, so its filth may be melted in it, and its corrosion consumed.’",
      "links": "<a href='/AIV/26/22/19-22'>Ezekiel 22:19-22</a>",
      "comment": "The pot itself must be purified, an image of sanctification—God’s action not just forgiving, but cleansing the soul, paralleling baptismal purification."
    },
    {
      "pk": 33024012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 12,
      "text": "‘She has wearied herself with wickedness; her corrosion is great. Even by fire her highly corroded filth will not go out.’",
      "links": "<a href='/AIV/26/36/25'>Ezekiel 36:25</a>",
      "comment": "Even harsh judgment cannot cleanse fully, pointing to the need for a deeper savior and healer, fulfillment found in Jesus’ sacrificial cleansing."
    },
    {
      "pk": 33024013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 13,
      "text": "‘Because of your filthy lewdness—since I tried to cleanse you but you refused to be purified—you will not be cleansed from your uncleanness until I have exhausted My wrath upon you.’",
      "links": "<a href='/AIV/26/20/38'>Ezekiel 20:38</a>",
      "comment": "This verse shows repeated divine attempts at purification, but ultimate cleansing awaits God’s full dealing with sin. The concept of grace and cooperation emerges here."
    },
    {
      "pk": 33024014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 14,
      "text": "‘I, the LORD, have spoken; it will happen. I will do it; I will not hold back, nor will I show pity or change My mind. You will be judged according to your ways, says the Lord GOD.’",
      "links": "<a href='/AIV/26/5/11'>Ezekiel 5:11</a>; <a href='/AIV/26/36/36'>Ezekiel 36:36</a>",
      "comment": "Judgment is certain—God is faithful even in discipline. This direct act prefigures the necessity of atonement, pointing ahead to Christ’s definitive sacrifice."
    },
    {
      "pk": 33024015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 15,
      "text": "The word of the LORD came to me:",
      "links": "",
      "comment": "A new oracle begins, showing Ezekiel’s role as a unique intermediary—prophets serve as living signs, reinforcing God's ongoing relationship with His chosen people."
    },
    {
      "pk": 33024016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 16,
      "text": "“Son of man, I am about to take away from you the delight of your eyes with a sudden blow. Yet you shall not mourn or weep, nor shall your tears run down.”",
      "links": "<a href='/AIV/26/21/6'>Ezekiel 21:6</a>; <a href='/AIV/19/39/9'>Psalm 39:9</a>",
      "comment": "Ezekiel’s grief must be internal, signifying the depth of spiritual suffering and silent obedience—an image of offering pain to God in faith."
    },
    {
      "pk": 33024017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 17,
      "text": "“Groan silently; do not observe mourning rites for the dead. Bind your turban on your head, and put your sandals on your feet. Do not cover your lips or eat the bread of mourners.”",
      "links": "<a href='/AIV/03/10/6'>Leviticus 10:6</a>; <a href='/AIV/24/16/5'>Jeremiah 16:5</a>",
      "comment": "Ezekiel’s behavior points to ritual obedience and the supersession of public grief, representing spiritual detachment—a concept found in ascetic Christian tradition."
    },
    {
      "pk": 33024018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 18,
      "text": "So I spoke to the people in the morning, and in the evening my wife died. The next morning I did as I had been commanded.",
      "links": "",
      "comment": "Ezekiel’s personal loss becomes a prophetic sign, not just for himself but for all Israel—a living parable on divine obedience, sacrifice, and trust in God’s will."
    },
    {
      "pk": 33024019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 19,
      "text": "And the people said to me, ‘Will you not tell us what these things mean for us, that you are acting this way?’",
      "links": "",
      "comment": "The people perceive the prophetic symbolism. Human questioning of divine action is a motif throughout Scripture; prophetic signs always invite deeper spiritual understanding."
    },
    {
      "pk": 33024020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 20,
      "text": "Then I answered them, ‘The word of the LORD came to me, saying,’",
      "links": "",
      "comment": "Ezekiel points back to God’s initiative—prophets speak only what is revealed. This models the relationship between divine authority and human response."
    },
    {
      "pk": 33024021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 21,
      "text": "‘Say to the house of Israel: “This is what the Lord GOD says: I am about to desecrate My sanctuary, the pride of your strength, the delight of your eyes, and that which your soul pities. Your sons and daughters whom you left behind will fall by the sword.”’",
      "links": "<a href='/AIV/26/7/21-22'>Ezekiel 7:21-22</a>; <a href='/AIV/24/19/1'>Jeremiah 19:1</a>",
      "comment": "The loss of the temple is catastrophic—God’s presence leaves the sanctuary. This prefigures the transition to a new covenant where God dwells directly with His people."
    },
    {
      "pk": 33024022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 22,
      "text": "‘You shall do as I have done: You shall not cover your lips, nor eat the bread of mourners.’",
      "links": "<a href='/AIV/26/24/17'>Ezekiel 24:17</a>",
      "comment": "Israel must mirror Ezekiel’s behavior—mourning is forbidden, indicating God’s judgments are too deep for mere human rituals, implying a need for deeper spiritual transformation."
    },
    {
      "pk": 33024023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 23,
      "text": "‘Your turbans shall be on your heads and your sandals on your feet; you shall not mourn or weep, but you shall waste away in your iniquities and groan to one another.’",
      "links": "<a href='/AIV/03/10/6'>Leviticus 10:6</a>",
      "comment": "External signs are set aside—the focus is on the internal consequences of sin. This spiritualizes grief and points to the need for conversion over ritual."
    },
    {
      "pk": 33024024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 24,
      "text": "‘Thus Ezekiel will be a sign to you; according to all that he has done, you shall do. When this comes, then you will know that I am the Lord GOD.’",
      "links": "<a href='/AIV/26/12/6'>Ezekiel 12:6</a>; <a href='/AIV/26/33/29'>Ezekiel 33:29</a>",
      "comment": "Prophetic signs confirm God's identity. Through obedience to God, people recognize divine authority—a principle fully realized through Christ, the perfect sign."
    },
    {
      "pk": 33024025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 25,
      "text": "‘And as for you, son of man, on the day I take from them their stronghold, their joy and glory, the delight of their eyes, and their sons and daughters,’",
      "links": "<a href='/AIV/26/7/22'>Ezekiel 7:22</a>",
      "comment": "This links the loss of physical blessings to spiritual desolation. Human comforts vanish, pointing toward the hope of restoration only found in God’s mercy."
    },
    {
      "pk": 33024026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 26,
      "text": "‘on that day one who escapes will come to you to report it to you.’",
      "links": "<a href='/AIV/26/33/21'>Ezekiel 33:21</a>",
      "comment": "Eyewitness testimony will confirm the prophecy’s fulfillment. Personal transmission of revelation is emphasized here, paralleling the realm of Tradition in Christian faith."
    },
    {
      "pk": 33024027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 24,
      "verse": 27,
      "text": "‘On that day your mouth will be opened to the one who has escaped; you shall speak and no longer be silent. So you will be a sign to them, and they will know that I am the LORD.’",
      "links": "<a href='/AIV/26/3/27'>Ezekiel 3:27</a>; <a href='/AIV/26/33/22'>Ezekiel 33:22</a>",
      "comment": "Ezekiel’s speech resumes when God’s prophecy is fulfilled, symbolizing the restoration of prophetic voice—a hint of the Spirit’s renewal of God’s people. Christologically, it foreshadows Christ opening the way for full revelation and divine knowledge."
    }
  ],
  "translatedAt": "2025-12-24T09:11:40.601Z"
}