{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 4,
  "verses": [
    {
      "pk": 33004001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 1,
      "text": "Now you, son of man, take a clay tablet and set it before yourself, and draw upon it the city of Jerusalem.",
      "links": "<a href='/AIV/23/8/1'>Isa. 8:1</a>; <a href='/AIV/26/2/1'>Ezek. 2:1</a>",
      "comment": "Ezekiel is instructed to use a clay tablet as a symbol of Jerusalem. The use of visual representations is common in prophetic literature to reveal God's message in a vivid way (see Isa. 8:1)."
    },
    {
      "pk": 33004002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 2,
      "text": "Lay siege against it: build up a ramp, set up camps against it, and put battering rams all around it.",
      "links": "<a href='/AIV/25/1/10'>Lam. 1:10</a>; <a href='/AIV/26/21/22'>Ezek. 21:22</a>",
      "comment": "This dramatic depiction foreshadows the actual Babylonian siege. The prophet’s actions are not just an illustration but also a mediation—a role later shown more fully in Christ’s saving work."
    },
    {
      "pk": 33004003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 3,
      "text": "Then take an iron pan and set it as an iron wall between yourself and the city, and set your face toward it so that it is under siege. This is a sign to the house of Israel.",
      "links": "<a href='/AIV/23/48/2'>Isa. 48:2</a>; <a href='/AIV/26/12/6'>Ezek. 12:6</a>",
      "comment": "The iron pan represents the unyielding separation and judgment. The prophet’s intercession parallels Christ’s mediation, who stands between humanity and judgment (see Isa. 48:2 for similar symbolic actions)."
    },
    {
      "pk": 33004004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 4,
      "text": "Lie on your left side and place the guilt of the house of Israel upon it. For the number of days that you lie on it, you shall bear their guilt.",
      "links": "<a href='/AIV/25/3/39'>Lam. 3:39</a>; <a href='/AIV/26/18/20'>Ezek. 18:20</a>",
      "comment": "Ezekiel physically bearing Israel’s guilt foreshadows the concept of vicarious suffering—a significant theme that points to Christ bearing the sins of humanity (Lam. 3:39; Isa. 53)."
    },
    {
      "pk": 33004005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 5,
      "text": "For I have assigned you the years of their guilt as a number of days—three hundred ninety days—you shall bear the guilt of the house of Israel.",
      "links": "<a href='/AIV/26/29/13'>Ezek. 29:13</a>",
      "comment": "The specific number suggests an extended period of punishment, emphasizing that God’s justice considers the full measure of guilt and restoration. The concept of temporal judgment and restoration parallels later teachings on purification before final union with God."
    },
    {
      "pk": 33004006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 6,
      "text": "When you have completed those days, lie again on your right side and bear the guilt of the house of Judah, for forty days. I have assigned you one day for each year.",
      "links": "<a href='/AIV/4/14/34'>Num. 14:34</a>; <a href='/AIV/26/16/61'>Ezek. 16:61</a>",
      "comment": "One day for each year mirrors the principle found in Numbers 14:34. This division underlines both personal and communal responsibility in God’s plan, echoing a sacramental understanding of suffering and mediation."
    },
    {
      "pk": 33004007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 7,
      "text": "Turn your face toward the siege of Jerusalem, and with your arm uncovered, prophesy against it.",
      "links": "<a href='/AIV/23/52/10'>Isa. 52:10</a>; <a href='/AIV/26/6/2'>Ezek. 6:2</a>",
      "comment": "The uncovered arm displays readiness for action, symbolizing strength and the authority given to prophets, closely tied to divine power made manifest as seen in Isa. 52:10 and fulfilled in greater degree in Christ’s incarnate ministry."
    },
    {
      "pk": 33004008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 8,
      "text": "See, I will tie you up with cords so you cannot turn from one side to the other until you have completed the days of your siege.",
      "links": "<a href='/AIV/26/3/25'>Ezek. 3:25</a>",
      "comment": "Ezekiel’s restriction demonstrates the certainty of judgment. The image of being bound recalls the cost and endurance required for intercessory work, pointing deeper to the suffering endured by the Messiah."
    },
    {
      "pk": 33004009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 9,
      "text": "Take wheat, barley, beans, lentils, millet, and spelt. Put them into one vessel and make bread from them during the number of days you lie on your side—three hundred ninety days you shall eat it.",
      "links": "<a href='/AIV/3/2/13'>Lev. 2:13</a>; <a href='/AIV/26/44/3'>Ezek. 44:3</a>",
      "comment": "This symbolic bread mixes many grains, representing poverty and scarcity. Bread remains a central symbol in scripture, anticipating the mystery of the true bread that gives everlasting life (see John 6:35; Lev. 2:13)."
    },
    {
      "pk": 33004010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 10,
      "text": "Your food, which you eat, shall be by weight—twenty shekels a day. You shall eat from it at fixed times.",
      "links": "<a href='/AIV/2/16/16'>Ex. 16:16</a>",
      "comment": "The rationed bread displays the seriousness of famine, echoing the dependence on God seen in the manna story (Ex. 16:16). The discipline of fixed meals reflects early liturgical ordering of time and life."
    },
    {
      "pk": 33004011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 11,
      "text": "You shall also drink water by measure—a sixth of a hin. You shall drink it at fixed times.",
      "links": "<a href='/AIV/3/11/34'>Lev. 11:34</a>",
      "comment": "Measured water continues the symbolism of scarcity and establishes discipline. Water is a recurring image of spiritual life and purification (John 4:14)."
    },
    {
      "pk": 33004012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 12,
      "text": "Eat it as barley cakes, and bake it using human dung in their sight.",
      "links": "<a href='/AIV/23/36/16'>Isa. 36:16</a>; <a href='/AIV/26/22/15'>Ezek. 22:15</a>",
      "comment": "This shocking command underscores ritual impurity and the loss of spiritual dignity, anticipating a need for deeper purification. The gravity points to the need for interior transformation and sanctification."
    },
    {
      "pk": 33004013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 13,
      "text": "Then the LORD said, 'Thus shall the people of Israel eat their bread unclean among the nations where I will scatter them.'",
      "links": "<a href='/AIV/26/5/10'>Ezek. 5:10</a>; <a href='/AIV/3/11/47'>Lev. 11:47</a>",
      "comment": "Forced eating among the nations declares both exile and ritual uncleanness, reminiscent of the dispersion. Still, the scattering prepares for ultimate regathering and unity, a theme fulfilled in Christ (see John 11:52)."
    },
    {
      "pk": 33004014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 14,
      "text": "But I said, 'Ah, Lord GOD, I have never defiled myself; from my youth until now, I have not eaten anything found dead or torn by beasts, nor has impure meat entered my mouth.'",
      "links": "<a href='/AIV/3/11/39'>Lev. 11:39</a>; <a href='/AIV/26/44/31'>Ezek. 44:31</a>",
      "comment": "Ezekiel’s objection stresses commitment to holiness and purity—anticipating the holiness required for those set apart for God’s service. This echoes concern for ritual preparation found in later consecration rites."
    },
    {
      "pk": 33004015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 15,
      "text": "Then He said to me, 'See, I give you cow dung instead of human dung, and you shall bake your bread with it.'",
      "links": "<a href='/AIV/26/44/31'>Ezek. 44:31</a>",
      "comment": "Divine concession allows lesser impurity, but does not remove the sign of judgment. This points to God’s compassion even in punishment, foreshadowing mercy offered in mediation."
    },
    {
      "pk": 33004016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 16,
      "text": "He said to me, 'Son of man, I am breaking the staff of bread in Jerusalem. They shall eat bread by weight and anxiety, and drink water by measure and despair.'",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>; <a href='/AIV/23/3/1'>Isa. 3:1</a>",
      "comment": "The ‘staff of bread’ recalls God as provider. Its break foreshadows spiritual famine and the search for true nourishment, paralleling later teaching on the true bread from heaven (see John 6:51)."
    },
    {
      "pk": 33004017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 4,
      "verse": 17,
      "text": "So that they may lack bread and water, be astonished at one another, and waste away in their guilt.",
      "links": "<a href='/AIV/26/24/23'>Ezek. 24:23</a>; <a href='/AIV/23/9/20'>Isa. 9:20</a>",
      "comment": "The physical distress symbolizes spiritual poverty and the consequences of separation from God. Yet, astonishment prepares them for deeper conversion and restoration, a mystery fulfilled in the Messiah’s redemption."
    }
  ],
  "translatedAt": "2025-12-24T09:00:11.561Z"
}