{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 31,
  "verses": [
    {
      "pk": 33031001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 1,
      "text": "In the eleventh year, in the third month, on the first day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "This introduces another prophetic oracle against Egypt. The specific dating demonstrates the historical reliability of the account."
    },
    {
      "pk": 33031002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 2,
      "text": "Son of man, say to Pharaoh king of Egypt and to his multitude: ‘Whom are you like in your greatness?’",
      "links": "<a href='/AIV/23/14/4'>Isa. 14:4</a>; <a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "The question directed at Pharaoh highlights his pride. The prophet often uses parable-like addresses to world rulers."
    },
    {
      "pk": 33031003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 3,
      "text": "Behold, Assyria was a cedar in Lebanon, beautiful in its branches, shade-giving forest, towering in height, with its top among the clouds.",
      "links": "<a href='/AIV/26/17/3'>Ezek. 17:3</a>; <a href='/AIV/27/4/20-22'>Dan. 4:20-22</a>",
      "comment": "Assyria is compared to a magnificent cedar, a symbol of pride and strength, similar to Nebuchadnezzar's dream in Daniel. The cedar imagery is also used for righteous figures as in Psalm 92:12."
    },
    {
      "pk": 33031004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 4,
      "text": "The waters nourished it, the deep made it grow tall, making its rivers flow around the place where it was planted, and sending out its channels to all the trees of the field.",
      "links": "<a href='/AIV/01/2/10'>Gen. 2:10</a>; <a href='/AIV/19/104/16'>Ps. 104:16</a>",
      "comment": "Abundant water, often a metaphor for blessing and life, alludes to paradise imagery. In the tradition, waters represent God’s providence, sustaining both individuals and nations."
    },
    {
      "pk": 33031005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 5,
      "text": "So it was lofty in its height above all the trees of the field; its boughs multiplied and its branches grew long because of all the abundant water as it spread out.",
      "links": "<a href='/AIV/26/31/7'>Ezek. 31:7</a>",
      "comment": "The growing branches signify expansive influence. The image recalls both earthly kingdoms and, spiritually, those who flourish in the Lord (see Ps. 1:3)."
    },
    {
      "pk": 33031006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 6,
      "text": "All the birds of the heavens nested in its branches. All the beasts of the field gave birth under its shade, and all great nations lived under its shelter.",
      "links": "<a href='/AIV/27/4/21-22'>Dan. 4:21-22</a>; <a href='/AIV/40/13/32'>Matt. 13:32</a>",
      "comment": "This verse ties in with the classic Old Testament theme of world empires as great trees. Jesus refers to this imagery in the parable of the mustard seed, identifying the kingdom of heaven as a great tree giving shelter to the nations."
    },
    {
      "pk": 33031007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 7,
      "text": "It was beautiful in its greatness, in the length of its branches, for its roots reached to abundant waters.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "The tree’s beauty depends on its roots, a spiritual reminder that true greatness comes through being rooted close to God and his life-giving grace."
    },
    {
      "pk": 33031008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 8,
      "text": "The cedars in the garden of God could not hide it; fir trees could not compare with its boughs, and the plane trees had nothing like its branches. No tree in the garden of God was its equal in beauty.",
      "links": "<a href='/AIV/01/2/9-10'>Gen. 2:9-10</a>",
      "comment": "The ‘garden of God’ references Eden, symbolizing divine favor. The idea that none were equal hints at humanity’s original calling to communion with God, later restored in the new creation imagery of Revelation."
    },
    {
      "pk": 33031009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 9,
      "text": "I made it beautiful with the abundance of its branches, and all the trees of Eden envied it, those in the garden of God.",
      "links": "<a href='/AIV/01/3/6'>Gen. 3:6</a>; <a href='/AIV/26/28/13'>Ezek. 28:13</a>",
      "comment": "God Himself claims responsibility for its splendor, underscoring how all greatness is ultimately from the LORD—a truth underlying the doctrine of grace and the necessity of remaining in humble dependence."
    },
    {
      "pk": 33031010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 10,
      "text": "Therefore thus says the Lord GOD: Because it was lofty in stature, and set its top among the clouds, and its heart was lifted up in its height,",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Pride always precedes a fall (see also Prov. 16:18); the king’s arrogance reflects Satan’s pride (cf. Ezek. 28), providing a spiritual warning about humility."
    },
    {
      "pk": 33031011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 11,
      "text": "I handed it over to a mighty one of the nations; he shall surely deal with it. I have driven it out for its wickedness.",
      "links": "<a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>; <a href='/AIV/26/30/10'>Ezek. 30:10</a>",
      "comment": "Judgment comes through another nation, a theme repeating throughout the prophets. All world powers are accountable to God’s justice, which governs both earthly and spiritual kingdoms."
    },
    {
      "pk": 33031012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 12,
      "text": "Foreigners, the most ruthless of nations, have cut it down and left it. Its branches have fallen on the mountains and in all the valleys, and its boughs are broken in all the ravines of the land, so that all the peoples of the earth departed from its shade and abandoned it.",
      "links": "<a href='/AIV/26/30/11-12'>Ezek. 30:11-12</a>",
      "comment": "The powerful are brought low, abandoned at their fall. Such imagery is echoed in Revelation’s laments over fallen world powers (see Rev. 18)."
    },
    {
      "pk": 33031013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 13,
      "text": "On its fallen trunk all the birds of the heavens dwell, and on its branches all the beasts of the field will be.",
      "links": "<a href='/AIV/27/4/23'>Dan. 4:23</a>",
      "comment": "After its fall, the tree becomes a dwelling for birds and beasts. The fall of great powers gives way to disorder, but in God’s redemptive plan, new growth is possible—a pattern resembling the promise of resurrection after humiliation."
    },
    {
      "pk": 33031014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 14,
      "text": "So that all the trees by the waters may not exalt themselves in their height or set their tops among the clouds, and none that drink water may trust in their own greatness, for they all are delivered to death, to the depths of the earth, among the children of man, with those who go down to the pit.",
      "links": "<a href='/AIV/19/49/14'>Ps. 49:14</a>; <a href='/AIV/23/14/15'>Isa. 14:15</a>",
      "comment": "No matter human greatness, all face death; this foreshadows the Christian teaching on humility and the need for grace for salvation rather than presumption in earthly achievement."
    },
    {
      "pk": 33031015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 15,
      "text": "Thus says the Lord GOD: On the day it went down to Sheol I caused mourning; I covered the deep for it, restrained its rivers, and the great waters were held back. I clothed Lebanon in gloom for it, and all the trees of the field fainted because of it.",
      "links": "<a href='/AIV/23/14/9-11'>Isa. 14:9-11</a>; <a href='/AIV/26/32/7'>Ezek. 32:7</a>",
      "comment": "The dramatic language demonstrates that the downfall of empires affects all creation. Sheol here refers to the abode of the dead, showing the totality of God’s judgment."
    },
    {
      "pk": 33031016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 16,
      "text": "I made the nations shake at the sound of its fall, when I cast it down to Sheol with those who go down to the pit. And all the trees of Eden, the choice and best of Lebanon, all that drink water, were comforted in the depths of the earth.",
      "links": "<a href='/AIV/23/2/19'>Isa. 2:19</a>; <a href='/AIV/26/28/14'>Ezek. 28:14</a>",
      "comment": "The fall of Assyria brings a warning to all nations and a type of perverse ‘comfort’ to those already judged, suggesting a communion in downfall that highlights our need for union with Christ, who conquers death."
    },
    {
      "pk": 33031017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 17,
      "text": "They also went down to Sheol with it, to those slain by the sword—those who were its arm, who lived under its shade among the nations.",
      "links": "<a href='/AIV/26/32/18-21'>Ezek. 32:18-21</a>",
      "comment": "Those allied to Assyria share in its fate. The communal aspect underscores the scriptural teaching about solidarity in both sin and redemption, which finds fulfillment in the One who forms His mystical body."
    },
    {
      "pk": 33031018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 31,
      "verse": 18,
      "text": "Which among the trees of Eden was like you in glory and in greatness? Yet you will be brought down with the trees of Eden to the depths of the earth; you shall lie among the uncircumcised, with those slain by the sword. This is Pharaoh and all his multitude,’ declares the Lord GOD.",
      "links": "<a href='/AIV/26/28/13'>Ezek. 28:13</a>; <a href='/AIV/23/14/9'>Isa. 14:9</a>",
      "comment": "The warning is that even the greatest are brought low outside of union with God and the covenant. The image of lying among the uncircumcised depicts exclusion from God’s people, foreshadowing the necessity to belong to the true covenant community initiated by Christ."
    }
  ],
  "translatedAt": "2025-12-24T09:15:29.893Z"
}