{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 45,
  "verses": [
    {
      "pk": 33045001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 1,
      "text": "When you divide the land by lot as an inheritance, you shall set apart a holy portion for the Lord, a length of twenty-five thousand cubits and a width of twenty thousand cubits. This entire area shall be holy.",
      "links": "<a href='/AIV/04/34/13'>Num. 34:13</a>; <a href='/AIV/26/42/20'>Ezek. 42:20</a>",
      "comment": "The detailed measurement highlights God's order and holiness. The holy portion is to be set apart first, pointing to the primacy of worship and sacred service in life (cf. Matt. 6:33)."
    },
    {
      "pk": 33045002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 2,
      "text": "Of this area, a square measuring five hundred by five hundred cubits shall be set apart for the sanctuary, along with a fifty cubit wide open space surrounding it.",
      "links": "<a href='/AIV/26/42/15-20'>Ezek. 42:15-20</a>; <a href='/AIV/02/25/8'>Exod. 25:8</a>",
      "comment": "The precise layout underlines reverence for the sanctuary, hinting at the sanctification of time, space, and material things for the Lord. The open space may symbolize separation and purity necessary for approaching God."
    },
    {
      "pk": 33045003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 3,
      "text": "From this holy plot, you shall measure out twenty-five thousand cubits in length and ten thousand cubits in width, and in it shall be the sanctuary, the most holy place.",
      "links": "<a href='/AIV/02/26/33'>Exod. 26:33</a>; <a href='/AIV/11/8/6-9'>1 Kings 8:6-9</a>",
      "comment": "Centralizing the sanctuary suggests the centrality of worship and the sacramental presence of God among His people. The 'most holy place' anticipates a divine dwelling, pointing forward to Christ, the true temple (cf. John 2:19)."
    },
    {
      "pk": 33045004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 4,
      "text": "It is a holy portion of the land; it shall belong to the priests, the ministers of the sanctuary, who draw near to minister to the Lord. It shall be for their houses and for a place set apart for the sanctuary.",
      "links": "<a href='/AIV/04/18/20'>Num. 18:20</a>; <a href='/AIV/26/44/15'>Ezek. 44:15</a>",
      "comment": "The special inheritance for the priests mirrors the perpetual priestly ministry. There is emphasis on the role of sacramental mediation, a theme later fulfilled in Christ, our High Priest (Heb. 4:14–16)."
    },
    {
      "pk": 33045005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 5,
      "text": "And another area, twenty-five thousand cubits long and ten thousand cubits wide, shall be for the Levites, the servants of the temple. It shall be their possession for cities in which to live.",
      "links": "<a href='/AIV/06/21/1-3'>Josh. 21:1-3</a>; <a href='/AIV/04/35/2'>Num. 35:2</a>",
      "comment": "The Levites' share guarantees the continual presence of ministers for the temple. The deep link between liturgy and community is implied, with sacred ministry enabling the people to be drawn into worship."
    },
    {
      "pk": 33045006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 6,
      "text": "Alongside the holy portion, you shall assign an area twenty-five thousand cubits long and ten thousand cubits wide for the city. It shall belong to all the house of Israel.",
      "links": "<a href='/AIV/26/48/15-19'>Ezek. 48:15-19</a>; <a href='/AIV/19/122/3-4'>Ps. 122:3-4</a>",
      "comment": "This civic space suggests the unity of worship and daily life for all Israel, reflecting a holistic view of faith that integrates sacred and secular. It foreshadows the vision of the heavenly city in Revelation 21."
    },
    {
      "pk": 33045007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 7,
      "text": "Now, to the prince shall belong land on both sides of the holy portion and the city's property, facing the holy portion and the city, from the west side to the east side. Its length shall be equal to one of the tribal portions. It shall belong to the prince.",
      "links": "<a href='/AIV/26/44/3'>Ezek. 44:3</a>; <a href='/AIV/26/48/21-22'>Ezek. 48:21-22</a>",
      "comment": "The prince’s role is highlighted, suggesting both an earthly ruler and hinting toward messianic expectations. Early Christian tradition saw fulfillment in Christ as both king and priest (cf. Zech. 6:13; Luke 1:32–33)."
    },
    {
      "pk": 33045008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 8,
      "text": "It shall be his land as a possession in Israel. Then My princes shall no longer oppress My people, but they shall give the rest of the land to the house of Israel according to their tribes.",
      "links": "<a href='/AIV/26/22/27'>Ezek. 22:27</a>; <a href='/AIV/26/46/18'>Ezek. 46:18</a>",
      "comment": "The prince’s justice is emphasized—you see a call for righteous leadership, a major biblical theme. This contrasts worldly rulers with the ideal of servant-leadership exemplified by Jesus."
    },
    {
      "pk": 33045009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 9,
      "text": "Thus says the Lord God: Enough, O princes of Israel! Remove violence and oppression, and practice justice and righteousness. Stop evicting My people from their inherited land, declares the Lord God.",
      "links": "<a href='/AIV/23/1/17'>Isa. 1:17</a>; <a href='/AIV/26/22/6-12'>Ezek. 22:6-12</a>",
      "comment": "The strong prophetic rebuke calls leaders to reflect divine justice. This echoes the demand for charity and mercy, a key theme in both Testaments and Church tradition (cf. James 1:27)."
    },
    {
      "pk": 33045010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 10,
      "text": "You shall have honest scales, an honest ephah, and an honest bath.",
      "links": "<a href='/AIV/03/19/36'>Lev. 19:36</a>; <a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "Requirements for fair measures demonstrate God’s concern for truth in commerce—an often overlooked aspect of living out one’s faith with integrity."
    },
    {
      "pk": 33045011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 11,
      "text": "The ephah and the bath shall be of the same measure, so that the bath contains one-tenth of a homer, and the ephah one-tenth of a homer. Their measurement shall be according to the homer.",
      "links": "<a href='/AIV/03/27/16'>Lev. 27:16</a>",
      "comment": "Establishing uniform standards is a step toward purity and equality in society, pointing to spiritual unity and the order in the Kingdom of God."
    },
    {
      "pk": 33045012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 12,
      "text": "The shekel shall be twenty gerahs; twenty shekels, twenty-five shekels, and fifteen shekels shall be your mina.",
      "links": "<a href='/AIV/04/3/47'>Num. 3:47</a>; <a href='/AIV/18/42/13'>Job 42:13</a>",
      "comment": "Standardizing currency reiterates themes of justice and transparency. Material order serves the dignity of worship and societal harmony."
    },
    {
      "pk": 33045013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 13,
      "text": "This is the offering that you shall set aside: one-sixth of an ephah from each homer of wheat, and one-sixth of an ephah from each homer of barley.",
      "links": "<a href='/AIV/03/27/16'>Lev. 27:16</a>; <a href='/AIV/02/23/19'>Exod. 23:19</a>",
      "comment": "The required offerings establish the principle of tithing and thanksgiving, rooted in God’s providence and care for His people. Participation in giving reflects spiritual maturity and stewardship."
    },
    {
      "pk": 33045014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 14,
      "text": "As the prescribed portion of oil, one-tenth of a bath from each cor; ten baths make a homer, for ten baths are a homer.",
      "links": "<a href='/AIV/04/18/12'>Num. 18:12</a>; <a href='/AIV/11/5/11'>1 Kings 5:11</a>",
      "comment": "Oil offerings reflect sanctification, often symbolizing the anointing and presence of the Spirit (cf. 1 Sam. 16:13)."
    },
    {
      "pk": 33045015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 15,
      "text": "And one sheep from every flock of two hundred, from the pastures of Israel, for grain offerings, burnt offerings, and fellowship offerings, to make atonement for the people, declares the Lord God.",
      "links": "<a href='/AIV/03/16/6'>Lev. 16:6</a>; <a href='/AIV/23/53/7'>Isa. 53:7</a>",
      "comment": "Animal offerings for atonement foresee the sacrificial system fulfilled in Christ’s offering (Heb. 9:12). The concept of atonement is both communal and personal, inviting participation in God’s reconciling plan."
    },
    {
      "pk": 33045016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 16,
      "text": "All the people of the land shall contribute to this offering for the prince in Israel.",
      "links": "<a href='/AIV/16/10/32'>Neh. 10:32</a>; <a href='/AIV/04/18/25'>Num. 18:25</a>",
      "comment": "Participation by everyone emphasizes the unity and solidarity of the faith community. It points to the idea of a visible, structured assembly involved in worship and sacrifice—an integral spiritual principle."
    },
    {
      "pk": 33045017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 17,
      "text": "It shall be the prince’s duty to provide the burnt offerings, grain offerings, and drink offerings at the feast days, new moons, Sabbaths, and at all the appointed festivals of Israel. He shall prepare the sin offering, grain offering, burnt offering, and fellowship offerings to make atonement on behalf of the house of Israel.",
      "links": "<a href='/AIV/03/23/1-44'>Lev. 23:1-44</a>; <a href='/AIV/26/44/27'>Ezek. 44:27</a>",
      "comment": "The prince’s representative priestly role deepens the concept of spiritual leadership—a prefiguration of Christ’s unique mediating priesthood (Heb. 8:1–2)."
    },
    {
      "pk": 33045018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 18,
      "text": "Thus says the Lord God: In the first month, on the first day, you shall take a young bull without blemish and cleanse the sanctuary.",
      "links": "<a href='/AIV/03/16/16'>Lev. 16:16</a>; <a href='/AIV/02/12/2'>Exod. 12:2</a>",
      "comment": "The purification offering in the first month resembles Passover rituals and points to new beginnings, readiness for worship, and the need for continual spiritual renewal (cf. 1 John 1:7)."
    },
    {
      "pk": 33045019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 19,
      "text": "The priest shall take blood from the sin offering and put it on the doorposts of the temple, on the four corners of the ledge of the altar, and on the posts of the gate of the inner court.",
      "links": "<a href='/AIV/02/12/7'>Exod. 12:7</a>; <a href='/AIV/03/4/7'>Lev. 4:7</a>",
      "comment": "Blood on the doorposts recalls the Passover and foreshadows the redemptive power of Christ's blood (cf. Heb. 9:14). Application on the temple’s threshold highlights sanctification of worship space."
    },
    {
      "pk": 33045020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 20,
      "text": "You shall do likewise on the seventh day of the month for anyone who sins unintentionally or in ignorance, so you shall make atonement for the temple.",
      "links": "<a href='/AIV/03/4/2'>Lev. 4:2</a>; <a href='/AIV/04/15/27-30'>Num. 15:27-30</a>",
      "comment": "Provision for sins of ignorance illustrates divine mercy and totality of forgiveness. Atonement for the temple affirms the necessity of purity for true worship."
    },
    {
      "pk": 33045021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 21,
      "text": "In the first month, on the fourteenth day, you shall observe the Passover, a festival of seven days; unleavened bread shall be eaten.",
      "links": "<a href='/AIV/02/12/6-15'>Exod. 12:6-15</a>; <a href='/AIV/03/23/5'>Lev. 23:5</a>",
      "comment": "The Passover is reestablished as central, tying Israel’s deliverance to worship. Unleavened bread speaks to cleansing from sin—fulfilled in Christ, our Passover Lamb (1 Cor. 5:7)."
    },
    {
      "pk": 33045022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 22,
      "text": "On that day the prince shall provide for himself and for all the people of the land a bull as a sin offering.",
      "links": "<a href='/AIV/03/4/13-14'>Lev. 4:13-14</a>; <a href='/AIV/26/46/2'>Ezek. 46:2</a>",
      "comment": "The prince’s offering for himself and for the people reinforces the theme of mediation. It subtly contrasts individual and communal responsibilities in worship."
    },
    {
      "pk": 33045023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 23,
      "text": "During the seven days of the feast he shall provide as a burnt offering to the Lord seven bulls and seven rams without blemish for each of the seven days, and as a sin offering he shall provide a young male goat daily.",
      "links": "<a href='/AIV/04/28/17-24'>Num. 28:17-24</a>; <a href='/AIV/03/23/8'>Lev. 23:8</a>",
      "comment": "Daily offerings stress continual dedication. Numerology (seven) signals completeness—a motif that finds fullness in Christ’s perfect sacrifice."
    },
    {
      "pk": 33045024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 24,
      "text": "He shall also provide as a grain offering one ephah for each bull and one ephah for each ram, along with a hin of oil for each ephah.",
      "links": "<a href='/AIV/04/15/5-10'>Num. 15:5-10</a>; <a href='/AIV/04/28/20'>Num. 28:20</a>",
      "comment": "The grain and oil signify the fullness of God’s provision. The completeness of offerings hints at the Eucharistic imagery found later in the New Testament (cf. John 6:51)."
    },
    {
      "pk": 33045025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 45,
      "verse": 25,
      "text": "In the seventh month, on the fifteenth day of the month, for the festival, he shall make the same provision for seven days, just as for the feast; the same sin offering, burnt offering, grain offering, and oil.",
      "links": "<a href='/AIV/03/23/33-39'>Lev. 23:33-39</a>; <a href='/AIV/04/29/12-38'>Num. 29:12-38</a>",
      "comment": "Repeating the offerings in the seventh month ties together all of Israel’s annual festivals, reflecting cycles of renewal and atonement. Lasting spiritual truths are embedded in ritual repetition, pointing to enduring worship and sacramental life."
    }
  ],
  "translatedAt": "2025-12-24T09:24:51.182Z"
}