{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 18,
  "verses": [
    {
      "pk": 33018001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "This introduces a direct message from the LORD to Ezekiel, signifying a moment of prophetic revelation. Such introductions are common in Ezekiel to mark divine authority."
    },
    {
      "pk": 33018002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 2,
      "text": "'What do you mean by repeating this proverb about the land of Israel, \"The fathers have eaten sour grapes, and the children's teeth are set on edge\"?'",
      "links": "<a href='/AIV/24/31/29'>Jer. 31:29</a>; <a href='/AIV/25/5/7'>Lam. 5:7</a>",
      "comment": "God confronts a popular saying of inherited guilt or punishment. The roots of this proverb are found also in Jeremiah. Here, God is challenging an idea of collective, generational punishment."
    },
    {
      "pk": 33018003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 3,
      "text": "As I live, declares the Lord GOD, you shall no longer use this proverb in Israel.",
      "links": "<a href='/AIV/26/17/19'>Ezek. 17:19</a>",
      "comment": "God solemnly declares (with an oath) that the old proverb is now null and void for His people. Each individual's responsibility is being declared."
    },
    {
      "pk": 33018004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 4,
      "text": "Behold, all souls are mine; the soul of the father as well as the soul of the son is mine. The soul that sins shall die.",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>; <a href='/AIV/26/18/20'>Ezek. 18:20</a>; <a href='/AIV/45/6/23'>Rom. 6:23</a>",
      "comment": "God owns every soul individually, and ultimate accountability is personal. This marks a shift emphasizing individual responsibility for sin, echoing later teachings on personal judgment and salvation. Compare Paul's words in Romans."
    },
    {
      "pk": 33018005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 5,
      "text": "But if a man is righteous and does what is just and right—",
      "links": "<a href='/AIV/26/33/14'>Ezek. 33:14-16</a>",
      "comment": "Righteousness here is practical and moral, not merely ceremonial. Obedience to God's law is essential for life, a theme echoed later in Jesus' summary of the law."
    },
    {
      "pk": 33018006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 6,
      "text": "if he does not eat upon the mountains or lift up his eyes to the idols of the house of Israel, does not defile his neighbor's wife, or come near a woman during her impurity,",
      "links": "<a href='/AIV/03/18/20'>Lev. 18:20</a>; <a href='/AIV/03/18/19'>Lev. 18:19</a>; <a href='/AIV/24/3/2'>Jer. 3:2</a>",
      "comment": "\"Eat upon the mountains\" refers to idolatrous feasts. The moral law includes both fidelity to God and to neighbor. This anticipates New Testament calls to purity of worship and life."
    },
    {
      "pk": 33018007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 7,
      "text": "does not oppress anyone, but restores to the debtor his pledge, commits no robbery, gives his bread to the hungry and covers the naked with a garment,",
      "links": "<a href='/AIV/03/25/35'>Lev. 25:35-38</a>; <a href='/AIV/23/58/7'>Isa. 58:7</a>; <a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "Mercy for the poor and upright dealings are highlighted as key virtues. Echoes of this verse appear in Jesus' teaching on mercy and care for the least (Matthew 25)."
    },
    {
      "pk": 33018008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 8,
      "text": "does not lend at interest or take any increase, withholds his hand from injustice, executes true justice between man and man,",
      "links": "<a href='/AIV/02/22/25'>Ex. 22:25</a>; <a href='/AIV/26/22/12'>Ezek. 22:12</a>",
      "comment": "The prohibition of usury (lending at interest) was a hallmark of God's Law. The emphasis is on equitable justice, foretelling the uprightness required in the Gospel community."
    },
    {
      "pk": 33018009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 9,
      "text": "walks in my statutes, and keeps my judgments to deal faithfully—he is righteous; he shall surely live, declares the Lord GOD.",
      "links": "<a href='/AIV/19/119/1'>Ps. 119:1</a>; <a href='/AIV/26/18/17'>Ezek. 18:17</a>",
      "comment": "Life is promised to those who obey the Lord's statutes. This points ultimately to Christ, who fulfilled the law and called His followers to both personal and communal holiness."
    },
    {
      "pk": 33018010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 10,
      "text": "If he fathers a son who is violent, a shedder of blood, who does any of these things,",
      "links": "<a href='/AIV/26/18/14'>Ezek. 18:14</a>",
      "comment": "Introduces the case of a wicked son of a righteous man, illustrating individual accountability, irrespective of heritage."
    },
    {
      "pk": 33018011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 11,
      "text": "(though he himself did none of these things), but even eats upon the mountains, defiles his neighbor’s wife,",
      "links": "<a href='/AIV/03/18/20'>Lev. 18:20</a>; <a href='/AIV/03/18/26'>Lev. 18:26</a>",
      "comment": "The wickedness of the son is personal, not derived from the father's actions."
    },
    {
      "pk": 33018012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 12,
      "text": "oppresses the poor and needy, commits robbery, does not restore the pledge, lifts up his eyes to the idols, commits abomination,",
      "links": "<a href='/AIV/26/22/11-12'>Ezek. 22:11-12</a>",
      "comment": "Committing abomination here refers to idolatry and other offenses particularly detested by God."
    },
    {
      "pk": 33018013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 13,
      "text": "lends at interest, and takes increase; shall he then live? He shall not live. He has done all these abominations; he shall surely die; his blood shall be upon him.",
      "links": "<a href='/AIV/03/20/9'>Lev. 20:9</a>; <a href='/AIV/45/6/23'>Rom. 6:23</a>",
      "comment": "Abominations merit death; the responsibility is personal ('his blood upon him'). This sets the stage for later Christian teaching about the wages of sin and the need for mercy and repentance."
    },
    {
      "pk": 33018014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 14,
      "text": "But suppose this man fathers a son who sees all the sins that his father has done, and seeing them, does not do likewise:",
      "links": "<a href='/AIV/26/18/17'>Ezek. 18:17</a>",
      "comment": "Even among generational sin, personal repentance or faithfulness is possible. Each individual can break from inherited patterns."
    },
    {
      "pk": 33018015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 15,
      "text": "he does not eat upon the mountains or lift up his eyes to the idols of the house of Israel, does not defile his neighbor’s wife,",
      "links": "<a href='/AIV/02/20/5-6'>Ex. 20:5-6</a>",
      "comment": "This reverses the pattern of inherited guilt; here, the son chooses righteousness despite his father's sin."
    },
    {
      "pk": 33018016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 16,
      "text": "does not oppress anyone, does not take a pledge or commit robbery, but gives his bread to the hungry and covers the naked with a garment,",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>; <a href='/AIV/26/18/7'>Ezek. 18:7</a>",
      "comment": "Care for the needy is emphasized as evidence of right relationship with God."
    },
    {
      "pk": 33018017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 17,
      "text": "withholds his hand from wrong, does not take interest or increase, keeps my judgments, and walks in my statutes; he shall not die for his father’s iniquity; he shall surely live.",
      "links": "<a href='/AIV/26/18/9'>Ezek. 18:9</a>",
      "comment": "Obedience brings life. The pattern is established: each stands or falls by his own deeds, underscoring personal holiness."
    },
    {
      "pk": 33018018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 18,
      "text": "As for his father, because he practiced extortion, robbed his brother, and did what is not good among his people, behold, he shall die for his iniquity.",
      "links": "<a href='/AIV/26/18/10-13'>Ezek. 18:10-13</a>",
      "comment": "God's judgment is just; each is judged for his own sins."
    },
    {
      "pk": 33018019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 19,
      "text": "Yet you say, 'Why should not the son bear the iniquity of the father?' When the son has done what is just and right, and has kept all my statutes, and done them, he shall surely live.",
      "links": "<a href='/AIV/05/24/16'>Deut. 24:16</a>",
      "comment": "God answers objections: individual righteousness leads to life. The Mosaic law also denies transferring blame across generations."
    },
    {
      "pk": 33018020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 20,
      "text": "The soul who sins shall die. The son shall not bear the iniquity of the father, nor the father bear the iniquity of the son. The righteousness of the righteous shall be upon him, and the wickedness of the wicked shall be upon him.",
      "links": "<a href='/AIV/26/18/4'>Ezek. 18:4</a>; <a href='/AIV/24/31/30'>Jer. 31:30</a>",
      "comment": "A clear declaration of personal responsibility. This verse is key for Christian doctrine about personal sin and grace."
    },
    {
      "pk": 33018021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 21,
      "text": "But if a wicked person turns away from all his sins that he has committed and keeps all my statutes and does what is just and right, he shall surely live; he shall not die.",
      "links": "<a href='/AIV/26/33/19'>Ezek. 33:19</a>; <a href='/AIV/23/55/7'>Isa. 55:7</a>",
      "comment": "Repentance is always possible. God’s mercy is available for those who truly turn to Him, a forerunner of the New Covenant promise of forgiveness (see Luke 15)."
    },
    {
      "pk": 33018022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 22,
      "text": "None of the transgressions that he has committed shall be remembered against him; for the righteousness that he has done he shall live.",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1-2</a>; <a href='/AIV/26/33/16'>Ezek. 33:16</a>",
      "comment": "Forgiveness is complete upon repentance—sins are not merely set aside but no longer remembered. This prefigures justification through sanctifying grace. See Psalm 32."
    },
    {
      "pk": 33018023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 23,
      "text": "Have I any pleasure in the death of the wicked, declares the Lord GOD, and not rather that he should turn from his way and live?",
      "links": "<a href='/AIV/12/14/14'>2 Kgs. 14:14</a>; <a href='/AIV/26/33/11'>Ezek. 33:11</a>; <a href='/AIV/54/2/4'>1 Tim. 2:4</a>",
      "comment": "God’s mercy desires repentance, not death. This anticipates New Testament teaching that God wills all to be saved (1 Tim 2:4)."
    },
    {
      "pk": 33018024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 24,
      "text": "But when a righteous person turns away from his righteousness and does injustice, and does the same abominations that the wicked person does, shall he live? None of the righteous acts that he has done shall be remembered; in the treachery that he has committed and in the sin that he has committed, in them he shall die.",
      "links": "<a href='/AIV/26/33/12-13'>Ezek. 33:12-13</a>; <a href='/AIV/26/3/20'>Ezek. 3:20</a>",
      "comment": "Perseverance in righteousness is necessary; falling back into sin results in the loss of past good deeds’ benefit. This points to the importance of remaining faithful throughout life, a key teaching about salvation."
    },
    {
      "pk": 33018025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 25,
      "text": "Yet you say, 'The way of the Lord is not just.' Hear now, O house of Israel: Is my way not just? Is it not your ways that are unjust?",
      "links": "<a href='/AIV/26/33/17'>Ezek. 33:17</a>",
      "comment": "God’s justice is perfect and impartial—contrasting with human complaints. This addresses the perennial problem of God’s fairness."
    },
    {
      "pk": 33018026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 26,
      "text": "When a righteous person turns away from his righteousness and does injustice, he shall die for it; for the injustice that he has done he shall die.",
      "links": "<a href='/AIV/26/18/24'>Ezek. 18:24</a>",
      "comment": "This repeats the warning: ongoing faithfulness is needed to remain in God’s favor."
    },
    {
      "pk": 33018027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 27,
      "text": "Again, when a wicked person turns away from the wickedness he has committed and does what is just and right, he shall save his life.",
      "links": "<a href='/AIV/19/51/13'>Ps. 51:13</a>",
      "comment": "Illustrates God’s mercy: true repentance overturns even the most sinful past, highlighting the power of conversion."
    },
    {
      "pk": 33018028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 28,
      "text": "Because he considered and turned away from all the transgressions that he had committed, he shall surely live; he shall not die.",
      "links": "<a href='/AIV/23/55/7'>Isa. 55:7</a>",
      "comment": "Conversion of heart ('considered and turned') is required, not just external acts. The call to interior transformation is made explicit here."
    },
    {
      "pk": 33018029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 29,
      "text": "Yet the house of Israel says, 'The way of the Lord is not just.' O house of Israel, are my ways not just? Are it not your ways that are unjust?",
      "links": "<a href='/AIV/26/18/25'>Ezek. 18:25</a>",
      "comment": "God repeats this charge of justice versus injustice, showing His patience in confronting error."
    },
    {
      "pk": 33018030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 30,
      "text": "Therefore I will judge you, O house of Israel, each one according to his ways, declares the Lord GOD. Repent and turn from all your transgressions, lest iniquity be your ruin.",
      "links": "<a href='/AIV/44/17/30'>Acts 17:30</a>; <a href='/AIV/26/33/20'>Ezek. 33:20</a>",
      "comment": "The call to repentance is universal and personal. This anticipates the Gospel’s call to conversion and the constant need for confession and returning to God."
    },
    {
      "pk": 33018031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 31,
      "text": "Cast away from yourselves all the transgressions that you have committed, and make yourselves a new heart and a new spirit. Why will you die, O house of Israel?",
      "links": "<a href='/AIV/19/51/10'>Ps. 51:10</a>; <a href='/AIV/26/36/26'>Ezek. 36:26</a>; <a href='/AIV/43/3/3'>John 3:3</a>",
      "comment": "A new heart and spirit signal the promise of interior renewal, later fulfilled in the rebirth proclaimed by Jesus (John 3:3—'born again'). Renewal is a work of God’s grace, requiring human cooperation."
    },
    {
      "pk": 33018032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 18,
      "verse": 32,
      "text": "For I have no pleasure in the death of anyone, declares the Lord GOD; so turn and live.",
      "links": "<a href='/AIV/26/33/11'>Ezek. 33:11</a>; <a href='/AIV/54/2/4'>1 Tim. 2:4</a>",
      "comment": "God’s will is life and not destruction—a theme the New Testament echoes (1 Tim 2:4). The urgency of repentance and the promise of divine mercy is paramount, reinforcing the continual need for sacramental reconciliation and perseverance in faith."
    }
  ],
  "translatedAt": "2025-12-24T09:07:44.538Z"
}