{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 39,
  "verses": [
    {
      "pk": 33039001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 1,
      "text": "Son of man, set your face against Gog of the land of Magog, the chief prince of Meshech and Tubal, and prophesy against him.",
      "links": "<a href='/AIV/26/38/2'>Ezek. 38:2</a>; <a href='/AIV/66/20/8'>Rev. 20:8</a>",
      "comment": "God addresses Ezekiel to focus on Gog, the mysterious enemy, building upon the prophecy begun in the previous chapter. The symbolic nature of Gog ties into later biblical descriptions of spiritual and physical opposition to God's people."
    },
    {
      "pk": 33039002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 2,
      "text": "Say: 'This is what the Lord GOD says: Look, I am against you, Gog, chief prince of Meshech and Tubal.'",
      "links": "<a href='/AIV/26/38/3'>Ezek. 38:3</a>; <a href='/AIV/24/50/31'>Jer. 50:31</a>",
      "comment": "God’s opposition to Gog reflects divine justice, reminiscent of His judgments against Babylon and other adversaries. God's sovereignty is stressed here."
    },
    {
      "pk": 33039003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 3,
      "text": "'I will turn you around, lead you on, and bring you up from the far north, and bring you against the mountains of Israel.'",
      "links": "<a href='/AIV/26/38/15'>Ezek. 38:15</a>; <a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "God is completely in control, using even enemies to fulfill His purposes. The 'far north' emphasizes the foreign, threatening nature of Gog, yet ultimately it reveals God's protection of His chosen people."
    },
    {
      "pk": 33039004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 4,
      "text": "'I will strike your bow from your left hand and make your arrows fall from your right hand.'",
      "links": "<a href='/AIV/19/46/9'>Ps. 46:9</a>",
      "comment": "The disarmament of Gog by God demonstrates the futility of opposing His will. Compare to Psalm 46:9, where God breaks the weapons of war. This is both literal defeat and spiritual impotence before God."
    },
    {
      "pk": 33039005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 5,
      "text": "'You shall fall upon the mountains of Israel, you and all your troops and the peoples who are with you. I will give you as food to every kind of bird and beast of the field.'",
      "links": "<a href='/AIV/66/19/17-18'>Rev. 19:17-18</a>; <a href='/AIV/26/32/4'>Ezek. 32:4</a>",
      "comment": "This echoes the final defeat described in Revelation 19:17-18, symbolizing utter judgment. The gathering of birds signals total destruction of evil forces, linking Old and New Testament prophecy."
    },
    {
      "pk": 33039006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 6,
      "text": "'I will send fire on Magog and on those who dwell securely in the coastlands, and they shall know that I am the LORD.'",
      "links": "<a href='/AIV/26/38/22'>Ezek. 38:22</a>; <a href='/AIV/66/20/9'>Rev. 20:9</a>",
      "comment": "God’s judgment extends beyond Israel’s boundaries, asserting His universal authority. The motif of fire is seen in both prophecy and final judgment (Revelation 20:9), pointing toward divine purification."
    },
    {
      "pk": 33039007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 7,
      "text": "'And My holy name I will make known in the midst of My people Israel, and I will not allow My holy name to be profaned anymore. And the nations shall know that I am the LORD, the Holy One in Israel.'",
      "links": "<a href='/AIV/26/36/23'>Ezek. 36:23</a>; <a href='/AIV/19/99/9'>Ps. 99:9</a>",
      "comment": "God’s sanctification of His name among Israel and the nations foreshadows the universal recognition of God’s holiness. 'Holy One in Israel' alludes to both particular and ultimate fulfillment found in Christ."
    },
    {
      "pk": 33039008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 8,
      "text": "'Behold, it is coming and shall be done, declares the Lord GOD. This is the day of which I have spoken.'",
      "links": "<a href='/AIV/26/38/18'>Ezek. 38:18</a>; <a href='/AIV/36/1/7'>Zeph. 1:7</a>",
      "comment": "The prophetic certainty and finality are underlined here—'the day' often echoes language concerning divine intervention or the Day of the Lord. This anchors the prophecy in God's sovereign timeline."
    },
    {
      "pk": 33039009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 9,
      "text": "'Then those who dwell in the cities of Israel shall go out and make fires of the weapons and burn them, shields and bucklers, bows and arrows, clubs and spears; and they shall make fires of them for seven years.'",
      "links": "<a href='/AIV/26/38/21'>Ezek. 38:21</a>; <a href='/AIV/07/6/25-28'>Judg. 6:25-28</a>",
      "comment": "The burning of weapons for seven years symbolizes completeness and purification after God’s victory. It shows God's people acting on the fruit of deliverance—a theme echoed through sacred history."
    },
    {
      "pk": 33039010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 10,
      "text": "'They will not take wood from the fields or cut down any from the forests, for they will make their fires with the weapons. So they will plunder those who plundered them and loot those who looted them, declares the Lord GOD.'",
      "links": "<a href='/AIV/16/4/4'>Neh. 4:4</a>; <a href='/AIV/19/2/4'>Ps. 2:4</a>",
      "comment": "Israel’s reversal of fortunes—using enemies' resources—embodies the principle of God’s justice and restoration of His people, anticipating divine recompense."
    },
    {
      "pk": 33039011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 11,
      "text": "'On that day I will give Gog a burial place there in Israel, the Valley of the Travelers, east of the sea. It will block travelers, for there Gog and all his multitude will be buried. It will be called the Valley of Gog’s Multitude.'",
      "links": "<a href='/AIV/26/32/23'>Ezek. 32:23</a>; <a href='/AIV/18/21/32'>Job 21:32</a>",
      "comment": "The burial site marks both physical and spiritual defeat of God's enemies, making the valley itself a witness to God's victory for generations."
    },
    {
      "pk": 33039012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 12,
      "text": "'For seven months the house of Israel will be burying them, in order to cleanse the land.'",
      "links": "<a href='/AIV/26/39/14'>Ezek. 39:14</a>; <a href='/AIV/04/19/11-13'>Num. 19:11-13</a>",
      "comment": "Seven months emphasizes complete purification. The burial points to spiritual themes of cleansing and restoration, echoing Old Testament rituals (Numbers 19:11-13)."
    },
    {
      "pk": 33039013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 13,
      "text": "'All the people of the land shall bury them, and it will be a renowned day for them on the day that I am glorified, declares the Lord GOD.'",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>; <a href='/AIV/66/15/2-4'>Rev. 15:2-4</a>",
      "comment": "The burial becomes a collective cleansing; God’s glory is manifest in the community, foreshadowing worship, unity, and restoration among the people."
    },
    {
      "pk": 33039014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 14,
      "text": "'They will set apart men to continually search the land to bury those still remaining on the face of the land, to cleanse it. At the end of seven months they will commence their search.'",
      "links": "<a href='/AIV/26/39/12'>Ezek. 39:12</a>; <a href='/AIV/03/13/45'>Lev. 13:45</a>",
      "comment": "The systematic cleansing emphasizes holiness and order—important prerequisites for worship. Setting men apart for this task alludes to the principle of ceremonial purity."
    },
    {
      "pk": 33039015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 15,
      "text": "'As they go through the land, anyone who sees a human bone will set up a marker until the buriers have buried it in the Valley of Gog's Multitude.'",
      "links": "<a href='/AIV/26/39/11'>Ezek. 39:11</a>; <a href='/AIV/04/19/16'>Num. 19:16</a>",
      "comment": "Careful treatment of the dead in ceremonial burial further underscores the theme of purification, maintaining the sanctity of the land after God's judgment."
    },
    {
      "pk": 33039016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 16,
      "text": "'There will also be a city named Hamonah.' So they will cleanse the land.",
      "links": "<a href='/AIV/26/39/11'>Ezek. 39:11</a>",
      "comment": "The city's naming after the multitude connects geographical memorial with spiritual testimony. The land's cleansing closes the cycle of defeat and restoration."
    },
    {
      "pk": 33039017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 17,
      "text": "'And you, son of man, thus says the Lord GOD, Speak to every sort of bird and to every beast of the field: ‘Assemble and come, gather from every side to My sacrificial feast that I am preparing for you, a great feast on the mountains of Israel, and you shall eat flesh and drink blood.’'",
      "links": "<a href='/AIV/66/19/17-18'>Rev. 19:17-18</a>; <a href='/AIV/02/12/6-10'>Ex. 12:6-10</a>",
      "comment": "The sacrificial imagery echoes both judgment and deliverance. God orchestrates a 'feast,' linking prophetic Old Testament themes with apocalyptic final victory (Rev. 19:17-18)."
    },
    {
      "pk": 33039018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 18,
      "text": "'You shall eat the flesh of mighty men and drink the blood of the princes of the earth, rams, lambs, goats, and bulls, all of them fattened at Bashan.'",
      "links": "<a href='/AIV/19/22/12'>Ps. 22:12</a>; <a href='/AIV/66/19/18'>Rev. 19:18</a>",
      "comment": "Here, the defeat of earthly powers emphasizes the overthrow of pride and violence. The reference to Bashan leverages imagery of prosperity, now judged and overturned."
    },
    {
      "pk": 33039019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 19,
      "text": "'You shall eat fat until you are full, and drink blood until you are drunk, at My sacrificial feast which I have prepared for you.'",
      "links": "<a href='/AIV/26/32/4'>Ezek. 32:4</a>; <a href='/AIV/66/19/21'>Rev. 19:21</a>",
      "comment": "God’s feast turns the tables on the forces of evil—animals feasting on the mighty, signifying total defeat. This reversal imagery prefigures final justice and restoration."
    },
    {
      "pk": 33039020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 20,
      "text": "'At My table you shall be filled with horses and riders, mighty men and all kinds of warriors, declares the Lord GOD.'",
      "links": "<a href='/AIV/66/19/18'>Rev. 19:18</a>; <a href='/AIV/19/76/6'>Ps. 76:6</a>",
      "comment": "The scope of destruction is complete, reiterating God's total victory. This language of feasting points to God's justice and the overturning of human violence."
    },
    {
      "pk": 33039021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 21,
      "text": "'And I will set My glory among the nations; and all the nations shall see My judgment that I have executed and My hand that I have laid on them.'",
      "links": "<a href='/AIV/26/36/23'>Ezek. 36:23</a>; <a href='/AIV/19/96/3'>Ps. 96:3</a>",
      "comment": "Universal recognition of God's glory and judgment points toward the future messianic reign, where all nations acknowledge the Lord—echoes Christ's revelation to all peoples."
    },
    {
      "pk": 33039022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 22,
      "text": "'So the house of Israel shall know that I am the LORD their God from that day and onward.'",
      "links": "<a href='/AIV/26/34/30'>Ezek. 34:30</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "God’s covenant faithfulness with Israel is reaffirmed, paving the way for full recognition and relationship—a motif that finds fulfillment in the New Testament."
    },
    {
      "pk": 33039023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 23,
      "text": "'And the nations shall know that the house of Israel went into exile for their iniquity, because they were unfaithful to Me. So I hid My face from them and gave them into the hand of their enemies, and they all fell by the sword.'",
      "links": "<a href='/AIV/26/36/19'>Ezek. 36:19</a>; <a href='/AIV/18/13/24'>Job 13:24</a>",
      "comment": "God's justice and mercy are on display—exile was due to sin, yet restoration follows. The theme of hiding God's face ties to classical notions of spiritual distance and recall for repentance."
    },
    {
      "pk": 33039024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 24,
      "text": "'According to their uncleanness and their transgressions I dealt with them, and hid My face from them.'",
      "links": "<a href='/AIV/26/36/17'>Ezek. 36:17</a>; <a href='/AIV/19/44/24'>Ps. 44:24</a>",
      "comment": "This repetition reiterates the causality of divine judgment, setting up the contrast for restoration by grace rather than merit."
    },
    {
      "pk": 33039025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 25,
      "text": "'Therefore, thus says the Lord GOD: Now I will restore the fortunes of Jacob, and have mercy on the whole house of Israel; and I will be jealous for My holy name.'",
      "links": "<a href='/AIV/29/2/18'>Joel 2:18</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "Restoration is linked with mercy. The restoration of all Israel hints at spiritual unity—the full gathering of God’s people, resonating with Christ’s work of reconciliation."
    },
    {
      "pk": 33039026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 26,
      "text": "'They shall forget their shame and all the unfaithfulness they committed against Me, when they dwell securely in their land with no one to make them afraid.'",
      "links": "<a href='/AIV/19/85/8'>Ps. 85:8</a>; <a href='/AIV/26/34/28'>Ezek. 34:28</a>",
      "comment": "Divine forgiveness includes the removal of shame and the bestowal of spiritual security. It points toward the peace Christ offers to His followers (see John 14:27)."
    },
    {
      "pk": 33039027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 27,
      "text": "'When I have brought them back from the peoples and gathered them out of the lands of their enemies, then I will be sanctified through them in the sight of many nations.'",
      "links": "<a href='/AIV/26/20/41'>Ezek. 20:41</a>; <a href='/AIV/19/106/47'>Ps. 106:47</a>",
      "comment": "God's sanctification among the nations anticipates the global spread of worship. The ingathering of exiles prefigures spiritual reunion at the heart of divine worship."
    },
    {
      "pk": 33039028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 28,
      "text": "'Then they shall know that I am the LORD their God, because I sent them into exile among the nations and then gathered them to their own land; and I will leave none of them remaining among the nations anymore.'",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/26/11/17'>Ezek. 11:17</a>",
      "comment": "Total restoration and identification with God is a key theme for both old and new covenants. God’s initiative is central: salvation is by His action."
    },
    {
      "pk": 33039029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 39,
      "verse": 29,
      "text": "'I will not hide My face from them anymore, for I will have poured out My Spirit on the house of Israel, declares the Lord GOD.'",
      "links": "<a href='/AIV/29/2/28-29'>Joel 2:28-29</a>; <a href='/AIV/44/2/17-18'>Acts 2:17-18</a>",
      "comment": "The outpouring of the Spirit foreshadows Pentecost and the unity of God’s people in sacramental life. The restored relationship prepares the way for new covenant fulfillment in Christ (see Acts 2:17-18)."
    }
  ],
  "translatedAt": "2025-12-24T09:20:17.822Z"
}