{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 13,
  "verses": [
    {
      "pk": 33013001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/24/23/28'>Jer. 23:28</a>; <a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "Ezekiel receives divine revelation, a recurring theme throughout the prophetic books. The importance of the prophet's role in transmitting God's word underlines the enduring necessity for sacred tradition and approved messengers."
    },
    {
      "pk": 33013002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 2,
      "text": "\"Son of man, prophesy against the prophets of Israel who are prophesying. Say to those who prophesy out of their own hearts: 'Hear the word of the LORD,\"",
      "links": "<a href='/AIV/24/14/14'>Jer. 14:14</a>; <a href='/AIV/26/22/28'>Ezek. 22:28</a>",
      "comment": "God singles out false prophets who speak from their own imagination. The authority of prophecy is grounded not in personal ideas but in divine commission, hinting at the ongoing need for apostolic succession and hierarchy."
    },
    {
      "pk": 33013003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 3,
      "text": "Thus says the Lord GOD: Woe to the foolish prophets who follow their own spirits and have seen nothing!",
      "links": "<a href='/AIV/24/23/16'>Jer. 23:16</a>",
      "comment": "Here, God calls out pseudo-prophets whose revelations lack divine source. It implies the value and necessity of authentic spiritual authority, founded upon God's revelation rather than subjective interpretation."
    },
    {
      "pk": 33013004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 4,
      "text": "Your prophets, O Israel, are like jackals among ruins.",
      "links": "<a href='/AIV/19/63/10'>Ps. 63:10</a>",
      "comment": "Jackals symbolize scavengers exploiting destruction; false prophets prosper in spiritual corruption. This underlines the peril of straying from authentic shepherds, foreshadowing the New Testament warnings against false teachers (<a href='/AIV/40/7/15'>Matt. 7:15</a>)."
    },
    {
      "pk": 33013005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 5,
      "text": "You have not gone up into the breaches or built up the wall for the house of Israel, that it might stand in the battle on the day of the LORD.",
      "links": "<a href='/AIV/23/58/12'>Isa. 58:12</a>; <a href='/AIV/19/106/23'>Ps. 106:23</a>",
      "comment": "True prophets intercede and defend the people; false ones refuse such sacrifice. Building up the wall is emblematic of spiritual protection, reminiscent of the mediatorial role of the saints and the Church providing defense through prayer."
    },
    {
      "pk": 33013006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 6,
      "text": "They have seen false visions and lying divinations. They say, 'declares the LORD,' when the LORD has not sent them, and they expect Him to fulfill their word.",
      "links": "<a href='/AIV/24/23/21'>Jer. 23:21</a>; <a href='/AIV/05/18/20-22'>Deut. 18:20-22</a>",
      "comment": "God exposes how the authority of His Name is wrongly claimed. Echoes warnings against false claims of revelation and stresses the necessity of discernment and obedience to legitimate teaching authority."
    },
    {
      "pk": 33013007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 7,
      "text": "Have you not seen a futile vision and spoken a lying divination, when you have said, 'declares the LORD,' although I have not spoken?",
      "links": "<a href='/AIV/24/27/15'>Jer. 27:15</a>",
      "comment": "God reiterates the seriousness of misusing divine authority. Doctrinal integrity is necessary for the unity and sanctity of the one true Church—a recurring biblical theme."
    },
    {
      "pk": 33013008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 8,
      "text": "Therefore thus says the Lord GOD: Because you have spoken falsehood and seen lying visions, therefore, behold, I am against you, declares the Lord GOD.",
      "links": "<a href='/AIV/24/23/31'>Jer. 23:31</a>",
      "comment": "God's opposition to false prophets foreshadows the eschatological separation of good and evil. This divine rejection points toward His absolute standard for truth in proclamation, a position the Church maintains in upholding sound doctrine."
    },
    {
      "pk": 33013009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 9,
      "text": "My hand will be against the prophets who see false visions and utter lying divinations. They shall not be in the council of My people, nor shall they be enrolled in the record of the house of Israel, nor shall they enter the land of Israel. Then you will know that I am the Lord GOD.",
      "links": "<a href='/AIV/19/69/28'>Ps. 69:28</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>",
      "comment": "Exclusion from God's people and written record recalls the symbolism of the Book of Life and the communion of saints. Spiritual consequences echo throughout Scripture and tradition."
    },
    {
      "pk": 33013010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 10,
      "text": "Because, yes, because they have led My people astray, saying, 'Peace,' when there is no peace, and when anyone builds a wall, behold, they plaster it with whitewash;",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>; <a href='/AIV/40/23/27'>Matt. 23:27</a>",
      "comment": "False assurances are exposed—true peace comes only through authentic reconciliation with God. The whitewashing metaphor is later echoed by Jesus, who confronts hypocrisy and the necessity of genuine conversion."
    },
    {
      "pk": 33013011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 11,
      "text": "Say to those who plaster it with whitewash that it will fall. There will be a flooding rain, and you, O hailstones, will fall, and a violent wind will break out.",
      "links": "<a href='/AIV/40/7/27'>Matt. 7:27</a>; <a href='/AIV/19/11/6'>Ps. 11:6</a>",
      "comment": "The image of collapse under divine judgment reminds readers of Christ's teaching on building one's house upon rock, indicating the necessity of solid foundations—both in faith and practice."
    },
    {
      "pk": 33013012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 12,
      "text": "When the wall has fallen, will it not be said to you, 'Where is the plaster with which you plastered it?'",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "God challenges superficial remedies. The enduring house is the one built with steadfast obedience and genuine faith, alluding to the unity and visible structure of God's people."
    },
    {
      "pk": 33013013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 13,
      "text": "Therefore thus says the Lord GOD: I will make a violent wind break out in My wrath; and there will be a flooding rain in My anger and great hailstones in wrath to consume it.",
      "links": "<a href='/AIV/23/28/2'>Isa. 28:2</a>",
      "comment": "God's judgment is decisive, almost sacramental in power. The intensity of divine response highlights the seriousness of falsifying divine truth."
    },
    {
      "pk": 33013014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 14,
      "text": "I will break down the wall that you have plastered with whitewash and bring it to the ground, so that its foundation will be exposed. It will fall, and you will be consumed in its midst. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/19/52/5'>Ps. 52:5</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "The collapse exposes failure to build on the right foundation, in contrast to Christ's promise that His Church would be built upon the rock and never fail."
    },
    {
      "pk": 33013015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 15,
      "text": "Thus I will accomplish My wrath against the wall and against those who plastered it with whitewash, and I will say to you, 'The wall is no more, nor those who plastered it,'",
      "links": "<a href='/AIV/23/30/13'>Isa. 30:13</a>",
      "comment": "The destruction is both literal and symbolic—foreshadowing final judgment. Only what is built by God's design endures eternally."
    },
    {
      "pk": 33013016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 16,
      "text": "namely, the prophets of Israel who prophesied concerning Jerusalem and who saw visions of peace for her, when there was no peace, declares the Lord GOD.",
      "links": "<a href='/AIV/24/8/11'>Jer. 8:11</a>",
      "comment": "Their deception is clarified, setting up the essential connection between authentic prophecy and truth. Literal peace can only come from genuine repentance and unity with God, which is maintained through the visible teaching authority."
    },
    {
      "pk": 33013017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 17,
      "text": "\"And you, son of man, set your face against the daughters of your people, who prophesy out of their own hearts, and prophesy against them",
      "links": "<a href='/AIV/26/21/2'>Ezek. 21:2</a>",
      "comment": "Even among women, false prophecy is condemned. Spiritual authority flows from divine appointment, not self-initiative, underscoring the importance of established order and proper discernment."
    },
    {
      "pk": 33013018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 18,
      "text": "and say, 'Thus says the Lord GOD: Woe to the women who sew magic bands on all wrists and make veils for the heads of people of every stature, to hunt souls! Will you hunt the souls of My people and keep your own souls alive?",
      "links": "<a href='/AIV/23/3/20'>Isa. 3:20</a>; <a href='/AIV/09/28/7'>1 Sam. 28:7</a>",
      "comment": "Magic and superstition are condemned; salvation is not obtained through magical means but through God's grace, ordinarily imparted through the sacraments. Spiritual warfare is a deeply ecclesial reality."
    },
    {
      "pk": 33013019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 19,
      "text": "You have profaned Me among My people for handfuls of barley and for bits of bread, by killing those who should not die and keeping alive those who should not live, by your lying to My people who listen to lies.\"",
      "links": "<a href='/AIV/23/56/11'>Isa. 56:11</a>",
      "comment": "Their corruption betrays spiritual manipulation for material gain, a problem Jesus confronted in the Gospels. The reversal of justice echoes throughout Scripture."
    },
    {
      "pk": 33013020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 20,
      "text": "Therefore thus says the Lord GOD: Behold, I am against your magic bands with which you hunt souls like birds; I will tear them off your arms and let the souls go, the souls that you hunt as birds.",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "Liberation imagery resonates with themes of Christ freeing us from spiritual captivity. Genuine spiritual freedom comes only through God's intervention, not human devices."
    },
    {
      "pk": 33013021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 21,
      "text": "I will tear off your veils and deliver My people out of your hand, and they shall be no more in your hand to be hunted; and you shall know that I am the LORD.",
      "links": "<a href='/AIV/19/91/3'>Ps. 91:3</a>",
      "comment": "God rescues His people from deception, paralleling Christ's saving action. The motif of deliverance deepens the typological connection to later New Testament salvation."
    },
    {
      "pk": 33013022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 22,
      "text": "Because you have disheartened the righteous with lies, when I did not grieve him, and have strengthened the hands of the wicked, so that he does not turn from his wicked way to save his life,",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>; <a href='/AIV/26/3/18'>Ezek. 3:18</a>",
      "comment": "You see the power and responsibility of moral guidance. True shepherding encourages repentance and holiness, a function entrusted to the ordained leadership and universal priesthood of all believers working together."
    },
    {
      "pk": 33013023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 13,
      "verse": 23,
      "text": "therefore you shall see no more false visions nor practice divinations. I will deliver My people out of your hand, and you shall know that I am the LORD.\"",
      "links": "<a href='/AIV/26/37/23'>Ezek. 37:23</a>; <a href='/AIV/19/50/15'>Ps. 50:15</a>",
      "comment": "God's promise is to end the works of deception and restore His people to Himself. The recurring refrain, 'you shall know that I am the LORD,' points throughout scripture to God's desire for relationship, truth, and the fullness of worship in spirit and truth."
    }
  ],
  "translatedAt": "2025-12-24T09:04:44.306Z"
}