{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 8,
  "verses": [
    {
      "pk": 33008001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 1,
      "text": "In the sixth year, in the sixth month, on the fifth day of the month, as I sat in my house with the elders of Judah sitting before me, the hand of the Lord GOD fell upon me there.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/26/20/1'>Ezek. 20:1</a>",
      "comment": "The setting is clear: while Ezekiel is among the exiles, God's presence comes with power. This manifestation often prefigures New Testament appearances where God acts directly, especially at turning points in salvation history."
    },
    {
      "pk": 33008002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 2,
      "text": "Then I looked, and behold, a figure that had the appearance of a man. From what appeared to be his waist downward was fire, and from his waist upward, his appearance was as bright as shining metal, gleaming like fire.",
      "links": "<a href='/AIV/26/1/27'>Ezek. 1:27</a>; <a href='/AIV/27/10/6'>Dan. 10:6</a>; <a href='/AIV/66/1/15'>Rev. 1:15-16</a>",
      "comment": "Ezekiel sees a glorious figure resembling past visions of God’s glory. This radiant appearance will later be echoed in the visions of Christ in the Book of Revelation, showing continuity in God’s self-revelation."
    },
    {
      "pk": 33008003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 3,
      "text": "He stretched out the form of a hand and took me by a lock of my hair, and the Spirit lifted me up between earth and heaven and brought me in visions of God to Jerusalem, to the entrance of the inner gate that faces north, where was the seat of the idol of jealousy, which provokes to jealousy.",
      "links": "<a href='/AIV/26/3/14'>Ezek. 3:14</a>; <a href='/AIV/26/11/1'>Ezek. 11:1</a>; <a href='/AIV/5/32/16'>Deut. 32:16</a>",
      "comment": "Ezekiel is supernaturally transported to Jerusalem, a foretaste of the intimate relationship believers are to have with God through the Spirit. The 'idol of jealousy' refers to idolatrous practices that offend God’s covenant relationship with His people."
    },
    {
      "pk": 33008004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 4,
      "text": "And behold, the glory of the God of Israel was there, like the vision that I saw in the plain.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/26/3/23'>Ezek. 3:23</a>",
      "comment": "God’s glory is consistent and holy, standing in contrast to idolatry. As in earlier visions, God’s glory defends the true faith and points toward the ultimate revelation of God in the Messiah."
    },
    {
      "pk": 33008005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 5,
      "text": "Then he said to me, 'Son of man, lift up your eyes now toward the north.' So I lifted up my eyes toward the north, and behold, north of the altar gate, in the entrance, was this idol of jealousy.",
      "links": "<a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "God calls Ezekiel to see the offense directly. True worship is exclusive, undivided—a theme Jesus reinforces in the New Testament (cf. Matt. 4:10: 'Worship the Lord your God and serve him only')."
    },
    {
      "pk": 33008006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 6,
      "text": "And he said to me, 'Son of man, do you see what they are doing, the great abominations that the house of Israel commits here, to drive me far from my sanctuary? But you will see still greater abominations.'",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/26/43/7'>Ezek. 43:7-8</a>",
      "comment": "The presence of God is driven away by sin, especially public sin and idolatry. Separation from God’s sanctuary recalls how sin separates believers. God’s holiness remains, even when His people fall away."
    },
    {
      "pk": 33008007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 7,
      "text": "And he brought me to the entrance of the court, and when I looked, behold, there was a hole in the wall.",
      "links": "<a href='/AIV/26/8/8'>Ezek. 8:8</a>",
      "comment": "This hidden passage suggests the secretive nature of sin. God’s prophets are shown what is concealed from men, reminding readers of the Church’s call to faithfulness and openness in worship."
    },
    {
      "pk": 33008008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 8,
      "text": "Then he said to me, 'Son of man, dig in the wall.' So I dug in the wall, and behold, there was an entrance.",
      "links": "<a href='/AIV/26/8/7'>Ezek. 8:7</a>",
      "comment": "Ezekiel’s action demonstrates how God’s messengers expose what is hidden. Even things done in secret are made plain before God, reinforcing the importance of purity within the worshiping community."
    },
    {
      "pk": 33008009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 9,
      "text": "And he said to me, 'Go in, and see the wicked abominations that they are doing here.'",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "God commands Ezekiel to witness the depth of Israel's betrayal. This call foreshadows how the new covenant would demand sincere faith and repentance, not just external rituals, in the true worship of God."
    },
    {
      "pk": 33008010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 10,
      "text": "So I went in and saw. And behold, every form of creeping things, and detestable beasts, and all the idols of the house of Israel, drawn on the walls all around.",
      "links": "<a href='/AIV/3/11/43'>Lev. 11:43-44</a>; <a href='/AIV/45/1/23'>Rom. 1:23</a>",
      "comment": "The images recall pagan worship, a direct violation of God’s law. The apostle Paul later warns that idolatry distorts God’s image in humanity (Rom. 1:23). The inner sanctuary is meant for pure worship, pointing to the call for holiness."
    },
    {
      "pk": 33008011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 11,
      "text": "And before them stood seventy men of the elders of the house of Israel, with Jaazaniah the son of Shaphan standing among them. Each had his censer in his hand, and the smoke of the cloud of incense went up.",
      "links": "<a href='/AIV/2/24/1'>Exod. 24:1</a>; <a href='/AIV/4/11/16'>Num. 11:16</a>",
      "comment": "Though incense usually symbolizes prayer, here it is twisted for false worship. The reference to seventy elders suggests a perversion of established authority and reminds us how leadership can either preserve or corrupt worship."
    },
    {
      "pk": 33008012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 12,
      "text": "Then he said to me, 'Son of man, have you seen what the elders of the house of Israel do in the dark, every man in the rooms of his carved images? For they say, “The LORD does not see us; the LORD has forsaken the land.”'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>; <a href='/AIV/26/9/9'>Ezek. 9:9</a>",
      "comment": "The elders’ hidden sins reflect a loss of faith in God’s presence. True tradition insists that God sees everything done by His people, encouraging accountability and genuine relationship rather than empty ritual."
    },
    {
      "pk": 33008013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 13,
      "text": "He said also to me, 'You will see still greater abominations that they commit.'",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "The revelation intensifies, moving from secret acts to public scandal. This progression warns of the spiritual consequences of unchecked sin and the need for firm discipline within the faith community."
    },
    {
      "pk": 33008014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 14,
      "text": "Then he brought me to the entrance of the gate of the LORD’s house that was toward the north; and behold, there sat women weeping for Tammuz.",
      "links": "<a href='/AIV/24/44/19'>Jer. 44:19</a>",
      "comment": "Tammuz worship involved lamentation rituals brought into God’s sanctuary—an example of syncretism corrupting pure worship. The persistence in ancient tradition points to the need for right doctrine and practice."
    },
    {
      "pk": 33008015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 15,
      "text": "Then he said to me, 'Have you seen this, son of man? You will see still greater abominations than these.'",
      "links": "<a href='/AIV/26/8/13'>Ezek. 8:13</a>",
      "comment": "The pattern of revelation and escalation teaches believers the seriousness of spiritual compromise and the need for steadfast, undivided fidelity to the faith once delivered."
    },
    {
      "pk": 33008016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 16,
      "text": "And he brought me into the inner court of the LORD’s house; and behold, at the entrance of the temple of the LORD, between the porch and the altar, there were about twenty-five men, with their backs to the temple of the LORD and their faces toward the east, worshiping the sun toward the east.",
      "links": "<a href='/AIV/4/16/17'>Num. 16:17</a>; <a href='/AIV/5/4/19'>Deut. 4:19</a>",
      "comment": "Sun worship in God’s own house is the ultimate proclamation of apostasy. Their backs are to God—the most blatant rejection. Facing east for worship was often forbidden as it mimicked pagan customs; in the new faith, true worship is ordered properly toward the presence of God."
    },
    {
      "pk": 33008017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 17,
      "text": "Then he said to me, 'Have you seen this, son of man? Is it a small thing for the house of Judah to commit the abominations which they commit here, that they fill the land with violence, and provoke me still further to anger? Behold, they put the branch to their nose.'",
      "links": "<a href='/AIV/23/65/3'>Isa. 65:3</a>; <a href='/AIV/26/7/23'>Ezek. 7:23</a>",
      "comment": "Idolatry leads inevitably to social injustice—violence in the land is a fruit of false worship. The phrase 'branch to their nose' likely refers to a pagan ritual, further emphasizing the need for right worship to transform life."
    },
    {
      "pk": 33008018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 8,
      "verse": 18,
      "text": "Therefore I also will act in wrath. My eye will not spare, nor will I have pity; and though they cry in my ears with a loud voice, I will not hear them.",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>; <a href='/AIV/26/9/10'>Ezek. 9:10</a>",
      "comment": "Persistent refusal to repent leads to judgment. God’s justice is absolute, but the context of the whole Bible reveals His ultimate plan for restoration and redemption through the Messiah, fulfilled in Christ’s sacrificial role for all humanity."
    }
  ],
  "translatedAt": "2025-12-24T09:02:16.066Z"
}