{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 26,
  "verses": [
    {
      "pk": 33026001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 1,
      "text": "In the eleventh year, on the first day of the month, the word of the LORD came to me:",
      "links": "<a href='/AIV/26/24/1'>Ezek. 24:1</a>; <a href='/AIV/24/39/1'>Jer. 39:1</a>",
      "comment": "Ezekiel frequently dates his prophecies, grounding them in history. This detail underscores the reliability and authority of prophetic revelation from God."
    },
    {
      "pk": 33026002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 2,
      "text": "“Son of man, because Tyre has said concerning Jerusalem, ‘Aha, the gateway of the peoples is broken; it has swung open to me. I shall be filled now that she is ruined,’”",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>; <a href='/AIV/28/12/2'>Hos. 12:2</a>",
      "comment": "Tyre rejoices over Jerusalem’s fall, revealing the sin of pride and rivalry. Such events often prefigure deeper spiritual truths about the dangers of boasting in human achievement rather than relying on God’s providence."
    },
    {
      "pk": 33026003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 3,
      "text": "therefore, thus says the Lord GOD: ‘Behold, I am against you, Tyre, and I will bring up many nations against you, as the sea brings up its waves.’",
      "links": "<a href='/AIV/23/17/12'>Isa. 17:12</a>; <a href='/AIV/29/3/4'>Joel 3:4</a>",
      "comment": "The imagery of the sea’s waves portrays overwhelming judgment. God’s sovereignty over all nations hints at His universal reign, preparing for the fullness of God's kingdom foretold by the prophets."
    },
    {
      "pk": 33026004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 4,
      "text": "They will destroy the walls of Tyre and break down her towers. I will scrape her soil from her and make her a bare rock.",
      "links": "<a href='/AIV/38/9/3'>Zech. 9:3-4</a>",
      "comment": "Tyre’s strength is stripped away, emphasizing that no earthly power withstands God’s will. There is a spiritual lesson on humility and reliance on God alone."
    },
    {
      "pk": 33026005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 5,
      "text": "She will become a place for spreading nets in the midst of the sea. For I have spoken,’ declares the Lord GOD, ‘and she will become plunder for the nations.",
      "links": "<a href='/AIV/26/47/10'>Ezek. 47:10</a>",
      "comment": "Tyre, once glorious, becomes desolate—a lesson in the fleeting nature of worldly glory. God’s word always accomplishes its purpose."
    },
    {
      "pk": 33026006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 6,
      "text": "And her daughter towns on the mainland will be slain by the sword, and they shall know that I am the LORD.",
      "links": "<a href='/AIV/26/28/23'>Ezek. 28:23</a>",
      "comment": "The phrase ‘they shall know that I am the LORD’ echoes throughout Ezekiel, pointing to God's desire for intimate relationship and acknowledgement. Ultimately, all judgment aims to bring people to true knowledge of God."
    },
    {
      "pk": 33026007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 7,
      "text": "For thus says the Lord GOD: ‘Behold, I will bring against Tyre from the north Nebuchadnezzar king of Babylon, king of kings, with horses, chariots, horsemen, and a great army.",
      "links": "<a href='/AIV/27/2/37'>Dan. 2:37-38</a>; <a href='/AIV/24/46/22'>Jer. 46:22</a>",
      "comment": "Nebuchadnezzar’s title ‘king of kings’ foreshadows messianic language applied to Christ in the New Testament (<a href='/AIV/66/19/16'>Rev. 19:16</a>), showing the anticipation of a greater King under God's ultimate authority."
    },
    {
      "pk": 33026008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 8,
      "text": "He will kill with the sword your daughter towns on the land. He will lay siege works against you, build up a ramp against you, and raise a shield against you.",
      "links": "<a href='/AIV/26/21/22'>Ezek. 21:22</a>",
      "comment": "Detailed prophecy of Babylon’s invasion, demonstrating God’s foreknowledge and control over history. This points to God's active providence in the affairs of men."
    },
    {
      "pk": 33026009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 9,
      "text": "He will direct the blows of his battering rams against your walls, and with his axes he will break down your towers.",
      "links": "<a href='/AIV/24/21/4'>Jer. 21:4</a>",
      "comment": "The vivid description of destruction highlights the complete futility of resistance against God's purposes. Historically, Tyre's fortifications were legendary, but nothing stands before God."
    },
    {
      "pk": 33026010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 10,
      "text": "His troops will cover you with dust from the many horses; your walls will shake at the noise of horsemen and chariots and wagons when he enters your gates as men enter a city which is breached.",
      "links": "<a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "The overwhelming force mirrors spiritual realities: judgment comes inevitably to those who persist in pride and opposition to God’s will."
    },
    {
      "pk": 33026011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 11,
      "text": "With his horses, he will trample all your streets. He will kill your people with the sword, and your mighty pillars will fall to the ground.",
      "links": "<a href='/AIV/24/50/27'>Jer. 50:27</a>",
      "comment": "The downfall of Tyre’s ‘mighty pillars’ is symbolic, reminding us that the proud will be humbled and the foundations of ungodly power will be shaken."
    },
    {
      "pk": 33026012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 12,
      "text": "They will strip your riches, loot your merchandise, break down your walls, and destroy your fine houses. They will throw your stones, timber, and soil into the water.",
      "links": "<a href='/AIV/26/27/27'>Ezek. 27:27</a>; <a href='/AIV/26/29/19'>Ezek. 29:19</a>",
      "comment": "This prophecy was fulfilled historically when Alexander the Great used Tyre’s ruins to build a causeway (<a href='/AIV/27/8/21'>Dan. 8:21</a>). Allegorically, it reflects how treasures not laid up in heaven perish."
    },
    {
      "pk": 33026013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 13,
      "text": "So I will put an end to the sound of your songs, and the music of your lyres shall be heard no more.",
      "links": "<a href='/AIV/23/24/8'>Isa. 24:8</a>; <a href='/AIV/19/137/2'>Ps. 137:2</a>",
      "comment": "The silence of Tyre serves as a caution to those who rely on worldly joy rather than joy rooted in faith and communion with God."
    },
    {
      "pk": 33026014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 14,
      "text": "I will make you a bare rock; you shall be a place for spreading nets. You shall never be rebuilt, for I the LORD have spoken, declares the Lord GOD.",
      "links": "<a href='/AIV/24/51/37'>Jer. 51:37</a>",
      "comment": "Throughout Scripture, utter destruction often serves as a warning and a call to conversion. Finality of judgment points to the final destiny of the soul and the necessity of repentance."
    },
    {
      "pk": 33026015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 15,
      "text": "This is what the Lord GOD says to Tyre: ‘Will not the coastlands quake at the sound of your fall, when the wounded groan, when slaughter takes place in your midst?’",
      "links": "<a href='/AIV/23/23/1-18'>Isa. 23:1-18</a>",
      "comment": "Tyre’s downfall impacts surrounding peoples, reminding us that sin and judgment have a ripple effect—another call to holiness for the entire community."
    },
    {
      "pk": 33026016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 16,
      "text": "Then all the princes of the coast will step down from their thrones, remove their robes, and take off their embroidered garments. They will clothe themselves with trembling and sit on the ground, trembling every moment, appalled at you.",
      "links": "<a href='/AIV/19/102/15'>Ps. 102:15</a>",
      "comment": "Leaders humbled by Tyre’s fate point to the reversal of pride. Spiritual leadership must always be with humility and service."
    },
    {
      "pk": 33026017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 17,
      "text": "They will raise a lament over you and say to you, ‘How you have perished, O city of renown, populated by men of the sea, she who was mighty on the sea, she and her inhabitants—who spread terror among all her dwellers!’",
      "links": "<a href='/AIV/26/27/31-36'>Ezek. 27:31-36</a>",
      "comment": "The lament for Tyre recalls the themes of mourning and repentance found elsewhere (cf. <a href='/AIV/40/11/21'>Matt. 11:21</a>), urging us to seek God while He may be found."
    },
    {
      "pk": 33026018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 18,
      "text": "Now the coastlands tremble on the day of your fall; the islands in the sea are alarmed at your collapse.",
      "links": "<a href='/AIV/26/27/35'>Ezek. 27:35</a>",
      "comment": "Tyre’s fall points to the transience of human accomplishment—echoing the spiritual principle that permanent security is found only in the eternal promises of God."
    },
    {
      "pk": 33026019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 19,
      "text": "For thus says the Lord GOD: ‘When I make you a desolate city, like cities that are not inhabited, when I bring the deep over you and great waters cover you,’",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>; <a href='/AIV/23/43/2'>Isa. 43:2</a>",
      "comment": "The imagery of waters covering Tyre connects to themes of judgment and purification—reminding believers of the need for sacramental grace and spiritual renewal."
    },
    {
      "pk": 33026020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 20,
      "text": "then I will bring you down with those who descend to the pit, to the people of long ago. I will make you dwell in the lower parts of the earth, like ruins from ancient times, with those who go down to the pit, so that you may not be inhabited; I will show glory in the land of the living.",
      "links": "<a href='/AIV/23/14/15'>Isa. 14:15</a>; <a href='/AIV/26/32/18'>Ezek. 32:18</a>",
      "comment": "References to the pit evoke ideas of Sheol and the afterlife, beckoning reflection on the resurrection and the hope of eternal life for those united to God in faith."
    },
    {
      "pk": 33026021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 26,
      "verse": 21,
      "text": "I will make you a terror, and you shall be no more; though you are sought for, you will never again be found, declares the Lord GOD.”",
      "links": "<a href='/AIV/26/25/7'>Ezek. 25:7</a>; <a href='/AIV/26/28/19'>Ezek. 28:19</a>",
      "comment": "Tyre’s fate ends with complete disappearance, underscoring the eternal consequences of persistent sin. As God’s justice is revealed, so is the invitation to seek lasting mercy and salvation through faithful obedience."
    }
  ],
  "translatedAt": "2025-12-24T09:12:39.779Z"
}