{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 27,
  "verses": [
    {
      "pk": 33027001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/26/1'>Ezek. 26:1</a>; <a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "Ezekiel receives direct revelation from the Lord, a pattern seen throughout biblical prophecy. The prophetic office is divinely instituted, with the prophet speaking God's words, anticipating the way God later speaks through appointed messengers (cf. Acts 3:21)."
    },
    {
      "pk": 33027002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 2,
      "text": "\"Son of man, raise a lamentation over Tyre,",
      "links": "<a href='/AIV/26/19/1'>Ezek. 19:1</a>; <a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "Lamentation or dirge is a formal genre for expressing mourning over cities or peoples under judgment (cf. Lamentations). Such corporate laments foreshadow the universal judgment and Christ's mournful sorrow over Jerusalem (Luke 19:41)."
    },
    {
      "pk": 33027003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 3,
      "text": "and say to Tyre, who sits at the entry of the sea, trading with the peoples to many coastlands, 'This is what the Lord GOD says: O Tyre, you have said, \"I am perfect in beauty.\"'",
      "links": "<a href='/AIV/26/27/32'>Ezek. 27:32</a>; <a href='/AIV/12/9/27'>1 Kings 9:27</a>",
      "comment": "Tyre's claim to perfection echoes the human tendency towards pride and self-sufficiency, themes later addressed by Christ (Matt. 23:12). The city's global influence foreshadows how spiritual pride brings judgment."
    },
    {
      "pk": 33027004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 4,
      "text": "Your borders are in the heart of the seas; your builders perfected your beauty.",
      "links": "<a href='/AIV/26/27/16'>Ezek. 27:16</a>",
      "comment": "Tyre's location and craftsmanship evoke Eden-like imagery, paralleling the Garden's perfection before the fall (Gen. 2:8; Ezek. 28:13). The builders represent a collaborative human effort, yet ultimately vulnerable outside God's covenant."
    },
    {
      "pk": 33027005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 5,
      "text": "They made all your planks from fir trees from Senir; they took cedars from Lebanon to build a mast for you.",
      "links": "<a href='/AIV/05/3/9'>Deut. 3:9</a>; <a href='/AIV/11/5/6'>1 Kings 5:6'</a>",
      "comment": "Materials from Senir and Lebanon highlight Tyre's wealth and international connections, reminiscent of the resources used for Solomon’s temple (1 Kings 5:6–10). This reflects an early typology of the Church built from all nations with diverse gifts."
    },
    {
      "pk": 33027006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 6,
      "text": "From oaks of Bashan they made your oars; your deck they crafted with ivory inlaid in boxwood from the coasts of Kittim.",
      "links": "<a href='/AIV/01/10/4'>Gen. 10:4</a>; <a href='/AIV/26/31/6'>Ezek. 31:6</a>",
      "comment": "The opulence described in Tyre’s ships prefigures later biblical imagery of vessels for the Lord (cf. Acts 27:6). Bashan, Kittim, and ivory show global reach, but all earthly glory is transitory and destined for judgment without God."
    },
    {
      "pk": 33027007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 7,
      "text": "Fine embroidered linen from Egypt became your sail, serving as your ensign; blue and purple from the coasts of Elishah were your awnings.",
      "links": "<a href='/AIV/02/25/4'>Exodus 25:4</a>; <a href='/AIV/01/10/4'>Gen. 10:4</a>",
      "comment": "Egyptian linen and Elishah’s dyes parallel the tabernacle and priestly vestments (Exodus 25:4). The symbolism of blue and purple, colors of royalty and priesthood, points to the fulfillment in Christ the High Priest (Heb. 4:14)."
    },
    {
      "pk": 33027008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 8,
      "text": "The inhabitants of Sidon and Arvad were your rowers; your skilled men, O Tyre, were among you; they were your pilots.",
      "links": "<a href='/AIV/07/18/28'>Judges 18:28</a>; <a href='/AIV/01/10/15'>Gen. 10:15</a>",
      "comment": "Sidon, Arvad, and Tyre symbolize regional cooperation for commerce, yet spiritual unity in Christ surpasses earthly alliances (Eph. 4:4–6)."
    },
    {
      "pk": 33027009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 9,
      "text": "The elders of Gebal and its skilled men were within you, patching your seams. All the ships of the sea with their sailors were among you, to trade for your merchandise.",
      "links": "<a href='/AIV/19/83/7'>Ps. 83:7</a>",
      "comment": "The mention of ‘elders’ and skilled men recalls the role of elders in the community (Num. 11:16; Acts 14:23). While Tyre’s unity was for profit, God’s assembly is for worship and communion."
    },
    {
      "pk": 33027010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 10,
      "text": "Men of Persia, Lud, and Put were in your army, serving as your men of war. They hung shields and helmets in you; they gave you splendor.",
      "links": "<a href='/AIV/01/10/22'>Gen. 10:22</a>; <a href='/AIV/26/30/5'>Ezek. 30:5</a>",
      "comment": "Tyre’s military alliances, though impressive, cannot substitute for God’s protection. Persia, Lud, and Put reflect the transitory nature of earthly power (cf. Dan. 2:37–44)."
    },
    {
      "pk": 33027011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 11,
      "text": "Men of Arvad were stationed around your walls, and valiant men guarded your towers. They hung their shields on your walls all around; they made your beauty perfect.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>",
      "comment": "The fortified walls and valiant men point to human security, yet, as Psalm 127:1 teaches, unless the Lord guards a city, the watchmen stay awake in vain."
    },
    {
      "pk": 33027012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 12,
      "text": "Tarshish traded with you because of your abundant wealth of every kind; silver, iron, tin, and lead they exchanged for your merchandise.",
      "links": "<a href='/AIV/01/10/4'>Gen. 10:4</a>; <a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "Tarshish was a distant trading partner (cf. Jonah 1:3). Tyre’s wealth is foreshadowed in the New Jerusalem’s treasures brought from all nations (Isa. 60:5–9)."
    },
    {
      "pk": 33027013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 13,
      "text": "Javan, Tubal, and Meshech traded with you; they exchanged slaves and bronze utensils for your merchandise.",
      "links": "<a href='/AIV/01/10/2'>Gen. 10:2</a>; <a href='/AIV/26/32/26'>Ezek. 32:26</a>",
      "comment": "Reference to the slave trade is a somber reminder of mankind's fallen condition (cf. Gen. 37:28). The Gospel calls for universal dignity rooted in Christ’s redemptive work (Gal. 3:28)."
    },
    {
      "pk": 33027014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 14,
      "text": "People from Beth Togarmah exchanged horses, war horses, and mules for your merchandise.",
      "links": "<a href='/AIV/01/10/3'>Gen. 10:3</a>; <a href='/AIV/26/38/6'>Ezek. 38:6</a>",
      "comment": "The trade in horses and mules foreshadows messianic prophecy where the Messiah enters Jerusalem humbly on a colt (Zech. 9:9; Matt. 21:5)."
    },
    {
      "pk": 33027015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 15,
      "text": "Men of Dedan traded with you. Many coastlands were your markets; they brought you ivory tusks and ebony as payment.",
      "links": "<a href='/AIV/01/10/7'>Gen. 10:7</a>; <a href='/AIV/23/13/21'>Isa. 13:21</a>",
      "comment": "Dedan and the coastlands highlight the reach of Tyre's commerce. The imagery finds fulfillment when all nations bring their treasures into the Lord’s city (Rev. 21:24)."
    },
    {
      "pk": 33027016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 16,
      "text": "Aram traded with you because of your multitude of goods; they exchanged turquoise, purple cloths, embroidered work, fine linen, coral, and rubies for your merchandise.",
      "links": "<a href='/AIV/26/27/7'>Ezek. 27:7</a>; <a href='/AIV/23/54/11'>Isa. 54:11–12</a>",
      "comment": "These costly items recall the tabernacle and temple, where beauty and craftsmanship point to God’s glory. The New Covenant gathers treasures for the worship of God (Mal. 1:11)."
    },
    {
      "pk": 33027017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 17,
      "text": "Judah and Israel traded with you; they brought wheat from Minnith, honey, oil, and balm as merchandise.",
      "links": "<a href='/AIV/07/11/33'>Judges 11:33</a>; <a href='/AIV/01/43/11'>Gen. 43:11</a>",
      "comment": "Judah and Israel’s involvement emphasizes God’s chosen people as integral to the world economy, presaging the inclusion of all in the spiritual Israel (Rom. 11:17–24)."
    },
    {
      "pk": 33027018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 18,
      "text": "Damascus traded with you because of your multitude of goods and abundant wealth, offering wine from Helbon and wool.",
      "links": "<a href='/AIV/23/17/1'>Isa. 17:1</a>; <a href='/AIV/01/14/15'>Gen. 14:15</a>",
      "comment": "Wine and wool indicate luxury and prosperity. Wine later symbolizes the blood of the new covenant (Luke 22:20)."
    },
    {
      "pk": 33027019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 19,
      "text": "Vedan and Javan from Uzal supplied iron, cassia, and calamus for your merchandise.",
      "links": "<a href='/AIV/26/27/13'>Ezek. 27:13</a>; <a href='/AIV/19/45/8'>Ps. 45:8</a>",
      "comment": "Cassia and calamus were used in anointing oil for priests (Ex. 30:24). The inclusion of these items anticipates spiritual anointing through Christ."
    },
    {
      "pk": 33027020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 20,
      "text": "Dedan traded with you in saddlecloths for riding.",
      "links": "<a href='/AIV/01/25/3'>Gen. 25:3</a>; <a href='/AIV/23/21/13'>Isa. 21:13</a>",
      "comment": "Even mundane items like saddlecloths have spiritual significance, as Christ enters Jerusalem riding humbly on a donkey (Matt. 21:5)."
    },
    {
      "pk": 33027021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 21,
      "text": "Arabia and all the princes of Kedar traded with you in lambs, rams, and goats; in these they were your merchants.",
      "links": "<a href='/AIV/23/21/13'>Isa. 21:13</a>; <a href='/AIV/01/25/13'>Gen. 25:13</a>",
      "comment": "Animals for sacrifice foreshadow Christ, the Lamb of God, who takes away the sin of the world (John 1:29)."
    },
    {
      "pk": 33027022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 22,
      "text": "The merchants of Sheba and Raamah traded with you; they exchanged the choicest spices, all kinds of precious stones, and gold for your merchandise.",
      "links": "<a href='/AIV/01/10/7'>Gen. 10:7</a>; <a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "Sheba’s spices and gold recall the gifts given to Solomon (1 Kings 10:10), and prophetically, the gifts brought to Christ by the Magi (Matt. 2:11)."
    },
    {
      "pk": 33027023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 23,
      "text": "Haran, Canneh, Eden, the merchants of Sheba, Asshur, and Kilmad traded with you.",
      "links": "<a href='/AIV/01/2/14'>Gen. 2:14</a>; <a href='/AIV/01/11/31'>Gen. 11:31</a>",
      "comment": "References to Haran and Eden evoke themes of origin, fall, and redemption. Tyre’s interconnectedness prefigures the unity God desires for His people."
    },
    {
      "pk": 33027024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 24,
      "text": "They traded in choice garments, blue cloths, embroidered work, carpets of multicolored fabric, and tightly wound cords among your merchandise.",
      "links": "<a href='/AIV/02/26/36'>Ex. 26:36</a>; <a href='/AIV/19/45/13'>Ps. 45:13–14</a>",
      "comment": "Garments and fabrics signify dignity and purity. The fulfillment occurs in the saints' white robes (Rev. 7:9)."
    },
    {
      "pk": 33027025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 25,
      "text": "The ships of Tarshish sailed for you with your merchandise. You were filled and very glorious in the heart of the seas.",
      "links": "<a href='/AIV/19/48/7'>Ps. 48:7</a>; <a href='/AIV/01/10/4'>Gen. 10:4</a>",
      "comment": "Tyre’s glory, brought by sea trade, mirrors humanity's desire for self-exaltation. Only Christ offers true, lasting glory (Phil. 3:21)."
    },
    {
      "pk": 33027026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 26,
      "text": "Your rowers have brought you into great waters; but the east wind has shattered you in the heart of the seas.",
      "links": "<a href='/AIV/19/48/7'>Ps. 48:7</a>; <a href='/AIV/02/14/21'>Ex. 14:21</a>",
      "comment": "The east wind often symbolizes judgment (Ex. 14:21). Tyre's pride led to downfall, a type of spiritual warning for all."
    },
    {
      "pk": 33027027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 27,
      "text": "Your wealth, your merchandise, your goods, your sailors, your pilots, your seamers, your dealers, and all your fighters who are within you, along with all your company that is in your midst, will sink into the heart of the seas on the day of your fall.",
      "links": "<a href='/AIV/26/27/34'>Ezek. 27:34</a>; <a href='/AIV/19/46/2'>Ps. 46:2</a>",
      "comment": "The universal loss echoes the futility of trusting material riches (Matt. 6:19–20). Only treasures stored in heaven endure."
    },
    {
      "pk": 33027028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 28,
      "text": "At the sound of the cry of your pilots, the coastlands will tremble.",
      "links": "<a href='/AIV/19/97/4'>Ps. 97:4</a>; <a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "Tyre’s downfall affects the surrounding nations. Sin’s consequences reach far and wide, yet Christ brings restoration to all who mourn (Matt. 5:4)."
    },
    {
      "pk": 33027029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 29,
      "text": "All who handle the oars, the sailors, and all the pilots of the sea will come down from their ships; they will stand on the land.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>; <a href='/AIV/19/107/23'>Ps. 107:23</a>",
      "comment": "The abandonment of ships foreshadows leaving worldly attachments behind to follow Christ (Matt. 19:27)."
    },
    {
      "pk": 33027030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 30,
      "text": "They will raise their voice over you and cry bitterly. They will cast dust on their heads and wail; they will weep for you in bitterness of soul.",
      "links": "<a href='/AIV/40/11/21'>Matt. 11:21</a>; <a href='/AIV/19/102/9'>Ps. 102:9</a>",
      "comment": "Traditional mourning customs (casting dust, wailing) prefigure repentance, later emphasized by Christ (Luke 18:13)."
    },
    {
      "pk": 33027031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 31,
      "text": "They will shave themselves bald for you and put on sackcloth; they will weep over you in bitterness of spirit and deep mourning.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>; <a href='/AIV/32/3/5'>Jonah 3:5</a>",
      "comment": "Mourning and sackcloth foreshadow the penitence called for in the prophets and the Church. Repentance precedes restoration (Joel 2:13)."
    },
    {
      "pk": 33027032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 32,
      "text": "In their wailing they will raise a lamentation for you and lament over you: 'Who is like Tyre, silenced in the midst of the sea?'",
      "links": "<a href='/AIV/19/48/2'>Ps. 48:2</a>; <a href='/AIV/66/18/19'>Rev. 18:19</a>",
      "comment": "The rhetorical question 'Who is like Tyre?' is echoed in lamentations over Babylon's fall (Rev. 18:18–19). Temporal greatness gives way to eternal truth."
    },
    {
      "pk": 33027033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 33,
      "text": "When your goods went out from the seas, you filled many peoples; with your abundant wealth and merchandise, you enriched the kings of the earth.",
      "links": "<a href='/AIV/66/18/15'>Rev. 18:15</a>; <a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "Tyre’s enrichment of nations is later contrasted to the enrichment found in God’s grace and heavenly treasures."
    },
    {
      "pk": 33027034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 34,
      "text": "Now you are broken by the seas, in the depths of the waters; your merchandise and all your company have fallen with you.",
      "links": "<a href='/AIV/19/46/2'>Ps. 46:2</a>; <a href='/AIV/66/18/17'>Rev. 18:17</a>",
      "comment": "Tyre’s fall prefigures the final judgment upon all worldly powers. Salvation comes from being united to God's kingdom."
    },
    {
      "pk": 33027035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 35,
      "text": "All the inhabitants of the coastlands are appalled at you; their kings are terrified and their faces contorted.",
      "links": "<a href='/AIV/23/23/5'>Isa. 23:5</a>; <a href='/AIV/66/6/15'>Rev. 6:15</a>",
      "comment": "Tyre’s devastation inspires fear in surrounding nations, foreshadowing the terror at the coming of the Lord’s day (Joel 2:1–2)."
    },
    {
      "pk": 33027036,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 27,
      "verse": 36,
      "text": "The merchants among the peoples hiss at you; you have become a horror and will be no more forever.\"",
      "links": "<a href='/AIV/26/26/21'>Ezek. 26:21</a>; <a href='/AIV/66/18/21'>Rev. 18:21</a>",
      "comment": "Tyre’s utter destruction emphasizes the temporal nature of earthly glory. In contrast, the promise of Christ’s kingdom is everlasting (Dan. 2:44; Rev. 11:15)."
    }
  ],
  "translatedAt": "2025-12-24T09:13:23.976Z"
}