{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 29,
  "verses": [
    {
      "pk": 33029001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 1,
      "text": "In the tenth year, in the tenth month, on the twelfth day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/24/46/2'>Jer. 46:2</a>",
      "comment": "Ezekiel precisely dates this prophecy, emphasizing its historical reliability. The phrase 'word of the LORD came' establishes divine authority—a concept foundational for understanding prophetic revelation. See also <a href='/AIV/26/1/1'>Ezek. 1:1</a>."
    },
    {
      "pk": 33029002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 2,
      "text": "Son of man, set your face against Pharaoh king of Egypt, and prophesy against him and against all Egypt.",
      "links": "<a href='/AIV/23/19/1'>Isa. 19:1</a>; <a href='/AIV/24/46/25'>Jer. 46:25</a>",
      "comment": "Ezekiel is called to confront Egypt, reminiscent of prophetic confrontations in <a href='/AIV/2/7/1'>Exodus 7:1</a>. Egypt represents pride and opposition to God's will."
    },
    {
      "pk": 33029003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 3,
      "text": "Speak and say, 'Thus says the Lord GOD: Behold, I am against you, Pharaoh king of Egypt, the great monster lying in the midst of his streams, who says, \"My Nile is my own; I made it for myself.\"'",
      "links": "<a href='/AIV/23/27/1'>Isa. 27:1</a>; <a href='/AIV/2/5/2'>Exod. 5:2</a>",
      "comment": "The Nile symbolized life for Egypt. Pharaoh's claim reflects deep pride and self-deification. God's judgment of 'the great monster' can allude to Leviathan imagery and foreshadow Christ's defeat of pride and evil. See <a href='/AIV/19/74/14'>Ps. 74:14</a>."
    },
    {
      "pk": 33029004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 4,
      "text": "'I will put hooks in your jaws and make the fish of your streams stick to your scales. I will pull you out of the midst of your streams, with all the fish of your streams that stick to your scales.'",
      "links": "<a href='/AIV/26/38/4'>Ezek. 38:4</a>; <a href='/AIV/23/37/29'>Isa. 37:29</a>",
      "comment": "Hooks in the jaws imply total control by God over even the most powerful rulers. This underscores divine sovereignty as seen in <a href='/AIV/27/4/35'>Dan. 4:35</a>."
    },
    {
      "pk": 33029005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 5,
      "text": "'I will leave you in the wilderness, you and all the fish of your streams. You shall fall on the open field and not be gathered or buried. I have given you for food to the beasts of the earth and the birds of the sky.'",
      "links": "<a href='/AIV/26/32/4'>Ezek. 32:4</a>; <a href='/AIV/19/79/2'>Ps. 79:2</a>",
      "comment": "This is an image of utter defeat and disgrace, echoing covenant curses. The lack of burial signifies judgment and separation from God's favor. See <a href='/AIV/24/7/33'>Jer. 7:33</a>."
    },
    {
      "pk": 33029006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 6,
      "text": "'Then all the inhabitants of Egypt shall know that I am the LORD. Because you have been a staff of reed to the house of Israel,'",
      "links": "<a href='/AIV/23/36/23'>Isa. 36:6</a>; <a href='/AIV/2/7/5'>Exod. 7:5</a>",
      "comment": "Egypt's unreliability is compared to a broken reed, highlighting the futility of trusting in human power over divine guidance. This theme finds fullness in Christ—ultimate trust and mediator. See <a href='/AIV/55/2/5'>1 Tim. 2:5</a>."
    },
    {
      "pk": 33029007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 7,
      "text": "'When they grasped you by the hand, you broke and tore all their shoulders. When they leaned on you, you broke and made all their backs unsteady.'",
      "links": "<a href='/AIV/23/36/6'>Isa. 36:6</a>",
      "comment": "Egypt’s aid failed Israel and brought harm, reflecting a failed promise and misdirected dependence. This anticipates the importance of a trustworthy spiritual authority and a church that does not fail."
    },
    {
      "pk": 33029008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 8,
      "text": "'Therefore, thus says the Lord GOD: Behold, I will bring a sword upon you, and will cut off from you both man and animal.'",
      "links": "<a href='/AIV/24/46/13'>Jer. 46:13</a>; <a href='/AIV/26/14/17'>Ezek. 14:17</a>",
      "comment": "The sword means divine judgment. God uses historical events for spiritual purposes. Both humans and animals affected show a total judgment, reminiscent of spiritual and physical consequences for turning away from God."
    },
    {
      "pk": 33029009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 9,
      "text": "'The land of Egypt shall become a desolation and a waste. Then they shall know that I am the LORD, because you said, \"The Nile is mine, and I made it.\"'",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>; <a href='/AIV/26/30/19'>Ezek. 30:19</a>",
      "comment": "Egypt’s pride is judged. God alone is Creator and Lord, a theme fulfilled Christologically in New Testament references to creation through Christ (<a href='/AIV/51/1/16'>Col. 1:16</a>)."
    },
    {
      "pk": 33029010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 10,
      "text": "'Therefore, I am against you and your streams, and I will make the land of Egypt a ruined desolation, from Migdol to Syene, even as far as the border of Cush.'",
      "links": "<a href='/AIV/26/30/6'>Ezek. 30:6</a>; <a href='/AIV/24/44/1'>Jer. 44:1</a>",
      "comment": "'From Migdol to Syene' marks the whole territory of Egypt, signifying complete judgment—an image of spiritual desolation when separated from God’s covenant and life-giving grace."
    },
    {
      "pk": 33029011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 11,
      "text": "'No foot of man shall pass through it, nor foot of beast shall pass through it. It shall remain uninhabited for forty years.'",
      "links": "<a href='/AIV/26/4/6'>Ezek. 4:6</a>",
      "comment": "Forty years symbolizes testing, judgment, and renewal in biblical history (<a href='/AIV/2/16/35'>Exod. 16:35</a>). Its frequent appearance anticipates spiritual purification and restoration."
    },
    {
      "pk": 33029012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 12,
      "text": "'I will scatter the Egyptians among the nations and disperse them through the countries.'",
      "links": "<a href='/AIV/26/12/15'>Ezek. 12:15</a>; <a href='/AIV/24/46/19'>Jer. 46:19</a>",
      "comment": "Scattering signifies separation and exile. Yet, it sets the stage for restoration, mirroring the pattern of exile and return for God’s people—a motif fulfilled in spiritual reconciliation through Christ."
    },
    {
      "pk": 33029013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 13,
      "text": "'Yet thus says the Lord GOD: At the end of forty years I will gather the Egyptians from the peoples where they were scattered.'",
      "links": "<a href='/AIV/26/28/25'>Ezek. 28:25</a>",
      "comment": "God’s mercy is revealed after judgment. Restoration after exile models ultimate healing and unity in God’s plan, prefiguring Christ’s work of bringing all nations together."
    },
    {
      "pk": 33029014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 14,
      "text": "'I will restore the fortunes of Egypt and bring them back to the land of Pathros, to the land of their origin, and there they shall be a lowly kingdom.'",
      "links": "<a href='/AIV/23/19/22'>Isa. 19:22</a>; <a href='/AIV/26/16/53'>Ezek. 16:53</a>",
      "comment": "Restoration comes, but as a humble nation. This shows God’s justice and mercy—a balance echoed in Christ’s humility and exaltation (<a href='/AIV/50/2/7-9'>Phil. 2:7-9</a>)."
    },
    {
      "pk": 33029015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 15,
      "text": "'It shall be the lowest of kingdoms and will never again exalt itself above the nations. I will make them so small that they shall never again rule over the nations.'",
      "links": "<a href='/AIV/26/28/24'>Ezek. 28:24</a>; <a href='/AIV/23/14/15'>Isa. 14:15</a>",
      "comment": "Egypt will never again be a dominant power; pride is permanently humbled. God alone raises and lowers kings, pointing to the fullness of divine kingship established through Christ."
    },
    {
      "pk": 33029016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 16,
      "text": "'And it shall no longer be the confidence of the house of Israel, bringing to mind their iniquity when they turn to Egypt for help. Then they shall know that I am the Lord GOD.'",
      "links": "<a href='/AIV/23/30/2-3'>Isa. 30:2-3</a>",
      "comment": "Israel’s dependence on Egypt resulted in sin. The lesson is the need for direct reliance on God’s appointed means and authority rather than worldly powers—a principle for spiritual leadership and unity."
    },
    {
      "pk": 33029017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 17,
      "text": "In the twenty-seventh year, in the first month, on the first day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "This date places the prophecy 17 years after the previous one. Demonstrates the continuity of God’s word and faithfulness in fulfilling promises over time."
    },
    {
      "pk": 33029018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 18,
      "text": "Son of man, Nebuchadnezzar king of Babylon caused his army to serve greatly against Tyre; every head was made bald and every shoulder rubbed bare, but neither he nor his army received wages from Tyre for the labor they had done against it.",
      "links": "<a href='/AIV/25/2/16'>Lam. 2:16</a>; <a href='/AIV/27/2/37'>Dan. 2:37</a>",
      "comment": "Babylon’s campaign brought no earthly reward, highlighting that God, not man, provides for faithful service. Points to God's ultimate return and reward for perseverance in His work."
    },
    {
      "pk": 33029019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 19,
      "text": "Therefore thus says the Lord GOD: I will give Egypt to Nebuchadnezzar king of Babylon. He shall carry off her wealth and take her spoil and seize her plunder; that shall be the wages for his army.",
      "links": "<a href='/AIV/26/30/10'>Ezek. 30:10</a>; <a href='/AIV/27/1/1-4'>Dan. 1:1-4</a>",
      "comment": "God uses world powers to accomplish His judgment, but the ultimate reward comes from Him. This underlines the principle of providence and divine justice."
    },
    {
      "pk": 33029020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 20,
      "text": "'I have given him the land of Egypt as his payment for which he labored, because they worked for me, declares the Lord GOD.'",
      "links": "<a href='/AIV/26/30/24'>Ezek. 30:24</a>",
      "comment": "God positions kings and realms to accomplish His purposes. Babylon received Egypt as divine provision. Affirmation of authority established by God, echoing the biblical stress on legitimate spiritual hierarchy."
    },
    {
      "pk": 33029021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 29,
      "verse": 21,
      "text": "'On that day I will cause a horn to spring up for the house of Israel, and I will open your mouth among them. Then they shall know that I am the LORD.'",
      "links": "<a href='/AIV/19/132/17'>Ps. 132:17</a>; <a href='/AIV/42/1/69'>Luke 1:69</a>",
      "comment": "The 'horn' symbolizes strength and deliverance, a messianic image ultimately fulfilled in Christ (<a href='/AIV/42/1/69'>Luke 1:69</a>). God empowering Ezekiel to speak prefigures divinely-appointed authority and inspired proclamation for the people."
    }
  ],
  "translatedAt": "2025-12-24T09:14:29.433Z"
}