{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 10,
  "verses": [
    {
      "pk": 33010001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 1,
      "text": "Then I looked, and there above the expanse that was over the heads of the cherubim, there appeared something like a throne, as if made of sapphire, and it was seen above them.",
      "links": "<a href='/AIV/26/1/22'>Ezek. 1:22</a>; <a href='/AIV/02/24/10'>Ex. 24:10</a>; <a href='/AIV/66/4/6'>Rev. 4:6</a>",
      "comment": "The prophet sees again the heavenly throne, emphasizing the glory and authority of God. The parallels to Ezekiel 1 and Exodus 24 suggest a continuity in God's revelation. The throne imagery also anticipates New Testament visions of God's majesty (Rev. 4:2-6)."
    },
    {
      "pk": 33010002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 2,
      "text": "And He spoke to the man clothed with linen and said, 'Go in among the wheels beneath the cherubim, fill your hands with burning coals from among the cherubim, and scatter them over the city.' And he went in before my eyes.",
      "links": "<a href='/AIV/26/9/2'>Ezek. 9:2</a>; <a href='/AIV/26/1/13'>Ezek. 1:13</a>",
      "comment": "The burning coals symbolize God's judgment and purification. That the command comes from the enthroned One stresses divine initiative and justice. The man in linen recalls priestly imagery—intercession and mediation. The act shows God's holiness and the seriousness of sin. See also Is. 6:6-7 for another context where fire is used for purification."
    },
    {
      "pk": 33010003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 3,
      "text": "Now the cherubim were standing on the south side of the temple when the man went in, and the cloud filled the inner court.",
      "links": "<a href='/AIV/02/40/34'>Ex. 40:34</a>; <a href='/AIV/11/8/10-11'>1 Kgs. 8:10-11</a>",
      "comment": "The cloud represents the tangible presence of God (the Shekinah). Its appearance links this moment to the dedication of the tabernacle and the temple, signifying both God's pleasure and, here, His impending departure due to the people's unfaithfulness."
    },
    {
      "pk": 33010004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 4,
      "text": "Then the glory of the LORD rose from above the cherubim to the threshold of the temple, and the temple was filled with the cloud, and the court was filled with the brightness of the LORD's glory.",
      "links": "<a href='/AIV/26/9/3'>Ezek. 9:3</a>; <a href='/AIV/19/18/11-12'>Ps. 18:11-12</a>",
      "comment": "God's glory moves, foreshadowing His withdrawal from the temple—the visible judgment for Israel’s covenant infidelity. This gradual departure contrasts with God's earlier passionate indwelling among His people, stressing that His faithfulness is enduring, but He will not dwell where He is persistently rejected."
    },
    {
      "pk": 33010005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 5,
      "text": "And the sound of the wings of the cherubim was heard as far as the outer court, like the voice of God Almighty when He speaks.",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>; <a href='/AIV/19/29/3-4'>Ps. 29:3-4</a>",
      "comment": "The wings’ sound signifies the majesty and awesome power of God. The metaphor connects the angelic hosts and God’s sovereignty, with echoes of the Psalms that speak of His powerful voice."
    },
    {
      "pk": 33010006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 6,
      "text": "And when He commanded the man clothed with linen, saying, 'Take fire from among the wheels, from among the cherubim,' he went in and stood beside the wheel.",
      "links": "<a href='/AIV/26/1/15'>Ezek. 1:15</a>",
      "comment": "The wheels, part of the vision’s living chariot, represent the omnipresence and perfect judgment of God, moving wherever His Spirit wills. The man in linen’s obedience highlights the pattern of divine command, mediation, and execution, a biblical theme about God working through chosen agents."
    },
    {
      "pk": 33010007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 7,
      "text": "And a cherub stretched out his hand from among the cherubim to the fire that was among them, and he took some of it and put it into the hands of the man clothed with linen. And he took it and went out.",
      "links": "<a href='/AIV/23/6/6'>Is. 6:6</a>",
      "comment": "The cooperation between the cherub and the man in linen emphasizes the unity of the heavenly court. The burning coals, in passing from the angelic to human intermediary, echo the role of mediation and atonement—a theme seen in Isaiah where fire symbolizes purification and commissioning."
    },
    {
      "pk": 33010008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 8,
      "text": "And under the wings of the cherubim was something like human hands, visible to them.",
      "links": "<a href='/AIV/26/1/8'>Ezek. 1:8</a>",
      "comment": "The human-like hands signify the readiness and ability of angelic beings to act in the service of God’s will. The detailed description is a reminder of the personal power behind God’s providence and judgment."
    },
    {
      "pk": 33010009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 9,
      "text": "And I looked, and there were four wheels beside the cherubim, one wheel beside each cherub; and the wheels appeared to shine like beryl stone.",
      "links": "<a href='/AIV/26/1/16'>Ezek. 1:16</a>",
      "comment": "The vision repeats the wonder of the chariot from chapter 1, symbolizing God's all-seeing, ever-moving presence. Beryl’s radiance amplifies the beauty and purity of this heavenly vehicle. The multiplied wheels represent the expansiveness of God’s rule."
    },
    {
      "pk": 33010010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 10,
      "text": "As for their appearance, all four had the same form, as if one wheel were within another.",
      "links": "<a href='/AIV/26/1/16'>Ezek. 1:16</a>",
      "comment": "This intricate structure emphasizes unity in diversity, reflecting how God’s actions, though complex, work in perfect harmony. The interlocking wheels indicate divine freedom—moving without hindrance in any direction. This foreshadows the mysterious unity-in-plurality of the Godhead."
    },
    {
      "pk": 33010011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 11,
      "text": "Whenever they moved, they went in the direction one faced, without turning as they went; for they went wherever the head faced, not turning as they moved.",
      "links": "<a href='/AIV/26/1/17'>Ezek. 1:17</a>",
      "comment": "The wheels’ movement, guided by the heads of the cherubim, conveys purposefulness in God’s action. God’s plans are direct and unwavering, echoing Scripture’s teaching that His will cannot be thwarted (Job 42:2)."
    },
    {
      "pk": 33010012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 12,
      "text": "And their whole body, their backs, their hands, their wings, and the wheels were full of eyes all around, even the wheels that each of the four cherubim had.",
      "links": "<a href='/AIV/26/1/18'>Ezek. 1:18</a>; <a href='/AIV/66/4/8'>Rev. 4:8</a>",
      "comment": "The multitude of eyes signifies God’s omniscience; nothing escapes His gaze. This all-seeing aspect is picked up in Revelation to describe the vision of heaven, stressing the continuity of revelation and the fullness of divine knowledge."
    },
    {
      "pk": 33010013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 13,
      "text": "As for the wheels, they were called in my hearing, 'the whirling wheels.'",
      "links": "<a href='/AIV/26/1/16'>Ezek. 1:16</a>",
      "comment": "The term stresses their dynamism and the mysterious movement of God's providence. God’s actions are swift and purposeful, a theme revisited in biblical literature."
    },
    {
      "pk": 33010014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 14,
      "text": "Each one had four faces: the first was the face of a cherub, the second the face of a man, the third the face of a lion, and the fourth the face of an eagle.",
      "links": "<a href='/AIV/26/1/10'>Ezek. 1:10</a>; <a href='/AIV/66/4/7'>Rev. 4:7</a>",
      "comment": "The faces symbolize various aspects of creation—strength (lion), wisdom (man), swiftness (eagle), and angelic or priestly mediation (cherub). The cherub here replaces the ox from chapter 1, perhaps signifying even greater emphasis on the heavenly role of the cherubim."
    },
    {
      "pk": 33010015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 15,
      "text": "And the cherubim rose upward—these were the living creatures that I had seen by the Kebar canal.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/26/1/22'>Ezek. 1:22</a>",
      "comment": "Ezekiel confirms the identity of the heavenly beings. The connection to chapter 1 underlines the unity of his vision, further legitimizing the message as truly from God."
    },
    {
      "pk": 33010016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 16,
      "text": "And when the cherubim moved, the wheels moved beside them; and when the cherubim lifted their wings to rise from the ground, the wheels did not turn from beside them.",
      "links": "<a href='/AIV/26/1/19'>Ezek. 1:19</a>",
      "comment": "The perfect synchronicity demonstrates the harmony in God’s creation. All things, seen and unseen, move perfectly according to His sovereign will. Worship and angelic service are likewise modeled as harmonious and obedient."
    },
    {
      "pk": 33010017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 17,
      "text": "When they stood still, these stood still; and when they rose, these rose with them, for the spirit of the living creatures was in them.",
      "links": "<a href='/AIV/26/1/20-21'>Ezek. 1:20-21</a>",
      "comment": "God’s Spirit animates and directs all aspects of the vision. This indicates spiritual realities are far more profound and unified than can be observed merely with human sight."
    },
    {
      "pk": 33010018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 18,
      "text": "Then the glory of the LORD departed from the threshold of the temple and stood over the cherubim.",
      "links": "<a href='/AIV/26/9/3'>Ezek. 9:3</a>; <a href='/AIV/26/11/23'>Ezek. 11:23</a>",
      "comment": "This is a pivotal moment: God’s glory leaves the temple, a first step towards the judgment that will soon befall Jerusalem. Theologically, God’s real presence, lost through persistent rebellion, prepares the way for later prophecy that His glory will return in an even fuller form (cf. Ezek. 43:4; Jn. 1:14—God dwelling among men in Christ)."
    },
    {
      "pk": 33010019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 19,
      "text": "The cherubim lifted their wings and rose up from the earth before my eyes as they went out, and the wheels beside them. And they stood at the entrance of the east gate of the LORD’s house, and the glory of the God of Israel hovered over them from above.",
      "links": "<a href='/AIV/26/11/1'>Ezek. 11:1</a>; <a href='/AIV/43/1/14'>Jn. 1:14</a>",
      "comment": "God’s glory leaves gradually, pausing at the east gate. The east gate later becomes significant as the place of the Messiah’s return (Ezek. 43:2). The forward movement always holds hope for restoration."
    },
    {
      "pk": 33010020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 20,
      "text": "These were the living creatures that I saw beneath the God of Israel by the Kebar canal, and I knew that they were cherubim.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/26/1/22'>Ezek. 1:22</a>",
      "comment": "Ezekiel reiterates the identity of the cherubim. The consistent testimony underlines the trustworthiness of prophetic revelation—God’s word is stable and verifiable."
    },
    {
      "pk": 33010021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 21,
      "text": "Each had four faces, and each had four wings, and under their wings were what appeared to be human hands.",
      "links": "<a href='/AIV/26/1/6-8'>Ezek. 1:6-8</a>",
      "comment": "Repetition of their form underlines the specificity and detail of God’s messages to His people. Human hands again suggest the role of cooperation in service—earthly and heavenly working together."
    },
    {
      "pk": 33010022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 10,
      "verse": 22,
      "text": "And as for the likeness of their faces, they were the same faces whose appearance I had seen by the Kebar canal. Each one went straight ahead.",
      "links": "<a href='/AIV/26/1/10'>Ezek. 1:10</a>",
      "comment": "The perfect alignment and fidelity to what was originally revealed reinforce that God’s presence and message do not change. This is mirrored in later teaching that God is unchanging (Mal. 3:6; Heb. 13:8). There is security and unity in trusting a Church and faith rooted deeply in divine revelation and continued guidance."
    }
  ],
  "translatedAt": "2025-12-24T09:03:03.420Z"
}