{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 20,
  "verses": [
    {
      "pk": 33020001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 1,
      "text": "In the seventh year, in the fifth month, on the tenth day of the month, some of the elders of Israel came to consult the LORD, and they sat down before me.",
      "links": "<a href='/AIV/26/8/1'>Ezek. 8:1</a>; <a href='/AIV/26/14/1'>Ezek. 14:1</a>",
      "comment": "This was about 591 BC. The elders regularly sought prophetic guidance from Ezekiel, similar to how the faithful seek wisdom through the spiritual leaders established by God."
    },
    {
      "pk": 33020002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 2,
      "text": "Then the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>; <a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "Ezekiel, as a prophet, receives direct revelation. God still communicates to His people through chosen vessels."
    },
    {
      "pk": 33020003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 3,
      "text": "Son of man, speak to the elders of Israel and say to them, ‘Thus says the Lord GOD: Have you come to consult me? As I live, I will not be consulted by you,’ declares the Lord GOD.",
      "links": "<a href='/AIV/26/14/3'>Ezek. 14:3</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "God refuses to answer due to Israel's persistent unfaithfulness. He values both the external and internal disposition when approaching Him."
    },
    {
      "pk": 33020004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 4,
      "text": "Will you judge them, son of man, will you judge them? Make them know the abominations of their fathers;",
      "links": "<a href='/AIV/26/16/2'>Ezek. 16:2</a>; <a href='/AIV/24/2/5'>Jer. 2:5</a>",
      "comment": "God charges Ezekiel to confront Israel with their history of sin, underscoring that collective memory and confession are vital for spiritual renewal."
    },
    {
      "pk": 33020005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 5,
      "text": "and say to them, ‘Thus says the Lord GOD: On the day when I chose Israel, I lifted up my hand to the offspring of the house of Jacob, and made myself known to them in the land of Egypt; I lifted up my hand to them, saying, ‘I am the LORD your God.’",
      "links": "<a href='/AIV/2/6/7'>Exod. 6:7</a>; <a href='/AIV/2/3/7'>Exod. 3:7</a>",
      "comment": "God's covenant formula ('I am the LORD your God') echoes His unique relationship with Israel, later fulfilled in the new covenant."
    },
    {
      "pk": 33020006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 6,
      "text": "On that day I lifted up my hand to them, to bring them out of the land of Egypt into a land that I had searched out for them, a land flowing with milk and honey, the glory of all lands.",
      "links": "<a href='/AIV/2/3/8'>Exod. 3:8</a>; <a href='/AIV/5/6/3'>Deut. 6:3</a>",
      "comment": "The promised land is described as exceptionally fertile and desirable—a type pointing toward God's ultimate promise to His people."
    },
    {
      "pk": 33020007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 7,
      "text": "Then I said to them, ‘Throw away every detestable thing your eyes feast upon, and do not defile yourselves with the idols of Egypt. I am the LORD your God.’",
      "links": "<a href='/AIV/3/18/30'>Lev. 18:30</a>; <a href='/AIV/6/24/14'>Josh. 24:14</a>",
      "comment": "The command to forsake idols anticipates themes of spiritual purification and repentance."
    },
    {
      "pk": 33020008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 8,
      "text": "But they rebelled against me and would not listen to me; they did not throw away the detestable things their eyes feasted on, nor did they reject the idols of Egypt. Then I resolved to pour out my wrath on them and exhaust my anger against them in the midst of the land of Egypt.",
      "links": "<a href='/AIV/2/6/9'>Exod. 6:9</a>; <a href='/AIV/4/14/11-12'>Num. 14:11–12</a>",
      "comment": "Israel's repeated disobedience shows stubbornness, but God's mercy intervenes."
    },
    {
      "pk": 33020009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 9,
      "text": "But for the sake of my name, that it should not be profaned in the sight of the nations among whom they lived and in whose sight I made myself known to them by bringing them out of the land of Egypt—I acted.",
      "links": "<a href='/AIV/2/32/12'>Exod. 32:12</a>; <a href='/AIV/4/14/13-16'>Num. 14:13-16</a>",
      "comment": "This illustrates God's concern for His holy name and reputation, a theme fulfilled in how God's salvific acts reflect His holiness."
    },
    {
      "pk": 33020010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 10,
      "text": "So I brought them out of the land of Egypt and led them into the wilderness.",
      "links": "<a href='/AIV/2/12/51'>Exod. 12:51</a>",
      "comment": "The Exodus typifies later forms of salvation—a historical act pointing forward to spiritual deliverance."
    },
    {
      "pk": 33020011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 11,
      "text": "I gave them my statutes and made known to them my judgments, which if a person does he shall live by them.",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>; <a href='/AIV/16/9/13'>Neh. 9:13</a>; <a href='/AIV/45/10/5'>Rom. 10:5</a>",
      "comment": "The 'live by them' phrase is cited by Paul (Rom. 10:5), showing how the Law points to the necessity of inner transformation."
    },
    {
      "pk": 33020012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 12,
      "text": "Moreover, I gave them my Sabbaths as a sign between me and them, so that they would know that I am the LORD who sets them apart as holy.",
      "links": "<a href='/AIV/2/31/13'>Exod. 31:13</a>; <a href='/AIV/26/20/20'>Ezek. 20:20</a>",
      "comment": "Sabbath was a sign of sanctification, a concept later developed as the Lord's Day in Christian tradition as a mark of belonging to God."
    },
    {
      "pk": 33020013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 13,
      "text": "But the house of Israel rebelled against me in the wilderness. They did not walk in my statutes, and they rejected my judgments—which if a person does, he shall live by them—and they greatly profaned my Sabbaths. Then I resolved to pour out my wrath upon them in the wilderness, to consume them.",
      "links": "<a href='/AIV/4/14/35'>Num. 14:35</a>; <a href='/AIV/2/16/28'>Exod. 16:28</a>",
      "comment": "Israel's history of ignoring God's commands previews the need for a new heart prophesied later in Ezekiel (Ezek. 36:26)."
    },
    {
      "pk": 33020014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 14,
      "text": "But I acted for the sake of my name, that it should not be profaned in the sight of the nations, before whose eyes I had brought them out.",
      "links": "<a href='/AIV/2/32/12'>Exod. 32:12</a>; <a href='/AIV/26/36/20-23'>Ezek. 36:20-23</a>",
      "comment": "God's actions frequently have a universal scope: God's patience with Israel points to His desire for all nations to recognize His holiness."
    },
    {
      "pk": 33020015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 15,
      "text": "Also, I lifted up my hand to them in the wilderness that I would not bring them into the land I had given them, a land flowing with milk and honey, the glory of all lands,",
      "links": "<a href='/AIV/4/14/28-30'>Num. 14:28-30</a>; <a href='/AIV/5/1/35'>Deut. 1:35</a>",
      "comment": "God swears an oath (lifting the hand) not to let the disobedient generation enter the promised land—echoed later in warnings against apostasy (Heb. 3:11, Hebrews 3:16–19)."
    },
    {
      "pk": 33020016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 16,
      "text": "because they rejected my judgments, did not walk in my statutes, and profaned my Sabbaths, for their hearts went after their idols.",
      "links": "<a href='/AIV/19/78/10'>Ps. 78:10</a>; <a href='/AIV/19/106/36'>Ps. 106:36</a>",
      "comment": "The external breaking of God's law is rooted in internal idolatry, reinforcing the importance of both right practice and inner faith."
    },
    {
      "pk": 33020017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 17,
      "text": "Yet my eye spared them from destruction. I did not make an end of them in the wilderness.",
      "links": "<a href='/AIV/3/26/44'>Lev. 26:44</a>; <a href='/AIV/19/106/45'>Ps. 106:45</a>",
      "comment": "God's enduring mercy, despite judgment, shows both justice and a merciful, covenantal love that anticipates the ultimate act of mercy in Christ."
    },
    {
      "pk": 33020018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 18,
      "text": "Instead, I said to their children in the wilderness: 'Do not walk in the ways of your fathers or keep their laws or defile yourselves with their idols.'",
      "links": "<a href='/AIV/5/18/9'>Deut. 18:9</a>; <a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "The new generation is told to break from the sins of their ancestors, highlighting the possibility of renewal for each generation."
    },
    {
      "pk": 33020019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 19,
      "text": "'I am the LORD your God; walk in my statutes, keep my judgments, and do them.",
      "links": "<a href='/AIV/3/18/4'>Lev. 18:4</a>; <a href='/AIV/5/5/33'>Deut. 5:33</a>",
      "comment": "Call to obedience reiterates that holiness involves doing God's will—parallel to Christ’s later call to discipleship (<a href='/AIV/40/7/21'>Matt. 7:21</a>)."
    },
    {
      "pk": 33020020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 20,
      "text": "Keep my Sabbaths holy, and they will be a sign between me and you, so you may know that I am the LORD your God.'",
      "links": "<a href='/AIV/2/31/13'>Exod. 31:13</a>; <a href='/AIV/26/20/12'>Ezek. 20:12</a>",
      "comment": "Sabbath observance is a sign of a sanctified people. Early Christians adapted the significance of holy days as expressions of worship in spirit and truth."
    },
    {
      "pk": 33020021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 21,
      "text": "But the children rebelled against me. They did not walk in my statutes, nor kept my judgments to do them—which if a person does, he shall live by them—and they profaned my Sabbaths. Then I resolved to pour out my wrath upon them and spend my anger on them in the wilderness.",
      "links": "<a href='/AIV/4/25/1-10'>Num. 25:1-10</a>",
      "comment": "Even the next generation fell into disobedience, showing humanity's persistent need for divine grace and restoration."
    },
    {
      "pk": 33020022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 22,
      "text": "But I withdrew my hand and acted for the sake of my name, so it would not be profaned in the sight of the nations, in whose sight I brought them out.",
      "links": "<a href='/AIV/26/36/22'>Ezek. 36:22</a>",
      "comment": "God's mercy is for His glory and the eventual salvation of all. Mercy is thus both particular and for the sake of a universal witness."
    },
    {
      "pk": 33020023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 23,
      "text": "Moreover, I raised my hand to them in the wilderness that I would scatter them among the nations and disperse them through the countries,",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>; <a href='/AIV/5/28/64'>Deut. 28:64</a>",
      "comment": "The threat of dispersion for unfaithfulness anticipates the exile—a consequence for breaking covenant."
    },
    {
      "pk": 33020024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 24,
      "text": "because they had not carried out my judgments, but had rejected my statutes, profaned my Sabbaths, and their eyes were set on their fathers’ idols.",
      "links": "<a href='/AIV/26/20/16'>Ezek. 20:16</a>",
      "comment": "Emphasizes a cycle of disobedience rooted in misplaced affections, echoing the biblical call to pass on the faith without syncretism."
    },
    {
      "pk": 33020025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 25,
      "text": "So I also gave them statutes that were not good and judgments by which they could not live;",
      "links": "<a href='/AIV/19/81/12'>Ps. 81:12</a>; <a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "Here, God 'gave' up Israel to their own desires (see Romans 1:24), allowing the consequences of their rebellion to play out. This highlights the difference between God's perfect will and what He permissively allows due to hard hearts."
    },
    {
      "pk": 33020026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 26,
      "text": "I let them become defiled through their gifts, in that they caused all their firstborn to pass through the fire, so that I might horrify them, that they might know that I am the LORD.’",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>; <a href='/AIV/19/106/37-38'>Ps. 106:37-38</a>",
      "comment": "God permits Israel to reap the fruit of idol-worship (including child sacrifice), demonstrating that false worship leads to destruction and spiritual blindness."
    },
    {
      "pk": 33020027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 27,
      "text": "Therefore, son of man, speak to the house of Israel and say to them, ‘Thus says the Lord GOD: Even in this, your fathers blasphemed me by committing treachery against me.",
      "links": "<a href='/AIV/19/78/57'>Ps. 78:57</a>",
      "comment": "Israel’s history is characterized by repeated betrayal, yet God continues to call them to repentance."
    },
    {
      "pk": 33020028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 28,
      "text": "For when I brought them into the land that I had sworn to give them, and they saw every high hill and every leafy tree, there they offered their sacrifices and presented the provocation of their offerings; there they made their soothing aromas and poured out their drink offerings.",
      "links": "<a href='/AIV/11/14/23'>1 Kings 14:23</a>; <a href='/AIV/24/2/20'>Jer. 2:20</a>",
      "comment": "Pagan worship ‘under every green tree’ showed syncretism with local religions, a danger for the unfaithful in every age."
    },
    {
      "pk": 33020029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 29,
      "text": "I said to them, ‘What is this high place to which you go?’ And its name is called Bamah to this day.",
      "links": "<a href='/AIV/11/13/32'>1 Kings 13:32</a>",
      "comment": "\"Bamah\" means 'high place', a location of illicit worship. God calls out false devotion masquerading as true worship."
    },
    {
      "pk": 33020030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 30,
      "text": "Therefore say to the house of Israel, ‘Thus says the Lord GOD: Will you defile yourselves in the manner of your fathers, and prostitute yourselves after their abominations?’",
      "links": "<a href='/AIV/26/6/9'>Ezek. 6:9</a>",
      "comment": "Spiritual ‘prostitution’ refers to idolatry—turning from God to false gods."
    },
    {
      "pk": 33020031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 31,
      "text": "For when you offer your gifts, when you cause your sons to pass through the fire, you defile yourselves with all your idols to this day. Should I be consulted by you, O house of Israel? As I live, declares the Lord GOD, I will not be consulted by you.",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>; <a href='/AIV/26/8/18'>Ezek. 8:18</a>",
      "comment": "Idolatry blocks true relationship and prayer—only sincere repentance restores communion with God."
    },
    {
      "pk": 33020032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 32,
      "text": "What is in your mind shall never happen—the thought, ‘We will be like the nations, like the families of the earth, serving wood and stone.’",
      "links": "<a href='/AIV/3/20/23'>Lev. 20:23</a>; <a href='/AIV/2/23/2'>Exod. 23:2</a>",
      "comment": "God’s people cannot blend in with the world without judgment; He preserves their distinctiveness."
    },
    {
      "pk": 33020033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 33,
      "text": "As I live, declares the Lord GOD, surely with a mighty hand and an outstretched arm and with wrath poured out I will be king over you.",
      "links": "<a href='/AIV/2/6/6'>Exod. 6:6</a>; <a href='/AIV/19/89/13'>Ps. 89:13</a>",
      "comment": "God will forcibly reassert His kingship over His people, a foretaste of His ultimate reign in salvation history."
    },
    {
      "pk": 33020034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 34,
      "text": "I will bring you out from the peoples and gather you out of the countries where you are scattered, with a mighty hand and with an outstretched arm, and with wrath poured out.",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>; <a href='/AIV/5/30/3-4'>Deut. 30:3-4</a>",
      "comment": "God's gathering His scattered people is both physical and spiritual, foreshadowing the worldwide ingathering of believers in Christ (<a href='/AIV/43/11/52'>John 11:52</a>)."
    },
    {
      "pk": 33020035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 35,
      "text": "And I will bring you into the wilderness of the peoples, and there I will enter into judgment with you face to face.",
      "links": "<a href='/AIV/28/2/14'>Hos. 2:14</a>; <a href='/AIV/26/20/36'>Ezek. 20:36</a>",
      "comment": "The wilderness is a place of discipline and encounter—a theme deepened by Christ's own wilderness fasting."
    },
    {
      "pk": 33020036,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 36,
      "text": "Just as I entered into judgment with your fathers in the wilderness of the land of Egypt, so I will enter into judgment with you, declares the Lord GOD.",
      "links": "<a href='/AIV/4/14/20-23'>Num. 14:20-23</a>",
      "comment": "Judgment is a necessary part of God's covenant love, purifying and restoring His people."
    },
    {
      "pk": 33020037,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 37,
      "text": "I will make you pass under the rod, and I will bring you into the bond of the covenant.",
      "links": "<a href='/AIV/3/27/32'>Lev. 27:32</a>; <a href='/AIV/24/33/20'>Jer. 33:20</a>",
      "comment": "\"Pass under the rod\" refers to counting and claiming as one's own, a shepherd’s act, symbolizing God’s renewed claim on Israel. The ‘bond of the covenant’ portends reconciliation through a divinely appointed mediator."
    },
    {
      "pk": 33020038,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 38,
      "text": "I will purge out from among you the rebels and those who transgress against me; I will bring them out of the land where they are sojourners, but they shall not enter the land of Israel. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/40/13/41-43'>Matt. 13:41-43</a>; <a href='/AIV/19/101/8'>Ps. 101:8</a>",
      "comment": "Separation of the faithful from the unfaithful foreshadows the final judgment (see <a href='/AIV/40/25/31-46'>Matt. 25:31-46</a>)."
    },
    {
      "pk": 33020039,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 39,
      "text": "As for you, O house of Israel, thus says the Lord GOD: Go, serve each of you his idols, now and later, if you will not listen to me. But do not profane my holy name any longer with your gifts and your idols.",
      "links": "<a href='/AIV/6/24/15'>Josh. 24:15</a>",
      "comment": "God gives the rebellious over to their desires, but maintains the sacredness of His name—His worship will be pure."
    },
    {
      "pk": 33020040,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 40,
      "text": "For on my holy mountain, on the mountain height of Israel, declares the Lord GOD, there all the house of Israel, all of them, shall serve me in the land. There I will accept them, and there I will seek your contributions and the best of your gifts, with all your holy offerings.",
      "links": "<a href='/AIV/23/2/2'>Isa. 2:2</a>; <a href='/AIV/26/17/23'>Ezek. 17:23</a>",
      "comment": "The vision of all Israel worshipping on God’s mountain points ahead to a universal, unified worship—fulfilled in Christ’s people gathered from every nation."
    },
    {
      "pk": 33020041,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 41,
      "text": "As a pleasing aroma I will accept you, when I bring you out from the peoples and gather you from the lands where you have been scattered. And through you I will manifest my holiness in the sight of the nations.",
      "links": "<a href='/AIV/1/8/21'>Gen. 8:21</a>; <a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "Offerings as a ‘pleasing aroma’ are fulfilled in Christ’s self-offering, and in the spiritual sacrifices of the new covenant community (<a href='/AIV/60/2/5'>1 Pet. 2:5</a>; <a href='/AIV/50/4/18'>Phil. 4:18</a>)."
    },
    {
      "pk": 33020042,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 42,
      "text": "And you will know that I am the LORD, when I bring you into the land of Israel, into the land that I swore to give to your fathers.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/2/6/8'>Exod. 6:8</a>",
      "comment": "The promise of restoration fulfills the covenant made with the patriarchs, prefiguring the greater restoration in Christ."
    },
    {
      "pk": 33020043,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 43,
      "text": "And there you will remember your ways and all your deeds by which you have defiled yourselves, and you will loathe yourselves for all the evils you have committed.",
      "links": "<a href='/AIV/26/6/9'>Ezek. 6:9</a>; <a href='/AIV/36/3/11'>Zeph. 3:11</a>",
      "comment": "Genuine repentance is marked by self-awareness and contrition, essential steps to true restoration."
    },
    {
      "pk": 33020044,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 44,
      "text": "You will know that I am the LORD, when I deal with you for the sake of my name, not according to your evil ways or corrupt deeds, O house of Israel, declares the Lord GOD.",
      "links": "<a href='/AIV/19/106/8'>Ps. 106:8</a>; <a href='/AIV/26/36/22-32'>Ezek. 36:22-32</a>",
      "comment": "God’s grace is not earned but granted for the sake of His name—a foundation of redemption in Scripture."
    },
    {
      "pk": 33020045,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 45,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/14/2'>Ezek. 14:2</a>",
      "comment": "This marks the start of a new oracle, keeping the prophetic narrative orderly."
    },
    {
      "pk": 33020046,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 46,
      "text": "Son of man, set your face toward the south, and speak out against the southern region, prophesy against the forest land of the Negev.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>",
      "comment": "The 'Negev' refers to southern Judah. The coming judgment extends to what remains of Israel’s land."
    },
    {
      "pk": 33020047,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 47,
      "text": "Say to the forest of the Negev, ‘Hear the word of the LORD! Thus says the Lord GOD: Behold, I am kindling a fire in you, and it will devour every green tree and every dry tree in you; the blazing flame shall not be quenched, and all faces from south to north shall be scorched by it.",
      "links": "<a href='/AIV/23/9/18-19'>Isa. 9:18-19</a>; <a href='/AIV/26/21/3-4'>Ezek. 21:3-4</a>",
      "comment": "This imagery of consuming fire anticipates judgment falling without discrimination—echoing later warnings about the judgment on all humanity."
    },
    {
      "pk": 33020048,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 48,
      "text": "All flesh shall see that I, the LORD, have kindled it. It will not be quenched.”",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>; <a href='/AIV/41/9/43'>Mark 9:43</a>",
      "comment": "Universal recognition of God’s judgment paves the way for later themes of final judgment and universal accountability."
    },
    {
      "pk": 33020049,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 20,
      "verse": 49,
      "text": "Then I said, ‘Ah, Lord GOD! They are saying of me, ‘Is he not just telling parables?’”",
      "links": "<a href='/AIV/26/17/2'>Ezek. 17:2</a>; <a href='/AIV/40/13/13'>Matt. 13:13'</a>",
      "comment": "Ezekiel’s audience perceives the prophecy as enigmatic. Jesus too spoke in parables, which required spiritual ears to hear (<a href='/AIV/40/13/13'>Matt. 13:13</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:09:06.589Z"
}