{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 34,
  "verses": [
    {
      "pk": 33034001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 1,
      "text": "The word of the LORD came to me:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>; <a href='/AIV/26/33/23'>Ezek. 33:23</a>",
      "comment": "This opening formula is typical of prophetic literature, marking a direct revelation. It reminds us that God continues to speak through chosen instruments, a concept seen through both Old and New Testament witness."
    },
    {
      "pk": 33034002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 2,
      "text": "“Son of man, prophesy against the shepherds of Israel; prophesy and say to them, ‘Thus says the Lord GOD: Woe to the shepherds of Israel who have been feeding themselves! Should not shepherds feed the flock?’”",
      "links": "<a href='/AIV/23/56/11'>Isa. 56:11</a>; <a href='/AIV/24/23/1-2'>Jer. 23:1-2</a>",
      "comment": "The 'shepherds' are Israel's leaders—kings and priests—entrusted with spiritual care. Their failure points toward the need for a faithful shepherd, a theme fulfilled in the Messiah (see <a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 33034003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 3,
      "text": "You eat the fat and clothe yourselves with the wool, you slaughter the fat sheep, but you do not feed the flock.",
      "links": "<a href='/AIV/24/13/17'>Jer. 13:17</a>; <a href='/AIV/24/22/13-17'>Jer. 22:13-17</a>",
      "comment": "Leaders are meant to serve, not exploit. The spiritual application looks to Christ as the Good Shepherd, who lays down his life for his sheep (<a href='/AIV/43/10/15'>John 10:15</a>)."
    },
    {
      "pk": 33034004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 4,
      "text": "You have not strengthened the weak, nor healed the sick, nor bound up the injured, nor brought back the strayed, nor sought the lost; but with force and harshness you have ruled over them.",
      "links": "<a href='/AIV/40/18/12'>Matt. 18:12</a>; <a href='/AIV/42/15/4'>Luke 15:4</a>",
      "comment": "This verse connects to Jesus’ ministry of compassion and restoration for the lost and weak, fulfilling the promise of tender leadership. The spiritual aspect foreshadows God’s healing work through sacraments and pastoral care."
    },
    {
      "pk": 33034005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 5,
      "text": "So they were scattered, because there was no shepherd, and they became food for all the beasts of the field when they were scattered.",
      "links": "<a href='/AIV/24/50/6'>Jer. 50:6</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "Spiritual neglect leads to vulnerability to evil—'beasts' symbolize threats and enemies. Jesus spoke of people as 'sheep without a shepherd,' linking this prophecy to his ministry (<a href='/AIV/40/9/36'>Matt. 9:36</a>)."
    },
    {
      "pk": 33034006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 6,
      "text": "My sheep wandered over all the mountains and on every high hill. They were scattered over the whole earth, and no one searched or sought after them.",
      "links": "<a href='/AIV/42/15/4-7'>Luke 15:4-7</a>",
      "comment": "The global scattering points to the diaspora and a future regathering. Spiritually, it highlights the Church's mission to gather the lost from every nation."
    },
    {
      "pk": 33034007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 7,
      "text": "Therefore, you shepherds, hear the word of the LORD:",
      "links": "",
      "comment": "God now directly addresses the leaders again, emphasizing accountability before Him."
    },
    {
      "pk": 33034008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 8,
      "text": "As I live, declares the Lord GOD, because my sheep have become prey and my sheep have become food for all the beasts of the field, since there was no shepherd, and my shepherds did not seek my sheep, but the shepherds fed themselves and did not feed my sheep;",
      "links": "<a href='/AIV/24/13/17'>Jer. 13:17</a>",
      "comment": "A solemn oath; leadership’s failure condemned. The repetition reinforces the gravity of spiritual neglect and self-interest among those given authority."
    },
    {
      "pk": 33034009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 9,
      "text": "therefore, you shepherds, hear the word of the LORD:",
      "links": "",
      "comment": "Repetition for emphasis is common in Hebrew rhetoric, showing the seriousness of God’s charge."
    },
    {
      "pk": 33034010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 10,
      "text": "Thus says the Lord GOD: Behold, I am against the shepherds, and I will require my sheep at their hand and remove them from feeding the sheep, so that the shepherds will no longer feed themselves. I will deliver my sheep from their mouths, so that they may not be food for them.",
      "links": "<a href='/AIV/24/23/2'>Jer. 23:2</a>",
      "comment": "God’s direct intervention against unfaithful leadership prefigures Christ establishing a new, holy leadership devoted to serving, not exploiting."
    },
    {
      "pk": 33034011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 11,
      "text": "For thus says the Lord GOD: Behold, I myself will search for my sheep and seek them out.",
      "links": "<a href='/AIV/42/19/10'>Luke 19:10</a>; <a href='/AIV/40/18/12'>Matt. 18:12</a>",
      "comment": "God Himself will shepherd His people. This is fulfilled in Christ's incarnation and mission to seek the lost. The personal care God promises here is a sign of His intimate involvement in salvation."
    },
    {
      "pk": 33034012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 12,
      "text": "As a shepherd seeks out his flock when he is among his scattered sheep, so I will seek out my sheep and deliver them from all the places where they were scattered on a day of clouds and darkness.",
      "links": "<a href='/AIV/19/23/1-4'>Ps. 23:1-4</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "The 'day of clouds and darkness' refers to judgment and exile. God’s personal action mirrors the spiritual gathering Christ accomplishes in his ministry and through the one true Church."
    },
    {
      "pk": 33034013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 13,
      "text": "I will bring them out from among the peoples and gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, by the rivers, and in all the inhabited places of the land.",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>; <a href='/AIV/24/23/3'>Jer. 23:3</a>",
      "comment": "The return from exile is literal, but has a spiritual fulfillment in the gathering of all believers into the unity of Christ. The imagery of feeding points toward Eucharistic symbolism in the new covenant."
    },
    {
      "pk": 33034014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 14,
      "text": "I will feed them in a good pasture, and their grazing ground will be on the mountains of Israel. There they shall lie down in a good fold and feed in rich pasture on the mountains of Israel.",
      "links": "<a href='/AIV/19/23/2'>Ps. 23:2</a>",
      "comment": "This repeats the theme of spiritual nourishment and rest. The 'mountains' stand for the fullness of God’s blessings, preparing for the spiritual rest found in the Lord."
    },
    {
      "pk": 33034015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 15,
      "text": "I myself will shepherd my sheep and cause them to lie down, declares the Lord GOD.",
      "links": "<a href='/AIV/19/23/1-2'>Ps. 23:1-2</a>",
      "comment": "Direct divine care; God promises to be the true Shepherd. Jesus claims this role himself, making clear Christological fulfillment (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 33034016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 16,
      "text": "I will seek the lost, bring back the strayed, bind up the injured, and strengthen the weak; but the fat and the strong I will destroy. I will feed them with justice.",
      "links": "<a href='/AIV/42/15/4-7'>Luke 15:4-7</a>; <a href='/AIV/26/34/4'>Ezek. 34:4</a>",
      "comment": "God’s compassion for the humble and broken stands in contrast to the proud oppressors. God’s justice is restorative and corrective—fulfilled both in Christ’s actions and in the Church’s sacramental ministry."
    },
    {
      "pk": 33034017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 17,
      "text": "As for you, my flock, thus says the Lord GOD: Behold, I judge between one sheep and another, between the rams and the goats.",
      "links": "<a href='/AIV/40/25/32'>Matt. 25:32</a>",
      "comment": "God judges not only leaders but individuals within his flock. Jesus echoes this in his teaching about the Final Judgment (<a href='/AIV/40/25/32'>Matt. 25:32</a>)."
    },
    {
      "pk": 33034018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 18,
      "text": "Is it too little for you to feed on the good pasture, that you must tread down with your feet the rest of your pasture? And to drink of clear water, but muddy the rest with your feet?",
      "links": "",
      "comment": "Unjust sheep ruin the blessings for others. There is a moral and communal obligation to safeguard the spiritual welfare of all. This concept aligns closely with the Church’s teaching on charity and solidarity."
    },
    {
      "pk": 33034019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 19,
      "text": "And must my sheep eat what you have trampled with your feet and drink what you have muddied with your feet?",
      "links": "",
      "comment": "Accountability extends to the laity, not just leaders—everyone is called to holiness for the sake of others. This spiritual responsibility is a recurring theme in both Testaments."
    },
    {
      "pk": 33034020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 20,
      "text": "Therefore thus says the Lord GOD to them: Behold, I, yes I, will judge between the fat sheep and the lean sheep.",
      "links": "<a href='/AIV/40/25/32'>Matt. 25:32</a>",
      "comment": "Divine judgment upon the unjust—mirroring Christ’s separation of sheep and goats in eschatological teaching."
    },
    {
      "pk": 33034021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 21,
      "text": "Because you push with side and shoulder, and thrust all the weak with your horns, until you have scattered them abroad,",
      "links": "",
      "comment": "The strong oppress the weak—warning against pride and abuse of power. The connection to humility and care for the poor is consistent with the gospel imperative."
    },
    {
      "pk": 33034022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 22,
      "text": "I will rescue my flock; they will no longer be a prey. I will judge between one sheep and another.",
      "links": "",
      "comment": "God’s intervention brings protection. The image of judgment within the flock foreshadows the individual accountability and mercy found in the teachings of Christ and his Church."
    },
    {
      "pk": 33034023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 23,
      "text": "I will set up over them one shepherd, my servant David, and he shall feed them; he shall feed them and be their shepherd.",
      "links": "<a href='/AIV/26/37/24'>Ezek. 37:24</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The promise of a divinely-appointed shepherd is messianic. ‘David’ refers to the future Christ, Son of David, who is the eternal Shepherd—fulfillment in Jesus (<a href='/AIV/43/10/11'>John 10:11</a>). The unity under one shepherd looks forward to the visible, apostolic leadership established by Christ."
    },
    {
      "pk": 33034024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 24,
      "text": "And I, the LORD, will be their God, and my servant David will be prince among them. I, the LORD, have spoken.",
      "links": "<a href='/AIV/10/7/8-16'>2 Sam. 7:8-16</a>; <a href='/AIV/26/37/24'>Ezek. 37:24</a>",
      "comment": "God’s reign is united with the Davidic shepherd. This foreshadows Christ’s dual nature—both divine and human leader—manifest in the visible and spiritual governance of the people of God."
    },
    {
      "pk": 33034025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 25,
      "text": "I will make a covenant of peace with them and remove wild beasts from the land, so that they may dwell securely in the wilderness and sleep in the forests.",
      "links": "<a href='/AIV/26/16/60'>Ezek. 16:60</a>; <a href='/AIV/26/37/26'>Ezek. 37:26</a>",
      "comment": "This new covenant of peace prefigures Christ’s covenant. Complete safety and rest characterize God’s kingdom, rooted in sacramental grace and unity."
    },
    {
      "pk": 33034026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 26,
      "text": "I will make them and the places all around my hill a blessing; I will send down showers in their season—showers of blessing.",
      "links": "<a href='/AIV/26/36/8-11'>Ezek. 36:8-11</a>",
      "comment": "Blessings flow from God’s holy hill—Zion, the place of worship. This symbolically refers to the source of grace and blessing through worship and sacrament."
    },
    {
      "pk": 33034027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 27,
      "text": "The trees of the field shall yield their fruit, and the land yield its increase, and they shall dwell securely in their land. They shall know that I am the LORD, when I break the bars of their yoke and rescue them from the hand of those who enslaved them.",
      "links": "<a href='/AIV/26/28/25'>Ezek. 28:25</a>; <a href='/AIV/03/26/4'>Lev. 26:4</a>",
      "comment": "Physical fertility and spiritual freedom are closely linked. The breaking of the yoke refers both to liberation from oppression and freedom from sin through Christ."
    },
    {
      "pk": 33034028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 28,
      "text": "They shall no longer be a prey to the nations, nor shall wild beasts devour them. They shall dwell securely, and none shall make them afraid.",
      "links": "<a href='/AIV/24/30/10'>Jer. 30:10</a>",
      "comment": "Protection from external threats is guaranteed by God. True spiritual security and fearless living are gifts for all gathered into God's flock."
    },
    {
      "pk": 33034029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 29,
      "text": "I will raise up for them a plantation of renown, and they shall no longer be consumed with hunger in the land or bear the shame of the nations.",
      "links": "<a href='/AIV/26/36/30'>Ezek. 36:30</a>",
      "comment": "Rich provision and the removal of shame connote God’s abundant grace. ‘Plantation of renown’ connects to the messianic blessings brought by Christ, ultimately satisfied in the full communion of his people."
    },
    {
      "pk": 33034030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 30,
      "text": "Then they shall know that I, the LORD their God, am with them, and that they, the house of Israel, are my people, declares the Lord GOD.",
      "links": "<a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/03/26/12'>Lev. 26:12</a>",
      "comment": "God’s presence with His people is the ultimate promise, fulfilled in Christ’s incarnation and abiding through the Holy Spirit and visible Church."
    },
    {
      "pk": 33034031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 34,
      "verse": 31,
      "text": "You are my sheep, the sheep of my pasture, and I am your God, declares the Lord GOD.",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "The identity of God’s people as His flock finds its completion in union with Him. The image anticipates Christ’s declaration of being the Good Shepherd and highlights the necessity of abiding in the visible, apostolic communion He established."
    }
  ],
  "translatedAt": "2025-12-24T09:17:29.310Z"
}