{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 40,
  "verses": [
    {
      "pk": 33040001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 1,
      "text": "In the twenty-fifth year of our exile, at the beginning of the year, on the tenth day of the month, in the fourteenth year after the city was struck down, on that very day the hand of the LORD was upon me, and he brought me there.",
      "links": "<a href='/AIV/26/1/1-3'>Ezek. 1:1-3</a>; <a href='/AIV/24/52/12-14'>Jer. 52:12-14</a>",
      "comment": "This time reference highlights God's faithfulness to His promises even after punishment (cf. Lev. 25:9; Jer. 52:12–14), and sets the stage for vision of restoration."
    },
    {
      "pk": 33040002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 2,
      "text": "In visions of God he brought me to the land of Israel, and set me down on a very high mountain, on which was a structure like a city to the south.",
      "links": "<a href='/AIV/23/2/2'>Isa. 2:2</a>; <a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "The high mountain evokes images of God’s dwelling and His presence (cf. Isa. 2:2; Ezek. 8:3). The city structure foreshadows restoration and a coming sanctuary."
    },
    {
      "pk": 33040003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 3,
      "text": "When he brought me there, behold, there was a man whose appearance was like bronze, with a linen cord and a measuring rod in his hand. He was standing in the gateway.",
      "links": "<a href='/AIV/66/21/15'>Rev. 21:15</a>; <a href='/AIV/26/9/2'>Ezek. 9:2</a>",
      "comment": "The man with a measuring rod represents a heavenly messenger, often linked with God's authority and order (cf. Zech. 2:1-2; Rev. 21:15)."
    },
    {
      "pk": 33040004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 4,
      "text": "The man said to me, 'Son of man, look with your eyes, hear with your ears, and set your heart upon all that I show you, for you were brought here in order that I might show it to you. Declare all that you see to the house of Israel.'",
      "links": "<a href='/AIV/26/2/1'>Ezek. 2:1</a>; <a href='/AIV/26/44/5'>Ezek. 44:5</a>",
      "comment": "Ezekiel is commissioned to faithfully pass on God's revelation, emphasizing careful attention to God's instructions."
    },
    {
      "pk": 33040005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 5,
      "text": "And behold, there was a wall all around the outside of the temple area, and in the man’s hand was a measuring rod six long cubits, each being a cubit and a handbreadth. So he measured the thickness of the wall, one rod; and the height, one rod.",
      "links": "<a href='/AIV/11/6/16'>1 Kings 6:16</a>; <a href='/AIV/26/42/16'>Ezek. 42:16-20</a>",
      "comment": "The use of a precise measuring rod underscores God's meticulous order and separation of the holy, which points to God’s holiness and the need for proper boundaries in worship."
    },
    {
      "pk": 33040006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 6,
      "text": "Then he went to the east gate, going up its steps, and measured the threshold of the gate, one rod wide.",
      "links": "<a href='/AIV/26/43/1-2'>Ezek. 43:1-2</a>",
      "comment": "The east gate will later be connected to the glory of the Lord returning (Ezek. 43:1-2), illustrating the hope of restored divine presence among God's people."
    },
    {
      "pk": 33040007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 7,
      "text": "And each guardroom was one rod long and one rod wide, and there were five cubits between the guardrooms. The threshold of the gate by the vestibule of the gate at the inner end was one rod.",
      "links": "<a href='/AIV/11/6/8'>1 Kings 6:8</a>",
      "comment": "The guardrooms symbolize order and protection. Details emphasize security and the sacredness of God's house."
    },
    {
      "pk": 33040008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 8,
      "text": "Then he measured the vestibule of the gate, one rod.",
      "links": "",
      "comment": "Further details of the vestibule support the structured design of God’s dwelling—a pattern with connections to earlier temple descriptions."
    },
    {
      "pk": 33040009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 9,
      "text": "He measured the vestibule of the gate, eight cubits, and its jambs, two cubits, and the vestibule of the gate was at the inner end.",
      "links": "<a href='/AIV/11/6/3'>1 Kings 6:3</a>",
      "comment": "The vestibule’s dimensions echo features of Solomon’s temple (cf. 1 Kings 6:3), rooting Ezekiel’s vision in Israel’s worship tradition."
    },
    {
      "pk": 33040010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 10,
      "text": "And there were three guardrooms on either side of the east gate; the three were of the same size, and the jambs on either side were of the same size.",
      "links": "",
      "comment": "The symmetry and uniformity in the design point to harmony and unity in the worship place. Early Church Fathers often saw order in worship as a reflection of God's nature."
    },
    {
      "pk": 33040011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 11,
      "text": "Then he measured the width of the gateway, ten cubits, and the length of the gate, thirteen cubits.",
      "links": "",
      "comment": "Detailed measurements continue to convey the sense of sacred architecture, revealing God’s intentionality."
    },
    {
      "pk": 33040012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 12,
      "text": "There was a barrier of one cubit before the guardrooms on either side. The guardrooms were six cubits on either side.",
      "links": "",
      "comment": "The barriers reinforce the separation of spaces for holiness and purity in worship practices."
    },
    {
      "pk": 33040013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 13,
      "text": "Then he measured the gate from the roof of one guardroom to the roof of the other, a width of twenty-five cubits, the doors being opposite each other.",
      "links": "",
      "comment": "Visual alignment of the doors emphasizes direct access and symmetry, reflecting spiritual openness to God."
    },
    {
      "pk": 33040014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 14,
      "text": "And he made the jambs sixty cubits high, and the gate extended all around to the jamb of the courtyard.",
      "links": "",
      "comment": "The height demonstrates grandeur and majesty fitting to God’s house."
    },
    {
      "pk": 33040015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 15,
      "text": "From the front of the gate at the entrance to the front of the inner vestibule of the gate was fifty cubits.",
      "links": "",
      "comment": "The length stresses the significance of the approach to God's sanctuary, a journey reflecting reverence."
    },
    {
      "pk": 33040016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 16,
      "text": "And the guardrooms and their jambs had windows with beveled frames facing inward all around the gateway, and likewise for the vestibules. Windows were all around inside, and palm trees were carved on each jamb.",
      "links": "<a href='/AIV/11/6/29'>1 Kings 6:29</a>",
      "comment": "Windows let in light, a common biblical image for the presence of God (John 1:9). Palm trees recall previous temple decoration and symbolize victory and righteousness."
    },
    {
      "pk": 33040017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 17,
      "text": "Then he brought me into the outer court, and behold, there were chambers and a pavement made all around the court; thirty chambers faced the pavement.",
      "links": "<a href='/AIV/11/6/5'>1 Kings 6:5</a>",
      "comment": "Chambers related to temple service and provision, casting light on communal and priestly responsibilities."
    },
    {
      "pk": 33040018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 18,
      "text": "The pavement ran along the side of the gates, corresponding to the length of the gates. This was the lower pavement.",
      "links": "",
      "comment": "The mention of pavement distinguishes different areas' holiness. In tradition, outer and inner courts reflected gradations of access to God."
    },
    {
      "pk": 33040019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 19,
      "text": "Then he measured the distance from the inner front of the lower gate to the outer front of the inner court, one hundred cubits on the east and on the north side.",
      "links": "",
      "comment": "Gradual approach to the inner court demonstrates a movement toward holiness—the closer, the holier."
    },
    {
      "pk": 33040020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 20,
      "text": "Then he measured the length and width of the gate facing north, which was at the outer court.",
      "links": "",
      "comment": "Further measurements indicate careful planning and intentional design of worship."
    },
    {
      "pk": 33040021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 21,
      "text": "Its guardrooms, three on either side, and its jambs and its vestibule were of the same size as the others. The gate was fifty cubits long and twenty-five cubits wide.",
      "links": "",
      "comment": "Uniform dimensions point to unity, continuity, and the importance of equal access in God’s house."
    },
    {
      "pk": 33040022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 22,
      "text": "Its windows, vestibule, and palm trees were the same size as those of the gate facing east. Seven steps led up to it, and its vestibule was opposite them.",
      "links": "<a href='/AIV/11/6/35'>1 Kings 6:35</a>",
      "comment": "Use of palm motifs again connects to biblical themes of victory and liturgical symbolism."
    },
    {
      "pk": 33040023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 23,
      "text": "There was a gate to the inner court opposite the north gate and the east gate. He measured from gate to gate, one hundred cubits.",
      "links": "",
      "comment": "Repetition of these careful details highlights order and structure, pointing to the orderly worship intended for God's people."
    },
    {
      "pk": 33040024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 24,
      "text": "Then he led me toward the south, and behold, there was a gate on the south. He measured its jambs and its vestibule: they had the same size as the others.",
      "links": "",
      "comment": "Standardized measurements reveal a universal aspect to God's plan for holiness and access."
    },
    {
      "pk": 33040025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 25,
      "text": "And the gate and its vestibule had windows all around, like those windows. It was fifty cubits long and twenty-five cubits wide.",
      "links": "",
      "comment": "Again, symmetry and light reflect spiritual openness, clarity, and welcome."
    },
    {
      "pk": 33040026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 26,
      "text": "And there were seven steps leading up to it, with its vestibule across from them. There were palm trees on its jambs, one on either side.",
      "links": "",
      "comment": "Seven steps may recall completeness, as seven commonly symbolizes fullness in scripture."
    },
    {
      "pk": 33040027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 27,
      "text": "And there was a gate to the inner court on the south, and he measured from gate to gate toward the south, one hundred cubits.",
      "links": "",
      "comment": "A repetitive pattern showing the thoroughness in God's designs. Even small details matter to God."
    },
    {
      "pk": 33040028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 28,
      "text": "Then he brought me to the inner court, through the south gate; and he measured the south gate. It was of the same size as the others.",
      "links": "",
      "comment": "Repeated measurements of unity tie the external structure to the internal unity of the people of God."
    },
    {
      "pk": 33040029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 29,
      "text": "Its guardrooms, its jambs, and its vestibule were the same size as the others. The gate and its vestibule had windows all around. It was fifty cubits long and twenty-five cubits wide.",
      "links": "",
      "comment": "Continued symmetry suggests a principle of equality before God’s presence. All worshippers approach on the same terms."
    },
    {
      "pk": 33040030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 30,
      "text": "(The vestibules all around were twenty-five cubits long and five cubits wide.)",
      "links": "",
      "comment": "This parenthetical note emphasizes the regularity of design—God's house is adorned with deliberate proportions."
    },
    {
      "pk": 33040031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 31,
      "text": "Its vestibule faced the outer court, and palm trees were on its jambs, and its stairway had eight steps.",
      "links": "",
      "comment": "The increase from seven to eight steps may signal entry into a higher level of holiness; in the Christian tradition, the 'eighth day' symbolically refers to resurrection and new creation (cf. John 20:26)."
    },
    {
      "pk": 33040032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 32,
      "text": "Then he brought me to the inner court toward the east, and he measured the gate. It was of the same size as the others.",
      "links": "",
      "comment": "Entrance from the east again links with resurrection and the return of God's glory (cf. Ezek. 43:1-2)."
    },
    {
      "pk": 33040033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 33,
      "text": "Its guardrooms, its jambs, and its vestibule were the same size as the others. The gate and its vestibule had windows all around. It was fifty cubits long and twenty-five cubits wide.",
      "links": "",
      "comment": "Emphasizes the universality and unchanging nature of God's standards."
    },
    {
      "pk": 33040034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 34,
      "text": "Its vestibule faced the outer court, and palm trees were on its jambs, on both sides, and its stairway had eight steps.",
      "links": "",
      "comment": "Palm trees suggest victory and sanctity. Eight steps again point to a new creation motif."
    },
    {
      "pk": 33040035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 35,
      "text": "Then he brought me to the north gate, and he measured it. It was of the same size as the others.",
      "links": "",
      "comment": "Every part of God’s house shares a consistent holiness, showing impartiality of God’s invitation to worship."
    },
    {
      "pk": 33040036,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 36,
      "text": "Its guardrooms, its jambs, and its vestibule were the same size as the others. The gate and its vestibule had windows all around. It was fifty cubits long and twenty-five cubits wide.",
      "links": "",
      "comment": "Such repetition cements the understanding that all are beckoned to unified worship in God’s temple."
    },
    {
      "pk": 33040037,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 37,
      "text": "Its jambs faced the outer court, and palm trees were on its jambs on either side, and its stairway had eight steps.",
      "links": "",
      "comment": "Palm imagery and the number eight recur, as signs of sanctification and newness."
    },
    {
      "pk": 33040038,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 38,
      "text": "A chamber with its door was beside the gateposts at the gates. There they were to wash the burnt offering.",
      "links": "<a href='/AIV/3/1/9-13'>Lev. 1:9-13</a>",
      "comment": "Washing of offerings echoes rituals of priestly purification (Lev. 1:9-13), foreshadowing the spiritual cleansing necessary for approaching God. The Christian tradition upholds and fulfills this cleansing in the sacramental life."
    },
    {
      "pk": 33040039,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 39,
      "text": "In the vestibule of the gate were two tables on each side, on which the burnt offering, the sin offering, and the guilt offering were to be slaughtered.",
      "links": "<a href='/AIV/3/6/25'>Lev. 6:25</a>; <a href='/AIV/3/7/1'>Lev. 7:1</a>",
      "comment": "The provision for sacrifice connects worship to atonement for sin, prefiguring Christ’s own ultimate sacrifice (Heb. 9:12-14)."
    },
    {
      "pk": 33040040,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 40,
      "text": "Outside, as one goes up to the entrance of the north gate, there were two tables; and on the other side of the vestibule of the gate were two tables.",
      "links": "",
      "comment": "The arrangement of tables demonstrates preparation and diligence in the sacred duties."
    },
    {
      "pk": 33040041,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 41,
      "text": "There were four tables on either side of the gate, eight tables on which to slaughter the offerings.",
      "links": "",
      "comment": "The number eight may again be significant for newness; the sacrificial system points to need for continual renewal."
    },
    {
      "pk": 33040042,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 42,
      "text": "There were also four tables of hewn stone for the burnt offering, a cubit and a half long, a cubit and a half wide, and one cubit high, on which the instruments used to slaughter the burnt offerings and sacrifices were laid.",
      "links": "",
      "comment": "Use of stone for sacrificial tables recalls Old Testament practices, emphasizing stability and permanence in worship—paralleling enduring apostolic faith and sacrificial offering."
    },
    {
      "pk": 33040043,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 43,
      "text": "And hooks, a handbreadth long, were fastened all around inside. On the tables was the flesh of the offering.",
      "links": "",
      "comment": "Hooks for handling the offerings demonstrate practicality and reverence—a reminder of the seriousness of sacrificial worship."
    },
    {
      "pk": 33040044,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 44,
      "text": "Outside the inner gate, in the inner court, were chambers for the singers, facing toward the north. One was beside the south gate, and the other beside the north gate.",
      "links": "<a href='/AIV/13/25/1-8'>1 Chr. 25:1-8</a>",
      "comment": "Singers have dedicated spaces, showing the value of liturgical music in worship—an ancient tradition carried forward into Christian liturgy."
    },
    {
      "pk": 33040045,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 45,
      "text": "He said to me, 'This chamber that faces south is for the priests who have charge of the temple,",
      "links": "<a href='/AIV/4/3/5-10'>Num. 3:5-10</a>",
      "comment": "Clear distinction and roles are maintained for those who minister in the sanctuary. The apostolic tradition of set-apart ministry leaders traces its origins to such distinctions."
    },
    {
      "pk": 33040046,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 46,
      "text": "and the chamber that faces north is for the priests who have charge of the altar; these are the sons of Zadok, who alone among the sons of Levi may come near to the LORD to minister to him.'",
      "links": "<a href='/AIV/26/43/19'>Ezek. 43:19</a>; <a href='/AIV/26/44/15'>Ezek. 44:15</a>",
      "comment": "The Zadokites’ special status prefigures the establishment of a uniquely appointed priesthood. In Christian tradition, apostolic succession ensures continuity with this set-apart ministry."
    },
    {
      "pk": 33040047,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 47,
      "text": "And he measured the court: a square, one hundred cubits long and one hundred cubits wide; and the altar was in front of the temple.",
      "links": "<a href='/AIV/2/27/1'>Exod. 27:1</a>",
      "comment": "The altar's central position foreshadows the centrality of sacrifice in God's plan for communion with His people—a major theme fulfilled in Christ’s offering."
    },
    {
      "pk": 33040048,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 48,
      "text": "Then he brought me to the vestibule of the temple and measured the jambs of the vestibule, five cubits on either side. The width of the gate was fourteen cubits, and the side walls of the gate were three cubits on either side.",
      "links": "",
      "comment": "The vestibule, as the point of entrance, is marked out with particular grandeur, signifying the importance of transition into God's presence."
    },
    {
      "pk": 33040049,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 40,
      "verse": 49,
      "text": "The length of the vestibule was twenty cubits, and the width eleven cubits. Steps led up to it, with columns beside the jambs, one on each side.",
      "links": "<a href='/AIV/11/7/15-21'>1 Kings 7:15-21</a>",
      "comment": "Steps and columns at the temple entry carry forward Old Testament temple imagery, with columns symbolizing strength. The approach to God is both elevated and dignified, foreshadowing sanctuaries established later in Christian worship."
    }
  ],
  "translatedAt": "2025-12-24T09:21:24.128Z"
}