{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 9,
  "verses": [
    {
      "pk": 33009001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 1,
      "text": "Then he cried out in my hearing with a loud voice, saying, \"Bring near the executioners of the city, each with his destroying weapon in his hand.\"",
      "links": "<a href='/AIV/23/13/5'>Isa. 13:5</a>; <a href='/AIV/26/21/1'>Ezek. 21:1</a>",
      "comment": "God commands those who will execute judgment to come near. The term often refers to angelic executors of God’s judgment (cf. Isa. 13:5). This prefigures the seriousness of divine justice and discipline in the household of God."
    },
    {
      "pk": 33009002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 2,
      "text": "And behold, six men came from the direction of the upper gate, which faces north, each with his shattering weapon in his hand; and among them was a man clothed in linen, with a writing case at his hip. They came in and stood beside the bronze altar.",
      "links": "<a href='/AIV/41/16/15'>Mark 16:5</a>; <a href='/AIV/02/27/1-2'>Ex. 27:1-2</a>",
      "comment": "Linen clothing symbolizes purity and priestly service (cf. Mark 16:5, Rev. 15:6). The presence of the bronze altar hints at the sacrificial symbolism—judgment is connected with worship and the altar, a theme resonant with the idea of sacrifice and purification."
    },
    {
      "pk": 33009003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 3,
      "text": "Now the glory of the God of Israel went up from the cherub, where it had rested, to the threshold of the house. And he called to the man clothed in linen, who had the writing case at his hip.",
      "links": "<a href='/AIV/26/10/4'>Ezek. 10:4</a>; <a href='/AIV/02/25/22'>Ex. 25:22</a>",
      "comment": "The glory of the Lord departing from the cherub (which connects to the ark of the covenant, Ex. 25:22) signifies God's imminent withdrawal from the temple due to the people’s sin. Yet, God initiates a plan for those who are faithful—a remnant."
    },
    {
      "pk": 33009004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 4,
      "text": "And the LORD said to him, \"Pass through the city, through Jerusalem, and put a mark on the foreheads of the men who sigh and groan over all the abominations that are committed in it.\"",
      "links": "<a href='/AIV/66/7/3'>Rev. 7:3</a>; <a href='/AIV/02/12/23'>Ex. 12:23</a>",
      "comment": "The 'mark' recalls the Passover (Ex. 12:23) and anticipates the sealing of God’s people in Revelation (Rev. 7:3). This visible sign signifies belonging to God and protection from judgment—an early foreshadowing of God’s sacraments, which both mark and safeguard the faithful."
    },
    {
      "pk": 33009005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 5,
      "text": "And to the others he said in my hearing, \"Pass through the city after him, and strike. Your eye shall not spare, and you shall show no pity.\"",
      "links": "<a href='/AIV/02/32/27'>Ex. 32:27</a>; <a href='/AIV/24/9/21'>Jer. 9:21</a>",
      "comment": "This command to strike is reminiscent of times God’s judgment is executed by human hands (Ex. 32:27). The severity emphasizes the seriousness of sin and judgment, balanced by divine mercy for the marked."
    },
    {
      "pk": 33009006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 6,
      "text": "Kill old men outright, young men and maidens, little children and women, but touch no one on whom is the mark. And begin at my sanctuary.\" So they began with the elders who were before the house.",
      "links": "<a href='/AIV/40/13/41-42'>Matt. 13:41-42</a>; <a href='/AIV/26/8/11'>Ezek. 8:11</a>",
      "comment": "Judgment begins with God’s own house and its leaders. The sanctity of the marked is preserved—a prefigurement of the distinction between the saved and the unrepentant. See also 1 Peter 4:17 for the theme of judgment beginning with God's house."
    },
    {
      "pk": 33009007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 7,
      "text": "Then he said to them, \"Defile the house, and fill the courts with the slain. Go out!\" So they went out and struck in the city.",
      "links": "<a href='/AIV/26/7/20-22'>Ezek. 7:20-22</a>; <a href='/AIV/24/7/30'>Jer. 7:30</a>",
      "comment": "The temple, once sacred, is now defiled by corpses—an indicator of the spiritual devastation among God’s people. This scene warns of the consequences of corrupted worship and abandonment of holiness."
    },
    {
      "pk": 33009008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 8,
      "text": "While they were striking, and I was left alone, I fell upon my face and cried out, \"Ah, Lord GOD! Will you destroy all the remnant of Israel in your outpouring of wrath on Jerusalem?\"",
      "links": "<a href='/AIV/04/16/22'>Num. 16:22</a>; <a href='/AIV/26/11/13'>Ezek. 11:13</a>",
      "comment": "Ezekiel’s intercession recalls Moses (Num. 16:22). The prayerfulness of righteous men mediating for others signals the importance and effect of the prayers of God’s servants and leaders for the preservation of the faithful."
    },
    {
      "pk": 33009009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 9,
      "text": "Then he said to me, \"The guilt of the house of Israel and Judah is exceedingly great. The land is full of blood, and the city full of perversity, for they say, 'The LORD has forsaken the land, and the LORD does not see.'\"",
      "links": "<a href='/AIV/26/8/12'>Ezek. 8:12</a>; <a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "God’s response emphasizes both Israel's deep guilt and the error of thinking God is absent or indifferent. God’s knowledge encompasses all, and His justice is certain."
    },
    {
      "pk": 33009010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 10,
      "text": "\"So as for me, my eye will not spare, nor will I have pity; I will bring their deeds upon their heads.\"",
      "links": "<a href='/AIV/26/7/4'>Ezek. 7:4</a>; <a href='/AIV/19/62/12'>Ps. 62:12</a>",
      "comment": "Divine retribution is just, not arbitrary. God’s punishment fits the deeds. The refusal to show pity stresses both God's justice and the gravity of their apostasy."
    },
    {
      "pk": 33009011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 9,
      "verse": 11,
      "text": "And behold, the man clothed in linen, with the writing case at his hip, brought word back, saying, \"I have done as you commanded me.\"",
      "links": "<a href='/AIV/41/16/5'>Mark 16:5</a>; <a href='/AIV/66/7/3'>Rev. 7:3</a>",
      "comment": "The obedience of the angelic scribe signifies the certainty of God’s commands being fulfilled. The act of marking echoes themes of divine protection and mediation through a priestly figure—foreshadowing the ultimate High Priest (Hebrews 4:14) who sets apart and intercedes for God’s true people."
    }
  ],
  "translatedAt": "2025-12-24T09:02:33.766Z"
}