{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 38,
  "verses": [
    {
      "pk": 33038001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 1,
      "text": "The word of the LORD came to me:",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>; <a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "Ezekiel introduces this prophecy as coming directly from the LORD, affirming divine authorship and authority behind his words."
    },
    {
      "pk": 33038002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 2,
      "text": "Son of man, set your face toward Gog, of the land of Magog, the chief prince of Meshech and Tubal, and prophesy against him,",
      "links": "<a href='/AIV/26/39/1'>Ezek. 39:1</a>; <a href='/AIV/1/10/2'>Gen. 10:2</a>; <a href='/AIV/66/20/8'>Rev. 20:8</a>",
      "comment": "Gog as a symbolic or historical enemy is interpreted in both eschatological and spiritual ways, pointing to the ultimate adversaries of God's people. Meshech and Tubal are often associated with distant nations or tribes to the north."
    },
    {
      "pk": 33038003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 3,
      "text": "and say, ‘This is what the Lord GOD says: Look, I am against you, Gog, chief prince of Meshech and Tubal.",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>; <a href='/AIV/26/39/1'>Ezek. 39:1</a>",
      "comment": "The Lord gives a direct pronouncement of opposition. This motif of God contending with hostile rulers recalls His sovereignty in salvation history."
    },
    {
      "pk": 33038004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 4,
      "text": "I will turn you around, put hooks in your jaws, and bring you out with all your army, horses and horsemen, all of them clothed in full armor, a great multitude with shields and bucklers, all wielding swords.",
      "links": "<a href='/AIV/26/29/4'>Ezek. 29:4</a>; <a href='/AIV/26/39/2'>Ezek. 39:2</a>",
      "comment": "God's sovereignty is seen in His control over even the enemies of His people. The image of hooks signifies divine compulsion, echoing God's guidance of history toward His ultimate plan."
    },
    {
      "pk": 33038005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 5,
      "text": "Persia, Cush, and Put are with them, all of them with shield and helmet;",
      "links": "<a href='/AIV/1/10/6-7'>Gen. 10:6-7</a>; <a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "The nations listed represent distant enemies. This universal scope prefigures the final opposition against God’s people, setting the scene for the Lord’s definitive victory."
    },
    {
      "pk": 33038006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 6,
      "text": "Gomer and all his troops; Beth-togarmah from the uttermost parts of the north with all his troops—many peoples are with you.",
      "links": "<a href='/AIV/1/10/2-3'>Gen. 10:2-3</a>; <a href='/AIV/26/27/14'>Ezek. 27:14</a>",
      "comment": "These names are symbolically or geographically significant, suggesting a massive force. The 'north' often represents danger or chaos in biblical imagery."
    },
    {
      "pk": 33038007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 7,
      "text": "Prepare yourself, be ready, you and all your many armies assembled around you, and be a guard for them.",
      "links": "<a href='/AIV/26/21/12'>Ezek. 21:12</a>",
      "comment": "Even as God permits Gog to prepare for battle, it is only under the Lord's sovereign control as part of His redemptive plan."
    },
    {
      "pk": 33038008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 8,
      "text": "After many days you will be mustered. In the latter years you will invade the land that has been restored from the sword, whose people were gathered from many nations to the mountains of Israel, which had long lain waste. Its people were brought out from the nations, and all dwell securely.",
      "links": "<a href='/AIV/26/34/13'>Ezek. 34:13</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>; <a href='/AIV/66/20/7-9'>Rev. 20:7-9</a>",
      "comment": "A prophecy of eschatological dimensions, pointing toward a final gathering and restoration of Israel, both literal and spiritual, prefiguring the gathering of God’s people into His Church."
    },
    {
      "pk": 33038009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 9,
      "text": "You will advance, coming like a storm. You will be like a cloud covering the land, you and all your troops, and many peoples with you.",
      "links": "<a href='/AIV/26/30/18'>Ezek. 30:18</a>; <a href='/AIV/66/20/9'>Rev. 20:9</a>",
      "comment": "The overwhelming force of the enemy is depicted as a storm, setting the stage for divine intervention. Storms in Scripture often foreshadow God’s coming judgment."
    },
    {
      "pk": 33038010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 10,
      "text": "Thus says the Lord GOD: On that day, thoughts will arise in your mind, and you will devise an evil scheme.",
      "links": "<a href='/AIV/19/2/1'>Ps. 2:1</a>; <a href='/AIV/26/39/2'>Ezek. 39:2</a>",
      "comment": "The enemy’s plans are ultimately subject to the providence of God, echoing the futility of nations plotting in Psalm 2."
    },
    {
      "pk": 33038011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 11,
      "text": "You will say, 'I will go up against the land of unwalled villages. I will attack a peaceful people who live securely, all of them living without walls and without gates or bars.'",
      "links": "<a href='/AIV/19/73/12'>Ps. 73:12</a>; <a href='/AIV/38/2/4'>Zech. 2:4</a>",
      "comment": "The image of Israel living without walls points to peace and trust in divine protection, rather than military strength—a recurring motif for the faithful community."
    },
    {
      "pk": 33038012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 12,
      "text": "to seize spoil and carry off plunder, to turn your hand against the resettled ruins and the people gathered from the nations, who have acquired livestock and goods, and who live at the center of the earth.",
      "links": "<a href='/AIV/26/5/5'>Ezek. 5:5</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "The idea of Israel as the 'center of the earth' points symbolically to its importance in God’s plan of salvation."
    },
    {
      "pk": 33038013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 13,
      "text": "Sheba and Dedan and the merchants of Tarshish, with all its young lions, will say to you, 'Have you come to take spoil? Have you gathered your hordes to carry off silver and gold, to take away livestock and goods, to seize a great amount of plunder?'",
      "links": "<a href='/AIV/1/10/7'>Gen. 10:7</a>; <a href='/AIV/11/10/22'>1 Kings 10:22</a>",
      "comment": "These merchant nations represent outsiders questioning Gog’s motives, emphasizing that worldly ambition and wealth are ultimately futile compared to God’s purposes."
    },
    {
      "pk": 33038014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 14,
      "text": "Therefore, son of man, prophesy, and say to Gog: ‘This is what the Lord GOD says: On that day, when my people Israel dwell securely, will you not take notice of it?",
      "links": "<a href='/AIV/26/34/27-28'>Ezek. 34:27-28</a>",
      "comment": "Divine protection is highlighted—the enemies cannot harm God's people without His permission. Israel’s security is a sign of God's faithfulness."
    },
    {
      "pk": 33038015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 15,
      "text": "You will come from your place out of the farthest north, you and many peoples with you, all of them riding on horses, a great host, a mighty army.",
      "links": "<a href='/AIV/26/39/2'>Ezek. 39:2</a>",
      "comment": "In apocalyptic literature, the 'north' often symbolizes threat and chaos; many peoples together hints at a supernatural coalition against the faithful."
    },
    {
      "pk": 33038016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 16,
      "text": "You will come up against my people Israel, like a cloud covering the land. It will be in the last days, that I will bring you against my land, so that the nations may know me, when I am sanctified through you before their eyes, O Gog.’",
      "links": "<a href='/AIV/26/39/7'>Ezek. 39:7</a>; <a href='/AIV/66/20/7-9'>Rev. 20:7-9</a>",
      "comment": "The purpose of Gog's attack is revealed: that God would show His holiness and power to all nations. This points forward to the final unveiling of God's glory in the climax of salvation history."
    },
    {
      "pk": 33038017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 17,
      "text": "Thus says the Lord GOD: Are you the one of whom I spoke in former days by my servants the prophets of Israel, who prophesied for years that I would bring you against them?",
      "links": "<a href='/AIV/24/30/8'>Jer. 30:8</a>; <a href='/AIV/29/3/2'>Joel 3:2</a>",
      "comment": "The Lord reminds Gog (and the reader) that these events were foretold. The fulfillment of prophecy strengthens confidence in God’s providential plan."
    },
    {
      "pk": 33038018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 18,
      "text": "But on that day, the day that Gog comes against the land of Israel, declares the Lord GOD, my fury will rise in my anger.",
      "links": "<a href='/AIV/26/36/6'>Ezek. 36:6</a>; <a href='/AIV/26/21/31'>Ezek. 21:31</a>",
      "comment": "God’s wrath is not capricious but a holy response to evil, underscoring Divine justice—a theme fulfilled in Christ, who bore the wrath for those united to Him."
    },
    {
      "pk": 33038019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 19,
      "text": "For in my zeal and in the fire of my fury, I have spoken—Surely in that day there shall be a great earthquake in the land of Israel.",
      "links": "<a href='/AIV/30/1/1'>Amos 1:1</a>; <a href='/AIV/66/16/18'>Rev. 16:18</a>",
      "comment": "Catastrophic upheaval is a sign of God’s direct intervention. Earthquakes are a common symbol in prophecy of God’s presence and judgment (cf. Revelation)."
    },
    {
      "pk": 33038020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 20,
      "text": "The fish of the sea, the birds of the heavens, the beasts of the field, all creeping things that crawl on the earth, and all the people on the face of the earth shall quake at my presence. The mountains shall be thrown down, the cliffs shall fall, and every wall shall tumble to the ground.",
      "links": "<a href='/AIV/19/18/7'>Ps. 18:7</a>; <a href='/AIV/66/6/14-17'>Rev. 6:14-17</a>",
      "comment": "All creation trembles at God’s coming. The universality of judgment recurs in biblical revelation, fulfilled fully when all creation is restored or judged."
    },
    {
      "pk": 33038021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 21,
      "text": "I will summon a sword against Gog on all my mountains, declares the Lord GOD. Every man’s sword shall be against his brother.",
      "links": "<a href='/AIV/7/7/22'>Judg. 7:22</a>; <a href='/AIV/1/11/9'>Gen. 11:9</a>",
      "comment": "God often uses confusion among enemies (cf. Judges 7:22). This mirrors patterns seen in salvation history, where the Lord defends His people supernaturally."
    },
    {
      "pk": 33038022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 22,
      "text": "With pestilence and bloodshed I will enter into judgment with him, and I will rain down torrential rain, hailstones, fire, and sulfur upon him, and his troops, and the many peoples who are with him.",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/2/9/23'>Exod. 9:23</a>; <a href='/AIV/66/8/7'>Rev. 8:7</a>",
      "comment": "Classic images from the plagues and destruction of Sodom are recalled as God’s judgment falls. This typology points forward to the final judgment."
    },
    {
      "pk": 33038023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 38,
      "verse": 23,
      "text": "So I will show my greatness and my holiness and make myself known in the eyes of many nations. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/20/41-42'>Ezek. 20:41-42</a>; <a href='/AIV/40/24/30'>Matt. 24:30</a>",
      "comment": "The final purpose is God's glory among the nations, a consistent theme in all of salvation history. The 'making known' of the Lord foreshadows the fullness of revelation through Christ, who gathers all nations into unity under one divine plan."
    }
  ],
  "translatedAt": "2025-12-24T09:19:46.187Z"
}