{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 32,
  "verses": [
    {
      "pk": 33032001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 1,
      "text": "In the twelfth year, in the twelfth month, on the first day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/24/1'>Ezek. 24:1</a>; <a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "The date shows God's revelations to Ezekiel are precise; comparable dates frame major events and judgments."
    },
    {
      "pk": 33032002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 2,
      "text": "Son of man, raise a lamentation over Pharaoh king of Egypt, and say to him: 'You compare yourself to a lion of the nations, but you are like a monster in the seas; you burst forth in your rivers, trouble the waters with your feet, and muddy their streams.'",
      "links": "<a href='/AIV/23/19/1'>Isa. 19:1</a>; <a href='/AIV/26/29/3'>Ezek. 29:3</a>; <a href='/AIV/19/74/13'>Ps. 74:13</a>",
      "comment": "Pharaoh's arrogance is challenged. The 'monster' echoes Leviathan myths; Egypt’s pride leads to chaos, recalling the spiritual danger of pride."
    },
    {
      "pk": 33032003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 3,
      "text": "So says the Lord GOD: I will throw my net over you with an assembly of many peoples, and they will haul you up in my dragnet.",
      "links": "<a href='/AIV/26/17/20'>Ezek. 17:20</a>; <a href='/AIV/35/1/15'>Hab. 1:15</a>",
      "comment": "Divine judgment comes collectively. The net motif occurs elsewhere (Ezek. 17:20). This foreshadows final judgment, a call to humility."
    },
    {
      "pk": 33032004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 4,
      "text": "I will leave you on the land, cast you on the open field, and I will cause all the birds of the sky to settle on you, and the beasts of the whole earth to feed on you.",
      "links": "<a href='/AIV/26/29/5'>Ezek. 29:5</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "A picture of utter defeat and dishonor. Allowing animals to devour the corpse is a sign of disgrace in ancient cultures."
    },
    {
      "pk": 33032005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 5,
      "text": "I will lay your flesh upon the mountains, and fill the valleys with your carcass.",
      "links": "<a href='/AIV/26/39/4'>Ezek. 39:4</a>",
      "comment": "The scale of devastation is immense. Symbolically, God's judgment touches all creation."
    },
    {
      "pk": 33032006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 6,
      "text": "I will drench the land with your flowing blood, even up to the mountains; and the ravines will be filled with you.",
      "links": "<a href='/AIV/26/31/12'>Ezek. 31:12</a>",
      "comment": "A graphic image for the consequences of arrogance and sin. It alludes to final justice, paralleling themes of judgment at the end of days."
    },
    {
      "pk": 33032007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 7,
      "text": "When I extinguish you, I will cover the heavens and darken their stars; I will cover the sun with a cloud, and the moon will not give its light.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/41/13/24'>Mark 13:24</a>",
      "comment": "Cosmic imagery to show the world-altering effect of God’s judgment, echoed in Jesus’ end-times discourse (<a href='/AIV/41/13/24'>Mark 13:24</a>)."
    },
    {
      "pk": 33032008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 8,
      "text": "All the shining lights of the heavens I will darken over you, and will set darkness on your land,' declares the Lord GOD.",
      "links": "<a href='/AIV/23/34/4'>Isa. 34:4</a>",
      "comment": "The darkness points to the loss of hope and divine favor, a sign of complete judgment."
    },
    {
      "pk": 33032009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 9,
      "text": "I will trouble the hearts of many peoples when I bring your destruction among the nations, to the lands which you have not known.",
      "links": "<a href='/AIV/26/27/35'>Ezek. 27:35</a>",
      "comment": "Judgment on Egypt sends shockwaves far and wide. God's actions have universal repercussions, anticipated in the worldwide call to unity in truth."
    },
    {
      "pk": 33032010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 10,
      "text": "I will make many peoples appalled at you, and their kings will shudder with horror because of you, when I brandish my sword before them; and every moment each one will tremble for his own life, on the day of your fall.",
      "links": "<a href='/AIV/26/26/16'>Ezek. 26:16</a>",
      "comment": "Dread and awe before divine power. This resonates with the eventual recognition of God’s kingship."
    },
    {
      "pk": 33032011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 11,
      "text": "For thus says the Lord GOD: The sword of the king of Babylon will come against you.",
      "links": "<a href='/AIV/26/29/18'>Ezek. 29:18</a>",
      "comment": "Babylon is God's instrument of justice, an example of providence using even pagan powers for a greater plan."
    },
    {
      "pk": 33032012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 12,
      "text": "I will cause your multitudes to fall by the swords of mighty ones, all of them most ruthless of the nations; and they will devastate the pride of Egypt, and all its multitude will perish.",
      "links": "<a href='/AIV/26/30/11'>Ezek. 30:11</a>",
      "comment": "Even strong nations are humbled by God when they trust in their own strength. This prepares for the Christian call to rely on divine grace."
    },
    {
      "pk": 33032013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 13,
      "text": "I will destroy all its beasts from beside abundant waters; neither foot of man nor hoof of beast will trouble them anymore.",
      "links": "<a href='/AIV/26/29/11'>Ezek. 29:11</a>",
      "comment": "A complete desolation is described, no human or livestock remaining. It references the totality of judgment."
    },
    {
      "pk": 33032014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 14,
      "text": "Then I will make their waters clear, and their rivers will run like oil, declares the Lord GOD.",
      "links": "<a href='/AIV/23/34/13'>Isa. 34:13</a>",
      "comment": "Calm waters contrast with former chaos. Purification follows judgment—themes later echoed in sacramental imagery."
    },
    {
      "pk": 33032015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 15,
      "text": "When I make the land of Egypt desolate, and the land is laid waste of all that fills it, when I strike down all who live in it, then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/30/19'>Ezek. 30:19</a>",
      "comment": "Recognition of the LORD is the aim of judgment—hinting at the universal call to faith and conversion."
    },
    {
      "pk": 33032016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 16,
      "text": "This is a lamentation, and they shall chant it. The daughters of the nations shall lament for Egypt, they shall lament for her, for all her multitude, says the Lord GOD.",
      "links": "<a href='/AIV/24/9/17'>Jer. 9:17</a>",
      "comment": "Formal laments highlight how even sorrow has a place in sacred ritual. Women's role in lamentation underlines the family’s part in transmitting tradition."
    },
    {
      "pk": 33032017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 17,
      "text": "In the twelfth year, on the fifteenth day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>",
      "comment": "Another set date, showing God's careful oversight of history and salvation."
    },
    {
      "pk": 33032018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 18,
      "text": "Son of man, wail over the multitudes of Egypt, and bring them down, her and the daughters of majestic nations, to the depths of the earth, with those who go down to the pit.",
      "links": "<a href='/AIV/26/31/2'>Ezek. 31:2</a>",
      "comment": "Egypt joins fallen powers in the grave ('pit'). There is a clear depiction of judgment after death—pointing to the reality of the soul's destiny."
    },
    {
      "pk": 33032019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 19,
      "text": "'Whom do you surpass in beauty? Go down and be laid to rest with the uncircumcised!'",
      "links": "<a href='/AIV/26/28/10'>Ezek. 28:10</a>",
      "comment": "Earthly glory does not save from ultimate judgment. ‘Uncircumcised’ symbolizes the spiritually dead, a theme later taken by St. Paul (<a href='/AIV/51/2/13'>Col. 2:13</a>)."
    },
    {
      "pk": 33032020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 20,
      "text": "They shall fall among those slain by the sword. The sword is given; they have drawn her and all her multitudes down.",
      "links": "<a href='/AIV/26/21/9'>Ezek. 21:9</a>",
      "comment": "The repeated 'sword' symbolizes decisive judgment according to justice—also imagery for God's word in later Scripture (Heb. 4:12)."
    },
    {
      "pk": 33032021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 21,
      "text": "The mighty chiefs shall speak to them, with those who help them, from the midst of Sheol: ‘They have come down, they lie still, the uncircumcised, slain by the sword.’",
      "links": "<a href='/AIV/23/14/9'>Isa. 14:9</a>",
      "comment": "'Sheol' refers to the abode of the dead. Concept of afterlife judgment is further developed through the Bible."
    },
    {
      "pk": 33032022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 22,
      "text": "Assyria is there and all her company; their graves surround them, all of them slain, fallen by the sword.",
      "links": "<a href='/AIV/26/31/3'>Ezek. 31:3</a>",
      "comment": "Dominant powers in history all face God’s justice, pointing to a future where all nations are called to unity in faith."
    },
    {
      "pk": 33032023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 23,
      "text": "Their graves are set in the depths of the pit, and her company surrounds her grave; all of them slain, fallen by the sword, who spread terror in the land of the living.",
      "links": "<a href='/AIV/26/31/16'>Ezek. 31:16</a>",
      "comment": "Those who sow terror reap only death; divine justice is absolute, yet mercy is still possible for those who repent."
    },
    {
      "pk": 33032024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 24,
      "text": "Elam is there, and all her multitude around her grave; all of them slain, fallen by the sword, who went down uncircumcised into the depths of the earth, who spread their terror in the land of the living; they bear their shame with those who go down to the pit.",
      "links": "<a href='/AIV/26/30/5'>Ezek. 30:5</a>",
      "comment": "Elam, like Egypt, is shamed—earthly boasting cannot avert eternal consequences. Themes of shame and restitution are seen in later New Testament teaching."
    },
    {
      "pk": 33032025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 25,
      "text": "They have made her a bed among the slain, with all her multitude, her graves are set in the deepest parts of the pit; all of them uncircumcised, slain by the sword; though they spread terror in the land of the living, yet they bear their shame with those who go down to the pit; they are placed among the slain.",
      "links": "<a href='/AIV/23/14/18-19'>Isa. 14:18-19</a>",
      "comment": "Downfall is universal for those who trust in violence. The connection between the living and the dead underlines the continuity of God's justice."
    },
    {
      "pk": 33032026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 26,
      "text": "Meshech, Tubal, and all their multitude are there; their graves surround them, all of them uncircumcised, slain by the sword, for they caused terror in the land of the living.",
      "links": "<a href='/AIV/01/10/2'>Gen. 10:2</a>; <a href='/AIV/26/27/13'>Ezek. 27:13</a>",
      "comment": "Meshech and Tubal—northern peoples—show God's impartial judgment. No nation is immune from accountability."
    },
    {
      "pk": 33032027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 27,
      "text": "They do not lie with the mighty, the fallen from ancient times, who went down to Sheol with their weapons of war, whose swords were placed under their heads, and whose guilt lies upon their bones, for the terror of the mighty was in the land of the living.",
      "links": "<a href='/AIV/23/14/18-19'>Isa. 14:18-19</a>",
      "comment": "This verse indicates that even warriors buried with honor cannot escape the shame of judgment—a call to humility beyond earthly pride."
    },
    {
      "pk": 33032028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 28,
      "text": "But as for you, you will be broken and lie among the uncircumcised, with those slain by the sword.",
      "links": "<a href='/AIV/26/32/19'>Ezek. 32:19</a>",
      "comment": "Egypt shares the same fate as others. She cannot claim exemption—a theme fulfilled in the New Covenant’s call to all nations."
    },
    {
      "pk": 33032029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 29,
      "text": "Edom is there, her kings and all her princes, who, despite their strength, are laid with those slain by the sword; they lie with the uncircumcised, with those who go down to the pit.",
      "links": "<a href='/AIV/01/36/43'>Gen. 36:43</a>; <a href='/AIV/24/49/7'>Jer. 49:7</a>",
      "comment": "Even strong nations and leaders are equalized in judgment, alluding to the universal need for redemption."
    },
    {
      "pk": 33032030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 30,
      "text": "The princes of the north are there, all of them, and all the Sidonians, who have gone down in shame with the slain, in spite of the terror which they caused with their might; they lie uncircumcised with those slain by the sword, and bear their shame with those who go down to the pit.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>; <a href='/AIV/26/28/21'>Ezek. 28:21</a>",
      "comment": "All proud nations face defeat apart from God—a foreshadowing of the Church as universal gathering, not limited by race or power."
    },
    {
      "pk": 33032031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 31,
      "text": "Pharaoh will see them and will be comforted for all his multitude, Pharaoh and all his army, slain by the sword, declares the Lord GOD.",
      "links": "<a href='/AIV/23/14/10'>Isa. 14:10</a>",
      "comment": "'Comfort' is used ironically—he merely sees he is not alone in defeat. There is no ultimate hope outside the Lord."
    },
    {
      "pk": 33032032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 32,
      "verse": 32,
      "text": "'For I spread terror in the land of the living; and he shall be laid among the uncircumcised, with those slain by the sword—Pharaoh and all his multitude,' declares the Lord GOD.",
      "links": "<a href='/AIV/26/32/18'>Ezek. 32:18</a>",
      "comment": "All nations face God's righteous judgment. New Testament echoes point to Christ’s power over death and final vindication for those united to Him (<a href='/AIV/46/15/54'>1 Cor. 15:54</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:16:20.448Z"
}