{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 25,
  "verses": [
    {
      "pk": 33025001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 1,
      "text": "The word of the Lord came to me, saying:",
      "links": "",
      "comment": "This phrase marks the start of a new prophetic message delivered by Ezekiel. The repetition emphasizes the importance of divine revelation and the authority behind the prophet's words. See also <a href='/AIV/26/24/1'>Ezek. 24:1</a>."
    },
    {
      "pk": 33025002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 2,
      "text": "Son of man, set your face against the Ammonites, and prophesy against them.",
      "links": "<a href='/AIV/24/49/1'>Jer. 49:1</a>; <a href='/AIV/36/2/8'>Zeph. 2:8</a>",
      "comment": "The title 'son of man' is commonly used for Ezekiel. The Ammonites, descendants of Lot, are specifically named for judgment here. God's prophets are often told to 'set their face' against nations in acts of judgment (cf. <a href='/AIV/26/6/2'>Ezek. 6:2</a>)."
    },
    {
      "pk": 33025003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 3,
      "text": "Say to the Ammonites, 'Hear the word of the Lord God: Because you said, “Aha!” against My sanctuary when it was profaned, and against the land of Israel when it was made desolate, and against the house of Judah when they went into exile,",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>; <a href='/AIV/36/2/8-10'>Zeph. 2:8-10</a>",
      "comment": "The Ammonites rejoiced over the downfall of Jerusalem and the exile of Judah. This schadenfreude leads to their own condemnation. Rejoicing at another's calamity is condemned throughout the Scriptures (see <a href='/AIV/20/24/17'>Prov. 24:17</a>)."
    },
    {
      "pk": 33025004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 4,
      "text": "therefore, I will give you to the people of the East as a possession. They will set up their encampments among you and pitch their tents among you; they will eat your fruit and drink your milk.",
      "links": "<a href='/AIV/26/23/24'>Ezek. 23:24</a>; <a href='/AIV/07/6/3-4'>Judg. 6:3-4</a>",
      "comment": "'People of the East' likely refers to nomadic tribes like the Babylonians or Arabians, used by God as instruments of judgment. There is a transfer of inheritance for faithlessness, reflecting a biblical pattern—God raising other nations to chastise His own who turn away (<a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>)."
    },
    {
      "pk": 33025005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 5,
      "text": "And I will make Rabbah a pasture for camels and Ammon a resting place for flocks. Then you will know that I am the Lord.",
      "links": "<a href='/AIV/24/49/2'>Jer. 49:2</a>; <a href='/AIV/36/2/9'>Zeph. 2:9</a>",
      "comment": "Rabbah, their capital city, is reduced to ruins. The recurring phrase 'you will know that I am the Lord' reveals God's purpose in judgment: to manifest His sovereignty to all nations. Ultimate knowledge of God is often linked to the universality and unity of worship (cf. <a href='/AIV/39/14/9'>Zech. 14:9</a>)."
    },
    {
      "pk": 33025006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 6,
      "text": "For this is what the Lord God says: Because you have clapped your hands, stamped your feet, and rejoiced with all the contempt of your spirit against the land of Israel,",
      "links": "<a href='/AIV/35/3/16'>Hab. 3:16</a>",
      "comment": "Physical expressions (clapping, stamping) highlight their active mockery. Judgments often come as a response to pride and contempt against the people of God—this theme continues through both covenants."
    },
    {
      "pk": 33025007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 7,
      "text": "therefore, I will stretch out My hand against you and give you as plunder to the nations. I will cut you off from the peoples and make you perish from the countries. I will destroy you, and you will know that I am the Lord.",
      "links": "<a href='/AIV/23/14/26-27'>Isa. 14:26-27</a>; <a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "The 'stretched hand' is a frequent image for divine action (see <a href='/AIV/02/7/5'>Ex. 7:5</a>). God's justice reaches beyond Israel, highlighting divine sovereignty over all nations—a foreshadowing of the Gospel bringing all peoples into God's plan (<a href='/AIV/49/3/6'>Eph. 3:6</a>)."
    },
    {
      "pk": 33025008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 8,
      "text": "This is what the Lord God says: Because Moab and Seir said, 'See, the house of Judah is like all the other nations,'",
      "links": "<a href='/AIV/23/15/5-6'>Isa. 15:5-6</a>; <a href='/AIV/24/48/1'>Jer. 48:1</a>",
      "comment": "Moab and Seir (associated with Edom) deny Judah's special status. Throughout salvation history, God distinguishes His chosen people, pointing ultimately to the gathered Church as the true Israel (<a href='/AIV/45/9/6-8'>Rom. 9:6-8</a>)."
    },
    {
      "pk": 33025009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 9,
      "text": "therefore, I will open the flank of Moab, beginning at its frontier cities, the glory of the land—Beth-jeshimoth, Baal-meon, and Kiriathaim—giving them to the people of the East, together with the Ammonites.",
      "links": "<a href='/AIV/04/32/37-38'>Num. 32:37-38</a>; <a href='/AIV/24/48/21-23'>Jer. 48:21-23</a>",
      "comment": "God names the major cities as targets of judgment to show His detailed knowledge and control. The 'people of the East' remain God's instrument. Ultimately, God’s judgments are both just and merciful, meant to lead to knowledge of Him."
    },
    {
      "pk": 33025010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 10,
      "text": "I will give Moab, along with the Ammonites, to the people of the East as a possession, so that the Ammonites will not be remembered among the nations.",
      "links": "<a href='/AIV/36/2/9'>Zeph. 2:9</a>",
      "comment": "Being 'not remembered' signifies complete destruction. This foreshadows biblical warnings about the judgment on those who set themselves against God’s purpose, but also the hope of union and restoration for those who come to worship the true God."
    },
    {
      "pk": 33025011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 11,
      "text": "I will execute judgments upon Moab, and they shall know that I am the Lord.",
      "links": "<a href='/AIV/24/48/47'>Jer. 48:47</a>",
      "comment": "The repetition of 'they shall know that I am the Lord' concludes this oracle, showing that the purpose of even severe judgment is to bring knowledge of God to all peoples—a theme fulfilled in Christ who brings all nations to unity in Himself (<a href='/AIV/62/2/2'>1 John 2:2</a>)."
    },
    {
      "pk": 33025012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 12,
      "text": "This is what the Lord God says: Because Edom acted in vengeance against the house of Judah and has greatly offended by taking vengeance on them,",
      "links": "<a href='/AIV/24/49/7'>Jer. 49:7</a>; <a href='/AIV/31/1/10-14'>Obad. 1:10-14</a>",
      "comment": "Edom, a brother nation to Israel (descended from Esau), is judged more harshly for betraying kin. This highlights the gravity of apostasy and betrayal from within, hinting at the biblical priority of unity among God’s people."
    },
    {
      "pk": 33025013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 13,
      "text": "therefore, this is what the Lord God says: I will stretch out My hand against Edom, cut off both man and beast from it, and make it desolate from Teman to Dedan. They shall fall by the sword.",
      "links": "<a href='/AIV/23/21/11'>Isa. 21:11</a>; <a href='/AIV/24/49/8'>Jer. 49:8</a>",
      "comment": "Teman and Dedan mark Edom's territory; the 'sword' is a symbol of God's righteous judgment. The justice meted out to Edom foreshadows the necessity for those who stray from the faith to repent and return to full communion with the true worship and unity God desires."
    },
    {
      "pk": 33025014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 14,
      "text": "I will lay My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and My wrath; and they shall know My vengeance,' declares the Lord God.",
      "links": "<a href='/AIV/04/24/18'>Num. 24:18</a>; <a href='/AIV/24/49/10'>Jer. 49:10</a>",
      "comment": "Israel becomes the instrument of God’s judgment on Edom—a type of God’s people exercising spiritual authority and rightful judgment. It points to a fulfillment where the faithful, unified people of God participate with God in overcoming evil (<a href='/AIV/66/2/26-27'>Rev. 2:26-27</a>)."
    },
    {
      "pk": 33025015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 15,
      "text": "This is what the Lord God says: Because the Philistines acted in vengeance and took revenge with malice in their hearts to destroy with ancient hostility,",
      "links": "<a href='/AIV/23/14/29-31'>Isa. 14:29-31</a>; <a href='/AIV/24/47/1'>Jer. 47:1</a>",
      "comment": "The Philistines’ animosity is described as 'ancient hostility.' Repeated cycles of revenge highlight the dangers of division and ongoing strife among peoples, which the coming Messiah was to break by establishing lasting peace and unity among all who belong to Him."
    },
    {
      "pk": 33025016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 16,
      "text": "therefore, this is what the Lord God says: I will stretch out My hand against the Philistines, and I will cut off the Cherethites and destroy the remnant of the seacoast.",
      "links": "<a href='/AIV/36/2/5'>Zeph. 2:5</a>; <a href='/AIV/09/30/14'>1 Sam. 30:14</a>",
      "comment": "The Cherethites were associated with the Philistines—possibly mercenaries or a clan among them. God’s action across national and ethnic boundaries points to His desire for all nations to come under one Lord, removing obstacles to universal worship."
    },
    {
      "pk": 33025017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 25,
      "verse": 17,
      "text": "I will execute great vengeance upon them with wrathful rebukes. They will know that I am the Lord, when I lay My vengeance upon them.",
      "links": "<a href='/AIV/26/16/58'>Ezek. 16:58</a>; <a href='/AIV/19/149/7'>Ps. 149:7</a>",
      "comment": "Ultimate restoration and unity is always God’s aim in judgment; He rebukes to bring about true repentance and recognition of His sovereignty. Christ fulfills this theme by uniting all people through His redemptive work (<a href='/AIV/43/12/32'>John 12:32</a>), inviting all into one fold."
    }
  ],
  "translatedAt": "2025-12-24T09:12:15.295Z"
}