{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 21,
  "verses": [
    {
      "pk": 33021001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 1,
      "text": "Then the word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/6/1'>Ezek. 6:1</a>; <a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "The recurring phrase 'the word of the LORD came' emphasizes that Ezekiel speaks with divine authority as a prophet, passing along God's actual message."
    },
    {
      "pk": 33021002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 2,
      "text": "Son of man, set your face toward Jerusalem, prophesy against the sanctuaries, and prophesy against the land of Israel.",
      "links": "<a href='/AIV/26/13/17'>Ezek. 13:17</a>; <a href='/AIV/24/1/13-15'>Jer. 1:13-15</a>",
      "comment": "God calls Ezekiel 'son of man' as a reminder of his humanity. The prophecy is directed both to the land and the temple, signaling a coming judgment even on the holy place."
    },
    {
      "pk": 33021003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 3,
      "text": "Say to the land of Israel, 'This is what the LORD says: Behold, I am against you. I will draw my sword from its sheath and cut off from you both the righteous and the wicked.",
      "links": "<a href='/AIV/24/12/12'>Jer. 12:12</a>; <a href='/AIV/26/14/17'>Ezek. 14:17</a>",
      "comment": "The sword imagery is a sign of impending war and divine judgment. That both the righteous and wicked are cut off highlights the totality of the coming devastation, echoing God’s absolute justice."
    },
    {
      "pk": 33021004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 4,
      "text": "Because I will cut off both righteous and wicked from you, therefore my sword will go out from its sheath against all flesh from south to north.",
      "links": "<a href='/AIV/24/25/32'>Jer. 25:32</a>",
      "comment": "'South to north' indicates the completeness of the judgment—no one will escape. The tragic reality is that national sins often bring suffering even to those not personally guilty."
    },
    {
      "pk": 33021005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 5,
      "text": "So all flesh will know that I, the LORD, have drawn my sword out of its sheath. It will not return again.",
      "links": "<a href='/AIV/26/7/4'>Ezek. 7:4</a>; <a href='/AIV/23/31/17'>Isa. 31:8</a>",
      "comment": "Once released, God’s judgment cannot be stopped by human means. The absolute sovereignty of God is being shown here."
    },
    {
      "pk": 33021006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 6,
      "text": "But you, son of man, groan with breaking heart and bitter grief; groan before their eyes.",
      "links": "<a href='/AIV/26/9/4'>Ezek. 9:4</a>; <a href='/AIV/24/4/19'>Jer. 4:19</a>",
      "comment": "Ezekiel is called to express true anguish at Israel's fate. True prophets mourn the consequences of sin, revealing God's heart of compassion even in judgment."
    },
    {
      "pk": 33021007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 7,
      "text": "And when they say to you, 'Why are you groaning?' you shall say, 'Because of the news that is coming. Every heart will melt, all hands will be weak, every spirit will faint, and all knees will tremble like water. Behold, it is coming; it will surely take place,' declares the Lord GOD.",
      "links": "<a href='/AIV/24/6/24'>Jer. 6:24</a>; <a href='/AIV/27/5/6'>Dan. 5:6</a>",
      "comment": "The physical responses—quaking knees and fainting spirit—reveal the overwhelming terror that God's judgment brings. This mirrors the reaction to God’s appearances throughout scripture (<a href='/AIV/02/19/16'>Ex. 19:16</a>)."
    },
    {
      "pk": 33021008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 8,
      "text": "And the word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "A new message signals a new prophetic vision. Repetition underscores the divine origin and importance of the upcoming oracle."
    },
    {
      "pk": 33021009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 9,
      "text": "Son of man, prophesy and say: This is what the LORD says. Say: 'A sword, a sword is sharpened and also polished,",
      "links": "<a href='/AIV/24/47/6'>Jer. 47:6</a>",
      "comment": "The repeated mention of the sword highlights its certainty and intensity. It is made ready—prepared for action by God."
    },
    {
      "pk": 33021010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 10,
      "text": "sharpened to make a great slaughter, polished to flash like lightning! Should we then rejoice? You have despised the rod, my son, the scepter. It will not continue,' declares the Lord GOD.",
      "links": "<a href='/AIV/19/76/5'>Ps. 76:5</a>; <a href='/AIV/01/49/10'>Gen. 49:10</a>",
      "comment": "Lightning imagery conveys both speed and terror. 'You have despised the rod...' refers to Israel rejecting discipline and legitimate authority, leading to judgment and the loss of royal power for a time."
    },
    {
      "pk": 33021011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 11,
      "text": "The sword is given to be polished, to be handled; it is sharpened and polished, to be placed in the hand of the slayer.",
      "links": "<a href='/AIV/24/51/20'>Jer. 51:20</a>",
      "comment": "The sword is readied and given to 'the slayer'—likely the Babylonian king used as God’s instrument. Divine sovereignty can work through secular rulers to accomplish God’s purposes."
    },
    {
      "pk": 33021012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 12,
      "text": "Cry out and wail, son of man, for the sword is against my people; it is against all the princes of Israel. They are delivered over to the sword along with my people; strike your thigh.",
      "links": "<a href='/AIV/24/31/19'>Jer. 31:19</a>",
      "comment": "Even leaders ('princes') will fall. The gesture of striking the thigh is a sign of extreme grief or horror (<a href='/AIV/24/31/19'>Jer. 31:19</a>)."
    },
    {
      "pk": 33021013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 13,
      "text": "For there is a testing! And what if even the scepter which despises shall be no more?' declares the Lord GOD.",
      "links": "<a href='/AIV/26/20/37'>Ezek. 20:37</a>",
      "comment": "The idea of testing (or purification) is prominent. The removal of the scepter foreshadows the loss of the Davidic king—pointing ahead to restoration in a future descendant who will truly fulfill the promise of Kingship."
    },
    {
      "pk": 33021014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 14,
      "text": "Therefore, son of man, prophesy and strike your hands together. Let the sword strike not just once, not twice, but three times. It is the sword of men to be slain, it is the sword for great slaughter, surrounding them.",
      "links": "<a href='/AIV/26/6/11'>Ezek. 6:11</a>",
      "comment": "Threefold repetition intensifies the finality and completeness of the judgment. Striking hands together is a symbolic gesture, reinforcing the message’s seriousness."
    },
    {
      "pk": 33021015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 15,
      "text": "So that hearts may melt and many stumble. At all their gates I have appointed the sword to flash, made bright for slaughter, sharpened to consume.",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "Even at the city gates, where officials rendered judgment, there is no safety. The sword is symbolic of God’s inescapable judgment."
    },
    {
      "pk": 33021016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 16,
      "text": "Attack to the right, set yourself to the left, wherever your edge is directed.",
      "links": "",
      "comment": "The sword’s movements symbolize total destruction—no direction is left unscathed. God’s judgment is unchecked."
    },
    {
      "pk": 33021017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 17,
      "text": "I also will strike my hands together, and I will satisfy my wrath. I, the LORD, have spoken.",
      "links": "<a href='/AIV/26/5/13'>Ezek. 5:13</a>; <a href='/AIV/04/23/19'>Num. 23:19</a>",
      "comment": "Here, God Himself will strike His hands, showing full agreement with the coming judgment. Once God's just anger is spent, restoration is also possible—mirrored in how discipline prepares for renewal."
    },
    {
      "pk": 33021018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 18,
      "text": "The word of the LORD came to me again, saying,",
      "links": "",
      "comment": "This introduces a new prophecy, underlining ongoing communication between God and His prophet."
    },
    {
      "pk": 33021019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 19,
      "text": "Now, son of man, make two ways for the sword of the king of Babylon to come; both of them shall come from the same land. Mark out a place, mark it at the head of the way to a city.",
      "links": "<a href='/AIV/24/46/2'>Jer. 46:2</a>",
      "comment": "The image of two roads points to a decision for the king of Babylon to make; God is guiding his path—demonstrating God uses even pagan kingdoms to fulfill His plans."
    },
    {
      "pk": 33021020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 20,
      "text": "Mark a way for the sword to come to Rabbah of the Ammonites and to Judah, into fortified Jerusalem.",
      "links": "<a href='/AIV/10/12/26'>2 Sam. 12:26</a>; <a href='/AIV/24/49/2'>Jer. 49:2</a>",
      "comment": "The sword of judgment will fall on both Judah and the Ammonites, showing God is king over all nations."
    },
    {
      "pk": 33021021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 21,
      "text": "For the king of Babylon stands at the fork of the road, at the head of the two ways, to use divination. He shakes the arrows, he consults the idols, he looks at the liver.",
      "links": "<a href='/AIV/01/44/5'>Gen. 44:5</a>; <a href='/AIV/26/13/6'>Ezek. 13:6</a>",
      "comment": "Babylon’s king uses pagan divination, but it is ultimately God who guides events. God is sovereign even over the plans of foreign rulers."
    },
    {
      "pk": 33021022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 22,
      "text": "Into his right hand comes the divination for Jerusalem, to set up battering rams, to call out for slaughter, to raise the battle cry, to set battering rams against the gates, to build a siege ramp, to erect siege works.",
      "links": "<a href='/AIV/24/1/15'>Jer. 1:15</a>; <a href='/AIV/12/25/1-4'>2 Kings 25:1-4</a>",
      "comment": "All the details show the siege of Jerusalem by Babylon. Despite the use of divination, God works through it for His purposes."
    },
    {
      "pk": 33021023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 23,
      "text": "But to them this prophecy will seem false. They have sworn solemn oaths, but he brings their guilt to remembrance, so they will be taken.",
      "links": "<a href='/AIV/26/12/27'>Ezek. 12:27</a>; <a href='/AIV/26/17/19'>Ezek. 17:19</a>",
      "comment": "Despite their oaths and disbelief, judgment comes—as God does not forget the breaking of covenant vows. Sworn oaths relate to the seriousness of keeping promises before God and His faithfulness to discipline when needed."
    },
    {
      "pk": 33021024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 24,
      "text": "Therefore, thus says the Lord GOD: Because you have caused your guilt to be remembered, in that your transgressions are uncovered, so that all your deeds appear—because you have come to remembrance, you shall be taken with the hand.",
      "links": "<a href='/AIV/04/32/23'>Num. 32:23</a>",
      "comment": "No hidden sin remains before God—all is exposed. This sets the stage for later themes of repentance, confession, and restoration."
    },
    {
      "pk": 33021025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 25,
      "text": "And you, O wicked one, prince of Israel, whose day has come, the time of your punishment; final vengeance,",
      "links": "<a href='/AIV/12/25/6-7'>2 Kings 25:6-7</a>",
      "comment": "The 'wicked prince' refers to Zedekiah, the last king before the destruction of Jerusalem. God's plan will not be frustrated by human rulers."
    },
    {
      "pk": 33021026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 26,
      "text": "thus says the Lord GOD: Remove the turban and take off the crown. Things will not stay as they are. Exalt what is low, and bring low the exalted.",
      "links": "<a href='/AIV/42/1/52'>Luke 1:52</a>; <a href='/AIV/19/107/40'>Ps. 107:40</a>",
      "comment": "This foreshadows reversal: old authority stripped away, God exalting the humble and bringing down the proud—a theme later echoed in the Magnificat (<a href='/AIV/42/1/52'>Luke 1:52</a>)."
    },
    {
      "pk": 33021027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 27,
      "text": "A ruin, a ruin, a ruin I will make it! This also shall not remain, until he comes whose right it is; and I will give it to him.",
      "links": "<a href='/AIV/01/49/10'>Gen. 49:10</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "A triple ruin shows utter devastation. The prophecy points forward to the fulfillment in 'he whose right it is'—an allusion to the Messiah, Jesus, who will receive eternal kingship. See <a href='/AIV/01/49/10'>Gen. 49:10</a>."
    },
    {
      "pk": 33021028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 28,
      "text": "And you, son of man, prophesy and say, Thus says the Lord GOD concerning the Ammonites and their reproach. Say: A sword, a sword is drawn for slaughter. It is polished to consume, to flash like lightning—",
      "links": "<a href='/AIV/24/49/2'>Jer. 49:2</a>",
      "comment": "The Ammonites also face divine judgment. God’s justice is not just for Israel but applies universally—God is Lord of all nations."
    },
    {
      "pk": 33021029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 29,
      "text": "while they see for you false visions, while they divine lies for you, to place you on the necks of the wicked who are to be slain, whose day has come, the time of their final punishment.",
      "links": "<a href='/AIV/24/29/8-9'>Jer. 29:8-9</a>",
      "comment": "False prophecy brings false hope, but God’s plan prevails. Ultimately all will be held accountable for justice."
    },
    {
      "pk": 33021030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 30,
      "text": "Return your sword to its sheath. In the place where you were created, in your own land, I will judge you.",
      "links": "",
      "comment": "Divine judgment is personal and particular to each nation. The phrase 'in the place where you were created' highlights God’s authority over nationhood and destiny."
    },
    {
      "pk": 33021031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 31,
      "text": "I will pour out my indignation upon you; I will blow upon you with the fire of my wrath, and I will give you into the hands of brutal men, skilled in destruction.",
      "links": "<a href='/AIV/26/7/4'>Ezek. 7:4</a>",
      "comment": "Handing over to violent men is a means of judgment. God sometimes uses other nations as instruments of discipline."
    },
    {
      "pk": 33021032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 21,
      "verse": 32,
      "text": "You shall be fuel for the fire. Your blood shall be in the midst of the land. You shall be remembered no more, for I the LORD have spoken.",
      "links": "<a href='/AIV/24/7/20'>Jer. 7:20</a>",
      "comment": "Finality of judgment—obliteration and no remembrance—confirms God's pronouncement is unchangeable. Yet elsewhere, God’s warnings are meant to lead people to true repentance and future hope. See <a href='/AIV/26/37/12-14'>Ezek. 37:12-14</a> for restoration."
    }
  ],
  "translatedAt": "2025-12-24T09:09:47.366Z"
}