{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 5,
  "verses": [
    {
      "pk": 50005001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 1,
      "text": "After these things there was a feast of the Jews, and Jesus went up to Jerusalem.",
      "links": "<a href='/AIV/43/2/13'>John 2:13</a>; <a href='/AIV/5/16/16'>Deut. 16:16</a>",
      "comment": "Jesus' participation in the Jewish feast shows His obedience to the Law and connection with Israel's liturgical calendar, highlighting the continuity between God's Old Covenant and New Covenant people."
    },
    {
      "pk": 50005002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 2,
      "text": "Now there is in Jerusalem by the Sheep Gate a pool, which in Aramaic is called Bethesda, having five covered walkways.",
      "links": "<a href='/AIV/16/3/1'>Neh. 3:1</a>",
      "comment": "The pool of Bethesda was a real place, confirming the historical reality of John's account. The mention of five porticoes suggests a place prepared for many, symbolizing abundance and mercy."
    },
    {
      "pk": 50005003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 3,
      "text": "In these lay a great multitude of those who were sick, blind, lame, and paralyzed.",
      "links": "<a href='/AIV/23/35/5-6'>Isa. 35:5-6</a>; <a href='/AIV/40/11/5'>Matt. 11:5</a>",
      "comment": "Many suffering people awaited healing. This prefigures humanity's longing for restoration and wholeness, fulfilled in Christ."
    },
    {
      "pk": 50005004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 4,
      "text": "[For an angel came down at certain times into the pool and stirred up the water. Whoever then stepped in after the stirring of the water was made well from whatever disease he had.]",
      "links": "",
      "comment": "Verse 4 is absent in many ancient manuscripts, likely a later scribal note explaining the people's hope. This tradition shows belief in supernatural mediation for healing."
    },
    {
      "pk": 50005005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 5,
      "text": "Now there was a certain man there who had been ill for thirty-eight years.",
      "links": "<a href='/AIV/5/2/14'>Deut. 2:14</a>",
      "comment": "Thirty-eight years recalls Israel's long period of waiting in the wilderness, hinting at spiritual wandering and the need for redemption."
    },
    {
      "pk": 50005006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 6,
      "text": "When Jesus saw him lying there and knew that he had already been there a long time, He said to him, \"Do you want to be made well?\"",
      "links": "",
      "comment": "Jesus initiates the healing, showing His divine knowledge and compassion. The question invites a personal response, paralleling how grace calls for our cooperation."
    },
    {
      "pk": 50005007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 7,
      "text": "The sick man answered Him, \"Sir, I have no one to put me into the pool when the water is stirred, but while I am coming, another steps down before me.\"",
      "links": "",
      "comment": "The man expresses helplessness and isolation, representing humanity's inability to save itself apart from divine intervention. Faith often begins with an admission of need."
    },
    {
      "pk": 50005008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 8,
      "text": "Jesus said to him, \"Rise, take up your mat, and walk.\"",
      "links": "<a href='/AIV/40/9/6'>Matt. 9:6</a>; <a href='/AIV/41/2/11'>Mark 2:11</a>",
      "comment": "Jesus speaks with authority and gives a command that imparts healing, signifying His power to restore and His divinity. Action is involved: grace calls for a response."
    },
    {
      "pk": 50005009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 9,
      "text": "Immediately the man was made well, took up his mat, and walked. Now it was the Sabbath on that day.",
      "links": "<a href='/AIV/40/12/10'>Matt. 12:10</a>; <a href='/AIV/2/20/8-11'>Ex. 20:8-11</a>",
      "comment": "The healing is instantaneous, demonstrating Christ's power. The Sabbath setting becomes the focus of conflict, as Jesus brings true rest and fulfills the law."
    },
    {
      "pk": 50005010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 10,
      "text": "So the Jews were saying to the man who was cured, \"It is the Sabbath, and it is not lawful for you to carry your mat.\"",
      "links": "<a href='/AIV/24/17/21-22'>Jer. 17:21-22</a>",
      "comment": "The religious leaders focus on legal observance over mercy. This anticipates later teaching about the true spirit of the law and tradition."
    },
    {
      "pk": 50005011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 11,
      "text": "But he answered them, \"The one who made me well said to me, 'Take up your mat and walk.'\"",
      "links": "",
      "comment": "Obedience to the words of Christ takes precedence over human tradition, suggesting the authority of Jesus over religious customs."
    },
    {
      "pk": 50005012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 12,
      "text": "They asked him, \"Who is the man who said to you, 'Take up your mat and walk'?\"",
      "links": "",
      "comment": "The leaders are more concerned about the breaking of custom than the miracle itself, showing a hardening of heart towards God's works."
    },
    {
      "pk": 50005013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 13,
      "text": "But the man who was healed did not know who it was, for Jesus had disappeared into the crowd that was there.",
      "links": "<a href='/AIV/43/9/12'>John 9:12</a>",
      "comment": "At first, the healed man doesn't recognize Jesus as more than a healer, illustrating a gradual revelation of Christ to believers."
    },
    {
      "pk": 50005014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 14,
      "text": "Afterward, Jesus found him in the temple and said to him, \"See, you have been made well. Sin no more, so that nothing worse may happen to you.\"",
      "links": "<a href='/AIV/43/8/11'>John 8:11</a>",
      "comment": "Jesus links physical healing with spiritual life. Forgiveness and holy living are expected of those who have received grace, suggesting a call to ongoing moral transformation."
    },
    {
      "pk": 50005015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 15,
      "text": "The man went away and told the Jews that it was Jesus who had made him well.",
      "links": "",
      "comment": "Now he testifies to Jesus' identity, pointing others to Christ as the source of healing."
    },
    {
      "pk": 50005016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 16,
      "text": "Therefore the Jews began to persecute Jesus, because He was doing these things on the Sabbath.",
      "links": "<a href='/AIV/40/12/14'>Matt. 12:14</a>; <a href='/AIV/41/3/6'>Mark 3:6</a>",
      "comment": "Conflict arises over Jesus' authority to interpret and fulfill the Law. His divine status becomes the dividing line."
    },
    {
      "pk": 50005017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 17,
      "text": "But Jesus answered them, \"My Father is working until now, and I am working.\"",
      "links": "<a href='/AIV/1/2/2-3'>Gen. 2:2-3</a>; <a href='/AIV/19/121/4'>Ps. 121:4</a>",
      "comment": "Here, Jesus aligns Himself with God's continuous activity, claiming a unique relationship as God’s Son. This is an implicit claim to divinity, as Jews recognized only God as Lord of the Sabbath."
    },
    {
      "pk": 50005018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 18,
      "text": "For this reason therefore the Jews were seeking all the more to kill Him, because He not only broke the Sabbath, but also was calling God His own Father, making Himself equal with God.",
      "links": "<a href='/AIV/43/10/33'>John 10:33</a>; <a href='/AIV/50/2/6'>Phil. 2:6</a>",
      "comment": "Jesus’ claim to divine Sonship is recognized as blasphemy by the authorities, but reveals His true identity as equal to God, a cornerstone of Christian faith."
    },
    {
      "pk": 50005019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 19,
      "text": "So Jesus answered and said to them, \"Truly, truly, I say to you, the Son can do nothing from Himself, but only what He sees the Father doing; for whatever the Father does, these things the Son also does in like manner.\"",
      "links": "<a href='/AIV/43/8/28'>John 8:28</a>; <a href='/AIV/58/1/3'>Heb. 1:3</a>",
      "comment": "Jesus expresses His perfect obedience and unity with the Father, establishing the doctrine of the Son’s divine mission and submission, rooted in love."
    },
    {
      "pk": 50005020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 20,
      "text": "For the Father loves the Son and shows Him all things that He Himself is doing; and He will show Him greater works than these, so that you may marvel.",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>; <a href='/AIV/43/1/18'>John 1:18</a>",
      "comment": "The relationship of love within the Trinity is highlighted, as well as progressive revelation leading to greater works—culminating in resurrection."
    },
    {
      "pk": 50005021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 21,
      "text": "For just as the Father raises the dead and gives them life, even so the Son also gives life to whom He wishes.",
      "links": "<a href='/AIV/11/17/22'>1 Kings 17:22</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "Jesus shares God’s unique power to raise the dead and give eternal life, affirming His divinity and authority as judge and source of salvation."
    },
    {
      "pk": 50005022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 22,
      "text": "For the Father judges no one, but has given all judgment to the Son,",
      "links": "<a href='/AIV/44/10/42'>Acts 10:42</a>; <a href='/AIV/55/4/1'>2 Tim. 4:1</a>",
      "comment": "All judgment is entrusted to Jesus, reinforcing His position as the divinely appointed Judge of all humanity."
    },
    {
      "pk": 50005023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 23,
      "text": "that all may honor the Son just as they honor the Father. Whoever does not honor the Son does not honor the Father who sent Him.",
      "links": "<a href='/AIV/43/20/28'>John 20:28</a>; <a href='/AIV/62/2/23'>1 John 2:23</a>",
      "comment": "Worship of the Son is on par with the Father, a profound claim to divinity, emphasizing the unity in worship."
    },
    {
      "pk": 50005024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 24,
      "text": "\"Truly, truly, I say to you, whoever hears My word and believes Him who sent Me has eternal life, and does not come judgment, but has passed out of death into life.\"",
      "links": "<a href='/AIV/43/3/18'>John 3:18</a>; <a href='/AIV/62/3/14'>1 John 3:14</a>",
      "comment": "Eternal life begins by hearing and believing Christ’s word, and is evidenced in a transformed life—hinting at sacramental, as well as interior, dimensions of faith."
    },
    {
      "pk": 50005025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 25,
      "text": "\"Truly, truly, I say to you, an hour is coming—and now is—when the dead will hear the voice of the Son of God, and those who hear will live.\"",
      "links": "<a href='/AIV/49/2/1'>Eph. 2:1</a>; <a href='/AIV/26/37/4'>Ezek. 37:4</a>",
      "comment": "The ‘dead’ refers both to physical resurrection and spiritual renewal—fulfilled through Christ's voice now in preaching and ultimately in the last day."
    },
    {
      "pk": 50005026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 26,
      "text": "For just as the Father has life in Himself, so He has granted to the Son also to have life in Himself.",
      "links": "<a href='/AIV/43/1/4'>John 1:4</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "The Son shares in the same eternal, self-existent life as the Father, confirming the Son's divine nature and co-equality."
    },
    {
      "pk": 50005027,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 27,
      "text": "And He has given Him authority to execute judgment, because He is the Son of Man.",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/40/26/64'>Matt. 26:64</a>",
      "comment": "'Son of Man' recalls Daniel's prophecy, linking Jesus' earthly mission to his heavenly reign as Judge. Both human and divine elements are united in Jesus' Person."
    },
    {
      "pk": 50005028,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 28,
      "text": "Do not marvel at this; for an hour is coming in which all who are in the tombs will hear His voice,",
      "links": "<a href='/AIV/27/12/2'>Dan. 12:2</a>; <a href='/AIV/53/4/16'>1 Thes. 4:16</a>",
      "comment": "General resurrection and judgment at the last day—Jesus will raise all the dead, exercise universal authority, and bring final justice."
    },
    {
      "pk": 50005029,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 29,
      "text": "and will come out—those who have done good, to the resurrection of life, but those who have done evil, to the resurrection of judgment.\"",
      "links": "<a href='/AIV/40/25/46'>Matt. 25:46</a>; <a href='/AIV/66/20/12-13'>Rev. 20:12-13</a>",
      "comment": "Final destiny is determined by deeds, reflecting faith lived out in works. This supports the importance of ongoing sanctification—not just a one-time act of faith."
    },
    {
      "pk": 50005030,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 30,
      "text": "\"I can do nothing from Myself. As I hear, I judge; and My judgment is just, because I do not seek My own will, but the will of Him who sent Me.\"",
      "links": "<a href='/AIV/43/6/38'>John 6:38</a>",
      "comment": "Jesus’ obedience to the Father's will ensures His judgment is perfect. He is model of humble submission, setting the standard for all disciples."
    },
    {
      "pk": 50005031,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 31,
      "text": "\"If I alone testify about Myself, My testimony is not valid.\"",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "Jesus appeals to the biblical principle of multiple witnesses, showing fidelity to Scriptural standards and tradition."
    },
    {
      "pk": 50005032,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 32,
      "text": "\"There is another who bears witness about Me, and I know that the witness which He gives about Me is true.\"",
      "links": "<a href='/AIV/43/8/18'>John 8:18</a>",
      "comment": "Refers implicitly to the Father and the Spirit as witnesses, as well as John the Baptist. All true testimony comes from God."
    },
    {
      "pk": 50005033,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 33,
      "text": "\"You have sent to John, and he has testified to the truth.\"",
      "links": "<a href='/AIV/43/1/6-8'>John 1:6-8</a>",
      "comment": "John the Baptist is presented as a reliable prophetic witness, linking the old and new."
    },
    {
      "pk": 50005034,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 34,
      "text": "\"Yet the testimony which I receive is not from man, but I say these things so that you may be saved.\"",
      "links": "",
      "comment": "Ultimate validation of Jesus is divine, not human. God uses human testimony to lead to salvation, demonstrating both spiritual and visible means."
    },
    {
      "pk": 50005035,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 35,
      "text": "\"He was a burning and shining lamp, and you were willing to rejoice for a while in his light.\"",
      "links": "<a href='/AIV/43/1/7'>John 1:7</a>; <a href='/AIV/19/132/17'>Ps. 132:17</a>",
      "comment": "John is honored as a prepared forerunner to Christ, but Jesus is the true Light, highlighting the continuity of God’s revelation."
    },
    {
      "pk": 50005036,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 36,
      "text": "\"But I have testimony weightier than that of John; for the works that the Father has given Me to finish—the very works I am doing—bear witness to Me, that the Father has sent Me.\"",
      "links": "<a href='/AIV/43/10/25'>John 10:25</a>",
      "comment": "Miraculous works are the divine sign authenticating Jesus’ mission. The validation of Christ by ‘signs and wonders’ is a continuation of how God always acts in salvation history."
    },
    {
      "pk": 50005037,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 37,
      "text": "\"And the Father who sent Me, He has testified about Me. You have neither heard His voice at any time nor seen His form.\"",
      "links": "<a href='/AIV/2/33/20'>Ex. 33:20</a>; <a href='/AIV/5/4/12'>Deut. 4:12</a>",
      "comment": "Testimony of the Father comes through Jesus, the Word made flesh. The invisible God is made known personally in Christ."
    },
    {
      "pk": 50005038,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 38,
      "text": "\"You do not have His word abiding in you, for you do not believe Him whom He sent.\"",
      "links": "<a href='/AIV/43/8/47'>John 8:47</a>",
      "comment": "Faith is required for God’s Word to dwell in us—openness to the fullness of divine revelation given through Christ."
    },
    {
      "pk": 50005039,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 39,
      "text": "\"You search the Scriptures because you think that in them you have eternal life; and it is these that testify about Me;\"",
      "links": "<a href='/AIV/42/24/27'>Luke 24:27</a>; <a href='/AIV/43/1/45'>John 1:45</a>",
      "comment": "Scripture points to Christ; knowledge alone is not enough, but faith in the living Word is required. The unity of Scripture and Tradition is subtly implied."
    },
    {
      "pk": 50005040,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 40,
      "text": "\"and yet you are unwilling to come to Me to have life.\"",
      "links": "",
      "comment": "Full participation in divine life means coming to Jesus Himself, not merely studying Scripture alone—the importance of personal encounter and ongoing commitment."
    },
    {
      "pk": 50005041,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 41,
      "text": "\"I do not accept glory from men;\"",
      "links": "",
      "comment": "Jesus seeks honor from God alone, not from worldly status—an example for humility and divine approval above human praise."
    },
    {
      "pk": 50005042,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 42,
      "text": "\"but I know you, that you do not have the love of God within you.\"",
      "links": "",
      "comment": "The love of God is essential for true understanding; head knowledge without hearts open to grace is insufficient."
    },
    {
      "pk": 50005043,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 43,
      "text": "\"I have come in My Father's name, and you do not receive Me; if another comes in his own name, you will receive him.\"",
      "links": "<a href='/AIV/43/10/8'>John 10:8</a>",
      "comment": "Prophetic fulfillment: True authority is often rejected, and false teachers are all too easily accepted—spiritual discernment is vital."
    },
    {
      "pk": 50005044,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 44,
      "text": "\"How can you believe, when you receive glory from one another and do not seek the glory that comes from the only God?\"",
      "links": "<a href='/AIV/43/12/43'>John 12:43</a>",
      "comment": "Pride and the pursuit of human praise are barriers to faith. Humility and seeking God’s glory is needed for true spiritual life."
    },
    {
      "pk": 50005045,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 45,
      "text": "\"Do not think that I will accuse you to the Father; the one who accuses you is Moses, in whom you have put your hope.\"",
      "links": "<a href='/AIV/5/31/26'>Deut. 31:26</a>",
      "comment": "The Law itself testifies against unbelief. Even Moses, whom the people revered, points them to the need for the fulfillment found in Jesus."
    },
    {
      "pk": 50005046,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 46,
      "text": "\"For if you believed Moses, you would believe Me, for he wrote about Me.\"",
      "links": "<a href='/AIV/5/18/15'>Deut. 18:15</a>; <a href='/AIV/43/1/45'>John 1:45</a>",
      "comment": "The prophets and the Law anticipated the Messiah. Emphasizes the harmony between the old and new, and the visible continuity in the plan of salvation."
    },
    {
      "pk": 50005047,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 5,
      "verse": 47,
      "text": "\"But if you do not believe his writings, how will you believe My words?\"",
      "links": "<a href='/AIV/42/16/31'>Luke 16:31</a>",
      "comment": "Faith in Scripture and faith in Christ go together. Disbelief in God’s revelation blocks all further understanding, underlining the necessity of faith and Tradition as living interpretation."
    }
  ],
  "translatedAt": "2025-12-24T11:04:51.688Z"
}