{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 17,
  "verses": [
    {
      "pk": 50017001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 1,
      "text": "After Jesus said these things, he looked up toward heaven and said: \"Father, the hour has come. Glorify your Son so that your Son may glorify you.",
      "links": "<a href='/AIV/40/3/16-17'>Matt. 3:16-17</a>; <a href='/AIV/43/12/23'>John 12:23</a>",
      "comment": "Jesus addresses God as Father, indicating both intimacy and divinity. The request for glory connects to previous announcements of his impending death and resurrection, fulfilling prophecy. The concept of mutual glorification hints at the eternal relationship between Son and Father."
    },
    {
      "pk": 50017002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 2,
      "text": "Just as you gave him authority over all flesh, so that he may give eternal life to everyone you have given him.",
      "links": "<a href='/AIV/40/28/18'>Matt. 28:18</a>; <a href='/AIV/45/8/29-30'>Rom. 8:29-30</a>",
      "comment": "The Father's gift of authority to the Son highlights Christ's kingship over all humanity. Eternal life is received through this authority. The mention of 'everyone you have given him' references the chosen, showing a divine initiative in salvation."
    },
    {
      "pk": 50017003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 3,
      "text": "And this is eternal life: that they know you, the only true God, and Jesus Christ whom you sent.",
      "links": "<a href='/AIV/24/9/23-24'>Jer. 9:23-24</a>; <a href='/AIV/40/11/27'>Matt. 11:27</a>",
      "comment": "Eternal life consists in knowing the Father and the Son. Here, Jesus clearly distinguishes himself as 'sent' by God, reinforcing both his divinity (through unity with the Father) and his unique messianic mission."
    },
    {
      "pk": 50017004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 4,
      "text": "I glorified you on the earth by completing the work you gave me to do.",
      "links": "<a href='/AIV/43/4/34'>John 4:34</a>; <a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "Jesus has already accomplished his Father's will, both through his teaching and upcoming sacrificial death. The idea of completing 'work' draws back to Old Testament images of priests and prophets fulfilling God's commands."
    },
    {
      "pk": 50017005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 5,
      "text": "And now, Father, glorify me together with yourself, with the glory I had with you before the world existed.",
      "links": "<a href='/AIV/43/1/1-2'>John 1:1-2</a>; <a href='/AIV/20/8/22-30'>Prov. 8:22-30</a>",
      "comment": "Jesus' request shows his preexistence and divinity, echoing John's opening that the Word was with God in the beginning. The idea of shared glory before creation points to the eternal fellowship within God—a key theme for understanding Christ’s nature."
    },
    {
      "pk": 50017006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 6,
      "text": "I revealed your name to the people you gave me out of the world. They were yours, and you gave them to me, and they have kept your word.",
      "links": "<a href='/AIV/19/22/22'>Ps. 22:22</a>; <a href='/AIV/43/6/37'>John 6:37</a>",
      "comment": "Jesus’ role as revealer links him to God’s past self-disclosure through prophets, now perfected in his person. Receiving God’s 'word' implies faithfulness—an ongoing response to divine teaching."
    },
    {
      "pk": 50017007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 7,
      "text": "Now they have come to know that everything you have given me is from you.",
      "links": "<a href='/AIV/43/16/15'>John 16:15</a>",
      "comment": "The disciples' recognition of Jesus’ divine authority shows their understanding has grown. All things received from the Father affirm the Son’s continual relationship and dependence."
    },
    {
      "pk": 50017008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 8,
      "text": "Because the words you gave me I have given to them, and they received them and truly knew that I came from you; and they believed that you sent me.",
      "links": "<a href='/AIV/43/3/34'>John 3:34</a>; <a href='/AIV/40/16/16'>Matt. 16:16</a>",
      "comment": "The giving of words directly from the Father to the Son and then to the disciples highlights a divine transmission of truth. The language of 'coming from' and 'being sent' underscores Jesus’ unique role and mission."
    },
    {
      "pk": 50017009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 9,
      "text": "I am praying for them; I am not praying for the world, but for those you have given me, because they are yours.",
      "links": "<a href='/AIV/43/6/44'>John 6:44</a>; <a href='/AIV/19/41/13'>Ps. 41:13</a>",
      "comment": "Jesus intercedes specifically for his disciples, emphasizing their special belonging to God. This selective intercession highlights the concept of a distinct, chosen community."
    },
    {
      "pk": 50017010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 10,
      "text": "All mine are yours, and yours are mine, and I am glorified in them.",
      "links": "<a href='/AIV/43/10/30'>John 10:30</a>; <a href='/AIV/43/13/31-32'>John 13:31-32</a>",
      "comment": "Mutual possession between Father and Son is another clear claim of divinity, showing unity of purpose and identity. The disciples' faith and obedience glorify Jesus, continuing his work on earth."
    },
    {
      "pk": 50017011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 11,
      "text": "And I am no longer in the world, but they are in the world, and I am coming to you. Holy Father, keep them in your name which you have given me, that they may be one, just as we are one.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "Jesus prays for unity among disciples, a central theme for those united in faith. The request for oneness mirrors the oneness of Father and Son, setting the standard for the church’s spiritual unity."
    },
    {
      "pk": 50017012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 12,
      "text": "While I was with them, I kept them in your name, which you have given me. I guarded them, and not one of them was lost except the son of destruction, so that the Scripture would be fulfilled.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/40/26/24'>Matt. 26:24</a>",
      "comment": "The only one lost is Judas, whose betrayal fulfills Old Testament prophecy. The idea of keeping and guarding reflects Christ’s ongoing protection and leadership, maintaining the faith of those entrusted to him."
    },
    {
      "pk": 50017013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 13,
      "text": "But now I come to you, and I say these things while still in the world so that they may have my joy fulfilled in themselves.",
      "links": "<a href='/AIV/43/15/11'>John 15:11</a>; <a href='/AIV/19/16/11'>Ps. 16:11</a>",
      "comment": "Jesus’ words aim to fill his disciples with joy—a joy grounded in relationship with God, not in worldly circumstances. The concept of 'joy fulfilled' hints at a spiritual gift accompanying faithfulness."
    },
    {
      "pk": 50017014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 14,
      "text": "I have given them your word; and the world has hated them because they are not of the world, just as I am not of the world.",
      "links": "<a href='/AIV/43/15/18-19'>John 15:18-19</a>; <a href='/AIV/19/119/19'>Ps. 119:19</a>",
      "comment": "The separation between disciples and the unbelieving world echoes Old Testament distinctions between the holy and the profane. Receiving God's word sets believers apart, aligning them more closely with Christ’s own mission and identity."
    },
    {
      "pk": 50017015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 15,
      "text": "I do not ask that you take them out of the world, but that you keep them from the evil one.",
      "links": "<a href='/AIV/40/6/13'>Matt. 6:13</a>; <a href='/AIV/19/121/7'>Ps. 121:7</a>",
      "comment": "Jesus’ prayer is not for escape but for protection—a theme echoed in the Lord’s Prayer. Protection from evil implies ongoing spiritual warfare, yet also divine sovereignty and care."
    },
    {
      "pk": 50017016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 16,
      "text": "They are not of the world, just as I am not of the world.",
      "links": "<a href='/AIV/43/15/19'>John 15:19</a>",
      "comment": "Repeated emphasis on the disciples’ new identity in Christ. The spiritual separation from the world points to a calling to holiness and distinctiveness."
    },
    {
      "pk": 50017017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 17,
      "text": "Sanctify them in the truth; your word is truth.",
      "links": "<a href='/AIV/19/119/142'>Ps. 119:142</a>; <a href='/AIV/43/8/32'>John 8:32</a>",
      "comment": "To be sanctified means to be made holy and set apart for God’s work. Jesus connects sanctification with God’s truth, showing how divine revelation is essential for ongoing transformation."
    },
    {
      "pk": 50017018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 18,
      "text": "Just as you sent me into the world, I also send them into the world.",
      "links": "<a href='/AIV/43/20/21'>John 20:21</a>; <a href='/AIV/41/6/7'>Mark 6:7</a>",
      "comment": "Jesus commissions his disciples with the same mission he received from the Father. This passing on of divine authority and mission is foundational for the church’s structure and apostolic succession."
    },
    {
      "pk": 50017019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 19,
      "text": "And for their sake I sanctify myself, so that they also may be sanctified in truth.",
      "links": "<a href='/AIV/40/20/28'>Matt. 20:28</a>; <a href='/AIV/58/9/12-14'>Heb. 9:12-14</a>",
      "comment": "Jesus sanctifies himself as a priestly offering, linking his sacrifice to the holiness of his people. This sets the pattern for believers to live out truthful holiness, rooted in his own obedience."
    },
    {
      "pk": 50017020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 20,
      "text": "I do not ask for these alone, but also for those who will believe in me through their word.",
      "links": "<a href='/AIV/45/10/17'>Rom. 10:17</a>; <a href='/AIV/43/4/39'>John 4:39</a>",
      "comment": "Jesus looks forward to all future believers, anticipating a community united by apostolic teaching. This introduces the idea of tradition handed down through generations of believers."
    },
    {
      "pk": 50017021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 21,
      "text": "That they may all be one, just as you, Father, are in me and I am in you; that they also may be in us, so that the world may believe that you sent me.",
      "links": "<a href='/AIV/43/14/20'>John 14:20</a>; <a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "Ultimate unity among believers reflects the unity in identity and love present in God. It is through this spiritual oneness that the church witnesses to Christ before the world."
    },
    {
      "pk": 50017022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 22,
      "text": "And I have given them the glory that you gave me, so that they may be one as we are one.",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/51/3/4'>Col. 3:4</a>",
      "comment": "The glory given to the disciples connects them to divine life and destiny. Jesus’ bestowal of this glory is for the purpose of church unity and full participation in God's presence."
    },
    {
      "pk": 50017023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 23,
      "text": "I in them and you in me, so that they may be perfectly one; that the world may know that you sent me and loved them just as you loved me.",
      "links": "<a href='/AIV/43/14/23'>John 14:23</a>; <a href='/AIV/45/5/5'>Rom. 5:5</a>",
      "comment": "The indwelling of Jesus among believers highlights the depth of spiritual union intended for his followers. Perfect unity demonstrates both the authenticity of Christ’s mission and the all-surpassing love of God."
    },
    {
      "pk": 50017024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 24,
      "text": "Father, I desire that those whom you have given me be with me where I am, so that they may see my glory which you have given me, because you loved me before the foundation of the world.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/43/1/1-2'>John 1:1-2</a>",
      "comment": "Jesus expresses his longing for believers to share eternal fellowship and witness his glory. The reference to love before creation reiterates Christ’s eternal nature and relationship with God."
    },
    {
      "pk": 50017025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 25,
      "text": "Righteous Father, the world has not known you, but I have known you, and these have known that you sent me.",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>; <a href='/AIV/43/8/55'>John 8:55</a>",
      "comment": "Jesus alone fully knows the Father, affirming his unique relationship and mission. Believers share in this knowledge through faith—a foundation for spiritual understanding."
    },
    {
      "pk": 50017026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 17,
      "verse": 26,
      "text": "I have made your name known to them and will make it known, so that the love with which you have loved me may be in them, and I in them.",
      "links": "<a href='/AIV/43/15/9'>John 15:9</a>; <a href='/AIV/19/22/22'>Ps. 22:22</a>",
      "comment": "Christ’s ongoing revelation leads to a shared experience of divine love and his actual indwelling in believers. This connects the knowledge of God to real transformation and continued union—a key mark of authentic faith."
    }
  ],
  "translatedAt": "2025-12-24T11:14:23.266Z"
}