{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 15,
  "verses": [
    {
      "pk": 50015001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 1,
      "text": "\"I am the true vine, and my Father is the vine grower.",
      "links": "<a href='/AIV/19/80/8-9'>Ps. 80:8-9</a>; <a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>",
      "comment": "Jesus uses the image of the vine—a symbol for Israel in the Old Testament (see Isa. 5:1-7)—to describe His unique role as the source of divine life. The Father tends and oversees the vine, indicating an order and unity within the divine mission."
    },
    {
      "pk": 50015002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 2,
      "text": "He cuts off every branch in Me that does not bear fruit, and every branch that does bear fruit He prunes, so that it may bear even more fruit.",
      "links": "<a href='/AIV/40/3/10'>Matt. 3:10</a>; <a href='/AIV/58/12/11'>Heb. 12:11</a>",
      "comment": "The act of 'pruning' corresponds to the process of sanctification and discipline, emphasizing ongoing transformation and growth in the believer. Fruitfulness, understood in both moral and spiritual terms, is the expected result of true union with Christ."
    },
    {
      "pk": 50015003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 3,
      "text": "You are already clean because of the word I have spoken to you.",
      "links": "<a href='/AIV/43/13/10'>John 13:10</a>; <a href='/AIV/51/1/5-6'>Col. 1:5-6</a>",
      "comment": "Being 'clean' here is a reference to the effect of Christ’s teaching and a spiritual cleansing, which points toward the power of sacred teaching and the Word in sanctifying believers."
    },
    {
      "pk": 50015004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 4,
      "text": "Remain in Me, and I in you. Just as the branch cannot bear fruit by itself unless it remains in the vine, neither can you unless you remain in Me.",
      "links": "<a href='/AIV/62/2/6'>1 John 2:6</a>; <a href='/AIV/50/1/11'>Phil. 1:11</a>",
      "comment": "Spiritual union with Christ is essential. The mutual indwelling ('remain in Me, and I in you') alludes to an ongoing, intimate relationship, maintained by grace and visible especially within the community and its sacraments."
    },
    {
      "pk": 50015005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 5,
      "text": "I am the vine; you are the branches. Whoever remains in Me, and I in him, will bear much fruit; for apart from Me you can do nothing.",
      "links": "<a href='/AIV/50/4/13'>Phil. 4:13</a>; <a href='/AIV/24/17/5-8'>Jer. 17:5-8</a>",
      "comment": "Jesus underscores His divine prerogative as the sole source of spiritual vitality and growth. This profound dependence highlights the necessity of remaining united to Him—not only individually, but within a visible, fruitful body."
    },
    {
      "pk": 50015006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 6,
      "text": "If anyone does not remain in Me, he is thrown away like a branch and withers; such branches are gathered, thrown into the fire, and burned.",
      "links": "<a href='/AIV/40/13/40-42'>Matt. 13:40-42</a>; <a href='/AIV/26/15/6-7'>Ezek. 15:6-7</a>",
      "comment": "Here, Jesus asserts the serious consequences of separating from Him, indicating eschatological judgment. The imagery aligns with Old Testament concepts of judgment for unfruitfulness."
    },
    {
      "pk": 50015007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 7,
      "text": "If you remain in Me and My words remain in you, ask whatever you wish, and it will be done for you.",
      "links": "<a href='/AIV/41/11/24'>Mark 11:24</a>; <a href='/AIV/43/14/13-14'>John 14:13-14</a>",
      "comment": "This promise is conditioned on abiding in Christ and His words. It stresses the transformative power of remaining in communion with Him—shaping our desires and prayers according to His will."
    },
    {
      "pk": 50015008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 8,
      "text": "By this My Father is glorified, that you bear much fruit and become My disciples.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/51/1/10'>Col. 1:10</a>",
      "comment": "Fruitfulness as evidence of true discipleship is a key aspect throughout Jesus' teaching. Spiritual and practical acts—especially love—are signs of authentic union with Christ."
    },
    {
      "pk": 50015009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 9,
      "text": "As the Father has loved Me, so I have loved you. Remain in My love.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/64/3/1'>Jude 1:21</a>",
      "comment": "Jesus reveals that His love is divine in origin and calls us to remain (continue, abide) in it, implying a need for faithfulness and participation."
    },
    {
      "pk": 50015010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 10,
      "text": "If you keep My commandments, you will remain in My love, just as I have kept My Father's commandments and remain in His love.",
      "links": "<a href='/AIV/43/14/21'>John 14:21</a>; <a href='/AIV/62/5/3'>1 John 5:3</a>",
      "comment": "There is a clear link between obedience and remaining in divine love. Jesus Himself models this loving obedience—an idea that connects the believer’s faith with concrete acts."
    },
    {
      "pk": 50015011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 11,
      "text": "I have spoken these things to you so that My joy may be in you and that your joy may be complete.",
      "links": "<a href='/AIV/62/1/4'>1 John 1:4</a>",
      "comment": "Fullness of joy comes from union with Christ and shared life in Him—an experience deepened and sustained especially through the means He has given to His followers."
    },
    {
      "pk": 50015012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 12,
      "text": "This is My commandment: that you love one another as I have loved you.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/62/3/23'>1 John 3:23</a>",
      "comment": "Jesus sets a new and ultimate standard for love—the sacrificial love He Himself shows. This command is the heartbeat of Christian life and community."
    },
    {
      "pk": 50015013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 13,
      "text": "No one has greater love than this: that someone lay down his life for his friends.",
      "links": "<a href='/AIV/52/5/10'>1 Thess. 5:10</a>; <a href='/AIV/45/5/7-8'>Rom. 5:7-8</a>",
      "comment": "This anticipates Jesus’ own passion and death, the ultimate act of self-sacrifice for others—a model and foundation for Christian love."
    },
    {
      "pk": 50015014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 14,
      "text": "You are My friends if you do what I command you.",
      "links": "<a href='/AIV/62/2/3-5'>1 John 2:3-5</a>",
      "comment": "Friendship with Jesus is demonstrated by obedience, emphasizing that relationship with Him is not merely sentimental but involves real commitments."
    },
    {
      "pk": 50015015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 15,
      "text": "No longer do I call you servants, for the servant does not know what his master is doing. But I have called you friends, because everything that I heard from My Father I have made known to you.",
      "links": "<a href='/AIV/19/25/14'>Ps. 25:14</a>; <a href='/AIV/46/2/9-10'>1 Cor. 2:9-10</a>",
      "comment": "Jesus elevates the disciples’ status, giving them access to divine knowledge. Jesus’ revelation fulfills Old Testament anticipation of God making His counsel known to those who fear Him."
    },
    {
      "pk": 50015016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 16,
      "text": "You did not choose Me, but I chose you and appointed you to go and bear fruit—fruit that will last—so that whatever you ask the Father in My name, He may give you.",
      "links": "<a href='/AIV/43/6/70'>John 6:70</a>; <a href='/AIV/24/1/5'>Jer. 1:5</a>",
      "comment": "Jesus speaks of His initiative in calling His apostles; their mission is to bear lasting fruit. The divine initiative is echoed through the tradition of calling and sending."
    },
    {
      "pk": 50015017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 17,
      "text": "This I command you: that you love one another.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>; <a href='/AIV/62/4/21'>1 John 4:21</a>",
      "comment": "The command of love is repeated, stressing that it is central and non-negotiable for those who follow Christ, forming the basis for unity and community."
    },
    {
      "pk": 50015018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 18,
      "text": "If the world hates you, know that it has hated Me before it hated you.",
      "links": "<a href='/AIV/40/10/22'>Matt. 10:22</a>; <a href='/AIV/60/4/14'>1 Pet. 4:14</a>",
      "comment": "Jesus prepares His followers for opposition from the world, grounding their suffering in solidarity with His own. The Church’s mission has always included bearing witness patiently."
    },
    {
      "pk": 50015019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 19,
      "text": "If you were of the world, the world would love you as its own; but because you are not of the world—since I have chosen you out of the world—the world hates you.",
      "links": "<a href='/AIV/43/17/14-16'>John 17:14-16</a>",
      "comment": "Believers are called out and set apart by Christ. The distinct identity of the Church is meant to contrast the world’s values."
    },
    {
      "pk": 50015020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 20,
      "text": "Remember the word that I said to you: 'A servant is not greater than his master.' If they persecuted Me, they will also persecute you. If they kept My word, they will also keep yours.",
      "links": "<a href='/AIV/40/10/24'>Matt. 10:24</a>; <a href='/AIV/43/13/16'>John 13:16</a>",
      "comment": "Jesus affirms the continuity between Himself and His disciples—their sufferings, and their authority to teach and be heard, are tied to Him."
    },
    {
      "pk": 50015021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 21,
      "text": "But all these things they will do to you on account of My name, because they do not know Him who sent Me.",
      "links": "<a href='/AIV/43/16/3'>John 16:3</a>; <a href='/AIV/43/17/25'>John 17:25</a>",
      "comment": "Persecution arises from ignorance of God. The identity and mission of Christ (and His followers) are directly linked to the Father’s will."
    },
    {
      "pk": 50015022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 22,
      "text": "If I had not come and spoken to them, they would not have been guilty of sin. But now they have no excuse for their sin.",
      "links": "<a href='/AIV/43/9/41'>John 9:41</a>; <a href='/AIV/45/1/20'>Rom. 1:20</a>",
      "comment": "Jesus' revelation brings both grace and accountability: knowing Him means a greater responsibility to respond."
    },
    {
      "pk": 50015023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 23,
      "text": "Whoever hates Me hates My Father also.",
      "links": "<a href='/AIV/43/5/23'>John 5:23</a>; <a href='/AIV/62/2/23'>1 John 2:23</a>",
      "comment": "Rejecting the Son is rejecting the Father, affirming once more Jesus' divine status and equality with God."
    },
    {
      "pk": 50015024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 24,
      "text": "If I had not done among them the works that no one else did, they would not be guilty of sin. But now they have seen and hated both Me and My Father.",
      "links": "<a href='/AIV/43/12/37'>John 12:37</a>; <a href='/AIV/19/35/19'>Ps. 35:19</a>",
      "comment": "Jesus’ miracles serve as unmistakable signs of His divinity and mission. To reject these is to reject the fullness of God's self-revelation."
    },
    {
      "pk": 50015025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 25,
      "text": "But this happened to fulfill the word that is written in their law: 'They hated Me without a cause.'",
      "links": "<a href='/AIV/19/35/19'>Ps. 35:19</a>; <a href='/AIV/19/69/4'>Ps. 69:4</a>",
      "comment": "Jesus’ rejection fulfills Old Testament prophecy, showing that the Scriptures point forward to Him—a key Christological theme for interpreting all of Scripture."
    },
    {
      "pk": 50015026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 26,
      "text": "When the Advocate comes, whom I will send to you from the Father—the Spirit of truth who proceeds from the Father—He will testify about Me.",
      "links": "<a href='/AIV/43/14/16-17'>John 14:16-17</a>; <a href='/AIV/43/16/7-15'>John 16:7-15</a>",
      "comment": "The Advocate (the Holy Spirit) is sent by the Son from the Father, and proceeds from the Father (note: early Church councils debated this phrase)—and bears witness to Jesus. This verse touches on the relationship within the Holy Trinity and the continuity of the apostolic testimony through the Spirit."
    },
    {
      "pk": 50015027,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 15,
      "verse": 27,
      "text": "And you also will testify, because you have been with Me from the beginning.",
      "links": "<a href='/AIV/44/1/21-22'>Acts 1:21-22</a>; <a href='/AIV/42/1/2'>Luke 1:2</a>",
      "comment": "The apostles are eye-witnesses from the very start, a foundational point for the credibility and unity of the Church’s message, which is passed on faithfully through the ages."
    }
  ],
  "translatedAt": "2025-12-24T11:13:21.668Z"
}