{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 14,
  "verses": [
    {
      "pk": 50014001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 1,
      "text": "Do not let your hearts be troubled. You believe in God; believe also in Me.",
      "links": "<a href='/AIV/19/42/5'>Ps. 42:5</a>; <a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "Jesus begins with a call for faith and trust in Himself, placing belief in Him on the same level as faith in God, a strong claim to His divinity and unity with the Father."
    },
    {
      "pk": 50014002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 2,
      "text": "In My Father’s house are many rooms. If it were not so, would I have told you that I am going away to prepare a place for you?",
      "links": "<a href='/AIV/19/23/6'>Ps. 23:6</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "Jesus speaks of the Father's house (heaven) in familial terms, pointing to an eternal dwelling and the personal preparation He undertakes for His followers. This hints at a bodily resurrection and real spiritual communion with God."
    },
    {
      "pk": 50014003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 3,
      "text": "And if I go and prepare a place for you, I will come again and take you to Myself, so that where I am you may also be.",
      "links": "<a href='/AIV/52/4/16-17'>1 Thess. 4:16-17</a>; <a href='/AIV/43/17/24'>John 17:24</a>",
      "comment": "The promise of Christ’s return and of believers sharing close communion with Him reinforces the hope of the resurrection and eternal life in union with the Lord."
    },
    {
      "pk": 50014004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 4,
      "text": "And you know the way to the place where I am going.",
      "links": "<a href='/AIV/43/10/9'>John 10:9</a>; <a href='/AIV/43/13/36'>John 13:36</a>",
      "comment": "Jesus alludes to His previous teachings about Himself as 'the way,' especially leading to eternal life and unity with the Father."
    },
    {
      "pk": 50014005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 5,
      "text": "Thomas said to Him, 'Lord, we do not know where You are going. How can we know the way?'",
      "links": "<a href='/AIV/43/11/16'>John 11:16</a>",
      "comment": "Thomas’s honest question shows the disciples' confusion and sets up Jesus’ key revelation about Himself."
    },
    {
      "pk": 50014006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 6,
      "text": "Jesus said to him, 'I am the way, the truth, and the life. No one comes to the Father except through Me.'",
      "links": "<a href='/AIV/43/10/9'>John 10:9</a>; <a href='/AIV/44/4/12'>Acts 4:12</a>; <a href='/AIV/19/86/11'>Ps. 86:11</a>",
      "comment": "Here Jesus makes a definitive claim: He alone mediates salvation and access to God. His use of 'I am' echoes God’s self-revelation in Exodus 3:14, underscoring His divinity. This unique mediation points to the necessity of continuing relationship and communion with Christ through the means He institutes."
    },
    {
      "pk": 50014007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 7,
      "text": "If you had known Me, you would have known My Father also. From now on you do know Him and have seen Him.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/43/8/19'>John 8:19</a>",
      "comment": "Jesus identifies knowledge of Himself as direct knowledge of the Father, revealing the unity and intimacy of their relationship—an essential point for understanding the mystery of God revealed through Jesus."
    },
    {
      "pk": 50014008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 8,
      "text": "Philip said to Him, 'Lord, show us the Father, and that will be enough for us.'",
      "links": "<a href='/AIV/43/12/21'>John 12:21</a>",
      "comment": "Philip expresses a deep spiritual longing to see the fullness of God, a desire rooted in Old Testament encounters—Exodus 33:18, for example."
    },
    {
      "pk": 50014009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 9,
      "text": "Jesus said to him, 'Have I been with you so long and you still do not know Me, Philip? Whoever has seen Me has seen the Father. How can you say, ‘Show us the Father’?'",
      "links": "<a href='/AIV/43/1/1'>John 1:1</a>; <a href='/AIV/51/1/15'>Col. 1:15</a>",
      "comment": "Jesus’ identity as the visible image of the invisible God affirms His divinity and the fullness of revelation in Christ—see Hebrews 1:3."
    },
    {
      "pk": 50014010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 10,
      "text": "Do you not believe that I am in the Father and the Father is in Me? The words I speak to you, I do not speak on My own authority, but the Father who dwells in Me does His works.",
      "links": "<a href='/AIV/43/5/19'>John 5:19</a>; <a href='/AIV/43/10/38'>John 10:38</a>",
      "comment": "Jesus describes a unique, inseparable unity with the Father—underscoring orthodox confession of Jesus’ divinity and the mystery of the Trinity."
    },
    {
      "pk": 50014011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 11,
      "text": "Believe Me that I am in the Father and the Father in Me, or else believe on account of the works themselves.",
      "links": "<a href='/AIV/43/10/37-38'>John 10:37-38</a>; <a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Jesus supports His claim to divinity by pointing to His miracles, which serve as divine confirmation of His unity with the Father."
    },
    {
      "pk": 50014012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 12,
      "text": "Truly, truly, I say to you, whoever believes in Me will do the works that I do, and greater works than these, because I am going to the Father.",
      "links": "<a href='/AIV/44/2/43'>Acts 2:43</a>; <a href='/AIV/43/16/7'>John 16:7</a>",
      "comment": "Jesus promises that His followers will partake in His ministry and do even greater works though His ongoing presence, especially after His ascension and through the Spirit."
    },
    {
      "pk": 50014013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 13,
      "text": "And whatever you ask in My Name, this I will do, so that the Father may be glorified in the Son.",
      "links": "<a href='/AIV/43/15/16'>John 15:16</a>; <a href='/AIV/19/50/15'>Ps. 50:15</a>",
      "comment": "Praying and acting in the name of Jesus reflects an intimate sharing in His relationship with the Father, indicating a deep communion between Jesus and His disciples."
    },
    {
      "pk": 50014014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 14,
      "text": "If you ask Me anything in My Name, I will do it.",
      "links": "<a href='/AIV/43/15/7'>John 15:7</a>; <a href='/AIV/62/5/14'>1 John 5:14</a>",
      "comment": "The repetition of the promise encourages boldness in prayer and reliance on Jesus' authority. Early Christian worship reflects this pattern of direct petition to Christ."
    },
    {
      "pk": 50014015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 15,
      "text": "If you love Me, you will keep My commandments.",
      "links": "<a href='/AIV/43/15/10'>John 15:10</a>; <a href='/AIV/62/2/3'>1 John 2:3</a>",
      "comment": "Love for Christ is demonstrated by obedience; the relationship is not only emotional but involves a call to live according to Christ’s teachings. This points to the ongoing tradition and authority of His words."
    },
    {
      "pk": 50014016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 16,
      "text": "And I will ask the Father, and He will give you another Helper, to be with you forever.",
      "links": "<a href='/AIV/43/15/26'>John 15:26</a>; <a href='/AIV/43/16/7'>John 16:7</a>",
      "comment": "The Helper (Paraclete) is promised by the Father at Jesus’ request. This reveals the cooperative relationship between Father, Son, and Spirit, and the perpetual presence of divine assistance—an assurance of the enduring continuity of the Church and her guidance."
    },
    {
      "pk": 50014017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 17,
      "text": "He is the Spirit of truth, whom the world cannot receive, because it neither sees Him nor knows Him. But you know Him, because He abides with you and will be in you.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/45/8/9'>Rom. 8:9</a>",
      "comment": "Jesus details the indwelling of the Spirit, foundational for a sacramental understanding of God’s presence among His people—spiritual life is not merely external but inwardly transformative."
    },
    {
      "pk": 50014018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 18,
      "text": "I will not leave you as orphans; I will come to you.",
      "links": "<a href='/AIV/43/16/22'>John 16:22</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "Jesus promises His ongoing presence, countering abandonment fears; spiritual adoption is stressed, implying membership in an enduring, visible family of believers."
    },
    {
      "pk": 50014019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 19,
      "text": "In a little while, the world will see Me no longer, but you will see Me. Because I live, you also will live.",
      "links": "<a href='/AIV/43/20/19'>John 20:19</a>; <a href='/AIV/66/1/18'>Rev. 1:18</a>",
      "comment": "This verse links Christ’s resurrection and the believer’s new life, emphasizing not only spiritual renewal but the hope of bodily resurrection and ongoing encounter with the risen Lord."
    },
    {
      "pk": 50014020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 20,
      "text": "On that day you will know that I am in My Father, and you are in Me, and I am in you.",
      "links": "<a href='/AIV/43/17/23'>John 17:23</a>; <a href='/AIV/62/4/13'>1 John 4:13</a>",
      "comment": "Jesus promises a profound union between Himself, the Father, and His disciples—pointing to a spiritual mystery, later described as ‘communion’ with God, made possible by Christ’s indwelling."
    },
    {
      "pk": 50014021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 21,
      "text": "Whoever has My commandments and keeps them, he it is who loves Me. And whoever loves Me will be loved by My Father, and I will love him and reveal Myself to him.",
      "links": "<a href='/AIV/43/14/15'>John 14:15</a>; <a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Intimate revelation of Christ is linked to loving obedience—emphasizing a faith that is active and transformative, not merely a mental assent."
    },
    {
      "pk": 50014022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 22,
      "text": "Judas (not Iscariot) said to Him, 'Lord, how is it that You will reveal Yourself to us, and not to the world?'",
      "links": "<a href='/AIV/44/1/3'>Acts 1:3</a>",
      "comment": "This question asks about the selective manifestation of Jesus' resurrection, which occurs to those in relationship with Him—indicating the role of faith and belonging to His community."
    },
    {
      "pk": 50014023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 23,
      "text": "Jesus answered, 'If anyone loves Me, he will keep My word. My Father will love him, and We will come to him and make Our dwelling with him.'",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/66/3/20'>Rev. 3:20</a>",
      "comment": "Jesus links love, obedience, and the indwelling of God, highlighting that God's presence abides in those who respond with loving faith—pointing to the mystery of God's presence among His people."
    },
    {
      "pk": 50014024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 24,
      "text": "Whoever does not love Me does not keep My words. The word you hear is not Mine, but from the Father who sent Me.",
      "links": "<a href='/AIV/43/12/49'>John 12:49</a>; <a href='/AIV/43/8/47'>John 8:47</a>",
      "comment": "Disobedience is equated with a lack of love for Christ, and the authority of Jesus’ words is rooted in His divine origin from the Father—underscoring continuity and unity."
    },
    {
      "pk": 50014025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 25,
      "text": "These things I have spoken to you while I am still with you.",
      "links": "<a href='/AIV/43/13/19'>John 13:19</a>",
      "comment": "Jesus reiterates His teachings, preparing for His imminent departure, with an assurance that the message will not be lost."
    },
    {
      "pk": 50014026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 26,
      "text": "But the Helper, the Holy Spirit, whom the Father will send in My Name, He will teach you all things and remind you of everything I have said to you.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/62/2/20'>1 John 2:20</a>",
      "comment": "The Spirit will guide the Church in truth, safeguard remembrance of Jesus’ teachings, and ensure continuity—supporting the faithful transmission of the apostolic message."
    },
    {
      "pk": 50014027,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 27,
      "text": "Peace I leave with you; My peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled or afraid.",
      "links": "<a href='/AIV/43/16/33'>John 16:33</a>; <a href='/AIV/19/4/8'>Ps. 4:8</a>",
      "comment": "Jesus’ peace surpasses worldly peace; tied to His ongoing presence and assurance, granting lasting tranquility even amidst trials, rooted in a supernatural communion."
    },
    {
      "pk": 50014028,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 28,
      "text": "You heard Me say, ‘I am going away and I will come back to you.’ If you loved Me, you would rejoice because I am going to the Father, for the Father is greater than I.",
      "links": "<a href='/AIV/43/16/16'>John 16:16</a>; <a href='/AIV/47/13/4'>2 Cor. 13:4</a>",
      "comment": "Jesus speaks of His return to the Father, expressing humility in His incarnate mission, indicating submission within the Trinity—showing Jesus’ eternal relationship with the Father without denying divinity."
    },
    {
      "pk": 50014029,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 29,
      "text": "And now I have told you before it happens so that when it does happen, you may believe.",
      "links": "<a href='/AIV/43/13/19'>John 13:19</a>; <a href='/AIV/23/43/9'>Isa. 43:9</a>",
      "comment": "Prophetic foretelling authenticates Jesus as the true Messiah; it reassures the disciples and undergirds their later faith."
    },
    {
      "pk": 50014030,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 30,
      "text": "I will not talk with you much longer, for the ruler of this world is coming. He has no claim on Me.",
      "links": "<a href='/AIV/43/12/31'>John 12:31</a>; <a href='/AIV/19/143/2'>Ps. 143:2</a>",
      "comment": "Jesus alludes to Satan’s limited authority. Although evil challenges Him, Christ remains sinless and perfectly obedient."
    },
    {
      "pk": 50014031,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 14,
      "verse": 31,
      "text": "But I do as the Father has commanded Me, so that the world may know that I love the Father. Rise, let us go from here.",
      "links": "<a href='/AIV/50/2/8'>Phil. 2:8</a>; <a href='/AIV/43/18/1'>John 18:1</a>",
      "comment": "Jesus’ obedience to the Father is the model for all believers, highlighting the inseparable bond of love and mission within God—He moves resolutely toward His Passion, inviting His followers to participate in the same loving obedience."
    }
  ],
  "translatedAt": "2025-12-24T11:12:39.918Z"
}