{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 3,
  "verses": [
    {
      "pk": 50003001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 1,
      "text": "Now there was a man from the Pharisees named Nicodemus, a ruler of the Jews.",
      "links": "<a href='/AIV/44/5/34'>Acts 5:34</a>; <a href='/AIV/43/7/50'>John 7:50</a>",
      "comment": "Nicodemus was a prominent religious leader and member of the Jewish ruling council called the Sanhedrin. His sincere approach is similar to seekers elsewhere in the Old and New Testament."
    },
    {
      "pk": 50003002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 2,
      "text": "He came to Jesus at night and said to Him, \"Rabbi, we know that You are a teacher who has come from God, for no one can do these signs that You do unless God is with him.\"",
      "links": "<a href='/AIV/43/2/23'>John 2:23</a>; <a href='/AIV/44/10/38'>Acts 10:38</a>",
      "comment": "Nicodemus comes at night, possibly for fear or privacy, recognizing Jesus’ divine authority through His miracles. The mention of 'signs' connects to the emphasis throughout this Gospel on Jesus’ wondrous works."
    },
    {
      "pk": 50003003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 3,
      "text": "Jesus answered him, \"Truly, truly, I say to you, unless one is born again, he cannot see the kingdom of God.\"",
      "links": "<a href='/AIV/40/18/3'>Matt. 18:3</a>; <a href='/AIV/60/1/23'>1 Pet. 1:23</a>",
      "comment": "\"Born again\" carries the dual meaning of \"from above\" (spiritually) and \"again\" (a new beginning). Entry into God’s kingdom requires a spiritual transformation, not just physical birth or lineage."
    },
    {
      "pk": 50003004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 4,
      "text": "Nicodemus said to Him, \"How can a man be born when he is old? Can he enter his mother’s womb a second time and be born?\"",
      "links": "",
      "comment": "Nicodemus misunderstands Jesus’ words in a literal sense, highlighting the radical nature of Jesus’ teaching on spiritual rebirth."
    },
    {
      "pk": 50003005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 5,
      "text": "Jesus answered, \"Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God.\"",
      "links": "<a href='/AIV/26/36/25-27'>Ezek. 36:25-27</a>; <a href='/AIV/56/3/5'>Titus 3:5</a>",
      "comment": "\"Born of water and the Spirit\" indicates a new birth involving an outward sign (such as baptism) and an inward transformation by the Spirit. The reference evokes Old Testament images of cleansing and renewal, foreshadowing the necessity of sacramental grace for salvation."
    },
    {
      "pk": 50003006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 6,
      "text": "That which is born of the flesh is flesh, and that which is born of the Spirit is spirit.",
      "links": "<a href='/AIV/45/8/5-9'>Rom. 8:5-9</a>",
      "comment": "A clear distinction between natural birth and spiritual rebirth. Human nature alone cannot achieve the new life required to enter God’s kingdom; it is a supernatural act by the Spirit."
    },
    {
      "pk": 50003007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 7,
      "text": "Do not marvel that I said to you, ‘You must be born again.’",
      "links": "",
      "comment": "Jesus emphasizes the necessity for all, even a learned teacher like Nicodemus, to experience this new birth."
    },
    {
      "pk": 50003008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 8,
      "text": "The wind blows where it wishes, and you hear its sound, but you do not know where it comes from or where it goes. So it is with everyone who is born of the Spirit.\"",
      "links": "<a href='/AIV/44/2/2'>Acts 2:2</a>",
      "comment": "The Spirit’s work is mysterious and sovereign like the wind; we experience its effects even if we don’t see its origin or course. The Greek word for “wind” and “Spirit” is the same, stressing their connection."
    },
    {
      "pk": 50003009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 9,
      "text": "Nicodemus answered Him, \"How can these things be?\"",
      "links": "",
      "comment": "Nicodemus still struggles to understand. Throughout this gospel, misunderstanding often precedes deeper insight."
    },
    {
      "pk": 50003010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 10,
      "text": "Jesus answered him, \"Are you the teacher of Israel, and yet you do not understand these things?\"",
      "links": "<a href='/AIV/40/23/10'>Matt. 23:10</a>",
      "comment": "Knowledge of Scripture does not guarantee spiritual understanding; Jesus expects teachers of Israel to comprehend spiritual truths prophesied in the Old Testament."
    },
    {
      "pk": 50003011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 11,
      "text": "Truly, truly, I say to you, we speak of what we know and bear witness to what we have seen, but you do not receive our testimony.",
      "links": "<a href='/AIV/43/8/14'>John 8:14</a>",
      "comment": "Jesus speaks with divine authority, not mere human speculation. \"We\" may refer to Jesus and the prophets or the divine counsel. Unbelief blocks understanding of revelation."
    },
    {
      "pk": 50003012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 12,
      "text": "If I have told you earthly things and you do not believe, how will you believe if I tell you heavenly things?",
      "links": "",
      "comment": "Failure to grasp foundational spiritual truths prevents deeper understanding of divine mysteries—echoing Jesus’ use of parables for those not receptive, as in <a href='/AIV/40/13/13'>Matt. 13:13</a>."
    },
    {
      "pk": 50003013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 13,
      "text": "No one has ascended into heaven except He who descended from heaven, the Son of Man.",
      "links": "<a href='/AIV/20/30/4'>Prov. 30:4</a>; <a href='/AIV/43/6/62'>John 6:62</a>",
      "comment": "Jesus refers to Himself as the unique mediator, whose origin is from heaven. 'Son of Man' is a messianic title from <a href='/AIV/27/7/13-14'>Daniel 7:13-14</a>, affirming Jesus’ divine authority and heavenly pre-existence."
    },
    {
      "pk": 50003014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 14,
      "text": "And just as Moses lifted up the serpent in the wilderness, so must the Son of Man be lifted up,",
      "links": "<a href='/AIV/4/21/9'>Num. 21:9</a>; <a href='/AIV/43/8/28'>John 8:28</a>",
      "comment": "Jesus draws a parallel between the bronze serpent and His own crucifixion. Looking upon Him in faith brings healing and salvation—a foreshadowing of the cross."
    },
    {
      "pk": 50003015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 15,
      "text": "so that whoever believes in Him may have eternal life.",
      "links": "<a href='/AIV/43/6/40'>John 6:40</a>",
      "comment": "Faith in Jesus as the crucified and risen One is the way to eternal life. The theme of ‘eternal life’ runs throughout John, linked to union with Christ."
    },
    {
      "pk": 50003016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 16,
      "text": "For God so loved the world that He gave His one and only Son, so that whoever believes in Him should not perish but have eternal life.",
      "links": "<a href='/AIV/45/5/8'>Rom. 5:8</a>; <a href='/AIV/62/4/9'>1 John 4:9</a>",
      "comment": "God’s love is self-giving and universal, and Jesus is His unique Son (Greek: monogenēs, ‘only begotten’). Salvation is both a gift and a call to personal faith, but belief entails obedience and transformation, not mere intellectual assent (<a href='/AIV/40/7/21'>Matt. 7:21</a>)."
    },
    {
      "pk": 50003017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 17,
      "text": "For God did not send His Son into the world to condemn the world, but in order that the world might be saved through Him.",
      "links": "<a href='/AIV/43/12/47'>John 12:47</a>",
      "comment": "Jesus’ mission centers on salvation, not condemnation—at least for His first coming. The scope of 'the world' points to a universal salvation offered through Christ’s work."
    },
    {
      "pk": 50003018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 18,
      "text": "Whoever believes in Him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God.",
      "links": "<a href='/AIV/41/16/16'>Mark 16:16</a>",
      "comment": "Judgment is based on one’s response to Jesus. 'Believing in the name' means trusting in the authority and identity of Jesus as the divine Son."
    },
    {
      "pk": 50003019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 19,
      "text": "This is the judgment: the light has come into the world, and people loved the darkness rather than the light, because their deeds were evil.",
      "links": "<a href='/AIV/43/1/9'>John 1:9-11</a>",
      "comment": "Jesus is the true Light, but humanity’s fallen nature resists Him. Acceptance or rejection of the Light is a moral issue with eternal consequences."
    },
    {
      "pk": 50003020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 20,
      "text": "For everyone who practices evil hates the light and does not come to the light, lest his deeds should be exposed.",
      "links": "<a href='/AIV/23/29/15'>Isa. 29:15</a>",
      "comment": "There is an inherent resistance within fallen humanity—evil avoids revelation, preferring secrecy. The call to holiness involves opening oneself to Christ, the true Light."
    },
    {
      "pk": 50003021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 21,
      "text": "But whoever does what is true comes to the light, so that it may be clearly seen that his deeds have been carried out in God.\"",
      "links": "<a href='/AIV/19/36/9'>Ps. 36:9</a>",
      "comment": "A true relationship with God bears fruit in visible goodness. Good deeds are not for self-glory, but reveal God’s work in the believer—faith and works go hand in hand."
    },
    {
      "pk": 50003022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 22,
      "text": "After this, Jesus and His disciples went into the Judean countryside, and He remained there with them and was baptizing.",
      "links": "<a href='/AIV/43/4/1-2'>John 4:1-2</a>",
      "comment": "Although John clarifies in Chapter 4 that Jesus Himself did not baptize, His disciples performed baptisms under His authority, foreshadowing the later role of sacramental initiation into the new covenant community."
    },
    {
      "pk": 50003023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 23,
      "text": "John also was baptizing at Aenon near Salim, because water was plentiful there, and people were coming and being baptized.",
      "links": "",
      "comment": "John the Baptist’s ministry overlaps with Jesus’ early ministry but soon gives way to Jesus’ preeminence. The emphasis on water points to the physical means of spiritual cleansing."
    },
    {
      "pk": 50003024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 24,
      "text": "For John had not yet been put in prison.",
      "links": "<a href='/AIV/41/1/14'>Mark 1:14</a>",
      "comment": "This note sets the timeline before John's imprisonment and execution. It highlights the overlapping yet distinct ministries of John and Jesus."
    },
    {
      "pk": 50003025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 25,
      "text": "Now a discussion arose between some of John’s disciples and a Jew over purification.",
      "links": "<a href='/AIV/41/7/3-8'>Mark 7:3-8</a>",
      "comment": "Purification refers to ritual washings. The context foreshadows the supersession of old forms with the new beginnings in Christ, who is the true source of cleansing."
    },
    {
      "pk": 50003026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 26,
      "text": "And they came to John and said to him, \"Rabbi, He who was with you across the Jordan, to whom you bore witness — look, He is baptizing, and all are going to Him.\"",
      "links": "<a href='/AIV/43/1/28'>John 1:28</a>",
      "comment": "John’s followers see Jesus as a rival, yet John's role is to direct people to Christ, not to himself."
    },
    {
      "pk": 50003027,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 27,
      "text": "John answered, \"A man can receive nothing unless it has been given him from heaven.\"",
      "links": "<a href='/AIV/46/4/7'>1 Cor. 4:7</a>",
      "comment": "All spiritual gifts and callings are received from above, teaching humility and submission to God’s will—an important principle in Christian spirituality."
    },
    {
      "pk": 50003028,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 28,
      "text": "You yourselves bear me witness, that I said, 'I am not the Christ, but I have been sent before Him.'",
      "links": "<a href='/AIV/43/1/20'>John 1:20</a>",
      "comment": "John recognizes his lesser role, much as Moses and the prophets prepared the way for the Messiah. True spiritual authority is rooted in service and pointing to Jesus."
    },
    {
      "pk": 50003029,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 29,
      "text": "The one who has the bride is the bridegroom. The friend of the bridegroom, who stands and listens to him, rejoices greatly at the bridegroom’s voice. Therefore this joy of mine is now complete.",
      "links": "<a href='/AIV/23/62/5'>Isa. 62:5</a>; <a href='/AIV/40/9/15'>Matt. 9:15</a>",
      "comment": "The 'bridegroom' imagery refers to Christ's unique relationship with His people, recalling Old Testament metaphors for God and Israel. John’s joy points to the fulfillment of the Old Covenant by the New."
    },
    {
      "pk": 50003030,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 30,
      "text": "He must increase, but I must decrease.",
      "links": "",
      "comment": "A model of humility and true discipleship. The movement from John to Jesus is a transition from preparation to fulfillment."
    },
    {
      "pk": 50003031,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 31,
      "text": "He who comes from above is above all. He who is of the earth belongs to the earth and speaks in an earthly way. He who comes from heaven is above all.",
      "links": "<a href='/AIV/43/8/23'>John 8:23</a>",
      "comment": "Christ’s heavenly origin sets Him apart from all others—affirming His divinity and authority over creation, echoing high Christology found throughout John."
    },
    {
      "pk": 50003032,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 32,
      "text": "He bears witness to what He has seen and heard, yet no one receives His testimony.",
      "links": "<a href='/AIV/43/8/26'>John 8:26</a>",
      "comment": "Jesus’ testimony is rooted in direct knowledge from the Father, yet many reject Him. This sets up a tension that runs throughout the Gospel."
    },
    {
      "pk": 50003033,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 33,
      "text": "Whoever receives His testimony sets his seal to this: that God is true.",
      "links": "<a href='/AIV/45/3/4'>Rom. 3:4</a>",
      "comment": "Faith in Christ affirms the reliability of God’s word. Receiving Jesus is a public affirmation that God’s revelation is trustworthy."
    },
    {
      "pk": 50003034,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 34,
      "text": "For He whom God has sent speaks the words of God, for He gives the Spirit without measure.",
      "links": "<a href='/AIV/43/1/16'>John 1:16</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>",
      "comment": "Christ possesses the Spirit fully and communicates the word of God perfectly. The boundless gift of the Spirit anticipates the possibility for believers to receive abundant grace through the means Christ established."
    },
    {
      "pk": 50003035,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 35,
      "text": "The Father loves the Son and has given all things into His hand.",
      "links": "<a href='/AIV/40/11/27'>Matt. 11:27</a>; <a href='/AIV/58/1/2'>Heb. 1:2</a>",
      "comment": "The unique Father-Son relationship is the foundation for Christ’s authority. He is not only the agent of creation but also of redemption and judgment."
    },
    {
      "pk": 50003036,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 3,
      "verse": 36,
      "text": "Whoever believes in the Son has eternal life; whoever does not obey the Son shall not see life, but the wrath of God remains on him.",
      "links": "<a href='/AIV/62/5/12'>1 John 5:12</a>; <a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "Eternal life comes through faith joined with obedience. 'Does not obey' in the original literally means \"refuses to be persuaded or comply with.\" Faith that does not result in obedience is not saving faith (see <a href='/AIV/59/2/14-26'>James 2:14-26</a>)."
    }
  ],
  "translatedAt": "2025-12-24T11:02:34.859Z"
}