{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 9,
  "verses": [
    {
      "pk": 34009001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 1,
      "text": "In the first year of Darius son of Ahasuerus, by descent a Mede, who was made king over the realm of the Chaldeans,",
      "links": "<a href='/AIV/27/5/31'>Dan. 5:31</a>; <a href='/AIV/15/4/5'>Ezra 4:5</a>",
      "comment": "Daniel provides a historical setting—that Darius the Mede ruled Babylon. This context ties the vision to a critical moment for God's people in exile."
    },
    {
      "pk": 34009002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 2,
      "text": "in the first year of his reign, I, Daniel, understood from the books the number of years which, according to the word of the LORD given to Jeremiah the prophet, must pass before the desolation of Jerusalem would be fulfilled—seventy years.",
      "links": "<a href='/AIV/24/25/11'>Jer. 25:11</a>; <a href='/AIV/24/29/10'>Jer. 29:10</a>",
      "comment": "Daniel studies the Scriptures—showing the importance of sacred writings for understanding God's plan. The reference to Jeremiah is a move toward a deeper recognition of prophetic continuity."
    },
    {
      "pk": 34009003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 3,
      "text": "Then I turned my face to the Lord God, seeking him by prayer and supplications, with fasting, sackcloth, and ashes.",
      "links": "<a href='/AIV/29/1/13'>Joel 1:13</a>; <a href='/AIV/42/2/37'>Luke 2:37</a>",
      "comment": "Daniel’s devotion includes fast, prayer, and outward signs of repentance—reflecting a liturgical and communal approach to repentance. These visible acts accompany heartfelt contrition."
    },
    {
      "pk": 34009004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 4,
      "text": "I prayed to the LORD my God and made confession, saying, 'O Lord, the great and awesome God, who keeps covenant and steadfast love with those who love him and keep his commandments,'",
      "links": "<a href='/AIV/05/07/09'>Deut. 7:9</a>; <a href='/AIV/16/1/5'>Neh. 1:5</a>",
      "comment": "Daniel's prayer framework recalls covenant language from Moses, emphasizing both God’s justice and mercy. The phrase 'keeps covenant' is key for themes of God’s faithfulness and the importance of obedience."
    },
    {
      "pk": 34009005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 5,
      "text": "'We have sinned and committed iniquity, acted wickedly and rebelled, turning aside from your commandments and ordinances.'",
      "links": "<a href='/AIV/03/26/40'>Lev. 26:40</a>; <a href='/AIV/16/9/33'>Neh. 9:33</a>",
      "comment": "This confession is corporate—on behalf of the people. Daniel models intercessory prayer and personal responsibility for communal sin, aligning with the idea of the people of God as a single body."
    },
    {
      "pk": 34009006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 6,
      "text": "'We have not listened to your servants the prophets, who spoke in your name to our kings, our princes, and our ancestors, and to all the people of the land.'",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>",
      "comment": "Rejection of the prophets is a recurring theme. This has spiritual implications—obedience to God's spokesmen is crucial for right relationship with Him, hinting at the ongoing role of authoritative teaching."
    },
    {
      "pk": 34009007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 7,
      "text": "'To you, Lord, belongs righteousness, but to us open shame, as it is this day—to the men of Judah, to the inhabitants of Jerusalem, and to all Israel, near and far, in all the countries to which you have driven them because of their unfaithfulness to you.'",
      "links": "<a href='/AIV/24/8/19'>Jer. 8:19</a>; <a href='/AIV/19/44/15'>Ps. 44:15</a>",
      "comment": "Daniel contrasts God’s righteousness with human failure and shame. The scattering of Israel alludes to divine discipline, but also builds expectation for future restoration, both physical and spiritual."
    },
    {
      "pk": 34009008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 8,
      "text": "'O LORD, to us belongs open shame, to our kings, our princes, and to our ancestors, because we have sinned against you.'",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "Embracing guilt on every level of leadership and ancestry, Daniel emphasizes the universality of sin and need for God’s mercy."
    },
    {
      "pk": 34009009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 9,
      "text": "'To the Lord our God belong mercy and forgiveness, for we have rebelled against him.'",
      "links": "<a href='/AIV/19/130/4'>Ps. 130:4</a>",
      "comment": "God’s readiness to pardon underlines His steadfast love, even toward those in rebellion. This foreshadows the full reconciliation offered in Christ (cf. <a href='/AIV/47/5/19'>2 Cor. 5:19</a>)."
    },
    {
      "pk": 34009010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 10,
      "text": "'We have not obeyed the voice of the LORD our God by walking in his laws, which he set before us by his servants the prophets.'",
      "links": "<a href='/AIV/24/26/4'>Jer. 26:4</a>",
      "comment": "Failure to heed God’s revealed law and prophetic voices is a recurring source of Israel’s troubles. The notion of 'walking' in God's laws is part of a living faith."
    },
    {
      "pk": 34009011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 11,
      "text": "All Israel has transgressed your law and turned aside, refusing to obey your voice. So the curse and the oath written in the Law of Moses the servant of God has been poured out upon us, because we have sinned against him.",
      "links": "<a href='/AIV/03/26/14-46'>Lev. 26:14-46</a>; <a href='/AIV/05/28/15-68'>Deut. 28:15-68</a>",
      "comment": "The consequences of disobedience, prophesied in the Law, have come to pass. Daniel frames Israel’s exile as justice according to covenant curses."
    },
    {
      "pk": 34009012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 12,
      "text": "He has confirmed his words that he spoke against us and our rulers by bringing upon us a great calamity. For under the whole heaven nothing like what has been done against Jerusalem has ever been done.",
      "links": "<a href='/AIV/25/1/12'>Lam. 1:12</a>; <a href='/AIV/25/2/17'>Lam. 2:17</a>",
      "comment": "God’s judgments fulfill His prior warnings. The devastation of Jerusalem is unique, aimed to awaken the people to repentance."
    },
    {
      "pk": 34009013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 13,
      "text": "As it is written in the Law of Moses, all this calamity has come upon us, yet we have not sought the favor of the LORD our God by turning from our iniquities and gaining insight by your truth.",
      "links": "<a href='/AIV/05/31/17-18'>Deut. 31:17-18</a>",
      "comment": "Even in disaster, true repentance and understanding are needed. This highlights the need for both interior conversion and faithfulness to the fullness of divine revelation."
    },
    {
      "pk": 34009014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 14,
      "text": "Therefore the LORD has kept ready the calamity and has brought it upon us; for the LORD our God is righteous in all he has done, and we have not obeyed his voice.",
      "links": "<a href='/AIV/19/119/137'>Ps. 119:137</a>",
      "comment": "God’s justice is affirmed, even when it brings discipline. Faithful listening to God’s voice is again emphasized."
    },
    {
      "pk": 34009015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 15,
      "text": "And now, O Lord our God, who brought your people out of the land of Egypt with a mighty hand and made for yourself a name, as at this day— we have sinned, we have done wickedly.",
      "links": "<a href='/AIV/02/12/51'>Exod. 12:51</a>; <a href='/AIV/16/9/10'>Neh. 9:10</a>",
      "comment": "Daniel recalls the Exodus, affirming God’s saving power and linking past salvation to the hope for new deliverance. This reference strengthens confidence in God’s unchanging love and covenant."
    },
    {
      "pk": 34009016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 16,
      "text": "O Lord, according to all your righteous acts, let your anger and your wrath turn away from your city Jerusalem, your holy mountain. Because of our sins and the iniquities of our ancestors, Jerusalem and your people have become a reproach to all those around us.",
      "links": "<a href='/AIV/19/79/5'>Ps. 79:5</a>; <a href='/AIV/24/31/23'>Jer. 31:23</a>",
      "comment": "Daniel asks for God’s mercy and restoration—not just for the people's sake, but also for the sake of God’s dwelling and reputation among the nations."
    },
    {
      "pk": 34009017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 17,
      "text": "Now therefore, O our God, listen to the prayer of your servant and to his pleas for mercy, and for your own sake, Lord, cause your face to shine upon your sanctuary, which is desolate.",
      "links": "<a href='/AIV/04/6/25-26'>Num. 6:25-26</a>; <a href='/AIV/19/80/3'>Ps. 80:3</a>",
      "comment": "Daniel intercedes for the restoration of the temple—God’s visible presence on earth. The request 'cause your face to shine' echoes the priestly blessing and the theme of God's glory dwelling among His people."
    },
    {
      "pk": 34009018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 18,
      "text": "O my God, incline your ear and hear. Open your eyes and see our desolations, and the city that is called by your name. For we do not present our pleas before you because of our righteousness, but because of your great mercy.",
      "links": "<a href='/AIV/19/25/6-7'>Ps. 25:6-7</a>; <a href='/AIV/19/143/1'>Ps. 143:1</a>",
      "comment": "Daniel admits utter dependence on God’s mercy rather than human worthiness—a principle foundational to understanding grace and intercession."
    },
    {
      "pk": 34009019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 19,
      "text": "O Lord, hear! O Lord, forgive! O Lord, listen and act! For your own sake, do not delay, my God, because your city and your people are called by your name.",
      "links": "<a href='/AIV/19/74/10'>Ps. 74:10</a>; <a href='/AIV/19/143/7'>Ps. 143:7</a>",
      "comment": "Daniel’s urgent plea highlights the intimate relationship between God, His people, and His city. This anticipates the future role of the holy city as a center of worship and salvation history (cf. <a href='/AIV/66/21/2'>Rev. 21:2</a>)."
    },
    {
      "pk": 34009020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 20,
      "text": "While I was speaking, praying, and confessing my sin and the sin of my people Israel, and presenting my plea before the LORD my God for the holy mountain of my God,",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "Daniel’s ongoing intercession involves personal and communal repentance—a reminder of the important link between the prayers of the faithful and God’s saving action."
    },
    {
      "pk": 34009021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 21,
      "text": "while I was still speaking in prayer, the man Gabriel, whom I had seen in the vision at the beginning, came to me in swift flight at the time of the evening sacrifice.",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>; <a href='/AIV/02/29/39'>Exod. 29:39</a>",
      "comment": "Gabriel’s appearance during the ‘evening sacrifice’ recalls regular worship, suggesting the enduring significance of liturgical prayer and heavenly mediation."
    },
    {
      "pk": 34009022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 22,
      "text": "He made me understand, speaking with me and saying, 'O Daniel, I have now come out to give you insight and understanding.'",
      "links": "<a href='/AIV/27/8/17'>Dan. 8:17</a>",
      "comment": "Angel Gabriel grants Daniel understanding, demonstrating the role of heavenly messengers in revealing divine mysteries—foreshadowing later, fuller revelations."
    },
    {
      "pk": 34009023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 23,
      "text": "'At the beginning of your pleas for mercy, a word went out, and I have come to tell you, for you are greatly beloved. Therefore consider the word and understand the vision:'",
      "links": "<a href='/AIV/27/10/11'>Dan. 10:11</a>",
      "comment": "Daniel is called ‘greatly beloved,’ showing God’s favor toward those who persevere in prayer and faithfulness. This anticipates the close relationship God seeks with His saints."
    },
    {
      "pk": 34009024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 24,
      "text": "'Seventy weeks are decreed about your people and your holy city, to finish transgression, to put an end to sin, to atone for iniquity, to bring in everlasting righteousness, to seal both vision and prophet, and to anoint the Most Holy Place.'",
      "links": "<a href='/AIV/23/53/5'>Isa. 53:5</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>; <a href='/AIV/41/1/15'>Mark 1:15</a>",
      "comment": "The ‘seventy weeks’ prophecy encompasses forgiveness, atonement, and everlasting righteousness—fulfilled in Christ’s paschal mystery. The 'anointing' hints at a future, definitive work of God and the establishment of a sanctified center of worship."
    },
    {
      "pk": 34009025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 25,
      "text": "'Know therefore and understand that from the going out of the word to restore and rebuild Jerusalem to the coming of an anointed one, a prince, there shall be seven weeks. Then for sixty-two weeks it shall be built again with squares and moat, but in a troubled time.'",
      "links": "<a href='/AIV/16/2/1-8'>Neh. 2:1-8</a>; <a href='/AIV/42/4/18'>Luke 4:18</a>",
      "comment": "Prophecy marks out specific periods from the decree to restore Jerusalem to the advent of the 'anointed one'—often seen as a prophecy of Christ. The troubled rebuilding points to both historical challenges and future spiritual fulfillment."
    },
    {
      "pk": 34009026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 26,
      "text": "'And after the sixty-two weeks, an anointed one shall be cut off and have nothing. And the people of the prince who is to come shall destroy the city and the sanctuary. Its end shall come with a flood, and to the end there shall be war. Desolations are decreed.'",
      "links": "<a href='/AIV/23/53/8'>Isa. 53:8</a>; <a href='/AIV/40/24/2'>Matt. 24:2</a>; <a href='/AIV/41/13/2'>Mark 13:2</a>",
      "comment": "‘Anointed one cut off’ is seen by many as prophesying Christ's death (cf. Isa 53:8), and the destruction of Jerusalem and the temple (fulfilled in AD 70), linking Old Testament expectation with New Testament fulfillment."
    },
    {
      "pk": 34009027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 9,
      "verse": 27,
      "text": "'And he shall make a strong covenant with many for one week, and in the middle of the week he shall bring an end to sacrifice and offering. And on the wing of abominations shall come one who makes desolate, until the decreed end is poured out on the desolator.'",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>; <a href='/AIV/58/10/12'>Heb. 10:12</a>",
      "comment": "The strong covenant with many is interpreted spiritually as Christ’s new and everlasting covenant, which brings the true end to sacrifice and establishes a perpetual worship. The desolations prophesy future tribulations but also the ultimate triumph of God’s kingdom through His consecrated community."
    }
  ],
  "translatedAt": "2025-12-24T09:32:59.916Z"
}