{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 7,
  "verses": [
    {
      "pk": 34007001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 1,
      "text": "In the first year of Belshazzar king of Babylon, Daniel saw a dream and visions in his mind as he lay on his bed. Then he wrote down the dream and told the main points.",
      "links": "<a href='/AIV/27/2/28'>Dan. 2:28</a>; <a href='/AIV/27/4/5'>Dan. 4:5</a>",
      "comment": "Daniel is given revelation through dreams, linking to earlier visions. This mode of prophecy is echoed throughout Daniel (Dan. 2:28)."
    },
    {
      "pk": 34007002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 2,
      "text": "Daniel spoke, saying: 'I saw in my vision by night, and behold, the four winds of heaven were stirring up the great sea.'",
      "links": "<a href='/AIV/27/8/2'>Dan. 8:2</a>; <a href='/AIV/66/17/15'>Rev. 17:15</a>",
      "comment": "The sea often symbolizes chaos and the nations in Scripture (Rev. 17:15). The four winds imply something worldwide."
    },
    {
      "pk": 34007003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 3,
      "text": "And four great beasts came up from the sea, each different from the others.",
      "links": "<a href='/AIV/66/13/1'>Rev. 13:1</a>; <a href='/AIV/27/8/20-22'>Dan. 8:20-22</a>",
      "comment": "The four beasts see their fulfillment as world empires. This anticipates later imagery in Revelation."
    },
    {
      "pk": 34007004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 4,
      "text": "The first was like a lion, and had eagle’s wings. I watched until its wings were plucked off, and it was lifted up from the earth and made to stand on two feet like a man, and the heart of a man was given to it.",
      "links": "<a href='/AIV/27/2/38'>Dan. 2:38</a>; <a href='/AIV/27/4/16'>Dan. 4:16</a>",
      "comment": "Babylon is symbolized by the lion, stature changed likely referencing Nebuchadnezzar's humbling (Dan. 4:16)."
    },
    {
      "pk": 34007005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 5,
      "text": "And behold, another, a second beast, like a bear. It was raised up on one side, and it had three ribs in its mouth between its teeth. And they said to it, 'Arise, devour much flesh!'",
      "links": "<a href='/AIV/27/2/39'>Dan. 2:39</a>",
      "comment": "This bear is interpreted as representing Medo-Persia, which devoured nations. Such historic empires are still relevant for understanding salvation history."
    },
    {
      "pk": 34007006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 6,
      "text": "After this I looked, and there was another, like a leopard, which had on its back four wings of a bird. The beast also had four heads, and dominion was given to it.",
      "links": "<a href='/AIV/27/2/39'>Dan. 2:39</a>; <a href='/AIV/27/8/21-22'>Dan. 8:21-22</a>",
      "comment": "Commonly, this leopard is seen as Greece—swift conquest under Alexander, then divided into four (cf. Dan. 8:21-22)."
    },
    {
      "pk": 34007007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 7,
      "text": "After this I saw in the night visions, and behold, a fourth beast, dreadful and exceedingly strong. It had huge iron teeth; it devoured and broke in pieces, and stamped what was left with its feet. It was different from all the beasts before it, and it had ten horns.",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The fourth beast is most mysterious, often linked by interpreters to Rome or future antichristian powers (Dan. 2:40, Rev. 13:1)."
    },
    {
      "pk": 34007008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 8,
      "text": "I considered the horns, and behold, there came up among them another little horn, before which three of the first horns were uprooted. And behold, in this horn were eyes like the eyes of a man, and a mouth speaking great things.",
      "links": "<a href='/AIV/27/8/9-12'>Dan. 8:9-12</a>; <a href='/AIV/66/13/5-6'>Rev. 13:5-6</a>",
      "comment": "The 'little horn' is symbolic of blasphemous and persecuting rulers—often interpreted as a type of antichrist."
    },
    {
      "pk": 34007009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 9,
      "text": "I watched until thrones were set in place, and the Ancient of Days took His seat. His clothing was white as snow, and the hair of His head like pure wool. His throne was fiery flames, its wheels a burning fire.",
      "links": "<a href='/AIV/19/104/2'>Ps. 104:2</a>; <a href='/AIV/66/1/14'>Rev. 1:14</a>",
      "comment": "God as the Ancient of Days shows His eternal kingship. The fiery throne hints at divine judgment. Compare Christ's description in Revelation (Rev. 1:14)."
    },
    {
      "pk": 34007010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 10,
      "text": "A river of fire flowed and came out from before Him. Thousands upon thousands served Him, and ten thousand times ten thousand stood before Him. The court sat in judgment, and the books were opened.",
      "links": "<a href='/AIV/66/20/12'>Rev. 20:12</a>; <a href='/AIV/19/68/17'>Ps. 68:17</a>",
      "comment": "Heavenly court scene; books opened recalls final judgment (Rev. 20:12). Note the liturgical imagery of thousands serving before God."
    },
    {
      "pk": 34007011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 11,
      "text": "I watched then because of the sound of the boastful words which the horn was speaking. I watched until the beast was killed and its body destroyed and given to the burning fire.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The destruction of the beast anticipates apocalypse imagery (Rev. 19:20). Evil is ultimately defeated in the presence of God."
    },
    {
      "pk": 34007012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 12,
      "text": "As for the rest of the beasts, their dominion was taken away, but their lives were prolonged for a season and a time.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "God permits earthly powers only for a limited time. The true kingdom endures beyond these powers."
    },
    {
      "pk": 34007013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 13,
      "text": "I saw in the night visions, and behold, One like a Son of Man came with the clouds of heaven. He approached the Ancient of Days, and they brought Him near before Him.",
      "links": "<a href='/AIV/40/26/64'>Matt. 26:64</a>; <a href='/AIV/66/14/14'>Rev. 14:14</a>",
      "comment": "The 'Son of Man' is a title Jesus takes for Himself (Matt. 26:64), suggesting His divinity and fulfillment of this prophecy. The figure is both human and divine, a critical text for Christology."
    },
    {
      "pk": 34007014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 14,
      "text": "And to Him was given dominion, and glory, and a kingdom, that all peoples, nations, and languages should serve Him. His dominion is an everlasting dominion, which shall not pass away, and His kingdom one that shall not be destroyed.",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "Universal, eternal kingship is given here which anticipates the worldwide Church and reign of Christ. The singularity and perpetuity of the kingdom is important for Christian ecclesiology."
    },
    {
      "pk": 34007015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 15,
      "text": "As for me, Daniel, my spirit was deeply troubled within me, and the visions in my mind alarmed me.",
      "links": "<a href='/AIV/27/4/19'>Dan. 4:19</a>",
      "comment": "Encountering divine revelation produces fear and awe, highlighting both the otherness and the closeness of God."
    },
    {
      "pk": 34007016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 16,
      "text": "I approached one of those who stood by, and asked him the truth concerning all this. So he told me and made known to me the interpretation of these things:",
      "links": "<a href='/AIV/27/8/15-16'>Dan. 8:15-16</a>",
      "comment": "Heavenly interpreters (perhaps angels) explain the vision, underlining the unity between the spiritual and the material world."
    },
    {
      "pk": 34007017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 17,
      "text": "'These four great beasts are four kings who shall arise out of the earth.'",
      "links": "<a href='/AIV/27/8/20-21'>Dan. 8:20-21</a>",
      "comment": "The beasts are equated by the angel as kingdoms (cf. Dan. 8:20-21). The vision encourages seeing world history in the light of God’s sovereignty."
    },
    {
      "pk": 34007018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 18,
      "text": "'But the holy ones of the Most High shall receive the kingdom and possess the kingdom forever, forever and ever.'",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/66/22/5'>Rev. 22:5</a>",
      "comment": "This refers to the faithful—the saints—whose reign with God is eternal (Dan. 2:44, Rev. 22:5). The perpetual kingdom has liturgical and sacramental undertones."
    },
    {
      "pk": 34007019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 19,
      "text": "Then I desired to know the truth about the fourth beast, which was different from all the rest, exceedingly dreadful, with its teeth of iron and its claws of bronze, which devoured, broke in pieces, and trampled what was left with its feet—",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>",
      "comment": "Curiosity about the fourth beast reflects the believer’s struggle with understanding evil and persecution."
    },
    {
      "pk": 34007020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 20,
      "text": "And about the ten horns that were on its head, and the other horn that came up, before which three fell—the horn that had eyes and a mouth that spoke great things, and whose appearance was greater than his companions.",
      "links": "<a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The symbolic meaning of horns (powers/kings) is common biblical imagery, also used in Revelation."
    },
    {
      "pk": 34007021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 21,
      "text": "As I watched, this horn made war with the holy ones and prevailed over them,",
      "links": "<a href='/AIV/66/13/7'>Rev. 13:7</a>",
      "comment": "Persecution of the saints is permitted for a time—a major theme in Christian prophecy."
    },
    {
      "pk": 34007022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 22,
      "text": "Until the Ancient of Days came, and judgment was given in favor of the holy ones of the Most High, and the time came for the holy ones to possess the kingdom.",
      "links": "<a href='/AIV/27/7/9-10'>Dan. 7:9-10</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "Divine justice is brought about in God's timing. The saints participate in Christ’s reign (cf. Rev. 20:4)."
    },
    {
      "pk": 34007023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 23,
      "text": "Thus he said: ‘The fourth beast shall be a fourth kingdom on earth, which shall be different from all the other kingdoms, and it shall devour the whole earth, trample it down, and break it to pieces.",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>",
      "comment": "A unique, destructive kingdom, possibly a reference to imperial powers or future hostile world systems."
    },
    {
      "pk": 34007024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 24,
      "text": "As for the ten horns, out of this kingdom ten kings shall arise, and another shall arise after them; he shall be different from the former ones, and he shall put down three kings.",
      "links": "<a href='/AIV/66/17/12'>Rev. 17:12</a>",
      "comment": "Multiplication of rulers after the great empire falls. The focus is on spiritual realities expressed in historical events."
    },
    {
      "pk": 34007025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 25,
      "text": "He shall speak words against the Most High, and shall wear out the holy ones of the Most High, and shall intend to change the times and the law; and they shall be given into his hand for a time, times, and half a time.",
      "links": "<a href='/AIV/66/13/7'>Rev. 13:7</a>; <a href='/AIV/27/12/7'>Dan. 12:7</a>",
      "comment": "Persecution of God's people, attack on sacred customs and calendar, echoes future tribulations (see Dan. 12:7, Rev. 13:7)."
    },
    {
      "pk": 34007026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 26,
      "text": "But the court shall sit in judgment, and his dominion shall be taken away, to be consumed and destroyed forever.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The sovereignty of evil is temporary; God’s judgment prevails. Court language highlights the liturgical and judicial dimension of salvation."
    },
    {
      "pk": 34007027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 27,
      "text": "And the kingdom and the dominion and the greatness of the kingdoms under the whole heaven shall be given to the people of the holy ones of the Most High; their kingdom shall be an everlasting kingdom, and all dominions shall serve and obey them.",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/66/22/5'>Rev. 22:5</a>",
      "comment": "Ultimate transfer of world dominion to God’s faithful. Note the eternal, universal nature of the kingdom—fulfilled in the worldwide, visible, apostolic Church."
    },
    {
      "pk": 34007028,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 7,
      "verse": 28,
      "text": "This is the end of the story. As for me, Daniel, my thoughts greatly troubled me, and my face grew pale; but I kept the matter in my heart.",
      "links": "<a href='/AIV/27/8/27'>Dan. 8:27</a>; <a href='/AIV/42/2/19'>Luke 2:19</a>",
      "comment": "Often, God’s revelations are pondered in the heart awaiting fuller understanding—compare Luke 2:19, where Mary treasures God’s word. Faith embraces mysteries even before full explanation."
    }
  ],
  "translatedAt": "2025-12-24T09:31:51.791Z"
}