{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 3,
  "verses": [
    {
      "pk": 34003001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 1,
      "text": "King Nebuchadnezzar made an image of gold, sixty cubits high and six cubits wide, and set it up on the plain of Dura, in the province of Babylon.",
      "links": "<a href='/AIV/27/2/31-32'>Dan. 2:31-32</a>",
      "comment": "Nebuchadnezzar's statue may reflect the dream interpretation in chapter 2. The image's dimensions emphasize its splendor and dominance, foreshadowing the test that follows."
    },
    {
      "pk": 34003002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 2,
      "text": "Then King Nebuchadnezzar summoned the satraps, prefects, governors, counselors, treasurers, judges, magistrates, and all the officials of the provinces to come to the dedication of the image which he had set up.",
      "links": "<a href='/AIV/27/6/1-2'>Dan. 6:1-2</a>",
      "comment": "The gathering of all political authorities shows the total demand for allegiance to the empire's authority, symbolized by the image."
    },
    {
      "pk": 34003003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 3,
      "text": "So the satraps, prefects, governors, counselors, treasurers, judges, magistrates, and all the officials of the provinces gathered for the dedication of the image that King Nebuchadnezzar had set up. They stood before the image that Nebuchadnezzar had set up.",
      "links": "<a href='/AIV/27/2/48-49'>Dan. 2:48-49</a>",
      "comment": "Every term is repeated for solemnity and to stress completeness. The universal authority of Nebuchadnezzar is on display."
    },
    {
      "pk": 34003004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 4,
      "text": "Then the herald loudly proclaimed, 'To you it is commanded, O peoples, nations, and languages,'",
      "links": "<a href='/AIV/27/4/1'>Dan. 4:1</a>",
      "comment": "This address to all peoples, languages and nations shows imperial universality, foreshadowing the eschatological vision of peoples worshipping God (see Rev. 7:9)."
    },
    {
      "pk": 34003005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 5,
      "text": "'At the moment you hear the sound of the horn, flute, lyre, harp, pipes, and every kind of music, you are to fall down and worship the golden image that King Nebuchadnezzar has set up.'",
      "links": "<a href='/AIV/27/6/7'>Dan. 6:7</a>",
      "comment": "The religious ritual is enforced on all, echoing later images in Revelation, which warns against idolatrous worship (Rev. 13:15)."
    },
    {
      "pk": 34003006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 6,
      "text": "'And whoever does not fall down and worship shall immediately be thrown into the midst of a burning fiery furnace.'",
      "links": "<a href='/AIV/27/6/16'>Dan. 6:16</a>",
      "comment": "A threat of execution for noncompliance. True worship of the one God often comes with a cost, as Christ promises (Matt. 10:22; John 15:18-19)."
    },
    {
      "pk": 34003007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 7,
      "text": "Therefore, as soon as all the peoples heard the sound of the horn, flute, lyre, harp, and every kind of music, all the peoples, nations, and languages fell down and worshipped the golden image that King Nebuchadnezzar had set up.",
      "links": "<a href='/AIV/27/3/4'>Dan. 3:4</a>",
      "comment": "The immediate obedience of the masses is contrasted with the faithful resistance of God's people."
    },
    {
      "pk": 34003008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 8,
      "text": "At that time certain Chaldeans came forward and accused the Jews.",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "Hostility toward the chosen people is a recurring scriptural theme, foreshadowing later persecutions (Acts 4:1-3)."
    },
    {
      "pk": 34003009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 9,
      "text": "They spoke and said to King Nebuchadnezzar, 'O king, live forever!'",
      "links": "<a href='/AIV/27/2/4'>Dan. 2:4</a>",
      "comment": "The formulaic court greeting displays their allegiance to earthly kingship over true worship."
    },
    {
      "pk": 34003010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 10,
      "text": "'You, O king, have made a decree, that every man who hears the sound of the horn, flute, lyre, harp, pipe, and every kind of music, shall fall down and worship the golden image,'",
      "links": "<a href='/AIV/27/3/5'>Dan. 3:5</a>",
      "comment": "The accusers, with subtle flattery, remind the king of his absolute law to set the trap for the faithful."
    },
    {
      "pk": 34003011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 11,
      "text": "'and whoever does not fall down and worship shall be cast into the midst of a burning fiery furnace.'",
      "links": "<a href='/AIV/27/3/6'>Dan. 3:6</a>",
      "comment": "They stress the king's enforced worship, paralleling later challenges to the faith faced by the Apostles (Acts 5:29)."
    },
    {
      "pk": 34003012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 12,
      "text": "'There are certain Jews, whom you have appointed over the affairs of the province of Babylon: Shadrach, Meshach, and Abednego. These men, O king, do not pay due regard to you. They do not serve your gods or worship the golden image you have set up.'",
      "links": "<a href='/AIV/27/1/7'>Dan. 1:7</a>; <a href='/AIV/27/2/49'>Dan. 2:49</a>",
      "comment": "The faithfulness of Shadrach, Meshach, and Abednego points to steadfastness even under pressure from earthly authorities—an important scriptural principle."
    },
    {
      "pk": 34003013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 13,
      "text": "Then Nebuchadnezzar, in rage and fury, commanded that Shadrach, Meshach, and Abednego be brought. So they brought these men before the king.",
      "links": "<a href='/AIV/27/2/12'>Dan. 2:12</a>",
      "comment": "Rage and fury reflect Nebuchadnezzar’s pride and intolerance for dissent—contrasted with God’s patience and justice."
    },
    {
      "pk": 34003014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 14,
      "text": "Nebuchadnezzar spoke and said to them, 'Is it true, Shadrach, Meshach, and Abednego, that you do not serve my gods or worship the golden image I have set up?'",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "The king offers them a chance to recant, implying he is aware of their faithfulness."
    },
    {
      "pk": 34003015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 15,
      "text": "'Now if you are ready, when you hear the sound of the horn, flute, lyre, harp, pipes, and every kind of music to fall down and worship the image I have made, well and good; but if you do not worship, you shall immediately be thrown into the midst of a burning fiery furnace. And who is the god that will deliver you out of my hands?'",
      "links": "<a href='/AIV/2/5/2'>Ex. 5:2</a>",
      "comment": "Nebuchadnezzar’s challenge, 'who is the god,' echoes Pharaoh’s pride in Exodus. In context, the question will point to a demonstration of the true God’s power."
    },
    {
      "pk": 34003016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 16,
      "text": "Shadrach, Meshach, and Abednego answered and said to the king, 'O Nebuchadnezzar, we have no need to answer you in this matter.'",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>",
      "comment": "They show unwavering trust, not even requiring to defend themselves—recalling Jesus' words not to worry about what to say under persecution (Matt. 10:19-20)."
    },
    {
      "pk": 34003017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 17,
      "text": "If it be so, our God whom we serve is able to deliver us from the burning fiery furnace, and He will deliver us out of your hand, O king.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/27/6/22'>Dan. 6:22</a>",
      "comment": "The confidence of God’s saving power has a typological connection to Christian martyrdom and the hope in resurrection (2 Macc. 7)."
    },
    {
      "pk": 34003018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 18,
      "text": "'But even if He does not, be it known to you, O king, that we will not serve your gods or worship the golden image that you have set up.'",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>",
      "comment": "Here, love and fear of God transcend fear of death—a preview of the Church’s teaching on steadfastness under trial."
    },
    {
      "pk": 34003019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 19,
      "text": "Then Nebuchadnezzar was filled with fury, and the expression on his face changed against Shadrach, Meshach, and Abednego. He commanded that the furnace be heated seven times more than it was usually heated.",
      "links": "<a href='/AIV/19/21/9'>Ps. 21:9</a>",
      "comment": "The excessive wrath of the king highlights the extremity of the trial, and ‘seven times’ underscores totality and perfection (see Lev. 26:18)."
    },
    {
      "pk": 34003020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 20,
      "text": "He ordered some of the strongest men in his army to bind Shadrach, Meshach, and Abednego and throw them into the burning fiery furnace.",
      "links": "<a href='/AIV/27/6/16'>Dan. 6:16</a>",
      "comment": "The drama is intensified by highlighting the futility of human strength against divine salvation."
    },
    {
      "pk": 34003021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 21,
      "text": "So they were bound in their cloaks, tunics, head coverings, and other garments, and were thrown into the burning fiery furnace.",
      "links": "",
      "comment": "Meticulous listing emphasizes the completeness and immediacy of the action and would have made their survival more conspicuous."
    },
    {
      "pk": 34003022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 22,
      "text": "Because the king’s order was urgent, and the furnace extremely hot, the flame killed those men who took up Shadrach, Meshach, and Abednego.",
      "links": "<a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "The irony is that those who obeyed the king’s command perished, contrasting earthly authority with God’s saving power."
    },
    {
      "pk": 34003023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 23,
      "text": "But these three men, Shadrach, Meshach, and Abednego, fell bound into the midst of the burning fiery furnace.",
      "links": "",
      "comment": "The scene sets up the miracle by emphasizing that they fell in fully bound and clothed."
    },
    {
      "pk": 34003024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 24,
      "text": "Then King Nebuchadnezzar was astonished and rose up in haste. He said to his counselors, 'Did we not throw three men bound into the fire?' They answered and said to the king, 'True, O king.'",
      "links": "",
      "comment": "The king’s shock begins the revelation of a supernatural presence in their deliverance."
    },
    {
      "pk": 34003025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 25,
      "text": "He answered, 'But I see four men loose, walking in the midst of the fire, and they are unharmed; and the appearance of the fourth is like a son of the gods.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/1/18/10'>Gen. 18:10</a>",
      "comment": "The fourth figure is traditionally interpreted as an angel, but there is also a strong tradition of seeing here a prefiguration of Christ’s presence even in the fire—a sign that God accompanies the faithful in their trials."
    },
    {
      "pk": 34003026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 26,
      "text": "Then Nebuchadnezzar went near the opening of the burning fiery furnace and said, 'Shadrach, Meshach, and Abednego, servants of the Most High God, come out, and come here!' So Shadrach, Meshach, and Abednego came out from the midst of the fire.",
      "links": "<a href='/AIV/27/4/2'>Dan. 4:2</a>",
      "comment": "Nebuchadnezzar’s title for God, 'Most High God', acknowledges God’s supremacy above all pagan gods."
    },
    {
      "pk": 34003027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 27,
      "text": "And the satraps, prefects, governors, and the king’s counselors gathered together and saw that the fire had no power over the bodies of those men; their hair was not singed, their cloaks were not harmed, and there was no smell of fire on them.",
      "links": "",
      "comment": "A complete deliverance. Similar miracles prefigure Christian resurrection, when the faithful will be protected and glorified beyond natural expectation (cf. 1 Cor. 15:42-44)."
    },
    {
      "pk": 34003028,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 28,
      "text": "Nebuchadnezzar spoke and said, 'Blessed be the God of Shadrach, Meshach, and Abednego, who has sent his angel and delivered his servants who trusted in him, and have defied the king’s command and yielded up their bodies, rather than serve or worship any god except their own God.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Offering one’s body for faith, as these men did, is echoed in the New Testament as a living sacrifice (Rom. 12:1)."
    },
    {
      "pk": 34003029,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 29,
      "text": "'Therefore I make a decree: Any people, nation, or language that speaks anything against the God of Shadrach, Meshach, and Abednego shall be cut in pieces, and their houses laid in ruins; for there is no other god who is able to save in this way.'",
      "links": "",
      "comment": "Nebuchadnezzar’s decree, though harsh by modern standards, underscores the uniqueness and power of Israel’s God."
    },
    {
      "pk": 34003030,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 30,
      "text": "Then the king promoted Shadrach, Meshach, and Abednego in the province of Babylon.",
      "links": "<a href='/AIV/27/2/48-49'>Dan. 2:48-49</a>",
      "comment": "Through faithfulness under trial comes exaltation, a foreshadowing of the Christian teaching that those who humble themselves for God will be exalted (Matt. 23:12; Phil. 2:8-9)."
    },
    {
      "pk": 34003031,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 31,
      "text": "And they walked about in the flames, singing to God and blessing the Lord.",
      "links": "<a href='/AIV/27/3/23-25'>Dan. 3:23-25 (Hebrew text)</a>; <a href='/AIV/19/22/3'>Ps. 22:3</a>",
      "comment": "This verse and the following ‘Song of the Three’ are found in the Septuagint and Latin Bible traditions, emphasizing the spiritual response of prayer and praise in adversity."
    },
    {
      "pk": 34003032,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 32,
      "text": "Then Azariah stood and prayed this prayer; he opened his mouth in the midst of the fire and said:",
      "links": "",
      "comment": "Azariah is the Hebrew name for Abednego, reflecting the continuity with his Jewish identity in prayer."
    },
    {
      "pk": 34003033,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 33,
      "text": "'Blessed are you, O Lord, God of our fathers, and worthy of praise; and your name is glorified forever.'",
      "links": "<a href='/AIV/19/113/2'>Ps. 113:2</a>",
      "comment": "Commences a liturgical prayer, reflecting the pattern of confession, praise, and trust in divine mercy—models for Christian worship."
    },
    {
      "pk": 34003034,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 34,
      "text": "'For you are just in all that you have done; all your works are true and your ways right, and all your judgments are truth.'",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "Proclaims God’s perfect justice—a foundational theme in Scripture."
    },
    {
      "pk": 34003035,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 35,
      "text": "'You have judged us according to truth, in all you have brought upon us and upon Jerusalem, the holy city of our fathers; for in truth and justice you have done all these things on account of our sins.'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Acknowledges sin and the justice of exile—significant for understanding both the Old Covenant curses (Deut. 28) and God’s mercy."
    },
    {
      "pk": 34003036,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 36,
      "text": "'For we have sinned and acted wickedly, departing from you.'",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "Evokes the biblical tradition of corporate confession, anticipating elements of the penitential rites in Christian worship."
    },
    {
      "pk": 34003037,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 37,
      "text": "'In everything you have done to us and to your holy city Jerusalem, you have dealt with true judgment, as you have brought all these things upon us for our sins.'",
      "links": "<a href='/AIV/16/9/33'>Neh. 9:33</a>",
      "comment": "Recognition that God’s chastisements are just foreshadows the New Testament call to self-examination and repentance (1 Cor. 11:31)."
    },
    {
      "pk": 34003038,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 38,
      "text": "'For we have sinned and broken your law, turning away from you. We have sinned in every circumstance, and have not obeyed your commandments or done as you commanded us, for our own good.'",
      "links": "<a href='/AIV/5/30/2'>Deut. 30:2</a>",
      "comment": "Sin is identified with disobedience, and the commands of God are revealed as given for humankind’s own benefit."
    },
    {
      "pk": 34003039,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 39,
      "text": "'Now, O Lord, our God, you have handed us over to our enemies, lawless and unjust, and to an unjust, rebellious king, the most evil in all the earth.'",
      "links": "",
      "comment": "The exile to Babylon is seen as both just discipline and a cry for Divine deliverance."
    },
    {
      "pk": 34003040,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 40,
      "text": "'Now we cannot open our mouths, disgrace and shame have come over your servants and your worshipers.'",
      "links": "",
      "comment": "A classic posture of humility and repentance before God, preparing for restoration."
    },
    {
      "pk": 34003041,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 41,
      "text": "'For your name’s sake, do not utterly forsake us, and do not break your covenant with us.'",
      "links": "<a href='/AIV/3/26/44'>Lev. 26:44-45</a>",
      "comment": "Appeal to God’s faithfulness to His covenant, a motif that underlies Christian trust in the new and everlasting covenant."
    },
    {
      "pk": 34003042,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 42,
      "text": "'Do not withdraw your mercy from us, for the sake of Abraham your beloved, Isaac your servant, and Israel your holy one,'",
      "links": "<a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "Confirms the power of intercessory prayer and the continuity of God’s promises through the patriarchs—a major biblical theme."
    },
    {
      "pk": 34003043,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 43,
      "text": "'to whom you promised to multiply their offspring as the stars of heaven, and as the sand that is beside the seashore.'",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "Restates Abrahamic covenant with metaphors used by both Old and New Testaments."
    },
    {
      "pk": 34003044,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 44,
      "text": "'We, O Lord, are reduced to the least among all nations, scattered and brought low because of our sins at this time.'",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "The litany of humility is reminiscent of Israel’s repeated exile and a pattern of spiritual exile and restoration."
    },
    {
      "pk": 34003045,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 45,
      "text": "'And there is at this time no prince, or prophet, or leader, or burnt offering, or sacrifice, or oblation, or incense, or place to offer before you and to find mercy.'",
      "links": "<a href='/AIV/28/3/4'>Hos. 3:4</a>",
      "comment": "Absence of sacrificial worship is keenly felt. This verse foreshadows hope for a new and spiritual offering, as fulfilled in the Christian age (Heb. 10:14)."
    },
    {
      "pk": 34003046,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 46,
      "text": "'But with a contrite heart and humble spirit may we be accepted, as though it were with burnt offerings of rams and bulls, and with tens of thousands of fat lambs; such may our sacrifice be in your presence today and may we wholly follow you, for there will be no shame for those who trust in you.'",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Spiritual sacrifice of the heart comes to the forefront; this resonates with the New Testament understanding of true worship (John 4:24; Rom. 12:1)."
    },
    {
      "pk": 34003047,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 47,
      "text": "'And now we follow you with our whole heart, we fear you and seek your face.'",
      "links": "<a href='/AIV/5/4/29'>Deut. 4:29</a>",
      "comment": "Echoes the primacy of love and interior devotion—Jesus would later teach that the greatest commandment is love of God with heart, soul, and strength (Mark 12:30)."
    },
    {
      "pk": 34003048,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 48,
      "text": "'Do not let us be put to shame but deal with us in your forbearance and in your abundant mercy.'",
      "links": "",
      "comment": "The prayer requests God’s compassion in light of human frailty, consistent with prophetic themes (Hos. 14:2-4)."
    },
    {
      "pk": 34003049,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 49,
      "text": "'Deliver us in accordance with your wondrous works, and give glory to your name, O Lord.'",
      "links": "<a href='/AIV/19/79/9'>Ps. 79:9</a>",
      "comment": "Deliverance is petitioned not for personal merit but for the hallowing of God’s name, as paralleled in the Lord’s Prayer (Matt. 6:9)."
    },
    {
      "pk": 34003050,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 50,
      "text": "Then the angel of the Lord descended into the furnace to be with Azariah and his companions and drove the fiery flame out of the furnace,",
      "links": "<a href='/AIV/2/3/2'>Ex. 3:2</a>",
      "comment": "The angel’s protective presence prefigures Christ’s constant presence with the Church in tribulation (Matt. 28:20)."
    },
    {
      "pk": 34003051,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 51,
      "text": "and made the midst of the furnace like a moist, whistling wind so that the fire did not touch them at all or cause them pain or harm.",
      "links": "",
      "comment": "This utterly miraculous rescinding of natural law is a strong biblical sign of God’s authority over creation."
    },
    {
      "pk": 34003052,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 52,
      "text": "Then the three, as with one mouth, praised and glorified and blessed God in the furnace, saying:",
      "links": "",
      "comment": "Corporate, united praise in adversity demonstrates the biblical model for communal worship."
    },
    {
      "pk": 34003053,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 53,
      "text": "'Blessed are you, O Lord, God of our fathers, and to be praised and highly exalted forever. And blessed is your glorious, holy name and to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Begins the 'Benedicite', a hymn of universal praise used in liturgical tradition."
    },
    {
      "pk": 34003054,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 54,
      "text": "'Blessed are you in the temple of your holy glory and to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/138/2'>Ps. 138:2</a>",
      "comment": "God’s presence in the Temple is remembered, while their location in exile points forward to God's presence with the worshiping assembly everywhere."
    },
    {
      "pk": 34003055,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 55,
      "text": "'Blessed are you who look into the depths and sit upon the cherubim, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/2/25/22'>Ex. 25:22</a>",
      "comment": "References God’s unique glory between the cherubim, recalling the Ark and the Temple. This imagery appears in Christian understanding of heavenly worship (Rev. 4:6-8)."
    },
    {
      "pk": 34003056,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 56,
      "text": "'Blessed are you on the throne of your kingdom, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/47/8'>Ps. 47:8</a>",
      "comment": "The throne and kingdom evoke both the sovereignty of God and messianic expectation."
    },
    {
      "pk": 34003057,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 57,
      "text": "'Blessed are you in the firmament of heaven, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/150/1'>Ps. 150:1</a>",
      "comment": "Universal sovereignty over all creation is asserted—a theme picked up throughout the New Testament."
    },
    {
      "pk": 34003058,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 58,
      "text": "'Bless the Lord, all you works of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": "All of creation is called to bless God, anticipating the cosmic worship in the New Testament (Rev. 5:13)."
    },
    {
      "pk": 34003059,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 59,
      "text": "'Bless the Lord, you heavens, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": "The litany continues to summon all creation to praise, showing an all-encompassing vision of worship."
    },
    {
      "pk": 34003060,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 60,
      "text": "'Bless the Lord, you angels of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/103/20'>Ps. 103:20</a>",
      "comment": "Even the angels are included, representing the unity of heaven and earth in worship (see Heb. 12:22)."
    },
    {
      "pk": 34003061,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 61,
      "text": "'Bless the Lord, all you waters above the sky, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/7'>Gen. 1:7</a>",
      "comment": ""
    },
    {
      "pk": 34003062,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 62,
      "text": "'Bless the Lord, all you powers of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003063,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 63,
      "text": "'Bless the Lord, sun and moon, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/16'>Gen. 1:16</a>",
      "comment": ""
    },
    {
      "pk": 34003064,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 64,
      "text": "'Bless the Lord, stars of heaven, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003065,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 65,
      "text": "'Bless the Lord, every shower and dew, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003066,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 66,
      "text": "'Bless the Lord, all winds, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003067,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 67,
      "text": "'Bless the Lord, fire and heat, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003068,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 68,
      "text": "'Bless the Lord, cold and chill, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003069,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 69,
      "text": "'Bless the Lord, dew and snow, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003070,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 70,
      "text": "'Bless the Lord, nights and days, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003071,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 71,
      "text": "'Bless the Lord, light and darkness, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003072,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 72,
      "text": "'Bless the Lord, ice and frost, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003073,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 73,
      "text": "'Bless the Lord, frost and cold, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003074,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 74,
      "text": "'Bless the Lord, hoarfrost and snow, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003075,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 75,
      "text": "'Bless the Lord, nights and days, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003076,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 76,
      "text": "'Bless the Lord, light and darkness, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003077,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 77,
      "text": "'Bless the Lord, lightning and clouds, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003078,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 78,
      "text": "'Let the earth bless the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": ""
    },
    {
      "pk": 34003079,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 79,
      "text": "'Bless the Lord, mountains and hills, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003080,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 80,
      "text": "'Bless the Lord, all things growing on the earth, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003081,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 81,
      "text": "'Bless the Lord, springs of water, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003082,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 82,
      "text": "'Bless the Lord, seas and rivers, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003083,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 83,
      "text": "'Bless the Lord, you whales and all that move in the waters, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003084,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 84,
      "text": "'Bless the Lord, all birds of the air, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003085,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 85,
      "text": "'Bless the Lord, all beasts and cattle, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003086,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 86,
      "text": "'Bless the Lord, sons of men, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": "Humanity is called to join creation in praising God—a foretaste of the fulfillment of man’s calling in Christ."
    },
    {
      "pk": 34003087,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 87,
      "text": "'Bless the Lord, Israel, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003088,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 88,
      "text": "'Bless the Lord, you priests of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>",
      "comment": "Emphasizes the importance of a priestly order in worship, as would later be further revealed in the history of salvation."
    },
    {
      "pk": 34003089,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 89,
      "text": "'Bless the Lord, you servants of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 34003090,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 90,
      "text": "'Bless the Lord, spirits and souls of the righteous, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/16/3'>Ps. 16:3</a>",
      "comment": "Acknowledges the spiritual communion of the faithful—anticipates teaching on the communion of saints."
    },
    {
      "pk": 34003091,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 91,
      "text": "'Bless the Lord, you holy and humble of heart, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/34/18'>Ps. 34:18</a>",
      "comment": "Humility and holiness are always linked as prerequisites for true worship."
    },
    {
      "pk": 34003092,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 92,
      "text": "'Bless the Lord, Hananiah, Azariah, and Mishael, sing praise to him and highly exalt him forever. For he has rescued us from Hades and saved us from the power of death, and he delivered us from the midst of the burning, flaming furnace; from the midst of the fire he rescued us.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "God’s rescue ‘from the power of death’ is a clear prototype for Christian salvation in Christ, who saves from the ultimate death."
    },
    {
      "pk": 34003093,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 93,
      "text": "'Give thanks to the Lord, for he is good, for his mercy endures forever.'",
      "links": "<a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "This refrain recurs throughout the Old Testament and in Christian liturgy, emphasizing God’s steadfast love."
    },
    {
      "pk": 34003094,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 94,
      "text": "'All you who worship the Lord, bless the God of gods, praise him and give him thanks, for his mercy endures forever.'",
      "links": "",
      "comment": "The song concludes with a universal call to worship the one true God."
    },
    {
      "pk": 34003095,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 95,
      "text": "Then King Nebuchadnezzar was astonished and rose up in haste. He said to his counselors, 'Did we not throw three men bound into the fire?' They answered and said, 'True, O king.'",
      "links": "<a href='/AIV/27/3/24'>Dan. 3:24</a>",
      "comment": "Text returns to the Aramaic. Repetition emphasizes the miraculous nature of what has just been witnessed."
    },
    {
      "pk": 34003096,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 96,
      "text": "He answered and said, 'But I see four men unbound, walking in the midst of the fire, and they are unhurt; and the appearance of the fourth is like a son of the gods.'",
      "links": "<a href='/AIV/27/3/25'>Dan. 3:25</a>",
      "comment": ""
    },
    {
      "pk": 34003097,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 97,
      "text": "Then Nebuchadnezzar approached the opening of the fiery furnace and said, 'Shadrach, Meshach, and Abednego, servants of the Most High God, come out and come here.' So Shadrach, Meshach, and Abednego came out from the fire.",
      "links": "<a href='/AIV/27/3/26'>Dan. 3:26</a>",
      "comment": ""
    },
    {
      "pk": 34003098,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 98,
      "text": "The satraps, prefects, governors, and the king’s counselors gathered together and saw that the fire had not touched the bodies of those men, nor was the hair of their heads singed, their cloaks unchanged, and no smell of fire on them.",
      "links": "<a href='/AIV/27/3/27'>Dan. 3:27</a>",
      "comment": ""
    },
    {
      "pk": 34003099,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 99,
      "text": "Nebuchadnezzar said, 'Blessed be the God of Shadrach, Meshach, and Abednego, who has sent his angel and delivered his servants that trusted in him and defied the king’s command, and yielded up their bodies rather than serve or worship any god except their own God.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>",
      "comment": "The king’s acknowledgment again points to the unique power and glory of the God of Israel."
    },
    {
      "pk": 34003100,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 100,
      "text": "'Therefore I make a decree: that any people, nation, or language who say anything against the God of Shadrach, Meshach, and Abednego shall be torn limb from limb, and their houses laid in ruins, because there is no other god who is able to save in this way.'",
      "links": "<a href='/AIV/27/3/29'>Dan. 3:29</a>",
      "comment": "The story closes with broad recognition of God’s saving power. The witness of the faithful is vindicated before the world."
    }
  ],
  "translatedAt": "2025-12-24T09:29:42.290Z"
}