{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 10,
  "verses": [
    {
      "pk": 34010001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 1,
      "text": "In the third year of Cyrus king of Persia, a message was revealed to Daniel, who was called Belteshazzar. The message was true and concerned a great conflict. He understood the message and had understanding of the vision.",
      "links": "<a href='/AIV/15/1/1'>Ezra 1:1</a>; <a href='/AIV/27/1/7'>Dan. 1:7</a>",
      "comment": "The vision occurs during the reign of Cyrus, marking the final years of Israel's exile. The theme of 'a great conflict' prefigures spiritual struggle (Eph 6:12). Daniel's clarity in understanding echoes the gift of wisdom and illumination from God."
    },
    {
      "pk": 34010002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 2,
      "text": "In those days, I, Daniel, was mourning for three full weeks.",
      "links": "<a href='/AIV/27/9/3'>Dan. 9:3</a>",
      "comment": "Daniel's mourning and fasting for three weeks reflect persistent prayer and penitence, similar to biblical practices of deep repentance and intercession for God's people. This period also foreshadows Christ’s forty days in the wilderness."
    },
    {
      "pk": 34010003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 3,
      "text": "I ate no rich food, no meat or wine entered my mouth, and I did not anoint myself at all for the full three weeks.",
      "links": "<a href='/AIV/27/1/8-12'>Dan. 1:8-12</a>",
      "comment": "Daniel’s abstinence demonstrates the value of fasting and self-denial as preparation for receiving God’s message, much like spiritual disciplines recommended in the tradition of the early Church."
    },
    {
      "pk": 34010004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 4,
      "text": "On the twenty-fourth day of the first month, while I was standing on the bank of the great river—that is, the Tigris—",
      "links": "<a href='/AIV/13/26/5'>1 Chr. 26:5</a>",
      "comment": "The vision is dated precisely. This careful attention to sacred time anticipates the order and rhythm of liturgical celebrations, with its appointed feasts and fasts."
    },
    {
      "pk": 34010005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 5,
      "text": "I lifted up my eyes and looked, and behold, there was a man clothed in linen, whose waist was girded with the gold of Uphaz.",
      "links": "<a href='/AIV/27/8/15-16'>Dan. 8:15-16</a>; <a href='/AIV/66/1/13-15'>Rev. 1:13-15</a>",
      "comment": "The figure in linen resembles heavenly beings (see Rev. 1:13-15). Linen garments signify purity, often worn by priests, hinting at angelic intercession and priestly mediation."
    },
    {
      "pk": 34010006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 6,
      "text": "His body was like beryl, his face shone like lightning, his eyes were like flaming torches, his arms and legs gleamed like polished bronze, and the sound of his words was like the roar of a great multitude.",
      "links": "<a href='/AIV/26/1/13-16'>Ezek. 1:13-16</a>; <a href='/AIV/66/1/14-15'>Rev. 1:14-15</a>",
      "comment": "The description matches the overwhelming glory of angelic encounters and hints further at Theophany—manifestations of God, which find their fullness in the Incarnation (see John 1:14; Rev. 1:14-15)."
    },
    {
      "pk": 34010007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 7,
      "text": "I, Daniel, alone saw the vision, for the men who were with me did not see it; but great trembling fell upon them, and they ran away and hid themselves.",
      "links": "<a href='/AIV/44/9/7'>Acts 9:7</a>",
      "comment": "Not everyone present perceives the vision, showing the necessity of spiritual openness to divine revelation. This parallels Paul’s conversion experience (Acts 9:7)."
    },
    {
      "pk": 34010008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 8,
      "text": "So I was left alone and saw this great vision, and no strength was left in me; my face grew deathly pale, and I had no strength.",
      "links": "<a href='/AIV/27/8/27'>Dan. 8:27</a>",
      "comment": "Encounters with God or his messengers in Scripture often leave people overwhelmed or prostrate (Dan. 8:27). The experience reveals human frailty before divine majesty and power."
    },
    {
      "pk": 34010009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 9,
      "text": "Then I heard the sound of his words, and as I heard the sound of his words, I fell into a deep sleep with my face to the ground.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>; <a href='/AIV/22/5/2'>Song 5:2</a>",
      "comment": "Daniel’s falling as if in a deep sleep is reminiscent of prophetic ecstasy or spiritual vision—God’s initiative rather than simply human effort (cf. Gen. 2:21, Acts 10:10)."
    },
    {
      "pk": 34010010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 10,
      "text": "Then a hand touched me and set me trembling on my hands and knees.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>; <a href='/AIV/66/1/17'>Rev. 1:17</a>",
      "comment": "Physical contact from an angel is rare and serves to strengthen. This divine strengthening is echoed in Christ’s touch and the laying on of hands as a means of imparting grace (see Rev. 1:17, Mark 1:41)."
    },
    {
      "pk": 34010011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 11,
      "text": "He said to me, 'Daniel, you are greatly beloved. Understand the words that I speak to you, and stand upright, for now I have been sent to you.' When he had spoken this word to me, I stood up trembling.",
      "links": "<a href='/AIV/27/9/23'>Dan. 9:23</a>; <a href='/AIV/42/1/28-30'>Luke 1:28-30</a>",
      "comment": "Daniel is called 'greatly beloved,' an honorific echoed in greetings to Mary ('full of grace,' Luke 1:28-30). God’s favor extends through chosen vessels to bless his people."
    },
    {
      "pk": 34010012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 12,
      "text": "Then he said to me, 'Do not be afraid, Daniel, for from the first day that you set your heart to understand and humble yourself before your God, your words were heard, and I have come because of your words.'",
      "links": "<a href='/AIV/27/9/20-23'>Dan. 9:20-23</a>; <a href='/AIV/58/11/6'>Heb. 11:6</a>",
      "comment": "Persevering prayer is powerful and heard by God. Daniel’s humility activates God’s response, resembling promises given about prayer throughout Scripture (James 5:16; Heb. 11:6)."
    },
    {
      "pk": 34010013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 13,
      "text": "But the prince of the kingdom of Persia withstood me for twenty-one days, but Michael, one of the chief princes, came to help me, for I was left there with the kings of Persia.",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/65/1/9'>Jude 1:9</a>; <a href='/AIV/66/12/7'>Rev. 12:7</a>",
      "comment": "The spiritual 'prince' indicates angelic beings appointed over nations and cosmic spiritual conflict, drawing on themes of spiritual warfare (see Rev. 12:7, Eph. 6:12). Michael’s role as protector of God’s people has significant implications for the understanding of angelic intercession and the hierarchy of heaven."
    },
    {
      "pk": 34010014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 14,
      "text": "'Now I have come to explain to you what shall happen to your people in the latter days, for the vision concerns days yet to come.'",
      "links": "<a href='/AIV/27/2/28'>Dan. 2:28</a>; <a href='/AIV/27/8/17'>Dan. 8:17</a>",
      "comment": "The message pertains to the 'latter days', connecting to the Messianic era and the prophetic expectation of God’s ultimate intervention. The wider horizon includes not just earthly kingdoms but the coming of God’s Kingdom in fullness (Acts 1:7)."
    },
    {
      "pk": 34010015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 15,
      "text": "When he spoke to me according to these words, I turned my face toward the ground and was speechless.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>",
      "comment": "Daniel’s humility and his being left speechless echo Ezekiel’s prophetic responses (Ezek. 1:28), expressing the proper awe before God’s mysteries and the limits of human understanding."
    },
    {
      "pk": 34010016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 16,
      "text": "And behold, one in the likeness of the sons of man touched my lips. Then I opened my mouth and spoke, saying to the one who stood before me, 'My lord, because of the vision, pains have come upon me, and I have no strength.'",
      "links": "<a href='/AIV/23/6/6-7'>Isa. 6:6-7</a>; <a href='/AIV/27/7/13'>Dan. 7:13</a>",
      "comment": "A heavenly being—perhaps an angel—touches Daniel’s lips, paralleling Isaiah’s vision (Isa. 6:6-7; note typological links to the title 'son of man' in Dan. 7:13). Heaven’s touch enables the prophet to speak, prefiguring God’s preparation of his messengers."
    },
    {
      "pk": 34010017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 17,
      "text": "'How can my lord's servant talk with my lord? For now no strength remains in me, and no breath is left in me.'",
      "links": "<a href='/AIV/23/6/5'>Isa. 6:5</a>; <a href='/AIV/27/8/18'>Dan. 8:18</a>",
      "comment": "Daniel’s admission of weakness is met by divine empowerment. Such encounters prefigure the poverty of spirit that finds its fulfillment in Christ (Matt. 5:3), as well as the Church’s teaching on grace’s necessity."
    },
    {
      "pk": 34010018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 18,
      "text": "Then again one having the appearance of a man touched me and strengthened me.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>; <a href='/AIV/66/1/17'>Rev. 1:17</a>",
      "comment": "The repeated strengthening by an angel highlights the necessity of heavenly aid for accomplishing God’s purposes, which has a parallel in the Church’s sacramental life."
    },
    {
      "pk": 34010019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 19,
      "text": "He said, 'O man greatly beloved, do not fear. Peace be with you; be strong and very courageous.' As he spoke to me, I was strengthened and said, 'Let my lord speak, for you have strengthened me.'",
      "links": "<a href='/AIV/06/1/9'>Josh. 1:9</a>; <a href='/AIV/43/20/19'>John 20:19</a>",
      "comment": "The angel’s words recall the promised peace and courage given by God throughout Scripture (Josh. 1:9; John 20:19, 'Peace be with you'). The supernatural strengthening prefigures Christ strengthening his disciples."
    },
    {
      "pk": 34010020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 20,
      "text": "Then he said, 'Do you know why I have come to you? Now I must return to fight against the prince of Persia; and when I go out, behold, the prince of Greece will come.'",
      "links": "<a href='/AIV/27/8/21'>Dan. 8:21</a>; <a href='/AIV/27/11/2'>Dan. 11:2</a>",
      "comment": "Angelic conflict corresponds with historical shifts in world empires, yet the unseen spiritual battle governs history. The interplay of earthly and heavenly realities echoes the Church’s teaching on cooperation between the visible and invisible realms."
    },
    {
      "pk": 34010021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 10,
      "verse": 21,
      "text": "But I will tell you what is written in the Book of Truth. There is none who contends at my side against these except Michael, your prince.",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/66/12/7'>Rev. 12:7</a>",
      "comment": "The 'Book of Truth' may allude to God’s eternal plan or heavenly decree. Michael’s special guardianship of God’s people shows the lasting role of angelic intercession, a reality and source of hope for all believers."
    }
  ],
  "translatedAt": "2025-12-24T09:33:29.549Z"
}