{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 8,
  "verses": [
    {
      "pk": 37008001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 1,
      "text": "This is what the Lord GOD showed me: behold, a basket of ripe summer fruit.",
      "links": "<a href='/AIV/37/7/1'>Amos 7:1</a>; <a href='/AIV/24/24/2'>Jer. 24:2</a>",
      "comment": "The imagery of the basket of fruit symbolizes the imminent end—just as summer fruit is ready to be consumed, Israel is ripe for judgment. The use of 'showed me' continues the visionary pattern from previous chapters."
    },
    {
      "pk": 37008002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 2,
      "text": "He said, 'Amos, what do you see?' And I said, 'A basket of ripe fruit.' Then the LORD said to me, 'The end has come upon my people Israel; I will not pass by them again.'",
      "links": "<a href='/AIV/37/7/8'>Amos 7:8</a>; <a href='/AIV/02/12/12'>Exod. 12:12</a>",
      "comment": "God’s declaration, 'I will not pass by them again,' marks a final end to mercy—echoing the severity found in the Passover judgment (Exod. 12). This moment foreshadows that persistent rejection brings about divine justice."
    },
    {
      "pk": 37008003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 3,
      "text": "The songs of the temple will become wailing on that day, declares the Lord GOD. Many dead bodies, thrown everywhere. Silence.",
      "links": "<a href='/AIV/23/13/12'>Isa. 13:12</a>; <a href='/AIV/19/137/1'>Ps. 137:1</a>",
      "comment": "Worship gives way to mourning—an inversion of sacred joy. The mention of many corpses shows the totality of the judgment. The silence underlines the awe and dread before God’s presence, reminiscent of apocalyptic imagery elsewhere."
    },
    {
      "pk": 37008004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 4,
      "text": "Hear this, you who trample on the needy and bring ruin to the poor of the land:",
      "links": "<a href='/AIV/37/2/6-7'>Amos 2:6-7</a>; <a href='/AIV/20/22/22-23'>Prov. 22:22-23</a>",
      "comment": "This verse brings out God’s concern for social justice, which is a recurring theme prophetically and in apostolic teaching. The condemnation of economic oppression points toward the principle of mercy and care found throughout Scripture."
    },
    {
      "pk": 37008005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 5,
      "text": "'Saying, “When will the new moon be over, so that we may sell grain? And the Sabbath, so we may open the wheat market—making the ephah small and the shekel great, and cheating with dishonest scales,”'",
      "links": "<a href='/AIV/03/19/35-36'>Lev. 19:35-36</a>; <a href='/AIV/37/4/4-5'>Amos 4:4-5</a>",
      "comment": "This exposes the hypocrisy of those outwardly keeping religious observances but longing to resume dishonest business. It shows how rote ritual without genuine faith can lead to injustice—a warning for all believers to unite faith with works."
    },
    {
      "pk": 37008006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 6,
      "text": "Buying the poor for silver, and the needy for a pair of sandals, and selling the sweepings of the wheat.",
      "links": "<a href='/AIV/37/2/6'>Amos 2:6</a>; <a href='/AIV/03/25/39'>Lev. 25:39</a>",
      "comment": "This verse underlines grave economic injustice and disregard for human dignity—echoed in repeated biblical warnings regarding care for the marginalized. There is a call for true justice rooted in transformative worship."
    },
    {
      "pk": 37008007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 7,
      "text": "The LORD has sworn by the pride of Jacob: 'Surely I will never forget any of their deeds.'",
      "links": "<a href='/AIV/37/6/8'>Amos 6:8</a>; <a href='/AIV/19/98/2-3'>Ps. 98:2-3</a>",
      "comment": "When God swears by the pride of Jacob, it intensifies the certainty of His judgment. The assurance that evil deeds are remembered serves as a sober warning—pointing ahead to eschatological accountability and the need for sacramental reconciliation."
    },
    {
      "pk": 37008008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 8,
      "text": "Will not the land tremble for this, and everyone mourn who lives in it, and all of it rise like the Nile, be tossed about and sink again like the Nile of Egypt?",
      "links": "<a href='/AIV/37/9/5'>Amos 9:5</a>; <a href='/AIV/02/7/20-21'>Exod. 7:20-21</a>",
      "comment": "The earth trembling and rising like the Nile depicts cosmic consequences for human sin—a theme present in prophetic and apostolic writings. Mourning and upheaval are both literal and symbolic, pointing to spiritual realities affecting the whole creation."
    },
    {
      "pk": 37008009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 9,
      "text": "'And on that day,' declares the Lord GOD, 'I will make the sun go down at noon and darken the earth in broad daylight.'",
      "links": "<a href='/AIV/02/10/22'>Exod. 10:22</a>; <a href='/AIV/40/27/45'>Matt. 27:45</a>",
      "comment": "A supernatural darkness in broad daylight links directly to the darkness at Christ's crucifixion (Matt. 27:45): a sign of judgment and fulfillment of prophecy. This verse allows for both literal and typological readings pointing to God's sovereignty."
    },
    {
      "pk": 37008010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 10,
      "text": "I will turn your feasts into mourning and all your songs into lamentation; I will bring sackcloth upon every waist and baldness on every head; I will make it like the mourning for an only son, and the end of it will be a bitter day.",
      "links": "<a href='/AIV/24/6/26'>Jer. 6:26</a>; <a href='/AIV/19/30/11'>Ps. 30:11</a>",
      "comment": "The loss of an 'only son' intensifies the grief—a poignant foreshadowing of the New Testament language for Christ in unique relationship to the Father. The mourning is total, a reversal of joy to sorrow, echoing penitential practices prescribed in holy tradition."
    },
    {
      "pk": 37008011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 11,
      "text": "'Behold, the days are coming,' declares the Lord GOD, 'when I will send a famine on the land—not a famine of bread, nor a thirst for water, but of hearing the words of the LORD.'",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>; <a href='/AIV/40/4/4'>Matt. 4:4</a>",
      "comment": "The prophetic announcement of a spiritual famine has deep christological resonance—the Word of God is the ultimate sustenance (Deut. 8:3; Matt. 4:4). Spiritual deprivation points to the necessity of searching for God in both word and sacrament."
    },
    {
      "pk": 37008012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 12,
      "text": "They will wander from sea to sea and from north to east; they will run to and fro to seek the word of the LORD, but shall not find it.",
      "links": "<a href='/AIV/19/107/4-5'>Ps. 107:4-5</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "The desperate search for God’s word, left unsatisfied, highlights the privilege of access to divine revelation found in the fullness of apostolic tradition. Physical wandering reflects spiritual alienation, underscoring the need to be incorporated into the true Church."
    },
    {
      "pk": 37008013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 13,
      "text": "In that day, the lovely virgins and the young men shall faint from thirst.",
      "links": "<a href='/AIV/23/40/30'>Isa. 40:30</a>; <a href='/AIV/19/63/1'>Ps. 63:1</a>",
      "comment": "Even youth and beauty offer no rescue from the judgment caused by spiritual drought. The image recalls New Testament emphasis on spiritual thirst quenched only by Christ (see John 4:14), connecting to themes of grace in sacred rites."
    },
    {
      "pk": 37008014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 8,
      "verse": 14,
      "text": "Those who swear by the guilt of Samaria, and say, 'As your god lives, O Dan,' and, 'As the way of Beersheba lives,' they shall fall and never rise again.",
      "links": "<a href='/AIV/11/12/29-30'>1 Kings 12:29-30</a>; <a href='/AIV/28/4/15'>Hos. 4:15</a>",
      "comment": "Idolatrous devotion ends in destruction. Dan and Beersheba were sites of alternate worship apart from Jerusalem, representing schism and error—the call is for unity under the one true worship endorsed by God, foreshadowing the singular apostolic community established by Christ."
    }
  ],
  "translatedAt": "2025-12-24T09:44:53.229Z"
}