{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 2,
  "verses": [
    {
      "pk": 37002001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 1,
      "text": "This is what the LORD says: 'For three transgressions of Moab, even for four, I will not turn back their punishment, because he burned to lime the bones of the king of Edom.'",
      "links": "<a href='/AIV/24/48/1'>Jer. 48:1</a>; <a href='/AIV/12/3/26-27'>2 Kgs. 3:26-27</a>",
      "comment": "The formula 'for three transgressions, even for four' is a Hebrew idiom indicating repeated and overflowing sin (see Amos 1:3). Moab's sin of desecrating a king's remains shows the gravity of disrespect for human dignity and the seriousness with which God takes justice."
    },
    {
      "pk": 37002002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 2,
      "text": "So I will send fire on Moab, and it will devour the citadels of Kerioth, and Moab will die amid uproar, with a shout, with the sound of the trumpet.",
      "links": "<a href='/AIV/24/48/41'>Jer. 48:41</a>; <a href='/AIV/09/4/5'>1 Sam. 4:5</a>",
      "comment": "Fire is often used as a symbol of divine judgment (see Amos 1:7). Kerioth was a major city in Moab. The trumpet symbolizes warfare and finality. Divine justice is presented as both immediate and total."
    },
    {
      "pk": 37002003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 3,
      "text": "I will cut off the ruler from its midst, and kill all its princes with him,' says the LORD.",
      "links": "<a href='/AIV/24/48/7'>Jer. 48:7</a>",
      "comment": "Judgment includes not only common people, but the leaders and those responsible for the nation's sins. God holds those who rule to a higher account (cf. Jas. 3:1)."
    },
    {
      "pk": 37002004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 4,
      "text": "This is what the LORD says: 'For three transgressions of Judah, even for four, I will not turn back their punishment, because they have rejected the law of the LORD and have not kept His statutes, but their lies have led them astray, those after which their fathers walked.'",
      "links": "<a href='/AIV/15/9/13-14'>Ezra 9:13-14</a>; <a href='/AIV/24/16/19-20'>Jer. 16:19-20</a>",
      "comment": "Unlike previous judgments against Gentile nations, Judah's sin is specifically tied to their rejection of God's revealed law. The reference to 'their lies' recalls false teachings and idolatry."
    },
    {
      "pk": 37002005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 5,
      "text": "So I will send fire upon Judah, and it will devour the citadels of Jerusalem.'",
      "links": "<a href='/AIV/25/4/11'>Lam. 4:11</a>; <a href='/AIV/10/22/8-9'>2 Sam. 22:8-9</a>",
      "comment": "Judgment against God's chosen people signifies the impartiality of God. The destruction of Jerusalem would become reality in 586 BC. God's Church is held to a high standard due to its possession of divine revelation."
    },
    {
      "pk": 37002006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 6,
      "text": "This is what the LORD says: 'For three transgressions of Israel, even for four, I will not turn back their punishment, because they sell the righteous for silver and the needy for a pair of sandals.'",
      "links": "<a href='/AIV/30/8/6'>Amos 8:6</a>; <a href='/AIV/01/37/28'>Gen. 37:28</a>",
      "comment": "The charge against Israel exposes their social injustice and oppression of the poor. The motif of 'selling for silver' is reminiscent of both Joseph's betrayal and ultimately Judas betraying Christ (cf. Matt. 26:15)."
    },
    {
      "pk": 37002007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 7,
      "text": "They trample the heads of the poor into the dust of the earth, and turn aside the way of the humble; a man and his father go in to the same girl, so that they profane My holy name.",
      "links": "<a href='/AIV/03/18/7'>Lev. 18:7</a>; <a href='/AIV/28/4/14'>Hos. 4:14</a>",
      "comment": "Injustice and sexual sin are combined as offenses against God. The phrase 'profane My holy name' implies that even sins against people are sins against God—and that the Chosen People are called to a higher holiness and purity."
    },
    {
      "pk": 37002008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 8,
      "text": "They lie down beside every altar on garments taken in pledge, and in the house of their God they drink the wine of those who have been fined.'",
      "links": "<a href='/AIV/03/6/1-7'>Lev. 6:1-7</a>; <a href='/AIV/05/24/12-13'>Deut. 24:12-13</a>",
      "comment": "The condemnation here stresses religious hypocrisy—worshipping even as they oppress. The use of 'altar' alludes to improper worship practices. The demands for justice and restitution were always central to right worship."
    },
    {
      "pk": 37002009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 9,
      "text": "Yet I destroyed the Amorite before them, whose height was like the height of cedars and who was as strong as the oaks; yet I destroyed his fruit above and his roots below.",
      "links": "<a href='/AIV/04/13/28-33'>Num. 13:28-33</a>; <a href='/AIV/05/1/28'>Deut. 1:28</a>",
      "comment": "God reminds Israel of His mighty works and the totality of His deliverance. The 'fruit above and roots below' is a Hebrew way of expressing complete destruction. God's chosen people are expected to remain faithful in gratitude for redemption."
    },
    {
      "pk": 37002010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 10,
      "text": "Also I brought you up out of the land of Egypt and led you forty years in the wilderness, to possess the land of the Amorite.",
      "links": "<a href='/AIV/02/12/51'>Exod. 12:51</a>; <a href='/AIV/05/8/2'>Deut. 8:2</a>",
      "comment": "This verse highlights salvation history. The forty years in the wilderness are a time of purification, much like periods of spiritual formation in the Christian life (cf. Matt. 4:1-2 for Christ's forty days in the desert, a fulfillment of Israel's journey)."
    },
    {
      "pk": 37002011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 11,
      "text": "And I raised up some of your sons as prophets, and some of your young men as Nazirites. Is this not indeed so, you people of Israel?' says the LORD.",
      "links": "<a href='/AIV/04/6/2'>Num. 6:2</a>; <a href='/AIV/28/9/7'>Hos. 9:7</a>",
      "comment": "Prophets and Nazirites represent distinct consecrated callings within the people of God, prefiguring later ministerial and ascetical lives in the Church. God continually calls particular individuals to special vocations for the good of all."
    },
    {
      "pk": 37002012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 12,
      "text": "But you made the Nazirites drink wine, and commanded the prophets saying, 'Do not prophesy!'",
      "links": "<a href='/AIV/30/7/12-13'>Amos 7:12-13</a>; <a href='/AIV/24/20/9'>Jer. 20:9</a>",
      "comment": "Israel opposes the means of its own sanctification: they corrupt the holy (Nazirites) and silence the word of God (prophets). Rejecting legitimate authority and guidance is a persistent danger in God’s people."
    },
    {
      "pk": 37002013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 13,
      "text": "Behold, I will press you down in your place, as a cart full of sheaves presses down.",
      "links": "<a href='/AIV/25/1/14'>Lam. 1:14</a>",
      "comment": "The image conveys crushing judgment and inescapable consequence for sin. The pressing motif echoes the imagery of God’s wrath (cf. Isa. 63:3, Rev. 14:19-20)."
    },
    {
      "pk": 37002014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 14,
      "text": "Flight will perish from the swift; the strong shall not strengthen his force, nor shall the mighty save himself.",
      "links": "<a href='/AIV/19/33/16-17'>Ps. 33:16-17</a>",
      "comment": "No human strength or ability provides escape from divine judgment. Only God’s mercy and protection endure. This anticipates the theme of salvation through deliverance by God alone."
    },
    {
      "pk": 37002015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 15,
      "text": "He who handles the bow will not stand, and he who is swift on foot will not escape, nor will he who rides the horse save his life.",
      "links": "<a href='/AIV/24/12/5'>Jer. 12:5</a>",
      "comment": "No external means of power—military skill or speed—saves from God's coming justice. The focus of restoration in the Bible is always God’s gracious initiative."
    },
    {
      "pk": 37002016,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 2,
      "verse": 16,
      "text": "Even the bravest among the warriors will flee naked on that day,' declares the LORD.",
      "links": "<a href='/AIV/30/9/1-2'>Amos 9:1-2</a>; <a href='/AIV/07/6/11'>Judg. 6:11</a>",
      "comment": "The humiliation of the warriors points to the futility of trusting in one’s own strength and the necessity of humility before God. The theme of nakedness and shame is woven through the Bible, culminating in the restoration and covering found in Christ (cf. Gen. 3:21, Rev. 3:18)."
    }
  ],
  "translatedAt": "2025-12-24T09:42:10.652Z"
}