{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 7,
  "verses": [
    {
      "pk": 37007001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 1,
      "text": "This is what the Lord God showed me: He was forming locust swarms when the spring crop began to sprout—after the king’s mowing.",
      "links": "<a href='/AIV/02/10/13-15'>Ex. 10:13-15</a>; <a href='/AIV/02/09/3-6'>Ex. 9:3-6</a>",
      "comment": "Amos receives a prophetic vision. Locusts symbolize divine judgment, as in Exodus. The timing after the king's mowing likely refers to a delayed, severe judgment affecting common people after the king claims his share. Note the direct intervention of God as 'forming', showing His sovereign authority."
    },
    {
      "pk": 37007002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 2,
      "text": "When they had finished eating the grass of the land, I said, 'Lord GOD, please forgive! How will Jacob stand? He is so small.'",
      "links": "<a href='/AIV/19/106/23'>Ps. 106:23</a>; <a href='/AIV/02/32/11-14'>Ex. 32:11-14</a>",
      "comment": "Amos intercedes for Israel (‘Jacob’), mirroring the intercessory roles of Moses (Exodus 32) and the Psalmist. It demonstrates the importance of mediation and prayer as a means for God's mercy to be extended, which prefigures the role of Christ as our mediator (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 37007003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 3,
      "text": "The LORD relented concerning this. 'It shall not happen,' said the LORD.",
      "links": "<a href='/AIV/23/38/5'>Isa. 38:5</a>; <a href='/AIV/32/3/10'>Jon. 3:10</a>",
      "comment": "God's relenting shows a relational aspect—He listens to the intercession of the righteous. Compare with Jonah 3:10, revealing that judgment can be stayed through repentance and prayer. This theme points to the power of true intercessors and communal repentance."
    },
    {
      "pk": 37007004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 4,
      "text": "This is what the Lord GOD showed me: The Lord GOD was calling for a judgment by fire, and it devoured the great deep and was consuming the land.",
      "links": "<a href='/AIV/02/09/23-25'>Ex. 9:23-25</a>; <a href='/AIV/19/66/12'>Ps. 66:12</a>",
      "comment": "Fire here signifies an even greater judgment than locusts—destructive and all-consuming. The 'great deep' is often associated with chaos or the abyss, hinting at judgment affecting creation order itself. Compare with Sodom and Gomorrah (Gen. 19:24)."
    },
    {
      "pk": 37007005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 5,
      "text": "Then I said, 'Lord GOD, please stop! How will Jacob stand? He is so small.'",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/24/10/24'>Jer. 10:24</a>",
      "comment": "Amos again takes up his priestly intercessory role, pleading for mercy not merely for survival but also for restoration. Humility (“he is so small”) is underlined as a necessary disposition for repentance and prayer. This anticipation of a faithful intercessor highlights the future perfect intercession of Christ."
    },
    {
      "pk": 37007006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 6,
      "text": "The LORD relented concerning this as well. 'This also shall not happen,' said the Lord GOD.",
      "links": "<a href='/AIV/24/18/8'>Jer. 18:8</a>; <a href='/AIV/19/106/23'>Ps. 106:23</a>",
      "comment": "Again, God listens to His prophet. The repetition emphasizes God’s patience and readiness to forgive when moved by sincere prayer. This practice of interceding for the sinful is important in the spiritual life of believers."
    },
    {
      "pk": 37007007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 7,
      "text": "This is what He showed me: The Lord was standing beside a wall built with a plumb line, with a plumb line in His hand.",
      "links": "<a href='/AIV/23/28/17'>Isa. 28:17</a>; <a href='/AIV/24/31/39-40'>Jer. 31:39-40</a>",
      "comment": "The plumb line symbolizes God's standard of righteousness and justice. The wall built 'true to plumb' is a metaphor for the people’s alignment (or lack thereof) to God’s law. The Lord as builder reflects God's authority to both build and judge His people, and hints at the Church as a spiritual temple (<a href='/AIV/60/2/5'>1 Pet. 2:5</a>)."
    },
    {
      "pk": 37007008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 8,
      "text": "And the LORD said to me, 'Amos, what do you see?' I said, 'A plumb line.' Then the Lord said, 'See, I am setting a plumb line among my people Israel; I will spare them no longer.'",
      "links": "<a href='/AIV/23/34/5'>Isa. 34:5</a>; <a href='/AIV/19/78/59'>Ps. 78:59</a>",
      "comment": "God's patience has limits. The plumb line is now not just a standard for measurement, but a tool for judgment. God’s refusal to spare means the time for repentance has ended, resembling themes in the Gospels about judgment on unfruitful people (Luke 13:6-9)."
    },
    {
      "pk": 37007009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 9,
      "text": "The high places of Isaac shall be made desolate, and the sanctuaries of Israel shall be laid waste. I will rise against the house of Jeroboam with the sword.'",
      "links": "<a href='/AIV/02/34/13'>Ex. 34:13</a>; <a href='/AIV/11/13/2'>1 Kings 13:2</a>",
      "comment": "The 'high places' and 'sanctuaries' refer to unauthorized places of worship. God will bring desolation for the sake of pure worship. Judgment against Jeroboam—a king who promoted false worship—underscores the necessity of right order and spiritual authority in God's household."
    },
    {
      "pk": 37007010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 10,
      "text": "Then Amaziah, the priest of Bethel, sent word to Jeroboam king of Israel, saying, 'Amos has conspired against you in the midst of the house of Israel. The land is not able to bear all his words.'",
      "links": "<a href='/AIV/11/12/32'>1 Kings 12:32</a>; <a href='/AIV/24/26/8-11'>Jer. 26:8-11</a>",
      "comment": "Amaziah, an official priest at a false sanctuary, accuses Amos of conspiracy, showing familiar prophetic opposition (cf. Jeremiah 26). The resistance to God's prophets by false religious authorities is a recurring biblical motif."
    },
    {
      "pk": 37007011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 11,
      "text": "For Amos has said, 'Jeroboam shall die by the sword, and Israel must surely go into exile away from his land.'",
      "links": "<a href='/AIV/12/15/10-12'>2 Kings 15:10-12</a>; <a href='/AIV/28/9/3'>Hos. 9:3</a>",
      "comment": "Amaziah paraphrases Amos’s prophecy, focusing on elements that would alarm the king. The exile prophecy points towards Assyrian captivity, and the threatened end of Jeroboam’s dynasty—a major upheaval in Israel’s history."
    },
    {
      "pk": 37007012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 12,
      "text": "Then Amaziah said to Amos, 'O seer, go, flee away to the land of Judah, and there eat your bread, and there prophesy.'",
      "links": "<a href='/AIV/11/17/23'>1 Kings 17:23</a>; <a href='/AIV/24/26/20-23'>Jer. 26:20-23</a>",
      "comment": "Amaziah rejects Amos’s authority, telling him to leave Israel and prophesy elsewhere. This parallels other prophets, rejected by their own people yet remaining obedient to God’s call. Faithfulness is key even in the face of opposition—foreshadowing Christ, who was rejected by His own (<a href='/AIV/43/1/11'>John 1:11</a>)."
    },
    {
      "pk": 37007013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 13,
      "text": "'But never again prophesy at Bethel, for it is the king’s sanctuary and a royal house.'",
      "links": "<a href='/AIV/11/12/29'>1 Kings 12:29</a>; <a href='/AIV/24/26/12'>Jer. 26:12</a>",
      "comment": "Bethel, once holy, has become a royal (not divine) sanctuary, used for political (rather than true worship) purposes. There is a strong distinction made between authentic worship and state-bound religion, anticipating the call for unity of faith and right worship."
    },
    {
      "pk": 37007014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 14,
      "text": "Then Amos answered Amaziah, 'I was not a prophet nor the son of a prophet; but I was a herdsman and a dresser of sycamore figs.'",
      "links": "<a href='/AIV/09/16/11'>1 Sam. 16:11</a>; <a href='/AIV/40/4/18-22'>Matt. 4:18-22</a>",
      "comment": "Amos’s humble background as a shepherd parallels God’s tendency to use the lowly for His purposes. This anticipates Christ’s apostles, most of whom were simple workers and not the religious elite. Divine calling, not human lineage, is the source of authentic authority."
    },
    {
      "pk": 37007015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 15,
      "text": "But the LORD took me from following the flock, and the LORD said to me, ‘Go, prophesy to my people Israel.’",
      "links": "<a href='/AIV/02/3/10'>Ex. 3:10</a>; <a href='/AIV/24/1/7'>Jer. 1:7</a>",
      "comment": "God’s call is sovereign and direct. Amos affirms his mission as God-ordained, not self-seeking. This reflects the apostolic vocation—called and commissioned by God for the good of the people, despite resistance or humble beginnings."
    },
    {
      "pk": 37007016,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 16,
      "text": "Now hear the word of the LORD: You say, ‘Do not prophesy against Israel, and do not preach against the house of Isaac.’",
      "links": "<a href='/AIV/33/2/6'>Mic. 2:6</a>; <a href='/AIV/24/36/23-24'>Jer. 36:23-24</a>",
      "comment": "Amaziah’s command reflects Israel’s hard heart toward prophetic correction, a common pattern before judgment. The refusal to hear unwelcome truth is repeatedly shown as a sign of impending downfall. Acceptance of God’s prophetic word is essential for the community’s spiritual health."
    },
    {
      "pk": 37007017,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 7,
      "verse": 17,
      "text": "Therefore thus says the LORD: ‘Your wife shall become a prostitute in the city, and your sons and your daughters shall fall by the sword, and your land shall be divided up with a measuring line; you yourself shall die in an unclean land, and Israel shall surely go into exile away from its land.’",
      "links": "<a href='/AIV/24/6/12'>Jer. 6:12</a>; <a href='/AIV/14/36/17-20'>2 Chron. 36:17-20</a>",
      "comment": "The punishment for rejecting God’s message is comprehensive—family, land, and priestly position all lost, culminating in exile. Exile is both physical and spiritual alienation. Restoration, as seen later in redemptive history, will come through a faithful remnant and ultimate fulfillment in the Church, the true Israel of God (<a href='/AIV/48/6/16'>Gal. 6:16</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:44:35.186Z"
}