{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 9,
  "verses": [
    {
      "pk": 37009001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 1,
      "text": "I saw the Lord standing beside the altar. He said, \"Strike the capitals so that the thresholds shake, and shatter them on the heads of all the people. The rest of them I will kill with the sword. None of them will flee away, no one will escape.",
      "links": "<a href='/AIV/11/9/27'>1 Kgs 9:27</a>; <a href='/AIV/26/9/5-6'>Ezek. 9:5-6</a>; <a href='/AIV/19/139/7-12'>Ps. 139:7-12</a>",
      "comment": "The vision of God standing at the altar signals direct judgment upon His own people and their religious practices. The altar, a place of worship and sacrifice, becomes the location of judgment, hinting at the profound relationship between true worship and obedience. The total destruction depicted underscores God's holiness and the seriousness of idolatry and false worship. The sword as a symbol of irrevocable justice echoes later prophetic warnings (<a href='/AIV/26/9/5-6'>Ezek. 9:5-6</a>)."
    },
    {
      "pk": 37009002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 2,
      "text": "Though they dig into Sheol, from there My hand shall take them; though they climb up to heaven, from there I will bring them down.",
      "links": "<a href='/AIV/19/139/8'>Ps. 139:8</a>; <a href='/AIV/24/51/53'>Jer. 51:53</a>",
      "comment": "This verse poetically expresses the inescapability of God's judgment. The extremes of Sheol (the realm of the dead) and heaven represent every possible place one could flee. This recalls <a href='/AIV/19/139/7-8'>Psalm 139:7-8</a>, underscoring God's omnipresence and sovereignty over life and death."
    },
    {
      "pk": 37009003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 3,
      "text": "If they hide themselves on the top of Carmel, I will search them out and take them; if they hide from My sight at the bottom of the sea, I will command the serpent there to bite them.",
      "links": "<a href='/AIV/19/139/9-10'>Ps. 139:9-10</a>; <a href='/AIV/18/26/13'>Job 26:13</a>",
      "comment": "Mount Carmel and the depths of the sea signify places of earthly refuge and cosmic hiding. Even nature and its creatures serve God's purposes, showing His authority over all creation. This reflects the idea that human effort cannot overcome divine justice."
    },
    {
      "pk": 37009004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 4,
      "text": "If they go into captivity before their enemies, from there I will command the sword, and it shall kill them. I will fix My eyes upon them for harm, not for good.",
      "links": "<a href='/AIV/23/10/4'>Isa. 10:4</a>; <a href='/AIV/24/21/10'>Jer. 21:10</a>",
      "comment": "Even captivity among their enemies will not protect from judgment; God actively pursues justice. His focus 'for harm, not for good' reverses earlier promises of blessing, emphasizing the seriousness of rejection and covenant breach."
    },
    {
      "pk": 37009005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 5,
      "text": "The Lord, the God of Hosts — He touches the earth, and it melts, and all who dwell on it mourn; and it rises like the Nile and sinks again like the Nile of Egypt.",
      "links": "<a href='/AIV/19/46/6'>Ps. 46:6</a>; <a href='/AIV/02/7/20'>Exod. 7:20</a>; <a href='/AIV/19/97/5'>Ps. 97:5</a>",
      "comment": "Here God's power is shown in the imagery of melting earth and the Nile's flood, recalling Exodus judgments and the cosmic power in Psalms. The title 'God of Hosts' stresses His authority over all spiritual and earthly powers."
    },
    {
      "pk": 37009006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 6,
      "text": "He builds His upper chambers in the heavens and founds His vault upon the earth; He calls for the waters of the sea and pours them out upon the face of the earth — the Lord is His name.",
      "links": "<a href='/AIV/19/104/3'>Ps. 104:3</a>; <a href='/AIV/24/10/13'>Jer. 10:13</a>",
      "comment": "This verse uses architectural language to express God's transcendence and immanence. The heavens and earth belong to Him, and He controls even the waters — often a biblical symbol of chaos and judgment (<a href='/AIV/19/104/3'>Ps. 104:3</a>). God's name carries His authority and power."
    },
    {
      "pk": 37009007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 7,
      "text": "\"Are you not like the Cushites to Me, O people of Israel?\" declares the Lord. \"Did I not bring up Israel from the land of Egypt, and the Philistines from Caphtor and the Arameans from Kir?\"",
      "links": "<a href='/AIV/02/12/51'>Exod. 12:51</a>; <a href='/AIV/05/2/23'>Deut. 2:23</a>",
      "comment": "God reminds Israel that His sovereignty extends to all nations, not just their own. Redemption from Egypt is special, but God also acts in gentile history. This begins the theme of God's universal plan, later realized in Christ (<a href='/AIV/48/3/28'>Gal. 3:28</a>)."
    },
    {
      "pk": 37009008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 8,
      "text": "Behold, the eyes of the Lord God are upon the sinful kingdom, and I will destroy it from the face of the earth — except that I will not utterly destroy the house of Jacob,\" declares the Lord.",
      "links": "<a href='/AIV/24/5/18'>Jer. 5:18</a>; <a href='/AIV/01/6/5-7'>Gen. 6:5-7</a>",
      "comment": "Total judgment is announced against the sinful kingdom, but a merciful remnant is preserved. This theme of 'remnant' becomes key for understanding the continuity of God’s plan through Israel, fulfilled ultimately in the establishment of one holy, apostolic community."
    },
    {
      "pk": 37009009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 9,
      "text": "\"For behold, I will command, and shake the house of Israel among all the nations as one shakes with a sieve, but not a single pebble shall fall to the ground.",
      "links": "<a href='/AIV/23/30/28'>Isa. 30:28</a>; <a href='/AIV/40/3/12'>Matt. 3:12</a>",
      "comment": "The sieve imagery describes God's testing and sorting, which preserves the faithful while allowing the unfaithful to be sifted out. This anticipates the refining and purification of God’s people, a recurring theme in both Testaments (<a href='/AIV/40/3/12'>Matt. 3:12</a>)."
    },
    {
      "pk": 37009010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 10,
      "text": "All the sinners of My people shall die by the sword, who say, 'Disaster shall not overtake or meet us.'",
      "links": "<a href='/AIV/26/13/10-16'>Ezek. 13:10-16</a>; <a href='/AIV/24/14/13-14'>Jer. 14:13-14</a>",
      "comment": "False confidence and presumption are condemned. Only authentic faith and righteousness preserve from judgment. This fits within the wider biblical warning against self-deception and invites examination of true faith and obedience."
    },
    {
      "pk": 37009011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 11,
      "text": "\"On that day I will raise up the fallen booth of David, and repair its breaches, raise up its ruins, and rebuild it as in days of old,",
      "links": "<a href='/AIV/10/7/11-16'>2 Sam. 7:11-16</a>; <a href='/AIV/44/15/15-17'>Acts 15:15-17</a>",
      "comment": "This verse is highly messianic, pointing to the restoration of David's kingdom. The 'booth' may refer to the Tabernacle or dynasty. Quoted in <a href='/AIV/44/15/15-17'>Acts 15:16-17</a> to describe the inclusion of Gentiles into the people of God, fulfilled in Christ and the visible unity of the church through apostolic succession."
    },
    {
      "pk": 37009012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 12,
      "text": "that they may possess the remnant of Edom and all the nations who are called by My name,\" declares the Lord who does this.",
      "links": "<a href='/AIV/44/15/17'>Acts 15:17</a>; <a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/23/11/10'>Isa. 11:10</a>",
      "comment": "The promise extends to all nations, 'called by My name,' affirming the universality of God’s plan and the future unity of believers under a single faith, as made explicit in the New Testament’s teachings on one body and one household of faith (<a href='/AIV/44/15/17'>Acts 15:17</a>)."
    },
    {
      "pk": 37009013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 13,
      "text": "\"Behold, the days are coming,\" declares the Lord, \"when the plowman shall overtake the reaper and the treader of grapes him who sows seed; the mountains shall drip sweet wine, and all the hills shall flow with it.",
      "links": "<a href='/AIV/23/25/6'>Isa. 25:6</a>; <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "Extraordinary abundance is promised, transcending natural order, pointing to the eschatological blessings associated with the Messianic age (<a href='/AIV/23/25/6'>Isa. 25:6</a>). Wine and fruitfulness symbolize joy and spiritual prosperity."
    },
    {
      "pk": 37009014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 14,
      "text": "I will restore the fortunes of My people Israel, and they shall rebuild the ruined cities and live in them; they shall plant vineyards and drink their wine, and shall make gardens and eat their fruit.",
      "links": "<a href='/AIV/24/30/18'>Jer. 30:18</a>; <a href='/AIV/26/36/34-36'>Ezek. 36:34-36</a>",
      "comment": "Restoration involves both physical and spiritual renewal. God’s people are not only forgiven but reestablished — their lives, communities, and worship renewed in visible unity, reflecting the New Testament idea of the one body and one faith gathered around the altar."
    },
    {
      "pk": 37009015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 9,
      "verse": 15,
      "text": "I will plant them upon their land, and they shall never again be uprooted out of the land that I have given them,\" says the Lord your God.",
      "links": "<a href='/AIV/24/32/41'>Jer. 32:41</a>; <a href='/AIV/01/17/8'>Gen. 17:8</a>",
      "comment": "The unbreakable promise of being 'planted' recalls God’s covenant faithfulness, ultimately fulfilled through the enduring spiritual community formed in the new and everlasting covenant established by Christ, who gathers all peoples into one household under His lordship."
    }
  ],
  "translatedAt": "2025-12-24T09:45:14.447Z"
}