{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 6,
  "verses": [
    {
      "pk": 37006001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 1,
      "text": "Woe to those who are at ease in Zion, and to those who feel secure on the mountain of Samaria, the notable men of the foremost of the nations, to whom the house of Israel comes!",
      "links": "<a href='/AIV/23/32/9-11'>Isa. 32:9-11</a>; <a href='/AIV/30/3/9'>Amos 3:9</a>",
      "comment": "This verse is a rebuke to the complacent leaders in both Judah (Zion) and Israel (Samaria). The prophet warns against false security derived from earthly status. The dual mention of Zion and Samaria emphasizes the unity and shared responsibility among God's people. Spiritually, it cautions against becoming prideful in religious privilege, urging humility and faithfulness. See <a href='/AIV/42/12/48'>Luke 12:48</a> for the greater responsibility of those given much."
    },
    {
      "pk": 37006002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 2,
      "text": "Pass over to Calneh and see; and go from there to Hamath the great; then go down to Gath of the Philistines. Are you better than these kingdoms? Or is their territory greater than yours?",
      "links": "<a href='/AIV/01/10/10-12'>Gen. 10:10-12</a>; <a href='/AIV/24/49/23'>Jer. 49:23</a>",
      "comment": "The cities listed—Calneh, Hamath, and Gath—were once prominent but now fallen, serving as warnings. This shows the universality of divine judgment. No nation, regardless of its past, is exempt from moral accountability. The implication is clear: pride leads to downfall. Compare with <a href='/AIV/20/16/18'>Prov. 16:18</a>."
    },
    {
      "pk": 37006003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 3,
      "text": "You who put off the evil day, and cause the seat of violence to come near;",
      "links": "<a href='/AIV/23/56/12'>Isa. 56:12</a>; <a href='/AIV/26/12/27-28'>Ezek. 12:27-28</a>",
      "comment": "The leaders delay facing judgment while perpetuating injustice. Delaying repentance is itself a form of pride. Instead of reform, they increase violence. The tendency to postpone conversion or penitence is a recurring spiritual danger—see <a href='/AIV/58/3/13'>Heb. 3:13</a>."
    },
    {
      "pk": 37006004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 4,
      "text": "You who lie on beds of ivory and stretch out yourselves on their couches, and eat lambs from the flock and calves from the midst of the stall;",
      "links": "<a href='/AIV/33/3/12'>Mic. 3:12</a>; <a href='/AIV/30/3/12'>Amos 3:12</a>",
      "comment": "The imagery of indulgence and luxury exposes the moral decay of those unconcerned for the suffering of others. This verse warns against excess and neglecting spiritual responsibilities. Hospitality towards the poor and vulnerable is consistently praised throughout Scripture (<a href='/AIV/40/25/34-40'>Matt. 25:34-40</a>)."
    },
    {
      "pk": 37006005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 5,
      "text": "Who sing idle songs to the sound of the harp, and invent for themselves instruments of music, like David;",
      "links": "<a href='/AIV/10/6/5'>2 Sam. 6:5</a>; <a href='/AIV/19/150/3-5'>Ps. 150:3-5</a>",
      "comment": "Here, music, intended for praise, is used only for ephemeral pleasure. While David innovated instruments to glorify God, these leaders used them for personal indulgence. The spiritual interpretation emphasizes the importance of legitimate worship and aligns with reverent liturgy. See <a href='/AIV/51/3/16'>Col. 3:16</a> regarding singing with grace in the heart."
    },
    {
      "pk": 37006006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 6,
      "text": "Who drink wine in bowls and anoint themselves with the finest oils, but are not grieved over the ruin of Joseph.",
      "links": "<a href='/AIV/23/5/11-12'>Isa. 5:11-12</a>; <a href='/AIV/30/5/15'>Amos 5:15</a>",
      "comment": "Using large bowls means extravagant self-indulgence. Anointing with precious oil, a symbol of special blessing, becomes self-serving. The lack of concern for 'the ruin of Joseph' denotes neglect for the suffering people of Israel. This calls to compassion and intercessory prayer, anticipating Christ's identification with the poor and afflicted (<a href='/AIV/40/25/40'>Matt. 25:40</a>)."
    },
    {
      "pk": 37006007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 7,
      "text": "Therefore they shall now go into exile at the head of the exiles, and the revelry of those who lie stretched out shall be taken away.",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/19/137/1'>Ps. 137:1</a>",
      "comment": "Because of their pride and neglect, they will be the first to suffer exile. This is a reversal of privilege, prefiguring Christ's teaching that the first will be last (<a href='/AIV/40/19/30'>Matt. 19:30</a>). The 'revelry' ending echoes the biblical call to sobriety and vigilance."
    },
    {
      "pk": 37006008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 8,
      "text": "The Lord GOD has sworn by himself,” declares the LORD, the God of hosts: “I abhor the pride of Jacob and hate his strongholds, and I will deliver up the city and all that is in it.”",
      "links": "<a href='/AIV/01/22/16'>Gen. 22:16</a>; <a href='/AIV/10/12/11'>2 Sam. 12:11</a>",
      "comment": "God's oath by Himself highlights the certainty of what's to come. ‘Pride of Jacob’ refers to national arrogance and misplaced trust in fortresses. Judgment falls even on God's chosen when they are unfaithful. The spiritual sense calls for humility and total reliance on God's mercy and not our own works (<a href='/AIV/59/4/6'>James 4:6</a>)."
    },
    {
      "pk": 37006009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 9,
      "text": "And if ten men remain in one house, they shall die.",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>; <a href='/AIV/23/6/13'>Isa. 6:13</a>",
      "comment": "This dramatic image signifies near-total destruction. Even a remnant is cut off by judgment. This foreshadows the severity of God’s discipline, but also prepares for the later promise of a faithful remnant (<a href='/AIV/45/11/5'>Rom. 11:5</a>)."
    },
    {
      "pk": 37006010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 10,
      "text": "And when a relative or whoever is to burn the bodies picks them up to carry them out of the house, he shall say to the one in the innermost parts of the house, 'Is anyone still with you?' And he shall say, 'No.' Then he shall say, 'Silence! For we dare not mention the name of the LORD.'",
      "links": "<a href='/AIV/24/16/6'>Jer. 16:6</a>; <a href='/AIV/07/6/29-32'>Judg. 6:29-32</a>",
      "comment": "Burning the dead indicates unusual devastation, as burial was normal. The reluctance to mention God's Name suggests fear and awe, but also a recognition of divine judgment. This reverence is echoed in the tradition of hallowing God's Name (<a href='/AIV/40/6/9'>Matt. 6:9</a>), and the silence points to the reality of God’s holiness."
    },
    {
      "pk": 37006011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 11,
      "text": "For behold, the LORD commands, and the great house shall be smashed to bits, and the little house into pieces.",
      "links": "<a href='/AIV/23/5/5-6'>Isa. 5:5-6</a>; <a href='/AIV/26/7/24'>Ezek. 7:24</a>",
      "comment": "All levels of society, great and small, face God's judgment alike. No one's status can save them. This levels human distinctions before the Lord, reminiscent of the teaching that all have sinned (<a href='/AIV/45/3/23'>Rom. 3:23</a>)."
    },
    {
      "pk": 37006012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 12,
      "text": "Do horses run on rocks? Does one plow the sea with oxen? But you have turned justice into poison and the fruit of righteousness into wormwood.",
      "links": "<a href='/AIV/05/29/18'>Deut. 29:18</a>; <a href='/AIV/30/5/7'>Amos 5:7</a>",
      "comment": "Amos uses rhetorical questions to highlight absurdity: as horses don’t run on rocks or plow the sea, so is Israel’s perversion of justice unnatural. 'Wormwood' (a bitter herb) symbolizes the bitter consequences of injustice. Spiritual meaning: True justice is central to the covenant community, as Jesus teaches in the Beatitudes (<a href='/AIV/40/5/6'>Matt. 5:6</a>)."
    },
    {
      "pk": 37006013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 13,
      "text": "You who rejoice in Lo-debar, who say, 'Have we not by our own strength taken Karnaim for ourselves?'",
      "links": "<a href='/AIV/10/9/4'>2 Sam. 9:4</a>; <a href='/AIV/28/12/11'>Hos. 12:11</a>",
      "comment": "Lo-debar and Karnaim were conquered cities. Israel boasts of military victories, crediting their own strength rather than God. This could be compared to the temptation to take pride in spiritual accomplishments rather than recognizing all is a gift of grace (<a href='/AIV/46/4/7'>1 Cor. 4:7</a>)."
    },
    {
      "pk": 37006014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 6,
      "verse": 14,
      "text": "For behold, I will raise up a nation against you, O house of Israel,” declares the LORD, the God of hosts, “and they shall oppress you from Lebo-hamath to the Brook of the Arabah.”",
      "links": "<a href='/AIV/12/10/32'>2 Kings 10:32</a>; <a href='/AIV/30/2/10'>Amos 2:10</a>",
      "comment": "The full span of Israel’s border—from Lebo-hamath to the Brook of the Arabah—will experience oppression. The raised nation is Assyria (fulfilled in 2 Kings 17:6). Theologically, this reflects the consequences of persistent disobedience but, as always, Divine justice is balanced by the later ministry of restoration and unity, prefiguring the new covenant in Christ (<a href='/AIV/58/8/8-12'>Heb. 8:8-12</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:43:57.245Z"
}