{
  "book": 37,
  "bookName": "Amos",
  "bookAbbreviation": "Amos",
  "chapter": 3,
  "verses": [
    {
      "pk": 37003001,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 1,
      "text": "Hear this word that the LORD has spoken against you, O people of Israel, against the whole family that I brought up out of the land of Egypt:",
      "links": "<a href='/AIV/02/12/51'>Exod. 12:51</a>; <a href='/AIV/19/81/10'>Ps. 81:10</a>",
      "comment": "Amos begins with a call to all of Israel, reminding them of their deliverance from Egypt—a theme central to God's covenant-keeping faithfulness. The mention of 'family' emphasizes the unity and corporate responsibility of God's people (cf. Exod. 12:51), prefiguring the unity of the Church as the people called out from bondage."
    },
    {
      "pk": 37003002,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 2,
      "text": "You alone have I known among all the families of the earth; therefore I will punish you for all your sins.",
      "links": "<a href='/AIV/01/18/18'>Gen. 18:18</a>; <a href='/AIV/19/147/19-20'>Ps. 147:19-20</a>",
      "comment": "God's exclusive relationship with Israel heightens their accountability. 'Known' here implies intimate, covenantal election. God's discipline is parental, pointing to the notion that with chosenness comes responsibility (cf. Gen. 18:18). This foreshadows the calling and accountability of all who are gathered into the household of faith."
    },
    {
      "pk": 37003003,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 3,
      "text": "Can two walk together unless they have agreed to meet?",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "A proverb picture—agreement is necessary for unity. Spiritually, this points to fellowship with God being predicated on walking in His ways and in unity of doctrine and worship. Amos subtly teaches that true unity with God requires consent to His will, echoing the need for ordered, visible communion among believers."
    },
    {
      "pk": 37003004,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 4,
      "text": "Does a lion roar in the forest when it has no prey? Does a young lion cry out from its den if it has caught nothing?",
      "links": "<a href='/AIV/19/104/21'>Ps. 104:21</a>; <a href='/AIV/18/4/10'>Job 4:10</a>",
      "comment": "These rhetorical questions teach that dramatic signs (the lion’s roar) always follow concrete events (catching prey). In God’s dealings, judgment is not arbitrary—there are real causes rooted in sin. Amos lays groundwork for understanding prophecy as always connected to spiritual realities, foreshadowing the link between the Church's warnings and real consequences."
    },
    {
      "pk": 37003005,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 5,
      "text": "Does a bird fall into a trap on the ground if there is no snare there? Does a trap spring up from the ground when it has caught nothing?",
      "links": "<a href='/AIV/20/7/23'>Prov. 7:23</a>",
      "comment": "Further illustrating cause and effect—traps require snares, just as consequences follow sin. This supports the teaching that spiritual laws are woven into creation, and God's judgments are never random, but just responses to real events."
    },
    {
      "pk": 37003006,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 6,
      "text": "Is a trumpet blown in a city, and the people not afraid? Does disaster come to a city unless the LORD has done it?",
      "links": "<a href='/AIV/23/45/7'>Isa. 45:7</a>; <a href='/AIV/25/3/37-38'>Lam. 3:37-38</a>",
      "comment": "Amos asserts God's sovereign involvement in history. Nothing happens apart from Him—even disasters. This affirms the doctrine of providence: God governs all, both blessing and punishment. God's authority over earthly events invites deeper trust in His hidden wisdom and justice."
    },
    {
      "pk": 37003007,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 7,
      "text": "Surely, the Lord GOD does nothing unless he reveals his plan to his servants the prophets.",
      "links": "<a href='/AIV/26/2/3-5'>Ezek. 2:3-5</a>; <a href='/AIV/40/13/17'>Matt. 13:17</a>",
      "comment": "This verse establishes the principle of divine revelation and the importance of prophetic office. God's communication of His plans shows His desire for relationship and guidance of His people, prefiguring the continual guidance through the teaching and interpretive authority in the Church. Prophets as mediators point to the apostolic role and preserved tradition."
    },
    {
      "pk": 37003008,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 8,
      "text": "The lion has roared—who will not fear? The Lord GOD has spoken—who can but prophesy?",
      "links": "<a href='/AIV/19/29/9'>Ps. 29:9</a>; <a href='/AIV/24/20/9'>Jer. 20:9</a>",
      "comment": "The prophet is compelled to speak when God speaks; silence is not an option. This demonstrates the binding nature of God’s revelation, prefiguring the apostolic mission and the unbroken proclamation of truth. Fear and awe accompany the true voice of God, underscoring the seriousness of responding in faith."
    },
    {
      "pk": 37003009,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 9,
      "text": "Proclaim this to the palaces in Ashdod and to the palaces in Egypt: 'Gather on the mountains of Samaria and see the great turmoil within her and the oppression in her midst.'",
      "links": "<a href='/AIV/26/30/18'>Ezek. 30:18</a>",
      "comment": "Foreign nations are called to witness Israel’s woes, revealing that God’s judgment and righteousness are a testimony to the whole world. The mountains serve as vantage points for judgment, echoing Scriptural themes of God revealing His justice not just to Israel but to the nations. This models the idea of visible accountability and universality."
    },
    {
      "pk": 37003010,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 10,
      "text": "'They do not know how to do right,' declares the LORD, 'those who store up violence and robbery in their palaces.'",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/19/14/1'>Ps. 14:1</a>",
      "comment": "The corruption within Israel is so profound that justice is forgotten. Amos rebukes moral blindness, which is often a consequence of persistent sin and neglect of God’s law. This underscores the need for ongoing instruction and reform—a pattern seen in every authentic community of believers called to sanctity."
    },
    {
      "pk": 37003011,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 11,
      "text": "Therefore, this is what the Lord GOD says: 'An enemy will surround the land; he will pull down your strength and your palaces will be plundered.'",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "God foretells the coming of foreign judgment—a visible consequence for Israel's lack of righteousness. This fulfills historic warnings (2 Kings 17:6) and serves as a reminder of the temporal effects of spiritual rebellion, illustrating both individual and communal repercussions of sin."
    },
    {
      "pk": 37003012,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 12,
      "text": "This is what the LORD says: 'As a shepherd rescues from the mouth of the lion only two legs or a piece of an ear, so shall the people of Israel who live in Samaria be rescued, with a corner of a bed or part of a couch.'",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/26/34/11-12'>Ezek. 34:11-12</a>",
      "comment": "The imagery is of a rescue with only remnants remaining—a severe judgment leaving just a remnant. The shepherd motif hints at God’s continued concern for His people even amid discipline, prefiguring the promise that God always preserves a faithful remnant (cf. Ezek. 34:11-12), a theme echoed in the New Testament regarding the faithful community."
    },
    {
      "pk": 37003013,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 13,
      "text": "Hear and testify against the house of Jacob,' declares the Lord GOD, the God of hosts,",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/23/10/24'>Isa. 10:24</a>",
      "comment": "God calls witnesses against Jacob (Israel), emphasizing judgment on His own people. The invocation of God as 'the God of hosts' reaffirms His supreme authority and the gravity of the prophetic witness, a concept developed throughout salvation history regarding divine judgment and mercy."
    },
    {
      "pk": 37003014,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 14,
      "text": "that on the day I punish Israel for her transgressions, I will punish the altars of Bethel; the horns of the altar shall be cut off and fall to the ground.",
      "links": "<a href='/AIV/11/12/28-33'>1 Kings 12:28-33</a>; <a href='/AIV/26/6/4-6'>Ezek. 6:4-6</a>",
      "comment": "Bethel had become a center of false worship in Israel. The destruction of its altars signifies God’s rejection of unauthorized worship and the need for right worship. The cutting off of altar horns (symbols of refuge and worship) points to the seriousness of liturgical and doctrinal purity and rightful forms of worship, stressing the necessity of authentic sacramental worship instituted by God."
    },
    {
      "pk": 37003015,
      "translation": "AIV",
      "book": 37,
      "bookName": "Amos",
      "bookAbbreviation": "Amos",
      "chapter": 3,
      "verse": 15,
      "text": "I will strike the winter house together with the summer house; and the houses of ivory shall perish, and many houses shall be torn down,' declares the LORD.",
      "links": "<a href='/AIV/19/49/11'>Ps. 49:11</a>; <a href='/AIV/24/22/14'>Jer. 22:14'</a>",
      "comment": "The judgment stretches even to the luxurious homes of the wealthy—a warning that no social status can protect from divine judgment. This is a powerful reminder of the call to humility, the transient nature of worldly riches, and the need for detachment and generosity among God's people."
    }
  ],
  "translatedAt": "2025-12-24T09:42:30.738Z"
}