{
  "book": 54,
  "bookName": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 13,
  "verses": [
    {
      "pk": 54013001,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 1,
      "text": "This is the third time I am coming to you. By the testimony of two or three witnesses every matter shall be established.",
      "links": "<a href='/AIV/05/19/15'>Deut. 19:15</a>; <a href='/AIV/40/18/16'>Matt. 18:16</a>",
      "comment": "Paul references the Old Testament legal principle (Deut. 19:15) about establishing truth by multiple witnesses. This principle also appears in Jesus' teaching (Matt. 18:16), emphasizing the importance of unity and order in the church's judgment."
    },
    {
      "pk": 54013002,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 2,
      "text": "I warned you before, and now I warn you again, as I did when I was present the second time. If I come again, I will not spare anyone,",
      "links": "<a href='/AIV/47/12/21'>2Cor. 12:21</a>; <a href='/AIV/47/1/23'>2Cor. 1:23</a>",
      "comment": "Paul's warning shows his pastoral authority and responsibility for upholding order. The role of correcting sin and preserving unity is seen as essential for church leaders."
    },
    {
      "pk": 54013003,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 3,
      "text": "since you seek proof that Christ is speaking through me. He is not weak in dealing with you, but is powerful among you.",
      "links": "<a href='/AIV/47/10/10'>2Cor. 10:10</a>; <a href='/AIV/48/2/8'>Gal. 2:8</a>",
      "comment": "Paul affirms his apostolic authority derives from Christ himself. The power of Christ works through his chosen representatives—even if they appear weak. The church’s leadership shares in Christ's authority."
    },
    {
      "pk": 54013004,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 4,
      "text": "For he was crucified in weakness, but lives by the power of God. For we also are weak in him, but we will live with him by the power of God toward you.",
      "links": "<a href='/AIV/50/2/7'>Phil. 2:7-9</a>; <a href='/AIV/47/4/11'>2Cor. 4:11</a>",
      "comment": "Paul draws a parallel between Christ’s weakness in crucifixion and the present weakness of the apostles, which is transformed by God’s power. The pattern of suffering leading to glory is established here—a mystery central to Christian life."
    },
    {
      "pk": 54013005,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 5,
      "text": "Examine yourselves, to see whether you are in the faith. Test yourselves. Or do you not realize this about yourselves, that Jesus Christ is in you?—unless, indeed, you fail the test!",
      "links": "<a href='/AIV/48/2/20'>Gal. 2:20</a>; <a href='/AIV/62/5/13'>1John 5:13</a>",
      "comment": "Believers are called to continual self-examination, key for spiritual growth. Paul implies a sacramental presence of Christ within believers, indicating a real, inward transformation, not just a legal status."
    },
    {
      "pk": 54013006,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 6,
      "text": "I hope you will recognize that we have not failed the test.",
      "links": "<a href='/AIV/47/10/18'>2Cor. 10:18</a>",
      "comment": "Paul expresses confidence that his ministry stands up to scrutiny. The integrity and authenticity of apostolic authority are important, pointing toward a visible, reliable leadership in the community."
    },
    {
      "pk": 54013007,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 7,
      "text": "Now we pray to God that you do no wrong—not so that we would appear approved, but so that you may do what is right, even if we may seem to have failed.",
      "links": "<a href='/AIV/50/1/9-11'>Phil. 1:9-11</a>",
      "comment": "Paul prioritizes the moral and spiritual good of believers over his own reputation. True pastoral care seeks holiness in the community, not self-promotion."
    },
    {
      "pk": 54013008,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 8,
      "text": "For we cannot do anything against the truth, but only for the truth.",
      "links": "<a href='/AIV/62/3/18-19'>1John 3:18-19</a>",
      "comment": "Paul’s ultimate loyalty is to the truth of the Gospel. Authentic ministry is marked by faithfulness to Christ’s teaching, not personal preferences or popularity."
    },
    {
      "pk": 54013009,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 9,
      "text": "For we rejoice when we are weak and you are strong. This is what we pray for: your restoration.",
      "links": "<a href='/AIV/51/1/28'>Col. 1:28</a>",
      "comment": "Paul's weakness, in contrast to their strength, is a sign of genuine pastoral love. His ultimate desire is their restoration or perfection—compatible with the idea of growing in grace and maturing in holiness."
    },
    {
      "pk": 54013010,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 10,
      "text": "For this reason I write these things while I am away, so that when I come I may not have to be severe in my use of the authority the Lord has given me for building up, not for tearing down.",
      "links": "<a href='/AIV/47/10/8'>2Cor. 10:8</a>; <a href='/AIV/47/12/19'>2Cor. 12:19</a>",
      "comment": "Paul sees church authority as a gift from Christ meant for building up the community in holiness. Even correction is for edification, not destruction. This reflects a hierarchical, ordered authority for the good of the whole body."
    },
    {
      "pk": 54013011,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 11,
      "text": "Finally, brothers, rejoice. Aim for restoration, encourage one another, be of one mind, live in peace; and the God of love and peace will be with you.",
      "links": "<a href='/AIV/45/12/16-18'>Rom. 12:16-18</a>; <a href='/AIV/50/4/4'>Phil. 4:4</a>",
      "comment": "Paul urges the church toward unity, reconciliation, and peace, emphasizing communal harmony. God’s presence is experienced most fully when believers are united and striving together in love."
    },
    {
      "pk": 54013012,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 12,
      "text": "Greet one another with a holy kiss.",
      "links": "<a href='/AIV/45/16/16'>Rom. 16:16</a>; <a href='/AIV/52/5/26'>1Thess. 5:26</a>",
      "comment": "This expression of fellowship and unity was a common early Christian practice, symbolizing love and reconciliation in the gathered assembly."
    },
    {
      "pk": 54013013,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 13,
      "text": "All the saints send you greetings.",
      "links": "<a href='/AIV/50/4/21-22'>Phil. 4:21-22</a>",
      "comment": "Paul links his readers with other Christian communities, fostering a sense of universal fellowship in the one Body of Christ."
    },
    {
      "pk": 54013014,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 13,
      "verse": 14,
      "text": "The grace of the Lord Jesus Christ and the love of God and the fellowship of the Holy Spirit be with you all.",
      "links": "<a href='/AIV/54/1/2'>2Cor. 1:2</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "This trinitarian blessing reveals the threefold nature of God and His relationship with the church. It echoes the baptismal formula (Matt. 28:19) and has deep liturgical significance as a prayer for unity and communion among all believers."
    }
  ],
  "translatedAt": "2025-12-24T11:57:49.033Z"
}