{
  "book": 54,
  "bookName": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 11,
  "verses": [
    {
      "pk": 54011001,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 1,
      "text": "I wish you would bear with me in a little foolishness. Yes, please bear with me.",
      "links": "",
      "comment": "Here, Paul admits his words may sound boastful but asks for patience from his readers. His humility reflects how true apostles sometimes must defend their ministry for the good of the Church (cf. 1 Cor. 4:10)."
    },
    {
      "pk": 54011002,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 2,
      "text": "For I am jealous for you with a godly jealousy. For I promised you in marriage to one husband, to present you as a pure virgin to Christ.",
      "links": "<a href='/AIV/19/45/14'>Ps. 45:14</a>; <a href='/AIV/66/19/7'>Rev. 19:7</a>",
      "comment": "Paul uses marital imagery, reflecting how the Church is the Bride of Christ (see Eph. 5:25-27; Rev. 21:2). This stresses spiritual purity and unity with Christ, highlighting the importance of faithfulness to the true teaching handed down from the apostles."
    },
    {
      "pk": 54011003,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 3,
      "text": "But I am afraid that, as the serpent deceived Eve by his cunning, your minds will be led astray from sincere and pure devotion to Christ.",
      "links": "<a href='/AIV/01/3/1'>Gen. 3:1</a>",
      "comment": "Paul references the temptation of Eve (Genesis 3), warning of corruption in doctrine and devotion. Just as Eve was deceived, so Christians must guard against false teachings threatening the unity and purity of the Church."
    },
    {
      "pk": 54011004,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 4,
      "text": "For if someone comes and proclaims another Jesus than the one we proclaimed, or if you receive a different spirit from the one you received, or a different gospel from the one you accepted, you put up with it easily enough.",
      "links": "<a href='/AIV/48/1/6-7'>Gal. 1:6-7</a>",
      "comment": "Paul warns against new teachers presenting a different gospel—a concern for all ages. Faithfulness to the apostolic tradition is essential, stressing that the Church safeguards true doctrine (cf. 2 Thess. 2:15)."
    },
    {
      "pk": 54011005,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 5,
      "text": "For I consider that I am not at all inferior to these ‘super-apostles.’",
      "links": "<a href='/AIV/54/12/11'>2Cor. 12:11</a>",
      "comment": "Paul contrasts himself with so-called 'super-apostles'—perhaps boasting false teachers. True authority in the Church does not depend on outward status, but fidelity and grace."
    },
    {
      "pk": 54011006,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 6,
      "text": "Even if I am unskilled in speech, I am not so in knowledge; indeed, we have made this clear to you in every way in all things.",
      "links": "<a href='/AIV/46/2/1'>1 Cor. 2:1</a>",
      "comment": "Paul emphasizes substance over eloquence. Apostolic teaching is founded on true knowledge of Christ, not human wisdom (see 1 Cor. 2:4-5)."
    },
    {
      "pk": 54011007,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 7,
      "text": "Did I commit a sin by humbling myself so that you might be exalted, because I preached the gospel of God to you without charge?",
      "links": "<a href='/AIV/54/12/13'>2Cor. 12:13</a>",
      "comment": "Paul did not take money from the Corinthians, showing apostolic self-sacrifice. This models servant leadership in the Church and contrasts with self-serving preachers."
    },
    {
      "pk": 54011008,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 8,
      "text": "I robbed other churches by accepting support from them in order to serve you.",
      "links": "<a href='/AIV/50/4/15-16'>Phil. 4:15-16</a>",
      "comment": "Paul uses irony—he took funds from other Christian communities to avoid burdening Corinth. This shows cooperation and sacrificial support among different churches."
    },
    {
      "pk": 54011009,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 9,
      "text": "And when I was with you and was in need, I did not become a burden to anyone. For the brothers who came from Macedonia supplied my need. So I kept myself, and will keep myself, from being a burden to you in any way.",
      "links": "<a href='/AIV/44/20/34'>Acts 20:34</a>",
      "comment": "The Macedonian churches supported Paul, enabling his mission. This demonstrates early Christian charity, and how the wider Church assists in upholding missionary work."
    },
    {
      "pk": 54011010,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 10,
      "text": "As the truth of Christ is in me, no one in the regions of Achaia will stop this boast of mine.",
      "links": "",
      "comment": "Paul asserts genuine motives in his ministry, grounded in Christ's truth. His actions reflect how apostles are called to imitate Christ’s truthfulness (see Rom. 9:1)."
    },
    {
      "pk": 54011011,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 11,
      "text": "Why? Because I do not love you? God knows I do!",
      "links": "<a href='/AIV/45/1/9'>Rom. 1:9</a>",
      "comment": "Paul declares his genuine love for the Corinthians. True shepherds are motivated by love rather than gain—a mark of authentic apostolic ministry."
    },
    {
      "pk": 54011012,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 12,
      "text": "But what I am doing I will continue to do, to cut off the opportunity from those who want an opportunity to be regarded as our equals in the things they boast about.",
      "links": "",
      "comment": "Paul is intentional about exposing false teachers by refusing their methods. The apostles had a special commission from Christ, and not everyone who claims leadership truly has Christ’s authority."
    },
    {
      "pk": 54011013,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 13,
      "text": "For such people are false apostles, deceitful workers, disguising themselves as apostles of Christ.",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>",
      "comment": "Paul unmasks those who pretend apostolic authority. True succession in ministry is necessary to keep doctrine pure and prevent deception (cf. 1 John 4:1)."
    },
    {
      "pk": 54011014,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 14,
      "text": "And no wonder, for even Satan disguises himself as an angel of light.",
      "links": "<a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "The devil can appear good to deceive. Thus the faithful must discern spirits by reference to apostolic witness and the confirmation of the wider Church throughout history."
    },
    {
      "pk": 54011015,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 15,
      "text": "So it is no great thing if his servants also disguise themselves as servants of righteousness. Their end will be according to their deeds.",
      "links": "<a href='/AIV/40/7/21-23'>Matt. 7:21-23</a>",
      "comment": "Judgment is based not just on claims but by works. This verse highlights the importance of living faith—faithfulness shown in actions (cf. James 2:17)."
    },
    {
      "pk": 54011016,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 16,
      "text": "I repeat, let no one think me foolish. But even if you do, accept me as a fool, so that I too may boast a little.",
      "links": "",
      "comment": "Paul engages in ‘foolish’ boasting to contrast spiritual humility with the pride of false teachers. True leaders sometimes defend their ministry for the sake of their flock."
    },
    {
      "pk": 54011017,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 17,
      "text": "What I am saying with this boastful confidence, I say not according to the Lord, but as foolishness, in this confidence of boasting.",
      "links": "",
      "comment": "Paul differentiates his method here from Christ’s usual pattern. He stoops to irony to protect his congregation in the context of spiritual danger."
    },
    {
      "pk": 54011018,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 18,
      "text": "Since many boast according to the flesh, I too will boast.",
      "links": "",
      "comment": "Paul matches the rhetorical tactics of the false teachers but will point to the worth of his suffering for Christ, not worldly achievement."
    },
    {
      "pk": 54011019,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 19,
      "text": "For you gladly put up with fools, since you are wise yourselves!",
      "links": "",
      "comment": "Paul’s sarcasm exposes the Corinthians’ openness to being misled, warning believers not to abandon sound doctrine in favor of novel teachings."
    },
    {
      "pk": 54011020,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 20,
      "text": "For you bear it if someone enslaves you, devours you, takes advantage of you, exalts himself, or strikes you in the face.",
      "links": "",
      "comment": "Paul lists abuses tolerated under false teachers. By contrast, the true ministry involves loving service and humility (see Matt. 20:26-28)."
    },
    {
      "pk": 54011021,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 21,
      "text": "To my shame, I must say, we were too weak for that! But whatever anyone else dares to boast of — I am speaking as a fool — I also dare to boast of that.",
      "links": "",
      "comment": "Paul uses irony to show strength is found in Christian humility and weakness, not in abusive dominance (cf. 2 Cor. 12:9-10)."
    },
    {
      "pk": 54011022,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 22,
      "text": "Are they Hebrews? So am I. Are they Israelites? So am I. Are they descendants of Abraham? So am I.",
      "links": "<a href='/AIV/50/3/5'>Phil. 3:5</a>",
      "comment": "Paul establishes his Jewish heritage, showing he matches their credentials. His apostolic authority comes not from ethnicity but Christ’s call."
    },
    {
      "pk": 54011023,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 23,
      "text": "Are they servants of Christ? (I am speaking like a madman) I am more so: with far greater labors, far more imprisonments, with countless beatings, and often near death.",
      "links": "<a href='/AIV/44/9/16'>Acts 9:16</a>",
      "comment": "Paul’s boast is in suffering for Christ—echoing Jesus’ own prophetic suffering (see Luke 9:23; John 15:20). True authority is validated by sacrifice."
    },
    {
      "pk": 54011024,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 24,
      "text": "Five times I received from the Jews forty lashes minus one.",
      "links": "<a href='/AIV/05/25/3'>Deut. 25:3</a>",
      "comment": "The punishment referenced here is from Jewish law (Deuteronomy 25:3)—Paul endured this severe punishment for Christ’s sake."
    },
    {
      "pk": 54011025,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 25,
      "text": "Three times I was beaten with rods. Once I was stoned. Three times I was shipwrecked; a night and a day I was adrift at sea;",
      "links": "<a href='/AIV/44/14/19'>Acts 14:19</a>; <a href='/AIV/44/16/22'>Acts 16:22</a>",
      "comment": "Paul describes suffering endured in missionary journeys—sufferings that imitate Christ and His apostles. The apostolic path is marked by hardship for the faithful."
    },
    {
      "pk": 54011026,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 26,
      "text": "on frequent journeys, in dangers from rivers, dangers from robbers, dangers from my own people, dangers from Gentiles, dangers in the city, dangers in the wilderness, dangers at sea, dangers among false brothers;",
      "links": "<a href='/AIV/54/12/10'>2Cor. 12:10</a>",
      "comment": "Paul catalogs his perils, showing authentic ministry involves bearing all things for Christ and His Church. The reference to 'false brothers' warns that not all in the visible community are genuine."
    },
    {
      "pk": 54011027,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 27,
      "text": "in toil and hardship, through many sleepless nights, in hunger and thirst, often without food, in cold and exposure.",
      "links": "",
      "comment": "Paul’s hardships mirror Christ’s own life on earth, emphasizing the cost of obedience and self-emptying in true Christian service."
    },
    {
      "pk": 54011028,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 28,
      "text": "And, besides these external things, there is the daily pressure on me of my anxiety for all the churches.",
      "links": "",
      "comment": "Here, Paul speaks of spiritual concern for all the scattered Christian communities. Leadership in the universal Church carries a grave burden of care for unity and orthodoxy."
    },
    {
      "pk": 54011029,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 29,
      "text": "Who is weak, and I am not weak? Who is made to fall, and I do not burn with indignation?",
      "links": "",
      "comment": "Paul’s empathetic suffering reveals the true pastoral heart. Authentic leaders share the struggles and weaknesses of the flock."
    },
    {
      "pk": 54011030,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 30,
      "text": "If I must boast, I will boast of the things that show my weakness.",
      "links": "<a href='/AIV/47/4/7'>2Cor. 4:7</a>; <a href='/AIV/54/12/5'>2Cor. 12:5</a>",
      "comment": "Christian boasting highlights weakness that relies on God’s grace, not human strength. This principle underlies Christian spirituality."
    },
    {
      "pk": 54011031,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 31,
      "text": "The God and Father of the Lord Jesus, who is blessed forever, knows that I am not lying.",
      "links": "<a href='/AIV/45/9/5'>Rom. 9:5</a>",
      "comment": "Paul swears by the Father of Jesus, affirming Christ’s divine sonship (John 10:30; Heb. 1:2-3) and his own sincerity."
    },
    {
      "pk": 54011032,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 32,
      "text": "At Damascus, the governor under King Aretas was guarding the city of the Damascenes in order to arrest me,",
      "links": "<a href='/AIV/44/9/23-25'>Acts 9:23-25</a>",
      "comment": "Paul’s escape from Damascus directly recalls his dramatic conversion and early persecution (Acts 9). His apostleship is confirmed by his willingness to risk his life for Christ."
    },
    {
      "pk": 54011033,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 11,
      "verse": 33,
      "text": "but I was let down in a basket through a window in the wall and escaped his hands.",
      "links": "<a href='/AIV/06/2/15'>Josh. 2:15</a>",
      "comment": "Paul’s deliverance echoes Old Testament rescues (Josh. 2:15). God’s providence protected Paul for continued service, illustrating how He preserves leaders for the sake of His people (cf. Ps. 34:19-20)."
    }
  ],
  "translatedAt": "2025-12-24T11:57:08.549Z"
}