{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 12,
  "verses": [
    {
      "pk": 6012001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 1,
      "text": "These are the kings of the land whom the people of Israel defeated and whose land they took possession of beyond the Jordan toward the east, from the River Arnon to Mount Hermon, and all the Arabah eastward:",
      "links": "<a href='/AIV/4/21/21-24'>Num. 21:21-24</a>; <a href='/AIV/5/2/24-37'>Deut. 2:24-37</a>",
      "comment": "This introduction summarizes Israel’s victories to the east of the Jordan, reminding the reader that God keeps His promises concerning the land. The listing of kings is both an historical record and a theological statement about the Lord’s faithfulness."
    },
    {
      "pk": 6012002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 2,
      "text": "Sihon king of the Amorites, who lived at Heshbon and ruled from Aroer, which is on the edge of the Valley of the Arnon, and from the middle of the valley as far as the River Jabbok, the border of the Ammonites, that is, half of Gilead,",
      "links": "<a href='/AIV/4/21/26'>Num. 21:26</a>; <a href='/AIV/5/2/33-36'>Deut. 2:33-36</a>",
      "comment": "The defeat of Sihon marks a turning point for Israel, as they begin to enter their inheritance with God’s help. This sets a pattern of God subduing the enemies of His people, prefiguring spiritual victory in Christ (see <a href='/AIV/46/15/57'>1 Cor. 15:57</a>)."
    },
    {
      "pk": 6012003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 3,
      "text": "and the Arabah to the Sea of Chinnereth in the east, and in the direction of Beth-jeshimoth, to the Sea of the Arabah, the Salt Sea, southward, to the foot of the slopes of Pisgah;",
      "links": "<a href='/AIV/4/34/11-12'>Num. 34:11-12</a>",
      "comment": "The geographical details trace out the boundaries and remind us that God’s covenant is tied to real places and history."
    },
    {
      "pk": 6012004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 4,
      "text": "and Og king of Bashan, one of the remnant of the Rephaim, who lived at Ashtaroth and at Edrei,",
      "links": "<a href='/AIV/4/21/33-35'>Num. 21:33-35</a>; <a href='/AIV/5/3/1-11'>Deut. 3:1-11</a>",
      "comment": "Og’s defeat demonstrates God’s power over even the most feared of enemies. The mention of the Rephaim (giants or mighty men) alludes to the supernatural context of the conquest (<a href='/AIV/1/6/4'>Gen. 6:4</a>), and the triumph anticipates the Messiah's ultimate victory over evil."
    },
    {
      "pk": 6012005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 5,
      "text": "and ruled over Mount Hermon and Salecah and all Bashan to the border of the Geshurites and the Maacathites, and over half of Gilead to the border of Sihon king of Heshbon.",
      "links": "<a href='/AIV/13/5/11'>1 Chron. 5:11</a>",
      "comment": "The division of the land recalls God’s order and provision for tribes within Israel, foreshadowing the unity yet diversity within the Body of Christ (<a href='/AIV/46/12/12-14'>1 Cor. 12:12-14</a>)."
    },
    {
      "pk": 6012006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 6,
      "text": "Moses, the servant of the Lord, and the people of Israel defeated them. And Moses, the servant of the Lord, gave their land as a possession to the Reubenites, the Gadites, and the half-tribe of Manasseh.",
      "links": "<a href='/AIV/4/32/33-42'>Num. 32:33-42</a>; <a href='/AIV/5/3/12-17'>Deut. 3:12-17</a>",
      "comment": "The mention of Moses as 'servant of the Lord' highlights divinely established leadership and authority, showing God's guidance provided through chosen leaders. This chain of authority prefigures the pattern of spiritual leadership in the family of faith (see <a href='/AIV/58/13/7'>Heb. 13:7</a>)."
    },
    {
      "pk": 6012007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 7,
      "text": "And these are the kings of the land whom Joshua and the people of Israel defeated on the west side of the Jordan, from Baal-gad in the Valley of Lebanon to Mount Halak, which rises toward Seir; and Joshua gave their land to the tribes of Israel as a possession according to their allotments,",
      "links": "<a href='/AIV/6/11/16-23'>Josh. 11:16-23</a>",
      "comment": "This verse shifts the focus from Moses to Joshua, symbolizing continuity in God’s plan. The allotment of land to tribes reflects orderly distribution of God’s promises, drawing parallels to the inheritance of eternal life in Christ, given through faith and union with Him (<a href='/AIV/48/3/29'>Gal. 3:29</a>)."
    },
    {
      "pk": 6012008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 8,
      "text": "in the hill country, the lowland, the Arabah, the slopes, the wilderness, and the Negev—the land of the Hittites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites:",
      "links": "<a href='/AIV/5/7/1'>Deut. 7:1</a>",
      "comment": "The list of peoples defeated shows God’s total victory over all opposition, and points ahead to the universal scope of the mission of Christ, who brings salvation to all nations (<a href='/AIV/40/28/19'>Matt. 28:19</a>)."
    },
    {
      "pk": 6012009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 9,
      "text": "the king of Jericho, one; the king of Ai, which is beside Bethel, one;",
      "links": "<a href='/AIV/6/6/2'>Josh. 6:2</a>; <a href='/AIV/6/8/1'>Josh. 8:1</a>",
      "comment": "Listing the kings singles out their individual opposition to God’s purposes, further displaying God’s sovereignty in delivering His people. Each victory underscores the faithfulness of the Lord and Israel’s growing trust in His commands."
    },
    {
      "pk": 6012010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 10,
      "text": "the king of Jerusalem, one; the king of Hebron, one;",
      "links": "<a href='/AIV/6/10/1,3'>Josh. 10:1,3</a>",
      "comment": "Jerusalem's mention foreshadows its future significance as the center of worship and the city where salvation will be accomplished in Christ (<a href='/AIV/19/132/13'>Ps. 132:13</a>; <a href='/AIV/42/9/51'>Luke 9:51</a>)."
    },
    {
      "pk": 6012011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 11,
      "text": "the king of Jarmuth, one; the king of Lachish, one;",
      "links": "<a href='/AIV/6/10/3-5'>Josh. 10:3-5</a>",
      "comment": "Details about these city-kings remind us that each stronghold comes under God's authority. Historically, these defeats contributed to the unity and security of the people, typifying the peace Christ brings through His Church."
    },
    {
      "pk": 6012012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 12,
      "text": "the king of Eglon, one; the king of Gezer, one;",
      "links": "<a href='/AIV/6/10/5'>Josh. 10:5</a>; <a href='/AIV/6/10/33'>Josh. 10:33</a>",
      "comment": "Eglon’s and Gezer’s falls are evidence of God’s justice and comprehensive intervention for His people. The recurring word 'one' highlights their isolation and inability to withstand God collectively."
    },
    {
      "pk": 6012013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 13,
      "text": "the king of Debir, one; the king of Geder, one;",
      "links": "<a href='/AIV/6/10/38-39'>Josh. 10:38-39</a>",
      "comment": "The completeness of the defeats, including lesser-known cities, points to the thoroughness of God’s deliverance and the detailed fulfillment of God's promises."
    },
    {
      "pk": 6012014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 14,
      "text": "the king of Hormah, one; the king of Arad, one;",
      "links": "<a href='/AIV/4/21/1-3'>Num. 21:1-3</a>",
      "comment": "Hormah and Arad are linked to earlier struggles and victories during the wilderness journeys, calling to mind God’s preservation of the faithful."
    },
    {
      "pk": 6012015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 15,
      "text": "the king of Libnah, one; the king of Adullam, one;",
      "links": "<a href='/AIV/6/10/29-30'>Josh. 10:29-30</a>",
      "comment": "Every city named plays a role in highlighting the totality of God’s victory. Libnah later becomes one of the priestly cities (<a href='/AIV/6/21/13'>Josh. 21:13</a>), showing God’s ongoing concern for providing for spiritual life among His people."
    },
    {
      "pk": 6012016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 16,
      "text": "the king of Makkedah, one; the king of Bethel, one;",
      "links": "<a href='/AIV/6/10/28'>Josh. 10:28</a>; <a href='/AIV/6/8/17'>Josh. 8:17</a>",
      "comment": "Bethel had ancient significance as a site of worship (see <a href='/AIV/1/28/19'>Gen. 28:19</a>). Its conquest symbolizes renewal of right worship, an idea continued by the faithful gathering together to worship God in unity."
    },
    {
      "pk": 6012017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 17,
      "text": "the king of Tappuah, one; the king of Hepher, one;",
      "links": "<a href='/AIV/6/17/8'>Josh. 17:8</a>",
      "comment": "Hepher was later allotted to the tribe of Manasseh and is noted in the inheritance for the daughters of Zelophehad (<a href='/AIV/4/27/1-7'>Num. 27:1-7</a>), prefiguring the fullness and inclusivity of God's promises to all the faithful."
    },
    {
      "pk": 6012018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 18,
      "text": "the king of Aphek, one; the king of Lasharon, one;",
      "links": "<a href='/AIV/6/19/30'>Josh. 19:30</a>",
      "comment": "The documentation of each king and city demonstrates the precision of God’s plan and the careful keeping of His word, pointing to the reliability and authority of Scripture."
    },
    {
      "pk": 6012019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 19,
      "text": "the king of Madon, one; the king of Hazor, one;",
      "links": "<a href='/AIV/6/11/1,10'>Josh. 11:1,10</a>",
      "comment": "Hazor was the head of several kingdoms, but even its power could not withstand the Lord. This foreshadows the breaking of spiritual strongholds in the new covenant established by Christ."
    },
    {
      "pk": 6012020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 20,
      "text": "the king of Shimron-meron, one; the king of Achshaph, one;",
      "links": "<a href='/AIV/6/11/1'>Josh. 11:1</a>",
      "comment": "Both Shimron-meron and Achshaph participated in the northern coalition against Israel, but were defeated as the Lord fought for His people. This illustrates the protection and unity found in the family of faith."
    },
    {
      "pk": 6012021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 21,
      "text": "the king of Taanach, one; the king of Megiddo, one;",
      "links": "<a href='/AIV/7/1/27'>Judg. 1:27</a>; <a href='/AIV/66/16/16'>Rev. 16:16</a>",
      "comment": "Megiddo later becomes symbolic in apocalyptic prophecy (see Armageddon in <a href='/AIV/66/16/16'>Rev. 16:16</a>), showing how historical events point forward to ultimate spiritual battles."
    },
    {
      "pk": 6012022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 22,
      "text": "the king of Kedesh, one; the king of Jokneam in Carmel, one;",
      "links": "<a href='/AIV/6/19/37'>Josh. 19:37</a>",
      "comment": "Kedesh later becomes a city of refuge (<a href='/AIV/6/20/7'>Josh. 20:7</a>), symbolizing mercy and sanctuary, which is ultimately fulfilled in Christ as our refuge."
    },
    {
      "pk": 6012023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 23,
      "text": "the king of Dor in Naphath-dor, one; the king of Goiim in Galilee, one;",
      "links": "<a href='/AIV/6/11/2'>Josh. 11:2</a>",
      "comment": "The inclusion of 'Goiim'—meaning nations—hints at the universal reach of God’s kingship, pointing to the gathering of people from every nation into one family of faith."
    },
    {
      "pk": 6012024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 12,
      "verse": 24,
      "text": "the king of Tirzah, one; in all, thirty-one kings.",
      "links": "<a href='/AIV/11/15/21'>1 Kings 15:21</a>",
      "comment": "The tally of thirty-one conquered kings signifies the completeness of Israel’s victory over Canaan, fulfilling God’s promise to Abraham and establishing them in the land. This fullness points ahead to the fullness of the new covenant and the unity of all God’s people."
    }
  ],
  "translatedAt": "2025-12-24T02:23:12.365Z"
}