{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 24,
  "verses": [
    {
      "pk": 6024001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 1,
      "text": "Then Joshua gathered all the tribes of Israel at Shechem. He called for the elders of Israel, their heads, their judges, and their officers. They stood before God.",
      "links": "<a href='/AIV/1/35/4'>Gen. 35:4</a>; <a href='/AIV/6/8/33'>Josh. 8:33</a>",
      "comment": "Shechem is significant as a place of covenant renewal (Gen. 35:4). Gathering before God emphasizes the sacredness of the assembly and recalls the earlier altar built by Joshua (Josh. 8:33)."
    },
    {
      "pk": 6024002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 2,
      "text": "Joshua said to all the people, 'The LORD, the God of Israel, says: Your ancestors—Terah, the father of Abraham and Nahor—lived beyond the Euphrates River long ago and worshiped other gods.'",
      "links": "<a href='/AIV/1/11/26-32'>Gen. 11:26-32</a>; <a href='/AIV/1/12/1'>Gen. 12:1</a>",
      "comment": "The reference to ancestors worshipping other gods shows God’s initiative in calling Abraham, emphasizing grace and election (Gen. 12:1)."
    },
    {
      "pk": 6024003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 3,
      "text": "'But I took your father Abraham from beyond the Euphrates and led him throughout all the land of Canaan. I gave him many descendants. I gave him Isaac.'",
      "links": "<a href='/AIV/1/12/1-7'>Gen. 12:1-7</a>; <a href='/AIV/1/21/3'>Gen. 21:3</a>",
      "comment": "This recounts God’s sovereignty in leading, blessing, and fulfilling the promise to Abraham (Gen. 12:7; Gen. 21:3)."
    },
    {
      "pk": 6024004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 4,
      "text": "'To Isaac I gave Jacob and Esau. I gave the hill country of Seir to Esau to possess, but Jacob and his children went down into Egypt.'",
      "links": "<a href='/AIV/1/25/24-26'>Gen. 25:24-26</a>; <a href='/AIV/1/36/8'>Gen. 36:8</a>; <a href='/AIV/1/46/6-7'>Gen. 46:6-7</a>",
      "comment": "The movement of Jacob’s family to Egypt sets the stage for the Exodus. Contrasting gifts to Esau and Jacob highlights the chosen lineage."
    },
    {
      "pk": 6024005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 5,
      "text": "'Then I sent Moses and Aaron, and I plagued Egypt by what I did among them, and afterward I brought you out.'",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10</a>; <a href='/AIV/2/7/1-5'>Exod. 7:1-5</a>",
      "comment": "The Lord’s direct intervention and use of mediators Moses and Aaron prefigures the need for appointed leaders and mediators."
    },
    {
      "pk": 6024006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 6,
      "text": "'I brought your ancestors out of Egypt. You came to the sea, and the Egyptians pursued your ancestors with chariots and horsemen to the Red Sea.'",
      "links": "<a href='/AIV/2/14/9-28'>Exod. 14:9-28</a>",
      "comment": "A recount of the Exodus, which is the central act of redemption in the Old Testament, pointing toward the new Exodus in Christ."
    },
    {
      "pk": 6024007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 7,
      "text": "'When your ancestors cried out to the LORD, He put darkness between you and the Egyptians. He brought the sea upon them and covered them. Your eyes saw what I did in Egypt. Then you lived in the wilderness for a long time.'",
      "links": "<a href='/AIV/2/14/20-30'>Exod. 14:20-30</a>; <a href='/AIV/4/14/33'>Num. 14:33</a>",
      "comment": "The miracles and forty years in the wilderness demonstrate God’s power and patience."
    },
    {
      "pk": 6024008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 8,
      "text": "'I brought you to the land of the Amorites living east of the Jordan. They fought against you, but I gave them into your hand. You possessed their land, and I destroyed them before you.'",
      "links": "<a href='/AIV/4/21/21-35'>Num. 21:21-35</a>; <a href='/AIV/5/2/24-36'>Deut. 2:24-36</a>",
      "comment": "Recalls God’s faithfulness in providing victory over Israel’s enemies."
    },
    {
      "pk": 6024009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 9,
      "text": "'Then Balak son of Zippor, king of Moab, arose and fought against Israel. He sent and invited Balaam son of Beor to curse you.'",
      "links": "<a href='/AIV/4/22/2-6'>Num. 22:2-6</a>",
      "comment": "Mentions opposition from Moab and the attempt to curse Israel, reflecting spiritual warfare themes."
    },
    {
      "pk": 6024010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 10,
      "text": "'But I would not listen to Balaam. Indeed, he blessed you repeatedly, and I delivered you out of his hand.'",
      "links": "<a href='/AIV/4/23/11-12'>Num. 23:11-12</a>; <a href='/AIV/4/24/10-11'>Num. 24:10-11</a>",
      "comment": "Blessing in place of cursing points ahead to God’s power over evil intentions and the beatitudes in the Gospels (cf. Matt. 5:10-12)."
    },
    {
      "pk": 6024011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 11,
      "text": "'When you went over the Jordan and came to Jericho, the people of Jericho fought against you, with the Amorites, Perizzites, Canaanites, Hittites, Girgashites, Hivites, and Jebusites. But I gave them into your hand.'",
      "links": "<a href='/AIV/6/3/14-17'>Josh. 3:14-17</a>; <a href='/AIV/6/6/1-21'>Josh. 6:1-21</a>",
      "comment": "Direct supernatural victory in Jericho emphasizes divine intervention in conquest. Echoes the need for faith and obedience."
    },
    {
      "pk": 6024012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 12,
      "text": "'Then I sent the hornet before you, which drove them out from before you—as well as the two kings of the Amorites—not with your sword or with your bow.'",
      "links": "<a href='/AIV/2/23/28'>Exod. 23:28</a>; <a href='/AIV/5/7/20'>Deut. 7:20</a>",
      "comment": "The ‘hornet’ is a symbol of God fighting for Israel, just as He fights for His people in the battle against sin and evil."
    },
    {
      "pk": 6024013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 13,
      "text": "'I gave you a land for which you did not labor and cities that you did not build, and you live in them. You eat from vineyards and olive groves that you did not plant.'",
      "links": "<a href='/AIV/5/6/10-11'>Deut. 6:10-11</a>",
      "comment": "God provides more than Israel's effort deserves—an Old Testament type of grace, later fulfilled perfectly in Christ (cf. Eph. 2:8-9)."
    },
    {
      "pk": 6024014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 14,
      "text": "Now therefore, fear the LORD and serve Him in sincerity and in truth. Put away the gods which your ancestors served beyond the Euphrates and in Egypt, and serve the LORD.",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>; <a href='/AIV/24/4/1'>Jer. 4:1</a>",
      "comment": "Sincerity in worship anticipates Jesus’ call for worship 'in spirit and truth' (John 4:23-24)."
    },
    {
      "pk": 6024015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 15,
      "text": "But if it seems evil to you to serve the LORD, choose this day whom you will serve—whether the gods your ancestors served beyond the Euphrates or the gods of the Amorites in whose land you live. But as for me and my house, we will serve the LORD.",
      "links": "<a href='/AIV/5/30/19'>Deut. 30:19</a>; <a href='/AIV/24/42/13-16'>Jer. 42:13-16</a>",
      "comment": "Joshua’s public declaration highlights personal and communal faithfulness—implications for leadership and the enduring witness of the faith in the home."
    },
    {
      "pk": 6024016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 16,
      "text": "Then the people answered, 'Far be it from us that we should forsake the LORD to serve other gods!'",
      "links": "<a href='/AIV/2/19/8'>Exod. 19:8</a>",
      "comment": "Their affirmation recalls the covenant promises at Sinai, but later apostasy shows the importance of perseverance and true fidelity."
    },
    {
      "pk": 6024017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 17,
      "text": "For the LORD our God is He who brought us and our ancestors up out of the land of Egypt, out of the house of slavery, and who did those great signs in our sight. He kept us safe on all the way that we went and among all the peoples through whom we passed.",
      "links": "<a href='/AIV/6/2/10-11'>Josh. 2:10-11</a>; <a href='/AIV/2/13/3'>Exod. 13:3</a>",
      "comment": "Their confession is a creedal summary: recall God’s mighty acts—basis for faith. Such confessions later become liturgical in Christian worship."
    },
    {
      "pk": 6024018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 18,
      "text": "And the LORD drove out before us all the peoples, the Amorites who lived in the land. Therefore, we also will serve the LORD, for He is our God.",
      "links": "<a href='/AIV/5/7/1-2'>Deut. 7:1-2</a>",
      "comment": "The Lord’s exclusive claim is foundational for biblical monotheism, mirrored in the demand for exclusive allegiance to God in the New Covenant."
    },
    {
      "pk": 6024019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 19,
      "text": "But Joshua said to the people, 'You cannot serve the LORD, for He is a holy God. He is a jealous God. He will not forgive your transgressions or your sins.'",
      "links": "<a href='/AIV/2/34/14'>Exod. 34:14</a>; <a href='/AIV/3/10/3'>Lev. 10:3</a>",
      "comment": "Joshua recognizes the holiness of God and the seriousness of covenant breaking. True worship requires deep interior conversion and repentance—foreshadowing Christ’s calls for interior transformation."
    },
    {
      "pk": 6024020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 20,
      "text": "'If you forsake the LORD and serve foreign gods, then He will turn and do you harm and consume you, after having done you good.'",
      "links": "<a href='/AIV/5/28/63'>Deut. 28:63</a>; <a href='/AIV/7/2/13-15'>Judg. 2:13-15</a>",
      "comment": "Divine justice is real, and falling away brings consequences. The warning reinforces God’s desire for perseverance and covenant obedience."
    },
    {
      "pk": 6024021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 21,
      "text": "The people said to Joshua, 'No! We will serve the LORD.'",
      "links": "<a href='/AIV/2/19/8'>Exod. 19:8</a>; <a href='/AIV/5/26/17'>Deut. 26:17</a>",
      "comment": "The repeated affirmation is intentional, showing the importance of vocal, communal commitment—like the recitation of the Creed."
    },
    {
      "pk": 6024022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 22,
      "text": "Then Joshua said to the people, 'You are witnesses against yourselves that you have chosen the LORD, to serve Him.' They said, 'We are witnesses.'",
      "links": "<a href='/AIV/5/26/17-18'>Deut. 26:17-18</a>",
      "comment": "The notion of witnesses highlights personal responsibility and the need for the community’s testimony in officiating important spiritual decisions."
    },
    {
      "pk": 6024023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 23,
      "text": "'Now then,' he said, 'put away the foreign gods that are among you and incline your hearts to the LORD, the God of Israel.'",
      "links": "<a href='/AIV/1/35/2'>Gen. 35:2</a>; <a href='/AIV/5/30/6'>Deut. 30:6</a>",
      "comment": "This call for purification and ‘inclining hearts’ refers to an interior transformation—an Old Testament root of conversion."
    },
    {
      "pk": 6024024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 24,
      "text": "And the people said to Joshua, 'The LORD our God we will serve, and His voice we will obey.'",
      "links": "<a href='/AIV/5/27/10'>Deut. 27:10</a>",
      "comment": "Obedience to the voice of God (cf. Deut. 27:10) becomes a test of faith. The voice of God finds new meaning later in the words of Christ (John 10:27)."
    },
    {
      "pk": 6024025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 25,
      "text": "So Joshua made a covenant with the people that day, and set them a statute and an ordinance at Shechem.",
      "links": "<a href='/AIV/5/29/1'>Deut. 29:1</a>; <a href='/AIV/6/8/33-35'>Josh. 8:33-35</a>",
      "comment": "Renewal of covenant and setting of laws foreshadow the need for continual renewal in the faith through established acts and rites."
    },
    {
      "pk": 6024026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 26,
      "text": "And Joshua wrote these words in the Book of the Law of God. He took a large stone and set it up there under the oak that was by the sanctuary of the LORD.",
      "links": "<a href='/AIV/1/35/4'>Gen. 35:4</a>; <a href='/AIV/6/4/3'>Josh. 4:3</a>",
      "comment": "Writing the covenant down and setting a physical memorial highlights the importance of sacred tradition and monuments in preserving faith."
    },
    {
      "pk": 6024027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 27,
      "text": "Joshua said to all the people, 'Look! This stone will be a witness against us, for it has heard all the words the LORD has spoken to us. It shall be a witness against you, lest you deny your God.'",
      "links": "<a href='/AIV/1/31/44-48'>Gen. 31:44-48</a>",
      "comment": "A physical object as a witness underscores the concrete and sacramental aspect of memory in God’s covenant. Anticipates the use of physical, visible signs in worship."
    },
    {
      "pk": 6024028,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 28,
      "text": "So Joshua sent the people away, each to his own inheritance.",
      "links": "<a href='/AIV/6/22/6'>Josh. 22:6</a>",
      "comment": "The distribution of inheritance fulfills God’s promise, prefiguring the eternal inheritance in Christ (cf. Heb. 9:15)."
    },
    {
      "pk": 6024029,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 29,
      "text": "After these things, Joshua the son of Nun, the servant of the LORD, died at the age of one hundred and ten years.",
      "links": "<a href='/AIV/1/50/26'>Gen. 50:26</a>",
      "comment": "Joshua’s death echoes Joseph’s (Gen. 50:26), highlighting the continuity of the chosen leaders until the time of fulfillment."
    },
    {
      "pk": 6024030,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 30,
      "text": "They buried him in his own inheritance at Timnath-serah, which is in the hill country of Ephraim, north of Mount Gaash.",
      "links": "<a href='/AIV/6/19/50'>Josh. 19:50</a>",
      "comment": "Joshua is buried on his allotted land—fulfillment of what was promised and received."
    },
    {
      "pk": 6024031,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 31,
      "text": "Israel served the LORD all the days of Joshua and all the days of the elders who outlived Joshua and had known all the work that the LORD did for Israel.",
      "links": "<a href='/AIV/7/2/7'>Judg. 2:7</a>",
      "comment": "The faithfulness of the people is often tied to the living memory and witness of godly leaders."
    },
    {
      "pk": 6024032,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 32,
      "text": "The bones of Joseph, which the people of Israel brought up from Egypt, were buried at Shechem, in the portion of land that Jacob bought from the sons of Hamor, the father of Shechem, for a hundred pieces of silver. It became the inheritance of the descendants of Joseph.",
      "links": "<a href='/AIV/1/33/19'>Gen. 33:19</a>; <a href='/AIV/2/13/19'>Exod. 13:19</a>",
      "comment": "Joseph’s bones being buried in the promised land fulfills long-standing promises, affirming God’s faithfulness beyond generations."
    },
    {
      "pk": 6024033,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 24,
      "verse": 33,
      "text": "And Eleazar the son of Aaron died. They buried him at Gibeah, the city that had been given to his son Phinehas, which was in the hill country of Ephraim.",
      "links": "<a href='/AIV/6/21/21'>Josh. 21:21</a>",
      "comment": "The passing of Eleazar, Aaron’s son and high priest, marks the end of an era; the priesthood’s centrality in Israel’s identity is clear here—hinting at the importance of continual, visible priestly leadership and succession."
    }
  ],
  "translatedAt": "2025-12-24T02:30:11.426Z"
}