{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 18,
  "verses": [
    {
      "pk": 6018001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 1,
      "text": "Then the entire congregation of the Israelites assembled at Shiloh, and set up the Tent of Meeting there. The land was now subdued before them.",
      "links": "<a href='/AIV/7/21/19'>Judg. 21:19</a>; <a href='/AIV/9/1/3'>1 Sam. 1:3</a>",
      "comment": "Shiloh becomes the central place of worship—a sign of God's dwelling among His people. The Tent of Meeting anticipates the Temple, which prefigures Christ who 'tabernacles' among us (John 1:14). The gathering of all Israel is significant for unity in faith and worship."
    },
    {
      "pk": 6018002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 2,
      "text": "But there remained seven tribes among the Israelites that had not yet received their inheritance.",
      "links": "<a href='/AIV/6/14/1'>Josh. 14:1</a>; <a href='/AIV/6/17/5-6'>Josh. 17:5-6</a>",
      "comment": "The division of the land continues, and the delay in possession is an occasion for Joshua’s leadership. This points to the need for spiritual leadership and order even when blessings are available, recalling the role of shepherds and overseers in the Church (Acts 20:28)."
    },
    {
      "pk": 6018003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 3,
      "text": "Joshua said to the Israelites, 'How long will you put off going in to take possession of the land that the LORD, the God of your ancestors, has given you?'",
      "links": "<a href='/AIV/6/1/2-9'>Josh. 1:2-9</a>; <a href='/AIV/2/6/8'>Ex. 6:8</a>",
      "comment": "Joshua exhorts them not to neglect God’s promise, reminding that faith must be active, not passive (cf. James 2:17). The reference to 'the God of your ancestors' includes all generations, showing God's faithfulness, and spiritual continuity."
    },
    {
      "pk": 6018004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 4,
      "text": "'Choose three men from each tribe, and I will send them out that they may go throughout the land and write a description of it according to its inheritance. Then they shall return to me.'",
      "links": "<a href='/AIV/4/13/2'>Num. 13:2</a>; <a href='/AIV/6/18/6'>Josh. 18:6</a>",
      "comment": "Joshua establishes orderly procedure and written record for dividing the inheritance. This methodical approach models the importance of structure and solid foundation, symbolizing the careful establishment of God's people."
    },
    {
      "pk": 6018005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 5,
      "text": "'They shall divide it into seven portions. Judah will remain in its territory on the south, and the house of Joseph will remain in its territory on the north.'",
      "links": "<a href='/AIV/6/15/1'>Josh. 15:1</a>; <a href='/AIV/6/16/1'>Josh. 16:1</a>",
      "comment": "Specific boundaries for Judah and Joseph show the importance of tradition and continuity in God's plan. The division points to unity in diversity within God's people, anticipating the one flock with many members (John 10:16; 1 Cor. 12:12)."
    },
    {
      "pk": 6018006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 6,
      "text": "'Describe the land in seven portions, and bring the description to me. I will cast lots for you here before the LORD our God.'",
      "links": "<a href='/AIV/3/16/8'>Lev. 16:8</a>; <a href='/AIV/20/16/33'>Prov. 16:33</a>; <a href='/AIV/44/1/26'>Acts 1:26</a>",
      "comment": "Casting lots before the LORD shows reliance on divine providence, a practice later replaced by manifest spiritual leadership in the New Covenant. The impartiality and trust in God reflect faith in divine guidance for the community."
    },
    {
      "pk": 6018007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 7,
      "text": "'But the Levites have no portion among you, for the priesthood of the LORD is their inheritance. Gad, Reuben, and half of the tribe of Manasseh have already received their inheritance east of the Jordan, which Moses the servant of the LORD gave them.'",
      "links": "<a href='/AIV/4/18/23-24'>Num. 18:23-24</a>; <a href='/AIV/6/13/8'>Josh. 13:8</a>",
      "comment": "Levites are set apart for priestly service—showing the dignity of priesthood as a spiritual inheritance. This prefigures Christ’s eternal priesthood and the special role of those devoted wholly to spiritual service (Heb. 7:24-25)."
    },
    {
      "pk": 6018008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 8,
      "text": "So the men arose and went, and Joshua instructed those who would write the description of the land, saying, 'Go and walk through the land, write a description, and return to me. I will cast lots for you here before the LORD at Shiloh.'",
      "links": "<a href='/AIV/6/14/2'>Josh. 14:2</a>; <a href='/AIV/6/18/10'>Josh. 18:10</a>",
      "comment": "The physical survey and written records highlight the importance of accurate testimony and communal accountability. The central role of the sanctuary at Shiloh again underscores proper worship and sacred authority."
    },
    {
      "pk": 6018009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 9,
      "text": "The men went and passed through the land, and wrote its description in a book by towns in seven portions. Then they returned to Joshua at the camp at Shiloh.",
      "links": "<a href='/AIV/6/19/51'>Josh. 19:51</a>",
      "comment": "The written record parallels the importance of Scripture and tradition for the faithful transmission of truth. Preservation of history ensures a living memory, safeguarding identity."
    },
    {
      "pk": 6018010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 10,
      "text": "Joshua cast lots for them at Shiloh before the LORD, and there Joshua apportioned the land to the Israelites, according to their divisions.",
      "links": "<a href='/AIV/6/14/2'>Josh. 14:2</a>; <a href='/AIV/6/19/51'>Josh. 19:51</a>",
      "comment": "Joshua’s role as mediator and judge, acting before the Lord, foreshadows spiritual leadership established for order and unity. This anticipates future leaders who guide the people under God’s authority (cf. Matt. 16:19)."
    },
    {
      "pk": 6018011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 11,
      "text": "The lot of the tribe of Benjamin came up according to their clans. The territory allotted to them fell between Judah and Joseph.",
      "links": "<a href='/AIV/6/18/28'>Josh. 18:28</a>; <a href='/AIV/9/10/27'>1 Sam. 10:27</a>",
      "comment": "Benjamin’s location between Judah and Joseph has significant messianic implications, as Jerusalem—later chosen by God—lies within its territory. This territory will become central for worship, governance, and redemption."
    },
    {
      "pk": 6018012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 12,
      "text": "Their northern boundary began at the Jordan, followed the northern slope of Jericho, went upward through the hill country westward, ending at the wilderness of Beth-aven.",
      "links": "<a href='/AIV/6/16/1'>Josh. 16:1</a>",
      "comment": "The detailed boundaries reflect careful stewardship of God’s gifts. The connection to Jericho and Beth-aven points to sites of great spiritual events and future significance."
    },
    {
      "pk": 6018013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 13,
      "text": "From there the boundary passed southward to Luz, to the southern slope of Luz (that is, Bethel), then goes down to Ataroth-addar, near the hill that is south of lower Beth-horon.",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>; <a href='/AIV/6/16/2'>Josh. 16:2</a>",
      "comment": "Bethel ('house of God') is a site set apart for significant encounters with God. Its placement in Benjamin’s territory continues the theme of God’s dwelling among His people and foreshadows later revelations."
    },
    {
      "pk": 6018014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 14,
      "text": "Then it went down to the western slope south of Beth-horon, and ended at Kiriath-baal (that is, Kiriath-jearim), a city of the children of Judah. This was the western boundary.",
      "links": "<a href='/AIV/6/15/60'>Josh. 15:60</a>; <a href='/AIV/9/7/1'>1 Sam. 7:1</a>",
      "comment": "The boundary’s encounter with Judah’s cities reveals inter-tribal connections, important for future unity. Kiriath-jearim would later house the Ark, linking land division with God’s presence and covenant."
    },
    {
      "pk": 6018015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 15,
      "text": "The southern boundary started at the edge of Kiriath-jearim, ran west, and went out to the spring of the waters of Nephtoah.",
      "links": "<a href='/AIV/6/15/9'>Josh. 15:9</a>",
      "comment": "The boundary by water sources highlights the provision and blessing in the land. Water is often a sign of purification and life throughout Scripture (see John 4:14; Ezek. 36:25)."
    },
    {
      "pk": 6018016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 16,
      "text": "Then it went down to the foot of the mountain that faces the Valley of the Son of Hinnom, north of the Valley of Rephaim, and ran down the Valley of Hinnom to the southern slope of the Jebusite city, that is, Jerusalem, then down to En-rogel.",
      "links": "<a href='/AIV/10/15/8'>2 Sam. 15:8</a>; <a href='/AIV/19/48/2'>Ps. 48:2</a>",
      "comment": "The Valley of Hinnom (later, Gehenna) becomes a symbolic place of judgment. Jerusalem’s location foreshadows its role as the center of worship, kingship, and messianic prophecy (Ps. 2:6; Lk. 9:31)."
    },
    {
      "pk": 6018017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 17,
      "text": "It runs north to En-shemesh and goes out to Geliloth, opposite the ascent of Adummim, down to the Stone of Bohan son of Reuben.",
      "links": "<a href='/AIV/6/15/7'>Josh. 15:7</a>",
      "comment": "Continuing the boundary, landmarks such as the ascent of Adummim and the Stone of Bohan preserve historical memory, showing the importance of remembrance in faith."
    },
    {
      "pk": 6018018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 18,
      "text": "Then it passes to the northern slope of Beth-arabah, and down into the Arabah.",
      "links": "<a href='/AIV/6/15/6'>Josh. 15:6</a>",
      "comment": "Traveling through the Arabah, the story shows the breadth of God’s generosity to His people. The persistence of boundaries affirms the need for order and mutual respect."
    },
    {
      "pk": 6018019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 19,
      "text": "Then the boundary continued on the north to the slope of Beth-hoglah, and ended at the northern bay of the Dead Sea, at the south mouth of the Jordan. This was the southern border.",
      "links": "<a href='/AIV/6/15/6'>Josh. 15:6</a>; <a href='/AIV/6/16/7'>Josh. 16:7</a>",
      "comment": "The Dead Sea boundary represents limitation imposed by nature, yet within God's providence. It points to order in creation and redemption history."
    },
    {
      "pk": 6018020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 20,
      "text": "The Jordan marked the boundary on the east side. This was the inheritance of the tribes of Benjamin, according to their clans.",
      "links": "<a href='/AIV/6/13/32'>Josh. 13:32</a>",
      "comment": "The Jordan is a major physical and spiritual divider in Israel's history (cf. Joshua 3:14-17; Matt. 3:13). Crossing it often signifies entering new covenant blessings."
    },
    {
      "pk": 6018021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 21,
      "text": "Now the towns of the tribe of Benjamin, by their clans, were Jericho, Beth-hoglah, Emek-keziz,",
      "links": "<a href='/AIV/6/2/1'>Josh. 2:1</a>",
      "comment": "Listing the cities begins with Jericho—a city of God’s mighty act—reminding of miracles wrought for the faithful."
    },
    {
      "pk": 6018022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 22,
      "text": "Beth-arabah, Zemaraim, Bethel,",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "Bethel is central in patriarchal history as the site of Jacob’s vision—reaffirming God’s continuity and presence with His people through generations."
    },
    {
      "pk": 6018023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 23,
      "text": "Avvim, Parah, Ophrah,",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>",
      "comment": "Ophrah, later the home of Gideon, becomes a site where God calls His servant, showing the importance of each city in salvation history."
    },
    {
      "pk": 6018024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 24,
      "text": "Kephar-ammoni, Ophni, Geba—twelve towns with their villages.",
      "links": "<a href='/AIV/9/13/3'>1 Sam. 13:3</a>",
      "comment": "The number twelve mirrors the twelve tribes, providing symmetry and echoing the twelve apostles, strengthening unity and order."
    },
    {
      "pk": 6018025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 25,
      "text": "Gibeon, Ramah, Beeroth,",
      "links": "<a href='/AIV/6/9/17'>Josh. 9:17</a>",
      "comment": "Gibeon was notable for its covenant with Joshua, and Ramah for its prophetic role. Each city may be seen as a unique facet in the unfolding plan of redemption."
    },
    {
      "pk": 6018026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 26,
      "text": "Mizpah, Chephirah, Mozah,",
      "links": "<a href='/AIV/9/7/5'>1 Sam. 7:5</a>",
      "comment": "Mizpah is later a key site for Samuel’s ministry and for Israel’s repentance, showing spiritual renewal through right relationship with God."
    },
    {
      "pk": 6018027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 27,
      "text": "Rekem, Irpeel, Taralah,",
      "links": "",
      "comment": "These towns are specific to Benjamin’s inheritance, highlighting the completeness of the division."
    },
    {
      "pk": 6018028,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 18,
      "verse": 28,
      "text": "Zelah, Haeleph, Jebus (that is, Jerusalem), Gibeah and Kiriath—fourteen towns with their villages. This was the inheritance of Benjamin according to its clans.",
      "links": "<a href='/AIV/9/10/26'>1 Sam. 10:26</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "Jerusalem, in Benjamin’s territory, is the future epicenter of worship and the coming of the Messiah. The completeness of the inheritance, with all its towns, foreshadows the fullness of spiritual blessings, pointing to the unity of God’s people centered around the chosen city and sacred leadership."
    }
  ],
  "translatedAt": "2025-12-24T02:26:18.948Z"
}