{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 13,
  "verses": [
    {
      "pk": 6013001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 1,
      "text": "Now Joshua was old and advanced in years. The Lord said to him, 'You are old and advanced in years, and much of the land still remains to be possessed.'",
      "links": "<a href='/AIV/6/14/10'>Josh. 14:10</a>",
      "comment": "The Lord’s direct speech to Joshua underlines his leadership and accountability. Even in advanced age, God’s mission is not finished, symbolizing the ongoing call for faithfulness. See also Num. 27:18-23."
    },
    {
      "pk": 6013002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 2,
      "text": "'This is the land that still remains: all the regions of the Philistines, and all that of the Geshurites—'",
      "links": "<a href='/AIV/7/3/1-3'>Judg. 3:1-3</a>",
      "comment": "The mention of the Philistines and Geshurites signals ongoing struggles with these peoples, which will occupy Israel’s history further. See Judg. 3:1-3."
    },
    {
      "pk": 6013003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 3,
      "text": "from the Shihor, which is east of Egypt, northward to the border of Ekron (it is counted as Canaanite), five lords of the Philistines—the Gazite, the Ashdodite, the Ashkelonite, the Gittite, and the Ekronite; also the Avvim;",
      "links": "<a href='/AIV/1/10/14'>Gen. 10:14</a>; <a href='/AIV/6/11/22'>Josh. 11:22</a>",
      "comment": "This specific enumeration shows territorial details still unconquered, representing lingering threats but also opportunities for faithfulness."
    },
    {
      "pk": 6013004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 4,
      "text": "in the south, all the land of the Canaanites, and Mearah, which belongs to the Sidonians, as far as Aphek, to the border of the Amorites;",
      "links": "<a href='/AIV/7/1/31'>Judg. 1:31</a>",
      "comment": "The towns named are in Phoenicia, highlighting regions Israel did not possess until later. God’s promise encompasses more than realized in Joshua’s time."
    },
    {
      "pk": 6013005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 5,
      "text": "and the land of the Gebalites, and all Lebanon, toward the sunrise, from Baal-gad below Mount Hermon as far as Lebo-hamath.",
      "links": "<a href='/AIV/1/10/10'>Gen. 10:10</a>; <a href='/AIV/6/11/17'>Josh. 11:17</a>",
      "comment": "God’s gift is wide; his people’s inheritance is expansive, waiting to be fulfilled in obedience. The reference to Mount Hermon has later spiritual significance (see Ps. 133:3)."
    },
    {
      "pk": 6013006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 6,
      "text": "All the inhabitants of the hill country from Lebanon to Misrephoth-maim, all the Sidonians, I myself will drive them out from before the people of Israel. Only allot the land to Israel for an inheritance, as I have commanded you.",
      "links": "<a href='/AIV/2/23/28-31'>Exod. 23:28-31</a>",
      "comment": "God reaffirms He will accomplish the conquest—Israel’s calling is to trust and obey, foreshadowing themes of grace and inheritance in the New Testament."
    },
    {
      "pk": 6013007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 7,
      "text": "Now therefore divide this land for an inheritance to the nine tribes and half the tribe of Manasseh.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>; <a href='/AIV/6/14/2'>Josh. 14:2</a>",
      "comment": "Inheritance is given before the conquest is completed, reflecting the security of God’s promises. It anticipates the spiritual inheritance of the Church (see Eph. 1:13-14)."
    },
    {
      "pk": 6013008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 8,
      "text": "Together with the tribe of Reuben and the tribe of Gad, the other half-tribe of Manasseh had received their inheritance, which Moses gave them beyond the Jordan eastward, just as Moses the servant of the Lord gave them—",
      "links": "<a href='/AIV/4/34/14-15'>Num. 34:14-15</a>",
      "comment": "These tribes' early inheritance east of the Jordan demonstrates both diversity and unity within God's people—a theme explored more fully in New Testament teaching on the Church (see 1 Cor. 12:12-13)."
    },
    {
      "pk": 6013009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 9,
      "text": "from Aroer, which is on the edge of the valley of the Arnon, and the city in the middle of the valley, and all the tableland of Medeba as far as Dibon;",
      "links": "<a href='/AIV/4/32/3'>Num. 32:3</a>",
      "comment": "Specific cities are listed to affirm the historical authenticity. Medeba and Dibon are repeatedly referenced in the context of Israel's possession (see Isa. 15:2)."
    },
    {
      "pk": 6013010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 10,
      "text": "and all the cities of Sihon king of the Amorites, who reigned in Heshbon, as far as the border of the Ammonites;",
      "links": "<a href='/AIV/4/21/21-26'>Num. 21:21-26</a>",
      "comment": "The conquests under Moses are recounted here, cementing Israel’s identity as one people journeying with the Lord before setting foot in the land."
    },
    {
      "pk": 6013011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 11,
      "text": "and Gilead, and the region of the Geshurites and Maacathites, all Mount Hermon, and all Bashan as far as Salecah—",
      "links": "<a href='/AIV/5/3/10'>Deut. 3:10</a>",
      "comment": "These lands beyond the Jordan prefigure a fuller promise, as Christ promises a new and greater inheritance."
    },
    {
      "pk": 6013012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 12,
      "text": "all the kingdom of Og in Bashan, who reigned in Ashtaroth and Edrei (he was one of the remnant of the Rephaim), whom Moses defeated and drove out.",
      "links": "<a href='/AIV/4/21/33-35'>Num. 21:33-35</a>",
      "comment": "Og’s defeat is crucial in Israel’s memory, marking God’s victory over giants or strongholds—see Ps. 135:10-12 for further reflection."
    },
    {
      "pk": 6013013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 13,
      "text": "Yet the people of Israel did not drive out the Geshurites or the Maacathites; these continue to dwell among Israel to this day.",
      "links": "<a href='/AIV/10/3/3'>2 Sam. 3:3</a>",
      "comment": "Incomplete obedience leads to difficulties later—the lesson points to the need for a complete faithfulness."
    },
    {
      "pk": 6013014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 14,
      "text": "But to the tribe of Levi alone he gave no inheritance. The offerings by fire to the Lord, the God of Israel, are their inheritance, as he spoke to them.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "The Levites' special vocation teaches that spiritual service and proximity to God is the true inheritance, a pattern fulfilled in Christ the eternal High Priest (<a href='/AIV/58/7/24-25'>Heb. 7:24-25</a>)."
    },
    {
      "pk": 6013015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 15,
      "text": "Moses gave to the tribe of the sons of Reuben, according to their families, their portion.",
      "links": "<a href='/AIV/4/32/33-37'>Num. 32:33-37</a>",
      "comment": "Allocation of land by family foreshadows deeper unity and communion that Christ would offer (see John 17:21)."
    },
    {
      "pk": 6013016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 16,
      "text": "Their territory was from Aroer, on the edge of the valley of the Arnon, and the city that is in the middle of the valley, and all the tableland by Medeba;",
      "links": "<a href='/AIV/4/21/28'>Num. 21:28</a>",
      "comment": "A detailed listing grounds the promise in reality—God’s faith is shown by fulfilling tangible promises."
    },
    {
      "pk": 6013017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 17,
      "text": "with Heshbon, and all its cities that are in the tableland: Dibon, Bamoth-baal, Beth-baal-meon,",
      "links": "<a href='/AIV/4/32/34-38'>Num. 32:34-38</a>",
      "comment": "These cities later appear in the prophetic writings as centers of idolatry; possession does not guarantee faithfulness—only ongoing obedience does."
    },
    {
      "pk": 6013018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 18,
      "text": "Jahaz, Kedemoth, Mephaath,",
      "links": "<a href='/AIV/24/48/21'>Jer. 48:21</a>",
      "comment": "Later, the prophets will name these towns as sites of judgment—showing that unfaithfulness brings consequences."
    },
    {
      "pk": 6013019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 19,
      "text": "Kiriathaim, Sibmah, Zereth-shahar on the hill of the valley,",
      "links": "<a href='/AIV/24/48/23'>Jer. 48:23</a>",
      "comment": "These sites are found in later oracles regarding Moab (see also Isa. 15)."
    },
    {
      "pk": 6013020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 20,
      "text": "Beth-peor, the slopes of Pisgah, and Beth-jeshimoth,",
      "links": "<a href='/AIV/5/34/6'>Deut. 34:6</a>",
      "comment": "Beth-peor becomes infamous as the site of Israel’s idolatry (see Num. 25:1-3), reminding us that sacred inheritance is often challenged by sin and compromise."
    },
    {
      "pk": 6013021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 21,
      "text": "all the cities of the tableland, and all the kingdom of Sihon king of the Amorites, who reigned in Heshbon, whom Moses defeated with the leaders of Midian—Evi, Rekem, Zur, Hur, and Reba, the princes of Sihon, who lived in the land.",
      "links": "<a href='/AIV/4/31/8'>Num. 31:8</a>",
      "comment": "God’s people are called to confront and defeat sin as part of their calling."
    },
    {
      "pk": 6013022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 22,
      "text": "Balaam also, the son of Beor, the diviner, the people of Israel killed with the sword among the rest of their slain.",
      "links": "<a href='/AIV/4/31/8'>Num. 31:8</a>; <a href='/AIV/61/2/15'>2 Pet. 2:15</a>",
      "comment": "Balaam’s death is significant; disobedient spiritual leaders face judgment, contrasting Christ who is the true, faithful Prophet."
    },
    {
      "pk": 6013023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 23,
      "text": "And the border of the people of Reuben was the Jordan as a boundary. This was the inheritance of the people of Reuben, according to their families, with their cities and villages.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>",
      "comment": "Land and inheritance are tightly linked throughout Scripture, pointing to God's faithfulness."
    },
    {
      "pk": 6013024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 24,
      "text": "Moses gave to the tribe of Gad, to the people of Gad, according to their families, their portion.",
      "links": "<a href='/AIV/4/32/34-36'>Num. 32:34-36</a>",
      "comment": "Gad's inheritance, like Reuben’s, emphasizes that God’s blessing is distributed through His chosen means and order."
    },
    {
      "pk": 6013025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 25,
      "text": "Their territory was Jazer, and all the cities of Gilead, and half the land of the Ammonites, to Aroer, which is east of Rabbah,",
      "links": "<a href='/AIV/7/11/33'>Judg. 11:33</a>",
      "comment": "This area becomes significant in Judges. Continuous struggle for the land points to the ultimate rest in Christ (see Heb. 4:8-10)."
    },
    {
      "pk": 6013026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 26,
      "text": "and from Heshbon to Ramath-mizpeh and Betonim, and from Mahanaim to the territory of Debir;",
      "links": "<a href='/AIV/6/21/38'>Josh. 21:38</a>",
      "comment": "Listing boundaries and towns emphasizes historical accuracy and God’s fulfillment of promise."
    },
    {
      "pk": 6013027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 27,
      "text": "in the valley: Beth-haram, Beth-nimrah, Succoth, and Zaphon, the rest of the kingdom of Sihon king of Heshbon, with the Jordan as a boundary to the end of the Sea of Chinnereth, eastward beyond the Jordan.",
      "links": "<a href='/AIV/4/32/36'>Num. 32:36</a>",
      "comment": "Chinnereth is known in the New Testament as the Sea of Galilee—the backdrop for many events in Christ’s ministry."
    },
    {
      "pk": 6013028,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 28,
      "text": "This is the inheritance of the people of Gad according to their families, with their cities and villages.",
      "links": "",
      "comment": "Orderly distribution hints at a divine structure—a foretaste of the order Christ gives His Church."
    },
    {
      "pk": 6013029,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 29,
      "text": "Moses gave to the half-tribe of Manasseh; it was for the half-tribe of the sons of Manasseh according to their families.",
      "links": "<a href='/AIV/4/32/39-42'>Num. 32:39-42</a>",
      "comment": "The mention of Manasseh’s half-tribe reminds us that God’s blessings are apportioned with wisdom and care."
    },
    {
      "pk": 6013030,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 30,
      "text": "Their territory was from Mahanaim, through all Bashan, all the kingdom of Og king of Bashan, and all the villages of Jair, which are in Bashan, sixty cities,",
      "links": "<a href='/AIV/4/32/41'>Num. 32:41</a>",
      "comment": "Sixty fortified cities speaks to the magnitude of God’s blessing for faithfulness."
    },
    {
      "pk": 6013031,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 31,
      "text": "and half of Gilead, and Ashtaroth, and Edrei, the cities of the kingdom of Og in Bashan; these were allotted to the people of Machir the son of Manasseh, for half of the sons of Machir according to their families.",
      "links": "<a href='/AIV/4/32/40'>Num. 32:40</a>",
      "comment": "Machir’s inheritance is an early example of the particular callings given to each portion of God’s people—hinting at the diversity of service in the one body of Christ."
    },
    {
      "pk": 6013032,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 32,
      "text": "These are the inheritances that Moses distributed in the plains of Moab, beyond the Jordan east of Jericho.",
      "links": "<a href='/AIV/4/36/13'>Num. 36:13</a>",
      "comment": "Moses, as God’s mediator, arranges the inheritance before entrance into the Promised Land. This typology points ahead to the mediation of Christ."
    },
    {
      "pk": 6013033,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 13,
      "verse": 33,
      "text": "But to the tribe of Levi Moses gave no inheritance; the Lord, the God of Israel, is their inheritance, as he said to them.",
      "links": "<a href='/AIV/5/10/9'>Deut. 10:9</a>; <a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "The Levites' unique calling sets the pattern for those given wholly to God’s service, emphasizing the value of priesthood and spiritual devotion—a theme fulfilled in the New Testament by Christ, our perfect High Priest (<a href='/AIV/58/4/14-16'>Heb. 4:14-16</a>)."
    }
  ],
  "translatedAt": "2025-12-24T02:23:51.240Z"
}