{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 48,
  "verses": [
    {
      "pk": 2484801,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 1,
      "text": "Concerning Moab: This is what the LORD of Hosts, the God of Israel, says: Woe to Nebo, for it is ruined! Kiriathaim is shamed and captured; the high fortress is disgraced and broken down.",
      "links": "<a href='/AIV/23/15/1'>Isa. 15:1</a>; <a href='/AIV/24/25/21'>Jer. 25:21</a>",
      "comment": "The prophets often pronounce judgment on nations surrounding Israel, showing God's authority over all peoples and not just Israel. Nebo and Kiriathaim were major Moabite cities, indicating the completeness of judgment."
    },
    {
      "pk": 2484802,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 2,
      "text": "There is no more praise for Moab; in Heshbon they have devised disaster against her: 'Come, let us cut her off from being a nation.' You also, O Madmen, shall be silenced; the sword will pursue you.",
      "links": "<a href='/AIV/24/49/3'>Jer. 49:3</a>",
      "comment": "Heshbon was a center of leadership in Moab and a place of counsel. The threat against Madmen highlights the completeness of the destruction."
    },
    {
      "pk": 2484803,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 3,
      "text": "A voice of crying will be heard from Horonaim: 'Devastation and great destruction!'",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "Horonaim, a city of Moab, is noted for the mournful cries due to coming judgment. This shows the comprehensive nature of God’s justice."
    },
    {
      "pk": 2484804,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 4,
      "text": "Moab is shattered; her little ones cry out.",
      "links": "<a href='/AIV/23/15/4'>Isa. 15:4</a>",
      "comment": "The suffering of the 'little ones' is a poignant image, calling to mind God’s compassion but also his righteous judgment upon sin."
    },
    {
      "pk": 2484805,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 5,
      "text": "For on the ascent of Luhith, they go up weeping; for on the descent of Horonaim, they have heard the distress of their cry of destruction.",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "The ascent and descent signify fleeing and the all-encompassing nature of the catastrophe. This echoes God’s warning that judgment is thorough."
    },
    {
      "pk": 2484806,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 6,
      "text": "'Flee! Save your lives, be like a wild donkey in the desert!'",
      "links": "<a href='/AIV/24/2/24'>Jer. 2:24</a>",
      "comment": "Flight to the desert indicates total defeat. The imagery of the wild donkey suggests isolation."
    },
    {
      "pk": 2484807,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 7,
      "text": "Because you trusted in your works and in your treasures, you also will be captured. And Chemosh shall go into exile, his priests and his officials together.",
      "links": "<a href='/AIV/24/49/3'>Jer. 49:3</a>; <a href='/AIV/28/10/5'>Hos. 10:5</a>",
      "comment": "Moab’s sin is idolatry and trust in material strength. Even Chemosh, their god, is powerless. Comparing with Israel’s faith in the living God highlights a messianic hope that only in the true God is salvation found."
    },
    {
      "pk": 2484808,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 8,
      "text": "The destroyer shall come upon every city, and no city shall escape; the valley shall perish, and the plain shall be destroyed, as the LORD has spoken.",
      "links": "<a href='/AIV/24/47/2'>Jer. 47:2</a>",
      "comment": "Every area of Moab is subject to divine judgment. This is a comprehensive declaration, linking the historic judgments of God to His continued faithfulness to justice."
    },
    {
      "pk": 2484809,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 9,
      "text": "Give wings to Moab, for she must flee and escape; her cities shall become a desolation, with no inhabitant in them.",
      "links": "<a href='/AIV/24/9/10'>Jer. 9:10</a>",
      "comment": "Moab’s fleeing is inevitable, highlighting the futility of resisting God’s will."
    },
    {
      "pk": 2484810,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 10,
      "text": "Cursed is he who does the work of the LORD negligently, and cursed is he who keeps back his sword from blood.",
      "links": "<a href='/AIV/1/27/13'>Num. 27:13</a>",
      "comment": "God calls for zealous faithfulness in carrying out His judgment, foreshadowing the need for full devotion to God's commands. In a spiritual sense, it urges complete surrender to God’s will."
    },
    {
      "pk": 2484811,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 11,
      "text": "Moab has been at ease from his youth and has settled on his dregs. He has not been emptied from vessel to vessel; he has not gone into exile. Therefore his taste has remained in him, and his scent is unchanged.",
      "links": "<a href='/AIV/36/1/12'>Zeph. 1:12</a>",
      "comment": "Moab's complacency led to pride. The reference to wine imagery connects with biblical themes of spiritual purity and judgment (<a href='/AIV/19/75/8'>Ps. 75:8</a>)."
    },
    {
      "pk": 2484812,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 12,
      "text": "Therefore, behold, the days are coming, declares the LORD, when I will send to him pourers who will pour him out, and they shall empty his vessels and shatter his jars.",
      "links": "<a href='/AIV/23/63/3'>Isa. 63:3</a>",
      "comment": "The 'pourers' symbolize foreign invaders; this also prefigures God’s cleansing and renewal through purification, a theme echoed in spiritual renewal in Christ."
    },
    {
      "pk": 2484813,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 13,
      "text": "Moab shall be ashamed of Chemosh, just as the house of Israel was ashamed of Bethel, their confidence.",
      "links": "<a href='/AIV/28/10/5'>Hos. 10:5</a>; <a href='/AIV/1/13/21'>Num. 13:21</a>",
      "comment": "The shame of idolatry and false worship is revealed. Israel’s misplaced confidence resulted in judgment, pointing to the need for right worship and faith."
    },
    {
      "pk": 2484814,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 14,
      "text": "How can you say, 'We are warriors, mighty men for battle'?",
      "links": "<a href='/AIV/24/49/35'>Jer. 49:35</a>",
      "comment": "Human strength and boasting are contrasted with the sovereignty of God."
    },
    {
      "pk": 2484815,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 15,
      "text": "Moab is devastated, and his cities have gone up in smoke, and his chosen young men have gone down to the slaughter, declares the King, whose name is the LORD of Hosts.",
      "links": "<a href='/AIV/19/24/8-10'>Ps. 24:8-10</a>",
      "comment": "The divine title 'King, whose name is the LORD of Hosts' points to God's universal reign. This foreshadows Christ as King and Lord over all nations."
    },
    {
      "pk": 2484816,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 16,
      "text": "The disaster of Moab is near at hand, and his affliction hurries swiftly.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>",
      "comment": "Judgment is imminent. The prophetic urgency echoes the call to repentance."
    },
    {
      "pk": 2484817,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 17,
      "text": "All who are around him, mourn for him, and all who know his name, say, 'How it is broken, the mighty scepter, the glorious staff!'",
      "links": "<a href='/AIV/23/14/5'>Isa. 14:5</a>",
      "comment": "The scepter and staff symbolize earthly power. Their breaking points to the end of temporal pride, another frequent theme later fulfilled in the humility of Christ."
    },
    {
      "pk": 2484818,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 18,
      "text": "Come down from your glory, and sit in thirst, O daughter who dwells in Dibon! For the destroyer of Moab has come up against you; he has destroyed your strongholds.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "Humility is required of the proud. God's call to 'come down' is a perpetual spiritual lesson."
    },
    {
      "pk": 2484819,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 19,
      "text": "Stand by the way and watch, O inhabitant of Aroer! Ask him who flees and her who escapes; say, 'What has happened?'",
      "links": "<a href='/AIV/24/49/21'>Jer. 49:21</a>",
      "comment": "The destruction is so total that even those trying to escape are witnesses to the calamity."
    },
    {
      "pk": 2484820,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 20,
      "text": "Moab is put to shame, for it is broken; wail and cry out! Declare by the Arnon that Moab is laid waste.",
      "links": "<a href='/AIV/23/16/7'>Isa. 16:7</a>",
      "comment": "Wailing and the announcement at the border (Arnon) reinforce the finality of God’s judgment."
    },
    {
      "pk": 2484821,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 21,
      "text": "Judgment has come upon the plain country: upon Holon, and Jahzah, and Mephaath,",
      "links": "<a href='/AIV/6/21/36'>Josh. 21:36</a>",
      "comment": "A list of cities shows the breadth of Moab’s judgment."
    },
    {
      "pk": 2484822,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 22,
      "text": "upon Dibon, Nebo, and Beth-diblathaim,",
      "links": "<a href='/AIV/24/48/18'>Jer. 48:18</a>",
      "comment": "These represent significant places in Moab. The entire land is included."
    },
    {
      "pk": 2484823,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 23,
      "text": "upon Kiriathaim, Beth-gamul, and Beth-meon,",
      "links": "<a href='/AIV/24/48/1'>Jer. 48:1</a>",
      "comment": "Every stronghold is affected. God’s judgment is thorough."
    },
    {
      "pk": 2484824,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 24,
      "text": "upon Kerioth, Bozrah, and all the cities of the land of Moab, far and near.",
      "links": "<a href='/AIV/24/49/13'>Jer. 49:13</a>",
      "comment": "Bozrah is usually Edomite, but here indicates the scale of the disaster."
    },
    {
      "pk": 2484825,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 25,
      "text": "The horn of Moab is cut off, and his arm is broken, declares the LORD.",
      "links": "<a href='/AIV/19/75/10'>Ps. 75:10</a>",
      "comment": "The 'horn' and 'arm' symbolize power and might; God alone is the source of true power."
    },
    {
      "pk": 2484826,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 26,
      "text": "'Make him drunk, for he magnified himself against the LORD. Moab will wallow in his vomit, and he too will become a laughingstock.",
      "links": "<a href='/AIV/23/19/14'>Isa. 19:14</a>; <a href='/AIV/19/75/8'>Ps. 75:8</a>",
      "comment": "Drunkenness is a symbol of judgment in the prophets. Human hubris leads to disaster."
    },
    {
      "pk": 2484827,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 27,
      "text": "Was not Israel a laughingstock to you? Was he found among thieves, that whenever you talked of him you wagged your head?",
      "links": "<a href='/AIV/19/22/7'>Ps. 22:7</a>",
      "comment": "The ridicule of Israel by Moab is turned upon them. The call for humility before God is a theme common in prophetic literature and fulfilled in Jesus’ humility (<a href='/AIV/50/2/7'>Phil. 2:7</a>)."
    },
    {
      "pk": 2484828,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 28,
      "text": "'Abandon the cities and dwell among the rocks, O inhabitants of Moab! Be like a dove that nests in the sides of the mouth of a gorge.",
      "links": "<a href='/AIV/24/49/16'>Jer. 49:16</a>",
      "comment": "A call to leave behind comfort and hide in the wilderness; even high places cannot deliver from the Lord."
    },
    {
      "pk": 2484829,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 29,
      "text": "We have heard of the pride of Moab—he is excessively proud—his loftiness, his arrogance, and his haughtiness of heart.",
      "links": "<a href='/AIV/23/16/6'>Isa. 16:6</a>",
      "comment": "Pride is persistently condemned in Scripture, as it separates man from God’s grace."
    },
    {
      "pk": 2484830,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 30,
      "text": "'I know his wrath,' declares the LORD, 'but it is nothing; his boastings accomplish nothing.'",
      "links": "<a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Human anger and pride are futile before the Lord’s plan."
    },
    {
      "pk": 2484831,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 31,
      "text": "Therefore I wail over Moab; for all Moab I cry out, I moan for the men of Kir-heres.",
      "links": "<a href='/AIV/23/16/7'>Isa. 16:7</a>",
      "comment": "Even God’s judgment is mingled with grief and compassion—anticipating the mercy ultimately revealed in Christ."
    },
    {
      "pk": 2484832,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 32,
      "text": "More than for Jazer I weep for you, O vine of Sibmah! Your branches crossed the sea, reaching to the sea of Jazer; the destroyer has fallen on your summer fruits and your vintage.",
      "links": "<a href='/AIV/23/16/8-9'>Isa. 16:8-9</a>",
      "comment": "The destruction includes agricultural abundance. The image of the vine is messianic; Christ in John 15:1 calls Himself the 'true vine', restoring what is lost."
    },
    {
      "pk": 2484833,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 33,
      "text": "Gladness and joy are taken away from the fruitful land and from the land of Moab. I have stopped the wine from the winepress; no one treads them with shouts of joy; shouts are not shouts of joy.",
      "links": "<a href='/AIV/23/16/10'>Isa. 16:10</a>",
      "comment": "The cessation of joy emphasizes the severity of judgment. In Christ, fullness of joy is restored (cf. <a href='/AIV/43/15/11'>John 15:11</a>)."
    },
    {
      "pk": 2484834,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 34,
      "text": "The cry from Heshbon to Elealeh and Jahaz is raised; from Zoar to Horonaim and Eglath-shelishiyah; for even the waters of Nimrim have become desolate.",
      "links": "<a href='/AIV/23/15/6'>Isa. 15:6</a>",
      "comment": "Waters symbolize life and blessing. Their desolation is symbolic of God’s judgment."
    },
    {
      "pk": 2484835,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 35,
      "text": "And I will bring to an end in Moab, declares the LORD, the one who offers sacrifice in the high place and burns incense to his gods.",
      "links": "<a href='/AIV/14/14/3'>2 Chr. 14:3</a>",
      "comment": "Destruction of pagan worship foreshadows the universal worship of the one true God in the future. This points to the promise that all nations will worship the true Lord (cf. <a href='/AIV/66/7/9'>Rev. 7:9</a>)."
    },
    {
      "pk": 2484836,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 36,
      "text": "Therefore my heart moans like flutes for Moab; my heart moans like flutes for the men of Kir-heres. Therefore the abundance they gained has perished.",
      "links": "<a href='/AIV/23/16/11'>Isa. 16:11</a>",
      "comment": "Deep lament over judgment again shows God’s longing for repentance rather than destruction."
    },
    {
      "pk": 2484837,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 37,
      "text": "Every head is shaved and every beard cut off; on all the hands are gashes, and around the waist is sackcloth.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "Typical expressions of mourning in ancient Israel and surrounding cultures."
    },
    {
      "pk": 2484838,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 38,
      "text": "On all the house tops of Moab and in its broad streets, there is nothing but lamentation; for I have shattered Moab like a vessel no one cares for, declares the LORD.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>",
      "comment": "The shattering of the vessel echoes themes of God's authority to judge nations and individuals."
    },
    {
      "pk": 2484839,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 39,
      "text": "How Moab is broken! How they wail! Moab has turned his back in shame. So Moab has become a derision and a horror to all around him.",
      "links": "<a href='/AIV/23/16/7'>Isa. 16:7</a>",
      "comment": "Shame and derision are the fruits of rebellion against God."
    },
    {
      "pk": 2484840,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 40,
      "text": "For thus says the LORD: 'Behold, one shall fly swiftly like an eagle and spread his wings against Moab.'",
      "links": "<a href='/AIV/24/49/22'>Jer. 49:22</a>",
      "comment": "The eagle often symbolizes speed and overwhelming power; as in Deuteronomy 28:49, a sign of coming judgment."
    },
    {
      "pk": 2484841,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 41,
      "text": "The cities shall be taken and the strongholds seized. The hearts of the mighty men of Moab shall be in that day like the heart of a woman in labor.",
      "links": "<a href='/AIV/24/49/22'>Jer. 49:22</a>",
      "comment": "Repeated imagery of sudden fear and helplessness before God’s action."
    },
    {
      "pk": 2484842,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 42,
      "text": "Moab shall be destroyed from being a people, because he magnified himself against the LORD.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "Self-exaltation is repeatedly judged by God. True greatness is found in humility before Him."
    },
    {
      "pk": 2484843,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 43,
      "text": "'Terror, pit, and snare are upon you, O inhabitant of Moab!' declares the LORD.",
      "links": "<a href='/AIV/23/24/17-18'>Isa. 24:17-18</a>",
      "comment": "A stark warning; the triple threat means there is no escape from God’s judgment."
    },
    {
      "pk": 2484844,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 44,
      "text": "He who flees from the terror shall fall into the pit, and he who climbs out of the pit shall be caught in the snare. For I will bring upon Moab the year of their punishment, declares the LORD.",
      "links": "<a href='/AIV/23/24/18'>Isa. 24:18</a>",
      "comment": "The inevitability of God’s righteous justice is underscored. All avenues of escape are closed except repentance."
    },
    {
      "pk": 2484845,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 45,
      "text": "In the shadow of Heshbon, fugitives stand without strength, for fire has gone out from Heshbon, a flame from the midst of Sihon. It has devoured the forehead of Moab, the crown of the sons of tumult.",
      "links": "<a href='/AIV/4/21/28-29'>Num. 21:28-29</a>",
      "comment": "Echoes past judgments. The fire represents judgment emanating from conquered lands."
    },
    {
      "pk": 2484846,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 46,
      "text": "Woe to you, O Moab! The people of Chemosh are undone; for your sons have been taken captive, and your daughters into exile.",
      "links": "<a href='/AIV/24/48/7'>Jer. 48:7</a>",
      "comment": "Divine retribution leads to loss of family and hope, a theme reversed in Christ’s coming and promise of restoration."
    },
    {
      "pk": 2484847,
      "translation": "AIV",
      "book": 24,
      "chapter": 48,
      "verse": 47,
      "text": "Yet I will restore the fortunes of Moab in the latter days, declares the LORD. Thus far is the judgment of Moab.",
      "links": "<a href='/AIV/44/15/17'>Acts 15:17</a>; <a href='/AIV/23/19/25'>Isa. 19:25</a>",
      "comment": "The chapter closes with a promise of restoration—God’s mercy remains. The phrase 'in the latter days' connects to the messianic hope that all nations will be brought into the blessing of God, fulfilled supremely through Christ (see Acts 15:17)."
    }
  ],
  "translatedAt": "2025-12-23T06:39:39.395Z"
}