{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 39,
  "verses": [
    {
      "pk": 24139001,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 1,
      "text": "In the ninth year of Zedekiah, king of Judah, in the tenth month, Nebuchadnezzar, king of Babylon, and all his army came against Jerusalem and besieged it.",
      "links": "<a href='/AIV/12/25/1-2'>2 Kings 25:1-2</a>; <a href='/AIV/24/52/4'>Jer. 52:4</a>",
      "comment": "This verse closely mirrors other accounts of Jerusalem's fall; the precise dating reveals the historicity and gravity of the siege. Cross-referencing strengthens the reliability of the narrative."
    },
    {
      "pk": 24139002,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 2,
      "text": "In the eleventh year of Zedekiah, in the fourth month, on the ninth day of the month, the city was breached.",
      "links": "<a href='/AIV/24/52/6-7'>Jer. 52:6-7</a>",
      "comment": "The siege lasted about eighteen months, fulfilling earlier prophetic warnings. The detail foreshadows the inevitability of judgment for persistent disobedience."
    },
    {
      "pk": 24139003,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 3,
      "text": "All the officials of the king of Babylon came and sat in the Middle Gate: Nergal-shar-ezer, Samgar-nebo, Sarsekim the chief officer, Nergal-shar-ezer the chief official, and all the rest of the officials of the king of Babylon.",
      "links": "<a href='/AIV/24/39/13'>Jer. 39:13</a>; <a href='/AIV/27/3/3'>Dan. 3:3</a>",
      "comment": "The mention of Babylonian officials demonstrates the total conquest of Jerusalem, representing divine judgment. The presence of multiple officials underscores the magnitude and formality of the occupation."
    },
    {
      "pk": 24139004,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 4,
      "text": "When Zedekiah, king of Judah, and all the soldiers saw them, they fled and went out of the city at night by way of the king's garden, through the gate between the two walls, and they went toward the Arabah.",
      "links": "<a href='/AIV/12/25/4'>2 Kings 25:4</a>; <a href='/AIV/24/52/7'>Jer. 52:7</a>",
      "comment": "Zedekiah's flight fulfills prophecy about the inevitable fall of Jerusalem. Even the king could not avoid the consequences of unfaithfulness."
    },
    {
      "pk": 24139005,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 5,
      "text": "But the army of the Chaldeans pursued them, and they overtook Zedekiah in the plains of Jericho. They captured him and brought him up to Nebuchadnezzar, king of Babylon, to Riblah in the land of Hamath, where he passed sentence on him.",
      "links": "<a href='/AIV/24/52/8-9'>Jer. 52:8-9</a>; <a href='/AIV/12/25/5-6'>2 Kings 25:5-6</a>",
      "comment": "The capture of Zedekiah in Jericho is symbolic; Jericho was Israel's first victory in Canaan, now a place of defeat. The theme of reversal is profound in salvation history."
    },
    {
      "pk": 24139006,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 6,
      "text": "The king of Babylon slaughtered the sons of Zedekiah before his eyes at Riblah, and the king of Babylon also killed all the nobles of Judah.",
      "links": "<a href='/AIV/24/52/10'>Jer. 52:10</a>; <a href='/AIV/12/25/7'>2 Kings 25:7</a>",
      "comment": "This judgment fulfills Jeremiah's warnings (Jer. 34:3-5). Judgment is both personal and communal, a warning to Israel and all God's people to remain faithful."
    },
    {
      "pk": 24139007,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 7,
      "text": "He blinded Zedekiah and bound him in bronze chains to bring him to Babylon.",
      "links": "<a href='/AIV/24/52/11'>Jer. 52:11</a>; <a href='/AIV/26/12'>Ezek. 12:13</a>",
      "comment": "Zedekiah's physical blindness is literal, but also a spiritual symbol for his prior lack of vision as a leader. Compare to the symbolism of spiritual blindness in the New Testament (<a href='/AIV/43/9/39'>John 9:39</a>)."
    },
    {
      "pk": 24139008,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 8,
      "text": "The Chaldeans burned the king’s house and the houses of the people with fire, and broke down the walls of Jerusalem.",
      "links": "<a href='/AIV/24/52/13-14'>Jer. 52:13-14</a>; <a href='/AIV/25/2/2'>Lam. 2:2</a>",
      "comment": "The burning of Jerusalem prefigures the destructive consequence of sin and foretells of the need for purification and restoration—a theme fulfilled by the coming of Christ (see <a href='/AIV/40/24/2'>Matt. 24:2</a>)."
    },
    {
      "pk": 24139009,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 9,
      "text": "Then Nebuzaradan, the captain of the guard, carried away into exile to Babylon the rest of the people who were left in the city, those who had defected to him, and the rest of the people who remained.",
      "links": "<a href='/AIV/24/52/12-15'>Jer. 52:12-15</a>",
      "comment": "The exile of the people aligns with the consequences set out in Deuteronomy for covenant unfaithfulness. The dispersion will have enduring theological significance for restoration and unity."
    },
    {
      "pk": 24139010,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 10,
      "text": "But Nebuzaradan, the captain of the guard, left the poorest of the people, those who had nothing, in the land of Judah, and gave them vineyards and fields at that time.",
      "links": "<a href='/AIV/12/25/12'>2 Kings 25:12</a>; <a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "The poor remaining in the land shows God's care for the humble and lowly. This foreshadows the raising up of the lowly, a recurring theme in the New and Old Testaments (<a href='/AIV/42/1/52-53'>Luke 1:52-53</a>)."
    },
    {
      "pk": 24139011,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 11,
      "text": "Nebuchadnezzar, king of Babylon, gave orders concerning Jeremiah through Nebuzaradan, the captain of the guard, saying,",
      "links": "<a href='/AIV/24/40/1-4'>Jer. 40:1-4</a>",
      "comment": "A foreign king recognizing Jeremiah reflects God's sovereignty over all nations. Also, God’s prophets are preserved even amid crisis."
    },
    {
      "pk": 24139012,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 12,
      "text": "'Take him, look after him well, and do him no harm. Do to him whatever he asks.'",
      "links": "<a href='/AIV/24/15/20-21'>Jer. 15:20-21</a>",
      "comment": "God’s providence protects His faithful servant. Jeremiah’s liberation prefigures how God delivers those who trust Him, despite exterior circumstances."
    },
    {
      "pk": 24139013,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 13,
      "text": "So Nebuzaradan the captain of the guard, Nebushazban the chief officer, Nergal-shar-ezer the chief official, and all the officers of the king of Babylon",
      "links": "<a href='/AIV/24/39/3'>Jer. 39:3</a>",
      "comment": "Listing the leaders emphasizes the authority involved in protecting Jeremiah, highlighting God’s ability to move the hearts of even foreign rulers."
    },
    {
      "pk": 24139014,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 14,
      "text": "sent and took Jeremiah out of the court of the guard. They entrusted him to Gedaliah the son of Ahikam, son of Shaphan, that he should take him home. So he lived among the people.",
      "links": "<a href='/AIV/24/40/5-6'>Jer. 40:5-6</a>; <a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Gedaliah’s appointment fulfills God’s promise to preserve a faithful remnant and established leadership. Jeremiah remains a shepherd to the people, akin to the later apostolic leadership."
    },
    {
      "pk": 24139015,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 15,
      "text": "The word of the LORD came to Jeremiah while he was shut up in the court of the guard, saying,",
      "links": "<a href='/AIV/24/33/1'>Jer. 33:1</a>",
      "comment": "God continues to speak even when Jeremiah is imprisoned, emphasizing the ongoing revelation and faithfulness of God to His servants."
    },
    {
      "pk": 24139016,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 16,
      "text": "'Go and say to Ebed-melech the Ethiopian, “Thus says the LORD of hosts, the God of Israel: Behold, I will fulfill my words against this city for disaster and not for good, and they shall be accomplished before you on that day.”'",
      "links": "<a href='/AIV/24/38/7-13'>Jer. 38:7-13</a>",
      "comment": "Ebed-melech, a foreigner, is assured of God’s favor for his faith and works, showing the universality of God’s mercy to those who seek Him (compare <a href='/AIV/40/8/11'>Matt. 8:11</a>). Moral works are also valued, not just faith."
    },
    {
      "pk": 24139017,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 17,
      "text": "'But I will deliver you on that day, declares the LORD, and you shall not be given into the hand of the men of whom you are afraid.'",
      "links": "<a href='/AIV/24/1/8'>Jer. 1:8</a>; <a href='/AIV/24/15/20-21'>Jer. 15:20-21</a>",
      "comment": "Personal deliverance for Ebed-melech highlights God’s care for the individual, rewarding faith and works in difficult circumstances."
    },
    {
      "pk": 24139018,
      "translation": "AIV",
      "book": 24,
      "chapter": 39,
      "verse": 18,
      "text": "'For I will surely save you, and you shall not fall by the sword; but you shall have your life as a prize of war, because you have trusted in me,’ declares the LORD.",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>; <a href='/AIV/23/43/2'>Isa. 43:2</a>",
      "comment": "Trust in the Lord results in salvation. The safeguarding of Ebed-melech demonstrates the importance and power of both active faith and righteous actions, a theme echoed throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-23T06:35:05.371Z"
}