{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 23,
  "verses": [
    {
      "pk": 24023001,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 1,
      "text": "Woe to the shepherds who destroy and scatter the sheep of my pasture! declares the LORD.",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/24/10/21'>Jer. 10:21</a>",
      "comment": "The 'shepherds' represent Israel's leaders—both political and spiritual—who have failed in their duties. The condemnation here foreshadows later teachings about responsible leadership in the faith (see John 10:11)."
    },
    {
      "pk": 24023002,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 2,
      "text": "Therefore thus says the LORD, the God of Israel, concerning the shepherds who care for my people: You have scattered my flock and have driven them away, and have not attended to them. Behold, I will attend to you for your evil deeds, declares the LORD.",
      "links": "<a href='/AIV/26/34/10'>Ezek. 34:10</a>",
      "comment": "God's judgement against unfaithful shepherds anticipates His promise to provide faithful leadership. Double meaning: earthly leaders and spiritual guardians are both accountable."
    },
    {
      "pk": 24023003,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 3,
      "text": "Then I will gather the remnant of my flock out of all the countries where I have driven them, and I will bring them back to their fold, and they will be fruitful and multiply.",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/05/30/3'>Deut. 30:3</a>",
      "comment": "God promises restoration. Spiritually, this also looks ahead to the gathering of God's people in the Messiah, a new, one people unified in truth (cf. John 11:52)."
    },
    {
      "pk": 24023004,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 4,
      "text": "I will set shepherds over them who will care for them, and they shall not fear any longer, nor be dismayed, nor shall any be missing, declares the LORD.",
      "links": "<a href='/AIV/24/3/15'>Jer. 3:15</a>",
      "comment": "God's promise of faithful shepherds prefigures Christ establishing authority for His Church, with trustworthy overseers to guide the flock safely (see Acts 20:28)."
    },
    {
      "pk": 24023005,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 5,
      "text": "Behold, the days are coming, declares the LORD, when I will raise up for David a Righteous Branch, and he shall reign as king and act wisely, and shall do justice and righteousness in the land.",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "The 'Righteous Branch' is a Messianic prophecy fulfilled in Jesus Christ. Both Jewish and Christian tradition recognize this as a promise of the eternal Davidic King."
    },
    {
      "pk": 24023006,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 6,
      "text": "In his days Judah will be saved, and Israel will dwell securely. And this is the name by which he will be called: 'The LORD is our righteousness.'",
      "links": "<a href='/AIV/24/33/16'>Jer. 33:16</a>; <a href='/AIV/23/9/6'>Isa. 9:6</a>",
      "comment": "The Messiah brings righteousness and peace. The title directly points to Christ's divine nature and saving work (cf. 1 Cor. 1:30)."
    },
    {
      "pk": 24023007,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 7,
      "text": "Therefore, behold, the days are coming, declares the LORD, when they will no longer say, 'As the LORD lives who brought up the people of Israel out of the land of Egypt,'",
      "links": "<a href='/AIV/24/16/14'>Jer. 16:14</a>",
      "comment": "A new era of salvation is prophesied, one that will surpass even the Exodus—hinting at the new covenant established in Christ (Luke 22:20)."
    },
    {
      "pk": 24023008,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 8,
      "text": "but, 'As the LORD lives, who brought up and led the offspring of the house of Israel out of the north country and out of all the countries where he had driven them.' Then they will dwell in their own land.",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>",
      "comment": "Points to both the return from exile and the greater restoration in the Messiah, who gathers all nations into God's family."
    },
    {
      "pk": 24023009,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 9,
      "text": "Concerning the prophets: My heart is broken within me, all my bones shake. I am like a drunken man, like a man overcome by wine, because of the LORD and because of his holy words.",
      "links": "<a href='/AIV/26/21/6'>Ezek. 21:6</a>",
      "comment": "Jeremiah reacts with emotional and physical trembling to the seriousness of false prophecy, emphasizing the deep responsibility of speaking for God."
    },
    {
      "pk": 24023010,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 10,
      "text": "For the land is full of adulterers; because of the curse the land mourns, and the pastures of the wilderness are dried up. Their course is evil, and their might is not right.",
      "links": "<a href='/AIV/19/107/34'>Ps. 107:34</a>; <a href='/AIV/28/4/3'>Hos. 4:3</a>",
      "comment": "Spiritual adultery—idolatry and apostasy—leads to judgment, seen here in the natural consequences as well."
    },
    {
      "pk": 24023011,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 11,
      "text": "Both prophet and priest are ungodly; even in my house I have found their evil, declares the LORD.",
      "links": "<a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "Even religious leaders have fallen, a warning about the corruption of those entrusted to guard true worship."
    },
    {
      "pk": 24023012,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 12,
      "text": "Therefore their way will be to them like slippery paths in the darkness, into which they will be driven and fall; for I will bring disaster upon them in the year of their punishment, declares the LORD.",
      "links": "<a href='/AIV/19/35/6'>Ps. 35:6</a>",
      "comment": "Divine retribution is certain for spiritual guides who abandon their calling—shadowing Christ's warnings against false shepherds (see Matthew 23)."
    },
    {
      "pk": 24023013,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 13,
      "text": "In the prophets of Samaria I saw something shocking: They prophesied by Baal and led my people Israel astray.",
      "links": "<a href='/AIV/11/16/31'>1 Kings 16:31</a>",
      "comment": "The prophets of the northern kingdom led the people into idolatry; a perennial warning about syncretism."
    },
    {
      "pk": 24023014,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 14,
      "text": "But in the prophets of Jerusalem I have seen something horrible: They commit adultery and walk in lies; they strengthen the hands of evildoers, so that no one turns from his wickedness. They have all become like Sodom to me, and the inhabitants like Gomorrah.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/23/1/10'>Isa. 1:10</a>",
      "comment": "Spiritual corruption extends to Jerusalem's leadership—an indictment of impure worship and lifestyle in the very heart of the nation."
    },
    {
      "pk": 24023015,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 15,
      "text": "Therefore thus says the LORD of hosts concerning the prophets: Behold, I will feed them with bitter food and give them poisoned water to drink, for from the prophets of Jerusalem ungodliness has gone out into all the land.",
      "links": "<a href='/AIV/24/8/14'>Jer. 8:14</a>",
      "comment": "Punishment is described as spiritual and physical suffering. Judgment starts with those most responsible for teaching truth."
    },
    {
      "pk": 24023016,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 16,
      "text": "Thus says the LORD of hosts: Do not listen to the words of the prophets who prophesy to you, filling you with empty hopes. They speak visions of their own minds, not from the mouth of the LORD.",
      "links": "<a href='/AIV/24/29/8'>Jer. 29:8</a>",
      "comment": "False prophets promote their own ideas, not God's revelation. Discernment is necessary to distinguish true authority."
    },
    {
      "pk": 24023017,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 17,
      "text": "They continually say to those who despise the word of the LORD, 'It will be well with you,' and to everyone who follows the stubbornness of his own heart, they say, 'No disaster will come upon you.'",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>",
      "comment": "False assurances hinder repentance. Spiritual leaders must call sin what it is—flattery is not love."
    },
    {
      "pk": 24023018,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 18,
      "text": "For who has stood in the council of the LORD to see and to hear his word? Or who has listened to his word and heard it?",
      "links": "<a href='/AIV/18/15/8'>Job 15:8</a>",
      "comment": "True prophecy comes from God's presence. This points ahead to the need for authorized, faithful teachers of God’s word (cf. Acts 13:1-3)."
    },
    {
      "pk": 24023019,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 19,
      "text": "Behold, the storm of the LORD! Wrath has gone forth, a whirling tempest; it will whirl upon the head of the wicked.",
      "links": "<a href='/AIV/24/25/32'>Jer. 25:32</a>",
      "comment": "God's judgment is pictured as a violent storm—inescapable for the unrepentant."
    },
    {
      "pk": 24023020,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 20,
      "text": "The anger of the LORD will not turn back until he has accomplished the purposes of his heart. In the latter days you will understand it clearly.",
      "links": "<a href='/AIV/24/30/24'>Jer. 30:24</a>",
      "comment": "God's justice will be fully revealed, especially 'in the latter days,' suggesting Messianic fulfillment and final judgment."
    },
    {
      "pk": 24023021,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 21,
      "text": "I did not send the prophets, yet they ran; I did not speak to them, yet they prophesied.",
      "links": "<a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "Unauthorized religious leaders act on their own authority. True prophets are sent, not self-appointed."
    },
    {
      "pk": 24023022,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 22,
      "text": "But if they had stood in my council, then they would have proclaimed my words to my people, and they would have turned them from their evil way, and from the evil of their deeds.",
      "links": "<a href='/AIV/24/7/23'>Jer. 7:23</a>",
      "comment": "Faithful shepherds lead people to repentance. The necessity of right teaching is clear—deviating leads to spiritual ruin."
    },
    {
      "pk": 24023023,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 23,
      "text": "Am I a God at hand, declares the LORD, and not a God far away?",
      "links": "<a href='/AIV/19/139/7-10'>Ps. 139:7-10</a>",
      "comment": "God is both present and transcendent, intimately aware of all things."
    },
    {
      "pk": 24023024,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 24,
      "text": "Can a man hide himself in secret places so that I cannot see him? declares the LORD. Do I not fill heaven and earth? declares the LORD.",
      "links": "<a href='/AIV/18/34/21-22'>Job 34:21–22</a>",
      "comment": "God’s omnipresence assures that no evil action escapes His notice—an ongoing encouragement to live holy lives."
    },
    {
      "pk": 24023025,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 25,
      "text": "I have heard what the prophets have said who prophesy lies in my name, saying, 'I have dreamed, I have dreamed!'",
      "links": "<a href='/AIV/05/13/1-3'>Deut. 13:1-3</a>",
      "comment": "False prophets often use private revelations to claim authority. The rightful place of public, corporate revelation is emphasized throughout scripture."
    },
    {
      "pk": 24023026,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 26,
      "text": "How long shall there be lies in the heart of the prophets who prophesy lies, and who prophesy the deceit of their own hearts?",
      "links": "<a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "Key theme: Authentic proclamation comes from submission to God’s will, not personal agenda."
    },
    {
      "pk": 24023027,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 27,
      "text": "They plan to make my people forget my name by their dreams that they tell one another, even as their fathers forgot my name for Baal.",
      "links": "<a href='/AIV/07/3/7'>Judg. 3:7</a>",
      "comment": "The results of false prophecy are separation from the true God and spiritual confusion."
    },
    {
      "pk": 24023028,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 28,
      "text": "Let the prophet who has a dream tell the dream, but let him who has my word speak my word faithfully. What has straw in common with wheat? declares the LORD.",
      "links": "<a href='/AIV/40/13/24-30'>Matt. 13:24-30</a>",
      "comment": "True teaching is nourishing and life-giving. The contrast between straw and wheat foreshadows the New Testament’s discernment between sound and unsound doctrine."
    },
    {
      "pk": 24023029,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 29,
      "text": "Is not my word like fire, declares the LORD, and like a hammer that shatters rock?",
      "links": "<a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "God's word is powerful, transformative, and purifying—central to the renewal of God's people."
    },
    {
      "pk": 24023030,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 30,
      "text": "Therefore, behold, I am against the prophets, declares the LORD, who steal my words from one another.",
      "links": "<a href='/AIV/24/29/8-9'>Jer. 29:8-9</a>",
      "comment": "Plagiarized prophecy is condemned. Only commissioned teachers maintain the deposit of faith."
    },
    {
      "pk": 24023031,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 31,
      "text": "Behold, I am against the prophets, declares the LORD, who use their tongues and say, 'Declares the LORD.'",
      "links": "<a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "Divine authority cannot be claimed apart from God’s commission—related to authentic apostolic succession in church leadership."
    },
    {
      "pk": 24023032,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 32,
      "text": "Behold, I am against those who prophesy lying dreams, declares the LORD, and who tell them and lead my people astray by their lies and their recklessness, when I did not send them or command them. So they do not profit this people at all, declares the LORD.",
      "links": "<a href='/AIV/24/27/15'>Jer. 27:15</a>",
      "comment": "False prophecy is fruitless and destructive. True teaching always aligns with revelation and builds up the people of God."
    },
    {
      "pk": 24023033,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 33,
      "text": "When one of this people, or a prophet, or a priest asks you, 'What is the burden of the LORD?' you shall say to them, 'You are the burden, and I will cast you off, declares the LORD.'",
      "links": "<a href='/AIV/24/17/24'>Jer. 17:24</a>",
      "comment": "Wordplay: Instead of delivering burdensome messages, the hearers themselves have become a burden to God by their sin."
    },
    {
      "pk": 24023034,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 34,
      "text": "And as for the prophet, priest, or any of the people who say, 'The burden of the LORD,' I will punish that man and his household.",
      "links": "<a href='/AIV/24/23/39-40'>Jer. 23:39-40</a>",
      "comment": "Those who twist God’s word or use it flippantly face strong judgment—a warning to all spiritual leaders."
    },
    {
      "pk": 24023035,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 35,
      "text": "Thus you shall say, every one to his neighbor and every one to his brother, 'What has the LORD answered?' or 'What has the LORD spoken?'",
      "links": "<a href='/AIV/10/2/1'>2 Sam. 2:1</a>",
      "comment": "Proper inquiry about God’s will is respectful and genuine, seeking the real word of God."
    },
    {
      "pk": 24023036,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 36,
      "text": "But 'the burden of the LORD' you shall mention no more, for every man's own word becomes his burden, and you twist the words of the living God, the LORD of hosts, our God.",
      "links": "<a href='/AIV/05/4/2'>Deut. 4:2</a>",
      "comment": "Twisting scripture brings judgment. The instruction here parallels the New Testament command to rightly handle the word of truth (2 Tim. 2:15)."
    },
    {
      "pk": 24023037,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 37,
      "text": "Thus you shall say to the prophet, 'What has the LORD answered you?' or 'What has the LORD spoken?'",
      "links": "<a href='/AIV/24/42/4'>Jer. 42:4</a>",
      "comment": "Emphasis is on authentic revelation. True answers come from God, not human invention."
    },
    {
      "pk": 24023038,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 38,
      "text": "But if you say, 'The burden of the LORD,' thus says the LORD, 'Because you have said these words, ",
      "The burden of the LORD,": "when I sent to you, saying, ",
      "You shall not say, ": "The burden of the LORD,",
      "comment": "Persisting in misusing God’s words brings condemnation as repetition reveals hardened hearts."
    },
    {
      "pk": 24023039,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 39,
      "text": "therefore, behold, I will surely lift you up and cast you away from my presence, you and the city that I gave to you and your fathers.",
      "links": "<a href='/AIV/24/7/14-15'>Jer. 7:14-15</a>",
      "comment": "Exile is the final consequence of obstinately twisting God’s word—a foretaste of spiritual exile resulting from persistent disobedience."
    },
    {
      "pk": 24023040,
      "translation": "AIV",
      "book": 24,
      "chapter": 23,
      "verse": 40,
      "text": "And I will bring upon you everlasting reproach and perpetual shame, which will not be forgotten.",
      "links": "<a href='/AIV/19/78/66'>Ps. 78:66</a>",
      "comment": "The severity of judgment is matched only by its permanence. Persistent rejection of true teaching leads to lasting separation from God. This underscores the need to listen to those truly sent by God through His appointed means."
    }
  ],
  "translatedAt": "2025-12-23T06:26:15.848Z"
}