{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 41,
  "verses": [
    {
      "pk": 30041001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 1,
      "text": "In the seventh month, Ishmael son of Nethaniah, son of Elishama, of the royal family and one of the king’s chief officers, came with ten men to Gedaliah son of Ahikam at Mizpah. While they were eating together there at Mizpah,",
      "links": "<a href='/AIV/24/40/8'>Jer. 40:8</a>; <a href='/AIV/24/40/14'>Jer. 40:14</a>",
      "comment": "Ishmael, being of royal blood, was trusted by Gedaliah. The eating of bread together signified trust and covenant (see Ps. 41:9). Here we see again the theme of betrayal from within God's own chosen people. This foreshadows the betrayal of Jesus at the Last Supper (see Matt. 26:23), signifying the deeper meaning of meals as a sign of true fellowship and responsibility."
    },
    {
      "pk": 30041002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 2,
      "text": "Ishmael son of Nethaniah and the ten men who were with him rose up and struck down Gedaliah son of Ahikam, son of Shaphan, with the sword and killed him—whom the king of Babylon had appointed governor over the land.",
      "links": "<a href='/AIV/24/40/14'>Jer. 40:14</a>; <a href='/AIV/2/20/13'>Ex. 20:13</a>",
      "comment": "This act of violence against God's appointed authority led to greater suffering for the remnant. Notice how often in salvation history violence against legitimate leadership brings devastating consequences. Compare this with Saul's unlawful acts (1 Sam. 13:13-14)."
    },
    {
      "pk": 30041003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 3,
      "text": "Ishmael also killed all the Jews who were with Gedaliah at Mizpah, and the Chaldean soldiers who were found there.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "This massacre, including foreigners, shows the far-reaching consequences of sinful ambition. There is a spiritual principle about disorder and chaos that follows disobedience to God's established order."
    },
    {
      "pk": 30041004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 4,
      "text": "The next day, before anyone knew about it,",
      "links": "",
      "comment": "The secrecy of these events emphasizes the suddenness of sin’s consequences. Compare with 1 Thess. 5:2, the day of the Lord coming 'like a thief in the night.'"
    },
    {
      "pk": 30041005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 5,
      "text": "eighty men arrived from Shechem, Shiloh, and Samaria, their beards shaved, their clothes torn, and their bodies wounded. They were bringing grain and incense as offerings to the house of the LORD.",
      "links": "<a href='/AIV/5/21/5'>Lev. 21:5</a>; <a href='/AIV/19/51/19'>Ps. 51:19</a>",
      "comment": "The mourning rites and the bringing of offerings show continued faithfulness to God's worship, even after the Temple's destruction. There’s an enduring belief in the efficacy of sacrificial offerings, hinting at deeper realities later fulfilled in Christ's sacrifice (Heb. 10:10-14)."
    },
    {
      "pk": 30041006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 6,
      "text": "Ishmael son of Nethaniah went out from Mizpah to meet them, weeping as he went. As he met them, he said, 'Come to Gedaliah son of Ahikam.'",
      "links": "",
      "comment": "Ishmael’s deceptive weeping calls to mind the hypocrisy of false prophets (see Matt. 7:15) and those who disguise evil with outward shows of grief or piety. True faith is shown by action, not mere outward expression."
    },
    {
      "pk": 30041007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 7,
      "text": "And when they came within the city, Ishmael son of Nethaniah and the men with him slaughtered them and threw them into a cistern.",
      "links": "<a href='/AIV/24/38/6'>Jer. 38:6</a>",
      "comment": "The image of a cistern recalls earlier events in Jeremiah (38:6) and Joseph’s betrayal by his brothers (Gen. 37:24). Both cases foreshadow Christ, who was betrayed and 'cast down' by his own people (see Matt. 27:3-10)."
    },
    {
      "pk": 30041008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 8,
      "text": "But ten of them said to Ishmael, 'Do not kill us, for we have stores of wheat, barley, oil, and honey hidden in the fields.' So he stopped and did not kill them along with their companions.",
      "links": "",
      "comment": "Here, material wealth saves the lives of a few, but their lives were spared only temporarily. This contrast between physical survival and spiritual loss highlights that only true spiritual security—found in obedience—endures. Consider how Jesus calls us to a greater treasure (Matt. 6:19-21)."
    },
    {
      "pk": 30041009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 9,
      "text": "The cistern into which Ishmael threw all the bodies of the men he had killed, along with Gedaliah, was the large one that King Asa had made for defense against Baasha king of Israel. Ishmael son of Nethaniah filled it with the dead.",
      "links": "<a href='/AIV/11/15/22'>1 Kings 15:22</a>; <a href='/AIV/14/16/6'>2 Chron. 16:6</a>",
      "comment": "This verse ties Israel’s tragic history to present judgment, linking earlier struggles for security with present violence. Defensive measures are helpless without repentance and fidelity to God."
    },
    {
      "pk": 30041010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 10,
      "text": "Then Ishmael took captive all the rest of the people who were in Mizpah, including the king’s daughters and all the people left in Mizpah over whom Nebuzaradan, the captain of the guard, had put Gedaliah son of Ahikam, and he took them captive and set out to cross over to the Ammonites.",
      "links": "<a href='/AIV/24/39/10'>Jer. 39:10</a>; <a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "The mention of the king’s daughters suggests the lingering hope of Davidic succession, but the remnant is led away into exile because of rebellion. Spiritual exile from God is always worse than physical suffering."
    },
    {
      "pk": 30041011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 11,
      "text": "But when Johanan son of Kareah and all the commanders of the forces with him heard of all the evil that Ishmael son of Nethaniah had done,",
      "links": "<a href='/AIV/24/40/8'>Jer. 40:8</a>",
      "comment": "Johanan represents the remnant’s resistance to lawlessness. The response to evil within the community often points to the need for faithful leadership. Compare with Paul's call for discernment and correction in the Church (1 Cor. 5:1-13)."
    },
    {
      "pk": 30041012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 12,
      "text": "they took all their men and went to fight against Ishmael son of Nethaniah. They found him by the great pool at Gibeon.",
      "links": "<a href='/AIV/10/2/13'>2 Sam. 2:13</a>",
      "comment": "The battle at Gibeon's pool recalls previous encounters between Israelite factions (2 Sam. 2:13), underscoring internal division when God's people lack unity. Spiritual harmony is always essential to avoid such tragic strife."
    },
    {
      "pk": 30041013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 13,
      "text": "And when all the people who were with Ishmael saw Johanan son of Kareah and all the commanders with him, they rejoiced.",
      "links": "",
      "comment": "Relief and joy return for the remnant upon seeing true leadership. This echoes how Christ the Good Shepherd brings peace to his flock in times of turmoil (John 10:11-16)."
    },
    {
      "pk": 30041014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 14,
      "text": "So all the people whom Ishmael had taken captive from Mizpah turned around and went back to Johanan son of Kareah.",
      "links": "<a href='/AIV/24/40/13'>Jer. 40:13</a>",
      "comment": "The captives’ return to faithful leadership after experiencing betrayal reflects God’s desire for His people to find safety under shepherds He appoints. This motif underlines the continued necessity for divinely guided authority in the community."
    },
    {
      "pk": 30041015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 15,
      "text": "But Ishmael son of Nethaniah escaped from Johanan with eight men and went to the Ammonites.",
      "links": "<a href='/AIV/24/40/14'>Jer. 40:14</a>; <a href='/AIV/24/49/1'>Jer. 49:1</a>",
      "comment": "Ishmael's flight highlights the recurring theme of enemies and false leaders departing the faithful community (cf. 1 John 2:19)."
    },
    {
      "pk": 30041016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 16,
      "text": "Then Johanan son of Kareah and all the commanders who were with him took all the rest of the people whom he had recovered from Ishmael son of Nethaniah after he had killed Gedaliah—the soldiers, the women, the children, and the eunuchs whom Johanan brought back from Gibeon.",
      "links": "",
      "comment": "Johanan’s effort to recover the remnant—including soldiers, women, children, and eunuchs—foreshadows God’s inclusive restoration of His people. See how Isaiah prophesies even eunuchs finding a place within God's house (Isa. 56:3-5)."
    },
    {
      "pk": 30041017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 17,
      "text": "And they went and stayed at Geruth Chimham, which is near Bethlehem, intending to go to Egypt",
      "links": "<a href='/AIV/24/42/1'>Jer. 42:1</a>; <a href='/AIV/1/12/10'>Gen. 12:10</a>",
      "comment": "Their stay near Bethlehem, the future birthplace of Christ, is a providential sign in salvation history. The temptation to seek refuge in Egypt finds parallels with Abraham (Gen. 12:10) and the Holy Family’s flight (Matt. 2:13-15). True refuge, however, is in trustful obedience to God, not foreign alliances."
    },
    {
      "pk": 30041018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 41,
      "verse": 18,
      "text": "because of the Chaldeans, for they were afraid of them. Ishmael son of Nethaniah had struck down Gedaliah son of Ahikam—the one whom the king of Babylon had appointed governor over the land.",
      "links": "<a href='/AIV/24/40/14'>Jer. 40:14</a>; <a href='/AIV/24/39/14'>Jer. 39:14</a>",
      "comment": "Fear drives the remnant away from the land promised to them. Fear, and not faith, can cause God’s people to miss blessings and fulfillment of God's promises. In times of crisis, seeking leadership grounded in divine mandate, rooted in tradition, safeguards against destructive fear. Compare with Paul’s call for 'not a spirit of fear' but of power and self-control (2 Tim. 1:7)."
    }
  ],
  "translatedAt": "2025-12-24T08:44:21.229Z"
}