{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 25,
  "verses": [
    {
      "pk": 30025001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 1,
      "text": "The word that came to Jeremiah concerning all the people of Judah, in the fourth year of Jehoiakim son of Josiah, king of Judah—that was the first year of Nebuchadnezzar king of Babylon—",
      "links": "<a href='/AIV/12/24/1'>2 Kings 24:1</a>; <a href='/AIV/27/1/1'>Dan. 1:1</a>",
      "comment": "Verse one sets the historical context, marking the first year of Nebuchadnezzar's reign, a pivotal moment for Judah leading to the Babylonian exile. This period signals God’s judgment through foreign nations, paralleled with God’s use of secular powers to bring about His divine plan (cf. Dan. 1:1)."
    },
    {
      "pk": 30025002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 2,
      "text": "which Jeremiah the prophet spoke to all the people of Judah and to all the inhabitants of Jerusalem:",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "This verse introduces Jeremiah’s message to the entirety of Judah and Jerusalem, emphasizing the scope and seriousness of the coming prophecy."
    },
    {
      "pk": 30025003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 3,
      "text": "From the thirteenth year of Josiah son of Amon, king of Judah, until this day—twenty-three years—the word of the Lord has come to me, and I have spoken to you persistently, but you have not listened.",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>; <a href='/AIV/24/7/13'>Jer. 7:13</a>",
      "comment": "Jeremiah’s faithful twenty-three-year ministry is recounted, and the people’s stubbornness highlighted. This persistent prophetic call is reminiscent of how God patiently seeks repentance before judgment."
    },
    {
      "pk": 30025004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 4,
      "text": "And the Lord has sent to you all his servants the prophets, sending them persistently, but you have not listened or inclined your ear to hear.",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>; <a href='/AIV/14/36/15-16'>2 Chron. 36:15-16</a>",
      "comment": "God’s mercy is seen in the sending of many prophets, a prefiguration of the way God continues to guide His people throughout salvation history. Compare the repetitive call to repentance throughout the Old Testament."
    },
    {
      "pk": 30025005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 5,
      "text": "They said, 'Turn now, every one of you, from your evil way and your evil deeds, and dwell upon the land that the Lord has given to you and your fathers from of old and forever.'",
      "links": "<a href='/AIV/03/26/42'>Lev. 26:42</a>; <a href='/AIV/24/18/11'>Jer. 18:11</a>",
      "comment": "The prophets urge individual and communal repentance, tying the promise of the land to faithfulness. The perpetuity of the land’s promise has both literal and spiritual fulfillment."
    },
    {
      "pk": 30025006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 6,
      "text": "Do not go after other gods to serve and worship them, or provoke me to anger with the work of your hands. Then I will do you no harm.'",
      "links": "<a href='/AIV/05/6/14'>Deut. 6:14</a>; <a href='/AIV/02/20/4-5'>Ex. 20:4-5</a>",
      "comment": "Exclusive loyalty to the Lord is central here. The reference to 'work of your hands' underscores the issue of idolatry, connecting back to the first commandments."
    },
    {
      "pk": 30025007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 7,
      "text": "Yet you have not listened to me, declares the Lord, that you might provoke me to anger with the work of your hands to your own harm.",
      "links": "<a href='/AIV/24/32/30-32'>Jer. 32:30-32</a>",
      "comment": "Despite clear warnings, the people’s stubbornness leads them to their own destruction—a recurring biblical theme about the consequences of rejecting God's law."
    },
    {
      "pk": 30025008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 8,
      "text": "Therefore thus says the Lord of hosts: Because you have not obeyed my words,",
      "links": "<a href='/AIV/24/9/13'>Jer. 9:13</a>",
      "comment": "A transition: God’s justice must follow prolonged disobedience, illustrating divine patience and the certainty of judgment."
    },
    {
      "pk": 30025009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 9,
      "text": "behold, I will send for all the tribes of the north, declares the Lord, and for Nebuchadnezzar the king of Babylon, my servant, and I will bring them against this land and its inhabitants, and against all these surrounding nations. I will devote them to destruction and make them a horror, a hissing, and an everlasting desolation.",
      "links": "<a href='/AIV/24/27/6'>Jer. 27:6</a>; <a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "God calls Nebuchadnezzar His 'servant,' signifying even foreign rulers can be used to fulfill His purpose. There is an implicit notion in biblical tradition of God working through earthly authorities."
    },
    {
      "pk": 30025010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 10,
      "text": "Moreover, I will silence among them the voice of mirth and gladness, the voice of the bridegroom and the bride, the sound of millstones and the light of the lamp.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/66/18/23'>Rev. 18:23</a>",
      "comment": "Loss of joy, family life, daily labor, and hope—hallmarks of coming judgement. See how similar language appears in Revelation regarding the fall of Babylon, showing unity in God's redemptive narrative."
    },
    {
      "pk": 30025011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 11,
      "text": "This whole land shall become a ruin and a waste, and these nations shall serve the king of Babylon seventy years.",
      "links": "<a href='/AIV/14/36/21'>2 Chron. 36:21</a>; <a href='/AIV/27/9/2'>Dan. 9:2</a>",
      "comment": "The seventy years of exile later becomes a major element in Messianic expectation and Daniel’s prophecies, tying Israel’s history to God’s plan of salvation."
    },
    {
      "pk": 30025012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 12,
      "text": "Then, after seventy years are completed, I will punish the king of Babylon and that nation, the land of the Chaldeans, for their iniquity, declares the Lord, making the land an everlasting waste.",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>; <a href='/AIV/27/5/30-31'>Dan. 5:30-31</a>",
      "comment": "God’s justice comes full circle. He uses Babylon, but also holds it accountable—a significant point about divine sovereignty."
    },
    {
      "pk": 30025013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 13,
      "text": "I will bring upon that land all the words that I have spoken against it, everything written in this book, which Jeremiah prophesied against all the nations.",
      "links": "<a href='/AIV/24/46/1'>Jer. 46:1</a>",
      "comment": "This prefaces the collection of oracles against the nations, indicating God’s sovereignty is not limited to Israel."
    },
    {
      "pk": 30025014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 14,
      "text": "For many nations and great kings will make slaves even of them, and I will repay them according to their deeds and the work of their hands.",
      "links": "<a href='/AIV/24/50/9'>Jer. 50:9</a>; <a href='/AIV/23/13/22'>Isa. 13:22</a>",
      "comment": "God’s justice is universal; the rise and fall of nations is ultimately in His hands."
    },
    {
      "pk": 30025015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 15,
      "text": "For thus says the Lord, the God of Israel, to me: 'Take this cup of the wine of wrath from my hand, and make all the nations to whom I send you drink it.'",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "The 'cup' image is echoed in Christ’s prayer in Gethsemane, foreshadowing the fulfillment of God’s wrath in Christ’s sacrifice for all nations. This is a high Christological motif."
    },
    {
      "pk": 30025016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 16,
      "text": "They shall drink and stagger and lose their minds because of the sword that I am sending among them.",
      "links": "<a href='/AIV/24/49/12'>Jer. 49:12</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>",
      "comment": "Drinking the cup symbolizes submitting to judgment. This is a common biblical metaphor for God’s displeasure."
    },
    {
      "pk": 30025017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 17,
      "text": "So I took the cup from the Lord’s hand and made all the nations to whom the Lord sent me drink it:",
      "links": "<a href='/AIV/24/9/15'>Jer. 9:15</a>",
      "comment": "Jeremiah acts the prophetic sign, enacting the message through symbolic action. Such sacramental actions prefigure later practices in the New Testament."
    },
    {
      "pk": 30025018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 18,
      "text": "Jerusalem and the cities of Judah, its kings and officials, to make them a desolation and a waste, a hissing and a curse, as it is this day;",
      "links": "<a href='/AIV/24/19/8'>Jer. 19:8</a>; <a href='/AIV/24/26/6'>Jer. 26:6</a>",
      "comment": "God’s chosen city is not exempt from His justice when it turns away. The curse echoes Deuteronomy, showing the continuity of the covenant’s blessings and consequences."
    },
    {
      "pk": 30025019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 19,
      "text": "Pharaoh king of Egypt, his servants, his officials, and all his people;",
      "links": "<a href='/AIV/24/46/2'>Jer. 46:2</a>",
      "comment": "Egypt, once the place of Israel’s bondage, is also subject to God’s judgment. God’s reach is absolute over all nations."
    },
    {
      "pk": 30025020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 20,
      "text": "all the mixed people, all the kings of the land of Uz, all the kings of the land of the Philistines (Ashkelon, Gaza, Ekron, and the remnant of Ashdod);",
      "links": "<a href='/AIV/24/47/1'>Jer. 47:1</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "A list of nations illustrates God’s impartiality in judgment. The land of Uz connects to the story of Job, showing the universal scope of God’s dealings."
    },
    {
      "pk": 30025021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 21,
      "text": "Edom, Moab, and the sons of Ammon;",
      "links": "<a href='/AIV/01/19/37-38'>Gen. 19:37-38</a>; <a href='/AIV/24/49/7'>Jer. 49:7</a>",
      "comment": "Descendants of Lot, closely related to Israel, yet still recipients of divine judgment—reminding us of personal responsibility before God."
    },
    {
      "pk": 30025022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 22,
      "text": "all the kings of Tyre, all the kings of Sidon, and the kings of the coastland across the sea;",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "Wealthy maritime powers are also judged—God’s sovereignty over human commerce and culture is asserted."
    },
    {
      "pk": 30025023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 23,
      "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;",
      "links": "<a href='/AIV/24/49/28'>Jer. 49:28</a>; <a href='/AIV/03/19/27'>Lev. 19:27</a>",
      "comment": "References to cultural practices (‘cutting corners of hair’) show God’s awareness of ethnic diversity, yet His demand for all to acknowledge Him."
    },
    {
      "pk": 30025024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 24,
      "text": "all the kings of Arabia and all the kings of the mixed peoples who dwell in the desert;",
      "links": "<a href='/AIV/24/25/20'>Jer. 25:20</a>",
      "comment": "Arabian tribes included, showing God’s message embraces all nations."
    },
    {
      "pk": 30025025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 25,
      "text": "all the kings of Zimri, all the kings of Elam, and all the kings of Media;",
      "links": "<a href='/AIV/27/8/2'>Dan. 8:2</a>",
      "comment": "Many of these nations would later factor into the shifting empires of Daniel’s visions, showing God’s foreknowledge."
    },
    {
      "pk": 30025026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 26,
      "text": "all the kings of the north, far and near, one after another, and all the kingdoms of the world that are on the face of the earth. After them the king of Sheshach shall drink.",
      "links": "<a href='/AIV/24/51/41'>Jer. 51:41</a>",
      "comment": "'Sheshach' is a cryptic name for Babylon, symbolizing the completeness of God’s judgment. God’s ultimate justice is universal, underscoring the unity of salvation and judgment history."
    },
    {
      "pk": 30025027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 27,
      "text": "You shall say to them, 'Thus says the Lord of hosts, the God of Israel: Drink, be drunk and vomit, fall and rise no more, because of the sword that I am sending among you.'",
      "links": "<a href='/AIV/23/29/9'>Isa. 29:9</a>",
      "comment": "The imagery intensifies; the sword is a standard biblical metaphor for judgment."
    },
    {
      "pk": 30025028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 28,
      "text": "And if they refuse to accept the cup from your hand to drink, then you shall say to them, ‘Thus says the Lord of hosts: You must drink!'",
      "links": "<a href='/AIV/24/49/12'>Jer. 49:12</a>",
      "comment": "Refusing God’s judgment does not avert it—a reminder of the inescapability of God’s sovereign will."
    },
    {
      "pk": 30025029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 29,
      "text": "For behold, I am beginning to work disaster at the city that is called by my name, and shall you go unpunished? You shall not go unpunished, for I am summoning a sword against all the inhabitants of the earth, declares the Lord of hosts.’",
      "links": "<a href='/AIV/24/13/13'>Jer. 13:13</a>; <a href='/AIV/60/4/17'>1 Pet. 4:17</a>",
      "comment": "Judgment begins with God’s own house, a principle reiterated in the New Testament (1 Pet. 4:17)."
    },
    {
      "pk": 30025030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 30,
      "text": "You, therefore, shall prophesy against them all these words, and say to them: ‘The Lord will roar from on high, and from his holy dwelling utter his voice; he will roar mightily against his fold, and shout, like those who tread grapes, against all the inhabitants of the earth.'",
      "links": "<a href='/AIV/29/3/16'>Joel 3:16</a>; <a href='/AIV/23/63/3'>Isa. 63:3</a>",
      "comment": "The image of God 'roaring' and 'treading grapes' evokes decisive, world-shaking judgment. This motif is also used in apocalyptic literature."
    },
    {
      "pk": 30025031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 31,
      "text": "The noise will reach to the ends of the earth, for the Lord has an indictment against the nations; He is entering into judgment with all flesh. As for the wicked, he will give them to the sword, declares the Lord.'",
      "links": "<a href='/AIV/23/66/16'>Isa. 66:16</a>",
      "comment": "God’s judgment is not limited to Israel but extends to 'all flesh.' This anticipates the universal scope of redemption through Christ."
    },
    {
      "pk": 30025032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 32,
      "text": "'Thus says the Lord of hosts: Behold, disaster is going forth from nation to nation, and a great tempest is stirring from the farthest parts of the earth!'",
      "links": "<a href='/AIV/24/23/19'>Jer. 23:19</a>",
      "comment": "The worldwide scale of judgment continues to be stressed, serving as a backcloth for anticipations of salvation for all peoples."
    },
    {
      "pk": 30025033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 33,
      "text": "And those pierced by the Lord on that day shall extend from one end of the earth to the other. They shall not be lamented or gathered or buried; they shall be dung on the surface of the ground.",
      "links": "<a href='/AIV/24/8/2'>Jer. 8:2</a>; <a href='/AIV/66/19/18'>Rev. 19:18</a>",
      "comment": "The scope of judgment leaves no one untouched. The absence of burial points to overwhelming calamity, a theme that also appears in the final judgment in Revelation."
    },
    {
      "pk": 30025034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 34,
      "text": "Wail, you shepherds, and cry out, and roll in ashes, you leaders of the flock, for the days of your slaughter and your dispersions have come, and you shall fall like a choice vessel.",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>",
      "comment": "Shepherds symbolize leaders—failure of spiritual leadership leads to disaster. Spiritual authority is shown to be deeply consequential."
    },
    {
      "pk": 30025035,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 35,
      "text": "No refuge will remain for the shepherds, nor escape for the leaders of the flock.",
      "links": "<a href='/AIV/24/4/29'>Jer. 4:29</a>",
      "comment": "Even leaders cannot shield themselves from God’s hand—authority brings responsibility before God."
    },
    {
      "pk": 30025036,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 36,
      "text": "A sound—the cry of the shepherds and the wailing of the leaders of the flock! For the Lord is laying waste their pasture,",
      "links": "<a href='/AIV/24/10/21'>Jer. 10:21</a>",
      "comment": "Pastures represent God’s care. Their destruction reveals the seriousness of abandoning divine guidance."
    },
    {
      "pk": 30025037,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 37,
      "text": "and the peaceful folds are devastated because of the fierce anger of the Lord.",
      "links": "<a href='/AIV/24/12/10'>Jer. 12:10</a>",
      "comment": "Divine wrath disrupts even 'peaceful' communities when unfaithfulness prevails."
    },
    {
      "pk": 30025038,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 25,
      "verse": 38,
      "text": "Like a lion he has left his lair, for their land has become a waste because of the sword of the oppressor and because of his fierce anger.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>; <a href='/AIV/28/5/14'>Hos. 5:14</a>",
      "comment": "The lion image signals unstoppable judgment, concluding the chapter. Note the pattern: judgment, exile, and eventual promise of restoration, later perfectly fulfilled through the new covenant in Christ."
    }
  ],
  "translatedAt": "2025-12-24T08:35:12.841Z"
}