{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 52,
  "verses": [
    {
      "pk": 742001,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 1,
      "text": "Zedekiah was twenty-one years old when he became king, and he reigned in Jerusalem eleven years. His mother's name was Hamutal, the daughter of Jeremiah of Libnah.",
      "links": "<a href='/AIV/12/24/18'>2 Kings 24:18</a>; <a href='/AIV/24/39/1'>Jer. 39:1</a>",
      "comment": "This verse introduces Zedekiah, the last king of Judah before the Babylonian exile. The details match those in 2 Kings, establishing the historical context for Jerusalem's fall."
    },
    {
      "pk": 742002,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 2,
      "text": "He did what was evil in the sight of the LORD, just as Jehoiakim had done.",
      "links": "<a href='/AIV/12/24/19'>2 Kings 24:19</a>; <a href='/AIV/24/21/12'>Jer. 21:12</a>",
      "comment": "This echoes an earlier biblical theme: unfaithfulness to God leads to judgment. The focus on obedience to God prepares for later understandings of faith and authority."
    },
    {
      "pk": 742003,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 3,
      "text": "For because of the anger of the LORD this happened in Jerusalem and Judah, until He finally cast them out from His presence. Zedekiah rebelled against the king of Babylon.",
      "links": "<a href='/AIV/24/7/15'>Jer. 7:15</a>; <a href='/AIV/24/39/1'>Jer. 39:1</a>",
      "comment": "God’s judgment is described as a consequence of the people's rebellion and their leader's defiance. The spiritual meaning points to the necessity of remaining within God’s covenant."
    },
    {
      "pk": 742004,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 4,
      "text": "In the ninth year of Zedekiah's reign, on the tenth day of the tenth month, Nebuchadnezzar king of Babylon came—he and all his army—against Jerusalem. They laid siege to it and built siege works all around.",
      "links": "<a href='/AIV/12/25/1'>2 Kings 25:1</a>",
      "comment": "The detailed date emphasizes the historical accuracy and importance of this event. The siege fulfills earlier prophetic warnings (<a href='/AIV/24/34/2'>Jer. 34:2</a>)."
    },
    {
      "pk": 742005,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 5,
      "text": "So the city was besieged until the eleventh year of King Zedekiah.",
      "links": "<a href='/AIV/24/39/2'>Jer. 39:2</a>",
      "comment": "This shows the patience of God, giving Judah time to repent, though judgment comes at last."
    },
    {
      "pk": 742006,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 6,
      "text": "On the ninth day of the fourth month, the famine became so severe in the city that there was no food for the people of the land.",
      "links": "<a href='/AIV/25/4/9'>Lam. 4:9</a>; <a href='/AIV/12/25/3'>2 Kings 25:3</a>",
      "comment": "The suffering and famine fulfill curses anticipated in the Law (Deut. 28:52-57), highlighting the seriousness of breaking covenant with God."
    },
    {
      "pk": 742007,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 7,
      "text": "Then the city was broken into. All the soldiers fled by night by way of the gate between the two walls, by the king's garden—though the Chaldeans were all around the city. They went by way of the Arabah.",
      "links": "<a href='/AIV/12/25/4'>2 Kings 25:4</a>; <a href='/AIV/24/39/4'>Jer. 39:4</a>",
      "comment": "The flight of the soldiers marks total defeat. Spiritually, it signals the end of the old order and sets the stage for renewal by God."
    },
    {
      "pk": 742008,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 8,
      "text": "But the army of the Chaldeans pursued the king, and overtook Zedekiah in the plains of Jericho; all his army was scattered from him.",
      "links": "<a href='/AIV/12/25/5'>2 Kings 25:5</a>",
      "comment": "Jericho is symbolic of Israel’s beginnings. Its mention here marks a tragic reversal—the undoing of what God had begun through Joshua."
    },
    {
      "pk": 742009,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 9,
      "text": "They captured the king and brought him up to the king of Babylon at Riblah, in the land of Hamath, and he pronounced judgment on him.",
      "links": "<a href='/AIV/24/39/5'>Jer. 39:5</a>",
      "comment": "Zedekiah receives judgment from a foreign power—indicating God’s sovereignty even over pagan kings."
    },
    {
      "pk": 742010,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 10,
      "text": "The king of Babylon slaughtered the sons of Zedekiah before his eyes, and he also slaughtered all the officials of Judah at Riblah.",
      "links": "<a href='/AIV/24/39/6'>Jer. 39:6</a>",
      "comment": "Justice is executed fully. As in later Christian understanding, the seriousness of sin carries profound consequences."
    },
    {
      "pk": 742011,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 11,
      "text": "He put out the eyes of Zedekiah, bound him with bronze shackles, and took him to Babylon, where he put him in prison till the day of his death.",
      "links": "<a href='/AIV/12/25/7'>2 Kings 25:7</a>",
      "comment": "Zedekiah's blindness fulfills Ezekiel’s prophecy (Ezek. 12:13), showing the reliability of God’s word."
    },
    {
      "pk": 742012,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 12,
      "text": "On the tenth day of the fifth month, in the nineteenth year of King Nebuchadnezzar, Nebuzaradan the captain of the guard, who served the king of Babylon, entered Jerusalem.",
      "links": "<a href='/AIV/12/25/8'>2 Kings 25:8</a>",
      "comment": "This marks the beginning of the final destruction of Jerusalem, as prophesied in many earlier texts."
    },
    {
      "pk": 742013,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 13,
      "text": "He burned the house of the LORD, the king’s house, and all the houses of Jerusalem; every great house he burned with fire.",
      "links": "<a href='/AIV/24/7/14'>Jer. 7:14</a>; <a href='/AIV/24/39/8'>Jer. 39:8</a>",
      "comment": "The destruction of the Temple marked a turning point in Israel’s worship, setting the stage for later theological development on God's presence."
    },
    {
      "pk": 742014,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 14,
      "text": "All the army of the Chaldeans, who were with the captain of the guard, tore down all the walls around Jerusalem.",
      "links": "<a href='/AIV/25/2/9'>Lam. 2:9</a>",
      "comment": "This completes Jerusalem’s ruin. The loss points ahead to hope for a future restoration (see Ezekiel 36:33–36)."
    },
    {
      "pk": 742015,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 15,
      "text": "Nebuzaradan, the captain of the guard, carried away into exile some of the poorest people, as well as the rest of the people left in the city, the deserters who had defected to the king of Babylon, and the rest of the craftsmen.",
      "links": "<a href='/AIV/24/39/9'>Jer. 39:9</a>",
      "comment": "The exile included not only the elite but common people, symbolizing total displacement."
    },
    {
      "pk": 742016,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 16,
      "text": "But Nebuzaradan, the captain of the guard, left some of the poorest people of the land as vine-dressers and farmers.",
      "links": "<a href='/AIV/12/25/12'>2 Kings 25:12</a>",
      "comment": "A remnant remained; throughout Scripture, God uses remnants for His saving work (<a href='/AIV/23/10/20-22'>Isa. 10:20-22</a>)."
    },
    {
      "pk": 742017,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 17,
      "text": "The Chaldeans broke into pieces the bronze pillars, the stands, and the bronze sea that were in the house of the LORD, and carried all their bronze to Babylon.",
      "links": "<a href='/AIV/11/7/15-47'>1 Kings 7:15-47</a>",
      "comment": "The removal of these sacred items marks the end of the Old Covenant worship system."
    },
    {
      "pk": 742018,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 18,
      "text": "They also took away the pots, the shovels, the wick trimmers, the bowls, the spoons, and all the vessels of bronze used in the temple service.",
      "links": "<a href='/AIV/4/4/14'>Num. 4:14</a>",
      "comment": "The loss of liturgical vessels signifies the interruption of public and formal worship which pointed toward later developments in worship and liturgy."
    },
    {
      "pk": 742019,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 19,
      "text": "The captain of the guard took away the basins, firepans, bowls, pots, lampstands, spoons, and cups, that were of pure gold or silver.",
      "links": "<a href='/AIV/2/25/29-39'>Ex. 25:29–39</a>",
      "comment": "Rich detail of sacred vessels accentuates the tremendous loss and foreshadows hope of eventual restoration and a more perfect form of worship (Heb. 9:1–12)."
    },
    {
      "pk": 742020,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 20,
      "text": "As for the two pillars, the one sea, and the twelve bronze bulls under the sea, which King Solomon made for the house of the LORD—the bronze of all these vessels was beyond weighing.",
      "links": "<a href='/AIV/11/7/23-25'>1 Kings 7:23-25</a>",
      "comment": "Links to the glory of Solomon’s Temple; the removal marks the end of an era."
    },
    {
      "pk": 742021,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 21,
      "text": "About the pillars: each pillar was eighteen cubits high and twelve cubits in circumference; each pillar was four fingers thick, and hollow.",
      "links": "<a href='/AIV/11/7/15'>1 Kings 7:15</a>",
      "comment": "Details match those given of Solomon’s original construction."
    },
    {
      "pk": 742022,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 22,
      "text": "On it was a capital of bronze; the height of the capital was five cubits. There was latticework and pomegranates all around, all of bronze. The second pillar was the same, with pomegranates.",
      "links": "<a href='/AIV/11/7/18-20'>1 Kings 7:18-20</a>",
      "comment": "The pomegranates symbolized abundance, recalling God’s original blessings and the fruitfulness He intends for His people."
    },
    {
      "pk": 742023,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 23,
      "text": "There were ninety-six pomegranates on the sides; all the pomegranates totaled a hundred upon the latticework all around.",
      "links": "",
      "comment": "The listing of pomegranates highlights beauty and order in God’s house, reflecting the sacredness of divine worship."
    },
    {
      "pk": 742024,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 24,
      "text": "The captain of the guard took Seraiah the chief priest, Zephaniah the second priest, and the three keepers of the threshold.",
      "links": "<a href='/AIV/24/29/25'>Jer. 29:25</a>",
      "comment": "The removal of priests points to the disruption of valid worship; anticipation for restoration and continuity in spiritual leaders."
    },
    {
      "pk": 742025,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 25,
      "text": "And from the city he took an officer who was in command of the men of war, seven men of those who saw the king’s face, who were found in the city, the scribe of the commander of the army who mustered the people of the land, and sixty men of the people of the land who were found within the city.",
      "links": "",
      "comment": "The thoroughness of the capture shows the total end of the old establishment."
    },
    {
      "pk": 742026,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 26,
      "text": "Nebuzaradan the captain of the guard took them and brought them to the king of Babylon at Riblah.",
      "links": "",
      "comment": "Bringing leaders to judgment draws a parallel to God’s final judgment on all people (Matt. 25:31–46)."
    },
    {
      "pk": 742027,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 27,
      "text": "The king of Babylon struck them down and put them to death at Riblah in the land of Hamath. Thus Judah was taken into exile from its land.",
      "links": "<a href='/AIV/24/39/9'>Jer. 39:9</a>",
      "comment": "Exile here echoes the exile of Adam and Eve from Eden—showing the need for a later return through God’s grace."
    },
    {
      "pk": 742028,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 28,
      "text": "This is the number of people whom Nebuchadnezzar carried away into exile: in the seventh year, 3,023 Jews;",
      "links": "",
      "comment": "The careful record shows the significance of each person in God’s plan."
    },
    {
      "pk": 742029,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 29,
      "text": "in the eighteenth year of Nebuchadnezzar he carried away 832 people from Jerusalem;",
      "links": "",
      "comment": ""
    },
    {
      "pk": 742030,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 30,
      "text": "in the twenty-third year of Nebuchadnezzar, Nebuzaradan the captain of the guard carried away 745 Jews; altogether, there were 4,600 persons.",
      "links": "",
      "comment": "The partial exile (not total) anticipates an eventual return and restoration—a hope for God’s people."
    },
    {
      "pk": 742031,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 31,
      "text": "In the thirty-seventh year of the exile of Jehoiachin king of Judah, on the twenty-fifth day of the twelfth month, Evil-merodach king of Babylon, in the year he became king, released Jehoiachin king of Judah from prison.",
      "links": "<a href='/AIV/12/25/27'>2 Kings 25:27</a>",
      "comment": "The release of Jehoiachin signals a renewed hope and is a type of the ultimate deliverance God will provide."
    },
    {
      "pk": 742032,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 32,
      "text": "He spoke kindly to him and gave him a seat above the seats of the kings who were with him in Babylon.",
      "links": "",
      "comment": "The king’s mercy hints at God’s continuing favor on the line of David, foreshadowing the coming of Christ (Matt. 1:12)."
    },
    {
      "pk": 742033,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 33,
      "text": "So Jehoiachin put off his prison garments. He ate bread regularly at the king’s table all the days of his life.",
      "links": "",
      "comment": "The imagery of sharing the king’s table reflects restoration and communion, prefiguring themes fulfilled in Christ, such as the heavenly banquet (Rev. 19:9)."
    },
    {
      "pk": 742034,
      "translation": "AIV",
      "book": 24,
      "chapter": 52,
      "verse": 34,
      "text": "As for his allowance, a regular allowance was given him by the king of Babylon, a daily portion for each day, all the days of his life.",
      "links": "",
      "comment": "Receiving daily bread connects with the idea of God's ongoing provision. This foreshadows spiritual sustenance (see Matt. 6:11) for the faithful under God's new covenant."
    }
  ],
  "translatedAt": "2025-12-23T06:43:27.590Z"
}