{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 44,
  "verses": [
    {
      "pk": 2444001,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 1,
      "text": "The word that came to Jeremiah concerning all the Jews living in the land of Egypt, those in Migdol, Tahpanhes, Memphis, and in the land of Pathros:",
      "links": "<a href='/AIV/24/43/7'>Jer. 43:7</a>; <a href='/AIV/24/46/14'>Jer. 46:14</a>",
      "comment": "Jeremiah addresses Jews who settled in various cities of Egypt. The spread shows the extent of the exile after Jerusalem’s fall."
    },
    {
      "pk": 2444002,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 2,
      "text": "This is what the LORD of hosts, the God of Israel, says: You yourselves have seen all the disaster I brought upon Jerusalem and upon all the towns of Judah. See, they are a ruin today, with no inhabitant in them.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/24/25/9-11'>Jer. 25:9–11</a>",
      "comment": "God’s warning invokes the fulfilled judgments on Jerusalem, reminding Israel and all believers of the consequences of persistent sin."
    },
    {
      "pk": 2444003,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 3,
      "text": "Because of their wickedness which they committed to provoke Me to anger, by offering incense and serving other gods, whom neither they nor you nor your fathers knew.",
      "links": "<a href='/AIV/24/1/16'>Jer. 1:16</a>; <a href='/AIV/5/32/16-17'>Deut. 32:16–17</a>",
      "comment": "Idolatry is interpreted as spiritual adultery, a theme seen throughout Scripture. This prepares for New Testament emphasis on fidelity to Christ (see <a href='/AIV/59/4/4'>James 4:4</a>)."
    },
    {
      "pk": 2444004,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 4,
      "text": "Yet I sent you all My servants the prophets, rising early and sending them, saying: 'Do not do this abominable thing that I hate.'",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>; <a href='/AIV/24/25/4'>Jer. 25:4</a>",
      "comment": "The repeated sending of prophets prefigures God’s eventual sending of His Son (<a href='/AIV/42/20/13'>Luke 20:13</a>), showing His enduring patience and love."
    },
    {
      "pk": 2444005,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 5,
      "text": "But they did not listen or incline their ear to turn from their wickedness and stop offering incense to other gods.",
      "links": "<a href='/AIV/24/11/8'>Jer. 11:8</a>; <a href='/AIV/24/32/33'>Jer. 32:33</a>",
      "comment": "Persistent refusal to listen is compared to the hard-heartedness condemned by Jesus (<a href='/AIV/40/13/15'>Matt. 13:15</a>)."
    },
    {
      "pk": 2444006,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 6,
      "text": "Therefore My wrath and My anger were poured out and burned in the cities of Judah and in the streets of Jerusalem; they have become a desolation and a ruin, as you see today.",
      "links": "<a href='/AIV/25/2/2'>Lam. 2:2</a>; <a href='/AIV/24/19/8'>Jer. 19:8</a>",
      "comment": "The devastation of Jerusalem prefigures spiritual desolation caused by sin; Christ weeps over Jerusalem for this reason (<a href='/AIV/42/19/41-44'>Luke 19:41–44</a>)."
    },
    {
      "pk": 2444007,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 7,
      "text": "Now thus says the LORD God of hosts, the God of Israel: Why do you bring great disaster upon yourselves, to cut off from you man and woman, child and infant, from the midst of Judah, leaving yourselves without a remnant?",
      "links": "<a href='/AIV/24/42/17'>Jer. 42:17</a>; <a href='/AIV/24/5/21'>Jer. 5:21</a>",
      "comment": "God’s question highlights human responsibility. The notion of a 'remnant' will become spiritually significant for God’s people (see <a href='/AIV/45/11/5'>Rom. 11:5</a>)."
    },
    {
      "pk": 2444008,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 8,
      "text": "Why do you provoke Me to anger with the works of your hands, burning incense to other gods in the land of Egypt, where you have gone to dwell, so you may be cut off and become a curse and a reproach among all nations of the earth?",
      "links": "<a href='/AIV/24/18/15-16'>Jer. 18:15–16</a>; <a href='/AIV/24/42/18'>Jer. 42:18</a>",
      "comment": "Their actions turn blessing into a curse, opposing God’s intended vocation for Israel (<a href='/AIV/1/12/2-3'>Gen. 12:2–3</a>)."
    },
    {
      "pk": 2444009,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 9,
      "text": "Have you forgotten the wickedness of your fathers, the wickedness of the kings of Judah, the wickedness of their wives, your own wickedness, and the wickedness of your wives, which they committed in the land of Judah and in the streets of Jerusalem?",
      "links": "<a href='/AIV/24/7/17-18'>Jer. 7:17–18</a>",
      "comment": "The inclusion of ‘wives’ highlights how family and communal choices lead the entire people astray."
    },
    {
      "pk": 2444010,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 10,
      "text": "They have not been humbled to this day, nor have they feared, nor walked in My law or My statutes that I set before you and your fathers.",
      "links": "<a href='/AIV/2/20/20'>Ex. 20:20</a>; <a href='/AIV/5/10/12'>Deut. 10:12</a>",
      "comment": "Obedience to God’s law is tied to covenant blessing; the prophets consistently call not just for outward compliance but for true repentance (cf. <a href='/AIV/24/31/33'>Jer. 31:33</a>)."
    },
    {
      "pk": 2444011,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 11,
      "text": "Therefore thus says the LORD of hosts, the God of Israel: Behold, I will set My face against you for harm, so as to cut off all Judah.",
      "links": "<a href='/AIV/24/21/10'>Jer. 21:10</a>; <a href='/AIV/24/15/4'>Jer. 15:4</a>",
      "comment": "A stern warning of divine opposition. ‘Setting My face’ is echoed in <a href='/AIV/3/17/10'>Lev. 17:10</a> and highlights God’s just judgment."
    },
    {
      "pk": 2444012,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 12,
      "text": "And I will take the remnant of Judah, who have set their faces to go into the land of Egypt to reside there, and they shall all be consumed; they shall fall by the sword and by famine. They shall be an object of horror and a curse, a taunt and a reproach.",
      "links": "<a href='/AIV/24/42/22'>Jer. 42:22</a>; <a href='/AIV/24/24/10'>Jer. 24:10</a>",
      "comment": "A prophecy of destruction for disobedience. This follows the biblical pattern where those who seek life outside God’s will find death (see <a href='/AIV/40/16/25'>Matt. 16:25</a>)."
    },
    {
      "pk": 2444013,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 13,
      "text": "For I will punish those who dwell in the land of Egypt, as I have punished Jerusalem: by the sword, by famine, and by plague.",
      "links": "<a href='/AIV/24/14/12'>Jer. 14:12</a>; <a href='/AIV/24/29/17-18'>Jer. 29:17–18</a>",
      "comment": "God’s justice is impartial and affects even those outside the Promised Land if they persist in disobedience."
    },
    {
      "pk": 2444014,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 14,
      "text": "So none of the remnant of Judah who have gone to dwell in the land of Egypt shall escape or survive to return to the land of Judah, to which they desire to return and live; none shall return except a few refugees.",
      "links": "<a href='/AIV/24/42/17'>Jer. 42:17</a>; <a href='/AIV/24/44/28'>Jer. 44:28</a>",
      "comment": "This verse notes a small exception: a few will escape. The biblical theme of a remnant is vital to God’s plan of redemption (see <a href='/AIV/23/10/20-22'>Isa. 10:20–22</a>), later fulfilled in Christ."
    },
    {
      "pk": 2444015,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 15,
      "text": "Then all the men who knew that their wives had burned incense to other gods, and all the women who stood by, a great assembly, with all the people who lived in Pathros in the land of Egypt, answered Jeremiah:",
      "links": "<a href='/AIV/24/44/9'>Jer. 44:9</a>",
      "comment": "Here, both men and women are implicated in idol worship, showing the communal scope of sin."
    },
    {
      "pk": 2444016,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 16,
      "text": "\"As for the word that you have spoken to us in the name of the LORD, we will not listen to you.",
      "links": "<a href='/AIV/24/43/2'>Jer. 43:2</a>",
      "comment": "The people’s hardened response echoes the rejection faced by Christ and the apostles (<a href='/AIV/44/7/51-53'>Acts 7:51–53</a>)."
    },
    {
      "pk": 2444017,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 17,
      "text": "But we will do everything that has proceeded from our mouth, to burn incense to the queen of heaven and pour out drink offerings to her, as we and our fathers, our kings and our officials did in the cities of Judah and in the streets of Jerusalem; for then we had plenty of food and prospered and saw no disaster.",
      "links": "<a href='/AIV/24/7/18'>Jer. 7:18</a>",
      "comment": "‘Queen of heaven’ reflects a syncretism with pagan fertility cults. Their misplaced trust in visible blessing recalls how faith is not always rewarded with immediate prosperity."
    },
    {
      "pk": 2444018,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 18,
      "text": "But since we stopped burning incense to the queen of heaven and pouring out drink offerings to her, we have lacked everything and have been consumed by the sword and by famine.",
      "links": "<a href='/AIV/24/44/12'>Jer. 44:12</a>",
      "comment": "They wrongly interpret their suffering as the result of abandoning idolatry, not understanding that their true source of blessing is faithful worship of God."
    },
    {
      "pk": 2444019,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 19,
      "text": "The women said, 'When we burned incense to the queen of heaven and poured out drink offerings to her, was it without our husbands' knowledge we made cakes shaped like her image and poured out drink offerings to her?'",
      "links": "<a href='/AIV/24/7/18'>Jer. 7:18</a>",
      "comment": "This verse shows idolatry was a family activity, highlighting the importance of leading families in right worship—an Old and New Testament theme."
    },
    {
      "pk": 2444020,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 20,
      "text": "Then Jeremiah said to all the people, to the men and the women, and to all the people who had given him this answer:",
      "links": "<a href='/AIV/24/44/15'>Jer. 44:15</a>",
      "comment": "Jeremiah addresses the entire assembly directly, reinforcing his role as God’s mouthpiece, similar to prophetic and apostolic authority."
    },
    {
      "pk": 2444021,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 21,
      "text": "\"The incense that you burned in the cities of Judah and in the streets of Jerusalem—you, your fathers, your kings, your officials, and the people of the land—did not the LORD remember and did it not come into His mind?",
      "links": "<a href='/AIV/24/11/13'>Jer. 11:13</a>",
      "comment": "God’s memory of our actions shows both the seriousness of sin and the value He attaches to proper worship."
    },
    {
      "pk": 2444022,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 22,
      "text": "The LORD could no longer bear it because of the evil of your deeds, because of the abominations you committed; so your land became a ruin, a horror, and a curse, without inhabitant, as it is today.",
      "links": "<a href='/AIV/24/44/6'>Jer. 44:6</a>",
      "comment": "God’s justice responds to persistent abomination. The pattern of sin, judgment, and eventual restoration occurs throughout salvation history."
    },
    {
      "pk": 2444023,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 23,
      "text": "Because you have burned incense and sinned against the LORD, and have not obeyed the voice of the LORD or walked in His law, His statutes, or His testimonies, therefore this disaster has come upon you, as you see this day.\"",
      "links": "<a href='/AIV/24/34/17'>Jer. 34:17</a>",
      "comment": "Their punishment directly follows their disobedience, an Old Testament principle that finds fulfillment in the need for redemption by Christ."
    },
    {
      "pk": 2444024,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 24,
      "text": "Jeremiah said to all the people, including all the women, 'Hear the word of the LORD, all Judah who are in the land of Egypt.'",
      "links": "<a href='/AIV/24/44/26'>Jer. 44:26</a>",
      "comment": "The Lord’s word addresses both men and women, underlining corporate responsibility and the necessity of communal faithfulness."
    },
    {
      "pk": 2444025,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 25,
      "text": "Thus says the LORD of hosts, the God of Israel: 'You and your wives have spoken with your mouths and fulfilled it with your hands, saying, “We will surely perform our vows that we have vowed, to burn incense to the queen of heaven and pour out drink offerings to her.” You will surely keep your vows and perform your vows!'",
      "links": "<a href='/AIV/24/44/17'>Jer. 44:17</a>",
      "comment": "This irony exposes the folly of vows made to false gods; the true vow is fidelity to God’s covenant (see <a href='/AIV/19/76/11'>Ps. 76:11</a>)."
    },
    {
      "pk": 2444026,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 26,
      "text": "Therefore hear the word of the LORD, all of Judah who dwell in the land of Egypt: 'Behold, I have sworn by My great name,' says the LORD, 'that My name will no more be invoked by the mouth of any man of Judah in all the land of Egypt, saying, “As the Lord GOD lives.”'",
      "links": "<a href='/AIV/24/12/16'>Jer. 12:16</a>",
      "comment": "God’s oath in His own Name underscores the seriousness of Israel’s apostasy. The loss of His Name represents loss of relationship and blessing."
    },
    {
      "pk": 2444027,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 27,
      "text": "Behold, I am watching over them for harm and not for good. All the men of Judah who are in the land of Egypt shall perish by the sword and by famine until they are consumed.",
      "links": "<a href='/AIV/24/31/28'>Jer. 31:28</a>",
      "comment": "The reversal of God’s protective watching. Normally, ‘watching’ is for good (<a href='/AIV/24/31/28'>Jer. 31:28</a>); here it is for judgment."
    },
    {
      "pk": 2444028,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 28,
      "text": "And those who escape the sword shall return from the land of Egypt to the land of Judah, few in number; and all the remnant of Judah, who went to Egypt to reside there, shall know whose word will stand, Mine or theirs.",
      "links": "<a href='/AIV/24/44/14'>Jer. 44:14</a>",
      "comment": "God’s word will always be vindicated. The theme of a faithful remnant being preserved prefigures the Church’s continuity."
    },
    {
      "pk": 2444029,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 29,
      "text": "This shall be the sign to you,' declares the LORD, 'that I will punish you in this place, so that you may know that My words will surely stand against you for harm:'",
      "links": "<a href='/AIV/24/43/10-13'>Jer. 43:10–13</a>",
      "comment": "God gives a sign to confirm His word, anticipating New Testament usage of signs that validate authority (e.g., <a href='/AIV/40/12/39'>Matt. 12:39</a>)."
    },
    {
      "pk": 2444030,
      "translation": "AIV",
      "book": 24,
      "chapter": 44,
      "verse": 30,
      "text": "Thus says the LORD: 'Behold, I will hand over Pharaoh Hophra king of Egypt to his enemies and to those who seek his life, just as I gave Zedekiah king of Judah into the hand of Nebuchadnezzar king of Babylon, his enemy, who sought his life.'",
      "links": "<a href='/AIV/24/46/25-26'>Jer. 46:25–26</a>; <a href='/AIV/24/39/5-7'>Jer. 39:5–7</a>",
      "comment": "This prophecy was fulfilled historically (Pharaoh Hophra was overthrown). God’s sovereign control over rulers points forward to Christ, the true King, who fulfills the promise of righteous rule (see <a href='/AIV/42/1/32-33'>Luke 1:32–33</a>)."
    }
  ],
  "translatedAt": "2025-12-23T06:37:35.809Z"
}