{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 16,
  "verses": [
    {
      "pk": 241601,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 1,
      "text": "The word of the Lord came to me, saying:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "Introductory formula, emphasizing the direct revelation from God to Jeremiah. This highlights the prophet's authority and the importance of listening to God's message."
    },
    {
      "pk": 241602,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 2,
      "text": "\"You shall not take a wife, nor shall you have sons or daughters in this place.\"",
      "links": "<a href='/AIV/24/15/1'>Jer. 15:1–2</a>; <a href='/AIV/24/7/3-4'>Jer. 7:3-4</a>",
      "comment": "Jeremiah is commanded to abstain from marriage and family in Jerusalem as a sign of the coming judgment. A symbolic action, pointing to the seriousness of imminent disaster for the people."
    },
    {
      "pk": 241603,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 3,
      "text": "For this is what the Lord says concerning the sons and daughters born in this place, and concerning the mothers who bear them and the fathers who father them in this land:",
      "links": "<a href='/AIV/24/15/8'>Jer. 15:8</a>",
      "comment": "Sets up God's explanation concerning the fate of families in Jerusalem, reinforcing the prophetic seriousness of Jeremiah's unmarried status."
    },
    {
      "pk": 241604,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 4,
      "text": "\"They shall die of deadly diseases. They shall not be mourned nor buried; they shall be as dung on the surface of the ground. By sword and famine they shall be consumed, and their bodies shall become food for the birds of the sky and for the beasts of the earth.\"",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/24/8/2'>Jer. 8:2</a>; <a href='/AIV/5/28/26'>Deut. 28:26</a>",
      "comment": "This graphic prophecy uses vivid imagery to describe utter devastation and dishonor. Those who die will not receive the traditional mourning or burial, indicating total abandonment and spiritual desolation."
    },
    {
      "pk": 241605,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 5,
      "text": "For this is what the Lord says: \"Do not enter the house of mourning, nor go to lament, nor grieve for them, for I have withdrawn my peace from this people, declares the Lord, even my steadfast love and mercy.\"",
      "links": "<a href='/AIV/24/14/11'>Jer. 14:11</a>; <a href='/AIV/24/13/14'>Jer. 13:14</a>",
      "comment": "God instructs Jeremiah not to participate in customary mourning, symbolizing the removal of His covenant blessings—peace, mercy, and steadfast love—from the nation."
    },
    {
      "pk": 241606,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 6,
      "text": "\"Both the great and the small shall die in this land. They shall not be buried, nor shall men lament for them, nor shall anyone cut himself or shave his head for them.\"",
      "links": "<a href='/AIV/24/7/29'>Jer. 7:29</a>; <a href='/AIV/3/21/5'>Lev. 21:5</a>",
      "comment": "Traditional mourning rituals are abandoned. This separation from ritual burial and grief shows the radical spiritual consequences of national sin."
    },
    {
      "pk": 241607,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 7,
      "text": "\"No one shall break bread for the mourner, to comfort him for the dead, nor give him the cup of consolation for his father or his mother.\"",
      "links": "<a href='/AIV/24/9/17'>Jer. 9:17</a>; <a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "Refers to customary acts of comfort offered after a bereavement—ritual meals and consolation. Their absence reflects deep communal loss and the breakdown of covenant life."
    },
    {
      "pk": 241608,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 8,
      "text": "\"Do not go into the house of feasting to sit with them, to eat and drink.\"",
      "links": "<a href='/AIV/24/15/17'>Jer. 15:17</a>",
      "comment": "Jeremiah must distance himself even from celebratory gatherings—a complete prophetic separation from the people, indicative of their spiritual state."
    },
    {
      "pk": 241609,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 9,
      "text": "For this is what the Lord of hosts, the God of Israel, says: \"I am about to remove from this place, before your eyes and in your days, the voice of joy and gladness, the voice of the bridegroom and the bride.\"",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/24/25/10'>Jer. 25:10</a>; <a href='/AIV/19/137/6'>Ps. 137:6</a>",
      "comment": "The removal of all joy and celebration signals a complete end to God's blessings and the communal life, reminding us of both literal and spiritual consequences for rebellion against the Lord."
    },
    {
      "pk": 241610,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 10,
      "text": "When you tell this people all these words and they ask you, 'Why has the Lord pronounced all this great evil against us? What is our wrongdoing, what is our sin that we have committed against the Lord our God?'",
      "links": "<a href='/AIV/24/5/19'>Jer. 5:19</a>; <a href='/AIV/27/9/5'>Dan. 9:5'</a>",
      "comment": "The people's tendency to self-justify while missing their own sin is highlighted. This rhetorical question anticipates the prophetic response about the cause of judgment."
    },
    {
      "pk": 241611,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 11,
      "text": "You shall answer them: 'Because your fathers forsook Me,' declares the Lord, 'and they went after other gods and served them and worshiped them. They forsook Me and did not keep My law.'",
      "links": "<a href='/AIV/24/11/10'>Jer. 11:10</a>; <a href='/AIV/24/7/24-26'>Jer. 7:24-26</a>; <a href='/AIV/5/29/25'>Deut. 29:25'</a>",
      "comment": "The generational nature of sin and its consequences is emphasized—a theme foundational to understanding the continuity and tradition of faith communities."
    },
    {
      "pk": 241612,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 12,
      "text": "'And you have done even worse than your fathers, for each one follows his stubborn, evil heart, not listening to Me.'",
      "links": "<a href='/AIV/24/7/26'>Jer. 7:26</a>; <a href='/AIV/24/3/17'>Jer. 3:17</a>",
      "comment": "Jeremiah points out the escalating rebellion—spiritual decline across generations. The text encourages us to reflect not just on inherited faith, but personal faithful obedience and submission."
    },
    {
      "pk": 241613,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 13,
      "text": "\"So I will throw you out of this land into a land neither you nor your fathers have known, and there you will serve other gods day and night, for I will show you no favor.\"",
      "links": "<a href='/AIV/24/15/14'>Jer. 15:14</a>; <a href='/AIV/5/28/36'>Deut. 28:36</a>",
      "comment": "Exile is the punishment for persistent sin. The absence of God's favor underscores the importance of remaining in covenant with Him for both spiritual and temporal blessings."
    },
    {
      "pk": 241614,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 14,
      "text": "\"Yet, the days are coming,\" declares the Lord, \"when it will no longer be said, 'As the Lord lives who brought up the children of Israel out of the land of Egypt,'\"",
      "links": "<a href='/AIV/24/23/7-8'>Jer. 23:7-8</a>; <a href='/AIV/2/12/41'>Ex. 12:41</a>",
      "comment": "A messianic promise—future redemption will surpass the Exodus. This anticipates a new covenant and spiritual renewal often interpreted as finding fulfillment in Christ’s redemptive work."
    },
    {
      "pk": 241615,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 15,
      "text": "\"but, 'As the Lord lives who brought up the children of Israel out of the land of the north and out of all the countries where He had driven them.' For I will bring them back to their land that I gave to their fathers.\"",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/24/3/18'>Jer. 3:18</a>; <a href='/AIV/1/12/1'>Gen. 12:1'</a>",
      "comment": "A prophecy of restoration—God’s faithfulness to His promises despite judgment. Echoes the hope and assurance of God's eternal covenant, prefiguring ultimate reconciliation through Christ."
    },
    {
      "pk": 241616,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 16,
      "text": "\"Behold, I am sending for many fishermen,\" declares the Lord, \"and they shall fish for them. Afterward I will send many hunters, and they shall hunt them from every mountain and every hill, and out of the clefts of the rocks.\"",
      "links": "<a href='/AIV/26/29/4'>Ezek. 29:4'</a>; <a href='/AIV/40/4/19'>Matt. 4:19</a>",
      "comment": "Imagery of fishermen and hunters evoke gathering and judgment. These terms are echoed in Jesus' call to be 'fishers of men,' linking the prophecy to Christ’s mission to seek and restore the lost."
    },
    {
      "pk": 241617,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 17,
      "text": "\"For My eyes are on all their ways; they are not hidden from My face, nor is their guilt concealed from My eyes.\"",
      "links": "<a href='/AIV/19/139/1-3'>Ps. 139:1-3</a>; <a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "Affirms God’s omniscience—nothing escapes His sight. Spiritually, this encourages self-examination and repentance."
    },
    {
      "pk": 241618,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 18,
      "text": "\"First I will doubly repay their iniquity and their sin, because they have polluted My land with carcasses of their detestable idols, and have filled My inheritance with their abominations.\"",
      "links": "<a href='/AIV/24/17/4'>Jer. 17:4</a>; <a href='/AIV/26/36/18'>Ezek. 36:18</a>",
      "comment": "Divine recompense for idolatry. The phrase 'doubly repay' signals both severity and justice, emphasizing the holiness of God and the consequences of grave sin."
    },
    {
      "pk": 241619,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 19,
      "text": "O Lord, my strength and my fortress, my refuge in the day of distress, to You nations will come from the ends of the earth and say, \"Our fathers inherited only lies, worthless idols that did not profit them.\"",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/24/3/17'>Jer. 3:17</a>; <a href='/AIV/45/15/8-12'>Rom. 15:8-12</a>",
      "comment": "Jeremiah’s prayer expressing both personal trust and a prophetic vision of the nations turning to the true God. Christologically, foreshadows the inclusion of Gentiles in salvation (see Rom. 15:8–12)."
    },
    {
      "pk": 241620,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 20,
      "text": "\"Can a man make gods for himself? They are not gods!\"",
      "links": "<a href='/AIV/24/10/3-5'>Jer. 10:3-5</a>; <a href='/AIV/23/44/9-10'>Isa. 44:9-10</a>",
      "comment": "A polemic against idolatry. Reinforces the unique power and reality of God, reminding us of the call to wholehearted worship and the dangers of substituting human inventions for divine truth."
    },
    {
      "pk": 241621,
      "translation": "AIV",
      "book": 24,
      "chapter": 16,
      "verse": 21,
      "text": "\"Therefore, behold, I will cause them to know—this time I will make them know My hand and My might; and they shall know that My name is the Lord.\"",
      "links": "<a href='/AIV/2/6/7'>Ex. 6:7</a>; <a href='/AIV/24/31/34'>Jer. 31:34</a>",
      "comment": "Promise of decisive revelation—God will reveal Himself in power and restore true knowledge of His name among all peoples. This points to the fullness of God's self-revelation in salvation history, culminating in the coming of Christ."
    }
  ],
  "translatedAt": "2025-12-23T06:22:35.197Z"
}