{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 35,
  "verses": [
    {
      "pk": 243501,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 1,
      "text": "The word that came to Jeremiah from Yahweh in the days of Jehoiakim son of Josiah, king of Judah:",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>; <a href='/AIV/12/23/36'>2 Kings 23:36</a>",
      "comment": "Jeremiah often receives direct revelation from God (Yahweh), marking another moment of divine instruction within a historical period. The connection to Jehoiakim roots this in a real time in Judah's history."
    },
    {
      "pk": 243502,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 2,
      "text": "'Go to the house of the Rechabites and speak with them. Bring them into the house of Yahweh, into one of the chambers, and offer them wine to drink.'",
      "links": "<a href='/AIV/13/2/55'>1 Chron. 2:55</a>; <a href='/AIV/24/35/3'>Jer. 35:3</a>",
      "comment": "The Rechabite family is singled out for a test of obedience. Their presence in the temple chamber highlights ritual purity and the significance of temple worship."
    },
    {
      "pk": 243503,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 3,
      "text": "So I took Jaazaniah son of Jeremiah, son of Habazziniah, his brothers, and all his sons—the entire family of the Rechabites—and brought them into the house of Yahweh,",
      "links": "<a href='/AIV/24/35/4'>Jer. 35:4</a>",
      "comment": "Specific names reinforce the real identity and heritage of the Rechabites. Their entry together into the temple amplifies the importance of communal faith and fidelity."
    },
    {
      "pk": 243504,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 4,
      "text": "and I brought them into the chamber of the sons of Hanan, son of Igdaliah, the man of God, which was beside the chamber of the officials, above the chamber of Maaseiah son of Shallum, the keeper of the threshold.",
      "links": "<a href='/AIV/24/36/10'>Jer. 36:10</a>; <a href='/AIV/26/8/16'>Ezek. 8:16</a>",
      "comment": "Details about the temple chambers underscore the careful arrangement and order in worship life. The 'man of God' title is a sign of prophetic authority, hinting at holy continuity."
    },
    {
      "pk": 243505,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 5,
      "text": "Then I set before the sons of the house of the Rechabites bowls full of wine and cups, and I said to them, 'Drink wine.'",
      "links": "<a href='/AIV/24/35/2'>Jer. 35:2</a>",
      "comment": "This is the pivotal moment of testing obedience. Compare to Daniel's refusal to defile himself (Daniel 1:8), prefiguring steadfastness in faith and tradition."
    },
    {
      "pk": 243506,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 6,
      "text": "But they replied, 'We will not drink wine, for Jonadab son of Rechab, our ancestor, commanded us: “You shall not drink wine, you or your sons, forever.”'",
      "links": "<a href='/AIV/12/10/15'>2 Kings 10:15–23</a>",
      "comment": "Their obedience to forefather Jonadab’s command shows reverence for the traditions passed down, much as later generations preserve apostolic teachings (see 2 Thessalonians 2:15)."
    },
    {
      "pk": 243507,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 7,
      "text": "'You shall not build a house or sow seed or plant a vineyard, nor shall you own any. Instead, you shall live in tents all your lives, that you may live many days in the land where you reside as sojourners.'",
      "links": "<a href='/AIV/03/25/23'>Lev. 25:23</a>; <a href='/AIV/58/11/13'>Heb. 11:13'</a>",
      "comment": "The pattern of being sojourners recalls the faith of Abraham (Hebrews 11:13), modeling detachment from worldly concerns for the sake of higher fidelity."
    },
    {
      "pk": 243508,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 8,
      "text": "We have obeyed the voice of Jonadab son of Rechab, our ancestor, in all that he commanded us: to neither drink wine all our days, we, our wives, our sons, or our daughters,",
      "links": "<a href='/AIV/24/35/6'>Jer. 35:6</a>",
      "comment": "Their obedience is multi-generational, a sign of faithfulness akin to the New Testament call to uphold apostolic traditions."
    },
    {
      "pk": 243509,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 9,
      "text": "nor to build houses to live in, or have vineyard or field or seed.",
      "links": "<a href='/AIV/24/35/7'>Jer. 35:7</a>",
      "comment": "This renunciation of permanent settlement for the sake of keeping tradition demonstrates an ascetic discipline reminiscent of later communities devoted to vows."
    },
    {
      "pk": 243510,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 10,
      "text": "We have lived in tents and have obeyed and done all that Jonadab our ancestor commanded us.",
      "links": "<a href='/AIV/58/11/13'>Heb. 11:13</a>",
      "comment": "Living in tents symbolizes spiritual pilgrimage and separation from the world; an ongoing theme in both Testaments."
    },
    {
      "pk": 243511,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 11,
      "text": "But when Nebuchadnezzar king of Babylon came up against the land, we said, 'Come, let us go to Jerusalem to escape the army of the Chaldeans and the army of Aram.' So we have been living in Jerusalem.",
      "links": "<a href='/AIV/24/25/1'>Jer. 25:1</a>; <a href='/AIV/24/34/21'>Jer. 34:21</a>",
      "comment": "Historical context of Babylonian siege explains their migration. Even the most faithful must on occasion seek refuge for survival, which points toward the role of the people of God as a sanctuary."
    },
    {
      "pk": 243512,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 12,
      "text": "Then the word of Yahweh came to Jeremiah:",
      "links": "<a href='/AIV/24/35/1'>Jer. 35:1</a>",
      "comment": "A second oracle confirms God’s engagement and response to the situation."
    },
    {
      "pk": 243513,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 13,
      "text": "'Thus says Yahweh of hosts, the God of Israel: Go and say to the men of Judah and the inhabitants of Jerusalem, “Will you not receive instruction and listen to my words?” declares Yahweh.",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>; <a href='/AIV/24/32/33'>Jer. 32:33</a>",
      "comment": "God rebukes Israel for failing to heed instruction. This contrast amplifies the virtue of obedience. See also the way Jesus upholds obedience in John 14:15."
    },
    {
      "pk": 243514,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 14,
      "text": "'The commandment that Jonadab son of Rechab gave to his descendants—to not drink wine—they have obeyed, even to this day. But I have spoken to you persistently, and you have not obeyed me.'",
      "links": "<a href='/AIV/24/26/5'>Jer. 26:5</a>; <a href='/AIV/24/29/19'>Jer. 29:19</a>",
      "comment": "Obedience is praised when tradition is sustained without fail. God emphasizes the gravity of disobedience through this illustration."
    },
    {
      "pk": 243515,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 15,
      "text": "'I have sent to you all my servants the prophets, sending them persistently, saying, “Turn every one of you from your evil way, and amend your actions, and do not go after other gods to serve them. Then you shall dwell in the land that I gave to you and to your fathers.” But you did not incline your ear or listen to me.'",
      "links": "<a href='/AIV/24/7/25-26'>Jer. 7:25–26</a>; <a href='/AIV/24/25/5'>Jer. 25:5</a>",
      "comment": "God’s persistence through prophets calls to mind the patience and loving correction found in the ministry of Jesus and the apostles. Obedience is always connected to inheritance and blessing."
    },
    {
      "pk": 243516,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 16,
      "text": "'Because the descendants of Jonadab son of Rechab have obeyed the commandment that their ancestor gave them, but this people has not obeyed me,'",
      "links": "<a href='/AIV/24/35/14'>Jer. 35:14</a>",
      "comment": "The Rechabites' faithfulness stands in contrast to Israel's neglect, pointing toward the blessings of spiritual discipline and continuity in tradition."
    },
    {
      "pk": 243517,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 17,
      "text": "Therefore thus says Yahweh, the God of hosts, the God of Israel: 'Behold, I am bringing upon Judah and all the inhabitants of Jerusalem all the disaster that I have spoken against them, because I spoke to them but they did not listen, and I called to them but they did not answer.'",
      "links": "<a href='/AIV/24/19/15'>Jer. 19:15</a>; <a href='/AIV/24/7/13'>Jer. 7:13</a>",
      "comment": "This is divine judgment due to chronic disobedience. God's justice is always proportionate and just, echoing warnings and punishments foretold through prophets."
    },
    {
      "pk": 243518,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 18,
      "text": "But to the house of the Rechabites, Jeremiah said, 'Thus says Yahweh of hosts, the God of Israel: Because you have obeyed the command of Jonadab your ancestor and kept all his commandments, doing all that he commanded you,'",
      "links": "<a href='/AIV/24/35/14'>Jer. 35:14</a>",
      "comment": "Blessings are guaranteed for those who heed ancestral command faithfully. This connection between fidelity and lasting grace establishes the importance of tradition handed down unbroken."
    },
    {
      "pk": 243519,
      "translation": "AIV",
      "book": 24,
      "chapter": 35,
      "verse": 19,
      "text": "therefore thus says Yahweh of hosts, the God of Israel: 'Jonadab son of Rechab shall never lack a descendant to stand before me forever.'",
      "links": "<a href='/AIV/24/15/19'>Jer. 15:19</a>; <a href='/AIV/19/101/6'>Ps. 101:6</a>",
      "comment": "God rewards continuity and obedience with an eternal promise—'to stand before me forever.' This foreshadows New Testament teachings about perseverance and unbroken faith (Revelation 3:12). It also subtly points to the value of living tradition, stewardship, and communal inheritance that is central to Christian faith."
    }
  ],
  "translatedAt": "2025-12-23T06:33:15.621Z"
}