{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 29,
  "verses": [
    {
      "pk": 2429001,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 1,
      "text": "These are the words of the letter that Jeremiah the prophet sent from Jerusalem to the elders who remained among the exiles, to the priests, the prophets, and all the people, whom Nebuchadnezzar had taken into exile from Jerusalem to Babylon.",
      "links": "<a href='/AIV/24/24/1'>Jer. 24:1</a>; <a href='/AIV/12/24/14'>2 Kings 24:14</a>",
      "comment": "This introduction makes clear Jeremiah's audience: the exiles in Babylon. The letter is prophetic guidance to uphold true faith amid foreign land, paralleling later epistles (cf. <a href='/AIV/60/1/1'>1 Peter 1:1</a>)."
    },
    {
      "pk": 2429002,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 2,
      "text": "This was after King Jeconiah, the queen mother, the officials of Judah and Jerusalem, the craftsmen, and the metal workers had departed from Jerusalem.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15-16</a>; <a href='/AIV/24/27/20'>Jer. 27:20</a>",
      "comment": "This highlights the thoroughness of the exile, even including skilled laborers, emphasizing the depth of Israel’s trial."
    },
    {
      "pk": 2429003,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 3,
      "text": "The letter was sent by the hand of Elasah the son of Shaphan and Gemariah the son of Hilkiah, whom Zedekiah king of Judah sent to Babylon to Nebuchadnezzar king of Babylon. It said:",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>; <a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Jeremiah uses official emissaries, connecting to lawful authority. Shaphan and Hilkiah are important in Josiah's reforms (see <a href='/AIV/12/22/8'>2 Kings 22:8</a>)."
    },
    {
      "pk": 2429004,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 4,
      "text": "Thus says the LORD of Armies, the God of Israel, to all the exiles whom I have sent into exile from Jerusalem to Babylon:",
      "links": "<a href='/AIV/24/27/19'>Jer. 27:19</a>; <a href='/AIV/24/21/8'>Jer. 21:8-10</a>",
      "comment": "God is sovereign even in judgment; the exile is divinely permitted. Parallels in later themes of pilgrimage and obedience."
    },
    {
      "pk": 2429005,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 5,
      "text": "\"Build houses and live in them; plant gardens and eat their fruit.",
      "links": "<a href='/AIV/24/42/10'>Jer. 42:10</a>; <a href='/AIV/01/41/52'>Gen. 41:52</a>",
      "comment": "God instructs the people to settle and thrive in exile, not resist. Echoes themes of hope and obedience even in trial."
    },
    {
      "pk": 2429006,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 6,
      "text": "Take wives and have sons and daughters; take wives for your sons, and give your daughters in marriage, that they may bear sons and daughters; multiply there and do not decrease.",
      "links": "<a href='/AIV/01/01/28'>Gen. 1:28</a>; <a href='/AIV/24/29/28'>Jer. 29:28</a>",
      "comment": "God reaffirms His blessing to be fruitful and multiply (Genesis 1:28). Preservation of the faithful remnant is assured."
    },
    {
      "pk": 2429007,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 7,
      "text": "Seek the welfare of the city where I have sent you into exile, and pray to the LORD for it, for in its welfare you will find your welfare.",
      "links": "<a href='/AIV/26/11/16'>Ezek. 11:16</a>; <a href='/AIV/54/2/1-2'>1 Tim. 2:1–2</a>",
      "comment": "Instruction to pray for secular rulers evokes Christian endurance and witness. This verse underpins the legitimacy of prayer for all authorities (<a href='/AIV/54/2/1-2'>1 Tim. 2:1–2</a>)."
    },
    {
      "pk": 2429008,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 8,
      "text": "For thus says the LORD of Armies, the God of Israel: Do not let your prophets and your diviners among you deceive you, and do not listen to the dreams that they dream,",
      "links": "<a href='/AIV/05/13/1-3'>Deut. 13:1–3</a>; <a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "A warning against false prophecy, emphasizing discernment over private or subjective revelations. Authority is through what is revealed by God."
    },
    {
      "pk": 2429009,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 9,
      "text": "for they are prophesying falsely to you in my name; I did not send them, declares the LORD.",
      "links": "<a href='/AIV/24/14/14'>Jer. 14:14</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "God claims sole authority to appoint prophets. Compare Christ's warning about false prophets (<a href='/AIV/40/24/24'>Matt. 24:24</a>)."
    },
    {
      "pk": 2429010,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 10,
      "text": "For thus says the LORD: When seventy years are completed for Babylon, I will visit you, and I will fulfill my promise to you and bring you back to this place.",
      "links": "<a href='/AIV/24/25/11-12'>Jer. 25:11–12</a>; <a href='/AIV/27/9/2'>Dan. 9:2</a>",
      "comment": "The seventy years is a specific prophecy fulfilled under Cyrus of Persia (Ezra 1:1–3). Reminds us God keeps His promises."
    },
    {
      "pk": 2429011,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 11,
      "text": "For I know the plans I have for you, declares the LORD, plans for peace and not for evil, to give you a future and a hope.",
      "links": "<a href='/AIV/24/31/17'>Jer. 31:17</a>",
      "comment": "This well-known verse assures God's goodness, even in chastisement. Ultimately fulfilled in Christ, who brings hope to God's people."
    },
    {
      "pk": 2429012,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 12,
      "text": "Then you will call upon me and come and pray to me, and I will listen to you.",
      "links": "<a href='/AIV/24/33/3'>Jer. 33:3</a>; <a href='/AIV/19/145/18'>Psalm 145:18</a>",
      "comment": "Access to God in prayer is emphasized. There is a promise of restored relationship based not just on location, but true worship."
    },
    {
      "pk": 2429013,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 13,
      "text": "You will seek me and find me when you search for me with all your heart.",
      "links": "<a href='/AIV/05/04/29'>Deut. 4:29</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "God promises to be found by those who seek wholeheartedly. Righteousness flows from a sincere heart."
    },
    {
      "pk": 2429014,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 14,
      "text": "I will be found by you, declares the LORD, and I will restore your fortunes and gather you from all the nations and all the places where I have driven you, declares the LORD, and I will bring you back to the place from which I sent you into exile.",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/05/30/3'>Deut. 30:3</a>",
      "comment": "God's promise to regather His people prefigures the unity of His people from all nations, fulfilled spiritually in Christ’s Church (see <a href='/AIV/43/11/52'>John 11:52</a>)."
    },
    {
      "pk": 2429015,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 15,
      "text": "Because you have said, ‘The LORD has raised up prophets for us in Babylon,’",
      "links": "<a href='/AIV/24/28/1'>Jer. 28:1–4</a>",
      "comment": "The exiles had believed rumors of a quick return. Jeremiah corrects their false hopes."
    },
    {
      "pk": 2429016,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 16,
      "text": "thus says the LORD concerning the king who sits on the throne of David, and concerning all the people who dwell in this city, your brothers who did not go out with you into exile:",
      "links": "<a href='/AIV/24/22/2-3'>Jer. 22:2–3</a>",
      "comment": "Reference to the Davidic monarchy shows hope is still in God’s promises. Even in trial, the line of David remains significant (see <a href='/AIV/40/1/1'>Matt. 1:1</a>)."
    },
    {
      "pk": 2429017,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 17,
      "text": "Thus says the LORD of Armies: Behold, I am sending on them sword, famine, and pestilence, and I will make them like rotten figs that cannot be eaten, they are so bad.",
      "links": "<a href='/AIV/24/24/2-10'>Jer. 24:2–10</a>",
      "comment": "The bad figs symbolize those remaining in rebellion. Echoes previous allegories distinguishing the faithful from the unfaithful."
    },
    {
      "pk": 2429018,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 18,
      "text": "I will pursue them with the sword, with famine, and with pestilence, and will make them a horror to all the kingdoms of the earth, to be a curse, a terror, a hissing, and a reproach among all the nations where I have driven them,",
      "links": "<a href='/AIV/24/15/4'>Jer. 15:4</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "Just consequences for covenant unfaithfulness. Describes the seriousness of rejecting God’s word."
    },
    {
      "pk": 2429019,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 19,
      "text": "because they did not listen to my words, declares the LORD, when I persistently sent to them my servants the prophets, but they would not listen, declares the LORD.",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "Rejection of the prophetic voice is a recurring theme. Jesus later mourns Jerusalem for this same reason."
    },
    {
      "pk": 2429020,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 20,
      "text": "Hear the word of the LORD, all you exiles whom I sent away from Jerusalem to Babylon.",
      "links": "<a href='/AIV/24/21/8'>Jer. 21:8-10</a>",
      "comment": "God again asserts His authority as the sender of the exiles. Obedience in exile is God’s will, not resistance."
    },
    {
      "pk": 2429021,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 21,
      "text": "Thus says the LORD of Armies, the God of Israel, concerning Ahab the son of Kolaiah and Zedekiah the son of Maaseiah, who are prophesying a lie to you in my name: Behold, I will give them into the hand of Nebuchadnezzar king of Babylon, and he shall put them to death before your eyes.",
      "links": "<a href='/AIV/24/28/15-17'>Jer. 28:15-17</a>",
      "comment": "Public judgment of false prophets signals the importance of truth and accountability in the faith community."
    },
    {
      "pk": 2429022,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 22,
      "text": "And because of them this curse shall be used by all the exiles from Judah in Babylon: 'The LORD make you like Zedekiah and Ahab, whom the king of Babylon roasted in the fire,'",
      "links": "<a href='/AIV/27/3/6'>Dan. 3:6</a>",
      "comment": "The severity of the punishment becomes proverbial; compare the fate of Shadrach, Meshach, and Abednego, who were instead preserved for their faithfulness."
    },
    {
      "pk": 2429023,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 23,
      "text": "because they have done an outrageous thing in Israel, they have committed adultery with their neighbors’ wives, and have spoken in my name lying words that I did not command them. I am the one who knows and am witness, declares the LORD.",
      "links": "<a href='/AIV/24/23/14'>Jer. 23:14</a>",
      "comment": "Personal sin combines with religious deception, recalling the necessity for holiness in God’s leaders."
    },
    {
      "pk": 2429024,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 24,
      "text": "To Shemaiah of Nehelam you shall say:",
      "links": "",
      "comment": "Transition to a specific message for Shemaiah, another pseudo-prophet."
    },
    {
      "pk": 2429025,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 25,
      "text": "Thus says the LORD of Armies, the God of Israel: Because you have sent letters in your own name to all the people in Jerusalem, to Zephaniah the son of Maaseiah the priest, and to all the priests, saying,",
      "links": "<a href='/AIV/24/21/1'>Jer. 21:1-2</a>; <a href='/AIV/24/37/3'>Jer. 37:3</a>",
      "comment": "Shemaiah’s self-appointed authority is condemned, contrasting with divinely ordained authority and offices."
    },
    {
      "pk": 2429026,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 26,
      "text": "\"The LORD has made you priest instead of Jehoiada the priest, to have charge in the house of the LORD, over every madman who prophesies, to put him in the stocks and neck irons.",
      "links": "<a href='/AIV/24/20/2'>Jer. 20:2</a>",
      "comment": "False priestly succession is suggested, showing the importance of legitimate succession and discipline."
    },
    {
      "pk": 2429027,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 27,
      "text": "Now why have you not rebuked Jeremiah of Anathoth who prophesies to you?",
      "links": "<a href='/AIV/24/37/13-14'>Jer. 37:13-14</a>",
      "comment": "Shemaiah demands action against Jeremiah, reflecting ongoing opposition to true prophecy."
    },
    {
      "pk": 2429028,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 28,
      "text": "For he has sent to us in Babylon, saying, 'Your exile will be long; build houses and live in them, and plant gardens and eat their fruit.'\"",
      "links": "<a href='/AIV/24/29/5'>Jer. 29:5</a>",
      "comment": "Jeremiah’s message is repeated: settle in, the trial will not be brief. Parallels the patience and endurance expected of God’s people throughout history."
    },
    {
      "pk": 2429029,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 29,
      "text": "Zephaniah the priest read this letter in the hearing of Jeremiah the prophet.",
      "links": "",
      "comment": "Priests and prophets interact as discrete authorities: showing the importance and tension of legitimate prophetic and priestly leadership."
    },
    {
      "pk": 2429030,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 30,
      "text": "Then the word of the LORD came to Jeremiah:",
      "links": "",
      "comment": "Jeremiah’s authority is vindicated by direct revelation from God."
    },
    {
      "pk": 2429031,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 31,
      "text": "\"Send a message to all the exiles, saying, 'Thus says the LORD concerning Shemaiah of Nehelam: Because Shemaiah has prophesied to you though I did not send him, and has made you trust in a lie,",
      "links": "",
      "comment": "God rebukes misleading authority—true prophecy only comes from those genuinely sent."
    },
    {
      "pk": 2429032,
      "translation": "AIV",
      "book": 24,
      "chapter": 29,
      "verse": 32,
      "text": "therefore thus says the LORD: Behold, I will punish Shemaiah of Nehelam and his descendants. He shall not have anyone living among this people, and he shall not see the good that I will do to my people, declares the LORD, because he has spoken rebellion against the LORD.'\"",
      "links": "<a href='/AIV/24/23/34'>Jer. 23:34</a>",
      "comment": "God’s judgment falls on false mediators. Contrast with the enduring promise to the faithful remnant who await the true Shepherd—a foreshadowing of Christ’s singular authority."
    }
  ],
  "translatedAt": "2025-12-23T06:30:01.173Z"
}