{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 46,
  "verses": [
    {
      "pk": 30046001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 1,
      "text": "The word of the Lord that came to Jeremiah the prophet concerning the nations:",
      "links": "<a href='/AIV/24/1/5'>Jeremiah 1:5</a>; <a href='/AIV/24/25/15'>Jeremiah 25:15</a>",
      "comment": "This introduction marks a new section focused on prophecies about foreign nations. Jeremiah is emphasized as God’s chosen instrument, a reminder of God’s sovereign ability to speak to and judge all peoples, not just Israel."
    },
    {
      "pk": 30046002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 2,
      "text": "About Egypt. Concerning the army of Pharaoh Neco, king of Egypt, who was by the river Euphrates at Carchemish, which Nebuchadnezzar king of Babylon defeated in the fourth year of Jehoiakim the son of Josiah, king of Judah:",
      "links": "<a href='/AIV/12/23/29'>2 Kings 23:29</a>; <a href='/AIV/24/25/1'>Jeremiah 25:1</a>",
      "comment": "Sets the historical context. The defeat at Carchemish (605 BC) was pivotal, signaling the end of Egypt’s dominance and the rise of Babylon. This connects to God’s guidance of history, fulfilling His word through Jeremiah."
    },
    {
      "pk": 30046003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 3,
      "text": "\"Prepare shield and buckler, and draw near for battle!",
      "links": "<a href='/AIV/24/46/9'>Jeremiah 46:9</a>; <a href='/AIV/23/21/5'>Isaiah 21:5</a>",
      "comment": "A call to arms for Egypt, but with irony—God knows their effort will fail. The Lord’s sovereignty over nations’ destiny is highlighted."
    },
    {
      "pk": 30046004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 4,
      "text": "\"Harness the horses and mount the chariots! Take your positions with helmets on. Polish your spears, put on armor!",
      "links": "<a href='/AIV/02/14/9'>Exodus 14:9</a>",
      "comment": "Egypt's famed military is instructed to prepare, but their trust in military strength will not save them—a reminder to rely on God, not worldly power."
    },
    {
      "pk": 30046005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 5,
      "text": "Why have I seen them terrified? They are turning back, their warriors are beaten down. They flee in haste, not looking back—terror on every side, declares the Lord.",
      "links": "<a href='/AIV/24/6/25'>Jeremiah 6:25</a>; <a href='/AIV/24/20/3'>Jeremiah 20:3</a>",
      "comment": "Military might fails before God's will. The phrase 'terror on every side' appears throughout Jeremiah, shaping a motif of judgment."
    },
    {
      "pk": 30046006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 6,
      "text": "The swift cannot flee away, nor the strong escape. In the north by the river Euphrates they stumble and fall.",
      "links": "<a href='/AIV/19/33/16-17'>Psalm 33:16-17</a>",
      "comment": "No one can escape God's judgment, regardless of strength—a common theme throughout Scripture (see Psalm 33). A warning against presumption in human greatness."
    },
    {
      "pk": 30046007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 7,
      "text": "Who is this rising like the Nile, like rivers whose waters surge?",
      "links": "<a href='/AIV/24/47/2'>Jeremiah 47:2</a>",
      "comment": "Egypt often depended on the Nile for strength and prosperity. The question contrasts Egypt’s self-perception with the reality of coming judgment."
    },
    {
      "pk": 30046008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 8,
      "text": "Egypt rises like the Nile, even like rivers whose waters surge. Egypt says, ‘I will rise, I will cover the earth, I will destroy cities and their inhabitants.’",
      "links": "<a href='/AIV/26/29/3'>Ezekiel 29:3</a>",
      "comment": "Egypt boasted in its power, yet God humbles the proud. This is a theme that Christ himself embodies in teaching humility (see Luke 14:11)."
    },
    {
      "pk": 30046009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 9,
      "text": "Advance, horses! Charge, chariots! Let the warriors go out—Cushites and Put, who handle the shield, and the Lydians, skilled with the bow.",
      "links": "<a href='/AIV/26/30/4-5'>Ezekiel 30:4-5</a>",
      "comment": "Egypt’s foreign mercenaries are mentioned, highlighting the futility of relying on alliances. True security is found in God’s guidance through His chosen people."
    },
    {
      "pk": 30046010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 10,
      "text": "That day belongs to the Lord GOD of Hosts, a day of vengeance, to avenge Himself on His foes. The sword will devour and be satisfied, it will drink its fill of their blood. For the Lord GOD of Hosts holds a sacrifice in the north country by the river Euphrates.",
      "links": "<a href='/AIV/23/34/6'>Isaiah 34:6</a>; <a href='/AIV/66/19/15'>Revelation 19:15</a>",
      "comment": "The imagery of sacrifice and vengeance connects judgment with atonement themes, pointing ultimately to Christ’s work on the cross, where justice and mercy meet."
    },
    {
      "pk": 30046011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 11,
      "text": "Go up to Gilead, and get balm, O virgin daughter of Egypt! In vain you will use many medicines; there is no healing for you.",
      "links": "<a href='/AIV/24/8/22'>Jeremiah 8:22</a>",
      "comment": "Recalls the famous ‘balm of Gilead’—earthly remedies cannot cure spiritual rebellion. True healing comes from God’s redemptive work."
    },
    {
      "pk": 30046012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 12,
      "text": "The nations have heard of your shame; your cry fills the earth. For warrior stumbles against warrior, both fall together.",
      "links": "<a href='/AIV/24/46/6'>Jeremiah 46:6</a>",
      "comment": "The effects of defeat become public and global. Like Israel’s discipline, this points to the need for humility and repentance."
    },
    {
      "pk": 30046013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 13,
      "text": "The word that the Lord spoke to Jeremiah the prophet about Babylon's coming to strike the land of Egypt:",
      "links": "<a href='/AIV/24/43/10'>Jeremiah 43:10</a>",
      "comment": "New oracle—Babylon’s attack on Egypt is prophesied. God’s sovereignty extends over Gentile nations, laying the groundwork for the inclusion of all peoples in salvation history."
    },
    {
      "pk": 30046014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 14,
      "text": "\"Declare in Egypt, proclaim in Migdol, proclaim in Memphis and Tahpanhes; say, 'Stand firm and be ready, for the sword devours all around you!'",
      "links": "<a href='/AIV/24/2/16'>Jeremiah 2:16</a>",
      "comment": "Listing various Egyptian cities underlines the totality of the coming judgment. God’s word reaches every place, encouraging a universal understanding of His authority."
    },
    {
      "pk": 30046015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 15,
      "text": "Why are your mighty ones swept away? They did not stand because the Lord drove them away.",
      "links": "<a href='/AIV/02/14/27-28'>Exodus 14:27-28</a>",
      "comment": "Even the greatest warriors fall before God’s will, echoing His past interventions (see Exodus). God is truly king over all powers."
    },
    {
      "pk": 30046016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 16,
      "text": "He made many stumble; indeed, one fell upon another. And they said, 'Arise, let us go back to our own people and to our homeland, away from the sword of the oppressor.'",
      "links": "<a href='/AIV/24/50/16'>Jeremiah 50:16</a>",
      "comment": "Panic and disarray mark God’s enemies. The phrase parallels the ultimate triumph of God’s chosen people over worldly powers."
    },
    {
      "pk": 30046017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 17,
      "text": "There they called Pharaoh king of Egypt, 'A noise; he has let the appointed time pass by.'",
      "links": "<a href='/AIV/24/37/7'>Jeremiah 37:7</a>",
      "comment": "Irony about Pharaoh’s reputation—he failed in his critical moment. A warning not to trust in earthly leaders but in God’s timing."
    },
    {
      "pk": 30046018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 18,
      "text": "\"As I live,\" declares the King, whose name is the Lord of Hosts, \"like Tabor among the mountains, like Carmel by the sea, so shall one come.",
      "links": "<a href='/AIV/07/4/6'>Judges 4:6</a>; <a href='/AIV/24/10/10'>Jeremiah 10:10</a>",
      "comment": "God swears by Himself, emphasizing His absolute authority. The grandeur of Tabor and Carmel symbolizes the certainty of His judgment."
    },
    {
      "pk": 30046019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 19,
      "text": "Prepare yourself baggage for exile, O daughter living in Egypt, for Memphis shall become a desolation, without inhabitant.",
      "links": "<a href='/AIV/24/44/12'>Jeremiah 44:12</a>; <a href='/AIV/24/48/18'>Jeremiah 48:18</a>",
      "comment": "Judgment leads to exile, a recurrent biblical theme. God’s people forced to trust in His mercy and plan in times of hardship."
    },
    {
      "pk": 30046020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 20,
      "text": "Egypt is a beautiful heifer, but a biting fly from the north is coming—it is coming!",
      "links": "<a href='/AIV/28/10/11'>Hosea 10:11</a>",
      "comment": "Egypt’s former beauty and pride will fall before the northern invader, a warning against pride and neglect of God’s sovereignty."
    },
    {
      "pk": 30046021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 21,
      "text": "Even her hired soldiers in her midst are like fattened calves; they too turn back and flee together, they do not stand, for the day of their calamity has come upon them, the time of their punishment.",
      "links": "<a href='/AIV/23/34/7'>Isaiah 34:7</a>",
      "comment": "Mercenaries, full of promise, fail when judgment comes. This underscores that earthly power, however strong, is fleeting apart from God."
    },
    {
      "pk": 30046022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 22,
      "text": "Her voice will hiss like a serpent as they march with an army and come against her with axes, like woodcutters.",
      "links": "<a href='/AIV/19/74/6'>Psalm 74:6</a>",
      "comment": "Imagery connects Egypt with the serpent—an undertone recalling Genesis 3 and motifs of spiritual opposition to God."
    },
    {
      "pk": 30046023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 23,
      "text": "They shall cut down her forest, says the Lord, though it cannot be searched, because they are more numerous than locusts; they are without number.",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Overwhelming judgment likened to a locust swarm—a favorite biblical image for inescapable destruction."
    },
    {
      "pk": 30046024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 24,
      "text": "The daughter of Egypt shall be put to shame; she shall be handed over to a people from the north.",
      "links": "<a href='/AIV/24/1/14'>Jeremiah 1:14</a>",
      "comment": "A reversal of fortunes. Egypt, once proud, will be overcome—judgment and redemption are recurring biblical ideas fulfilled supremely in Christ (see Romans 10:11)."
    },
    {
      "pk": 30046025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 25,
      "text": "The Lord of Hosts, the God of Israel, says: Behold, I am about to punish Amon of Thebes, Pharaoh, Egypt, her gods and her kings, Pharaoh and those who trust in him.",
      "links": "<a href='/AIV/26/30/13'>Ezekiel 30:13</a>",
      "comment": "God asserts His superiority over the false gods and rulers of Egypt. This anticipates the fulfillment of all history in God’s kingdom, with Christ as true King."
    },
    {
      "pk": 30046026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 26,
      "text": "I will deliver them into the hand of those who seek their lives, into the hand of Nebuchadnezzar king of Babylon and his servants. Afterward Egypt shall be inhabited as in the days of old, declares the Lord.",
      "links": "<a href='/AIV/24/43/11'>Jeremiah 43:11</a>",
      "comment": "God not only judges but promises restoration. Echoes God's continuous plan of mercy and justice throughout salvation history."
    },
    {
      "pk": 30046027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 27,
      "text": "\"But do not fear, Jacob my servant, nor be dismayed, O Israel; for behold, I will save you from afar, and your descendants from the land of their captivity. Jacob shall return and have quiet and ease, and no one shall make him afraid.",
      "links": "<a href='/AIV/24/30/10'>Jeremiah 30:10</a>; <a href='/AIV/26/39/25-28'>Ezekiel 39:25-28</a>",
      "comment": "Promise to God’s chosen remnant, showing He preserves His people for His purpose. Parallels with Christ’s promise of peace and return from exile—seen ultimately in the Church."
    },
    {
      "pk": 30046028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 46,
      "verse": 28,
      "text": "\"Do not be afraid, my servant Jacob,\" declares the Lord, \"for I am with you. I will make a full end of all the nations to which I have driven you, but of you I will not make a full end. I will discipline you with justice, not leave you unpunished.\"",
      "links": "<a href='/AIV/03/26/44'>Leviticus 26:44</a>; <a href='/AIV/24/30/11'>Jeremiah 30:11</a>",
      "comment": "Displays God’s justice and mercy together—discipline is not abandonment. God’s loving correction points forward to Christ, who fulfills both judgment and salvation (Hebrews 12:6)."
    }
  ],
  "translatedAt": "2025-12-24T08:46:46.383Z"
}