{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 30,
  "verses": [
    {
      "pk": 2430001,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD, saying:",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>; <a href='/AIV/24/7/1'>Jer. 7:1</a>",
      "comment": "This introductory phrase emphasizes the authority of the message as coming directly from God, reinforcing the prophetic authenticity that is essential throughout Jeremiah."
    },
    {
      "pk": 2430002,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 2,
      "text": "\"Thus says the LORD, the God of Israel: Write in a book all the words that I have spoken to you.\"",
      "links": "<a href='/AIV/24/36/2'>Jer. 36:2</a>; <a href='/AIV/26/43/11'>Ezek. 43:11</a>",
      "comment": "Writing down prophecy signifies its lasting importance and God's intention for it to be preserved and handed down, foreshadowing sacred tradition."
    },
    {
      "pk": 2430003,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 3,
      "text": "\"For behold, the days are coming, declares the LORD, when I will restore the fortunes of My people, Israel and Judah, says the LORD, and I will bring them back to the land that I gave to their fathers, and they shall possess it.\"",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/01/17/8'>Gen. 17:8</a>",
      "comment": "The restoration of Israel and Judah looks ahead not only to the post-exilic period but spiritually prefigures a greater restoration fulfilled in Christ."
    },
    {
      "pk": 2430004,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 4,
      "text": "These are the words that the LORD spoke concerning Israel and Judah:",
      "links": "<a href='/AIV/24/23/6'>Jer. 23:6</a>",
      "comment": "God addresses both Israel and Judah, signifying the unity and fullness of God's people, something later echoed in the New Testament church."
    },
    {
      "pk": 2430005,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 5,
      "text": "\"For thus says the LORD: We have heard a voice of trembling, of fear, and not of peace.\"",
      "links": "<a href='/AIV/24/6/24'>Jer. 6:24</a>",
      "comment": "The fear and trembling reflect the consequences of sin but also draw attention to the need for God's saving intervention."
    },
    {
      "pk": 2430006,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 6,
      "text": "\"Ask now, and see: Can a man bear a child? Why then do I see every man with his hands on his stomach like a woman in labor? Why has every face turned pale?\"",
      "links": "<a href='/AIV/24/4/31'>Jer. 4:31</a>",
      "comment": "A vivid image of trial; labor pains often symbolize anguish before a new birth, hinting at a coming deliverance—a common biblical motif."
    },
    {
      "pk": 2430007,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 7,
      "text": "\"Alas! That day is so great there is none like it. It is a time of distress for Jacob, but he shall be saved out of it.\"",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/24/30/10'>Jer. 30:10</a>",
      "comment": "Prophecy of a unique time of tribulation echoes apocalyptic language found later in Daniel, and Christ's teaching on tribulation. Salvation out of distress prefigures salvation in Christ."
    },
    {
      "pk": 2430008,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 8,
      "text": "\"And it shall happen in that day, declares the LORD of hosts, that I will break the yoke from off their neck, and I will burst their bonds. Strangers shall no longer make them serve.\"",
      "links": "<a href='/AIV/24/5/5'>Jer. 5:5</a>; <a href='/AIV/23/10/27'>Isa. 10:27</a>",
      "comment": "The breaking of the yoke signifies deliverance from oppression, seen both in physical and spiritual terms. Christ later fulfills this in freeing from sin and death."
    },
    {
      "pk": 2430009,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 9,
      "text": "\"But they shall serve the LORD their God and David their king, whom I will raise up for them.\"",
      "links": "<a href='/AIV/26/34/23'>Ezek. 34:23</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>",
      "comment": "Reference to 'David their king' is messianic, pointing to Christ as the fulfillment of the Davidic covenant and true King. Spiritual and literal meanings layer here (see Ezekiel 34:23-24)."
    },
    {
      "pk": 2430010,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 10,
      "text": "\"So do not be afraid, O My servant Jacob, declares the LORD, nor be dismayed, O Israel; for behold, I will save you from far away, and your offspring from the land of their captivity. Jacob shall return and shall be at rest and be quiet, and no one shall make him afraid.\"",
      "links": "<a href='/AIV/24/46/27'>Jer. 46:27</a>; <a href='/AIV/23/43/5'>Isa. 43:5</a>",
      "comment": "God reassures restoration and peace, which ultimately finds its spiritual completion in the peace Christ bestows (see John 14:27)."
    },
    {
      "pk": 2430011,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 11,
      "text": "\"For I am with you, declares the LORD, to save you; for I will make a full end of all the nations where I have scattered you, but I will not make a full end of you. I will discipline you in just measure, and will by no means leave you unpunished.\"",
      "links": "<a href='/AIV/24/46/28'>Jer. 46:28</a>; <a href='/AIV/23/27/7'>Isa. 27:7'>",
      "comment": "The promise of preservation through discipline, not destruction. God's mercy and justice are held together, reflecting themes in both law and gospel."
    },
    {
      "pk": 2430012,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 12,
      "text": "\"For thus says the LORD: Your hurt is incurable, and your wound is grievous.\"",
      "links": "<a href='/AIV/24/15/18'>Jer. 15:18</a>; <a href='/AIV/24/8/22'>Jer. 8:22</a>",
      "comment": "The dire human condition points to the need of a divine healer—a role Christ exemplifies in the New Testament."
    },
    {
      "pk": 2430013,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 13,
      "text": "\"There is no one to argue your cause; no remedy for your wound; no healing for you.\"",
      "links": "<a href='/AIV/24/8/22'>Jer. 8:22</a>; <a href='/AIV/28/5/13'>Hos. 5:13</a>",
      "comment": "Human inability to heal deep wounds shows the necessity of divine grace. Implies intercession—a role fulfilled by Christ and further reflected in believers’ prayers."
    },
    {
      "pk": 2430014,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 14,
      "text": "\"All your lovers have forgotten you; they do not seek you. For I have wounded you with the wound of an enemy, with the punishment of a cruel one, because your guilt is great and your sins are many.\"",
      "links": "<a href='/AIV/24/22/20'>Jer. 22:20</a>; <a href='/AIV/28/2/13'>Hos. 2:13</a>",
      "comment": "Israel’s alliances and idolatry bring consequences. This sets up the doctrine of repentance and returning to the one true God."
    },
    {
      "pk": 2430015,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 15,
      "text": "\"Why do you cry out over your hurt? Your pain is incurable because your guilt is great, because your sins are many; I have done these things to you.\"",
      "links": "<a href='/AIV/24/3/13'>Jer. 3:13</a>; <a href='/AIV/24/6/8'>Jer. 6:8</a>",
      "comment": "Sin's consequences are dire, but they pave the way for understanding grace, mercy, and forgiveness through repentance."
    },
    {
      "pk": 2430016,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 16,
      "text": "\"Therefore all who devour you shall be devoured, and all your adversaries—every one of them—shall go into captivity; those who plunder you shall be plundered, and all who prey on you I will make a prey.\"",
      "links": "<a href='/AIV/24/2/3'>Jer. 2:3</a>; <a href='/AIV/23/41/11'>Isa. 41:11</a>",
      "comment": "God's justice brings retribution to Israel’s foes, illustrating the reality that God vindicates His people—theme continued in Revelation."
    },
    {
      "pk": 2430017,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 17,
      "text": "\"For I will restore health to you, and I will heal your wounds, declares the LORD, because they have called you an outcast; ‘It is Zion, for whom no one cares.’\"",
      "links": "<a href='/AIV/24/33/6'>Jer. 33:6</a>; <a href='/AIV/23/31/12'>Isa. 31:12</a>",
      "comment": "God's promise to heal points ahead to Christ’s ministry of spiritual and physical healing—symbolic of mercy towards all who are outcast."
    },
    {
      "pk": 2430018,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 18,
      "text": "\"Thus says the LORD: Behold, I will restore the fortunes of the tents of Jacob and have compassion on his dwellings. The city shall be rebuilt on its mound, and the palace shall stand as it used to.\"",
      "links": "<a href='/AIV/24/33/7'>Jer. 33:7</a>; <a href='/AIV/23/60/10'>Isa. 60:10</a>",
      "comment": "Restoration language anticipates not just physical rebuilding but also spiritual renewal, echoed in the rebuilding of the temple and the heavenly Jerusalem."
    },
    {
      "pk": 2430019,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 19,
      "text": "\"Out of them shall come thanksgiving and the voice of those who make merry. I will multiply them, and they shall not be few; I will make them honored, and they shall not be small.\"",
      "links": "<a href='/AIV/24/33/11'>Jer. 33:11</a>; <a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "Joy and thanksgiving as marks of God’s restored people prefigure the worship and fellowship found in the one apostolic church."
    },
    {
      "pk": 2430020,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 20,
      "text": "\"Their children shall be as before, and their congregation shall be established before Me, and I will punish all who oppress them.\"",
      "links": "<a href='/AIV/24/23/4'>Jer. 23:4</a>; <a href='/AIV/19/89/4'>Ps. 89:4</a>",
      "comment": "Restoration of the people and their assembly points to a divinely constituted community, foreshadowing the establishment and protection of Christ's one church."
    },
    {
      "pk": 2430021,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 21,
      "text": "\"Their prince shall be one of themselves; their ruler shall come from their midst. I will bring him near, and he shall approach Me. For who would dare on his own to approach Me? declares the LORD.\"",
      "links": "<a href='/AIV/02/28/1'>Ex. 28:1</a>; <a href='/AIV/58/10/19-22'>Heb. 10:19–22</a>",
      "comment": "Only one who is appointed may approach God; reference to priestly mediation developed fully in Christ, our High Priest, and through ordained teaching authority."
    },
    {
      "pk": 2430022,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 22,
      "text": "\"And you shall be My people, and I will be your God.\"",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/03/26/12'>Lev. 26:12</a>",
      "comment": "The covenant formula appears here and is foundational for the concept of God's people in both Testaments—fulfilled spiritually in Christ and His church."
    },
    {
      "pk": 2430023,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 23,
      "text": "\"Behold, the storm of the LORD! Wrath goes forth, a sweeping tempest; it will burst upon the head of the wicked.\"",
      "links": "<a href='/AIV/24/23/19'>Jer. 23:19</a>; <a href='/AIV/19/11/6'>Ps. 11:6</a>",
      "comment": "God's judgment is certain and decisive, an assurance for righteousness and a warning to those who reject His ways."
    },
    {
      "pk": 2430024,
      "translation": "AIV",
      "book": 24,
      "chapter": 30,
      "verse": 24,
      "text": "\"The fierce anger of the LORD will not turn back until He has accomplished the intentions of His heart. In the latter days you will understand this.\"",
      "links": "<a href='/AIV/24/23/20'>Jer. 23:20</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The phrase 'in the latter days' points forward to fuller revelation, both in prophetic fulfillment and in Christ's ultimate work of redemption and judgment."
    }
  ],
  "translatedAt": "2025-12-23T06:30:26.225Z"
}