{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 39,
  "verses": [
    {
      "pk": 30039001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 1,
      "text": "In the ninth year of Zedekiah king of Judah, in the tenth month, Nebuchadnezzar king of Babylon and all his army came against Jerusalem and besieged it.",
      "links": "<a href='/AIV/12/25/1-2'>2 Kings 25:1-2</a>; <a href='/AIV/24/32/1-2'>Jer. 32:1-2</a>",
      "comment": "A precise date begins the narrative, emphasizing the historicity of the siege. The faithfulness of God's warnings is underscored here (see Jer. 21:2-10)."
    },
    {
      "pk": 30039002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 2,
      "text": "In the eleventh year of Zedekiah, in the fourth month, on the ninth day of the month, the city was breached.",
      "links": "<a href='/AIV/12/25/3-4'>2 Kings 25:3-4</a>; <a href='/AIV/25/2/7-9'>Lamentations 2:7-9</a>",
      "comment": "Jerusalem's fall follows the prophetic timeline announced earlier, indicating God's sovereignty over history. See also the prophetic detail in Ezek. 24:2."
    },
    {
      "pk": 30039003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 3,
      "text": "Then all the officials of the king of Babylon came in and sat in the Middle Gate: Nergal-sharezer of Samgar, Nebusarsekim the chief officer, Nergal-sharezer the high official, and all the rest of the officials of the king of Babylon.",
      "links": "<a href='/AIV/12/25/6'>2 Kings 25:6</a>; <a href='/AIV/24/1/15'>Jer. 1:15</a>",
      "comment": "The enemy's leaders occupying Jerusalem's gate signifies complete conquest. Fulfillment of God's word against royal and priestly opposition (see Jer. 1:15 and Jer. 13:13). Symbolically, the enthronement of foreign powers prefigures judgment for covenant unfaithfulness."
    },
    {
      "pk": 30039004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 4,
      "text": "When Zedekiah king of Judah and all the men of war saw them, they fled and went out of the city by night through the king’s garden, by the gate between the two walls; and he went out toward the way of the Arabah.",
      "links": "<a href='/AIV/12/25/4'>2 Kings 25:4</a>; <a href='/AIV/24/52/7'>Jer. 52:7</a>",
      "comment": "Zedekiah's attempted escape underlines the futility of resistance apart from obedience to God's word. The Arabah refers to the rift valley toward the Jordan; see also the prophet's warning in Jer. 38:17-18."
    },
    {
      "pk": 30039005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 5,
      "text": "But the army of the Chaldeans pursued them and overtook Zedekiah in the plains of Jericho. They took him and brought him up to Nebuchadnezzar king of Babylon at Riblah in the land of Hamath, where he pronounced judgment on him.",
      "links": "<a href='/AIV/12/25/5-6'>2 Kings 25:5-6</a>; <a href='/AIV/24/21/7'>Jer. 21:7</a>",
      "comment": "Jericho, where Israel first entered the land, now becomes a symbol of tragic reversal. Zedekiah's judgment was prophesied by Jeremiah. Riblah serves as the Babylonian king's seat of judgment."
    },
    {
      "pk": 30039006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 6,
      "text": "The king of Babylon slaughtered the sons of Zedekiah at Riblah before his eyes. He also slaughtered all the nobles of Judah.",
      "links": "<a href='/AIV/24/52/10'>Jer. 52:10</a>; <a href='/AIV/25/3/51'>Lam. 3:51</a>",
      "comment": "The horror of Zedekiah witnessing his family’s death fulfills <a href='/AIV/24/34/21'>Jer. 34:21</a>. The loss of priests and officials foreshadows the end of Israel's independent leadership. Spiritual interpretation points to the consequences of breaking divine covenant—a recurring biblical warning."
    },
    {
      "pk": 30039007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 7,
      "text": "He put out Zedekiah’s eyes and bound him with bronze shackles to bring him to Babylon.",
      "links": "<a href='/AIV/12/25/7'>2 Kings 25:7</a>; <a href='/AIV/24/52/11'>Jer. 52:11</a>",
      "comment": "The blinding of Zedekiah fulfilled both tragic prophecy and a sign: Judah’s king walks in darkness (see Ezek. 12:13). This event highlights the seriousness of faithlessness within God's people and the loss of spiritual vision."
    },
    {
      "pk": 30039008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 8,
      "text": "The Chaldeans burned the king’s house and the houses of the people with fire, and broke down the walls of Jerusalem.",
      "links": "<a href='/AIV/24/52/13-14'>Jer. 52:13-14</a>; <a href='/AIV/25/2/2-3'>Lam. 2:2-3</a>",
      "comment": "The destruction of the city and its walls signifies God's judgment but also sets the stage for future restoration (see Neh. 2:13-17 for later rebuilding). The burning recalls other sanctuaries and points toward purgation and renewal in biblical theology."
    },
    {
      "pk": 30039009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 9,
      "text": "Then Nebuzaradan the captain of the guard carried away captive to Babylon the rest of the people who were left in the city, those who had surrendered to him, and the remainder of the people.",
      "links": "<a href='/AIV/12/25/11'>2 Kings 25:11</a>; <a href='/AIV/24/15/2'>Jer. 15:2</a>",
      "comment": "The exile of Judah's remnant parallels earlier prophecies. Not all were destroyed—a sign of God's mercy and a remnant for future hope. See Rom. 11:5 for New Testament reflection on this theme."
    },
    {
      "pk": 30039010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 10,
      "text": "But Nebuzaradan the captain of the guard left some of the poor of the land, who had nothing, and gave them vineyards and fields at that time.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>; <a href='/AIV/24/52/16'>Jer. 52:16</a>",
      "comment": "The poor inherit the land, fulfilling the biblical motif where the humble are raised up—a foreshadowing of Christ’s teaching (see Luke 6:20). Often, God’s kingdom advances through the least and the lowly."
    },
    {
      "pk": 30039011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 11,
      "text": "Now Nebuchadnezzar king of Babylon gave a command concerning Jeremiah through Nebuzaradan the captain of the guard, saying:",
      "links": "<a href='/AIV/24/24/5-6'>Jer. 24:5-6</a>",
      "comment": "Jeremiah finds favor in the eyes of foreign rulers, underscoring God’s sovereignty to protect his prophets. This signals God’s ability to preserve his Word amidst judgment."
    },
    {
      "pk": 30039012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 12,
      "text": "\"Take him, look after him well, and do him no harm, but deal with him as he tells you.\"",
      "links": "<a href='/AIV/24/15/20-21'>Jer. 15:20-21</a>",
      "comment": "Jeremiah’s obedience is rewarded—even gentile rulers honor God’s messenger. This echoes God’s promises to His faithful servants for preservation (see Jer. 1:8)."
    },
    {
      "pk": 30039013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 13,
      "text": "So Nebuzaradan the captain of the guard, Nebushazban the chief officer, Nergal-sharezer the high official, and all the chief officers of the king of Babylon",
      "links": "<a href='/AIV/24/39/3'>Jer. 39:3</a>",
      "comment": "The repeated names stress the reach and authority of Babylon but also the meticulous fulfillment of divine instructions regarding Jeremiah."
    },
    {
      "pk": 30039014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 14,
      "text": "sent and took Jeremiah out of the court of the guardhouse. They gave him to Gedaliah son of Ahikam, son of Shaphan, to take him home. So he lived among the people.",
      "links": "<a href='/AIV/24/40/5-6'>Jer. 40:5-6</a>",
      "comment": "God uses even foreign powers to care for His prophet. Gedaliah's assignment lays the groundwork for gathering the faithful remnant in the land (see Jer. 40:7)."
    },
    {
      "pk": 30039015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 15,
      "text": "Now the word of the Lord had come to Jeremiah while he was shut up in the court of the guardhouse, saying:",
      "links": "<a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "God speaks to Jeremiah amid confinement. This reminder highlights the enduring authority of God’s Word, which is not bound by physical circumstances. See 2 Tim. 2:9 for similar New Testament affirmation."
    },
    {
      "pk": 30039016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 16,
      "text": "\"Go and tell Ebed-melech the Ethiopian, 'Thus says the Lord of hosts, the God of Israel: Behold, I will fulfill my words against this city for disaster and not for good, and they shall be accomplished before you on that day.'\"",
      "links": "<a href='/AIV/24/38/7-13'>Jer. 38:7-13</a>; <a href='/AIV/24/21/10'>Jer. 21:10</a>",
      "comment": "Ebed-melech, a foreigner who trusted the God of Israel, is singled out for reassurance (see Jer. 38:7-13). His faith and action on behalf of God's prophet are rewarded, reflecting grace for those outside Israel who align with God's will."
    },
    {
      "pk": 30039017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 17,
      "text": "\"But I will deliver you on that day, says the Lord, and you shall not be given into the hand of the men whom you fear.\"",
      "links": "<a href='/AIV/19/91/7'>Ps. 91:7</a>; <a href='/AIV/24/1/8'>Jer. 1:8</a>",
      "comment": "God's personal assurance to Ebed-melech affirms that God is faithful and impartial, rescuing those who trust Him. The security of God’s promises is a timeless truth."
    },
    {
      "pk": 30039018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 39,
      "verse": 18,
      "text": "\"For I will surely save you, and you shall not fall by the sword; but your life shall be as a prize of war to you, because you have put your trust in me, declares the Lord.\"",
      "links": "<a href='/AIV/19/56/3-4'>Ps. 56:3-4</a>; <a href='/AIV/24/17/7'>Jer. 17:7</a>",
      "comment": "Ebed-melech’s life is preserved because of his faith. Trusting in the Lord secures spiritual deliverance—an enduring message culminating in Christ’s promises (see John 14:1)."
    }
  ],
  "translatedAt": "2025-12-24T08:43:20.746Z"
}