{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 45,
  "verses": [
    {
      "pk": 245001,
      "translation": "AIV",
      "book": 24,
      "chapter": 45,
      "verse": 1,
      "text": "The word that Jeremiah the prophet spoke to Baruch son of Neriah, when he wrote these words in a scroll from Jeremiah’s dictation, in the fourth year of Jehoiakim the son of Josiah, king of Judah:",
      "links": "<a href='/AIV/24/36/1-4'>Jer. 36:1–4</a>, <a href='/AIV/24/32/12-16'>Jer. 32:12–16</a>",
      "comment": "This verse establishes the historical setting, tying Jeremiah’s words to a specific moment (see Jeremiah 36:1–4). The mention of Baruch as Jeremiah's scribe emphasizes the important role of sacred tradition and faithful transmission of God's word, a principle underlying orderly succession and stewardship in the life of God’s people."
    },
    {
      "pk": 245002,
      "translation": "AIV",
      "book": 24,
      "chapter": 45,
      "verse": 2,
      "text": "Thus says the LORD, the God of Israel, to you, O Baruch:",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>, <a href='/AIV/24/25/3'>Jer. 25:3</a>",
      "comment": "God addresses Baruch personally through Jeremiah, demonstrating how God’s words are delivered not only to the nation but to individuals, often through chosen servants. This reflects how God uses mediators and authoritative interpreters for revelation (see John 17:20, Acts 8:30–31)."
    },
    {
      "pk": 245003,
      "translation": "AIV",
      "book": 24,
      "chapter": 45,
      "verse": 3,
      "text": "\"You said, 'Woe is me! For the LORD has added sorrow to my pain; I am weary with my groaning, and I find no rest.'\"",
      "links": "<a href='/AIV/24/20/14-18'>Jer. 20:14–18</a>, <a href='/AIV/19/6/6'>Ps. 6:6</a>, <a href='/AIV/40/11/28'>Matt. 11:28</a>",
      "comment": "Baruch's lament expresses exhaustion and discouragement, which resonates with the laments of the prophets (Jeremiah 20:14–18) and the Psalms (Psalm 6:6). His longing for rest anticipates Christ’s invitation, 'Come to me, all who labor and are heavy laden, and I will give you rest' (Matthew 11:28), subtly pointing to the future fulfillment of rest in Christ and the peace He bestows through the grace mediated by His messengers."
    },
    {
      "pk": 245004,
      "translation": "AIV",
      "book": 24,
      "chapter": 45,
      "verse": 4,
      "text": "Thus you shall say to him: 'Thus says the LORD: Behold, what I have built I am tearing down, and what I have planted I am uprooting, all this land.'",
      "links": "<a href='/AIV/24/1/10'>Jer. 1:10</a>, <a href='/AIV/24/18/7-10'>Jer. 18:7–10</a>, <a href='/AIV/19/80/8-16'>Ps. 80:8–16</a>",
      "comment": "God’s sovereign authority is emphasized—He both builds and uproots (see Jeremiah 1:10; 18:7–10). This underlines the doctrine of divine providence: God directs all history according to His purpose. The imagery of planting and uprooting is frequently used later by Jesus (cf. Matthew 15:13), inviting readers to see unity in God’s work through both testaments."
    },
    {
      "pk": 245005,
      "translation": "AIV",
      "book": 24,
      "chapter": 45,
      "verse": 5,
      "text": "\"And do you seek great things for yourself? Do not seek them. For behold, I am bringing disaster upon all flesh, declares the LORD, but I will grant you your life as a prize of war in all the places where you go.\"",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>, <a href='/AIV/24/39/18'>Jer. 39:18</a>, <a href='/AIV/24/43/6'>Jer. 43:6</a>, <a href='/AIV/40/16/25'>Matt. 16:25</a>",
      "comment": "God warns against selfish ambition and promises deliverance not earthly success, paralleling Jesus’ teaching 'For whoever would save his life will lose it, but whoever loses his life for my sake will find it' (Matt. 16:25). The call to trust and accept God’s will over personal gain foreshadows the spiritual path of humble obedience found throughout Scripture. This also hints at the value of perseverance and self-denial, central to the spiritual maturity of God’s people."
    }
  ],
  "translatedAt": "2025-12-23T06:37:45.621Z"
}