{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 4,
  "verses": [
    {
      "pk": 2404001,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 1,
      "text": "If you return, O Israel, declares the LORD, to me you shall return. If you remove your detestable things from my presence, and do not waver,",
      "links": "<a href='/AIV/28/14/1'>Hos. 14:1</a>; <a href='/AIV/24/3/12'>Jer. 3:12</a>",
      "comment": "God calls for true repentance, not mere outward ritual. The emphasis is on an inner conversion and turning from idolatry, a persistent theme in Jeremiah and the prophetic tradition."
    },
    {
      "pk": 2404002,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 2,
      "text": "and if you swear, 'As the LORD lives,' in truth, in justice, and in righteousness, then nations shall bless themselves in him, and in him they shall glory.",
      "links": "<a href='/AIV/1/22/18'>Gen. 22:18</a>; <a href='/AIV/24/12/16'>Jer. 12:16</a>; <a href='/AIV/23/65/16'>Isa. 65:16</a>",
      "comment": "True faithfulness brings blessings to all nations, hinting at God’s universal plan (cf. Gen 22:18), and foreshadowing the Gospel’s coming to the Gentiles."
    },
    {
      "pk": 2404003,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 3,
      "text": "For thus says the LORD to the men of Judah and Jerusalem: 'Break up your fallow ground, and do not sow among thorns.'",
      "links": "<a href='/AIV/28/10/12'>Hos. 10:12</a>; <a href='/AIV/40/13/22'>Matt. 13:22</a>",
      "comment": "The metaphor of preparing the soil speaks to spiritual readiness. Compare to the Parable of the Sower (Matt 13:22), where thorns choke growth—true conversion requires clearing the heart."
    },
    {
      "pk": 2404004,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 4,
      "text": "Circumcise yourselves to the LORD; remove the foreskin of your hearts, O men of Judah and inhabitants of Jerusalem, lest my wrath go out like fire and burn with none to quench it, because of the evil of your deeds.",
      "links": "<a href='/AIV/5/10/16'>Deut. 10:16</a>; <a href='/AIV/45/2/29'>Rom. 2:29</a>",
      "comment": "The inner circumcision of the heart is emphasized over outward rituals—pointing to the need for inner transformation, later echoed by St. Paul in Romans 2:29."
    },
    {
      "pk": 2404005,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 5,
      "text": "Declare in Judah, and proclaim in Jerusalem, and say: 'Blow the trumpet through the land!' Cry aloud and say, 'Assemble, and let us go into the fortified cities!'",
      "links": "<a href='/AIV/26/33/3'>Ezek. 33:3</a>; <a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "The trumpet signals warning of imminent judgment—a common motif for divine announcements and calls to repentance or assembly."
    },
    {
      "pk": 2404006,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 6,
      "text": "Raise a standard toward Zion, flee for safety, stay not, for I bring disaster from the north, and great destruction.",
      "links": "<a href='/AIV/24/1/14'>Jer. 1:14</a>; <a href='/AIV/23/30/17'>Isa. 30:17</a>",
      "comment": "The approaching disaster from the north alludes to invading armies (likely Babylon), a fulfillment of previous warnings (Jer. 1:14)."
    },
    {
      "pk": 2404007,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 7,
      "text": "A lion has come up from his thicket, a destroyer of nations has set out; he has gone out from his place to make your land a desolation; your cities will be ruins, without inhabitant.",
      "links": "<a href='/AIV/24/2/15'>Jer. 2:15</a>; <a href='/AIV/25/5/18'>Lam. 5:18</a>",
      "comment": "The lion symbolizes the conqueror (Babylon), coming with unstoppable force—used elsewhere for powerful, enemy nations."
    },
    {
      "pk": 2404008,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 8,
      "text": "For this put on sackcloth, lament and wail, for the fierce anger of the LORD has not turned away from us.",
      "links": "<a href='/AIV/23/22/12'>Isa. 22:12</a>; <a href='/AIV/29/1/13'>Joel 1:13</a>",
      "comment": "Wearing sackcloth as a sign of mourning or penitence is a call to public repentance. This anticipates liturgical acts of penance seen in both Testaments."
    },
    {
      "pk": 2404009,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 9,
      "text": "On that day, declares the LORD, the heart of the king and the heart of the officials shall perish, and the priests shall be appalled and the prophets astounded.",
      "links": "<a href='/AIV/19/76/12'>Ps. 76:12</a>; <a href='/AIV/25/4/13'>Lam. 4:13</a>",
      "comment": "No class—royal or priestly—is spared from judgment; leadership alone cannot save without true faith and repentance."
    },
    {
      "pk": 2404010,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 10,
      "text": "Then I said, 'Ah, Lord GOD, surely you have utterly deceived this people and Jerusalem, saying, ",
      "'": "It will be well with you,” whereas the sword has reached their life.'",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>",
      "comment": "Jeremiah’s lament reflects his anguish at false assurances by other prophets—highlighting the importance of fidelity to God’s whole revelation."
    },
    {
      "pk": 2404011,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 11,
      "text": "At that time it will be said to this people and to Jerusalem: A hot wind from the bare heights in the desert toward the daughter of my people, not to winnow or cleanse,",
      "links": "<a href='/AIV/19/11/6'>Ps. 11:6</a>; <a href='/AIV/28/13/15'>Hos. 13:15</a>",
      "comment": "The ‘hot wind’ is not purifying, but destructive—God judges the unrepentant, not just disciplines them."
    },
    {
      "pk": 2404012,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 12,
      "text": "a wind too strong for these—it comes from me. Now I will also pronounce judgments against them.",
      "links": "<a href='/AIV/23/30/27'>Isa. 30:27-28</a>",
      "comment": "God’s judgment is unstoppable and originates directly from Him, reflecting divine sovereignty."
    },
    {
      "pk": 2404013,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 13,
      "text": "Behold, he comes up like clouds; his chariots are like the whirlwind; his horses are swifter than eagles. Woe to us, for we are ruined!",
      "links": "<a href='/AIV/34/1/3-4'>Nah. 1:3-4</a>; <a href='/AIV/36/1/14-15'>Zeph. 1:14-15</a>",
      "comment": "The invading army is described using apocalyptic imagery—clouds, whirlwind, horses. This foreshadows eschatological themes of sudden, overwhelming judgment."
    },
    {
      "pk": 2404014,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 14,
      "text": "O Jerusalem, wash your heart from evil, that you may be saved. How long shall your wicked thoughts lodge within you?",
      "links": "<a href='/AIV/23/1/16'>Isa. 1:16</a>; <a href='/AIV/59/4/8'>James 4:8</a>",
      "comment": "God urges inner cleansing—merely external rituals are insufficient. Salvation is connected to the purity of heart (James 4:8)."
    },
    {
      "pk": 2404015,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 15,
      "text": "For a voice declares from Dan and proclaims trouble from Mount Ephraim.",
      "links": "<a href='/AIV/7/20/1'>Judg. 20:1</a>; <a href='/AIV/24/8/16'>Jer. 8:16</a>",
      "comment": "Dan and Ephraim, Israel’s northern regions, often represent the first places exposed to dangers from northern invaders."
    },
    {
      "pk": 2404016,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 16,
      "text": "Warn the nations that he is coming; announce to Jerusalem, 'Besiegers come from a distant land; they shout against the cities of Judah.'",
      "links": "<a href='/AIV/24/1/15'>Jer. 1:15</a>; <a href='/AIV/23/10/31'>Isa. 10:31-32</a>",
      "comment": "The warning extends beyond Judah—God's actions serve as lessons to all nations, foreshadowing a universal invitation to salvation."
    },
    {
      "pk": 2404017,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 17,
      "text": "Like keepers of a field, they are against her all around, because she has rebelled against me, declares the LORD.",
      "links": "<a href='/AIV/24/5/6'>Jer. 5:6</a>",
      "comment": "Enemies surround Jerusalem like watchmen—not to protect her but as agents of chastisement for rebellion."
    },
    {
      "pk": 2404018,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 18,
      "text": "Your way and your deeds have brought this upon you. This is your doom, and it is bitter; it reaches to your heart.",
      "links": "<a href='/AIV/24/2/19'>Jer. 2:19</a>; <a href='/AIV/25/1/18'>Lam. 1:18</a>",
      "comment": "Judgment comes as a direct result of persistent sin, illustrating the moral operation of God’s justice."
    },
    {
      "pk": 2404019,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 19,
      "text": "My anguish, my anguish! I writhe in pain. Oh the walls of my heart! My heart is beating wildly; I cannot keep silent, for I hear the sound of the trumpet, the alarm of war.",
      "links": "<a href='/AIV/25/2/11'>Lam. 2:11</a>",
      "comment": "Jeremiah gives voice to deep compassion and agony, echoing the heart of a mediator—prefiguring intercessory roles in salvation history."
    },
    {
      "pk": 2404020,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 20,
      "text": "Disaster follows hard on disaster; the whole land is laid waste. Suddenly my tents are destroyed, my curtains in a moment.",
      "links": "<a href='/AIV/23/24/20'>Isa. 24:20</a>; <a href='/AIV/24/10/20'>Jer. 10:20</a>",
      "comment": "The sudden destruction described shows the near totality of judgment — what was temporary (the tent and curtains) is swept away, emphasizing the fleeting nature of all earthly security."
    },
    {
      "pk": 2404021,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 21,
      "text": "How long must I see the standard and hear the sound of the trumpet?",
      "links": "<a href='/AIV/24/6/17'>Jer. 6:17</a>",
      "comment": "The prophet’s lament continues, emphasizing the prolonged warning and God’s patience before judgment."
    },
    {
      "pk": 2404022,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 22,
      "text": "'For my people are foolish; they know me not; they are stupid children; they have no understanding. They are skilled in doing evil, but how to do good they know not.'",
      "links": "<a href='/AIV/5/32/6'>Deut. 32:6</a>; <a href='/AIV/19/14/4'>Ps. 14:4</a>",
      "comment": "Ignorance of God leads to evil—even among those who profess faith. Spiritual knowledge and virtue go hand in hand."
    },
    {
      "pk": 2404023,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 23,
      "text": "I looked on the earth, and behold, it was formless and void; and to the heavens, and they had no light.",
      "links": "<a href='/AIV/1/1/2'>Gen. 1:2</a>",
      "comment": "The language echoes Genesis 1:2 - chaos returns where God’s order is rejected. This is an implicit warning: only when God reigns is creation restored."
    },
    {
      "pk": 2404024,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 24,
      "text": "I looked on the mountains, and behold, they were quaking, and all the hills moved to and fro.",
      "links": "<a href='/AIV/19/114/7'>Ps. 114:7</a>; <a href='/AIV/26/38/20'>Ezek. 38:20</a>",
      "comment": "Cosmic trembling signals divine judgment and reveals the holistic effect of human sin on creation itself."
    },
    {
      "pk": 2404025,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 25,
      "text": "I looked, and behold, there was no man, and all the birds of the air had fled.",
      "links": "<a href='/AIV/1/7/23'>Gen. 7:23</a>",
      "comment": "Absence of man and birds indicates complete desolation, reminiscent of the flood and other acts of purification in Scripture."
    },
    {
      "pk": 2404026,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 26,
      "text": "I looked, and behold, the fruitful land was a desert, and all its cities were laid in ruins before the LORD, before his fierce anger.",
      "links": "<a href='/AIV/5/29/23'>Deut. 29:23</a>; <a href='/AIV/24/9/11'>Jer. 9:11</a>",
      "comment": "The reversal from fruitful land to desert underlines the consequences of forsaking the LORD."
    },
    {
      "pk": 2404027,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 27,
      "text": "For thus says the LORD, 'The whole land shall be a desolation; yet I will not make a full end.'",
      "links": "<a href='/AIV/3/26/44'>Lev. 26:44</a>; <a href='/AIV/24/5/18'>Jer. 5:18</a>",
      "comment": "Judgment is severe but not absolute—God always preserves a remnant, foreshadowing the restoration through which salvation comes."
    },
    {
      "pk": 2404028,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 28,
      "text": "For this the earth shall mourn and the heavens above be dark; for I have spoken, I have purposed; I will not relent nor will I turn back.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/42/23/30'>Luke 23:30</a>",
      "comment": "Cosmic signs signal divine decisions. Yet when God decrees, his word is sure—indicating Christological echoes of the unchangeable divine will."
    },
    {
      "pk": 2404029,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 29,
      "text": "At the sound of horseman and archer every city takes to flight; they enter thickets; they climb among rocks; all the cities are forsaken, and no man dwells in them.",
      "links": "<a href='/AIV/7/17/2'>Judg. 17:2</a>; <a href='/AIV/23/2/20'>Isa. 2:20-21</a>",
      "comment": "Total terror and abandonment reflect the devastating impact of sin. The use of hiding in rocks has symbolic value, later repeated in apocalyptic literature."
    },
    {
      "pk": 2404030,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 30,
      "text": "And you, O desolate one, what do you mean that you dress in scarlet, that you adorn yourself with ornaments of gold, that you enlarge your eyes with paint? In vain you beautify yourself. Your lovers despise you; they seek your life.",
      "links": "<a href='/AIV/26/23/40'>Ezek. 23:40</a>; <a href='/AIV/24/2/36-37'>Jer. 2:36-37</a>",
      "comment": "Jerusalem is personified as a woman vainly seeking help from pagan alliances. Outward beauty cannot replace fidelity. This prepares for typological images of the New Jerusalem as the pure Bride."
    },
    {
      "pk": 2404031,
      "translation": "AIV",
      "book": 24,
      "chapter": 4,
      "verse": 31,
      "text": "For I hear a cry as of a woman in labor, anguish as of one giving birth to her first child, the cry of the daughter of Zion gasping for breath, stretching out her hands, 'Woe is me! I am fainting before murderers.'",
      "links": "<a href='/AIV/23/13/8'>Isa. 13:8</a>; <a href='/AIV/66/12/2'>Rev. 12:2</a>",
      "comment": "Birth pangs symbolize suffering but also the hope of new life. This image reappears in the New Testament as foreshadowing the coming of the Messiah and the ultimate renewal through suffering. (See Rev 12:2; John 16:21)."
    }
  ],
  "translatedAt": "2025-12-23T06:16:52.310Z"
}