{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 3,
  "verses": [
    {
      "pk": 240301,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 1,
      "text": "If a man divorces his wife and she goes away from him and marries another man, will he return to her again? Would not that land be completely defiled? Yet you have committed adultery with many lovers—should you now return to Me? declares the LORD.",
      "links": "<a href='/AIV/5/24/1-4'>Deut. 24:1–4</a>; <a href='/AIV/26/23/4'>Ezek. 23:4</a>",
      "comment": "God uses the analogy of human divorce to underscore Israel’s spiritual infidelity. The rhetorical question points to the seriousness of their sin, yet God graciously invites them to return, hinting at His enduring mercy and willingness to restore even unfaithful people."
    },
    {
      "pk": 240302,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 2,
      "text": "Lift your eyes to the barren heights and see. Where have you not been violated? By the roads you sat, waiting for them, like an Arab in the desert. You have polluted the land with your vile harlotry.",
      "links": "<a href='/AIV/20/7/9'>Prov. 7:9–12</a>; <a href='/AIV/28/4/13'>Hos. 4:13</a>",
      "comment": "Israel’s idolatry is described in provocative terms, illustrating the depth of its betrayal. The reference to the ‘barren heights’ and ‘waiting by the roads’ emphasizes the eagerness and public nature of their spiritual unfaithfulness."
    },
    {
      "pk": 240303,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 3,
      "text": "Therefore, the showers have been withheld, and there has been no spring rain. You have the forehead of a woman who refuses to be ashamed; you refuse to blush.",
      "links": "<a href='/AIV/28/2/3'>Hos. 2:3</a>; <a href='/AIV/11/17/1'>1 Kings 17:1</a>",
      "comment": "The consequence of idolatry is drought, a direct covenantal judgment. Israel’s boldness in sin is depicted as shamelessness. This consequential chastisement recalls covenant curses for rebellion."
    },
    {
      "pk": 240304,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 4,
      "text": "Have you not just now called to Me, 'My Father, You are the friend of my youth'?",
      "links": "<a href='/AIV/19/71/5'>Ps. 71:5</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "Israel attempts to invoke relationship language, appealing to God as Father and past companion. This points to the privileged relationship God offered, which is now being misused amid persistent sin."
    },
    {
      "pk": 240305,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 5,
      "text": "Will He be angry forever? Will He keep His wrath to the end? You say this, but you continue to do all the evil you can.",
      "links": "<a href='/AIV/19/85/5'>Ps. 85:5</a>; <a href='/AIV/19/78/38'>Ps. 78:38</a>",
      "comment": "Israel presumes upon God's mercy, even while persisting in sin. The expectation of endless forgiveness without real contrition is exposed as hypocrisy."
    },
    {
      "pk": 240306,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 6,
      "text": "The LORD said to me in the days of King Josiah: 'Have you seen what faithless Israel has done? She has gone up on every high hill and under every green tree and has practiced harlotry there.'",
      "links": "<a href='/AIV/11/14/23'>1 Kings 14:23</a>; <a href='/AIV/26/6/13'>Ezek. 6:13</a>",
      "comment": "During Josiah’s reign, notorious for reform, God recounts Israel’s spiritual adultery, focusing on idolatrous practices at high places—historically places of pagan worship contrary to God’s commands."
    },
    {
      "pk": 240307,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 7,
      "text": "I thought, 'After she has done all this, she will return to Me.' But she did not return. Her treacherous sister Judah saw this.",
      "links": "<a href='/AIV/24/3/10'>Jer. 3:10</a>; <a href='/AIV/26/23/11'>Ezek. 23:11</a>",
      "comment": "God’s hope for repentance goes unanswered. Judah observes Israel’s unfaithfulness, a foreshadowing of Judah’s own imminent judgment due to similar sin."
    },
    {
      "pk": 240308,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 8,
      "text": "She saw that, for all the reasons faithless Israel committed adultery, I had sent her away and given her a certificate of divorce. Yet her treacherous sister Judah did not fear; she too went and prostituted herself.",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>; <a href='/AIV/26/16/32'>Ezek. 16:32</a>",
      "comment": "God’s legal imagery stresses the gravity of spiritual infidelity. Judah’s failure to heed the warning possesses a strong typological parallel to those who persist in sin despite clear consequences."
    },
    {
      "pk": 240309,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 9,
      "text": "Through her blatant immorality, Judah defiled the land; she committed adultery with stone and wood.",
      "links": "<a href='/AIV/19/106/37'>Ps. 106:37–38</a>; <a href='/AIV/23/44/19'>Isa. 44:19</a>",
      "comment": "Idolatry—worshipping lifeless creations—is equated with adultery, linking physical and spiritual pollution. This supports the scriptural tradition of seeing unfaithfulness to God as not merely sin but defilement."
    },
    {
      "pk": 240310,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 10,
      "text": "Even with all this, her treacherous sister Judah did not return to Me with all her heart, but only in pretense, declares the LORD.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/24/4/2'>Jer. 4:2</a>",
      "comment": "Judah’s external repentance is denounced; the lack of true contrition is heavily critiqued elsewhere as empty ritualism (see Isaiah 29:13). Authentic conversion is a recurring biblical theme."
    },
    {
      "pk": 240311,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 11,
      "text": "The LORD said to me: Faithless Israel has shown herself more righteous than treacherous Judah.",
      "links": "<a href='/AIV/26/16/51'>Ezek. 16:51–52</a>",
      "comment": "A surprising reversal: Israel, often condemned, now contrasted favorably to Judah, emphasizing the severity of Judah’s hypocrisy and accountability for greater light received."
    },
    {
      "pk": 240312,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 12,
      "text": "Go, proclaim these words toward the north and say: 'Return, faithless Israel,' declares the LORD. 'I will not remain angry forever, for I am merciful,' declares the LORD; 'I will not be furious forever.",
      "links": "<a href='/AIV/19/103/8-9'>Ps. 103:8–9</a>; <a href='/AIV/28/14/1'>Hos. 14:1</a>",
      "comment": "Despite repeated rebellion, God’s mercy and readiness to forgive are revealed. The call to repentance is universally relevant, anticipating deeper reconciliation in the New Covenant."
    },
    {
      "pk": 240313,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 13,
      "text": "Only acknowledge your guilt, that you have rebelled against the LORD your God, and scattered your favors among strangers under every green tree, without obeying My voice,' declares the LORD.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/20/28/13'>Prov. 28:13</a>",
      "comment": "Confession is the first step toward renewal. The importance of honestly admitting sin forms a foundation for restoration—parallels emerge in the teaching about confession and repentance in the New Testament."
    },
    {
      "pk": 240314,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 14,
      "text": "'Return, O faithless children,' declares the LORD; 'for I am your master, and I will take you, one from a city and two from a family, and I will bring you to Zion.'",
      "links": "<a href='/AIV/23/52/8'>Isa. 52:8</a>; <a href='/AIV/23/2/3'>Isa. 2:3</a>",
      "comment": "God’s promise to personally gather a remnant to Zion is both literal and spiritual. Zion comes to symbolize the fullness of God’s presence, later fulfilled in Christ gathering all nations to Himself through His Church (see Hebrews 12:22–24)."
    },
    {
      "pk": 240315,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 15,
      "text": "'And I will give you shepherds after My own heart, who will feed you with knowledge and understanding.'",
      "links": "<a href='/AIV/26/34/23'>Ezek. 34:23</a>; <a href='/AIV/43/21/17'>John 21:17</a>",
      "comment": "Here, God promises to raise up faithful leaders who truly care for His people. This finds deeper fulfillment in Christ appointing the apostles as shepherds and in the ongoing role of bishops guarding unity and doctrine (see Acts 20:28)."
    },
    {
      "pk": 240316,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 16,
      "text": "'And when you have multiplied and increased in the land,' declares the LORD, 'they will no longer say, ‘The ark of the covenant of the LORD.’ It will not come to mind or be remembered or missed; it will not be made again.'",
      "links": "<a href='/AIV/36/2/7'>Zeph. 2:7</a>; <a href='/AIV/58/9/11'>Heb. 9:11</a>",
      "comment": "Loss of the Ark prefigures the movement from external signs to God’s living presence among His people. Fulfilled in Christ and the new order, where God dwells definitively with humanity."
    },
    {
      "pk": 240317,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 17,
      "text": "'At that time Jerusalem will be called the Throne of the LORD; all nations will gather there in the name of the LORD in Jerusalem, and they will no longer follow the stubbornness of their evil hearts.'",
      "links": "<a href='/AIV/23/2/2'>Isa. 2:2</a>; <a href='/AIV/44/15/16-17'>Acts 15:16–17</a>",
      "comment": "Universal gathering is forecast; Jerusalem becomes central, a sign later fulfilled spiritually as believers from all nations join in worship, prefiguring the international scope of the Church."
    },
    {
      "pk": 240318,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 18,
      "text": "In those days the house of Judah will walk together with the house of Israel, and they will come together from the land of the north to the land I gave to their ancestors as an inheritance.",
      "links": "<a href='/AIV/26/37/22'>Ezek. 37:22</a>; <a href='/AIV/28/1/11'>Hos. 1:11</a>",
      "comment": "Reunification promises healing and unity; this restoration is literal but ultimately typological of the spiritual union of all God’s people."
    },
    {
      "pk": 240319,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 19,
      "text": "'I said: How I would place you among My sons and give you a pleasant land, the most beautiful heritage of all nations! I thought you would call Me, ‘My Father,’ and would not turn away from following Me.'",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "God’s longing for a father-child relationship is part of His eternal plan for humanity. Fulfilled in Christ, believers are adopted as sons (Galatians 4:5–7)."
    },
    {
      "pk": 240320,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 20,
      "text": "Surely, as a wife is unfaithful to her husband, so you have been unfaithful to Me, O house of Israel, declares the LORD.",
      "links": "<a href='/AIV/28/2/2'>Hos. 2:2</a>; <a href='/AIV/26/16/45'>Ezek. 16:45</a>",
      "comment": "The marriage metaphor exhibits the intimacy God intends with His people. Spiritual unfaithfulness repeatedly draws prophetic rebuke and points toward the need for reconciliation offered in Christ."
    },
    {
      "pk": 240321,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 21,
      "text": "A voice is heard on the barren heights, the weeping and pleading of Israel’s children, because they have perverted their way and forgotten the LORD their God.",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>; <a href='/AIV/28/6/1'>Hos. 6:1</a>",
      "comment": "The cry of repentance emerges from sorrow for sin, fulfilling the prophetic promise that contrition is the beginning of restoration."
    },
    {
      "pk": 240322,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 22,
      "text": "'Return, faithless children, and I will heal your faithlessness.' 'Here we are—we come to You, for You are the LORD our God.'",
      "links": "<a href='/AIV/19/147/3'>Ps. 147:3</a>; <a href='/AIV/28/14/4'>Hos. 14:4</a>",
      "comment": "God promises healing and restoration to those who return. The confession, ‘You are the LORD our God,’ acknowledges God as source and healer, signaling true conversion."
    },
    {
      "pk": 240323,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 23,
      "text": "Truly, the hills and the tumult on the mountains are a false hope; salvation comes from the LORD our God—the Holy One of Israel.",
      "links": "<a href='/AIV/19/121/1-2'>Ps. 121:1–2</a>",
      "comment": "The futility of idolatry is contrasted with exclusive faith in God. This principle is foundational: salvation is found in God alone, a truth realized in Jesus Christ (Acts 4:12)."
    },
    {
      "pk": 240324,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 24,
      "text": "From our youth shameful idols have consumed what our ancestors worked for—their flocks and herds, sons and daughters.",
      "links": "<a href='/AIV/19/106/36'>Ps. 106:36–38</a>",
      "comment": "False worship destroys blessings and consumes future generations. Spiritual fidelity is repeatedly shown as essential for flourishing life and legacy."
    },
    {
      "pk": 240325,
      "translation": "AIV",
      "book": 24,
      "chapter": 3,
      "verse": 25,
      "text": "Let us lie down in our shame, and let our disgrace cover us. For we have sinned against the LORD our God, both we and our fathers, from our youth until this day, and we have not obeyed the LORD our God.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/19/51/1-4'>Ps. 51:1–4</a>",
      "comment": "Corporate confession acknowledges generational sin and guilt. The act of repentance brings hope for restoration, a theme central in scripture and the sacramental means of grace, anticipated in later biblical teaching."
    }
  ],
  "translatedAt": "2025-12-23T06:16:14.750Z"
}