{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 8,
  "verses": [
    {
      "pk": 2400801,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 1,
      "text": "At that time, declares the LORD, they will bring out the bones of the kings of Judah, the officials, the priests, the prophets, and the people of Jerusalem from their graves.",
      "links": "<a href='/AIV/26/6/5'>Ezek. 6:5</a>; <a href='/AIV/49/6/12'>Eph. 6:12</a>",
      "comment": "This verse uses grave desecration as a sign of ultimate judgment, paralleling Ezekiel's warnings. The inclusion of priests and prophets suggests that spiritual leaders are not exempt from accountability."
    },
    {
      "pk": 2400802,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 2,
      "text": "They will spread them out before the sun, the moon, and all the host of heaven, which these people have loved, served, followed, consulted, and worshiped. They will not be gathered or buried; they will be as dung on the face of the ground.",
      "links": "<a href='/AIV/05/4/19'>Deut. 4:19</a>; <a href='/AIV/19/106/37-38'>Ps. 106:37-38</a>",
      "comment": "Idolatry is explicitly condemned. Their bones lie unburied, showing utter humiliation. Compare with Deuteronomy's warning against worshiping celestial bodies."
    },
    {
      "pk": 2400803,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 3,
      "text": "Then death will be preferable to life for all those who remain of this evil family, in every place where I have driven them, declares the LORD of hosts.",
      "links": "<a href='/AIV/24/15/2-4'>Jer. 15:2-4</a>",
      "comment": "Echoes themes of exile and judgment elsewhere in Jeremiah. The reversal where death is sought instead of life underscores the severity of separation from God's favor."
    },
    {
      "pk": 2400804,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 4,
      "text": "You shall tell them, ‘This is what the LORD says: When people fall, do they not get up again? If one turns away, does he not return?’",
      "links": "<a href='/AIV/12/13/23'>2 Kings 13:23</a>; <a href='/AIV/19/94/18'>Ps. 94:18</a>",
      "comment": "Jeremiah uses the image of repentance as a natural, expected response. Cross-reference with the theme of God’s readiness to restore in Psalms and Kings."
    },
    {
      "pk": 2400805,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 5,
      "text": "Why then has this people, Jerusalem, turned away with an unending backsliding? They cling to deceit; they refuse to return.",
      "links": "<a href='/AIV/24/5/3'>Jer. 5:3</a>",
      "comment": "The concept of persistent backsliding indicates a willful rejection of truth. This speaks to the need for authentic conversion, and not just outward repentance."
    },
    {
      "pk": 2400806,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 6,
      "text": "I have listened and heard: they speak what is not right; no one repents of his wickedness, saying, ‘What have I done?’ Each turns to his own course, like a horse charging into battle.",
      "links": "<a href='/AIV/23/59/3-4'>Isa. 59:3-4</a>",
      "comment": "God personally observes the lack of contrition. The horse imagery suggests stubbornness and recklessness in sin."
    },
    {
      "pk": 2400807,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 7,
      "text": "Even the stork in the sky knows its appointed seasons, and the turtledove, the swift, and the thrush observe the time of their coming; but my people do not know the judgment of the LORD.",
      "links": "<a href='/AIV/19/104/17'>Ps. 104:17</a>; <a href='/AIV/24/5/24'>Jer. 5:24</a>",
      "comment": "God contrasts nature’s obedience with human disobedience. The idea of knowing God’s judgment hints at a spiritual discernment found in a deeper relationship with Him."
    },
    {
      "pk": 2400808,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 8,
      "text": "How can you say, ‘We are wise, and the law of the LORD is with us’? But look, the dishonest pen of the scribes has turned it into a lie.",
      "links": "<a href='/AIV/19/119/98'>Ps. 119:98</a>; <a href='/AIV/40/23/2-4'>Matt. 23:2-4</a>",
      "comment": "Here, the dangers of distorting Scripture are addressed. Compare with Jesus' rebuke of religious leaders who mishandled the law in Matthew’s gospel."
    },
    {
      "pk": 2400809,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 9,
      "text": "The wise men will be put to shame; they will be dismayed and caught. See, they have rejected the word of the LORD, so what kind of wisdom do they have?",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/20/1/7'>Prov. 1:7</a>",
      "comment": "Rejecting divine revelation leads to true shame. Wisdom means submission to God’s word, a theme deeply expounded in both Psalms and Proverbs."
    },
    {
      "pk": 2400810,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 10,
      "text": "Therefore I will give their wives to others and their fields to new owners. From the least to the greatest, all are greedy for gain; from prophet to priest, everyone practices deceit.",
      "links": "<a href='/AIV/24/6/13'>Jer. 6:13</a>; <a href='/AIV/19/10/3'>Ps. 10:3</a>",
      "comment": "Loss of land and family is part of the covenant curses. The charge includes spiritual leaders, emphasizing the need for integrity among all believers."
    },
    {
      "pk": 2400811,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 11,
      "text": "They heal the wound of my people lightly, saying, ‘Peace, peace,’ when there is no peace.",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>; <a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "False assurance is a repeated theme. Compare with Ezekiel—the message from false prophets is contrasted with the true healing that comes only from God."
    },
    {
      "pk": 2400812,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 12,
      "text": "Were they ashamed when they committed abomination? No, they were not ashamed at all; they do not even know how to blush. Therefore they shall fall among the fallen; in the time of their punishment they shall be brought down, says the LORD.",
      "links": "<a href='/AIV/19/40/12'>Ps. 40:12</a>",
      "comment": "Shamelessness in sin is condemned. The concept of divine retribution links to Old Testament themes of God humbling the proud."
    },
    {
      "pk": 2400813,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 13,
      "text": "I will gather them and sweep them away, declares the LORD. There are no grapes on the vine, nor figs on the fig tree; even the leaves are withered, and what I have given them will be taken away.",
      "links": "<a href='/AIV/40/21/19'>Matt. 21:19</a>; <a href='/AIV/28/9/10'>Hos. 9:10</a>",
      "comment": "The imagery of fruitless vines and trees is often used by Jesus as a symbol of spiritual barrenness (Matthew 21). God’s gifts are lost if not treasured."
    },
    {
      "pk": 2400814,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 14,
      "text": "Why are we sitting still? Gather together, let us go into the fortified cities and perish there! For the LORD our God has doomed us to perish and has given us bitter water to drink, because we have sinned against Him.",
      "links": "<a href='/AIV/02/15/23'>Exod. 15:23</a>",
      "comment": "The ‘bitter water’ imagery recalls Exodus. The recognition of sin and judgment is a step towards true repentance and restoration."
    },
    {
      "pk": 2400815,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 15,
      "text": "We hoped for peace, but no good came; for a time of healing, but saw only terror.",
      "links": "<a href='/AIV/19/38/3'>Ps. 38:3</a>",
      "comment": "Broken expectation is a recurring motif. Only a return to God, both internally and communally, can restore true peace."
    },
    {
      "pk": 2400816,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 16,
      "text": "The snorting of their horses is heard from Dan; at the sound of the neighing of their mighty ones, all the land trembles. They come and devour the land and its fullness, the city and those who dwell in it.",
      "links": "<a href='/AIV/24/4/15'>Jer. 4:15</a>",
      "comment": "The enemy’s approach from Dan in the north is often used as a warning of coming judgment. This anticipates later invasions and exiles."
    },
    {
      "pk": 2400817,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 17,
      "text": "For I will send among you serpents, adders that cannot be charmed, and they shall bite you, declares the LORD.",
      "links": "<a href='/AIV/01/3/15'>Gen. 3:15</a>; <a href='/AIV/19/140/3'>Ps. 140:3</a>",
      "comment": "Serpents are a symbol of judgment and spiritual danger. Compare to Genesis 3 and later christological fulfillment where the ‘serpent’ is finally defeated."
    },
    {
      "pk": 2400818,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 18,
      "text": "My sorrow is beyond healing; my heart is faint within me.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>",
      "comment": "Jeremiah expresses personal grief mirroring God’s own compassion and sorrow over His people. This prophet’s heart is united with God’s."
    },
    {
      "pk": 2400819,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 19,
      "text": "Listen! The cry of the daughter of my people from a distant land: ‘Is the LORD not in Zion? Is her King not within her?’ ‘Why have they provoked Me with their images, with their foreign idols?’",
      "links": "<a href='/AIV/19/99/1'>Ps. 99:1</a>; <a href='/AIV/40/21/5'>Matt. 21:5</a>",
      "comment": "'King within her' implies God's special presence amid his people, anticipating the later fulfillment in Christ's physical dwelling among mankind."
    },
    {
      "pk": 2400820,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 20,
      "text": "The harvest is past, the summer is ended, and still we are not saved.",
      "links": "<a href='/AIV/40/9/37-38'>Matt. 9:37-38</a>",
      "comment": "Missed seasons of repentance point to spiritual neglect. Jesus later uses harvest imagery for readiness to enter the kingdom."
    },
    {
      "pk": 2400821,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 21,
      "text": "For the wound of the daughter of my people I am wounded; I mourn, and horror has seized me.",
      "links": "<a href='/AIV/58/4/15'>Heb. 4:15</a>",
      "comment": "The prophet’s empathetic suffering foreshadows the suffering Servant motif which Christ fulfills, taking on the wounds of His people (Hebrews 4:15)."
    },
    {
      "pk": 2400822,
      "translation": "AIV",
      "book": 24,
      "chapter": 8,
      "verse": 22,
      "text": "Is there no balm in Gilead? Is there no physician there? Why then has the healing of the daughter of my people not come?",
      "links": "<a href='/AIV/42/5/31'>Luke 5:31</a>; <a href='/AIV/19/147/3'>Ps. 147:3</a>",
      "comment": "The final verse hints at hope for healing which only comes from the true Physician. In the New Testament, Christ is the fulfillment of ‘balm in Gilead,’ bringing ultimate spiritual and physical healing."
    }
  ],
  "translatedAt": "2025-12-23T06:18:57.984Z"
}