{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 6,
  "verses": [
    {
      "pk": 2413060,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 1,
      "text": "Flee for safety, O people of Benjamin, out of Jerusalem. Blow the trumpet in Tekoa, and raise a signal on Beth-haccherem, for disaster looms out of the north, and great destruction.",
      "links": "<a href='/AIV/24/4/6'>Jer. 4:6</a>; <a href='/AIV/24/1/13-15'>Jer. 1:13-15</a>",
      "comment": "Benjamin, a southern tribe, is urged to flee impending judgment. Tekoa and Beth-haccherem are warning locations, signaling imminent danger from the north (Babylon). This is a motif of calling God's people to spiritual vigilance."
    },
    {
      "pk": 2413061,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 2,
      "text": "I will destroy the lovely and delicate daughter of Zion.",
      "links": "<a href='/AIV/24/13/17'>Jer. 13:17</a>; <a href='/AIV/25/1/6'>Lam. 1:6</a>",
      "comment": "Jerusalem, 'daughter of Zion,' is depicted as beautiful yet facing ruin for her sin. Echoes of the Church as the bride whom God desires to purify (cf. Rev. 21:2)."
    },
    {
      "pk": 2413062,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 3,
      "text": "Shepherds with their flocks will come against her; they will pitch their tents around her, each grazing in his own place.",
      "links": "<a href='/AIV/24/4/17'>Jer. 4:17</a>",
      "comment": "Foreign invaders described as shepherds surrounding Jerusalem. The imagery also points to the Church beset by persecution, yet watched over by Christ, the Good Shepherd (John 10:11)."
    },
    {
      "pk": 2413063,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 4,
      "text": "Prepare war against her; rise up, let us attack at noon! Woe to us, for the day declines; the shadows of evening lengthen.",
      "links": "<a href='/AIV/24/4/16'>Jer. 4:16</a>",
      "comment": "The sense of urgency for battle speaks to the swiftness of judgment. The decline of day symbolizes encroaching judgment, like spiritual darkness due to sin."
    },
    {
      "pk": 2413064,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 5,
      "text": "Arise, let us attack by night and destroy her palaces.",
      "links": "<a href='/AIV/24/5/10'>Jer. 5:10</a>",
      "comment": "Night assaults emphasize unavoidable judgment. The destruction of palaces means both secular power and spiritual complacency will fall."
    },
    {
      "pk": 2413065,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 6,
      "text": "For the LORD of Hosts says: Cut down her trees; build a siege ramp against Jerusalem. This city must be punished; it is filled with oppression.",
      "links": "<a href='/AIV/24/21/4'>Jer. 21:4</a>; <a href='/AIV/24/5/31'>Jer. 5:31</a>",
      "comment": "God commands judgment using enemy nations. Trees cut for siege symbolize tearing down what was meant for fruitfulness. Oppression demands discipline, a theme in both Old and New Covenants."
    },
    {
      "pk": 2413066,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 7,
      "text": "As a well keeps its water fresh, so she keeps her evil active; violence and destruction are heard in her; sickness and wounds are ever before me.",
      "links": "<a href='/AIV/24/8/15'>Jer. 8:15</a>; <a href='/AIV/23/1/5-6'>Isa. 1:5-6</a>",
      "comment": "'Well keeps water' means sin is constant and pervasive in Jerusalem. A parallel to the repeated call for repentance, echoing Christ's call to conversion (Mark 1:15)."
    },
    {
      "pk": 2413067,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 8,
      "text": "Take warning, O Jerusalem, or I will turn away from you and make your land desolate, uninhabited.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "A merciful warning is given, inviting repentance to avoid judgment. Reflects God’s patient love and the need for personal and corporate conversion."
    },
    {
      "pk": 2413068,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 9,
      "text": "This is what the LORD of Hosts says: Glean the remnant of Israel like a vine. Pass your hand again over the branches like one who gathers grapes.",
      "links": "<a href='/AIV/24/49/9'>Jer. 49:9</a>; <a href='/AIV/23/5/2'>Isa. 5:2</a>; <a href='/AIV/15/9/12'>Ezra 9:12'</a>",
      "comment": "God compares His judgment to harvesting, suggesting that even when all seems lost, a remnant remains—through whom God renews His people, as prefigured by Christ and His Church."
    },
    {
      "pk": 2413069,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 10,
      "text": "To whom shall I speak and give warning, that they may listen? Their ears are closed, they cannot pay attention. The word of the LORD is offensive to them; they find no pleasure in it.",
      "links": "<a href='/AIV/24/5/21'>Jer. 5:21</a>; <a href='/AIV/42/8/21'>Luke 8:21</a>",
      "comment": "People resist God’s word, foreshadowing the rejection of Christ (John 1:11). Hearing and obeying God is necessary for spiritual life—emphasizing sacramental hearing beyond mere understanding."
    },
    {
      "pk": 2413070,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 11,
      "text": "But I am full of the wrath of the LORD; I am weary of holding it in. Pour it out on children in the street and on gatherings of young men, for both husband and wife will be taken, the old and the very aged.",
      "links": "<a href='/AIV/24/7/20'>Jer. 7:20</a>",
      "comment": "Divine wrath, which Jeremiah feels, will touch all ages. Judgment is universal; spiritual application includes the urgency of accepting grace before judgment."
    },
    {
      "pk": 2413071,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 12,
      "text": "Their houses, fields, and wives will be turned over to others, since I will stretch out my hand against the people of the land, declares the LORD.",
      "links": "<a href='/AIV/24/8/10'>Jer. 8:10</a>; <a href='/AIV/05/28/30'>Deut. 28:30</a>",
      "comment": "The forfeiture of possessions echoes covenant curses (Deut. 28:30). Rejection of God leads to loss, but spiritual restoration is promised for the faithful remnant."
    },
    {
      "pk": 2413072,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 13,
      "text": "For from the least to the greatest, everyone is greedy for gain; prophets and priests alike act deceitfully.",
      "links": "<a href='/AIV/24/8/10'>Jer. 8:10</a>; <a href='/AIV/26/22/27'>Eze. 22:27</a>",
      "comment": "Loss of integrity among leaders parallels warnings against false teachers in the New Testament. True spiritual authority requires fidelity and service, lived out especially through the apostles and their successors (Matt. 23:2-3)."
    },
    {
      "pk": 2413073,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 14,
      "text": "They have healed the wound of my people lightly, saying, 'Peace, peace,' when there is no peace.",
      "links": "<a href='/AIV/24/8/11'>Jer. 8:11</a>; <a href='/AIV/26/13/10'>Eze. 13:10</a>",
      "comment": "False peace is proclaimed by corrupt leaders. Only true reconciliation with God brings real peace, echoed in Christ's promise in John 14:27."
    },
    {
      "pk": 2413074,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 15,
      "text": "Were they ashamed when they committed abominations? No, they were not ashamed at all; they did not know how to blush. So they will fall among those who fall; when I visit them, they will be cast down, says the LORD.",
      "links": "<a href='/AIV/24/3/3'>Jer. 3:3</a>; <a href='/AIV/19/36/12'>Ps. 36:12</a>",
      "comment": "Persistent sin erodes conscience. Proper shame leads to repentance, shown in Gospel stories like Peter's contrition (Luke 22:62)."
    },
    {
      "pk": 2413075,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 16,
      "text": "Thus says the LORD: Stand by the roads and look, and ask for the ancient paths, where the good way is; walk in it and you will find rest for your souls. But they said, 'We will not walk in it.'",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/40/11/29'>Matt. 11:29</a>",
      "comment": "Ancient paths signal returning to faithful obedience—the fullness of revelation and tradition. Christ’s invitation for rest (Matt. 11:29) fulfills this."
    },
    {
      "pk": 2413076,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 17,
      "text": "I set watchmen over you, saying, 'Pay attention to the sound of the trumpet!' But they said, 'We will not listen.'",
      "links": "<a href='/AIV/26/3/17'>Eze. 3:17</a>; <a href='/AIV/24/4/19'>Jer. 4:19</a>",
      "comment": "Watchmen are prophets—prefiguring apostolic guardianship. Refusal to heed their warnings is spiritual deafness."
    },
    {
      "pk": 2413077,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 18,
      "text": "Therefore hear, O nations, and know, O congregation, what will happen to them.",
      "links": "<a href='/AIV/24/26/9'>Jer. 26:9</a>; <a href='/AIV/19/49/1'>Ps. 49:1</a>",
      "comment": "Judgment’s warning extends to all nations—a universal message fulfilled in the Church's worldwide mission (Acts 1:8)."
    },
    {
      "pk": 2413078,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 19,
      "text": "Hear, O earth: I am bringing disaster on this people, the fruit of their schemes, because they have not listened to my words, and have rejected my law.",
      "links": "<a href='/AIV/24/9/13'>Jer. 9:13</a>; <a href='/AIV/05/32/1'>Deut. 32:1</a>",
      "comment": "All creation is called to witness God's justice. Rejection of law is spiritual death; Christ fulfills and perfects the Law (Matt. 5:17)."
    },
    {
      "pk": 2413079,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 20,
      "text": "What use to me is frankincense from Sheba or sweet cane from a distant land? Your burnt offerings are not acceptable, nor are your sacrifices pleasing to me.",
      "links": "<a href='/AIV/23/1/11'>Isa. 1:11</a>; <a href='/AIV/28/6/6'>Hos. 6:6</a>",
      "comment": "External offerings without heartfelt obedience mean little to God—reflecting Christ’s teaching of worship in spirit and truth (John 4:24)."
    },
    {
      "pk": 2413080,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 21,
      "text": "Therefore this is what the LORD says: I will put obstacles before this people; parents and children together will stumble; neighbors and friends will perish.",
      "links": "<a href='/AIV/24/13/14'>Jer. 13:14</a>",
      "comment": "Judgment affects families and communities alike—a reminder that sin has repercussions for all, calling for communal repentance."
    },
    {
      "pk": 2413081,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 22,
      "text": "This is what the LORD says: See, a people is coming from the land of the north; a great nation is being stirred up from the farthest parts of the earth.",
      "links": "<a href='/AIV/24/1/15'>Jer. 1:15</a>; <a href='/AIV/24/50/3'>Jer. 50:3</a>",
      "comment": "The northern invader (Babylon) represents God’s chosen instrument for discipline. The motif of nations from afar recurs in eschatological passages."
    },
    {
      "pk": 2413082,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 23,
      "text": "They hold the bow and spear; they are cruel and have no mercy; their voice roars like the sea; they ride on horses, arranged for battle as men for war against you, O daughter of Zion!",
      "links": "<a href='/AIV/24/5/15'>Jer. 5:15</a>",
      "comment": "Describes the overwhelming terror of invasion, again personifying Jerusalem as 'daughter of Zion,' recalling the need for God's protection and mercy."
    },
    {
      "pk": 2413083,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 24,
      "text": "We have heard the report of them; our hands hang limp. Anguish has seized us, pain as of a woman in labor.",
      "links": "<a href='/AIV/24/4/31'>Jer. 4:31</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "Labor pains imagery recurs in predictions of judgment and in messianic fulfillment (Mark 13:8), pointing toward spiritual birthing of new creation in Christ."
    },
    {
      "pk": 2413084,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 25,
      "text": "Do not go out into the field or walk on the road, because the enemy has a sword; there is terror on every side.",
      "links": "<a href='/AIV/24/20/4'>Jer. 20:4</a>",
      "comment": "'Terror on every side' becomes a refrain for Jeremiah, symbolizing total insecurity without God, but also foreshadowing ultimate security found in the Messiah."
    },
    {
      "pk": 2413085,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 26,
      "text": "O daughter of my people, dress in sackcloth and roll in ashes; mourn as for an only son, bitter lamentation, for suddenly the destroyer will come upon us.",
      "links": "<a href='/AIV/24/4/8'>Jer. 4:8</a>; <a href='/AIV/32/3/6'>Jonah 3:6'</a>",
      "comment": "Sackcloth and ashes are traditional signs of penance—pointing to a hearty call to repentance, a continual necessity for believers."
    },
    {
      "pk": 2413086,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 27,
      "text": "I have made you a tester of metals among my people, that you may know and test their ways.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>",
      "comment": "Jeremiah’s prophetic ministry refines the people, as gold is tested by fire; this prefigures purification through suffering and discipline, as developed in New Testament teachings."
    },
    {
      "pk": 2413087,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 28,
      "text": "They are all stubborn rebels, going about as slanderers; they are bronze and iron, all of them act corruptly.",
      "links": "<a href='/AIV/24/7/24'>Jer. 7:24</a>; <a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Metals used negatively imply impurity. Persistent sin resists purification; spiritual life requires ongoing conversion, corresponding with growth in holiness."
    },
    {
      "pk": 2413088,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 29,
      "text": "The bellows blow fiercely; the lead is consumed by the fire. In vain the refining continues, for the wicked are not separated.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>",
      "comment": "Despite intense discipline, impurities remain. Through the new covenant, Christ offers true purification (Heb. 9:14)."
    },
    {
      "pk": 2413089,
      "translation": "AIV",
      "book": 24,
      "chapter": 6,
      "verse": 30,
      "text": "They are called rejected silver, because the LORD has rejected them.",
      "links": "<a href='/AIV/20/17/3'>Prov. 17:3</a>; <a href='/AIV/24/7/29'>Jer. 7:29</a>",
      "comment": "'Rejected silver' concludes the chapter with somber warning. The refusal to be shaped by God results in being cast off—a call to embrace God’s grace through faith and the sacraments, God’s appointed means of transformation."
    }
  ],
  "translatedAt": "2025-12-23T06:17:59.968Z"
}