{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 1,
  "verses": [
    {
      "pk": 5930120,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 1,
      "text": "These are the words of Jeremiah son of Hilkiah, one of the priests at Anathoth in the land of Benjamin.",
      "links": "<a href='/AIV/24/32/6-8'>Jer. 32:6–8</a>; <a href='/AIV/1/49/34'>Gen. 49:34</a>",
      "comment": "Jeremiah's priestly heritage links him directly to the line of Israel’s spiritual leaders, emphasizing his calling to serve in God's unfolding plan for His people."
    },
    {
      "pk": 5930121,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 2,
      "text": "The word of the LORD came to him in the thirteenth year of the reign of Josiah son of Amon king of Judah,",
      "links": "<a href='/AIV/12/22/1'>2 Kgs. 22:1</a>; <a href='/AIV/24/25/3'>Jer. 25:3</a>",
      "comment": "God reveals Himself to Jeremiah during a period of religious reform, highlighting God’s initiative in calling prophets in specific historic moments."
    },
    {
      "pk": 5930122,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 3,
      "text": "and it continued through the days of Jehoiakim son of Josiah king of Judah, until the eleventh year of Zedekiah son of Josiah, king of Judah, until Jerusalem was taken away into exile in the fifth month.",
      "links": "<a href='/AIV/24/39/1-2'>Jer. 39:1–2</a>; <a href='/AIV/12/25/8-11'>2 Kgs. 25:8–11</a>",
      "comment": "Jeremiah’s ministry spans crucial events—including the exile—demonstrating God's faithfulness in speaking through His prophet even in times of judgment."
    },
    {
      "pk": 5930123,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 4,
      "text": "Now the word of the LORD came to me, saying,",
      "links": "",
      "comment": "Personal, direct communication from God is a hallmark of true prophecy (cf. <a href='/AIV/1/12/1'>Gen. 12:1</a>)."
    },
    {
      "pk": 5930124,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 5,
      "text": "'Before I formed you in the womb, I knew you; before you were born, I set you apart; I appointed you as a prophet to the nations.'",
      "links": "<a href='/AIV/48/1/15'>Gal. 1:15</a>; <a href='/AIV/19/139/13-16'>Ps. 139:13–16</a>; <a href='/AIV/23/49/1'>Isa. 49:1</a>",
      "comment": "This verse teaches the mystery of God’s foreknowledge and purpose for every individual, echoing the sanctity of life and divine calling from conception. It reveals that God’s calling is unmerited and eternal, anticipating New Testament themes of election and vocation."
    },
    {
      "pk": 5930125,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 6,
      "text": "Then I said, 'Ah, Lord GOD! Behold, I do not know how to speak, for I am only a youth.'",
      "links": "<a href='/AIV/2/4/10'>Ex. 4:10</a>; <a href='/AIV/7/6/15'>Judg. 6:15</a>",
      "comment": "Jeremiah’s reluctance mirrors that of other biblical leaders, whose perceived inadequacy allows God’s power to be displayed more clearly."
    },
    {
      "pk": 5930126,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 7,
      "text": "But the LORD said to me, 'Do not say, “I am only a youth”; for to all to whom I send you, you shall go, and whatever I command you, you shall speak.'",
      "links": "<a href='/AIV/24/7/27'>Jer. 7:27</a>; <a href='/AIV/40/10/19-20'>Matt. 10:19–20</a>",
      "comment": "God’s call and authority transcend human limitations, echoing later teachings where God equips those He sends."
    },
    {
      "pk": 5930127,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 8,
      "text": "'Do not be afraid of them, for I am with you to deliver you,' declares the LORD.",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>; <a href='/AIV/42/21/15'>Luke 21:15</a>",
      "comment": "God’s promise of His abiding presence prefigures the way God equips His servants for His mission, similar to His assurance to leaders and apostles."
    },
    {
      "pk": 5930128,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 9,
      "text": "Then the LORD stretched out His hand and touched my mouth and said to me, 'Behold, I have put my words in your mouth.'",
      "links": "<a href='/AIV/2/4/12'>Ex. 4:12</a>; <a href='/AIV/23/6/7'>Isa. 6:7</a>",
      "comment": "The act of touching Jeremiah’s mouth signifies the conferral of authority and purity to speak divine truth. This gesture is reminiscent of similar commissions, showing how God makes His chosen instrument worthy."
    },
    {
      "pk": 5930129,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 10,
      "text": "See, I have set you this day over nations and kingdoms, to uproot and to tear down, to destroy and to overthrow, to build and to plant.'",
      "links": "<a href='/AIV/24/18/7-9'>Jer. 18:7–9</a>; <a href='/AIV/47/10/4-5'>2 Cor. 10:4–5</a>",
      "comment": "Jeremiah’s prophetic office is both destructive and constructive—a theme continued by Christ, who both fulfills and renews the old covenant."
    },
    {
      "pk": 5930130,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 11,
      "text": "And the word of the LORD came to me, saying, 'Jeremiah, what do you see?' And I said, 'I see the branch of an almond tree.'",
      "links": "<a href='/AIV/24/1/12'>Jer. 1:12</a>; <a href='/AIV/4/17/8'>Num. 17:8</a>",
      "comment": "The almond branch ('shaqed' in Hebrew) sounds like 'watching' or 'watchful,' symbolizing God’s vigilance over His word."
    },
    {
      "pk": 5930131,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 12,
      "text": "Then the LORD said to me, 'You have seen well, for I am watching over my word to perform it.'",
      "links": "<a href='/AIV/24/31/28'>Jer. 31:28</a>",
      "comment": "God’s assurance of faithfulness in fulfilling His promises is a recurring biblical theme, culminating in the New Covenant."
    },
    {
      "pk": 5930132,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 13,
      "text": "The word of the LORD came to me a second time, saying, 'What do you see?' And I said, 'I see a boiling pot, tipping away from the north.'",
      "links": "<a href='/AIV/24/4/6'>Jer. 4:6</a>; <a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "The boiling pot signals coming judgment from the north, linked to the Babylonian invasion—a warning of the consequences of covenant unfaithfulness."
    },
    {
      "pk": 5930133,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 14,
      "text": "Then the LORD said to me, 'Out of the north disaster will be unleashed upon all the inhabitants of the land.'",
      "links": "<a href='/AIV/24/25/9'>Jer. 25:9</a>; <a href='/AIV/24/10/22'>Jer. 10:22</a>",
      "comment": "Through Jeremiah, God reveals imminent judgment, affirming that warnings are always issued before divine chastisement."
    },
    {
      "pk": 5930134,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 15,
      "text": "'For behold, I am calling all the tribes of the kingdoms of the north,' declares the LORD. 'They shall come, and each will set his throne at the entrance of the gates of Jerusalem, against all its walls all around and against all the cities of Judah.'",
      "links": "<a href='/AIV/24/4/16-17'>Jer. 4:16–17</a>; <a href='/AIV/24/39/3'>Jer. 39:3</a>",
      "comment": "The occupying forces symbolize God’s use of history’s actors as instruments of His will, signaling both justice and an opportunity for repentance."
    },
    {
      "pk": 5930135,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 16,
      "text": "'I will pronounce my judgments against them for all their evil in forsaking me, in burning incense to other gods, and in worshiping the works of their own hands.'",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/2/20/3-5'>Ex. 20:3–5</a>",
      "comment": "Idolatry is at the root of judgment. The gravity of worship and right order before God anticipates spiritual renewal brought elsewhere by the Messiah."
    },
    {
      "pk": 5930136,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 17,
      "text": "But you, dress yourself for work; arise, and say to them everything that I command you. Do not be dismayed by them, or I will dismay you before them.",
      "links": "<a href='/AIV/24/15/19'>Jer. 15:19</a>; <a href='/AIV/24/26/2'>Jer. 26:2</a>",
      "comment": "The prophet must be prepared—both spiritually and morally—to faithfully deliver God’s message, ensuring total obedience, a principle reflected in Christ and the apostles."
    },
    {
      "pk": 5930137,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 18,
      "text": "For behold, I have made you today a fortified city, an iron pillar, and bronze walls, against the whole land—against the kings of Judah, its officials, its priests, and the people of the land.",
      "links": "<a href='/AIV/24/15/20'>Jer. 15:20</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Jeremiah’s unique role makes him a visible sign of steadfastness and faith in the midst of opposition—a prefigurement of the resilience of God's chosen leaders throughout biblical history."
    },
    {
      "pk": 5930138,
      "translation": "AIV",
      "book": 24,
      "chapter": 1,
      "verse": 19,
      "text": "They will fight against you, but they shall not overcome you, for I am with you, declares the LORD, to deliver you.'",
      "links": "<a href='/AIV/24/15/20'>Jer. 15:20</a>; <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "God promises victorious perseverance in the face of opposition, reflecting the ultimate assurance that those sent by God—especially those serving His word and sacraments—will be protected by His presence."
    }
  ],
  "translatedAt": "2025-12-23T06:15:09.293Z"
}