{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 26,
  "verses": [
    {
      "pk": 30026001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 1,
      "text": "In the beginning of the reign of Jehoiakim son of Josiah, king of Judah, this word came from the LORD:",
      "links": "<a href='/AIV/12/23/36'>2 Kgs. 23:36</a>; <a href='/AIV/24/1/3'>Jer. 1:3</a>",
      "comment": "Historical context roots this prophecy at the start of Jehoiakim’s reign, marking a critical moment for Judah’s fate."
    },
    {
      "pk": 30026002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 2,
      "text": "\"Thus says the LORD: Stand in the court of the LORD’s house and speak to all the cities of Judah coming to worship in the LORD’s house. Speak to them all the words I command you; do not leave out a single word.",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>; <a href='/AIV/24/11/6'>Jer. 11:6</a>",
      "comment": "Jeremiah is told to proclaim God’s full message to all worshippers, reflecting the prophet’s role as mediator of divine truth."
    },
    {
      "pk": 30026003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 3,
      "text": "Perhaps they will listen and turn each from his evil way, so that I may relent from the disaster I intend to bring on them because of their evil deeds.",
      "links": "<a href='/AIV/24/18/8'>Jer. 18:8</a>; <a href='/AIV/23/55/7'>Isa. 55:7</a>",
      "comment": "This shows God’s mercy is available if the people repent, a recurrent biblical theme pointing to ongoing divine patience towards sinners."
    },
    {
      "pk": 30026004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 4,
      "text": "You shall say to them, 'Thus says the LORD: If you will not listen to Me, to walk according to My law which I have set before you,",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>; <a href='/AIV/05/11/26-28'>Deut. 11:26-28</a>",
      "comment": "Obedience to God’s revealed law is the sign of true worship; a key principle for faithful living throughout salvation history."
    },
    {
      "pk": 30026005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 5,
      "text": "and to heed the words of My servants the prophets, whom I have sent to you again and again, but you have not listened,",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>; <a href='/AIV/16/9/30'>Neh. 9:30</a>",
      "comment": "God’s repeated sending of prophets stresses the continuity of divine revelation and accountability (see Heb. 1:1)."
    },
    {
      "pk": 30026006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 6,
      "text": "then I will make this house like Shiloh, and this city a curse to all the nations of the earth.'\"",
      "links": "<a href='/AIV/09/4/12'>1 Sam. 4:12</a>; <a href='/AIV/24/7/12-14'>Jer. 7:12-14</a>",
      "comment": "Shiloh, once the site of God’s presence, was abandoned due to Israel’s sin. The temple in Jerusalem risks the same fate, emphasizing God’s holiness."
    },
    {
      "pk": 30026007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 7,
      "text": "The priests, the prophets, and all the people heard Jeremiah speaking these words in the house of the LORD.",
      "links": "<a href='/AIV/24/5/31'>Jer. 5:31</a>; <a href='/AIV/40/21/12-13'>Matt. 21:12-13</a>",
      "comment": "The message directly confronts religious and civic leaders, foreshadowing later disputes between true prophet and authorities."
    },
    {
      "pk": 30026008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 8,
      "text": "But when Jeremiah finished speaking all that the LORD had commanded him to speak to all the people, the priests and prophets and all the people seized him, saying, \"You shall surely die!\"",
      "links": "<a href='/AIV/24/11/21'>Jer. 11:21</a>; <a href='/AIV/40/26/3-5'>Matt. 26:3-5</a>",
      "comment": "Jeremiah faces threats after a bold proclamation, anticipating how true messengers often suffer persecution (cf. Matt. 5:12)."
    },
    {
      "pk": 30026009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 9,
      "text": "\"Why have you prophesied in the name of the LORD, saying, 'This house shall be like Shiloh, and this city will be desolate, without inhabitant'?\" And all the people gathered against Jeremiah in the house of the LORD.",
      "links": "<a href='/AIV/24/18/11'>Jer. 18:11</a>; <a href='/AIV/43/2/19-20'>John 2:19-20</a>",
      "comment": "Religious authorities accuse Jeremiah of blasphemy—paralleling Jesus’ temple prediction and reaction by the leaders (John 2:19-20)."
    },
    {
      "pk": 30026010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 10,
      "text": "When the officials of Judah heard these things, they came up from the king’s house to the house of the LORD and sat in the entrance of the New Gate of the LORD’s house.",
      "links": "<a href='/AIV/24/36/10'>Jer. 36:10</a>",
      "comment": "The judicial leaders assemble at the temple gate, highlighting the gravity of the accusation and the central role of temple authority."
    },
    {
      "pk": 30026011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 11,
      "text": "Then the priests and the prophets said to the officials and all the people, \"This man deserves death, for he has prophesied against this city, as you have heard with your own ears.\"",
      "links": "<a href='/AIV/05/18/20'>Deut. 18:20</a>; <a href='/AIV/41/14/64'>Mark 14:64</a>",
      "comment": "Invoking Deuteronomy 18:20, the authorities believe Jeremiah is a false prophet deserving death, calling to mind charges brought against Jesus."
    },
    {
      "pk": 30026012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 12,
      "text": "But Jeremiah spoke to all the officials and all the people, saying, \"The LORD sent me to prophesy against this house and this city all the words you have heard.",
      "links": "<a href='/AIV/24/7/12'>Jer. 7:12</a>",
      "comment": "Boldly, Jeremiah testifies to his divine commission despite the danger, showing a submission to God over human authority."
    },
    {
      "pk": 30026013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 13,
      "text": "\"Now, therefore, amend your ways and your deeds, and obey the voice of the LORD your God, and the LORD will relent from the disaster that He has pronounced against you.",
      "links": "<a href='/AIV/24/18/7-8'>Jer. 18:7-8</a>; <a href='/AIV/40/3/8'>Matt. 3:8</a>",
      "comment": "Repentance and fruit in action are necessary for avoiding judgment. This call to conversion echoes throughout all revelation."
    },
    {
      "pk": 30026014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 14,
      "text": "\"But as for me, here I am in your hands. Do with me as seems good and right to you.",
      "links": "<a href='/AIV/24/38/5'>Jer. 38:5</a>; <a href='/AIV/42/22/42'>Luke 22:42</a>",
      "comment": "Jeremiah’s surrender reflects deep trust in God and echoes the submission of Christ before His Passion."
    },
    {
      "pk": 30026015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 15,
      "text": "\"But know for certain that if you put me to death, you will bring innocent blood on yourselves, on this city, and on its inhabitants. For truly the LORD sent me to you to speak all these words in your hearing.\"",
      "links": "<a href='/AIV/24/37/18-20'>Jer. 37:18-20</a>; <a href='/AIV/40/27/24'>Matt. 27:24</a>",
      "comment": "Warning against shedding innocent blood foreshadows the unjust killing of prophets and ultimately the righteous one (see Matt. 27:24)."
    },
    {
      "pk": 30026016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 16,
      "text": "Then the officials and all the people said to the priests and the prophets, \"This man does not deserve death, for he has spoken to us in the name of the LORD our God.\"",
      "links": "<a href='/AIV/44/5/39'>Acts 5:39</a>",
      "comment": "The people and leaders discern a true prophetic mission, a moment of prudence guided by reverence for God’s name."
    },
    {
      "pk": 30026017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 17,
      "text": "And some of the elders of the land stood up and spoke to all the assembly of the people, saying:",
      "links": "<a href='/AIV/44/5/34'>Acts 5:34</a>",
      "comment": "Elders’ wisdom and tradition play a vital role in guiding the community—a sign of continuity in the faith."
    },
    {
      "pk": 30026018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 18,
      "text": "\"Micah of Moresheth prophesied in the days of Hezekiah king of Judah and said to all the people of Judah: 'Thus says the LORD of Hosts, Zion shall be plowed as a field; Jerusalem shall become a heap of ruins, and the temple mount a wooded height.'\"",
      "links": "<a href='/AIV/33/3/12'>Mic. 3:12</a>",
      "comment": "The quotation from Micah shows continuity in prophecy and the importance of recognizing God’s historical warnings."
    },
    {
      "pk": 30026019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 19,
      "text": "\"Did Hezekiah king of Judah and all Judah put him to death? Did he not fear the LORD and seek the LORD’s favor, and did not the LORD relent of the disaster He had pronounced against them? But we are about to bring great harm on ourselves.\"",
      "links": "<a href='/AIV/12/19/36'>2 Kgs. 19:36</a>; <a href='/AIV/24/26/13'>Jer. 26:13</a>",
      "comment": "True prophets’ words, when received with humility, lead to healing and mercy. Rejection of God’s messenger brings judgment."
    },
    {
      "pk": 30026020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 20,
      "text": "There was also a man who prophesied in the name of the LORD, Uriah son of Shemaiah from Kiriath-jearim. He prophesied against this city and against this land in words similar to those of Jeremiah.",
      "links": "<a href='/AIV/06/18/28'>Josh. 18:28</a>",
      "comment": "Uriah’s appearance substantiates the continuity of God’s warning and the unity of prophetic voices."
    },
    {
      "pk": 30026021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 21,
      "text": "When King Jehoiakim and all his warriors and officials heard Uriah’s words, the king sought to put him to death. But when Uriah heard of it, he fled in fear to Egypt.",
      "links": "<a href='/AIV/24/43/7'>Jer. 43:7</a>",
      "comment": "Persecution of God’s prophet again mirrors how rulers reject divine correction, as seen throughout salvation history."
    },
    {
      "pk": 30026022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 22,
      "text": "Then King Jehoiakim sent men to Egypt—Elnathan son of Achbor and others with him—and they brought Uriah back from Egypt to King Jehoiakim.",
      "links": "<a href='/AIV/12/22/12'>2 Kgs. 22:12</a>",
      "comment": "Egypt, often a place of refuge for God’s people, can become a place of danger; echoes in the life of Christ as a child (Matt. 2:13)."
    },
    {
      "pk": 30026023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 23,
      "text": "They brought Uriah out of Egypt and took him to King Jehoiakim, who had him struck down with the sword and cast his body into the burial place of the common people.",
      "links": "<a href='/AIV/24/14/16'>Jer. 14:16</a>; <a href='/AIV/40/27/7'>Matt. 27:7</a>",
      "comment": "Uriah’s martyrdom foreshadows persecution of God’s messengers and the suffering of Christ, who was counted among transgressors."
    },
    {
      "pk": 30026024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 26,
      "verse": 24,
      "text": "But Ahikam son of Shaphan protected Jeremiah, so that he was not handed over to the people to be put to death.",
      "links": "<a href='/AIV/24/39/14'>Jer. 39:14</a>; <a href='/AIV/24/36/19'>Jer. 36:19</a>",
      "comment": "God provides protection for His prophet through human agents, hinting at how divine providence can work through faithful individuals (see Acts 23:16-24)."
    }
  ],
  "translatedAt": "2025-12-24T08:35:39.592Z"
}