{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 9,
  "verses": [
    {
      "pk": 30009001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 1,
      "text": "Oh, that my head were water, and my eyes a fountain of tears, so I could weep day and night for the slain of the daughter of my people!",
      "links": "<a href='/AIV/25/1/16'>Lam. 1:16</a>; <a href='/AIV/19/119/136'>Ps. 119:136</a>",
      "comment": "Jeremiah expresses deep sorrow and compassion for his people, prefiguring the sorrow Christ would have over Jerusalem (Luke 19:41)."
    },
    {
      "pk": 30009002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 2,
      "text": "If only I had in the wilderness a lodging place for travelers, so I might leave my people and depart from them! For they are all adulterers, a band of treacherous men.",
      "links": "<a href='/AIV/19/55/6'>Ps. 55:6</a>; <a href='/AIV/23/1/21'>Isa. 1:21</a>",
      "comment": "Jeremiah desires separation due to Israel's unfaithfulness. Adultery here refers to spiritual betrayal, a theme found throughout the prophets."
    },
    {
      "pk": 30009003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 3,
      "text": "They bend their tongues like bows for lies. They grow strong in the land for what is not true; for they go from evil to evil, and they do not know Me, declares the LORD.",
      "links": "<a href='/AIV/19/64/3'>Ps. 64:3</a>; <a href='/AIV/24/5/4'>Jer. 5:4</a>; <a href='/AIV/43/8/44'>John 8:44</a>",
      "comment": "Here deceit is compared to a weapon, pointing towards the seriousness of sin and estrangement from God—a key theme in the call to conversion and deeper communion with God."
    },
    {
      "pk": 30009004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 4,
      "text": "Let everyone beware of his neighbor, and put no trust in any brother. For every brother is a deceiver, and every neighbor goes about with slander.",
      "links": "<a href='/AIV/33/7/5'>Mic. 7:5</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Sin has corrupted relationships, echoing how human brokenness affects society and prefigures the need for reconciliation."
    },
    {
      "pk": 30009005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 5,
      "text": "Everyone deceives his neighbor, and no one speaks the truth. They have taught their tongue to speak lies; they weary themselves committing iniquity.",
      "links": "<a href='/AIV/19/52/2-4'>Ps. 52:2-4</a>; <a href='/AIV/45/3/13'>Rom. 3:13</a>",
      "comment": "The prevalence of lies points to the fallen nature of humanity. Paul picks up this theme in Romans as evidence of universal sinfulness."
    },
    {
      "pk": 30009006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 6,
      "text": "You live in the midst of deceit; in their deceit they refuse to know Me, declares the LORD.",
      "links": "<a href='/AIV/24/5/27-28'>Jer. 5:27-28</a>",
      "comment": "Knowing God is more than mere information—it requires ongoing relationship. The heart must be rightly disposed toward truth and grace."
    },
    {
      "pk": 30009007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 7,
      "text": "Therefore, thus says the LORD of hosts: Behold, I will refine them and test them, for what else can I do because of the daughter of My people?",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/24/6/27-30'>Jer. 6:27-30</a>",
      "comment": "God is presented as a refiner, purifying His people from sin. The idea of testing and refining points toward sanctification and the necessity of transformation."
    },
    {
      "pk": 30009008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 8,
      "text": "Their tongue is a deadly arrow; it speaks deceit. With their mouth they speak peace to their neighbor, but in their heart they lay an ambush.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/24/12/6'>Jer. 12:6</a>",
      "comment": "Hypocrisy and betrayal echo Jesus' rebukes to the Pharisees (Matthew 23) and foreshadow the call for integrity both in word and deed."
    },
    {
      "pk": 30009009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 9,
      "text": "Should I not punish them for these things? declares the LORD. Should I not avenge Myself on a nation such as this?",
      "links": "<a href='/AIV/24/5/29'>Jer. 5:29</a>; <a href='/AIV/19/94/1'>Ps. 94:1</a>",
      "comment": "Divine justice protects and upholds righteousness. God's patience has limits when faced with persistent wickedness."
    },
    {
      "pk": 30009010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 10,
      "text": "I will weep and wail for the mountains, and take up a lament for the wilderness pastures. They are burned up so that no one passes through; the lowing of cattle is not heard. Both the birds of the heavens and the beasts have fled and are gone.",
      "links": "<a href='/AIV/24/12/4'>Jer. 12:4</a>; <a href='/AIV/26/6/6'>Ezek. 6:6</a>",
      "comment": "Creation suffers alongside humanity. The curse on the land from human sin points to the spiritual and physical consequences of estrangement from God."
    },
    {
      "pk": 30009011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 11,
      "text": "I will make Jerusalem a heap of ruins, a haunt for jackals; and the cities of Judah I will make desolate, without inhabitant.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>; <a href='/AIV/24/26/18'>Jer. 26:18</a>",
      "comment": "Judgment leads to destruction of all that was precious. Jesus would later lament over Jerusalem in a similar manner (Luke 13:34)."
    },
    {
      "pk": 30009012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 12,
      "text": "Who is wise enough to understand this? Who has been instructed by the LORD, so they may explain it? Why is the land ruined and laid waste like a desert, so that no one passes through?",
      "links": "<a href='/AIV/19/107/43'>Ps. 107:43</a>; <a href='/AIV/30/3/7'>Amos 3:7</a>",
      "comment": "The prophets and teachers are called to discern and communicate spiritual truths, a role of ongoing apostolic tradition and teaching."
    },
    {
      "pk": 30009013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 13,
      "text": "And the LORD says, 'Because they have forsaken My law which I set before them, and have not obeyed My voice or walked according to it,'",
      "links": "<a href='/AIV/19/119/53'>Ps. 119:53</a>; <a href='/AIV/24/16/11'>Jer. 16:11</a>",
      "comment": "Sin and judgment result from abandoning God's law—a central theme throughout scripture. Faithfulness to God's commandments reflects true discipleship."
    },
    {
      "pk": 30009014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 14,
      "text": "'but have walked after the stubbornness of their own hearts, and after the Baals, as their ancestors taught them.'",
      "links": "<a href='/AIV/19/81/12'>Ps. 81:12</a>; <a href='/AIV/07/2/13'>Judg. 2:13</a>",
      "comment": "Idolatry and following sinful desires lead away from God's truth. The reference to ancestors highlights the importance of tradition rightly formed under God."
    },
    {
      "pk": 30009015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 15,
      "text": "Therefore, thus says the LORD of hosts, the God of Israel: 'Behold, I will feed them, this people, with wormwood and give them poisoned water to drink.'",
      "links": "<a href='/AIV/24/8/14'>Jer. 8:14</a>; <a href='/AIV/24/23/15'>Jer. 23:15</a>",
      "comment": "Bitter judgment is the consequence of forsaking God's covenant, mirroring later Biblical warnings about spiritual poison (Revelation 8:11)."
    },
    {
      "pk": 30009016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 16,
      "text": "'I will scatter them among nations that neither they nor their ancestors have known, and I will send the sword after them until I have finished them.'",
      "links": "<a href='/AIV/05/28/64'>Deut. 28:64</a>; <a href='/AIV/26/12/15'>Ezek. 12:15</a>",
      "comment": "Exile as a judgment underscores both God's justice and His intent for later restoration, laying groundwork for the return and promises fulfilled in Christ."
    },
    {
      "pk": 30009017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 17,
      "text": "Thus says the LORD of hosts: 'Consider, and call forth the mourning women to come; send for the skillful women to come.'",
      "links": "<a href='/AIV/10/14/2'>2 Sam. 14:2</a>; <a href='/AIV/40/5/4'>Matt. 5:4</a>",
      "comment": "Professional mourners symbolize communal grief. The beatitude 'Blessed are those who mourn' (Matt. 5:4) echoes the spiritual value of true contrition."
    },
    {
      "pk": 30009018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 18,
      "text": "'Let them hurry and raise a lament for us, so our eyes may run with tears and our eyelids flow with water.'",
      "links": "<a href='/AIV/25/2/18'>Lam. 2:18</a>; <a href='/AIV/24/13/17'>Jer. 13:17</a>",
      "comment": "Tears and lamentation are appropriate responses to communal and personal sin, preparing the heart for authentic conversion and mercy."
    },
    {
      "pk": 30009019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 19,
      "text": "For the sound of lamentation is heard from Zion, 'How we are ruined! We are greatly ashamed because we have left the land, because they have cast down our dwellings.'",
      "links": "<a href='/AIV/25/1/4'>Lam. 1:4</a>; <a href='/AIV/24/4/20'>Jer. 4:20</a>",
      "comment": "Loss and shame are recognized—true spiritual progress begins with acknowledging our spiritual poverty."
    },
    {
      "pk": 30009020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 20,
      "text": "Hear, O women, the word of the LORD; let your ear receive the word of His mouth. Teach your daughters a wailing, and every neighbor a lament.",
      "links": "<a href='/AIV/24/6/2'>Jer. 6:2</a>; <a href='/AIV/44/16/13-14'>Acts 16:13-14</a>",
      "comment": "Women are charged with transmitting communal memory and spiritual truth—an illustration of the spiritual role of family and tradition."
    },
    {
      "pk": 30009021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 21,
      "text": "Death has come up through our windows and has entered our palaces, to cut off children from outside and young men from the streets.",
      "links": "<a href='/AIV/24/13/21'>Jer. 13:21</a>; <a href='/AIV/24/6/11'>Jer. 6:11</a>",
      "comment": "Death is portrayed as pervasive and indiscriminate—a consequence of sin that only true deliverance can reverse (cf. 1 Cor. 15:26)."
    },
    {
      "pk": 30009022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 22,
      "text": "Say, 'Thus declares the LORD: The dead bodies of people shall fall like dung on the open field, like sheaves after the reaper, and none shall gather them.'",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "The imagery is stark, emphasizing the severity of judgment, but also the need for true hope in resurrection and redemption."
    },
    {
      "pk": 30009023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 23,
      "text": "Thus says the LORD: 'Let not the wise glory in his wisdom, nor the mighty glory in his might, nor the rich glory in his riches;'",
      "links": "<a href='/AIV/19/49/6-7'>Ps. 49:6-7</a>; <a href='/AIV/46/1/26-31'>1 Cor. 1:26-31</a>",
      "comment": "True boast is found not in human strength or achievements, but in the Lord. Paul echoes this as a call to humility and grace."
    },
    {
      "pk": 30009024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 24,
      "text": "'But let the one who boasts boast in this: that he understands and knows Me, that I am the LORD who exercises steadfast love, justice, and righteousness in the earth; for in these I delight, declares the LORD.'",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "God desires that we know Him deeply—not only in intellect, but by living out love and righteousness. Perfectly fulfilled in Christ, who embodies these qualities."
    },
    {
      "pk": 30009025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 25,
      "text": "Behold, the days are coming, declares the LORD, when I will punish all who are circumcised merely in the flesh—",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>",
      "comment": "External signs must be joined to true conversion of heart. Paul develops this theme regarding circumcision of the heart in Romans."
    },
    {
      "pk": 30009026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 9,
      "verse": 26,
      "text": "Egypt, Judah, Edom, the sons of Ammon, Moab, and all who dwell in the wilderness who cut the corners of their hair—for all these nations are uncircumcised, and all the house of Israel are uncircumcised in heart.",
      "links": "<a href='/AIV/03/19/27'>Lev. 19:27</a>; <a href='/AIV/24/4/4'>Jer. 4:4</a>",
      "comment": "God calls not just for outward religious observance, but for transformation of the inner person—a foundational principle for authentic spirituality. Spiritual circumcision prefigures the new heart and Spirit given in Christ (Ezekiel 36:26-27)."
    }
  ],
  "translatedAt": "2025-12-24T08:26:21.123Z"
}