{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 38,
  "verses": [
    {
      "pk": 2413801,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 1,
      "text": "Now Shephatiah the son of Mattan, Gedaliah the son of Pashhur, Jucal the son of Shelemiah, and Pashhur the son of Malchijah heard the words that Jeremiah spoke to all the people, saying,",
      "links": "<a href='/AIV/24/37/3'>Jer. 37:3–6</a>; <a href='/AIV/24/21/1-9'>Jer. 21:1–9</a>",
      "comment": "The prominent leaders hear Jeremiah's prophetic message, setting the stage for conflict. These men were officials opposed to Jeremiah's warnings."
    },
    {
      "pk": 2413802,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 2,
      "text": "Thus says the LORD: 'Whoever remains in this city will die by the sword, by famine, and by disease; but whoever goes out to the Chaldeans will live. He will have his life as a prize, and he will live.'",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>; <a href='/AIV/24/34/4-5'>Jer. 34:4–5</a>",
      "comment": "Jeremiah repeats God's command to surrender for survival. This principle of obedience to God's will, even when difficult, echoes Jesus' teaching on losing life to gain it (Matt. 16:25)."
    },
    {
      "pk": 2413803,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 3,
      "text": "'Thus says the LORD: This city will surely be given into the hand of the army of the king of Babylon, and he will capture it.'",
      "links": "<a href='/AIV/24/32/28'>Jer. 32:28</a>; <a href='/AIV/24/34/2'>Jer. 34:2</a>",
      "comment": "God decrees Jerusalem's fate, making clear that resistance is futile. Fulfillment of this prophecy confirms God's sovereignty over history."
    },
    {
      "pk": 2413804,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 4,
      "text": "Then the officials said to the king, 'Let this man be put to death! For by speaking such words to those who remain in the city, he is weakening the hands of the soldiers and all the people. He does not seek the welfare of this people, but their harm.'",
      "links": "<a href='/AIV/24/26/8-11'>Jer. 26:8–11</a>",
      "comment": "Jeremiah accused of treason. The prophet's suffering prefigures Christ's own rejection by leaders (Luke 23:1–2), illustrating the cost of bearing God's message."
    },
    {
      "pk": 2413805,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 5,
      "text": "King Zedekiah said, 'Behold, he is in your hands; for the king can do nothing against you.'",
      "links": "<a href='/AIV/24/37/17-21'>Jer. 37:17–21</a>",
      "comment": "Zedekiah's weakness and indecision anticipate Pilate's later surrender of Jesus out of political pressure (John 19:12–16), highlighting man's tendency to compromise truth for expediency."
    },
    {
      "pk": 2413806,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 6,
      "text": "So they took Jeremiah and cast him into the cistern of Malchijah, the king's son, which was in the court of the guard. They let Jeremiah down by ropes. There was no water in the cistern, but only mud, and Jeremiah sank in the mud.",
      "links": "<a href='/AIV/24/37/16'>Jer. 37:16</a>; <a href='/AIV/19/69/2'>Ps. 69:2</a>",
      "comment": "Jeremiah suffers in the pit; a foreshadowing of the suffering servant motif and, symbolically, the descent into death. Psalm 69 connects mud and suffering with righteous affliction."
    },
    {
      "pk": 2413807,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 7,
      "text": "But Ebed-melech, a Cushite, an official in the king's house, heard that Jeremiah had been put into the cistern. The king was sitting at the Benjamin Gate at that time.",
      "links": "<a href='/AIV/24/39/15-18'>Jer. 39:15–18</a>",
      "comment": "Ebed-melech, a foreigner, shows compassion and acts to save Jeremiah. One sees here God's concern for righteousness, not ethnicity, and a foreshadowing of God working through unexpected instruments."
    },
    {
      "pk": 2413808,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 8,
      "text": "Ebed-melech went from the king's house and said to the king:",
      "links": "<a href='/AIV/24/36/12'>Jer. 36:12</a>",
      "comment": "Ebed-melech appeals to the king, displaying courage and concern for the prophet of God."
    },
    {
      "pk": 2413809,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 9,
      "text": "'My lord the king, these men have done evil in all they have done to Jeremiah the prophet. They have cast him into the cistern, and he will die there of hunger, for there is no bread left in the city.'",
      "links": "<a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "Ebed-melech pleads for justice, highlighting God's expectation for care of his servants, and foreshadows later church Fathers defending truth against injustice."
    },
    {
      "pk": 2413810,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 10,
      "text": "Then the king commanded Ebed-melech the Cushite, 'Take thirty men with you from here, and lift Jeremiah the prophet out of the cistern before he dies.'",
      "links": "<a href='/AIV/24/39/15-18'>Jer. 39:15–18</a>",
      "comment": "Zedekiah orders Jeremiah's rescue, recognizing the prophet’s special role. This indirectly affirms the necessity of prophetic voices in God's economy."
    },
    {
      "pk": 2413811,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 11,
      "text": "So Ebed-melech took the men with him, and went to the king's house, to a room under the treasury, and took old rags and worn-out clothes, and let them down by ropes into the cistern to Jeremiah.",
      "links": "<a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "Ebed-melech’s careful action demonstrates charity and respect for Jeremiah, reflecting the principle of loving service to those who suffer."
    },
    {
      "pk": 2413812,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 12,
      "text": "And Ebed-melech the Cushite said to Jeremiah, 'Put the rags and clothes under your armpits beneath the ropes.' And Jeremiah did so.",
      "links": "<a href='/AIV/24/39/18'>Jer. 39:18</a>",
      "comment": "The rescue combines practical wisdom and compassion, a small but significant act of mercy, reminiscent of the Good Samaritan (Luke 10:33–34)."
    },
    {
      "pk": 2413813,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 13,
      "text": "So they drew Jeremiah up with ropes and lifted him out of the cistern, and Jeremiah remained in the court of the guard.",
      "links": "<a href='/AIV/24/32/2'>Jer. 32:2</a>",
      "comment": "Jeremiah’s deliverance highlights God's providential care for His prophets, akin to Daniel from the lions' den (Dan. 6:23)."
    },
    {
      "pk": 2413814,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 14,
      "text": "Then King Zedekiah sent for Jeremiah the prophet and brought him to the third entrance of the LORD’s temple. The king said to Jeremiah, 'I will ask you something; hide nothing from me.'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "The king's secret meeting with the prophet indicates recognition of Jeremiah’s divine authority."
    },
    {
      "pk": 2413815,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 15,
      "text": "Jeremiah said to Zedekiah, 'If I tell you, will you not surely put me to death? And if I give you counsel, you will not listen to me.'",
      "links": "<a href='/AIV/19/69/20'>Ps. 69:20</a>; <a href='/AIV/24/26/15'>Jer. 26:15</a>",
      "comment": "Jeremiah expects opposition and danger; his ministry typifies the persistent suffering endured by messengers of God throughout salvation history."
    },
    {
      "pk": 2413816,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 16,
      "text": "King Zedekiah swore secretly to Jeremiah, saying, 'As the LORD lives, who gave us our lives, I will not put you to death nor deliver you into the hand of these men who seek your life.'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Zedekiah’s oath in God’s name affirms the seriousness of his secret, but also contrasts his lack of resolve with the courage of God’s prophets."
    },
    {
      "pk": 2413817,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 17,
      "text": "Then Jeremiah said to Zedekiah, 'This is what the LORD, the God of Hosts, the God of Israel, says: If you surrender to the officials of the king of Babylon, then your life will be spared, and this city will not be burned; you and your family shall live.'",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>; <a href='/AIV/24/32/29'>Jer. 32:29</a>",
      "comment": "Jeremiah insists on obedience to God’s plan for salvation. This difficult path mirrors the spiritual theme of surrendering our will for God’s."
    },
    {
      "pk": 2413818,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 18,
      "text": "'But if you do not surrender to the officials of the king of Babylon, this city will be given into the hand of the Chaldeans, and they will burn it with fire, and you shall not escape from their hand.'",
      "links": "<a href='/AIV/24/32/29'>Jer. 32:29</a>",
      "comment": "God presents two choices, blessing or curse, obedience or destruction—a pattern seen repeatedly in Biblical covenant theology (Deut. 30:19)."
    },
    {
      "pk": 2413819,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 19,
      "text": "King Zedekiah said to Jeremiah, 'I am afraid of the Judeans who have gone over to the Chaldeans, lest I be handed over to them and they abuse me.'",
      "links": "<a href='/AIV/24/37/2'>Jer. 37:2</a>",
      "comment": "Fear leads Zedekiah away from obedience, a recurring barrier to faithfulness. This is contrasted with later leaders who obey even at personal risk."
    },
    {
      "pk": 2413820,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 20,
      "text": "Jeremiah said, 'You will not be given to them. Obey the LORD in what I am telling you, and all will go well with you, and your life will be spared.'",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>",
      "comment": "Assurance is offered for obedience, requiring faith—a theme taken up in the New Testament regarding trusting God's promises (Rom. 8:28)."
    },
    {
      "pk": 2413821,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 21,
      "text": "But if you refuse to surrender, this is what the LORD has revealed to me:",
      "links": "<a href='/AIV/24/34/2'>Jer. 34:2</a>",
      "comment": "A solemn warning precedes the vision, reinforcing the prophetic role as both comfort and challenge."
    },
    {
      "pk": 2413822,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 22,
      "text": "'Behold, all the women left in the house of the king of Judah shall be brought out to the officials of the king of Babylon, and they will say, \"Your trusted friends have deceived and prevailed against you; now your feet are sunk in the mud, and they turn away from you.\"'",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>; <a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "The prophetic image of betrayal and suffering in the mud echoes Jeremiah's own experience and points forward to Christ's abandonment (Ps. 69:20)."
    },
    {
      "pk": 2413823,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 23,
      "text": "'All your wives and children shall be led out to the Chaldeans, and you yourself shall not escape from their hand but shall be seized by the king of Babylon, and this city shall be burned with fire.'",
      "links": "<a href='/AIV/24/32/29'>Jer. 32:29</a>",
      "comment": "Consequence for disobedience is loss and exile, a motif this chapter drives home, and underscores the need for faithful perseverance amid trials."
    },
    {
      "pk": 2413824,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 24,
      "text": "Then Zedekiah said to Jeremiah, 'Let no one know of these words, and you shall not die.'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Zedekiah's secrecy and fear again contrast with Jeremiah's faithfulness, and mirror spiritual leaders who act for appearance instead of conviction."
    },
    {
      "pk": 2413825,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 25,
      "text": "'If the officials hear that I have spoken with you and come to you and say, \"Tell us what you said to the king and what the king said to you; do not hide it from us, and we will not kill you,\"'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Anticipation of interrogation shows the tension between political and divine authority."
    },
    {
      "pk": 2413826,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 26,
      "text": "'then you shall say to them, \"I presented my request before the king that he not send me back to Jonathan’s house to die there.\"'",
      "links": "<a href='/AIV/24/37/20'>Jer. 37:20</a>",
      "comment": "Jeremiah is told to give an evasive answer to preserve his life, reminiscent of Jesus’ own careful responses (John 18:20–21)."
    },
    {
      "pk": 2413827,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 27,
      "text": "Then all the officials came to Jeremiah and questioned him, and he told them just as the king had instructed. So they stopped questioning him, for no one had overheard the conversation.",
      "links": "<a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "Jeremiah maintains discretion, balancing truth and preservation, which is consistent with Biblical prudence under danger."
    },
    {
      "pk": 2413828,
      "translation": "AIV",
      "book": 24,
      "chapter": 38,
      "verse": 28,
      "text": "So Jeremiah remained in the court of the guard until the day Jerusalem was taken. And he was there when Jerusalem was captured.",
      "links": "<a href='/AIV/24/39/14'>Jer. 39:14</a>",
      "comment": "Jeremiah, ever faithful, shares in the suffering of God’s people, pointing toward the necessary patience and endurance that characterizes true discipleship. This echoes the enduring perseverance prescribed for the faithful in times of trial (Rev. 13:10)."
    }
  ],
  "translatedAt": "2025-12-23T06:34:37.048Z"
}