{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 19,
  "verses": [
    {
      "pk": 241901,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 1,
      "text": "This is what the LORD says: Go and buy a clay jar from a potter. Take with you some elders of the people and of the priests,",
      "links": "<a href='/AIV/23/30/14'>Isa. 30:14</a>; <a href='/AIV/24/18/2'>Jer. 18:2</a>",
      "comment": "The inclusion of both elders and priests signals an authoritative testimony to what will follow, showing God's intentions towards all levels of leadership. The theme of the potter recalls chapter 18, underscoring God's sovereignty over His people."
    },
    {
      "pk": 241902,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 2,
      "text": "and go out to the Valley of Hinnom, near the entrance of the Potsherd Gate. Proclaim there the words that I will speak to you:",
      "links": "<a href='/AIV/24/7/31'>Jer. 7:31</a>; <a href='/AIV/06/15/8'>Josh. 15:8</a>",
      "comment": "The Valley of Hinnom is a place associated with idolatrous sacrifice and judgment, later referenced in the New Testament as Gehenna (Matt. 5:22)."
    },
    {
      "pk": 241903,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 3,
      "text": "‘Hear the word of the LORD, kings of Judah and citizens of Jerusalem: This is what the LORD of Hosts, the God of Israel, says: See, I am about to bring such disaster upon this place that whoever hears of it, his ears will tingle.",
      "links": "<a href='/AIV/09/03/11'>1 Sam. 3:11</a>; <a href='/AIV/24/7/34'>Jer. 7:34</a>",
      "comment": "References to tingling ears are a prophetic sign of impending judgment (1 Sam. 3:11); the message is directed at the highest authorities and all the people."
    },
    {
      "pk": 241904,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 4,
      "text": "Because they have abandoned Me and have made this place foreign; they have burned sacrifices in it to other gods, whom neither they nor their fathers nor the kings of Judah ever knew. And they have filled this place with the blood of the innocent.",
      "links": "<a href='/AIV/24/7/6'>Jer. 7:6</a>; <a href='/AIV/05/32/17'>Deut. 32:17</a>",
      "comment": "The abandonment of God and innocent blood hints at deep sin—especially child sacrifice. The covenant is violated through idolatry, prefiguring the need for atonement through a pure and innocent victim."
    },
    {
      "pk": 241905,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 5,
      "text": "They have built high places to Baal to burn their sons in the fire as burnt offerings to Baal—something I never commanded, nor spoke of, nor did it ever come into My mind.",
      "links": "<a href='/AIV/24/32/35'>Jer. 32:35</a>; <a href='/AIV/03/18/21'>Lev. 18:21</a>",
      "comment": "The horror described points to total rebellion against God's law (Lev. 18:21). The abhorrent practice underscores the necessity of continuing moral teaching and sanctification throughout history."
    },
    {
      "pk": 241906,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 6,
      "text": "Therefore, see, the days are coming, declares the LORD, when this place will no longer be called Topheth or the Valley of Hinnom, but the Valley of Slaughter.",
      "links": "<a href='/AIV/24/7/32'>Jer. 7:32</a>",
      "comment": "The rename of the valley signifies the consequences of sin—judgment will turn a place of sacrifice into mass death, a vivid image fulfilled both physically and spiritually."
    },
    {
      "pk": 241907,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 7,
      "text": "I will empty the counsel of Judah and Jerusalem in this place, and I will make them fall by the sword before their enemies and by the hand of those who seek their life. I will give their dead bodies as food to the birds of the air and to the beasts of the earth.",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/05/28/26'>Deut. 28:26</a>",
      "comment": "Judgment will be thorough; even burial rites will be denied, showing total abandonment. The consequences recall curse passages from Deuteronomy (Deut. 28:26)."
    },
    {
      "pk": 241908,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 8,
      "text": "I will make this city a horror and a thing to be hissed at; everyone who passes by will be appalled and will hiss because of all its wounds.",
      "links": "<a href='/AIV/24/18/16'>Jer. 18:16</a>; <a href='/AIV/25/2/15'>Lam. 2:15'</a>",
      "comment": "Public disgrace and horror are part of the covenant curse. In Lamentations this theme is fulfilled post-destruction, hinting toward a restless longing for redemptive hope."
    },
    {
      "pk": 241909,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 9,
      "text": "I will make them eat the flesh of their sons and daughters, and each will eat the flesh of his neighbor during the siege and distress with which their enemies and those who seek their lives afflict them.",
      "links": "<a href='/AIV/05/28/53'>Deut. 28:53</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "Cannibalism is unthinkable, yet predicted in the covenant curses for disobedience. This profound corruption underscores humanity’s need for a savior and calls to mind the reversal found in the true Bread of Life (John 6:53)."
    },
    {
      "pk": 241910,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 10,
      "text": "Then you are to break the jar in the sight of the men who go with you,",
      "links": "<a href='/AIV/24/51/63'>Jer. 51:63'</a>; <a href='/AIV/24/18/4'>Jer. 18:4</a>",
      "comment": "Breaking the jar is a prophetic sign-act: as the jar is shattered irreparably, so will Judah’s fate be if there is no repentance."
    },
    {
      "pk": 241911,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 11,
      "text": "and say to them, ‘This is what the LORD of Hosts says: So will I break this people and this city, as one breaks a potter’s jar, so that it cannot be made whole again. They will bury the dead at Topheth until there is no more room.",
      "links": "<a href='/AIV/24/7/32'>Jer. 7:32</a>; <a href='/AIV/23/30/14'>Isa. 30:14</a>",
      "comment": "The irrevocable destruction is pictured. The impossibility of restoration points to the grave consequences of persistent sin, foreshadowing that restoration must come from outside human effort."
    },
    {
      "pk": 241912,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 12,
      "text": "This is what I will do to this place and to its inhabitants, declares the LORD, making this city like Topheth.",
      "links": "<a href='/AIV/24/7/32'>Jer. 7:32</a>; <a href='/AIV/24/19/13'>Jer. 19:13</a>",
      "comment": "The city’s identification with Topheth, a cursed place, becomes complete. Total condemnation is closely tied to the need for sanctifying grace and intercession."
    },
    {
      "pk": 241913,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 13,
      "text": "The houses of Jerusalem and the houses of the kings of Judah will become impure like the place of Topheth—all the houses where they offered incense to all the heavenly host and poured out drink offerings to other gods.",
      "links": "<a href='/AIV/24/7/18'>Jer. 7:18</a>; <a href='/AIV/12/23/4'>2 Kings 23:4'</a>",
      "comment": "Idolatry brings defilement not just upon the people but also the leaders and their homes. Incense and offerings, properly used for true worship, are perverted here."
    },
    {
      "pk": 241914,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 14,
      "text": "Then Jeremiah came from Topheth, where the LORD had sent him to prophesy, and stood in the court of the LORD’s house, and said to all the people:",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>",
      "comment": "The setting switches from the cursed valley to the temple, symbolizing the call to true worship and repentance. The importance of prophetic teaching through authorized figures is highlighted."
    },
    {
      "pk": 241915,
      "translation": "AIV",
      "book": 24,
      "chapter": 19,
      "verse": 15,
      "text": "‘This is what the LORD of Hosts, the God of Israel, says: See, I am bringing upon this city and all its villages all the disaster that I pronounced against it, because they have stiffened their necks and would not listen to My words.’",
      "links": "<a href='/AIV/24/7/13'>Jer. 7:13</a>; <a href='/AIV/05/31/27'>Deut. 31:27</a>",
      "comment": "Resistance to God's word leads to judgment. The need for humble submission to divinely appointed authority and the fullness of revelation is underscored. The rejection of prophetic words contrasts with later calls to believe the apostolic witness (Luke 10:16)."
    }
  ],
  "translatedAt": "2025-12-23T06:24:07.455Z"
}