{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 15,
  "verses": [
    {
      "pk": 2401501,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 1,
      "text": "Then the LORD said to me: “Though Moses and Samuel stood before Me, My heart would not be favorable to this people. Send them away from My presence, and let them go.",
      "links": "<a href='/AIV/2/32/11-14'>Ex. 32:11-14</a>; <a href='/AIV/9/7/9'>1 Sam. 7:9</a>",
      "comment": "Moses and Samuel are noted intercessors (cf. Exodus 32:11-14, 1 Samuel 7:9-13), but here even their prayers would not avert judgment. The passage shows the seriousness of stubbornness against God."
    },
    {
      "pk": 2401502,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 2,
      "text": "And if they ask you, ‘Where should we go?’ then tell them: ‘Thus says the LORD: ‘Those marked for death, to death; those marked for the sword, to the sword; those marked for famine, to famine; and those marked for captivity, to captivity.’”",
      "links": "<a href='/AIV/24/43/11'>Jer. 43:11</a>; <a href='/AIV/26/5/2'>Ezek. 5:2'</a>",
      "comment": "This verse reveals the inevitability of judgment for persistent rebellion. It echoes themes from Ezekiel and elsewhere in Jeremiah about God's sovereignty over the destinies of men."
    },
    {
      "pk": 2401503,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 3,
      "text": "And I will appoint over them four kinds of destroyers, declares the LORD: the sword to kill, the dogs to drag away, the birds of the air and the beasts of the earth to devour and destroy.",
      "links": "<a href='/AIV/26/14/21'>Ezek. 14:21</a>",
      "comment": "The fourfold judgment (sword, dogs, birds, beasts) parallels the punitive measures found in Ezekiel 14:21. Such descriptions invoke both literal and spiritual lessons about God’s justice."
    },
    {
      "pk": 2401504,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 4,
      "text": "And I will make them a horror to all the kingdoms of the earth because of Manasseh the son of Hezekiah, king of Judah, for what he did in Jerusalem.",
      "links": "<a href='/AIV/12/21/1-16'>2 Kings 21:1-16</a>",
      "comment": "Manasseh’s extreme wickedness is cited as the root cause (see 2 Kings 21:1-16), demonstrating how leadership choices can affect generations following."
    },
    {
      "pk": 2401505,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 5,
      "text": "For who will have pity on you, O Jerusalem, or who will grieve for you? Who will turn aside to ask about your welfare?",
      "links": "<a href='/AIV/25/1/12'>Lam. 1:12</a>",
      "comment": "This rhetorical lament highlights the isolation resulting from persistent sin—a theological theme later fulfilled in Christ bearing separation for sinful humanity (cf. Lamentations 1:12)."
    },
    {
      "pk": 2401506,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 6,
      "text": "You have abandoned Me, declares the LORD, you keep going backward. So I will reach out My hand against you and destroy you—I am weary of relenting.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/28/11/7'>Hos. 11:7</a>",
      "comment": "God’s patience is not limitless; here, the repeated refusals to repent bring divine chastisement. The theme of God’s weariness at continual sin extends through the prophets (cf. Hosea 11:7)."
    },
    {
      "pk": 2401507,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 7,
      "text": "I have winnowed them with a winnowing fork at the gates of the land; I have bereaved them, I have destroyed My people; they did not turn from their ways.",
      "links": "<a href='/AIV/24/51/2'>Jer. 51:2</a>",
      "comment": "The winnowing imagery often relates to divine separation of righteous from wicked (cf. Matthew 3:12). Spiritual application: God purifies His people, sometimes through suffering."
    },
    {
      "pk": 2401508,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 8,
      "text": "I have made their widows more numerous than the sand of the seas; I brought upon them a destroyer at midday against the mothers of young men; suddenly I cast down anguish and terror upon them.",
      "links": "<a href='/AIV/24/6/4'>Jer. 6:4</a>; <a href='/AIV/24/18/21'>Jer. 18:21</a>",
      "comment": "Judgment results in catastrophic loss—even mothers and young men suffer. Compare Jeremiah 6:4 for similar language about sudden attack and devastation."
    },
    {
      "pk": 2401509,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 9,
      "text": "She who bore seven has languished; she has breathed her last. Her sun has set while it is yet day; she is shamed and confounded. The rest of them I will give to the sword before their enemies, declares the LORD.”",
      "links": "<a href='/AIV/8/1/5'>1 Sam. 1:5</a>; <a href='/AIV/24/6/4'>Jer. 6:4</a>",
      "comment": "The 'mother of seven' symbolizes completeness and fullness, yet even her strength fails under judgment. Daylight turning to night is a motif for sudden disaster."
    },
    {
      "pk": 2401510,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 10,
      "text": "Woe is me, my mother, that you bore me, a man of strife and contention to the whole land! I have not lent, nor have people lent to me, yet all curse me.",
      "links": "<a href='/AIV/18/3/1'>Job 3:1</a>",
      "comment": "Jeremiah laments his role as a prophet, echoing Job’s despair. Prophets often suffer for their faithfulness to God—paralleling Christ’s reception by many during His ministry."
    },
    {
      "pk": 2401511,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 11,
      "text": "The LORD said, “Surely I will deliver you for a good purpose; surely I will cause the enemy to plead for you in the time of disaster and in the time of distress.”",
      "links": "<a href='/AIV/24/39/11-14'>Jer. 39:11-14</a>",
      "comment": "God promises eventual deliverance for His servant—a type that foreshadows both the suffering of the prophets and the greater deliverance found in Christ."
    },
    {
      "pk": 2401512,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 12,
      "text": "Can one break iron, iron from the north, and bronze?",
      "links": "<a href='/AIV/24/1/18'>Jer. 1:18</a>",
      "comment": "Iron from the north symbolizes invincible strength—Babylon’s might. It recalls God’s promise to make Jeremiah himself an 'iron pillar' (Jeremiah 1:18), showing God’s protection of His chosen."
    },
    {
      "pk": 2401513,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 13,
      "text": "Your wealth and your treasures I will give as plunder, without price, because of all your sins throughout your territory.",
      "links": "<a href='/AIV/24/17/3'>Jer. 17:3</a>",
      "comment": "Judgment is measured by loss of possessions—a direct consequence of persistent neglect of the covenant."
    },
    {
      "pk": 2401514,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 14,
      "text": "I will make you serve your enemies in a land you do not know, for My anger is a fire that will burn against you.",
      "links": "<a href='/AIV/24/17/4'>Jer. 17:4</a>",
      "comment": "Exile is foretold as divine retribution, reminiscent of Deuteronomy 28:36. The 'fire of anger' motif points poetically to both God's justice and purifying action (cf. 1 Peter 1:7)."
    },
    {
      "pk": 2401515,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 15,
      "text": "O LORD, You know; remember me and care for me, and avenge me against those who persecute me. In Your patience, do not take me away; know that for Your sake I bear reproach.",
      "links": "<a href='/AIV/24/20/8'>Jer. 20:8</a>; <a href='/AIV/19/69/7'>Ps. 69:7</a>",
      "comment": "Jeremiah’s plea for God’s faithfulness under persecution anticipates the suffering servant motif—paralleled in Christ’s endurance of reproach (cf. Psalm 69:7, John 15:25)."
    },
    {
      "pk": 2401516,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 16,
      "text": "Your words were found, and I ate them, and Your words became to me a joy and the delight of my heart, for I am called by Your name, O LORD God of armies.",
      "links": "<a href='/AIV/19/119/103'>Ps. 119:103</a>; <a href='/AIV/66/10/9'>Rev. 10:9</a>",
      "comment": "The 'eating' of God’s word is both literal (internalizing) and spiritual (nourishing the soul), echoing themes later picked up in Eucharistic symbolism and prophetic imagery (cf. Revelation 10:9)."
    },
    {
      "pk": 2401517,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 17,
      "text": "I did not sit in the company of revelers, nor did I rejoice with them; I sat alone because Your hand was upon me, for You filled me with indignation.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Jeremiah's separation from sinful companions illustrates the call to holiness—see also Psalm 1:1. His isolation mirrors the distinct role of the prophet and, spiritually, the unique call to be set apart."
    },
    {
      "pk": 2401518,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 18,
      "text": "Why is my pain unending and my wound incurable, refusing to be healed? Will You be to me like a deceptive stream, like waters that fail?",
      "links": "<a href='/AIV/19/42/9'>Ps. 42:9</a>; <a href='/AIV/24/2/13'>Jer. 2:13</a>",
      "comment": "Jeremiah expresses doubt and anguish, a human reaction to suffering. Prophets, and later apostles, endure similar periods of apparent abandonment, yet God’s faithfulness will be revealed."
    },
    {
      "pk": 2401519,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 19,
      "text": "Therefore, thus says the LORD: “If you return, I will restore you, and you shall stand before Me; if you separate the precious from the worthless, you shall be as My mouth. Let them return to you, but you shall not return to them.",
      "links": "<a href='/AIV/19/51/12'>Ps. 51:12</a>; <a href='/AIV/24/1/9'>Jer. 1:9</a>",
      "comment": "Restoration is always possible through repentance. The metaphor of being God’s mouth ties to prophetic authority—compare with the commissioning of the apostles."
    },
    {
      "pk": 2401520,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 20,
      "text": "And I will make you to this people a wall of bronze; they may fight against you, but they will not overcome you, for I am with you to save you and deliver you, declares the LORD.",
      "links": "<a href='/AIV/24/1/18-19'>Jer. 1:18-19</a>",
      "comment": "The imagery of a 'wall of bronze' promises supernatural strength and protection—a security later applied spiritually to the community of faith built on God’s promise."
    },
    {
      "pk": 2401521,
      "translation": "AIV",
      "book": 24,
      "chapter": 15,
      "verse": 21,
      "text": "I will deliver you from the hand of the wicked, and redeem you from the grasp of the ruthless.",
      "links": "<a href='/AIV/19/34/17-22'>Ps. 34:17-22</a>; <a href='/AIV/40/6/13'>Matt. 6:13</a>",
      "comment": "The assurance of deliverance echoes Messianic themes of redemption, ultimately fulfilled spiritually and literally through Christ. Trust in God’s redeeming power is core to the continuity of divine faithfulness."
    }
  ],
  "translatedAt": "2025-12-23T06:22:10.799Z"
}