{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 36,
  "verses": [
    {
      "pk": 1933601,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 1,
      "text": "In the fourth year of Jehoiakim the son of Josiah, king of Judah, this word came to Jeremiah from the LORD:",
      "links": "<a href='/AIV/24/25/1'>Jer. 25:1</a>",
      "comment": "This marks a significant moment in Jeremiah’s ministry, connecting the timeline to previous prophecies (see Jer. 25:1), calling God’s people to hear His words."
    },
    {
      "pk": 1933602,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 2,
      "text": "\"Take a scroll and write on it all the words that I have spoken to you against Israel and Judah and all the nations, from the day I first spoke to you, until today.\"",
      "links": "<a href='/AIV/24/30/2'>Jer. 30:2</a>",
      "comment": "The act of writing preserves God’s revelation faithfully, implying the importance of tradition and written word (cf. Jer. 30:2). Points toward Scripture’s authority and the safeguarding of prophecy for generations."
    },
    {
      "pk": 1933603,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 3,
      "text": "\"It may be that the house of Judah will hear all the disaster I intend to bring upon them, so that each may turn away from his evil way, and I will forgive their wrongdoing and their sin.\"",
      "links": "<a href='/AIV/24/18/8'>Jer. 18:8</a>; <a href='/AIV/24/26/3'>Jer. 26:3</a>",
      "comment": "God’s forgiveness is conditional on repentance, demonstrating the interplay of justice and mercy. Familial language (“house of Judah”) shows the people as a spiritual family, anticipating the New Covenant family (cf. Jer. 31:33-34)."
    },
    {
      "pk": 1933604,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 4,
      "text": "Then Jeremiah called Baruch the son of Neriah, and Baruch wrote on a scroll from Jeremiah’s mouth all the words the LORD had spoken to him.",
      "links": "<a href='/AIV/24/32/12'>Jer. 32:12</a>",
      "comment": "Baruch acts as Jeremiah’s scribe, emphasizing the role of transmission and faithful preservation. Tradition here is not only oral but written, underlining spiritual authority."
    },
    {
      "pk": 1933605,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 5,
      "text": "And Jeremiah ordered Baruch, saying, \"I am detained; I cannot go into the house of the LORD.\"",
      "links": "<a href='/AIV/24/33/1'>Jer. 33:1</a>",
      "comment": "Jeremiah is barred from the Temple, pointing to opposition to prophetic truth. Physical separation foreshadows suffering of God’s messengers throughout salvation history."
    },
    {
      "pk": 1933606,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 6,
      "text": "\"So you must go, and on a fast day, read in the hearing of the people in the LORD’s house the words of the LORD from the scroll, which you wrote at my dictation. You shall also read them in the hearing of all Judah who come in from their towns.\"",
      "links": "<a href='/AIV/24/36/10'>Jer. 36:10</a>",
      "comment": "Public reading on a holy day echoes liturgical proclamation and calls the people to collective repentance. This anticipates communal worship centered on the written and spoken word."
    },
    {
      "pk": 1933607,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 7,
      "text": "\"It may be that their plea will reach the LORD, and that each will turn away from his evil way, for great is the anger and wrath that the LORD has pronounced against this people.\"",
      "links": "<a href='/AIV/24/21/7'>Jer. 21:7</a>",
      "comment": "Intercession and repentance are central spiritual themes here. This verse connects the power of communal prayer and individual responsibility."
    },
    {
      "pk": 1933608,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 8,
      "text": "And Baruch the son of Neriah did all that Jeremiah the prophet commanded him, reading from the scroll the words of the LORD in the LORD’s house.",
      "links": "<a href='/AIV/24/36/10'>Jer. 36:10</a>",
      "comment": "Baruch’s obedience exemplifies faithful ministry of God’s word. Reflects the importance of stewardship in transmitting divine revelation."
    },
    {
      "pk": 1933609,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 9,
      "text": "In the fifth year of Jehoiakim, son of Josiah, king of Judah, in the ninth month, a fast before the LORD was proclaimed to all the people in Jerusalem and to all who came from the cities of Judah.",
      "links": "<a href='/AIV/24/36/6'>Jer. 36:6</a>",
      "comment": "The fast signifies a solemn and penitential event. Demonstrates communal repentance as a recurring theme in salvation history."
    },
    {
      "pk": 1933610,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 10,
      "text": "Then Baruch read from the scroll the words of Jeremiah in the house of the LORD, in the chamber of Gemariah, son of Shaphan the secretary, in the upper court, at the entrance of the New Gate of the LORD’s house, in the hearing of all the people.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>; <a href='/AIV/24/26/10'>Jer. 26:10</a>",
      "comment": "Gemariah and Shaphan link this event to reformers in Judah’s history. The public proclamation reflects the continuity of God’s word in the gathered assembly."
    },
    {
      "pk": 1933611,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 11,
      "text": "When Micaiah son of Gemariah, son of Shaphan, heard all the words of the LORD from the scroll,",
      "links": "<a href='/AIV/24/36/12'>Jer. 36:12</a>",
      "comment": "Family lineage is stressed, connecting recipients of revelation to previous generations, suggesting covenantal continuity."
    },
    {
      "pk": 1933612,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 12,
      "text": "he went down to the king’s house, into the scribe’s chamber, and all the officials were sitting there: Elishama the secretary, Delaiah son of Shemaiah, Elnathan son of Achbor, Gemariah son of Shaphan, Zedekiah son of Hananiah, and all the officials.",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "This emphasizes the role of recognized leaders and scribes in discerning and transmitting God’s revelation."
    },
    {
      "pk": 1933613,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 13,
      "text": "And Micaiah told them all the words that he had heard when Baruch read the scroll in the hearing of the people.",
      "links": "<a href='/AIV/24/36/10'>Jer. 36:10</a>",
      "comment": "Shows faithful communication and testimony, echoing patterns of transmission found later among the apostles."
    },
    {
      "pk": 1933614,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 14,
      "text": "Then all the officials sent Jehudi son of Nethaniah, son of Shelemiah, son of Cushi, to Baruch, saying, \"Take in your hand the scroll from which you have read in the hearing of the people, and come.\" So Baruch took the scroll in his hand and went to them.",
      "links": "<a href='/AIV/24/36/21'>Jer. 36:21</a>",
      "comment": "Underscores the importance of the written word, and the active role of messengers in furthering God’s revelation."
    },
    {
      "pk": 1933615,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 15,
      "text": "And they said to him, \"Sit down and read it to us.\" So Baruch read it to them.",
      "links": "<a href='/AIV/24/36/6'>Jer. 36:6</a>",
      "comment": "Highlights the importance of hearing the word together, reflecting on Scripture in community."
    },
    {
      "pk": 1933616,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 16,
      "text": "When they heard all the words, they turned to one another in fear and said to Baruch, \"We must surely report all these words to the king.\"",
      "links": "<a href='/AIV/24/26/16'>Jer. 26:16</a>",
      "comment": "The gravity of prophecy stirs reverence and fear, echoing the response to God’s word in the hearts of true believers."
    },
    {
      "pk": 1933617,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 17,
      "text": "And they asked Baruch, \"Tell us, how did you write all these words? Was it at his dictation?\"",
      "links": "<a href='/AIV/24/32/12'>Jer. 32:12</a>",
      "comment": "They seek assurance that the message has been faithfully transmitted, reflecting concern for authenticity of God’s revelation."
    },
    {
      "pk": 1933618,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 18,
      "text": "Baruch answered them, \"He dictated all these words to me while I wrote them down with ink in the scroll.\"",
      "links": "<a href='/AIV/24/36/4'>Jer. 36:4</a>",
      "comment": "The dictation process stresses prophetic inspiration and careful transmission, much like the apostolic handing down of the gospel."
    },
    {
      "pk": 1933619,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 19,
      "text": "Then the officials said to Baruch, \"Go and hide, you and Jeremiah, and let no one know where you are.\"",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Protecting the messenger and prophet reflects the reality of persecuted truth bearers throughout biblical history."
    },
    {
      "pk": 1933620,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 20,
      "text": "So they went to the king, into the court, but having deposited the scroll in the chamber of Elishama the secretary, they reported all the words to the king.",
      "links": "<a href='/AIV/12/22/3'>2 Kings 22:3</a>",
      "comment": "Keeping the scroll safe shows respect for God’s word, paralleling the safeguarding of sacred texts in later history."
    },
    {
      "pk": 1933621,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 21,
      "text": "Then the king sent Jehudi to get the scroll, and he took it from Elishama the secretary’s chamber. Jehudi read it to the king and all the officials who stood beside the king.",
      "links": "<a href='/AIV/24/36/14'>Jer. 36:14</a>",
      "comment": "The royal hearing emphasizes the authority and the challenge of prophetic words in the face of worldly power."
    },
    {
      "pk": 1933622,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 22,
      "text": "The king was sitting in the winter apartment, and a fire was burning in the brazier before him.",
      "links": "",
      "comment": "Contextual detail sets the scene for the dramatic rejection of God’s word. The fire will soon become symbolic."
    },
    {
      "pk": 1933623,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 23,
      "text": "As Jehudi read three or four columns, the king cut them off with a knife and cast them into the fire in the brazier, until the entire scroll was burned up in the fire.",
      "links": "<a href='/AIV/24/36/27'>Jer. 36:27</a>",
      "comment": "The destruction of the scroll signifies deliberate rejection of God’s revelation, foreshadowing later rejections and persecutions. Reveals conflict between God’s truth and earthly authority."
    },
    {
      "pk": 1933624,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 24,
      "text": "Neither the king nor any of his servants who heard all these words were afraid or tore their garments.",
      "links": "<a href='/AIV/12/22/11'>2 Kings 22:11</a>",
      "comment": "Contrast with Josiah’s repentance in 2 Kings 22:11. Their lack of reverence highlights spiritual blindness and hardness of heart."
    },
    {
      "pk": 1933625,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 25,
      "text": "Even though Elnathan and Delaiah and Gemariah pleaded with the king not to burn the scroll, he would not listen to them.",
      "links": "",
      "comment": "The pleading shows a remnant committed to God’s word, recalling the concept of faithful witnesses."
    },
    {
      "pk": 1933626,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 26,
      "text": "And the king commanded Jerahmeel the king’s son, Seraiah son of Azriel, and Shelemiah son of Abdeel to seize Baruch the scribe and Jeremiah the prophet, but the Lord had hidden them.",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Divine protection of God’s messengers, even when persecuted by authorities, is a recurring theme in the prophets and foreshadows the greater protection given to the apostles."
    },
    {
      "pk": 1933627,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 27,
      "text": "After the king burned the scroll containing the words that Baruch had written at Jeremiah’s dictation, the word of the LORD came to Jeremiah:",
      "links": "<a href='/AIV/24/36/23'>Jer. 36:23</a>",
      "comment": "God’s word cannot be destroyed. This prefigures the preservation of sacred tradition and revelation despite rejection or loss."
    },
    {
      "pk": 1933628,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 28,
      "text": "\"Take another scroll and write on it all the words that were in the first scroll, which Jehoiakim king of Judah has burned.\"",
      "links": "<a href='/AIV/24/36/2'>Jer. 36:2</a>",
      "comment": "Repetition and restoration affirm the indestructibility of God’s message—God oversees its transmission and preservation from generation to generation."
    },
    {
      "pk": 1933629,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 29,
      "text": "Say to Jehoiakim king of Judah, ‘This is what the LORD says: You have burned this scroll, saying, “Why have you written that the king of Babylon will certainly come and destroy this land and remove man and beast from it?”’",
      "links": "<a href='/AIV/24/25/11'>Jer. 25:11</a>",
      "comment": "Jehoiakim’s reaction shows denial in the face of prophecy, but truth stands. Predicts exile as divine punishment for unfaithfulness."
    },
    {
      "pk": 1933630,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 30,
      "text": "Thus says the LORD about Jehoiakim king of Judah: \"He shall have no one to sit on the throne of David, and his dead body shall be thrown out, exposed to the heat by day and frost by night.\"",
      "links": "<a href='/AIV/24/22/30'>Jer. 22:30</a>",
      "comment": "God’s judgment is severe: the royal lineage is cut off, echoing the consequences for covenant breaking. Points to the preservation of David’s line through alternate means, preparing Israel for the coming Messiah."
    },
    {
      "pk": 1933631,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 31,
      "text": "\"I will punish him, his descendants, and his servants for their wrongdoing. I will bring upon them and the people of Jerusalem and the men of Judah all the disaster I have pronounced against them, because they would not listen.\"",
      "links": "<a href='/AIV/24/35/17'>Jer. 35:17</a>; <a href='/AIV/24/7/13'>Jer. 7:13</a>",
      "comment": "Divine justice holds all responsible—leaders and people. Refusal to hear God draws judgment, a theme later redeemed in the New Covenant’s offer of forgiveness."
    },
    {
      "pk": 1933632,
      "translation": "AIV",
      "book": 24,
      "chapter": 36,
      "verse": 32,
      "text": "So Jeremiah took another scroll and gave it to Baruch the scribe, son of Neriah, who wrote on it at Jeremiah’s dictation all the words that were in the scroll burned by Jehoiakim king of Judah. And they added many similar words.",
      "links": "<a href='/AIV/24/36/4'>Jer. 36:4</a>",
      "comment": "God’s message endures and even expands. This event foreshadows the inspiration and transmission of sacred Scriptures, underscoring the role of authoritative tradition and community in safeguarding the faith."
    }
  ],
  "translatedAt": "2025-12-23T06:33:44.168Z"
}