{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 49,
  "verses": [
    {
      "pk": 2494901,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 1,
      "text": "Concerning the people of Ammon, this is what the LORD says: ‘Does Israel have no sons? Has he no heir? Why then has Milcom taken Gad for himself, and his people settled in its cities?’",
      "links": "<a href='/AIV/06/13/24-25'>Josh. 13:24-25</a>; <a href='/AIV/19/83/6-7'>Ps. 83:6-7</a>",
      "comment": "The LORD rebukes Ammon for taking the territory of Gad. Milcom refers to their national god. The lack of an heir for Israel implies judgment, surrender to foreign powers, yet prophecy often holds restitution."
    },
    {
      "pk": 2494902,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 2,
      "text": "Therefore, behold, the days are coming, declares the LORD, when I will cause the alarm of war to be heard against Rabbah of the Ammonites; it will become a desolate heap, and its villages shall be set on fire. Then Israel shall dispossess those who dispossessed him, says the LORD.",
      "links": "<a href='/AIV/24/48/8'>Jer. 48:8</a>",
      "comment": "The prophecy promises that Israel will reclaim its inheritance, a foreshadowing of restoration and triumph over enemies. This echoes messianic hope for the restoration of God's people."
    },
    {
      "pk": 2494903,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 3,
      "text": "Wail, O Heshbon, for Ai is devastated! Cry out, O daughters of Rabbah; gird yourselves with sackcloth. Lament, and run to and fro among the walls, for Milcom shall go into exile, together with his priests and officials.",
      "links": "<a href='/AIV/06/13/25'>Josh. 13:25</a>",
      "comment": "The judgment extends to national gods and leaders, indicating the futility of idolatry and false worship. This prefigures the supremacy of worship centered on the one true God."
    },
    {
      "pk": 2494904,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 4,
      "text": "Why do you boast of your valleys, O faithless daughter, you who trust in your treasures, saying, ‘Who will come against me?’",
      "links": "<a href='/AIV/19/49/6'>Ps. 49:6</a>",
      "comment": "Ammon’s false sense of security in wealth and natural defenses is rebuked. Trust in perishable things is discouraged throughout Scripture. Compare <a href='/AIV/40/6/19-21'>Matthew 6:19-21</a>."
    },
    {
      "pk": 2494905,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 5,
      "text": "Behold, I will bring terror upon you, declares the Lord GOD of hosts, from all who are around you, and you shall be driven out, every man straight before him, with no one to gather the fugitives.",
      "links": "<a href='/AIV/24/25/15-17'>Jer. 25:15-17</a>",
      "comment": "God's sovereign judgment is irresistible. The scattering of the people prefigures both exile and the hope of future gathering in messianic prophecy."
    },
    {
      "pk": 2494906,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 6,
      "text": "But afterward I will restore the fortunes of the people of Ammon, declares the LORD.",
      "links": "<a href='/AIV/24/48/47'>Jer. 48:47</a>; <a href='/AIV/24/33/7'>Jer. 33:7</a>",
      "comment": "Even Gentile nations receive a promise of restoration, subtly affirming God's universal mercy and intention to gather all peoples into unity with His people."
    },
    {
      "pk": 2494907,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 7,
      "text": "Concerning Edom: Thus says the LORD of hosts, ‘Is wisdom no more in Teman? Has counsel perished from the prudent? Is their wisdom vanished?’",
      "links": "<a href='/AIV/18/2/11'>Job 2:11</a>; <a href='/AIV/31/8'>Obad. 8</a>",
      "comment": "Edom’s traditional reputation for wisdom is denounced. Elsewhere, wisdom that comes from the Lord is the foundation for all understanding (<a href='/AIV/20/2/6'>Prov. 2:6</a>)."
    },
    {
      "pk": 2494908,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 8,
      "text": "Flee, turn back, dwell deep, O inhabitants of Dedan! For I will bring the calamity of Esau upon him, the time when I punish him.",
      "links": "<a href='/AIV/01/25/23-24'>Gen. 25:23-24</a>; <a href='/AIV/31/6'>Obad. 6</a>",
      "comment": "Punishment is announced upon Esau’s descendants. The theme of reversal—those who were once powerful being brought low—is recurrent and anticipates Gospel concepts of humility."
    },
    {
      "pk": 2494909,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 9,
      "text": "If grape gatherers came to you, would they not leave gleanings? If thieves came by night, would they not destroy only what was enough for them?",
      "links": "<a href='/AIV/31/5'>Obad. 5</a>",
      "comment": "This hyperbolic statement highlights the totality of Edom’s destruction, surpassing common standards of plunder."
    },
    {
      "pk": 2494910,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 10,
      "text": "But I have stripped Esau bare; I have uncovered his hiding places, so that he cannot hide himself. His children, his brothers, and his neighbors are destroyed, and he is no more.",
      "links": "<a href='/AIV/31/7-10'>Obad. 7-10</a>",
      "comment": "Edom’s exposure reflects the sins of pride and violence against Israel. The stripping bare has spiritual echoes in Christ’s own laying bare His heart for the redemption of all."
    },
    {
      "pk": 2494911,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 11,
      "text": "Leave your orphans, I will keep them alive; and let your widows trust in Me.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>",
      "comment": "Divine compassion is extended even in judgment. God’s care for widows and orphans points to the Church's historic ministry to the vulnerable, a living out of this principle."
    },
    {
      "pk": 2494912,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 12,
      "text": "For thus says the LORD: ‘If those who do not deserve to drink the cup must drink it, will you go entirely unpunished? You shall not go unpunished, but you must surely drink.’",
      "links": "<a href='/AIV/24/25/15-28'>Jer. 25:15-28</a>; <a href='/AIV/40/20/22'>Matt. 20:22</a>",
      "comment": "The ‘cup’ signifies suffering and divine wrath. It prefigures Christ’s own use of the ‘cup’ image for the Passion, indicating the universality of the need for redemption."
    },
    {
      "pk": 2494913,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 13,
      "text": "For I have sworn by Myself, declares the LORD, that Bozrah shall become a waste, a reproach, a ruin, and a curse; and all her cities shall be perpetual wastes.",
      "links": "<a href='/AIV/01/22/16'>Gen. 22:16</a>; <a href='/AIV/31/4'>Obad. 4</a>",
      "comment": "God’s oath underscores the certainty of judgment. Oaths by God are rare and show unwavering intent. This severity is set in the context of later mercy."
    },
    {
      "pk": 2494914,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 14,
      "text": "I have heard a message from the LORD, and an envoy has been sent among the nations: ‘Gather yourselves together and come against her, and rise up for battle!’",
      "links": "<a href='/AIV/31/1'>Obad. 1</a>",
      "comment": "The call to battle is an international summons, indicating how the judgment on Edom is an object lesson for all nations."
    },
    {
      "pk": 2494915,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 15,
      "text": "For behold, I will make you small among the nations, despised among mankind.",
      "links": "<a href='/AIV/31/2'>Obad. 2</a>",
      "comment": "Edom’s pride leads to its downfall. Humiliation of the haughty is a recurrent theme. Christ Himself teaches humility as a mark of true greatness (<a href='/AIV/40/20/26-27'>Matt. 20:26-27</a>)."
    },
    {
      "pk": 2494916,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 16,
      "text": "The terror you inspire and the pride of your heart have deceived you, you who dwell in the clefts of the rock, who occupy lofty heights. Though you make your nest as high as the eagle’s, I will bring you down from there, declares the LORD.",
      "links": "<a href='/AIV/31/3-4'>Obad. 3-4</a>",
      "comment": "The imagery of eagle’s heights is reminiscent of divine sovereignty over all creation. The illusion of security in worldly elevation is consistently corrected in Scripture."
    },
    {
      "pk": 2494917,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 17,
      "text": "Edom shall become a horror; everyone who passes by it will be appalled and will hiss because of all its wounds.",
      "links": "<a href='/AIV/24/18/16'>Jer. 18:16</a>; <a href='/AIV/05/29/22'>Deut. 29:22</a>",
      "comment": "Complete desolation leads those who see to marvel and grieve, a motif also associated with Jerusalem after judgment (<a href='/AIV/25/2/15'>Lam. 2:15</a>)."
    },
    {
      "pk": 2494918,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 18,
      "text": "As in the overthrow of Sodom and Gomorrah and their neighbors, says the LORD, no man shall dwell there; no son of man shall sojourn in it.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>",
      "comment": "The comparison to Sodom and Gomorrah signifies total destruction due to sin. This motivates ongoing calls to conversion and righteousness."
    },
    {
      "pk": 2494919,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 19,
      "text": "Behold, one shall come up like a lion from the thickets of the Jordan against a secure pasture. But in an instant I will make him run away from it. And who is chosen that I may appoint over it? For who is like Me? Who will summon Me? What shepherd can stand before Me?",
      "links": "<a href='/AIV/24/50/44'>Jer. 50:44</a>",
      "comment": "God asserts his unique authority as King and Shepherd. Imagery alludes to Christ as the Good Shepherd and as one with unchallengeable authority (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 2494920,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 20,
      "text": "Therefore, hear the plan that the LORD has made against Edom and the purposes he has formed against the inhabitants of Teman: Surely the little ones of the flock will be dragged away; surely their pasture will be devastated because of them.",
      "links": "<a href='/AIV/24/50/45'>Jer. 50:45</a>",
      "comment": "Judgment is all-encompassing, affecting even the innocent. However, this underscores the seriousness of sin and the need for atonement, hinting at the need for a mediatorial priesthood."
    },
    {
      "pk": 2494921,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 21,
      "text": "At the sound of their fall the earth will tremble; the cry of their voice shall be heard at the Red Sea.",
      "links": "<a href='/AIV/02/14/25-27'>Ex. 14:25-27</a>",
      "comment": "The far-reaching effect of crisis highlights the gravity of divine intervention. The Red Sea recalls deliverance—judgment and salvation are interwoven themes."
    },
    {
      "pk": 2494922,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 22,
      "text": "Behold, he shall mount up and fly swiftly like an eagle and spread his wings over Bozrah. And the heart of the mighty men of Edom in that day shall be like the heart of a woman in labor.",
      "links": "<a href='/AIV/05/28/49'>Deut. 28:49</a>; <a href='/AIV/24/6/24'>Jer. 6:24</a>",
      "comment": "Eagle imagery returns, signifying swiftness of divine action. Labor in pain symbolizes distress and anticipation of new birth—used elsewhere to describe the coming of the Kingdom."
    },
    {
      "pk": 2494923,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 23,
      "text": "Concerning Damascus: Hamath and Arpad are confounded, for they have heard bad news and are melting in fear, troubled as the sea cannot be quiet.",
      "links": "<a href='/AIV/23/17/1-2'>Isa. 17:1-2</a>",
      "comment": "Damascus suffers fear at God’s judgment; turmoil like the restless sea. The motif of water’s chaos hints at spiritual turbulence resolved only by God’s hand."
    },
    {
      "pk": 2494924,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 24,
      "text": "Damascus has become weak; she turns to flee, and panic has seized her; anguish and sorrows have taken hold of her, as of a woman in labor.",
      "links": "<a href='/AIV/24/6/24'>Jer. 6:24</a>",
      "comment": "‘Woman in labor’ symbolizes both suffering and possible new beginnings—a sign often seen as foreshadowing messianic birth pangs (see <a href='/AIV/43/16/21'>John 16:21</a>)."
    },
    {
      "pk": 2494925,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 25,
      "text": "Why is the renowned city not abandoned, the city of My joy?",
      "links": "<a href='/AIV/24/31/13'>Jer. 31:13</a>",
      "comment": "God expresses sorrow over Damascus—a reminder that even judgment is mingled with grief and longing for restoration. Divine affection for cities and peoples is evident."
    },
    {
      "pk": 2494926,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 26,
      "text": "Therefore her young men shall fall in her squares, and all her soldiers shall be silenced in that day, declares the LORD of hosts.",
      "links": "<a href='/AIV/24/50/30'>Jer. 50:30</a>",
      "comment": "Military defeat exemplifies the futility of resistance against God's will. The 'day' hints at times of judgment and ultimately the Day of the Lord."
    },
    {
      "pk": 2494927,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 27,
      "text": "And I will set fire to the wall of Damascus, and it shall consume the palaces of Ben-hadad.",
      "links": "<a href='/AIV/11/20/1'>1 Kin. 20:1</a>",
      "comment": "Fire symbolizes judgment and purification, recurring motifs in Scripture (compare <a href='/AIV/40/3/11-12'>Matt. 3:11-12</a>). The destruction of Ben-hadad’s palaces recalls judgment on dynasties that oppose God's truth."
    },
    {
      "pk": 2494928,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 28,
      "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon struck down: Thus says the LORD: ‘Rise up, advance against Kedar, and destroy the people of the east!’",
      "links": "<a href='/AIV/23/21/16-17'>Isa. 21:16-17</a>; <a href='/AIV/01/25/13'>Gen. 25:13</a>",
      "comment": "The judgments move to Arab tribes like Kedar and Hazor, showing that no nation is exempt from accountability to God. Nebuchadnezzar serves as God's instrument."
    },
    {
      "pk": 2494929,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 29,
      "text": "Their tents and flocks shall be taken, their curtains and all their goods; their camels shall be led away from them, and people shall cry out to them, ‘Terror is on every side!’",
      "links": "<a href='/AIV/24/6/25'>Jer. 6:25</a>",
      "comment": "Loss of possessions and the experience of terror reflect the vulnerability of earthly wealth and the reality of divine justice."
    },
    {
      "pk": 2494930,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 30,
      "text": "Flee, wander far away, dwell deep, O inhabitants of Hazor! For Nebuchadnezzar king of Babylon has taken counsel against you and has planned a purpose against you.",
      "links": "<a href='/AIV/24/40/9-10'>Jer. 40:9-10</a>",
      "comment": "Even those living in relative obscurity—Hazor—face judgment. God’s purposes are irresistible and all-encompassing."
    },
    {
      "pk": 2494931,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 31,
      "text": "Rise up, advance against a nation at ease, that dwells securely, declares the LORD, with no gates or bars, that lives alone.",
      "links": "<a href='/AIV/24/48/11'>Jer. 48:11</a>",
      "comment": "‘Nation at ease’ recalls nations that have forgotten dependence upon God. Times of prosperity often breed spiritual complacency, reminding us of the need for vigilance."
    },
    {
      "pk": 2494932,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 32,
      "text": "Their camels shall become plunder, and the multitude of their livestock a spoil. I will scatter in every wind those who cut the corners of their hair, and I will bring their calamity from all sides, declares the LORD.",
      "links": "<a href='/AIV/03/19/27'>Lev. 19:27</a>",
      "comment": "The reference to hair-cutting signifies distinctive ethnic customs. God's judgment is directed at sin, not merely differences, emphasizing universal need for repentance."
    },
    {
      "pk": 2494933,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 33,
      "text": "Hazor shall become a haunt of jackals, a desolation forever; no one shall live there, nor shall anyone dwell in it.",
      "links": "<a href='/AIV/23/34/13'>Isa. 34:13</a>",
      "comment": "Desolation and wild animals symbolize God’s judgment, used elsewhere for Babylon and Edom. Absence of habitation signals the repercussions of persistent sin."
    },
    {
      "pk": 2494934,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 34,
      "text": "The word of the LORD that came to Jeremiah the prophet concerning Elam, at the beginning of the reign of Zedekiah king of Judah:",
      "links": "<a href='/AIV/24/25/25'>Jer. 25:25</a>",
      "comment": "This marks a new prophecy, historically anchored in the reign of Zedekiah (597–586 BC), adding reliability to the prophecy as a real event."
    },
    {
      "pk": 2494935,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 35,
      "text": "Thus says the LORD of hosts: ‘Behold, I will break the bow of Elam, the chief of their might.’",
      "links": "<a href='/AIV/23/22/6'>Isa. 22:6</a>",
      "comment": "The bow was Elam’s military pride. Destruction of the bow symbolizes breaking earthly power—reminding of the futility of trusting in material strength."
    },
    {
      "pk": 2494936,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 36,
      "text": "And I will bring upon Elam the four winds from the four quarters of heaven, and I will scatter them to all those winds, and there shall be no nation to which those driven out of Elam shall not come.",
      "links": "<a href='/AIV/01/11/8-9'>Gen. 11:8-9</a>",
      "comment": "The scattering echoes Babel, signifying loss of unity. The image of ‘four winds’ later appears at Pentecost and in Revelation, where God gathers from all corners."
    },
    {
      "pk": 2494937,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 37,
      "text": "I will terrify Elam before their enemies and before those who seek their life. I will bring disaster upon them, My fierce anger, declares the LORD. I will send the sword after them until I have consumed them.",
      "links": "<a href='/AIV/24/48/2'>Jer. 48:2</a>",
      "comment": "The sword as symbol is common throughout prophecy, representing both temporal and spiritual judgment. Christ later speaks of bringing a sword not of violence, but division (see <a href='/AIV/40/10/34'>Matt. 10:34</a>)."
    },
    {
      "pk": 2494938,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 38,
      "text": "And I will set My throne in Elam and destroy from there king and officials, says the LORD.",
      "links": "<a href='/AIV/19/9/7'>Ps. 9:7</a>",
      "comment": "God’s ‘throne’ in Elam points to His sovereign rule beyond Israel, suggesting a future where God's kingdom encompasses all nations. Foreshadows the universal nature of the Church."
    },
    {
      "pk": 2494939,
      "translation": "AIV",
      "book": 24,
      "chapter": 49,
      "verse": 39,
      "text": "But in the latter days I will restore the fortunes of Elam, declares the LORD.",
      "links": "<a href='/AIV/44/2/9'>Acts 2:9</a>; <a href='/AIV/24/30/3'>Jer. 30:3</a>",
      "comment": "Restoration in the ‘latter days’ hints at eschatological hope where gentile nations are included in God's salvation plan. See the Pentecost reference where Elamites hear the Gospel, signifying fulfillment."
    }
  ],
  "translatedAt": "2025-12-23T06:40:18.549Z"
}