{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 42,
  "verses": [
    {
      "pk": 1940042,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 1,
      "text": "Then all the leaders of the forces, Johanan son of Kareah, Jezaniah son of Hoshaiah, and all the people from the least to the greatest, came near.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>; <a href='/AIV/24/41/16'>Jer. 41:16</a>",
      "comment": "The mention of leaders approaching Jeremiah shows the recognized authority of God's prophet and the order in approaching divine guidance, echoing Old Testament principles of hierarchy (see Num. 27:18-21)."
    },
    {
      "pk": 1940043,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 2,
      "text": "They said to Jeremiah the prophet, 'Let our plea come before you and pray for us to the Lord your God, for all this remnant—for we are few left of many, as your eyes see us.'",
      "links": "<a href='/AIV/24/38/2'>Jer. 38:2</a>; <a href='/AIV/24/24/2'>Jer. 24:2</a>",
      "comment": "The remnant theme is key, reflecting the faithful who survive judgment, which foreshadows God's eventual gathering and restoration, as referenced in Isa. 10:20-22 and Rom. 11:5."
    },
    {
      "pk": 1940044,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 3,
      "text": "'Pray that the Lord your God may tell us the way in which we should walk and the thing we should do.'",
      "links": "<a href='/AIV/19/143/8'>Ps. 143:8</a>; <a href='/AIV/24/6/16'>Jer. 6:16</a>",
      "comment": "Seeking God's direction before action models dependence on divine guidance; cf. Ps. 25:4, highlighting a deep spiritual truth about obedience and discernment in Christian life."
    },
    {
      "pk": 1940045,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 4,
      "text": "Jeremiah the prophet said to them, 'I have heard you. Behold, I will pray to the Lord your God according to your words, and whatever the Lord answers I will declare to you; I will not hold back a word from you.'",
      "links": "<a href='/AIV/24/1/7'>Jer. 1:7</a>; <a href='/AIV/24/26/2'>Jer. 26:2</a>",
      "comment": "Jeremiah promises honesty and full revelation, symbolizing prophetic fidelity and transparency (see Deut. 18:18-19)—a key element of a trustworthy spiritual authority."
    },
    {
      "pk": 1940046,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 5,
      "text": "Then they said to Jeremiah, 'May the Lord be a true and faithful witness against us if we do not act according to all the word that the Lord your God sends to us through you.'",
      "links": "<a href='/AIV/01/31/50'>Gen. 31:50</a>; <a href='/AIV/07/11/10'>Judg. 11:10</a>",
      "comment": "Their solemn oath before God stresses the seriousness of obedience. The concept of God as 'witness' deepens accountability, similar to covenant practices (Deut. 29:12)."
    },
    {
      "pk": 1940047,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 6,
      "text": "'Whether it is good or bad, we will obey the voice of the Lord our God, to whom we send you, so that it may be well with us when we obey the voice of the Lord our God.'",
      "links": "<a href='/AIV/24/7/23'>Jer. 7:23</a>; <a href='/AIV/05/30/15-20'>Deut. 30:15-20</a>",
      "comment": "Unconditional obedience is foundational in both Old and New Covenant (cf. Jn. 14:15). Notice the emphasis on obedience leading to well-being—a key biblical principle."
    },
    {
      "pk": 1940048,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 7,
      "text": "At the end of ten days, the word of the Lord came to Jeremiah.",
      "links": "<a href='/AIV/24/37/6'>Jer. 37:6</a>; <a href='/AIV/24/30/1'>Jer. 30:1</a>",
      "comment": "'Ten days' may echo a period of waiting and testing, reminiscent of Daniel 1:12; God’s timing reinforces patience and submission to His will."
    },
    {
      "pk": 1940049,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 8,
      "text": "Then he called Johanan son of Kareah and all the leaders of the forces who were with him, and all the people from the least to the greatest.",
      "links": "<a href='/AIV/24/42/1'>Jer. 42:1</a>",
      "comment": "The gathering of all people before receiving God’s word underscores the communal aspect of faith—a recurring biblical theme (cf. Ex. 19:17)."
    },
    {
      "pk": 1940050,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 9,
      "text": "He said to them, 'This is what the Lord, the God of Israel, to whom you sent me to present your plea, says:'",
      "links": "<a href='/AIV/24/38/17'>Jer. 38:17</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "God is directly addressed as the God of Israel—the unchanging covenantal God, emphasizing His personal engagement with His people."
    },
    {
      "pk": 1940051,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 10,
      "text": "'If you will remain in this land, then I will build you up and not tear you down; I will plant you and not uproot you, for I am sorry for the disaster I have brought upon you.'",
      "links": "<a href='/AIV/24/1/10'>Jer. 1:10</a>; <a href='/AIV/24/31/28'>Jer. 31:28</a>",
      "comment": "God’s mercy is shown in His readiness to restore, reflecting the dynamic between justice and forgiveness (cf. Lk. 15:20). The building/planting imagery is frequent in prophetic literature and points to hope of renewal."
    },
    {
      "pk": 1940052,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 11,
      "text": "'Do not be afraid of the king of Babylon, whom you now fear. Do not be afraid of him, declares the Lord, for I am with you to save you and to deliver you from his hand.'",
      "links": "<a href='/AIV/23/41/10'>Isa. 41:10</a>; <a href='/AIV/24/39/17'>Jer. 39:17</a>",
      "comment": "God’s assurance reflects His constant protection for those who trust in Him, as in Ps. 91:15 and Mt. 10:28."
    },
    {
      "pk": 1940053,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 12,
      "text": "'I will show you compassion, so that he will have compassion on you and restore you to your own land.'",
      "links": "<a href='/AIV/19/106/46'>Ps. 106:46</a>; <a href='/AIV/24/33/26'>Jer. 33:26</a>",
      "comment": "God shaping the hearts of rulers resonates with Pr. 21:1, showing sovereign influence even over world leaders—a sign of God’s providential care."
    },
    {
      "pk": 1940054,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 13,
      "text": "'But if you say, “We will not remain in this land,” disobeying the voice of the Lord your God,'",
      "links": "<a href='/AIV/24/7/24'>Jer. 7:24</a>; <a href='/AIV/05/30/17'>Deut. 30:17</a>",
      "comment": "A warning about the consequences of disobedience; echoes the principle of covenant curses and blessings (see Lev. 26:14-39)."
    },
    {
      "pk": 1940055,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 14,
      "text": "'and say, “No, we will go to the land of Egypt, where we will not see war or hear the trumpet or hunger for bread, and there we will live,”'",
      "links": "<a href='/AIV/24/43/7'>Jer. 43:7</a>; <a href='/AIV/24/44/1'>Jer. 44:1</a>",
      "comment": "Egypt symbolizes a false refuge, a recurring theme from Exodus onward (cf. Isa. 30:2), reminding believers not to seek safety apart from God."
    },
    {
      "pk": 1940056,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 15,
      "text": "'then hear the word of the Lord, O remnant of Judah: Thus says the Lord of hosts, the God of Israel: If you are determined to go to Egypt and go to settle there,'",
      "links": "<a href='/AIV/24/7/3'>Jer. 7:3</a>; <a href='/AIV/24/11/3'>Jer. 11:3</a>",
      "comment": "The formal admonition highlights God's authority and the consequences of defiance. This structure foreshadows later disciplinary warnings in the New Testament (cf. Heb. 3:7-19)."
    },
    {
      "pk": 1940057,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 16,
      "text": "'then the sword that you fear shall overtake you there in the land of Egypt, and the famine of which you are afraid shall follow close after you to Egypt, and there you shall die.'",
      "links": "<a href='/AIV/24/44/27'>Jer. 44:27</a>; <a href='/AIV/24/14/12'>Jer. 14:12</a>",
      "comment": "Seeking security apart from God is futile. The spiritual lesson is clear: true safety is found only in obedience to God’s will (cf. Jn. 17:12)."
    },
    {
      "pk": 1940058,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 17,
      "text": "'All the people who are determined to go to Egypt to settle there shall die by the sword, by famine, and by pestilence. They will have no survivors or escapees from the disaster that I will bring upon them.'",
      "links": "<a href='/AIV/24/24/10'>Jer. 24:10</a>; <a href='/AIV/24/27/13'>Jer. 27:13</a>",
      "comment": "Judgment for disobedience is complete, reiterating the theme found throughout Deuteronomy—covenant faithfulness brings life; rejection brings death."
    },
    {
      "pk": 1940059,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 18,
      "text": "'For thus says the Lord of hosts, the God of Israel: As my anger and my wrath have been poured out on the inhabitants of Jerusalem, so will my wrath be poured out on you when you go to Egypt. You will become an object of horror, of curse, of scorn, and of reproach. You will never see this place again.'",
      "links": "<a href='/AIV/24/7/20'>Jer. 7:20</a>; <a href='/AIV/24/44/12'>Jer. 44:12</a>",
      "comment": "Final exile is a severe consequence; echoing the spiritual cost of separation from the land and presence of God. This points, spiritually, to the importance of the promised land as a place of divine presence (see Rev. 21:3)."
    },
    {
      "pk": 1940060,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 19,
      "text": "'The Lord has spoken to you, O remnant of Judah, do not go to Egypt. Know for certain that I have warned you today.'",
      "links": "<a href='/AIV/24/11/6'>Jer. 11:6</a>; <a href='/AIV/24/46/13'>Jer. 46:13</a>",
      "comment": "God's clarity and repeated warnings highlight His justice and patience. This illustrates the principle that God’s guidance is specific and not arbitrary."
    },
    {
      "pk": 1940061,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 20,
      "text": "'You have deceived yourselves, for you sent me to the Lord your God, saying, “Pray for us to the Lord our God, and whatever the Lord says, declare to us and we will do it.”'",
      "links": "<a href='/AIV/24/42/2'>Jer. 42:2</a>",
      "comment": "Self-deception is exposed; the human tendency to seek confirmation rather than truth. A lesson in humility before God’s will (see Jas. 1:22-25)."
    },
    {
      "pk": 1940062,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 21,
      "text": "'And now I have declared it to you today, but you have not obeyed the voice of the Lord your God in anything that he sent me to tell you.'",
      "links": "<a href='/AIV/24/40/3'>Jer. 40:3</a>; <a href='/AIV/24/25/7'>Jer. 25:7</a>",
      "comment": "The pattern of hearing but not obeying God’s word repeats throughout salvation history. Shows the need for openness of heart to God's authoritative message."
    },
    {
      "pk": 1940063,
      "translation": "AIV",
      "book": 24,
      "chapter": 42,
      "verse": 22,
      "text": "'Therefore know for certain that you shall die by the sword, by famine, and by pestilence in the place where you desire to go to live.'",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>; <a href='/AIV/24/15/2'>Jer. 15:2</a>",
      "comment": "Consequence of disobedience is certain and severe. Spiritually, the refusal to heed divine direction results in separation from life and blessing—a warning for all believers to trust God’s guidance, individually and through appointed spiritual authorities."
    }
  ],
  "translatedAt": "2025-12-23T06:36:20.953Z"
}