{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 20,
  "verses": [
    {
      "pk": 2402001,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 1,
      "text": "Now Pashhur the son of Immer, the priest who was chief officer in the house of the LORD, heard Jeremiah prophesying these things.",
      "links": "<a href='/AIV/24/21/1'>Jer. 21:1</a>; <a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "Pashhur is identified as a priest and an overseer in the temple, highlighting the connection between prophetic ministry and the temple leadership, which later becomes especially significant in the New Testament priesthood context."
    },
    {
      "pk": 2402002,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 2,
      "text": "Then Pashhur struck Jeremiah the prophet and put him in the stocks that were at the Upper Gate of Benjamin in the house of the LORD.",
      "links": "<a href='/AIV/24/37/15'>Jer. 37:15</a>; <a href='/AIV/24/38/6'>Jer. 38:6</a>",
      "comment": "Jeremiah suffers persecution at the hands of religious authorities, foreshadowing similar treatment to later prophets and ultimately to Christ (Matthew 26:67; Luke 22:63)."
    },
    {
      "pk": 2402003,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 3,
      "text": "The next day, when Pashhur released Jeremiah from the stocks, Jeremiah said to him, 'The LORD has not called your name Pashhur, but Terror on Every Side.'",
      "links": "<a href='/AIV/24/6/25'>Jer. 6:25</a>; <a href='/AIV/24/46/5'>Jer. 46:5</a>",
      "comment": "The renaming recalls the biblical practice of God renaming individuals for prophetic purposes. 'Terror on Every Side' is a repeated phrase regarding judgment throughout Jeremiah."
    },
    {
      "pk": 2402004,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 4,
      "text": "For thus says the LORD: ‘I will make you a terror to yourself and to all your friends. They shall fall by the sword of their enemies while you look on. I will give all Judah into the hand of the king of Babylon, and he shall carry them captive to Babylon and strike them with the sword.’",
      "links": "<a href='/AIV/24/21/4'>Jer. 21:4</a>; <a href='/AIV/24/25/9'>Jer. 25:9</a>",
      "comment": "This prophecy foretells the exile and suffering for Judah due to their guilt, fulfilling the covenant curses found in Deuteronomy 28:36 and pointing towards God's sovereignty in judgment."
    },
    {
      "pk": 2402005,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 5,
      "text": "I will give all the wealth of this city, all its labor, all its valuables, and all the treasures of the kings of Judah into the hand of their enemies, who shall plunder them, take them, and bring them to Babylon.",
      "links": "<a href='/AIV/24/27/19'>Jer. 27:19-22</a>; <a href='/AIV/12/24/13'>2 Kings 24:13</a>",
      "comment": "The mention of temple treasures points towards the importance of the sanctuary and its offerings, a theme persistent in both Testaments regarding the sacredness of worship and holy places."
    },
    {
      "pk": 2402006,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 6,
      "text": "And you, Pashhur, and all who dwell in your house, shall go into captivity. You shall go to Babylon, and there you shall die, and be buried there, you and all your friends, to whom you have prophesied lies.",
      "links": "<a href='/AIV/24/22/26'>Jer. 22:26-27</a>; <a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "Pashhur's false prophecy leads to judgment not only for himself but for his household—a reminder of the seriousness of spiritual leadership and transmission of teaching (Titus 1:11; James 3:1)."
    },
    {
      "pk": 2402007,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 7,
      "text": "O LORD, you have deceived me, and I was deceived; you are stronger than I, and you have prevailed. I have become a laughingstock all day long; everyone mocks me.",
      "links": "<a href='/AIV/18/12/4'>Job 12:4</a>; <a href='/AIV/19/44/13'>Ps. 44:13-14</a>",
      "comment": "Jeremiah's lament is an honest prayer, expressing confusion and distress, yet turned towards God. Echoes are found in the psalms of lament and ultimately fulfilled in Christ’s own suffering and rejection (Isaiah 53:3; Matthew 27:39)."
    },
    {
      "pk": 2402008,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 8,
      "text": "For whenever I speak, I cry out; I shout, ‘Violence and destruction!’ For the word of the LORD has become for me a reproach and derision all day long.",
      "links": "<a href='/AIV/24/11/19'>Jer. 11:19</a>; <a href='/AIV/24/7/29'>Jer. 7:29-30</a>",
      "comment": "The prophet’s message brings him suffering, echoing the messianic theme of rejection for bearing God’s word (John 1:11; Hebrews 11:36-37)."
    },
    {
      "pk": 2402009,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 9,
      "text": "If I say, ‘I will not mention him, or speak any more in his name,’ there is in my heart as it were a burning fire shut up in my bones, and I am weary with holding it in, and I cannot.",
      "links": "<a href='/AIV/19/39/3'>Ps. 39:3</a>; <a href='/AIV/30/3/8'>Amos 3:8</a>",
      "comment": "Jeremiah can’t reject his prophetic vocation; his calling is irresistible and deeply personal, prefiguring the apostolic commission later given for proclamation (Acts 4:20; 1 Corinthians 9:16)."
    },
    {
      "pk": 2402010,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 10,
      "text": "For I hear many whispering, ‘Terror on every side!’ ‘Report him, let us report him!’ All my close friends watching for my downfall say, ‘Perhaps he will be deceived, then we can overpower him and take our revenge on him.’",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/40/26/59'>Matt. 26:59'>",
      "comment": "The betrayal by friends foreshadows the suffering of Christ, who was also betrayed and plotted against. These motifs point to the need for faith to withstand trials, united to the experiences of the saints throughout salvation history."
    },
    {
      "pk": 2402011,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 11,
      "text": "But the LORD is with me as a mighty warrior; therefore my persecutors will stumble, they will not prevail. They will be greatly ashamed, for they will not prosper; their everlasting disgrace will not be forgotten.",
      "links": "<a href='/AIV/19/118/6'>Ps. 118:6-7</a>; <a href='/AIV/24/1/8'>Jer. 1:8</a>",
      "comment": "Trust in the LORD’s protection is emphasized even amid persecution. The eternal aspect of disgrace hints at final judgment and the importance of perseverance for ultimate vindication."
    },
    {
      "pk": 2402012,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 12,
      "text": "O LORD of hosts, who tests the righteous, who sees the heart and the mind, let me see your vengeance on them, for to you I have committed my cause.",
      "links": "<a href='/AIV/24/11/20'>Jer. 11:20</a>; <a href='/AIV/19/7/9'>Ps. 7:9</a>",
      "comment": "God’s role as impartial judge is highlighted. The phrase ‘who sees the heart and mind’ is a theme repeated in both Old and New Testaments (1 Samuel 16:7; Hebrews 4:12-13). Prayer for vindication is balanced by entrusting one’s cause to God."
    },
    {
      "pk": 2402013,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 13,
      "text": "Sing to the LORD; praise the LORD! For he has delivered the life of the needy from the hand of evildoers.",
      "links": "<a href='/AIV/19/35/10'>Ps. 35:10</a>; <a href='/AIV/19/109/30'>Ps. 109:30-31</a>",
      "comment": "Worship is a response to God’s deliverance. The deliverance of the needy is a continuous thread, pointing to God’s concern for the poor and the persecuted, fulfilled and revealed perfectly in the ministry of Christ (Luke 4:18)."
    },
    {
      "pk": 2402014,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 14,
      "text": "Cursed be the day on which I was born! The day when my mother bore me, let it not be blessed!",
      "links": "<a href='/AIV/18/3/3'>Job 3:3</a>; <a href='/AIV/24/15/10'>Jer. 15:10</a>",
      "comment": "Jeremiah’s lament echoes Job’s, expressing the depth of despair. Yet, such passages can also be understood spiritually as a solidarity with suffering, anticipating the transformation of suffering through redemptive history."
    },
    {
      "pk": 2402015,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 15,
      "text": "Cursed be the man who brought the news to my father, 'A son is born to you,' making him very glad.",
      "links": "<a href='/AIV/18/3/3'>Job 3:3</a>; <a href='/AIV/18/3/11'>Job 3:11</a>",
      "comment": "This curse expresses deep existential pain and disappointment, which scripture allows room for, even within its narrative of hope and restoration."
    },
    {
      "pk": 2402016,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 16,
      "text": "Let that man be like the cities that the LORD overthrew without pity. Let him hear a cry in the morning and an alarm at noon,",
      "links": "<a href='/AIV/01/19/25'>Gen. 19:25</a>; <a href='/AIV/24/4/19'>Jer. 4:19</a>",
      "comment": "Refers to the judgment upon Sodom (Genesis 19). Jeremiah likens his suffering to the fate of the condemned, foreshadowing the theme of divine justice but also the need of mercy."
    },
    {
      "pk": 2402017,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 17,
      "text": "because he did not kill me in the womb, so my mother would have been my grave, and her womb always enlarged.",
      "links": "<a href='/AIV/18/3/16'>Job 3:16</a>; <a href='/AIV/24/15/10'>Jer. 15:10</a>",
      "comment": "Jeremiah’s wish to have died in the womb is heartfelt. Reference to the womb here affirms the preciousness of life before birth; the sanctity of life narrative is woven through scripture."
    },
    {
      "pk": 2402018,
      "translation": "AIV",
      "book": 24,
      "chapter": 20,
      "verse": 18,
      "text": "Why did I come forth from the womb to see trouble and sorrow, and that my days should end in shame?",
      "links": "<a href='/AIV/18/3/20'>Job 3:20-26</a>; <a href='/AIV/24/20/7'>Jer. 20:7</a>",
      "comment": "Jeremiah's lament closes the chapter, pointing to the mystery of suffering. Yet, biblical tradition—especially the passion narratives—shows that suffering can lead to redemptive purpose in the divine plan. For believers, this chapter highlights both the reality of suffering and the call to remain faithful to one’s vocation and trust in God’s ultimate justice."
    }
  ],
  "translatedAt": "2025-12-23T06:24:29.170Z"
}