{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 28,
  "verses": [
    {
      "pk": 30028001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 1,
      "text": "In that same year, at the beginning of the reign of King Zedekiah of Judah, in the fifth month of the fourth year, the prophet Hananiah son of Azzur, from Gibeon, spoke to me in the house of the LORD, in the presence of the priests and all the people. He said:",
      "links": "<a href='/AIV/24/27/1'>Jer. 27:1</a>",
      "comment": "Jeremiah sets the historical context for this confrontation with Hananiah by specifying the exact year and location, establishing the authenticity of prophetic challenges. The setting in the temple underscores the seriousness of the event as a matter of worship and true doctrine."
    },
    {
      "pk": 30028002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 2,
      "text": "\"This is what the LORD of Armies, the God of Israel, says: 'I have broken the yoke of the king of Babylon.'\"",
      "links": "<a href='/AIV/24/27/2'>Jer. 27:2</a>",
      "comment": "Hananiah claims to speak for the LORD, declaring an end to Babylonian oppression. His words are a direct contradiction to Jeremiah’s prophecies, introducing a theme of false prophecy and discerning true revelation from God."
    },
    {
      "pk": 30028003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 3,
      "text": "\"Within two years I will bring back to this place all the vessels of the LORD’s house that Nebuchadnezzar king of Babylon took from here and carried to Babylon.\"",
      "links": "<a href='/AIV/24/27/16'>Jer. 27:16</a>; <a href='/AIV/14/36/7'>2 Chr. 36:7</a>",
      "comment": "Hananiah presumptuously predicts the immediate restoration of Temple vessels—a false hope. This episode emphasizes the importance of liturgical continuity and material means of worship, which remain important in direct continuity with the true faith throughout salvation history."
    },
    {
      "pk": 30028004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 4,
      "text": "\"And I will also bring back to this place Jeconiah son of Jehoiakim, king of Judah, and all the exiles of Judah who went to Babylon, declares the LORD, for I will break the yoke of the king of Babylon!\"",
      "links": "<a href='/AIV/24/27/20'>Jer. 27:20</a>; <a href='/AIV/12/24/15'>2 Kgs. 24:15</a>",
      "comment": "Hananiah predicts full national restoration, but God’s true message (through Jeremiah) is often different from what is popular or comforting. Restoration is promised ultimately in Christ, who brings true spiritual return from exile (see <a href='/AIV/42/15/17-24'>Luke 15:17-24</a>)."
    },
    {
      "pk": 30028005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 5,
      "text": "Then the prophet Jeremiah spoke to the prophet Hananiah in the presence of the priests and all the people who were standing in the house of the LORD.",
      "links": "<a href='/AIV/24/26/7-19'>Jer. 26:7-19</a>",
      "comment": "Both prophetic figures are called \"prophet\" here, but the test will be in the truth of their words. Public disputes over authority and doctrine have always been part of God’s people, requiring discernment and submission to the legitimate authority established by God."
    },
    {
      "pk": 30028006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 6,
      "text": "And Jeremiah said, \"Amen! May the LORD do so; may the LORD fulfill the words you have prophesied, by bringing back the vessels of the LORD's house and all the exiles from Babylon to this place.\"",
      "links": "<a href='/AIV/05/18/22'>Deut. 18:22</a>; <a href='/AIV/24/29/10-14'>Jer. 29:10-14</a>",
      "comment": "Jeremiah expresses a pious wish for restoration, if it be God’s will. This highlights the posture of obedience to revealed truth, rather than seeking miracles or signs outside of God’s command."
    },
    {
      "pk": 30028007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 7,
      "text": "\"Nevertheless, listen now to this word that I speak in your hearing and in the hearing of all the people.\"",
      "links": "",
      "comment": "There is a deliberate public dimension to prophetic ministry—a safeguard for sound doctrine. Sound teaching happens in the open, forming the faith of the whole community, not just isolated individuals."
    },
    {
      "pk": 30028008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 8,
      "text": "\"The prophets who came before me and before you, from ancient times, prophesied war, disaster, and plague against many countries and great kingdoms.\"",
      "links": "<a href='/AIV/24/25/9'>Jer. 25:9</a>; <a href='/AIV/11/13/14'>1 Kgs. 13:14</a>",
      "comment": "Jeremiah roots his prophecy in continuity with the prophets who came before him, linking his message to a living tradition through which God acts. This ecclesial continuity is crucial to distinguish authentic revelation from novelty."
    },
    {
      "pk": 30028009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 9,
      "text": "\"As for the prophet who prophesies peace, when the word of that prophet comes to pass, then it will be known that the LORD has truly sent the prophet.\"",
      "links": "<a href='/AIV/05/18/21-22'>Deut. 18:21-22</a>",
      "comment": "Result confirms authenticity. True prophecy is judged by its fulfillment, a discernment principle that is similarly used by the apostles (see <a href='/AIV/44/5/38-39'>Acts 5:38-39</a>)."
    },
    {
      "pk": 30028010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 10,
      "text": "Then the prophet Hananiah took the yoke from the neck of Jeremiah the prophet and broke it.",
      "links": "<a href='/AIV/24/27/2'>Jer. 27:2</a>",
      "comment": "Hananiah’s dramatic act was meant as a visible sign confirming his message; nevertheless, it is a false sign. The importance of external signs underscores how God often uses visible objects as means to reveal spiritual realities."
    },
    {
      "pk": 30028011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 11,
      "text": "And Hananiah declared in the presence of all the people, \"This is what the LORD says: In the same way I will break the yoke of Nebuchadnezzar king of Babylon from the neck of all nations within two years.\" But Jeremiah the prophet went his way.",
      "links": "",
      "comment": "False prophets often exploit public drama to persuade the crowds. Jeremiah’s silent departure here shows his trust in God rather than seeking to debate or appeal to popular opinion."
    },
    {
      "pk": 30028012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 12,
      "text": "After Hananiah the prophet had broken the yoke from the neck of the prophet Jeremiah, the word of the LORD came to Jeremiah:",
      "links": "",
      "comment": "The true prophet receives God’s word regardless of circumstances. Revelation from God is not conditioned by human rituals or acts of presumption but is freely given in accordance to God’s will."
    },
    {
      "pk": 30028013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 13,
      "text": "\"Go and tell Hananiah, 'This is what the LORD says: You have broken the wooden yokes, but you have made in their place yokes of iron.'\"",
      "links": "<a href='/AIV/24/27/8-12'>Jer. 27:8-12</a>",
      "comment": "Breaking the sign of the yoke only brings greater bondage. Attempts to reject God’s discipline only result in heavier burdens. This points forward to how grace works through both outward signs and submission to God-appointed authority."
    },
    {
      "pk": 30028014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 14,
      "text": "\"For this is what the LORD of Armies, the God of Israel, says: I have put an iron yoke on the neck of all these nations, that they may serve Nebuchadnezzar king of Babylon, and they shall serve him. I have given him even the wild animals.\"",
      "links": "<a href='/AIV/24/27/6'>Jer. 27:6</a>; <a href='/AIV/27/2/38'>Dan. 2:38</a>",
      "comment": "God’s sovereignty extends over all creation—even to pagan rulers and creatures. Submission, even to difficult circumstances, can be a means of spiritual purification and unity for God’s people."
    },
    {
      "pk": 30028015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 15,
      "text": "Then the prophet Jeremiah said to Hananiah the prophet, \"Listen, Hananiah! The LORD has not sent you, and you have made this people trust in a lie.\"",
      "links": "<a href='/AIV/24/23/21-22'>Jer. 23:21-22</a>",
      "comment": "False teaching leads the people astray. Accountability among God’s messengers and discernment is necessary to safeguard the faith of the community."
    },
    {
      "pk": 30028016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 16,
      "text": "\"Therefore, this is what the LORD says: Behold, I am about to remove you from the face of the earth. This year you will die, because you have preached rebellion against the LORD.\"",
      "links": "<a href='/AIV/24/29/31-32'>Jer. 29:31-32</a>",
      "comment": "God’s judgment against false prophecy is immediate and severe. Spiritual authority is a grave responsibility—and accountability is essential for the preservation of true doctrine."
    },
    {
      "pk": 30028017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 28,
      "verse": 17,
      "text": "And in that very year, in the seventh month, Hananiah the prophet died.",
      "links": "<a href='/AIV/05/18/20'>Deut. 18:20</a>; <a href='/AIV/24/29/32'>Jer. 29:32</a>",
      "comment": "The fulfillment of Jeremiah’s prophecy shows God’s vindication of his true messenger, reinforcing the importance of a continuous, divinely guided authority to interpret God’s word and preserve the faith for the whole people. See also Christ’s warning against false prophets (<a href='/AIV/40/24/24'>Matt. 24:24</a>)."
    }
  ],
  "translatedAt": "2025-12-24T08:36:41.904Z"
}