{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 25,
  "verses": [
    {
      "pk": 1002501,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 1,
      "text": "The word that came to Jeremiah concerning all the people of Judah, in the fourth year of Jehoiakim son of Josiah, king of Judah, which was the first year of Nebuchadnezzar king of Babylon.",
      "links": "<a href='/AIV/24/36/1'>Jer. 36:1</a>; <a href='/AIV/12/24/1'>2 Kgs. 24:1</a>",
      "comment": "This verse sets both the historical and prophetic context—Jeremiah addresses Judah as Nebuchadnezzar rises to power. Significantly, God's warnings occur under specific earthly rulers, suggesting the intertwining of salvation history and actual world events."
    },
    {
      "pk": 1002502,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 2,
      "text": "The prophet Jeremiah spoke concerning all the people of Judah and all the inhabitants of Jerusalem, saying:",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>",
      "comment": "By addressing both Judah and Jerusalem, the prophecy’s scope is national and spiritual. This reinforces the locus of temple worship and the capital’s centrality in God’s plan."
    },
    {
      "pk": 1002503,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 3,
      "text": "From the thirteenth year of Josiah the son of Amon, king of Judah, until this day, these twenty-three years, the word of the LORD has come to me, and I have spoken to you persistently, but you would not listen.",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>; <a href='/AIV/24/7/13'>Jer. 7:13</a>",
      "comment": "Jeremiah emphasizes the duration and consistency of his prophetic calling. The mention of persistent warning reflects divine patience and a call to heed, a theme continuing in the New Testament (cf. Luke 13:34)."
    },
    {
      "pk": 1002504,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 4,
      "text": "And the LORD has sent to you all his servants the prophets again and again, but you have not listened or inclined your ear to hear.",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "God’s continuous sending of prophets points to the unbroken chain of authoritative teaching. The link to Jesus’ lament in Matthew 23:37 signals a deeper fulfillment—the leadership’s ongoing rejection of true messengers."
    },
    {
      "pk": 1002505,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 5,
      "text": "They said, 'Turn now, every one of you, from your evil ways and your evil deeds, and you shall dwell in the land the LORD has given to you and your fathers from of old and forever.'",
      "links": "<a href='/AIV/05/5/33'>Deut. 5:33</a>; <a href='/AIV/24/18/11'>Jer. 18:11</a>",
      "comment": "Emphasis on repentance and the conditional promise of possession of the land draws from the Deuteronomic covenant. God’s covenant remains open if the people respond in faith and obedience."
    },
    {
      "pk": 1002506,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 6,
      "text": "Do not go after other gods to serve them or worship them, and do not provoke me to anger with the works of your hands; then I will do you no harm.'",
      "links": "<a href='/AIV/24/7/6'>Jer. 7:6</a>; <a href='/AIV/02/20/3'>Ex. 20:3</a>",
      "comment": "Idolatry is condemned as a central offense. Obedience preserves the people from harm, a theme linked to the first commandment. The works of their hands (idols) provoke God's righteous anger."
    },
    {
      "pk": 1002507,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 7,
      "text": "Yet you have not listened to me, declares the LORD, so you have provoked me to anger with the works of your hands to your own harm.",
      "links": "<a href='/AIV/24/7/19'>Jer. 7:19</a>",
      "comment": "Disobedience results in self-inflicted harm. The consequences of sin are not arbitrary but a direct result of separation from God (cf. Romans 6:23)."
    },
    {
      "pk": 1002508,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 8,
      "text": "Therefore thus says the LORD of armies: Because you have not obeyed my words,",
      "links": "<a href='/AIV/24/4/17'>Jer. 4:17</a>",
      "comment": "\"LORD of armies\" (YHWH Sabaoth) underlines God's supreme authority and power to act in judgment and salvation."
    },
    {
      "pk": 1002509,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 9,
      "text": "behold, I will send for all the tribes of the north, declares the LORD, and for Nebuchadnezzar the king of Babylon, my servant, and I will bring them against this land and its inhabitants and against all these surrounding nations. I will devote them to destruction and make them an astonishment, a hissing, and an everlasting desolation.",
      "links": "<a href='/AIV/24/27/6'>Jer. 27:6</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "God calls Nebuchadnezzar \"my servant,\" indicating that even foreign rulers can fulfill God's purpose. The language of desolation and astonishment echoes covenant curses (Deut. 28:37)."
    },
    {
      "pk": 1002510,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 10,
      "text": "Moreover, I will remove from them the voice of joy and the voice of gladness, the voice of the bridegroom and the voice of the bride, the sound of the millstones and the light of the lamp.",
      "links": "<a href='/AIV/24/16/9'>Jer. 16:9</a>; <a href='/AIV/66/18/23'>Rev. 18:23</a>",
      "comment": "Loss of joy and daily life (marriage, food, light) signify total judgment. Revelation 18:23 echoes this in the fall of Babylon, drawing spiritual parallels to final judgment."
    },
    {
      "pk": 1002511,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 11,
      "text": "This whole land shall become a ruin and desolation, and these nations shall serve the king of Babylon seventy years.",
      "links": "<a href='/AIV/14/36/21'>2 Chr. 36:21</a>; <a href='/AIV/27/9/2'>Dan. 9:2</a>",
      "comment": "The seventy-year exile is foundational for later Jewish and Christian tradition, seen as a period of purification and fulfillment (cf. Daniel 9:2)."
    },
    {
      "pk": 1002512,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 12,
      "text": "Then after seventy years are completed, I will punish the king of Babylon and that nation, the land of the Chaldeans, for their iniquity, declares the LORD, making the land an everlasting waste.",
      "links": "<a href='/AIV/24/50/18'>Jer. 50:18</a>; <a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "No empire stands forever in rebellion against God. The cyclical pattern—God using one nation to judge another—points to His sovereignty."
    },
    {
      "pk": 1002513,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 13,
      "text": "I will bring upon that land all the words which I have spoken against it, everything written in this book, which Jeremiah prophesied against all the nations.",
      "links": "<a href='/AIV/24/51/60'>Jer. 51:60</a>",
      "comment": "The written words serve as an enduring record and guarantee of fulfillment, foreshadowing the importance of written revelation in the Christian tradition."
    },
    {
      "pk": 1002514,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 14,
      "text": "For many nations and great kings shall make them serve them also; and I will repay them according to their deeds and according to the work of their hands.",
      "links": "<a href='/AIV/24/50/9'>Jer. 50:9</a>",
      "comment": "This retribution echoes divine justice—nations are measured by the works of their own hands (see also Revelation 18:6)."
    },
    {
      "pk": 1002515,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 15,
      "text": "For thus says the LORD, the God of Israel, to me: Take this cup of the wine of wrath from my hand and make all the nations to whom I send you drink it.",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "The cup of wrath symbolism appears throughout Scripture, most notably in Jesus’ agony in Gethsemane. Here, the cup foreshadows the suffering and judgment that Christ will ultimately bear for all."
    },
    {
      "pk": 1002516,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 16,
      "text": "They shall drink and stagger and go out of their minds because of the sword that I am sending among them.",
      "links": "<a href='/AIV/24/13/13'>Jer. 13:13</a>",
      "comment": "God’s judgment is overwhelming, causing nations to stagger like the drunk. The physical and spiritual consequences of sin manifest."
    },
    {
      "pk": 1002517,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 17,
      "text": "So I took the cup from the LORD’s hand and made all the nations to whom the LORD sent me drink it:",
      "links": "<a href='/AIV/24/51/7'>Jer. 51:7</a>",
      "comment": "Jeremiah’s obedience and symbolic action underline the necessity of mediation between God and the nations—a theme fulfilled perfectly in Christ (cf. 1 Tim. 2:5)."
    },
    {
      "pk": 1002518,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 18,
      "text": "Jerusalem and the cities of Judah, its kings and officials, to make them a ruin, a desolation, a hissing, and a curse, as it is this day;",
      "links": "<a href='/AIV/24/44/22'>Jer. 44:22</a>",
      "comment": "Judgment begins with God’s own people, setting a precedent for future Christian interpretation of the purification of God’s house (cf. 1 Pet. 4:17)."
    },
    {
      "pk": 1002519,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 19,
      "text": "Pharaoh king of Egypt, his servants, his officials, and all his people;",
      "links": "<a href='/AIV/24/46/17'>Jer. 46:17</a>",
      "comment": "Egypt’s inclusion in judgment shows that no earthly power is exempt from divine accountability."
    },
    {
      "pk": 1002520,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 20,
      "text": "and all the mixed people, and all the kings of the land of Uz, all the kings of the land of the Philistines—Ashkelon, Gaza, Ekron, and the remnant of Ashdod;",
      "links": "<a href='/AIV/24/47/5'>Jer. 47:5</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "The mention of the ‘mixed people’ (possibly foreigners) and ancient cities illustrates the universal scope of God’s judgment."
    },
    {
      "pk": 1002521,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 21,
      "text": "Edom, Moab, and the sons of Ammon;",
      "links": "<a href='/AIV/24/49/7'>Jer. 49:7</a>",
      "comment": "Traditional enemies of Israel are not spared, emphasizing the impartiality of God."
    },
    {
      "pk": 1002522,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 22,
      "text": "all the kings of Tyre, all the kings of Sidon, and all the kings of the coastlands across the sea;",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>",
      "comment": "Coastal nations renowned for commerce also fall under judgment, underscoring the fate of mortal kingdoms."
    },
    {
      "pk": 1002523,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 23,
      "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;",
      "links": "<a href='/AIV/24/9/26'>Jer. 9:26</a>",
      "comment": "Cutting the hair relates to ritual practices; the judgment extends to religious customs outside the Abrahamic tradition."
    },
    {
      "pk": 1002524,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 24,
      "text": "all the kings of Arabia and all the kings of the mixed people who dwell in the desert;",
      "links": "",
      "comment": "The desert tribes, often viewed as outsiders, are not beyond God’s reach."
    },
    {
      "pk": 1002525,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 25,
      "text": "all the kings of Zimri, all the kings of Elam, and all the kings of Media;",
      "links": "<a href='/AIV/27/8/2'>Dan. 8:2</a>",
      "comment": "Even nations to the distant east are included, reinforcing God’s universal kingship."
    },
    {
      "pk": 1002526,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 26,
      "text": "all the kings of the north, far and near, each one after the other, and all the kingdoms of the world which are on the face of the earth. And the king of Sheshach shall drink after them.",
      "links": "<a href='/AIV/24/51/41'>Jer. 51:41</a>",
      "comment": "‘Sheshach’ is a cryptic name for Babylon. The universality of judgment points toward eschatological themes found in Revelation."
    },
    {
      "pk": 1002527,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 27,
      "text": "Then you shall say to them, 'Thus says the LORD of armies, the God of Israel: Drink and be drunk, vomit and fall and rise no more, because of the sword that I am sending among you.'",
      "links": "<a href='/AIV/24/25/16'>Jer. 25:16</a>",
      "comment": "The symbolism of the cup is intensified here, emphasizing the inescapable effects of divine justice."
    },
    {
      "pk": 1002528,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 28,
      "text": "And if they refuse to receive the cup from your hand to drink, then you shall say to them, 'Thus says the LORD of armies: You must drink.'",
      "links": "",
      "comment": "No one can refuse God’s decree; even reluctant nations are subject to divine will."
    },
    {
      "pk": 1002529,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 29,
      "text": "For behold, I am beginning to bring disaster on the city that is called by my name, and shall you go unpunished? You shall not go unpunished, for I am calling for a sword against all the inhabitants of the earth, declares the LORD of armies.'",
      "links": "<a href='/AIV/60/4/17'>1 Pet. 4:17</a>",
      "comment": "Judgment starts with God’s people—a principle quoted in the New Testament, highlighting the seriousness of being called by God’s name."
    },
    {
      "pk": 1002530,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 30,
      "text": "You, therefore, shall prophesy against them all these words, and say to them: 'The LORD will roar from on high, and from his holy habitation give voice; he will roar mightily against his fold, and shout, like those who tread grapes, against all the inhabitants of the earth.'",
      "links": "<a href='/AIV/28/11/10'>Hos. 11:10</a>; <a href='/AIV/29/3/16'>Joel 3:16</a>",
      "comment": "God’s roar is a symbol of ultimate authority. The imagery of the winepress is later used in Revelation for final judgment."
    },
    {
      "pk": 1002531,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 31,
      "text": "'The noise will reach to the ends of the earth, for the LORD has a controversy with the nations; he will enter into judgment with all flesh, and the wicked he will give to the sword,' declares the LORD.",
      "links": "<a href='/AIV/23/66/16'>Isa. 66:16</a>",
      "comment": "Universal judgment upon all flesh anticipates eschatological themes and the final judgment described in the New Testament."
    },
    {
      "pk": 1002532,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 32,
      "text": "Thus says the LORD of armies: Behold, disaster is going forth from nation to nation, and a great storm is being stirred up from the farthest parts of the earth.",
      "links": "",
      "comment": "Judgment as a 'storm' highlights its global and unstoppable character."
    },
    {
      "pk": 1002533,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 33,
      "text": "And on that day, those slain by the LORD will be from one end of the earth to the other. They will not be mourned, gathered, or buried; they will be like dung on the face of the ground.",
      "links": "<a href='/AIV/24/8/2'>Jer. 8:2</a>",
      "comment": "Unburied corpses indicate a totality of judgment and the interruption of liturgical and community rites—a detail with deep spiritual implications."
    },
    {
      "pk": 1002534,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 34,
      "text": "Howl, you shepherds, and cry out; roll in the ashes, you leaders of the flock! For the days of your slaughter and your dispersion have come; you shall fall and be shattered like a precious vessel.",
      "links": "<a href='/AIV/24/23/1'>Jer. 23:1</a>",
      "comment": "Shepherds symbolize religious and civil leaders. Judgment falls particularly heavily on those entrusted with care of God’s people—a call for authentic and sacrificial leadership."
    },
    {
      "pk": 1002535,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 35,
      "text": "No refuge will remain for the shepherds, nor escape for the leaders of the flock.",
      "links": "",
      "comment": "Earthly authority and human schemes offer no sanctuary from divine justice."
    },
    {
      "pk": 1002536,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 36,
      "text": "A voice—the cry of the shepherds, and the howling of the leaders of the flock! For the LORD is laying waste their pasture.",
      "links": "",
      "comment": "Loss of pasture signals a breakdown of provision from shepherds to flock—physically and spiritually."
    },
    {
      "pk": 1002537,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 37,
      "text": "Peaceful fields are devastated because of the burning anger of the LORD.",
      "links": "",
      "comment": "Even places of peace are subject to divine wrath when leaders stray from their mission."
    },
    {
      "pk": 1002538,
      "translation": "AIV",
      "book": 24,
      "chapter": 25,
      "verse": 38,
      "text": "Like a lion has left his lair, so their land has become a horror because of the sword of the oppressor and because of his burning anger.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "The image of the lion and the devastated land serves both as a warning and as anticipation of restoration after purifying judgment—a theme pointing forward to the hope of redemption."
    }
  ],
  "translatedAt": "2025-12-23T06:27:28.942Z"
}