{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 36,
  "verses": [
    {
      "pk": 30036001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 1,
      "text": "In the fourth year of Jehoiakim son of Josiah, king of Judah, this word came to Jeremiah from the LORD:",
      "links": "<a href='/AIV/24/25/1'>Jer. 25:1</a>",
      "comment": "Jeremiah continues to receive prophetic messages during the reign of Jehoiakim. Note the precision of dating: God works through specific historical moments."
    },
    {
      "pk": 30036002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 2,
      "text": "\"Take a scroll and write on it all the words that I have spoken to you against Israel, and against Judah, and against all the nations, from the day I first spoke to you, from the days of Josiah until today.\"",
      "links": "<a href='/AIV/24/30/2'>Jer. 30:2</a>, <a href='/AIV/24/25/3'>Jer. 25:3</a>",
      "comment": "The command to write underlines the importance of preserving revelation in written form (foreshadowing the Scripture itself). Like the Law given to Moses, the written word serves as a lasting witness."
    },
    {
      "pk": 30036003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 3,
      "text": "\"Perhaps the house of Judah will hear all the calamity that I plan to bring upon them, so that each may turn from his evil way, and I will forgive their iniquity and their sin.\"",
      "links": "<a href='/AIV/24/18/8'>Jer. 18:8</a>; <a href='/AIV/24/26/3'>Jer. 26:3</a>",
      "comment": "God seeks repentance; even judgments are meant to bring people back. This reflects God’s mercy and readiness to forgive those who repent, a key theme throughout Scripture (cf. <a href='/AIV/42/15/7'>Luke 15:7</a>)."
    },
    {
      "pk": 30036004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 4,
      "text": "Then Jeremiah called Baruch son of Neriah. Baruch wrote on a scroll at Jeremiah's dictation all the words that the LORD had spoken to him.",
      "links": "<a href='/AIV/24/32/12'>Jer. 32:12</a>; <a href='/AIV/24/45/1'>Jer. 45:1</a>",
      "comment": "Baruch’s role as scribe highlights the importance of trusted witnesses in preserving God’s Word. This mirrors later traditions of apostolic succession where the faithful preserve and hand on the message."
    },
    {
      "pk": 30036005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 5,
      "text": "And Jeremiah commanded Baruch, saying, \"I am restricted; I cannot go into the house of the LORD.\"",
      "links": "<a href='/AIV/24/21/1-2'>Jer. 21:1-2</a>",
      "comment": "Jeremiah’s physical restriction signifies opposition to the prophetic message. Even so, the word of God is not bound (cf. <a href='/AIV/55/2/9'>2 Timothy 2:9</a>)."
    },
    {
      "pk": 30036006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 6,
      "text": "\"So you go, and read from the scroll, which you have written at my dictation the words of the LORD, in the hearing of the people in the house of the LORD on a day of fasting. Also read them in the hearing of all Judah who come out of their towns.\"",
      "links": "<a href='/AIV/24/19/14'>Jer. 19:14</a>",
      "comment": "Baruch’s public proclamation prefigures the liturgical reading of Scripture in worship (see <a href='/AIV/16/8/2-3'>Nehemiah 8:2-3</a>). The reading draws all people in a public assembly to hear God's Word."
    },
    {
      "pk": 30036007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 7,
      "text": "\"Perhaps their plea for mercy will come before the LORD, and each one will turn from his evil way, for great is the anger and wrath that the LORD has pronounced against this people.\"",
      "links": "<a href='/AIV/24/7/3'>Jer. 7:3</a>, <a href='/AIV/24/26/3'>Jer. 26:3</a>",
      "comment": "The repeated emphasis on repentance reveals God’s persistent desire for restoration and forgiveness."
    },
    {
      "pk": 30036008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 8,
      "text": "And Baruch son of Neriah did all that Jeremiah the prophet ordered, reading from the scroll the words of the LORD in the LORD’s house.",
      "links": "<a href='/AIV/24/45/5'>Jer. 45:5</a>",
      "comment": "Faithful obedience to the prophet’s word is stressed. Baruch models submission to God’s arrangement for passing on His word."
    },
    {
      "pk": 30036009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 9,
      "text": "In the fifth year of Jehoiakim son of Josiah, king of Judah, in the ninth month, all the people in Jerusalem and out of Judah proclaimed a fast before the LORD.",
      "links": "<a href='/AIV/24/34/8-9'>Jer. 34:8-9</a>",
      "comment": "Public acts of fasting for mercy are a sign of national repentance. Historically, such times often accompany major religious or political crises."
    },
    {
      "pk": 30036010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 10,
      "text": "Then, in the hearing of all the people, Baruch read the words of Jeremiah from the scroll, in the house of the LORD, in the chamber of Gemariah son of hand, the scribe, which was in the upper court at the entrance of the New Gate of the LORD’s house.",
      "links": "<a href='/AIV/24/35/4'>Jer. 35:4</a>",
      "comment": "Reading the Word from a prominent place shows the importance of God’s message for all. It highlights how God’s word reaches the entire community."
    },
    {
      "pk": 30036011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 11,
      "text": "When Micaiah son of Gemariah, son of Shaphan, heard all the words of the LORD from the scroll,",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Micaiah’s response sets off official action, showing how even one listener may impact many."
    },
    {
      "pk": 30036012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 12,
      "text": "He went down to the king’s house, to the scribe’s chamber; and all the officials were sitting there—Elishama the scribe, Delaiah son of Shemaiah, Elnathan son of Achbor, Gemariah son of Shaphan, Zedekiah son of Hananiah, and all the officials.",
      "links": "<a href='/AIV/24/26/22-24'>Jer. 26:22-24</a>",
      "comment": "The officials’ presence indicates the seriousness of this prophetic proclamation. The mention of named witnesses aligns with practices of confirming testimony."
    },
    {
      "pk": 30036013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 13,
      "text": "And Micaiah told them all the words that he had heard, when Baruch read the scroll in the hearing of the people.",
      "links": "",
      "comment": "The message spreads from the house of the LORD to rulers by faithful testimony. Transmission through witnesses is central."
    },
    {
      "pk": 30036014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 14,
      "text": "Then all the officials sent Jehudi son of Nethaniah, son of Shelemiah, son of Cushi, to Baruch, saying, \"Take in your hand the scroll that you read in the hearing of the people, and come.\" So Baruch son of Neriah took the scroll in his hand and came to them.",
      "links": "",
      "comment": "Baruch’s bold action in entering the council at the officials’ command demonstrates the scribe’s trust in God and mission."
    },
    {
      "pk": 30036015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 15,
      "text": "And they said to him, \"Sit down and read it in our hearing.\" So Baruch read it in their hearing.",
      "links": "",
      "comment": "The officials’ demand for direct hearing underscores the seriousness with which the divine message must be received."
    },
    {
      "pk": 30036016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 16,
      "text": "When they heard all the words, they turned to one another in fear and said to Baruch, \"We must surely report all these words to the king.\"",
      "links": "",
      "comment": "God’s Word provokes awe and even fear in the hearts of leaders. The truth has power over those in authority."
    },
    {
      "pk": 30036017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 17,
      "text": "And they asked Baruch, saying, \"Tell us, how did you write all these words? Was it at his dictation?\"",
      "links": "",
      "comment": "Skepticism about authentic revelation is not new; the legitimacy of prophecy often faces public scrutiny. The process underscores divinely inspired transmission. Compare with the transmission of apostolic teaching (cf. <a href='/AIV/44/1/1-2'>Acts 1:1-2</a>)."
    },
    {
      "pk": 30036018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 18,
      "text": "Baruch answered them, \"He dictated all these words to me, and I wrote them with ink in the scroll.\"",
      "links": "",
      "comment": "Baruch explicitly testifies to the prophetic process—verbal inspiration followed by written preservation. This reflects the high trust in prophetic authority foundational to Christian faith."
    },
    {
      "pk": 30036019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 19,
      "text": "Then the officials said to Baruch, \"Go, hide yourself, you and Jeremiah, and let no one know where you are.\"",
      "links": "",
      "comment": "Protecting the prophet and his scribe underlines the dangers faced in proclaiming God’s message. God’s messengers are often shielded by those who respect God’s Word."
    },
    {
      "pk": 30036020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 20,
      "text": "And they went to the king, into the court, but stored the scroll in the chamber of Elishama the scribe. Then they told all the words to the king.",
      "links": "",
      "comment": "Placing the scroll in a safe place shows reverence for the written word. The practice of safeguarding Scripture is vitally important."
    },
    {
      "pk": 30036021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 21,
      "text": "The king sent Jehudi to get the scroll, and he took it from the chamber of Elishama the scribe. Jehudi read it in the hearing of the king and all the officials who stood beside the king.",
      "links": "",
      "comment": "The reading before the king represents the accountability of rulers to God’s authority as declared through his inspired texts."
    },
    {
      "pk": 30036022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 22,
      "text": "It was the ninth month, and the king was sitting in the winter house; with a fire burning in the brazier before him.",
      "links": "",
      "comment": "The detail of the winter house places this event in a real historical context. The presence of fire foreshadows what is to come."
    },
    {
      "pk": 30036023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 23,
      "text": "When Jehudi had read three or four columns, the king cut them off with a knife and threw them into the fire in the brazier, until the entire scroll was consumed in the fire that was in the brazier.",
      "links": "",
      "comment": "Destruction of the scroll symbolizes rejection of God’s Word. Yet, as later fulfilled, the Word cannot be destroyed (cf. <a href='/AIV/19/119/89'>Psalm 119:89</a>; <a href='/AIV/40/24/35'>Matthew 24:35</a>)."
    },
    {
      "pk": 30036024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 24,
      "text": "Yet neither the king nor any of his servants who heard all these words were afraid, nor did they tear their garments.",
      "links": "<a href='/AIV/12/22/11'>2 Kings 22:11</a>",
      "comment": "Contrast the king’s hard heart with Josiah who tore his garments in repentance when hearing the law (see <a href='/AIV/12/22/11'>2 Kings 22:11</a>). True conversion is marked by humility before God’s Word."
    },
    {
      "pk": 30036025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 25,
      "text": "Even when Elnathan and Delaiah and Gemariah begged the king not to burn the scroll, he would not listen to them.",
      "links": "",
      "comment": "The presence of faithful counselors in the royal court shows that God raises up witnesses even in corrupt times. But the king’s pride leads to disaster."
    },
    {
      "pk": 30036026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 26,
      "text": "And the king commanded Jerahmeel the king’s son, Seraiah son of Azriel, and Shelemiah son of Abdeel to seize Baruch the scribe and Jeremiah the prophet, but the LORD hid them.",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "God's providential protection of his servants continues. Attempts to silence God's messengers always ultimately fail."
    },
    {
      "pk": 30036027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 27,
      "text": "Then the word of the LORD came to Jeremiah, after the king had burned the scroll with the words Jeremiah dictated to Baruch:",
      "links": "",
      "comment": "God’s word is living, and endures even if its written form is attacked. God provides new revelation when needed."
    },
    {
      "pk": 30036028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 28,
      "text": "\"Take another scroll, and write on it all the former words that were on the first scroll, which Jehoiakim king of Judah has burned.\"",
      "links": "",
      "comment": "Restoration of Scripture after destruction prefigures the continuous safeguarding of God’s word through chosen instruments."
    },
    {
      "pk": 30036029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 29,
      "text": "\"And concerning Jehoiakim king of Judah you shall say: 'Thus says the LORD: You have burned this scroll, saying, \"Why have you written in it that the king of Babylon will surely come and destroy this land, and will empty it of man and beast?\"'\"",
      "links": "<a href='/AIV/24/22/19'>Jer. 22:19</a>",
      "comment": "The prophecy specifically ties destruction to the rejection of God’s warnings—a key principle for the spiritual life."
    },
    {
      "pk": 30036030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 30,
      "text": "\"Therefore, thus says the LORD concerning Jehoiakim king of Judah: He shall have no one to sit on the throne of David, and his dead body shall be cast out to the heat by day and the frost by night.\"",
      "links": "<a href='/AIV/24/22/30'>Jer. 22:30</a>",
      "comment": "Loss of Davidic succession and an unburied corpse express divine judgment. Compare with the hope for the eternal Messiah who will truly fulfill the Davidic promise (<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>)."
    },
    {
      "pk": 30036031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 31,
      "text": "\"I will punish him and his offspring and his servants for their iniquity. I will bring upon them, upon the inhabitants of Jerusalem, and upon the men of Judah, all the disaster that I have pronounced against them, but they would not listen.\"",
      "links": "<a href='/AIV/24/19/15'>Jer. 19:15</a>",
      "comment": "Persistent disobedience leads to communal judgment. God’s justice acts both personally and corporately."
    },
    {
      "pk": 30036032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 36,
      "verse": 32,
      "text": "Then Jeremiah took another scroll and gave it to Baruch the scribe, son of Neriah, who wrote on it at Jeremiah’s dictation all the words of the scroll that Jehoiakim king of Judah had burned in the fire; and many similar words were added to them.",
      "links": "<a href='/AIV/24/30/2'>Jer. 30:2</a>",
      "comment": "Despite human efforts to destroy or suppress God’s revelation, God preserves and even expands his Word. This points towards the persevering role of the guardians of divine revelation throughout history, a principle foundational to the Church’s trust in the enduring authority of Scripture and tradition."
    }
  ],
  "translatedAt": "2025-12-24T08:41:59.877Z"
}