{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 47,
  "verses": [
    {
      "pk": 2404701,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 1,
      "text": "The word of the LORD that came to Jeremiah the prophet concerning the Philistines, before Pharaoh attacked Gaza.",
      "links": "<a href='/AIV/23/14/29'>Isa. 14:29</a>; <a href='/AIV/24/25/20'>Jer. 25:20</a>",
      "comment": "This verse sets the historical context, signaling a prophetic message about the Philistines before Egypt's assault on Gaza. It underscores God’s sovereignty over all nations and his use of prophets to reveal his will. The Philistines frequently oppose Israel throughout the Old Testament (see Isa. 14:29)."
    },
    {
      "pk": 2404702,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 2,
      "text": "Thus says the LORD: 'Behold, waters are rising out of the north, and will become an overflowing torrent. They shall overflow the land and all that fills it, the city and those who dwell in it. Mankind will cry out, and every inhabitant of the land will wail.'",
      "links": "<a href='/AIV/24/46/7'>Jer. 46:7-8</a>; <a href='/AIV/23/8/7'>Isa. 8:7-8</a>",
      "comment": "The floodwaters symbolize an invading army (likely Babylon), causing devastation and panic among the Philistines. Water is often used in Scripture as a metaphor for overwhelming judgment (see Isa. 8:7-8). Spiritual interpretation can see this as a warning of coming judgment for persistent sin, urging the faithful to seek God's mercy."
    },
    {
      "pk": 2404703,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 3,
      "text": "At the sound of the stomping hooves of his strong horses, at the rushing of his chariots and the rumbling of his wheels, the fathers will not turn back for their children, their hands grow weak,",
      "links": "<a href='/AIV/24/46/9'>Jer. 46:9</a>; <a href='/AIV/07/4/15'>Judg. 4:15</a>",
      "comment": "The terror induced by the invading force is so great that even parental instinct fails. This illustrates both the gravity of God’s permitted judgment and the depth of human frailty apart from divine help. Unlike earthly fathers, God never forsakes his children."
    },
    {
      "pk": 2404704,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 4,
      "text": "because of the day that is coming to destroy all the Philistines, to cut off from Tyre and Sidon every helper that remains. For the LORD is about to destroy the Philistines, the remnant from the coastland of Caphtor.",
      "links": "<a href='/AIV/01/10/14'>Gen. 10:14</a>; <a href='/AIV/30/9/7'>Amos 9:7</a>; <a href='/AIV/26/28/21'>Ezek. 28:21-24</a>",
      "comment": "These cities and regions were ancient allies of the Philistines (see Gen. 10:14). This is both a literal prophecy fulfilled in history and a spiritual warning: those who ally against God's will face ultimate defeat. The enduring theme of remnants points to God’s continued faithfulness to preserve those who turn to him."
    },
    {
      "pk": 2404705,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 5,
      "text": "Baldness has come upon Gaza; Ashkelon is destroyed, O remnant of their valley, how long will you cut yourself?",
      "links": "<a href='/AIV/03/21/5'>Lev. 21:5</a>; <a href='/AIV/23/3/7'>Isa. 3:24</a>",
      "comment": "Baldness and self-cutting were mourning rituals forbidden for God's people (Lev. 21:5). The Philistines' worldly mourning illustrates the futility of rituals apart from faithfulness to God. Spiritually, reliance on true worship, not empty rituals, brings restoration—a theme Christ fulfills and the Church maintains in its liturgy."
    },
    {
      "pk": 2404706,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 6,
      "text": "O sword of the LORD, how long until you are quiet? Put yourself back into your scabbard; rest and be still!",
      "links": "<a href='/AIV/23/34/5-6'>Isa. 34:5-6</a>; <a href='/AIV/24/25/29'>Jer. 25:29</a>",
      "comment": "The sword here signifies God's judgment. The plea for the sword to rest points towards the longing for peace and reconciliation with God—a longing ultimately satisfied in Christ, the Prince of Peace (see Isa. 9:6). The persistence of judgment reflects the seriousness of sin and the need for true repentance."
    },
    {
      "pk": 2404707,
      "translation": "AIV",
      "book": 24,
      "chapter": 47,
      "verse": 7,
      "text": "How can you be quiet, when the LORD has commanded it? There he has appointed it against Ashkelon and against the seacoast.",
      "links": "<a href='/AIV/09/15/3'>1 Sam. 15:3</a>; <a href='/AIV/24/25/20'>Jer. 25:20</a>",
      "comment": "Judgment continues at God's command until its purpose is complete. God is shown to act with authority and justice, holding all peoples accountable. The faithful see in this the call to submit to God's will, trusting in his divine plan, and finding ultimate hope in Christ’s final victory over evil."
    }
  ],
  "translatedAt": "2025-12-23T06:38:31.336Z"
}