{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 9,
  "verses": [
    {
      "pk": 2409001,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 1,
      "text": "Oh, that my head were a spring of water, and my eyes a fountain of tears, that I might weep day and night for the slain of the daughter of my people!",
      "links": "<a href='/AIV/24/14/17'>Jer. 14:17</a>; <a href='/AIV/24/8/23'>Jer. 8:23</a>",
      "comment": "Jeremiah laments for his people in deep sorrow, foreshadowing the sorrow of Christ over Jerusalem (Luke 19:41). The ‘daughter of my people’ expresses Jeremiah’s deep connection and compassion for Israel."
    },
    {
      "pk": 2409002,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 2,
      "text": "If only I had a lodging place in the wilderness for travelers, that I might leave my people and go away from them! For they are all adulterers, a company of traitors.",
      "links": "<a href='/AIV/19/120/5-7'>Ps. 120:5–7</a>",
      "comment": "Jeremiah desires to remove himself from Israel because of their faithlessness—spiritual adultery, often used in Scripture for Israel’s unfaithfulness to God (Hosea 4:1-2). The prophet’s isolation reflects a longing for purity and truth."
    },
    {
      "pk": 2409003,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 3,
      "text": "They bend their tongues like their bows; lies and not truth prevail in the land. They proceed from one evil to another, and they do not know Me, declares the Lord.",
      "links": "<a href='/AIV/19/64/3'>Ps. 64:3</a>; <a href='/AIV/28/4/1'>Hos. 4:1</a>",
      "comment": "The image of tongues as bows conveys the destructive power of their deceit. ‘They do not know Me’ anticipates the New Covenant promise of knowing God (Jer. 31:34; Heb. 8:11)."
    },
    {
      "pk": 2409004,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 4,
      "text": "Let everyone beware of his neighbor, and put no trust in any brother, for every brother is a deceiver, and every neighbor goes about as a slanderer.",
      "links": "<a href='/AIV/33/7/5-6'>Mic. 7:5-6</a>",
      "comment": "Corruption is so widespread that trust between people breaks down. Cf. Jesus's description of division in families (Matt. 10:21, 35-36), signifying the depth of depravity humanity can reach."
    },
    {
      "pk": 2409005,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 5,
      "text": "They all deceive their neighbors, and no one speaks the truth. They have taught their tongues to lie; they weary themselves committing iniquity.",
      "links": "<a href='/AIV/19/58/3'>Ps. 58:3</a>; <a href='/AIV/28/7/3'>Hos. 7:3</a>",
      "comment": "The people’s habitual deceit illustrates the effect of sin on human nature. The deliberate teaching of the tongue signals a willful, persistent sinfulness."
    },
    {
      "pk": 2409006,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 6,
      "text": "You dwell in the midst of deceit; in their deceit they refuse to know Me, declares the Lord.",
      "links": "<a href='/AIV/49/4/18'>Eph. 4:18</a>",
      "comment": "A willful ignorance of God stems not just from an intellectual gap but from moral refusal. This echoes Paul’s teaching regarding how sin darkens understanding."
    },
    {
      "pk": 2409007,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 7,
      "text": "Therefore, thus says the Lord of hosts: Behold, I will refine them and test them, for what else can I do because of the daughter of My people?",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/38/13/9'>Zech. 13:9</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>",
      "comment": "God’s testing is likened to refining precious metal, prefiguring the purifying work that occurs through suffering and discipline, ultimately drawing people back to Himself."
    },
    {
      "pk": 2409008,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 8,
      "text": "Their tongue is a deadly arrow; it speaks deceitfully. With his mouth, each speaks peace to his neighbor, but in his heart he sets an ambush.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/59/3/8'>Jas. 3:8</a>",
      "comment": "This duplicity recalls Christ's teachings on the condition of the heart (Matt. 15:18). The damage of the tongue anticipates New Testament urgency around taming speech."
    },
    {
      "pk": 2409009,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 9,
      "text": "Shall I not punish them for these things? declares the Lord. Shall I not avenge Myself on a nation such as this?",
      "links": "<a href='/AIV/24/5/9'>Jer. 5:9</a>",
      "comment": "Divine justice is the necessary response to such pervasive sin. God’s questions reinforce the certainty and righteousness of His impending judgment."
    },
    {
      "pk": 2409010,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 10,
      "text": "I will weep and wail for the mountains, and take up a lamentation for the pastures of the wilderness, because they are laid waste so that no one passes through; the lowing of cattle is not heard; both the birds of the air and the beasts have fled and are gone.",
      "links": "<a href='/AIV/19/102/6'>Ps. 102:6</a>; <a href='/AIV/24/4/25'>Jer. 4:25</a>",
      "comment": "Jeremiah mourns not just for the people but for creation itself, showing the far-reaching effects of human sin (cf. Rom. 8:20-22)."
    },
    {
      "pk": 2409011,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 11,
      "text": "I will make Jerusalem a heap of ruins, a lair of jackals, and the towns of Judah I will make desolate, without inhabitant.",
      "links": "<a href='/AIV/23/34/13'>Isa. 34:13</a>; <a href='/AIV/24/26/18'>Jer. 26:18</a>",
      "comment": "Fulfillment of earlier warnings regarding Jerusalem’s fate due to collective unfaithfulness. Historically realized at the Babylonian conquest, yet spiritually signifying the consequence of rejecting God's law."
    },
    {
      "pk": 2409012,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 12,
      "text": "Who is the wise man who may understand this? And who is he to whom the mouth of the Lord has spoken, that he may explain it? Why is the land ruined and laid waste like a wilderness, so that no one passes through?",
      "links": "<a href='/AIV/24/23/18'>Jer. 23:18</a>; <a href='/AIV/19/107/43'>Ps. 107:43</a>",
      "comment": "A rhetorical challenge to the leaders, whose lack of true wisdom is exposed. True wisdom comes from God’s word and instruction."
    },
    {
      "pk": 2409013,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 13,
      "text": "And the Lord says, Because they have forsaken My law which I set before them, and have not obeyed My voice or walked according to it,",
      "links": "<a href='/AIV/24/7/24'>Jer. 7:24</a>; <a href='/AIV/19/78/10'>Ps. 78:10</a>",
      "comment": "Obedience to God’s law is central to covenant relationship. Their abandonment sets the stage for understanding Christ’s fulfillment and elevation of the law (Matt. 5:17)."
    },
    {
      "pk": 2409014,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 14,
      "text": "but have walked after the stubbornness of their own hearts and after the Baals, as their fathers taught them,",
      "links": "<a href='/AIV/24/7/24'>Jer. 7:24</a>; <a href='/AIV/19/81/12'>Ps. 81:12</a>",
      "comment": "Idolatry is a recurring sin in Israel’s history, perpetuated through generations. The heart’s rebellion is a major Biblical theme, resolved ultimately by Christ’s work of conversion and sanctification."
    },
    {
      "pk": 2409015,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 15,
      "text": "therefore thus says the Lord of hosts, the God of Israel: Behold, I will feed them, this people, with bitter food and give them poisoned water to drink.",
      "links": "<a href='/AIV/24/8/14'>Jer. 8:14</a>; <a href='/AIV/19/69/21'>Ps. 69:21</a>",
      "comment": "The ‘bitter food’ and ‘poisoned water’ symbolize the unavoidable suffering from judgment. Cf. the bitter gall offered to Christ (Matt. 27:34), signifying the bearing of judgment for sin."
    },
    {
      "pk": 2409016,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 16,
      "text": "I will scatter them among the nations, whom neither they nor their fathers have known. I will send the sword after them until I have consumed them.",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>; <a href='/AIV/05/28/64'>Deut. 28:64</a>",
      "comment": "The exile is a consequence of covenant breaking, but also provides the context for future restoration. The scattering anticipates the gathering of God's people from all nations (cf. Isa. 11:12; John 11:52)."
    },
    {
      "pk": 2409017,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 17,
      "text": "Thus says the Lord of hosts: Consider, and call for the mourning women, that they may come; send for the skillful women, that they may wail.",
      "links": "<a href='/AIV/24/9/20'>Jer. 9:20</a>",
      "comment": "The professional mourning women reflect the gravity of judgment, with public lamentation as a response to tragedy. This practice foreshadows the call to repentance and intercession."
    },
    {
      "pk": 2409018,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 18,
      "text": "Let them hurry and raise a lament over us, that our eyes may run with tears, and our eyelids flow with water.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>; <a href='/AIV/25/1/16'>Lam. 1:16</a>",
      "comment": "Weeping over sin and judgment is a prerequisite for true repentance. This lamentation anticipates New Testament calls to mourn and be comforted (Matt. 5:4)."
    },
    {
      "pk": 2409019,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 19,
      "text": "For a sound of lamentation is heard from Zion: 'How we are ruined! We are utterly ashamed, for we have left the land, because they have destroyed our dwellings.'",
      "links": "<a href='/AIV/25/2/6-7'>Lam. 2:6-7</a>",
      "comment": "The confession of shame and ruin is significant for spiritual renewal, emphasizing humility before restoration."
    },
    {
      "pk": 2409020,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 20,
      "text": "Hear, O women, the word of the Lord, and let your ears receive the word of His mouth; teach your daughters a lament and each her neighbor a dirge.",
      "links": "<a href='/AIV/24/9/17'>Jer. 9:17</a>",
      "comment": "Instructing the next generation in lament shows how repentance must become a communal, intergenerational reality. This tradition of oral instruction has echoes in Christian praxis, emphasizing formation and teaching in the faith."
    },
    {
      "pk": 2409021,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 21,
      "text": "For death has come up into our windows; it has entered our palaces, cutting off the children from the streets and the young men from the squares.",
      "links": "<a href='/AIV/24/18/21'>Jer. 18:21</a>; <a href='/AIV/02/12/29'>Ex. 12:29</a>",
      "comment": "The indiscriminate judgment echoes the tenth plague in Egypt and points toward the universality of death as a result of sin, illustrating humanity’s need for redemption."
    },
    {
      "pk": 2409022,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 22,
      "text": "Speak, Thus declares the Lord: The dead bodies of men shall fall like dung upon the open field, like sheaves after the reaper, and no one shall gather them.",
      "links": "<a href='/AIV/24/8/2'>Jer. 8:2</a>",
      "comment": "The dishonor of unburied bodies concerned ancient Israelites deeply. Such a fate was the sign of God’s wrath—a theme revisited in New Testament teachings on final judgment."
    },
    {
      "pk": 2409023,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 23,
      "text": "Thus says the Lord: Let not the wise man boast in his wisdom, let not the mighty man boast in his might, let not the rich man boast in his riches,",
      "links": "<a href='/AIV/20/27/1'>Prov. 27:1</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "Human pride in wisdom, strength, or wealth is condemned, pointing toward dependence on God. Paul reiterates this in the New Testament (1 Cor 1:31)."
    },
    {
      "pk": 2409024,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 24,
      "text": "but let him who boasts boast in this: that he understands and knows Me, that I am the Lord who practices steadfast love, justice, and righteousness in the earth. For in these things I delight, declares the Lord.",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "To know the Lord is the greatest good. The triad—steadfast love, justice, and righteousness—finds its fullness in Jesus Christ, who reveals God's character perfectly (John 14:7-9)."
    },
    {
      "pk": 2409025,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 25,
      "text": "Behold, the days are coming, declares the Lord, when I will punish all those who are circumcised only in the flesh:",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>",
      "comment": "True belonging to God is not merely outward or ritual, but requires inner transformation—a theme deepened by Paul, who speaks of circumcision of the heart (Rom 2:29). Liturgy and sacraments always point toward inward grace."
    },
    {
      "pk": 2409026,
      "translation": "AIV",
      "book": 24,
      "chapter": 9,
      "verse": 26,
      "text": "Egypt, Judah, Edom, the sons of Ammon, Moab, and all who dwell in the wilderness who cut the corners of their hair—these nations are uncircumcised, and all the house of Israel is uncircumcised in heart.",
      "links": "<a href='/AIV/03/19/27'>Lev. 19:27</a>; <a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>",
      "comment": "Israel’s judgment is now compared to the nations; uncircumcised heart denotes lack of true conversion. The Church’s teaching affirms that conversion is not merely visible membership but heart transformation, accomplished by grace."
    }
  ],
  "translatedAt": "2025-12-23T06:19:31.387Z"
}