{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 46,
  "verses": [
    {
      "pk": 2464601,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 1,
      "text": "The word of the LORD that came to Jeremiah the prophet concerning the nations:",
      "links": "<a href='/AIV/1/15/14'>Gen. 15:14</a>; <a href='/AIV/24/1/5'>Jer. 1:5</a>",
      "comment": "Jeremiah shifts focus from Israel and Judah to speak God’s judgments on other nations, showing God's sovereignty over all peoples."
    },
    {
      "pk": 2464602,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 2,
      "text": "About Egypt. Concerning the army of Pharaoh Neco, king of Egypt, who was by the river Euphrates at Carchemish, whom Nebuchadnezzar king of Babylon defeated in the fourth year of Jehoiakim son of Josiah, king of Judah:",
      "links": "<a href='/AIV/12/23/29'>2 Kings 23:29</a>; <a href='/AIV/24/25/1'>Jer. 25:1</a>",
      "comment": "Historical note: This battle (605 BC) was a major world event, marking Babylon's dominance. Highlights God directing world history."
    },
    {
      "pk": 2464603,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 3,
      "text": "'Prepare the buckler and shield, and advance for battle!'",
      "links": "<a href='/AIV/23/21/5'>Isa. 21:5</a>",
      "comment": "God is summoning Egypt's army to battle, but ironically, for their own defeat. Shows divine control even over the preparations of human powers."
    },
    {
      "pk": 2464604,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 4,
      "text": "'Harness the horses, mount the chariots, take your positions with your helmets on. Sharpen your spears, put on armor!'",
      "links": "<a href='/AIV/2/15/4'>Ex. 15:4</a>",
      "comment": "The imagery recalls Egypt’s former military glory, but also alludes to their former defeat at the Red Sea (Ex. 15:4)."
    },
    {
      "pk": 2464605,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 5,
      "text": "'Why have I seen it? They are dismayed and turning back. Their mighty ones are beaten down and flee headlong; they do not look back—terror on every side!’ declares the LORD.",
      "links": "<a href='/AIV/24/6/25'>Jer. 6:25</a>; <a href='/AIV/24/20/3'>Jer. 20:3</a>",
      "comment": "\"Terror on every side\" is a refrain in Jeremiah expressing God's inescapable judgment."
    },
    {
      "pk": 2464606,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 6,
      "text": "The swift cannot flee away, nor the warrior escape; in the north by the river Euphrates they have stumbled and fallen.",
      "links": "<a href='/AIV/24/25/9'>Jer. 25:9</a>",
      "comment": "No earthly strength can withstand the judgment decreed by God. Echoes prophetic warnings elsewhere to trust in God rather than military might."
    },
    {
      "pk": 2464607,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 7,
      "text": "Who is this rising like the Nile, like rivers whose waters surge?",
      "links": "<a href='/AIV/23/8/7'>Isa. 8:7–8</a>",
      "comment": "Egypt is often compared to the Nile, signifying both pride and power, yet is about to be humbled."
    },
    {
      "pk": 2464608,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 8,
      "text": "Egypt rises like the Nile, and his waters surge out. He says, 'I will rise up, I will cover the earth, I will destroy cities and their inhabitants.'",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>",
      "comment": "Egypt’s self-assertion is contrasted with divine reality—pride goes before a fall."
    },
    {
      "pk": 2464609,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 9,
      "text": "Charge, you horses! Race furiously, you chariots! Let the warriors go out, men of Cush and Put who handle the shield, men of Lud skilled in handling the bow.",
      "links": "<a href='/AIV/26/30/5'>Ezek. 30:5</a>",
      "comment": "Foreign mercenaries were common in Egyptian armies. Even international alliances are no match for God's decree."
    },
    {
      "pk": 2464610,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 10,
      "text": "But that day belongs to the Lord GOD of Hosts, a day of vengeance, to avenge Himself on His enemies. The sword will devour and be satisfied, and drink its fill of their blood. For the Lord GOD of Hosts holds a sacrifice in the north country by the river Euphrates.",
      "links": "<a href='/AIV/24/25/31'>Jer. 25:31</a>; <a href='/AIV/23/34/6'>Isa. 34:6</a>",
      "comment": "The battle is portrayed as a sacrificial offering, prefiguring the ultimate justice of God. Some Church Fathers saw sacrificial language across all of Scripture as foreshadowing the later, perfect Sacrifice (cf. Heb. 9:12-14)."
    },
    {
      "pk": 2464611,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 11,
      "text": "Go up to Gilead and take balm, O virgin daughter of Egypt! In vain you multiply remedies; there is no healing for you.",
      "links": "<a href='/AIV/24/8/22'>Jer. 8:22</a>",
      "comment": "Human remedies cannot solve the problem of sin and judgment. The language points to the need for a healing beyond human ability, fulfilled in Christ the true Physician (cf. Matt. 9:12)."
    },
    {
      "pk": 2464612,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 12,
      "text": "The nations have heard of your shame; your cry fills the earth. For warrior stumbles against warrior, both fall together.",
      "links": "<a href='/AIV/24/47/2'>Jer. 47:2</a>",
      "comment": "Egypt’s fall is public; no one can hide from God’s judgment. This universal scope foreshadows the coming day of judgment upon all nations."
    },
    {
      "pk": 2464613,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 13,
      "text": "The word that the LORD spoke to Jeremiah the prophet about the coming of Nebuchadnezzar, king of Babylon, to strike the land of Egypt:",
      "links": "<a href='/AIV/24/43/10-13'>Jer. 43:10–13</a>",
      "comment": "A new prophecy: God not only humbles Egypt by Carchemish but also predicts an actual Babylonian invasion into Egypt itself."
    },
    {
      "pk": 2464614,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 14,
      "text": "Declare in Egypt, proclaim in Migdol, proclaim in Memphis and Tahpanhes; say, ‘Take your positions and be ready, for the sword devours around you.’",
      "links": "<a href='/AIV/24/44/1'>Jer. 44:1</a>",
      "comment": "Major Egyptian cities are mentioned to show the totality of God’s judgment; no refuge will remain."
    },
    {
      "pk": 2464615,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 15,
      "text": "Why are your mighty ones swept away? They do not stand, for the LORD has thrust them down.",
      "links": "<a href='/AIV/19/147/6'>Ps. 147:6</a>",
      "comment": "It is the LORD who brings down the proud and powerful; human pride is always subject to divine sovereignty."
    },
    {
      "pk": 2464616,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 16,
      "text": "He made many stumble; they fall over one another. They say, ‘Arise, let us go back to our own people and to the land of our birth, away from the oppressing sword.’",
      "links": "<a href='/AIV/24/50/16'>Jer. 50:16</a>",
      "comment": "Panic causes even mercenaries to abandon Egypt. Shows how fleeting man’s trust is in earthly powers and alliances."
    },
    {
      "pk": 2464617,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 17,
      "text": "There they will call out: ‘Pharaoh king of Egypt is but a noise; he has let the appointed time pass by.’",
      "links": "<a href='/AIV/26/30/21'>Ezek. 30:21</a>",
      "comment": "Pharaoh’s vaunted power is called an 'empty noise.' Failure to act at the appointed time is a common biblical image for God exposing human impotence."
    },
    {
      "pk": 2464618,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 18,
      "text": "As I live, declares the King, whose name is the LORD of Hosts, surely like Tabor among the mountains and like Carmel by the sea, so shall he come.",
      "links": "<a href='/AIV/19/24/10'>Ps. 24:10</a>; <a href='/AIV/18/23/7-8'>Job 23:7–8</a>",
      "comment": "God’s sovereign decree is as certain as the most prominent landmarks. 'King' is a title pointing beyond human rulers to God’s universal kingship."
    },
    {
      "pk": 2464619,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 19,
      "text": "Prepare your baggage for exile, O daughter dwelling in Egypt, for Memphis shall become a desolation, without inhabitant.",
      "links": "<a href='/AIV/24/2/16'>Jer. 2:16</a>",
      "comment": "The call to prepare for exile echoes Israel’s own history. Exile is a recurring biblical sign of covenant judgment."
    },
    {
      "pk": 2464620,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 20,
      "text": "Egypt is a beautiful heifer, but a biting fly from the north is coming—yes, it is coming.",
      "links": "<a href='/AIV/24/1/14'>Jer. 1:14</a>",
      "comment": "Egypt’s beauty cannot withstand the coming invader (Babylon, from the north). Animal imagery often emphasizes vulnerability before God’s will."
    },
    {
      "pk": 2464621,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 21,
      "text": "Even her mercenaries within her are like fattened calves, but they have turned and fled together; they did not stand, for the day of their calamity has come upon them, the time of their punishment.",
      "links": "<a href='/AIV/24/50/27'>Jer. 50:27</a>",
      "comment": "The fate of the mercenaries shows that no one escapes the appointed day of reckoning. 'Fattened calves' evoke images of sacrifice and judgment."
    },
    {
      "pk": 2464622,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 22,
      "text": "Her voice shall hiss like a serpent, for they march with an army and come against her with axes, like those who cut down trees.",
      "links": "<a href='/AIV/23/10/34'>Isa. 10:34</a>; <a href='/AIV/24/51/22-23'>Jer. 51:22–23</a>",
      "comment": "The imagery reinforces Egypt’s humiliating defeat. The serpent’s hiss may also recall the ancient enemy in Genesis 3."
    },
    {
      "pk": 2464623,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 23,
      "text": "They shall cut down her forest, declares the LORD, though it is impenetrable, for they are more numerous than locusts; they are without number.",
      "links": "<a href='/AIV/29/1/6'>Joel 1:6</a>",
      "comment": "The invading armies are compared to a locust swarm—uncontrollable and overwhelming, signifying the totality of the coming destruction."
    },
    {
      "pk": 2464624,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 24,
      "text": "The daughter of Egypt shall be put to shame; she shall be handed over to a people from the north.",
      "links": "<a href='/AIV/24/47/2'>Jer. 47:2</a>",
      "comment": "The motif of daughter signifies Egypt as if she were a cherished daughter, showing both affection and discipline in God’s dealings with nations."
    },
    {
      "pk": 2464625,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 25,
      "text": "The LORD of Hosts, the God of Israel, says: Behold, I am bringing punishment upon Amon of Thebes, Pharaoh and Egypt, her gods and her kings, upon Pharaoh and those who trust in him.",
      "links": "<a href='/AIV/24/43/13'>Jer. 43:13</a>; <a href='/AIV/2/12/12'>Ex. 12:12</a>",
      "comment": "Judgment is not just on human rulers but also on the false gods of Egypt. Shows monotheistic supremacy above all idols (see also Ex. 12:12)."
    },
    {
      "pk": 2464626,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 26,
      "text": "I will give them into the hand of those who seek their life, into the hand of Nebuchadnezzar king of Babylon and his servants. Afterward, Egypt shall be inhabited as in the days of old, declares the LORD.",
      "links": "<a href='/AIV/26/29/13-16'>Ezek. 29:13–16</a>",
      "comment": "After a period of punishment, God promises restoration for Egypt. Demonstrates both His justice and mercy. The pattern of judgment and restoration is key to understanding biblical covenant themes."
    },
    {
      "pk": 2464627,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 27,
      "text": "But do not fear, O Jacob My servant, nor be dismayed, O Israel, for behold, I will save you from far away, and your offspring from the land of their captivity. Jacob will return and have quiet and be at ease, with no one to make him afraid.",
      "links": "<a href='/AIV/24/30/10'>Jer. 30:10</a>; <a href='/AIV/19/46/2'>Ps. 46:2</a>",
      "comment": "A promise of hope and restoration to Israel. This points ahead to God’s ultimate plan of salvation, culminating in Christ, who rescues His people from exile and bondage (cf. Luke 1:68–75)."
    },
    {
      "pk": 2464628,
      "translation": "AIV",
      "book": 24,
      "chapter": 46,
      "verse": 28,
      "text": "Fear not, O Jacob My servant, for I am with you, declares the LORD. I will make a full end of all the nations among whom I scattered you, but of you I will not make a full end. I will discipline you in just measure, yet I will by no means leave you unpunished.",
      "links": "<a href='/AIV/24/10/24'>Jer. 10:24</a>; <a href='/AIV/19/94/12'>Ps. 94:12</a>",
      "comment": "God’s chosen people endure discipline, not destruction. The just correction and ultimate preservation of Israel foreshadows divine discipline and mercy experienced in the life of the worldwide Church."
    }
  ],
  "translatedAt": "2025-12-23T06:38:19.265Z"
}