{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 50,
  "verses": [
    {
      "pk": 30050001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 1,
      "text": "The word that the LORD spoke concerning Babylon, concerning the land of the Chaldeans, by Jeremiah the prophet:",
      "links": "<a href='/AIV/24/25/12-14'>Jer. 25:12-14</a>; <a href='/AIV/23/13/1'>Isa. 13:1</a>",
      "comment": "This introduction sets the tone for the judgment against Babylon. Babylon often symbolizes opposition to God's people and order—see the Book of Revelation for a similar spiritual application (<a href='/AIV/66/17/5'>Rev. 17:5</a>)."
    },
    {
      "pk": 30050002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 2,
      "text": "\"Declare among the nations and proclaim! Set up a banner and announce it! Do not conceal it, but say: ‘Babylon is captured, Bel is put to shame, Merodach is dismayed; her images are put to shame, her idols are dismayed.’\"",
      "links": "<a href='/AIV/23/46/1'>Isa. 46:1</a>; <a href='/AIV/24/51/44'>Jer. 51:44</a>",
      "comment": "Bel and Merodach were chief deities in Babylon. The prophecy’s call to publicly announce the fall points to the universality of God’s sovereignty over all nations."
    },
    {
      "pk": 30050003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 3,
      "text": "\"For out of the north a nation has come up against her; it will make her land desolate, and no one shall dwell in it; both man and beast will flee away.\"",
      "links": "<a href='/AIV/24/51/48'>Jer. 51:48</a>; <a href='/AIV/23/13/17'>Isa. 13:17</a>",
      "comment": "Historically, the Medes and Persians, coming from the north, conquered Babylon. Theologically, God’s judgment is thorough and absolute."
    },
    {
      "pk": 30050004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 4,
      "text": "\"In those days and at that time, declares the LORD, the people of Israel and the people of Judah shall come together, weeping as they seek the LORD their God.\"",
      "links": "<a href='/AIV/24/31/9'>Jer. 31:9</a>; <a href='/AIV/28/3/5'>Hos. 3:5</a>",
      "comment": "Note the unity of Israel and Judah in repentance—a foreshadowing of restored unity among God's people, spiritually fulfilled as believers are reconciled in Christ (<a href='/AIV/43/11/52'>John 11:52</a>)."
    },
    {
      "pk": 30050005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 5,
      "text": "\"They will ask the way to Zion, with faces turned toward it, saying, ‘Come, let us join ourselves to the LORD in an everlasting covenant that will never be forgotten.’\"",
      "links": "<a href='/AIV/24/32/40'>Jer. 32:40</a>; <a href='/AIV/23/55/3'>Isa. 55:3</a>",
      "comment": "The everlasting covenant recalls God’s grace and foreshadows the new covenant established by Christ (<a href='/AIV/42/22/20'>Luke 22:20</a>). The desire for unity and unbroken covenant continues in Christian worship and community."
    },
    {
      "pk": 30050006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 6,
      "text": "\"My people have been lost sheep; their shepherds have led them astray, turning them away on the mountains; they have gone from mountain to hill, they have forgotten their resting place.\"",
      "links": "<a href='/AIV/19/119/176'>Ps. 119:176</a>; <a href='/AIV/26/34/6'>Ezek. 34:6</a>",
      "comment": "Leaders' failure to guide rightly is echoed by Jesus, the Good Shepherd, who gathers the scattered sheep (<a href='/AIV/43/10/11'>John 10:11</a>). Spiritual leadership remains vital for unity and truth."
    },
    {
      "pk": 30050007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 7,
      "text": "\"All who found them have devoured them, and their adversaries said, ‘We are not guilty, because they have sinned against the LORD, their dwelling place of righteousness, the hope of their ancestors, the LORD.’\"",
      "links": "<a href='/AIV/19/71/5'>Ps. 71:5</a>; <a href='/AIV/24/14/7-8'>Jer. 14:7-8</a>",
      "comment": "Sin leads to vulnerability, but God remains their hope. This is a reminder that faithful adherence to God preserves the people."
    },
    {
      "pk": 30050008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 8,
      "text": "\"Flee from the midst of Babylon, and go out of the land of the Chaldeans, and be like male goats leading the flock.\"",
      "links": "<a href='/AIV/24/51/6'>Jer. 51:6</a>; <a href='/AIV/23/48/6'>Isa. 48:20</a>",
      "comment": "God’s call to flee false systems is echoed in the call of Revelation to leave Babylon for holiness (<a href='/AIV/66/18/4'>Rev. 18:4</a>)."
    },
    {
      "pk": 30050009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 9,
      "text": "\"For behold, I am stirring up and bringing against Babylon a multitude of great nations from the land of the north, and they shall array themselves against her; from there she shall be taken. Their arrows are like those of a skilled warrior who does not return empty-handed.\"",
      "links": "<a href='/AIV/24/50/41'>Jer. 50:41</a>; <a href='/AIV/23/13/17'>Isa. 13:17</a>",
      "comment": "God uses other nations as instruments of His justice. Notice His control over history."
    },
    {
      "pk": 30050010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 10,
      "text": "\"Chaldea shall be plundered; all who plunder her will be satisfied, declares the LORD.\"",
      "links": "<a href='/AIV/24/51/48'>Jer. 51:48</a>",
      "comment": "The completeness of Babylon's fall is a sign of divine judgment. Echoes of this appear in apocalyptic literature."
    },
    {
      "pk": 30050011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 11,
      "text": "\"Because you rejoice, because you exult, O plunderers of my heritage, because you frolic like a heifer at threshing, and neigh like stallions,\"",
      "links": "<a href='/AIV/24/12/7'>Jer. 12:7</a>",
      "comment": "Babylon’s arrogance and joy in Israel’s downfall will become their own downfall. Pride always precedes judgment (<a href='/AIV/20/16/18'>Prov. 16:18</a>)."
    },
    {
      "pk": 30050012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 12,
      "text": "\"your mother shall be utterly shamed; she who bore you shall be disgraced. Behold, she shall be the last of the nations, a wilderness, a dry land, and a desert.\"",
      "links": "<a href='/AIV/24/51/43'>Jer. 51:43</a>",
      "comment": "Babylon, once a world power, will become desolate. This also shows sin's ultimate fruit: desolation."
    },
    {
      "pk": 30050013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 13,
      "text": "\"Because of the LORD’s wrath, she will not be inhabited but will be wholly desolate; everyone who passes by Babylon will be appalled and hiss because of all her wounds.\"",
      "links": "<a href='/AIV/24/19/8'>Jer. 19:8</a>; <a href='/AIV/24/51/37'>Jer. 51:37</a>",
      "comment": "Desolation as consequence of wrath is a motif throughout Scripture. This heightens the seriousness with which God regards unfaithfulness."
    },
    {
      "pk": 30050014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 14,
      "text": "\"Set yourselves in array against Babylon all around, all you who bend the bow; shoot at her, do not spare your arrows, for she has sinned against the LORD.\"",
      "links": "<a href='/AIV/24/51/3'>Jer. 51:3</a>",
      "comment": "Divine retribution is portrayed as a military siege. Babylon’s sin is specifically against the LORD, emphasizing responsibility before God."
    },
    {
      "pk": 30050015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 15,
      "text": "\"Raise a shout against her all around; she has surrendered; her bulwarks have fallen, her walls are thrown down. For this is the vengeance of the LORD. Take vengeance on her; as she has done, do to her.\"",
      "links": "<a href='/AIV/24/51/39'>Jer. 51:39</a>; <a href='/AIV/23/47/3'>Isa. 47:3</a>",
      "comment": "‘As she has done, do to her’ echoes the biblical concept of just recompense. Justice is a key attribute of God’s character."
    },
    {
      "pk": 30050016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 16,
      "text": "\"Cut off from Babylon the sower, and the one who handles the sickle in time of harvest; because of the sword of the oppressor, everyone will turn to his own people, and everyone will flee to his own land.\"",
      "links": "<a href='/AIV/24/51/9'>Jer. 51:9</a>",
      "comment": "Total devastation interrupts even daily life and labor. This shows how deeply sin’s consequences run."
    },
    {
      "pk": 30050017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 17,
      "text": "\"Israel is a scattered sheep, driven away by lions. First, the king of Assyria devoured him, and now at last Nebuchadnezzar king of Babylon has gnawed his bones.\"",
      "links": "<a href='/AIV/24/2/15'>Jer. 2:15</a>; <a href='/AIV/12/17/6'>2 Kgs. 17:6</a>",
      "comment": "Israel’s suffering at the hands of Assyria and Babylon maintains the theme of discipline but also sets up hope for future restoration."
    },
    {
      "pk": 30050018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 18,
      "text": "\"Therefore, thus says the LORD of hosts, the God of Israel: Behold, I will punish the king of Babylon and his land, as I punished the king of Assyria.\"",
      "links": "<a href='/AIV/23/14/25'>Isa. 14:25</a>",
      "comment": "God brings just judgment to each oppressor, assuring His people that earthly rulers are subject to His will."
    },
    {
      "pk": 30050019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 19,
      "text": "\"And I will bring Israel back to his pasture, and he shall feed on Carmel and in Bashan, and on the hills of Ephraim and in Gilead his hunger shall be satisfied.\"",
      "links": "<a href='/AIV/24/31/14'>Jer. 31:14</a>",
      "comment": "A promise of restoration and fullness. The pastoral imagery is often used to show God’s tender care for His flock."
    },
    {
      "pk": 30050020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 20,
      "text": "\"In those days and at that time, declares the LORD, iniquity shall be sought in Israel, and there shall be none, and sin in Judah, and none shall be found, for I will pardon those whom I leave as a remnant.\"",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>; <a href='/AIV/33/7/18-19'>Mic. 7:18-19</a>",
      "comment": "Notice the themes of pardon and remnant. Full forgiveness points ahead to Christ, whose sacrifice accomplishes the true remission of sins."
    },
    {
      "pk": 30050021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 21,
      "text": "\"Go up against the land of Merathaim, and against the inhabitants of Pekod. Kill and devote them to destruction, declares the LORD, and do all that I have commanded you.\"",
      "links": "<a href='/AIV/26/23/23'>Ezek. 23:23</a>",
      "comment": "‘Merathaim’ and ‘Pekod’ may be poetic references to Babylon. Total obedience to God’s command is required. ‘Devote to destruction’ is a term of utter judgment."
    },
    {
      "pk": 30050022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 22,
      "text": "\"The sound of battle is in the land, and great destruction!\"",
      "links": "<a href='/AIV/24/51/54'>Jer. 51:54</a>",
      "comment": "The devastation is so great that it is heard throughout the land—a sign of God's power manifest in judgment."
    },
    {
      "pk": 30050023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 23,
      "text": "\"How the hammer of the whole earth is cut down and broken! How Babylon has become a horror among the nations!\"",
      "links": "<a href='/AIV/24/51/20-21'>Jer. 51:20-21</a>",
      "comment": "Babylon was called the hammer due to her power, yet God easily breaks her. Human might is nothing before Him."
    },
    {
      "pk": 30050024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 24,
      "text": "\"I set a snare for you, and you were taken, O Babylon, and you did not know it; you were found and caught, because you opposed the LORD.\"",
      "links": "<a href='/AIV/24/8/8'>Jer. 8:8</a>",
      "comment": "God’s judgment catches Babylon by surprise. Pride in opposition to God leads to downfall."
    },
    {
      "pk": 30050025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 25,
      "text": "\"The LORD has opened His armory and brought out the weapons of His wrath, for the Lord GOD of hosts has a work to do in the land of the Chaldeans.\"",
      "links": "<a href='/AIV/23/13/5'>Isa. 13:5</a>",
      "comment": "Vivid imagery—God is depicted as a divine warrior using all of creation in judgment upon Babylon."
    },
    {
      "pk": 30050026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 26,
      "text": "\"Come against her from every side; open her granaries; pile her up like heaps of grain and destroy her utterly; let nothing be left of her.\"",
      "links": "<a href='/AIV/24/51/3'>Jer. 51:3</a>",
      "comment": "The fall is complete and thorough. Sin and pride result in utter destruction if not repented of."
    },
    {
      "pk": 30050027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 27,
      "text": "\"Kill all her bulls! Let them go down to the slaughter! Woe to them, for their day has come, the time of their punishment.\"",
      "links": "<a href='/AIV/24/46/21'>Jer. 46:21</a>",
      "comment": "‘Bulls’ as a symbol of strength and leaders, yet they cannot escape punishment. God’s timing is perfect in justice."
    },
    {
      "pk": 30050028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 28,
      "text": "\"A voice! Fugitives and refugees from the land of Babylon declare in Zion the vengeance of the LORD our God, vengeance for His temple.\"",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>; <a href='/AIV/19/137/7'>Ps. 137:7</a>",
      "comment": "Divine retribution is specifically for Babylon’s profanation of the temple. The honor of God’s house is a recurring biblical theme."
    },
    {
      "pk": 30050029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 29,
      "text": "\"Summon archers against Babylon, all who bend the bow. Encamp against her all around; let no one escape. Repay her according to her deeds; do to her as she has done. For she has proudly defied the LORD, the Holy One of Israel.\"",
      "links": "<a href='/AIV/24/25/14'>Jer. 25:14</a>",
      "comment": "Another affirmation of ‘measure for measure’ justice. ‘The Holy One of Israel’ is an important title revealing God’s holiness and moral authority."
    },
    {
      "pk": 30050030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 30,
      "text": "\"Therefore, her young men shall fall in her squares, and all her soldiers shall be destroyed on that day, declares the LORD.\"",
      "links": "<a href='/AIV/24/49/26'>Jer. 49:26</a>",
      "comment": "Judgment affects all levels of society, even the young and strong. All earthly power is fleeting."
    },
    {
      "pk": 30050031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 31,
      "text": "\"Behold, I am against you, O proud one, declares the Lord GOD of hosts, for your day has come, the time when I will punish you.\"",
      "links": "<a href='/AIV/24/21/13'>Jer. 21:13</a>",
      "comment": "Pride is the root of Babylon’s fall and a recurring cause of spiritual downfall. Humility is universally commended in Scripture."
    },
    {
      "pk": 30050032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 32,
      "text": "\"The proud one shall stumble and fall, with none to raise him up; and I will kindle a fire in his cities, and it will devour all that is around him.\"",
      "links": "<a href='/AIV/24/49/27'>Jer. 49:27</a>",
      "comment": "Once more, pride leads to destruction. The unquenchable fire is an image of God’s irreversible judgment on unrepentance."
    },
    {
      "pk": 30050033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 33,
      "text": "\"Thus says the LORD of hosts: The people of Israel are oppressed, and the people of Judah with them; all who took them captive have held them fast; they refuse to let them go.\"",
      "links": "<a href='/AIV/24/30/8'>Jer. 30:8</a>",
      "comment": "Oppression binds both Israel and Judah. This sets the scene for themes of deliverance and liberation through divine intervention."
    },
    {
      "pk": 30050034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 34,
      "text": "\"Their Redeemer is strong; the LORD of hosts is His name. He will surely plead their cause, that He may give rest to the earth, but unrest to the inhabitants of Babylon.\"",
      "links": "<a href='/AIV/18/19/25'>Job 19:25</a>; <a href='/AIV/23/43/14'>Isa. 43:14</a>",
      "comment": "God as Redeemer has strong Christological overtones. Themes of advocacy, rest, and judgment foreshadow Christ’s ultimate work as Redeemer."
    },
    {
      "pk": 30050035,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 35,
      "text": "\"A sword against the Chaldeans, declares the LORD, and against the inhabitants of Babylon, and against her officials and her wise men!\"",
      "links": "<a href='/AIV/24/51/57'>Jer. 51:57</a>",
      "comment": "Wisdom apart from God is futile. Notice all classes are included."
    },
    {
      "pk": 30050036,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 36,
      "text": "\"A sword against the diviners, that they may become fools! A sword against her warriors, that they may be destroyed!\"",
      "links": "<a href='/AIV/23/44/25'>Isa. 44:25</a>",
      "comment": "False wisdom and divination are shown as folly before the true God. True guidance comes through God’s authentic revelation."
    },
    {
      "pk": 30050037,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 37,
      "text": "\"A sword against her horses and against her chariots, and against all the foreign troops in her midst, that they may become women! A sword against all her treasures, that they may be plundered!\"",
      "links": "<a href='/AIV/24/51/30'>Jer. 51:30</a>",
      "comment": "Every worldly confidence—military, wealth, foreign alliances—fails before the Lord."
    },
    {
      "pk": 30050038,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 38,
      "text": "\"A drought against her waters, that they may be dried up! For it is a land of images, and they are mad over idols.\"",
      "links": "<a href='/AIV/24/51/36'>Jer. 51:36</a>",
      "comment": "Idolatry is the underlying cause of judgment. Faithful worship is always contrasted with the downfall of idolatrous society."
    },
    {
      "pk": 30050039,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 39,
      "text": "\"Therefore wild animals shall dwell there with hyenas, and ostriches shall dwell in her. She shall never again have people living in her for all generations.\"",
      "links": "<a href='/AIV/23/13/21-22'>Isa. 13:21-22</a>",
      "comment": "Abandonment is the natural end of persistent rebellion. The imagery recalls Sodom and Gomorrah and later applies to spiritual Babylon."
    },
    {
      "pk": 30050040,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 40,
      "text": "\"As when God overthrew Sodom and Gomorrah and their neighboring cities, declares the LORD, so no man shall dwell there, no son of man shall sojourn in her.\"",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>",
      "comment": "Another link to Sodom. Babylon’s judgment is explained in terms of complete destruction."
    },
    {
      "pk": 30050041,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 41,
      "text": "\"Behold, a people comes from the north; a great nation and many kings are stirred up from the farthest parts of the earth.\"",
      "links": "<a href='/AIV/24/51/27-28'>Jer. 51:27-28</a>",
      "comment": "This reiterates the multi-national nature of the judgment against Babylon, ultimately showing the Lord’s sovereignty."
    },
    {
      "pk": 30050042,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 42,
      "text": "\"They seize bow and spear; they are cruel and have no mercy. The sound of them is like the roaring sea; they ride on horses, arranged as a man for battle against you, O daughter of Babylon!\"",
      "links": "<a href='/AIV/24/6/23'>Jer. 6:23</a>",
      "comment": "‘Cruel and have no mercy’—God’s instruments of judgment often exceed what people expect. ‘Daughter of Babylon’ highlights both Babylon’s present pride and future doom."
    },
    {
      "pk": 30050043,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 43,
      "text": "\"The king of Babylon heard the report of them, and his hands grew feeble; anguish seized him, pain as of a woman in labor.\"",
      "links": "<a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "The proud king is reduced to helplessness. The ‘woman in labor’ image represents unavoidable, overwhelming judgment."
    },
    {
      "pk": 30050044,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 44,
      "text": "\"Behold, like a lion coming up from the thickets of the Jordan against a secure sheepfold, so I will suddenly chase them away from her. And I will appoint over her whomever I choose. For who is like Me? Who will summon Me? What shepherd can stand before Me?\"",
      "links": "<a href='/AIV/24/49/19'>Jer. 49:19</a>",
      "comment": "God’s sovereignty is ultimate and unquestionable. His authority is above all, a truth reinforced in both Old and New Testaments."
    },
    {
      "pk": 30050045,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 45,
      "text": "\"Therefore, hear the plan that the LORD has made against Babylon, and the purposes He has formed against the land of the Chaldeans: Surely the little ones of the flock shall be dragged away; surely their fold shall be appalled at their fate.\"",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>",
      "comment": "God’s deliberation before judgment is intentional, not random. No one escapes the reach of His justice."
    },
    {
      "pk": 30050046,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 50,
      "verse": 46,
      "text": "\"At the sound of Babylon’s capture, the earth trembles, and her cry is heard among the nations.\"",
      "links": "<a href='/AIV/24/51/54'>Jer. 51:54</a>",
      "comment": "The fall of Babylon reverberates worldwide, a type and sign for the overthrow of all evil empires in the spiritual sense. God’s victory is proclaimed to the ends of the earth."
    }
  ],
  "translatedAt": "2025-12-24T08:49:52.477Z"
}