{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 50,
  "verses": [
    {
      "pk": 1950050,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 1,
      "text": "The word that the LORD spoke concerning Babylon, concerning the land of the Chaldeans, by Jeremiah the prophet:",
      "links": "<a href='/AIV/24/25/12'>Jer. 25:12</a>; <a href='/AIV/23/13/1'>Isa. 13:1</a>",
      "comment": "The introduction signals this as a prophetic oracle addressed to Babylon. 'Chaldeans' is another name for Babylonians."
    },
    {
      "pk": 1950051,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 2,
      "text": "\"Declare among the nations and proclaim; set up a standard and proclaim, do not hide it. Say: 'Babylon is captured, Bel is put to shame, Marduk is dismayed. Her images are put to shame, her idols are shattered.'\"",
      "links": "<a href='/AIV/23/46/1'>Isa. 46:1</a>; <a href='/AIV/24/51/44'>Jer. 51:44</a>",
      "comment": "Bel and Marduk were chief deities of Babylon. This verse shows their defeat before the one true God."
    },
    {
      "pk": 1950052,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 3,
      "text": "\"For out of the north a nation has come up against her; it will make her land a desolation, and no one shall dwell in it. Both man and beast will flee away.\"",
      "links": "<a href='/AIV/24/51/48'>Jer. 51:48</a>; <a href='/AIV/23/13/17'>Isa. 13:17</a>",
      "comment": "The 'nation out of the north' historically refers to the Medes and Persians. This anticipates Babylon’s ruin and exile."
    },
    {
      "pk": 1950053,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 4,
      "text": "\"In those days and at that time,” declares the LORD, “the people of Israel shall come, they and the people of Judah together, weeping as they go, and they will seek the LORD their God.\"",
      "links": "<a href='/AIV/24/31/9'>Jer. 31:9</a>; <a href='/AIV/28/3/5'>Hos. 3:5</a>",
      "comment": "Israel and Judah together hints at their future unity and restoration—a theme fulfilled ultimately in Christ's gathering of God's people."
    },
    {
      "pk": 1950054,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 5,
      "text": "\"They will ask the way to Zion, with faces turned toward it, saying, ‘Come, let us join ourselves to the LORD with an everlasting covenant that will never be forgotten.’\"",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>; <a href='/AIV/58/13/20'>Heb. 13:20</a>",
      "comment": "The everlasting covenant points forward to the new covenant made perfect in Christ (<a href='/AIV/58/8/8-12'>Heb. 8:8-12</a>)."
    },
    {
      "pk": 1950055,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 6,
      "text": "\"My people have been lost sheep; their shepherds have led them astray, turning them away on the mountains. They have gone from mountain to hill; they have forgotten their rest place.\"",
      "links": "<a href='/AIV/19/119/176'>Ps. 119:176</a>; <a href='/AIV/23/53/6'>Isa. 53:6</a>",
      "comment": "This image of lost sheep is repeated by Jesus in describing sinners (<a href='/AIV/42/15/4-7'>Luke 15:4-7</a>), implying His role as the Good Shepherd."
    },
    {
      "pk": 1950056,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 7,
      "text": "\"All who found them have devoured them, and their enemies have said, ‘We are not guilty, for they have sinned against the LORD, their dwelling place of righteousness, the hope of their fathers, the LORD.’\"",
      "links": "<a href='/AIV/19/90/1'>Ps. 90:1</a>; <a href='/AIV/24/17/13'>Jer. 17:13</a>",
      "comment": "The invaders justify their actions, yet God still claims ownership and promises ultimate intervention for His people."
    },
    {
      "pk": 1950057,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 8,
      "text": "\"Flee from the midst of Babylon, and go out of the land of the Chaldeans, and be as male goats before the flock.\"",
      "links": "<a href='/AIV/24/51/6'>Jer. 51:6</a>; <a href='/AIV/23/48/6'>Isa. 48:20</a>",
      "comment": "God calls His people to separate from Babylon’s corruption—anticipating the Christian call to holiness (see <a href='/AIV/66/18/4'>Rev. 18:4</a>)."
    },
    {
      "pk": 1950058,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 9,
      "text": "\"For behold, I am stirring up and bringing against Babylon a group of great nations from the north country, and they shall array themselves against her; from there she shall be taken. Their arrows are like a skilled warrior who does not return empty-handed.\"",
      "links": "<a href='/AIV/24/25/14'>Jer. 25:14</a>; <a href='/AIV/24/51/11'>Jer. 51:11</a>",
      "comment": "A prophecy of conquest by a coalition of nations; historically fulfilled by the Medes and Persians."
    },
    {
      "pk": 1950059,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 10,
      "text": "\"Chaldea shall become plunder; all who plunder her shall be satisfied,” declares the LORD.",
      "links": "<a href='/AIV/24/51/13'>Jer. 51:13</a>",
      "comment": "God decrees complete judgment and spoil for Babylon’s conquerors."
    },
    {
      "pk": 1950060,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 11,
      "text": "\"Though you rejoice, though you exult, O plunderers of my heritage, though you leap like a heifer in the grass and neigh like stallions,\"",
      "links": "<a href='/AIV/24/12/6'>Jer. 12:6</a>; <a href='/AIV/19/137/3'>Ps. 137:3</a>",
      "comment": "The Babylonians’ pride is condemned. God defends the 'heritage' of His people."
    },
    {
      "pk": 1950061,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 12,
      "text": "\"your mother shall be utterly ashamed; she who bore you shall be humiliated. Behold, she shall be the least of the nations, a wilderness, a dry land and a desert.\"",
      "links": "<a href='/AIV/24/51/43'>Jer. 51:43</a>",
      "comment": "Babylon, once a mother of nations, will become so desolate as to be unrecognizable."
    },
    {
      "pk": 1950062,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 13,
      "text": "\"Because of the wrath of the LORD she shall not be inhabited but shall be wholly desolate; everyone who passes by Babylon will be appalled and hiss because of all her wounds.\"",
      "links": "<a href='/AIV/24/49/17'>Jer. 49:17</a>; <a href='/AIV/24/18/16'>Jer. 18:16</a>",
      "comment": "This devastation is a punishment for Babylon's great pride and violence."
    },
    {
      "pk": 1950063,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 14,
      "text": "\"Set yourselves in array against Babylon all around, all you who bend the bow; shoot at her, spare no arrows, for she has sinned against the LORD.\"",
      "links": "<a href='/AIV/24/50/24'>v. 24</a>",
      "comment": "Universal judgment—Babylon’s downfall is attributed to sin against the Lord, not just against other nations."
    },
    {
      "pk": 1950064,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 15,
      "text": "\"Shout against her all around; she has surrendered; her towers have fallen, her walls are thrown down. For this is the vengeance of the LORD. Take vengeance on her; do to her as she has done.\"",
      "links": "<a href='/AIV/24/46/10'>Jer. 46:10</a>; <a href='/AIV/24/51/6'>Jer. 51:6</a>",
      "comment": "Divine retribution—'do to her as she has done' reflects the principle of divine justice."
    },
    {
      "pk": 1950065,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 16,
      "text": "\"Cut off from Babylon the sower and the one who handles the sickle in time of harvest; because of the sword of the oppressor, everyone shall turn to his own people, each will flee to his own land.\"",
      "links": "<a href='/AIV/24/51/6'>Jer. 51:6</a>",
      "comment": "Total disruption is described; the land is abandoned and unsafe."
    },
    {
      "pk": 1950066,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 17,
      "text": "\"Israel is a scattered flock that lions have driven away. First, the king of Assyria devoured him, and last, Nebuchadnezzar king of Babylon gnawed his bones.\"",
      "links": "<a href='/AIV/11/14/15'>1 Kings 14:15</a>; <a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>",
      "comment": "Assyria and Babylon are compared to predatory beasts, but Israel remains God’s flock."
    },
    {
      "pk": 1950067,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 18,
      "text": "\"Therefore, thus says the LORD of hosts, the God of Israel: Behold, I am punishing the king of Babylon and his land, as I punished the king of Assyria.\"",
      "links": "<a href='/AIV/24/50/17'>v. 17</a>; <a href='/AIV/24/51/44'>Jer. 51:44</a>",
      "comment": "God’s justice does not leave Israel’s oppressors unpunished."
    },
    {
      "pk": 1950068,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 19,
      "text": "\"I will bring Israel back to his pasture, and he shall graze on Carmel and in Bashan, and his desire shall be satisfied on the hills of Ephraim and in Gilead.\"",
      "links": "<a href='/AIV/24/31/8-9'>Jer. 31:8-9</a>; <a href='/AIV/28/2/15'>Hos. 2:15</a>",
      "comment": "This restoration prophecy points not only to the return from exile but to ultimate spiritual renewal."
    },
    {
      "pk": 1950069,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 20,
      "text": "\"In those days and at that time, declares the LORD, iniquity shall be sought in Israel, and there shall be none, and sin in Judah, and none shall be found; for I will pardon those whom I leave as a remnant.\"",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>; <a href='/AIV/33/7/18-20'>Mic. 7:18-20</a>",
      "comment": "This radical forgiveness foreshadows God's perfect mercy through Jesus Christ (<a href='/AIV/45/11/27'>Rom. 11:27</a>)."
    },
    {
      "pk": 1950070,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 21,
      "text": "\"Go up against the land of Merathaim, and against the inhabitants of Pekod. Slay and devote them to destruction, declares the LORD, and do all that I have commanded you.\"",
      "links": "<a href='/AIV/24/50/26'>v. 26</a>",
      "comment": "‘Merathaim’ and ‘Pekod’ are symbolic names for Babylon or parts of it, underscoring the totality of judgment."
    },
    {
      "pk": 1950071,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 22,
      "text": "\"The noise of battle is in the land, and great destruction!\"",
      "links": "<a href='/AIV/24/50/46'>v. 46</a>",
      "comment": "The devastation is depicted as deafening and complete."
    },
    {
      "pk": 1950072,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 23,
      "text": "\"How the hammer of the whole earth is cut down and broken! How Babylon has become a horror among the nations!\"",
      "links": "<a href='/AIV/24/51/20'>Jer. 51:20</a>",
      "comment": "Babylon was once the executor of judgment, now it is judged."
    },
    {
      "pk": 1950073,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 24,
      "text": "\"I set a snare for you, and you were caught, O Babylon, and you did not know it. You were found and seized because you opposed the LORD.\"",
      "links": "<a href='/AIV/24/50/14'>v. 14</a>",
      "comment": "Babylon’s downfall is God’s act; human pride blinds to spiritual danger."
    },
    {
      "pk": 1950074,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 25,
      "text": "\"The LORD has opened his armory and brought out the weapons of his wrath, for the Lord GOD of hosts has a work to do in the land of the Chaldeans.\"",
      "links": "<a href='/AIV/24/49/26'>Jer. 49:26</a>",
      "comment": "God is depicted as a divine warrior; the language anticipates ultimate spiritual victory (see <a href='/AIV/66/19/15'>Rev. 19:15</a>)."
    },
    {
      "pk": 1950075,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 26,
      "text": "\"Come against her from every side; open her granaries. Pile her up like heaps of grain, and devote her to destruction. Let nothing be left of her.\"",
      "links": "<a href='/AIV/24/50/21'>v. 21</a>; <a href='/AIV/24/51/3'>Jer. 51:3</a>",
      "comment": "The totality of destruction is emphasized; none who oppose God ultimately stand."
    },
    {
      "pk": 1950076,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 27,
      "text": "\"Kill all her bulls; let them go down to the slaughter. Woe to them, for their day has come, the time of their punishment.\"",
      "links": "<a href='/AIV/24/46/21'>Jer. 46:21</a>",
      "comment": "The imagery of 'bulls' may mean Babylon’s warriors; their 'day' is the day of judgment."
    },
    {
      "pk": 1950077,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 28,
      "text": "\"The voice of those who flee and escape from the land of Babylon, to declare in Zion the vengeance of the LORD our God, vengeance for his temple.\"",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "Babylon is judged for desecrating the temple; God’s holiness requires that holy things be treated reverently."
    },
    {
      "pk": 1950078,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 29,
      "text": "\"Summon archers against Babylon, all those who bend the bow; encamp around her, let no one escape. Repay her according to her deeds; do to her as she has done. For she has proudly defied the LORD, the Holy One of Israel.\"",
      "links": "<a href='/AIV/24/50/15'>v. 15</a>; <a href='/AIV/19/137/8'>Ps. 137:8</a>",
      "comment": "Justice for pride; the title 'Holy One of Israel' links this with earlier high Christology (see <a href='/AIV/23/41/14'>Isa. 41:14</a>)."
    },
    {
      "pk": 1950079,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 30,
      "text": "\"Therefore her young men shall fall in her squares, and all her soldiers shall be destroyed on that day, declares the LORD.\"",
      "links": "<a href='/AIV/24/49/26'>Jer. 49:26</a>",
      "comment": "'That day' refers to the time of divine retribution."
    },
    {
      "pk": 1950080,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 31,
      "text": "\"Behold, I am against you, O proud one, declares the Lord GOD of hosts, for your day has come, the time when I will punish you.\"",
      "links": "<a href='/AIV/24/50/29'>v. 29</a>",
      "comment": "God uses the title 'Lord of hosts'—the Lord of heaven’s armies."
    },
    {
      "pk": 1950081,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 32,
      "text": "\"The proud one shall stumble and fall, with no one to raise him up, and I will kindle a fire in his cities, and it will devour all who are around him.\"",
      "links": "<a href='/AIV/23/47/1'>Isa. 47:1</a>",
      "comment": "The language also becomes a warning of spiritual pride (see <a href='/AIV/59/4/6'>James 4:6</a>)."
    },
    {
      "pk": 1950082,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 33,
      "text": "\"Thus says the LORD of hosts: The people of Israel are oppressed, and the people of Judah with them. All who took them captive have held them fast and refuse to let them go.\"",
      "links": "<a href='/AIV/24/50/17'>v. 17</a>",
      "comment": "Israel and Judah are suffering together—pointing forward to the need for unity and restoration among God’s people."
    },
    {
      "pk": 1950083,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 34,
      "text": "\"Their Redeemer is strong; the LORD of hosts is his name. He will surely plead their cause, that he may give rest to the earth but unrest to the inhabitants of Babylon.\"",
      "links": "<a href='/AIV/02/6/6'>Ex. 6:6</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "God as Redeemer; the same title applied to Christ, our ultimate deliverer (<a href='/AIV/50/2/7'>Phil. 2:7</a>)."
    },
    {
      "pk": 1950084,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 35,
      "text": "\"A sword against the Chaldeans, declares the LORD, and against the inhabitants of Babylon, and against her officials and her wise men!\"",
      "links": "<a href='/AIV/24/27/7'>Jer. 27:7</a>",
      "comment": "Everyone—leaders and wise men—are subject to judgment."
    },
    {
      "pk": 1950085,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 36,
      "text": "\"A sword against the diviners, that they may become fools! A sword against her warriors, that they may be destroyed!\"",
      "links": "<a href='/AIV/23/47/10-13'>Isa. 47:10-13</a>",
      "comment": "God unmasks false wisdom and exposes idolatry."
    },
    {
      "pk": 1950086,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 37,
      "text": "\"A sword against her horses and against her chariots, and against all the foreign troops in her midst, that they may become women! A sword against her treasures, that they may be plundered!\"",
      "links": "<a href='/AIV/24/51/30'>Jer. 51:30</a>",
      "comment": "Military strength and wealth cannot save Babylon."
    },
    {
      "pk": 1950087,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 38,
      "text": "\"A drought against her waters, that they may be dried up! For it is a land of images, and they are mad over idols.\"",
      "links": "<a href='/AIV/02/7/19'>Ex. 7:19</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Idolatry brings God's curse; water symbolizes blessing, so its loss is judgment."
    },
    {
      "pk": 1950088,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 39,
      "text": "\"Therefore wild animals and hyenas shall live there, and ostriches shall dwell there. Babylon shall never again have people living in it, from generation to generation.\"",
      "links": "<a href='/AIV/23/13/21'>Isa. 13:21</a>; <a href='/AIV/24/51/37'>Jer. 51:37</a>",
      "comment": "The city’s utter desolation fulfills earlier warnings in the prophets."
    },
    {
      "pk": 1950089,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 40,
      "text": "\"As when God overthrew Sodom and Gomorrah and their neighbors,\" declares the LORD, \"so no one shall dwell there, and no man shall sojourn in her.\"",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "An allusion to the total annihilation of Sodom and Gomorrah, making a parallel with Babylon’s judgment."
    },
    {
      "pk": 1950090,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 41,
      "text": "\"Behold, a people is coming from the north; a mighty nation and many kings are stirring from the ends of the earth.\"",
      "links": "<a href='/AIV/24/6/22'>Jer. 6:22</a>; <a href='/AIV/24/50/3'>v. 3</a>",
      "comment": "Further prophecy of the invading forces; echoes Jeremiah’s repeated warnings."
    },
    {
      "pk": 1950091,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 42,
      "text": "\"They seize the bow and spear; they are cruel and show no mercy. The sound of them is like the roaring sea. They ride on horses, arrayed as a man for battle against you, O daughter of Babylon!\"",
      "links": "<a href='/AIV/24/6/23'>Jer. 6:23</a>",
      "comment": "The 'daughter of Babylon' stresses that even the most favored part is not exempt from destruction."
    },
    {
      "pk": 1950092,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 43,
      "text": "\"The king of Babylon heard the report of them, and his hands grew feeble; anguish seized him, pain as of a woman in labor.\"",
      "links": "<a href='/AIV/24/6/24'>Jer. 6:24</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "Babylon’s king experiences total helplessness, a reversal of fortune."
    },
    {
      "pk": 1950093,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 44,
      "text": "\"Behold, one like a lion coming up from the thickets of the Jordan against a strong pasture; I will suddenly make them run away from her. And whoever is chosen, I will appoint over her. For who is like me? Who will summon me? What shepherd can stand before me?\"",
      "links": "<a href='/AIV/24/49/19'>Jer. 49:19</a>; <a href='/AIV/18/41/10'>Job 41:10</a>",
      "comment": "God’s sovereignty is absolute. No leader compares, foreshadowing the authority Christ claims for Himself."
    },
    {
      "pk": 1950094,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 45,
      "text": "\"Therefore, hear the plan that the LORD has made against Babylon, and the purposes he has planned against the land of the Chaldeans: Surely the little ones of the flock shall be drawn away; surely their pasture shall be made desolate because of them.\"",
      "links": "<a href='/AIV/24/51/11'>Jer. 51:11</a>",
      "comment": "God’s decree affects all, from greatest to least."
    },
    {
      "pk": 1950095,
      "translation": "AIV",
      "book": 24,
      "chapter": 50,
      "verse": 46,
      "text": "\"At the sound of Babylon’s capture the earth will tremble, and the cry among the nations will be heard.\"",
      "links": "<a href='/AIV/24/49/21'>Jer. 49:21</a>; <a href='/AIV/66/18/9-20'>Rev. 18:9-20</a>",
      "comment": "Babylon’s fall would shake the known world—a type for the fall of worldly power and the final judgment. In the spiritual sense, it foreshadows the decisive victory of Christ’s kingdom over all earthly opposition."
    }
  ],
  "translatedAt": "2025-12-23T06:41:15.424Z"
}