{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 49,
  "verses": [
    {
      "pk": 30049001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 1,
      "text": "Concerning the people of Ammon: Thus says the LORD, 'Does Israel have no sons? Is there no one to possess his inheritance? Why then has Milcom taken possession of Gad, and his people settled in its cities?'",
      "links": "<a href='/AIV/07/11/12-13'>Judg. 11:12-13</a>; <a href='/AIV/24/25/21'>Jer. 25:21</a>",
      "comment": "The rhetorical questions emphasize God's justice regarding Ammon's encroachment upon Israel's territory. 'Milcom' here refers to the god of the Ammonites. Note the concern for rightful inheritance, which echoes themes of authority and stewardship found elsewhere (see <a href='/AIV/01/12/7'>Gen. 12:7</a>)."
    },
    {
      "pk": 30049002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 2,
      "text": "Therefore, behold, the days are coming, says the LORD, when I will cause an alarm of war to be heard against Rabbah of the Ammonites; it shall become a desolate heap, and her villages shall be burned with fire. Then Israel shall dispossess those who dispossessed him, says the LORD.",
      "links": "<a href='/AIV/26/25/5'>Ezek. 25:5</a>; <a href='/AIV/05/19/1'>Deut. 19:1</a>",
      "comment": "God promises restoration of Israel's inheritance and judgement upon Ammon. The reversal anticipates restoration motifs in prophetic literature (see <a href='/AIV/24/30/3'>Jer. 30:3</a>)."
    },
    {
      "pk": 30049003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 3,
      "text": "Wail, O Heshbon, for Ai is devastated! Cry out, O daughters of Rabbah! Gird yourselves with sackcloth, mourn, and run to and fro by the walls; for Milcom shall go into exile, with his priests and his princes together.",
      "links": "<a href='/AIV/06/13/25'>Josh. 13:25</a>; <a href='/AIV/24/48/37'>Jer. 48:37</a>",
      "comment": "'Sackcloth' and mourning signify deep grief and repentance, echoing prophetic calls to contrition. The exile of Milcom, his priests, and princes signals the defeat of false worship and political structures—note parallels in the exiling of false gods (<a href='/AIV/09/05/2'>1 Sam. 5:2</a>)."
    },
    {
      "pk": 30049004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 4,
      "text": "Why do you boast of your valleys, your flowing valley, O faithless daughter, who trusted in her treasures, saying, 'Who will come against me?'",
      "links": "<a href='/AIV/24/07/04'>Jer. 7:4</a>; <a href='/AIV/24/48/14'>Jer. 48:14</a>",
      "comment": "Ammon's confidence in material wealth and physical fortresses is condemned; reliance on earthly possessions rather than the LORD brings ruin (see <a href='/AIV/19/20/7'>Ps. 20:7</a>)."
    },
    {
      "pk": 30049005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 5,
      "text": "Behold, I will bring terror upon you, says the Lord GOD of hosts, from all who are around you, and you shall be driven out, every man straight before him, with none to gather the fugitives.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>; <a href='/AIV/24/48/44'>Jer. 48:44</a>",
      "comment": "The scattering is total, indicating a loss of unity and protection. The theme recalls spiritual consequences of pride (see <a href='/AIV/19/01/6'>Ps. 1:6</a>), and foretells the need for a future shepherd who gathers the flock (see <a href='/AIV/24/23/3'>Jer. 23:3</a>)."
    },
    {
      "pk": 30049006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 6,
      "text": "But afterward I will restore the fortunes of the people of Ammon, declares the LORD.",
      "links": "<a href='/AIV/24/48/47'>Jer. 48:47</a>; <a href='/AIV/24/46/26'>Jer. 46:26</a>",
      "comment": "The restoration of Ammon hints at God's mercy even for the nations. This is a foreshadowing of universal restoration found in prophetic literature and fulfilled in the Messianic era (<a href='/AIV/23/19/19-25'>Isa. 19:19-25</a>)."
    },
    {
      "pk": 30049007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 7,
      "text": "Concerning Edom: Thus says the LORD of hosts: Is wisdom no more in Teman? Has counsel perished from the prudent? Has their wisdom become corrupted?",
      "links": "<a href='/AIV/18/02/11'>Job 2:11</a>; <a href='/AIV/31/1/8'>Obad. 1:8</a>",
      "comment": "Edom, once famed for wisdom, is now bereft. Earthly wisdom is insufficient apart from divine truth (see <a href='/AIV/20/03/5-7'>Prov. 3:5-7</a>)."
    },
    {
      "pk": 30049008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 8,
      "text": "Flee, turn back, dwell deep, O inhabitants of Dedan! For I will bring the destruction of Esau upon him, the time when I punish him.",
      "links": "<a href='/AIV/23/21/13'>Isa. 21:13</a>; <a href='/AIV/04/20/14'>Num. 20:14</a>",
      "comment": "Destruction comes at the appointed time—God’s justice is inevitable. The call to 'dwell deep' is an urging to seek refuge, spiritually interpreted as a call to deeper faith and repentance."
    },
    {
      "pk": 30049009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 9,
      "text": "If grape gatherers came to you, would they not leave gleanings? If thieves came by night, would they not destroy only what suffices?",
      "links": "<a href='/AIV/31/1/5'>Obad. 1:5</a>; <a href='/AIV/03/19/10'>Lev. 19:10</a>",
      "comment": "Unlike limited human destruction, God’s judgement on Edom will be complete, signifying the fullness of divine retribution."
    },
    {
      "pk": 30049010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 10,
      "text": "But I have stripped Esau bare, I have uncovered his hiding places, and he shall not be able to hide himself. His children are destroyed, and his relatives and neighbors perish.",
      "links": "<a href='/AIV/31/1/6'>Obad. 1:6</a>",
      "comment": "Edom’s total exposure and destruction stress the futility of relying on secrecy or human alliances. God sees and judges all (<a href='/AIV/19/139/7-12'>Ps. 139:7-12</a>)."
    },
    {
      "pk": 30049011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 11,
      "text": "Leave your fatherless children, I will keep them alive; and let your widows trust in Me.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/24/15/7'>Jer. 15:7</a>",
      "comment": "Even amidst judgement, God’s mercy extends to the vulnerable. Spiritual interpretation finds here a call to trust in divine providence, a theme fulfilled most perfectly in Christ’s care for His people (<a href='/AIV/40/23/37'>Matt. 23:37</a>)."
    },
    {
      "pk": 30049012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 12,
      "text": "For thus says the LORD: 'If those who did not deserve to drink the cup must drink it, will you go unpunished? You shall not go unpunished, but you must drink.'",
      "links": "<a href='/AIV/24/25/15'>Jer. 25:15</a>; <a href='/AIV/40/20/22'>Matt. 20:22</a>",
      "comment": "'Drinking the cup' symbolizes judgement, a motif later echoed by Jesus regarding the cup of suffering (<a href='/AIV/42/22/20'>Luke 22:20</a>)."
    },
    {
      "pk": 30049013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 13,
      "text": "For I have sworn by Myself, declares the LORD, that Bozrah shall become a horror, a reproach, a waste, and a curse; and all her cities shall be perpetual ruins.",
      "links": "<a href='/AIV/23/63/1'>Isa. 63:1</a>; <a href='/AIV/24/25/29'>Jer. 25:29</a>",
      "comment": "'Sworn by Myself' shows God's sovereign authority, and the nature of oath emphasizing certainty and gravity—mirroring the binding nature of God’s promises."
    },
    {
      "pk": 30049014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 14,
      "text": "I have heard a message from the LORD, and an envoy has been sent among the nations: 'Gather yourselves together and come against her, and rise up for battle!'",
      "links": "<a href='/AIV/31/1/1'>Obad. 1:1</a>; <a href='/AIV/24/46/14'>Jer. 46:14</a>",
      "comment": "God orchestrates even the nations as instruments of His will. Compare the divine summoning of the Gentiles in texts such as <a href='/AIV/23/45/1'>Isa. 45:1</a>."
    },
    {
      "pk": 30049015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 15,
      "text": "For behold, I have made you small among the nations, despised among men.",
      "links": "<a href='/AIV/31/1/2'>Obad. 1:2</a>; <a href='/AIV/24/48/27'>Jer. 48:27</a>",
      "comment": "Edom’s pride results in humiliation. This accords with biblical principles that ‘the last will be first, and the first last’ (<a href='/AIV/40/20/16'>Matt. 20:16</a>)."
    },
    {
      "pk": 30049016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 16,
      "text": "The terror you inspire, the pride of your heart, has deceived you, you who live in clefts of the rock, who hold the heights of the hill. Though you make your nest as high as the eagle's, I will bring you down from there, says the LORD.",
      "links": "<a href='/AIV/31/1/3-4'>Obad. 1:3-4</a>; <a href='/AIV/19/139/8'>Ps. 139:8</a>",
      "comment": "Height and security signify pride, but no place is beyond God’s reach. See spiritual parallel in humility before God (<a href='/AIV/60/05/6'>1 Pet. 5:6</a>)."
    },
    {
      "pk": 30049017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 17,
      "text": "Edom shall become a horror; everyone who passes by will be appalled and will hiss because of all her wounds.",
      "links": "<a href='/AIV/24/19/8'>Jer. 19:8</a>; <a href='/AIV/24/18/16'>Jer. 18:16</a>",
      "comment": "The image of appall and hissing shows the severity of Edom's judgement, serving as a warning to all nations against pride."
    },
    {
      "pk": 30049018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 18,
      "text": "As in the overthrow of Sodom and Gomorrah and their neighboring cities, says the LORD, no man shall dwell there, nor shall a son of man sojourn in it.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/24/50/40'>Jer. 50:40</a>",
      "comment": "Destruction recalls Sodom and Gomorrah—a type for total divine judgement against sin, fulfilled in the last judgement (<a href='/AIV/40/24/37'>Matt. 24:37</a>)."
    },
    {
      "pk": 30049019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 19,
      "text": "Behold, one shall come up like a lion from the thickets of the Jordan against the secure pasture; for in an instant I will make him run away from her. And whoever is chosen, I will appoint over it. For who is like Me? Who will summon Me? Who is that shepherd who can stand before Me?",
      "links": "<a href='/AIV/24/50/44'>Jer. 50:44</a>; <a href='/AIV/02/15/11'>Exod. 15:11</a>",
      "comment": "The shepherd imagery anticipates the messianic role as the true Shepherd, only God is supreme over the flock (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 30049020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 20,
      "text": "Therefore hear the counsel of the LORD that He has taken against Edom, and the purposes that He has purposed against the inhabitants of Teman: Surely the little ones of the flock shall be dragged away; surely He will make their pasture desolate because of them.",
      "links": "<a href='/AIV/24/50/45'>Jer. 50:45</a>",
      "comment": "God's decree is final and irresistible. The 'little ones' being dragged away underlines vulnerability and totality of judgement."
    },
    {
      "pk": 30049021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 21,
      "text": "At the sound of their fall the earth will tremble; the cry will be heard at the Red Sea.",
      "links": "<a href='/AIV/02/14/15'>Exod. 14:15</a>; <a href='/AIV/24/48/20'>Jer. 48:20</a>",
      "comment": "The cosmic scale of the nation’s downfall echoes apocalyptic imagery seen elsewhere (<a href='/AIV/40/24/29'>Matt. 24:29</a>)."
    },
    {
      "pk": 30049022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 22,
      "text": "Behold, he shall come up and fly swiftly like an eagle, and spread his wings against Bozrah; and the hearts of the mighty men of Edom shall be in that day like the heart of a woman in birth pains.",
      "links": "<a href='/AIV/05/28/49'>Deut. 28:49</a>; <a href='/AIV/24/48/41'>Jer. 48:41</a>",
      "comment": "'Eagle' signifies speed and overwhelming force; birth pains are common prophetic language for impending judgement (<a href='/AIV/23/13/8'>Isa. 13:8</a>), with spiritual anticipation of new birth through suffering (see <a href='/AIV/43/16/21'>John 16:21</a>)."
    },
    {
      "pk": 30049023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 23,
      "text": "Concerning Damascus. Hamath and Arpad are confounded, for they have heard bad news; they are melting in fear; there is anxiety on the sea, it cannot be calmed.",
      "links": "<a href='/AIV/23/17/9'>Isa. 17:9</a>; <a href='/AIV/11/20/34'>1 Kings 20:34</a>",
      "comment": "Damascus, symbolic of ancient enemies, faces terror and unrest; seas typically symbolize chaos, here referencing national turmoil."
    },
    {
      "pk": 30049024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 24,
      "text": "Damascus has become feeble, she turns to flee, and panic has seized her; anguish and sorrows have taken hold of her, like a woman in labor.",
      "links": "<a href='/AIV/24/06/24'>Jer. 6:24</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "Repeated birth pain imagery accents the traumatic transition and God’s refining purposes in suffering."
    },
    {
      "pk": 30049025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 25,
      "text": "How is the city of praise not deserted, the city of My joy?",
      "links": "<a href='/AIV/23/17/1'>Isa. 17:1</a>",
      "comment": "Damascus, once esteemed, now desolate—illustrates the fleeting nature of human glory compared to the eternal joy found in God."
    },
    {
      "pk": 30049026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 26,
      "text": "Therefore her young men shall fall in her streets, and all the men of war shall be cut off in that day, says the LORD of hosts.",
      "links": "<a href='/AIV/24/48/15'>Jer. 48:15</a>; <a href='/AIV/23/31/8'>Isa. 31:8</a>",
      "comment": "Judgement upon military strength; the LORD of hosts is sovereign over all armies, pointing to spiritual dependence rather than earthly might."
    },
    {
      "pk": 30049027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 27,
      "text": "I will kindle a fire in the wall of Damascus, and it shall consume the palaces of Ben-hadad.",
      "links": "<a href='/AIV/30/01/4'>Amos 1:4</a>; <a href='/AIV/11/15/18'>1 Kings 15:18</a>",
      "comment": "Divine fire denotes judgement; Ben-hadad represents the dynasty of Syrian kings. Fire frequently signifies purification as well as destruction."
    },
    {
      "pk": 30049028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 28,
      "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon struck: Thus says the LORD: 'Arise, go up to Kedar, and destroy the people of the east!'",
      "links": "<a href='/AIV/01/25/13'>Gen. 25:13</a>; <a href='/AIV/26/27/21'>Ezek. 27:21</a>",
      "comment": "Nomadic tribes are not exempt from judgement. Highlights universality of God's reign and justice."
    },
    {
      "pk": 30049029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 29,
      "text": "Their tents and their flocks shall be taken, their curtains and all their goods; their camels shall be led away from them, and men shall cry out to them, 'Terror on every side!'",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/24/6/25'>Jer. 6:25</a>",
      "comment": "Loss of possessions underlines insecurity of earthly riches (see <a href='/AIV/19/49/16-17'>Ps. 49:16-17</a>)."
    },
    {
      "pk": 30049030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 30,
      "text": "'Flee, wander far away, dwell deep, O inhabitants of Hazor! For Nebuchadnezzar king of Babylon has plotted against you and formed a plan against you,' says the LORD.",
      "links": "<a href='/AIV/24/04/06'>Jer. 4:6</a>; <a href='/AIV/26/38/10'>Ezek. 38:10</a>",
      "comment": "Encouragement to 'dwell deep' again signifies seeking spiritual refuge rather than relying on worldly safety."
    },
    {
      "pk": 30049031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 31,
      "text": "'Arise, go up against a nation that dwells securely, that has no gates or bars, that dwells alone.'",
      "links": "<a href='/AIV/04/23/9'>Num. 23:9</a>; <a href='/AIV/24/15/7'>Jer. 15:7</a>",
      "comment": "Describes peoples trusting in isolation and security—false assurance apart from God leaves one exposed."
    },
    {
      "pk": 30049032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 32,
      "text": "Their camels shall become plunder, and many shall come upon them; I will scatter to every wind those who cut the corners of their hair, and I will bring their calamity from every side, says the LORD.",
      "links": "<a href='/AIV/03/19/27'>Lev. 19:27</a>; <a href='/AIV/24/09/26'>Jer. 9:26</a>",
      "comment": "'Cutting corners of hair' identifies pagan practice. Judgement and dispersal reflect purification of idolatrous nations."
    },
    {
      "pk": 30049033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 33,
      "text": "Hazor shall become a dwelling for jackals, a perpetual waste; no one shall dwell there, nor any son of man shall sojourn in it.",
      "links": "<a href='/AIV/24/09/11'>Jer. 9:11</a>; <a href='/AIV/23/13/20'>Isa. 13:20-22</a>",
      "comment": "Desolation and animal inhabitation serve as prophetic symbols of judgement and separation from God's presence; full restoration only comes through relationship with God."
    },
    {
      "pk": 30049034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 34,
      "text": "The word of the LORD that came to Jeremiah the prophet concerning Elam, in the beginning of the reign of Zedekiah king of Judah.",
      "links": "<a href='/AIV/12/24/34'>2 Kings 24:34</a>; <a href='/AIV/24/25/25'>Jer. 25:25</a>",
      "comment": "New oracle introduced: dating establishes a historical anchor for prophecy, showing fulfillment in God’s timing."
    },
    {
      "pk": 30049035,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 35,
      "text": "Thus says the LORD of hosts: 'Behold, I will break the bow of Elam, the mainstay of their power.'",
      "links": "<a href='/AIV/23/22/6'>Isa. 22:6</a>; <a href='/AIV/19/46/9'>Ps. 46:9</a>",
      "comment": "Symbolically, breaking the bow means breaking military might; God's power surpasses all earthly strength."
    },
    {
      "pk": 30049036,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 36,
      "text": "And I will bring upon Elam the four winds from the four corners of heaven, and scatter them to all those winds; and there shall be no nation to which the outcasts of Elam shall not come.",
      "links": "<a href='/AIV/26/05/12'>Ezek. 5:12</a>; <a href='/AIV/27/07/2'>Dan. 7:2</a>",
      "comment": "Universal scattering recalls Babel and divine judgement (<a href='/AIV/01/11/8'>Gen. 11:8</a>). Eventually, gathered exiles prefigure future spiritual re-gathering in unity under God."
    },
    {
      "pk": 30049037,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 37,
      "text": "I will cause Elam to be dismayed before their enemies and before those who seek their life. I will bring disaster upon them, My fierce anger, says the LORD. I will send the sword after them until I have consumed them.",
      "links": "<a href='/AIV/24/25/31'>Jer. 25:31</a>; <a href='/AIV/23/13/5'>Isa. 13:5</a>",
      "comment": "Severe but just punishment illustrates God’s authority. Righteous anger is purification, fitting with spiritual discipline for correction."
    },
    {
      "pk": 30049038,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 38,
      "text": "And I will set My throne in Elam and will destroy from there king and princes, says the LORD.",
      "links": "<a href='/AIV/24/43/10'>Jer. 43:10</a>; <a href='/AIV/19/47/8'>Ps. 47:8</a>",
      "comment": "Placing God’s throne signals divine rule over the nations. Spiritual interpretation anticipates the universal reign of the Messiah (see <a href='/AIV/22/02/44'>Dan. 2:44</a>)."
    },
    {
      "pk": 30049039,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 49,
      "verse": 39,
      "text": "'But in the latter days, I will restore the fortunes of Elam,' declares the LORD.",
      "links": "<a href='/AIV/44/02/9'>Acts 2:9</a>; <a href='/AIV/24/48/47'>Jer. 48:47</a>",
      "comment": "Final restoration is promised, aligning with prophetic visions of all nations coming into the blessing of God. This restoration is ultimately fulfilled in the Messianic kingdom and the unity of all peoples in worship (see <a href='/AIV/23/19/25'>Isa. 19:25</a>; <a href='/AIV/66/07/9'>Rev. 7:9</a>)."
    }
  ],
  "translatedAt": "2025-12-24T08:48:55.840Z"
}