{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 16,
  "verses": [
    {
      "pk": 30016001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>; <a href='/AIV/24/7/1'>Jer. 7:1</a>",
      "comment": "A consistent motif in Jeremiah is the phrase 'the word of the LORD came to me,' highlighting divine revelation to the prophet. This emphasizes that genuine teaching comes from God Himself through appointed messengers."
    },
    {
      "pk": 30016002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 2,
      "text": "'You must not take a wife or have sons or daughters in this place.'",
      "links": "<a href='/AIV/24/15/1'>Jer. 15:1</a>; <a href='/AIV/28/1/2'>Hos. 1:2</a>",
      "comment": "Jeremiah is commanded to abstain from marriage, a symbolic act that foreshadows the coming judgment on the people. Prophets often model their message in their lives, reflecting the call to sometimes forego worldly pleasures for a higher mission."
    },
    {
      "pk": 30016003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 3,
      "text": "For this is what the LORD says concerning the sons and daughters born in this place, and concerning their mothers and fathers:",
      "links": "<a href='/AIV/24/44/27'>Jer. 44:27</a>",
      "comment": "Here, divine judgment extends to families, showing how sin often affects entire communities. This points to the importance of intergenerational faithfulness and communal responsibility."
    },
    {
      "pk": 30016004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 4,
      "text": "'They will die by deadly diseases; they will not be mourned or buried, but will be like dung on the face of the ground. They shall perish by sword and famine, and their bodies shall become food for the birds and wild animals.'",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/24/25/33'>Jer. 25:33</a>",
      "comment": "Unburied bodies signify utter disgrace and divine judgment. Not being mourned or buried underlines the loss of traditional rites, which were seen as sacred acts of respect."
    },
    {
      "pk": 30016005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 5,
      "text": "For thus says the LORD: 'Do not enter the house of mourning, do not go to lament or grieve for them, for I have withdrawn My peace from this people,' declares the LORD, 'My lovingkindness and mercy.'",
      "links": "<a href='/AIV/24/14/11'>Jer. 14:11</a>; <a href='/AIV/24/16/9'>Jer. 16:9</a>",
      "comment": "God’s withdrawal of peace, lovingkindness, and mercy signals the totality of judgment. This verse subtly echoes the theme of God’s steadfast love, and its removal is catastrophic."
    },
    {
      "pk": 30016006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 6,
      "text": "'Both great and small shall die in this land; they will not be buried, nor will anyone mourn for them or cut themselves or shave their heads for them.'",
      "links": "<a href='/AIV/24/25/33'>Jer. 25:33</a>; <a href='/AIV/05/14/1'>Deut. 14:1</a>",
      "comment": "'Cutting oneself or shaving the head' were mourning rituals prohibited by the Law. The prohibition here is a sign of desolation—normal patterns of grief will be disrupted due to overwhelming death."
    },
    {
      "pk": 30016007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 7,
      "text": "'Nor will they break bread with the mourners to comfort them about the dead, or give them a cup of consolation to drink for their father or mother.'",
      "links": "<a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "Funeral meals and rituals of consolation would be interrupted. This highlights the significance of physical acts of mercy and comfort in the life of faith, echoing the importance of communal support in hardship."
    },
    {
      "pk": 30016008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 8,
      "text": "'You shall not go into the house of feasting, to sit with them, to eat and drink.'",
      "links": "<a href='/AIV/24/15/17'>Jer. 15:17</a>",
      "comment": "Jeremiah is again personally called to live differently, abstaining from celebratory events as another sign of coming judgment. Prophetic vocation often means separation from worldly customs."
    },
    {
      "pk": 30016009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 9,
      "text": "For thus says the LORD of hosts, the God of Israel: 'Behold, I will silence in this place before your eyes and in your days the voice of joy and gladness, the voice of the bridegroom and the bride.'",
      "links": "<a href='/AIV/24/25/10'>Jer. 25:10</a>; <a href='/AIV/19/78/59'>Ps. 78:59</a>",
      "comment": "Silencing joy and marriage celebrations symbolizes deep despair. The ending of traditional ceremonies points to the loss of spiritual and natural blessings."
    },
    {
      "pk": 30016010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 10,
      "text": "'And when you tell this people all these words and they ask you, ‘Why has the LORD pronounced all this great disaster against us? What is our sin, what is our iniquity that we have committed against the LORD our God?’'",
      "links": "<a href='/AIV/24/5/19'>Jer. 5:19</a>; <a href='/AIV/24/5/1'>Jer. 5:1</a>",
      "comment": "The people's question shows spiritual blindness and hardness of heart. Often, stubbornness blocks understanding of God’s judgment and mercy."
    },
    {
      "pk": 30016011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 11,
      "text": "Then say to them, 'Because your fathers abandoned Me,' declares the LORD, 'and followed other gods and served them and worshiped them, and abandoned Me and did not keep My law.'",
      "links": "<a href='/AIV/24/11/10'>Jer. 11:10</a>; <a href='/AIV/02/20/3'>Ex. 20:3</a>",
      "comment": "Here, familial and generational sin brings consequences. Jeremiah points out the crucial reality of maintaining faithfulness across generations—a precursor to the idea of sacred tradition."
    },
    {
      "pk": 30016012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 12,
      "text": "'You have done even worse than your fathers, for behold, each one of you follows his own stubborn evil heart, refusing to listen to Me.'",
      "links": "<a href='/AIV/24/07/26'>Jer. 7:26</a>; <a href='/AIV/24/11/08'>Jer. 11:8</a>",
      "comment": "A recurring theme in Scripture is the danger of following one’s own will over obedience to God. The heart here must be converted and aligned with God's will through divine grace."
    },
    {
      "pk": 30016013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 13,
      "text": "'So I will cast you out of this land into a land you do not know, neither you nor your fathers. There you shall serve other gods day and night, for I will grant you no grace.'",
      "links": "<a href='/AIV/24/09/16'>Jer. 9:16</a>; <a href='/AIV/24/05/19'>Jer. 5:19</a>",
      "comment": "Exile is both punishment and opportunity for purification. Service to foreign gods delivers spiritual consequences, but also sets up the hope for future restoration and redemption."
    },
    {
      "pk": 30016014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 14,
      "text": "'Yet behold, the days are coming,' declares the LORD, 'when it will no longer be said, “As the LORD lives who brought up the children of Israel out of the land of Egypt,”'",
      "links": "<a href='/AIV/02/12/51'>Ex. 12:51</a>; <a href='/AIV/24/23/7-8'>Jer. 23:7-8</a>",
      "comment": "A greater act of deliverance is foretold, surpassing even the Exodus. This points to the continuous, living relationship between God and His people—anticipating a new covenant era."
    },
    {
      "pk": 30016015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 15,
      "text": "'but “As the LORD lives who brought up the children of Israel from the land of the north and out of all the countries where He had driven them.” For I will bring them back to their own land that I gave to their fathers.'",
      "links": "<a href='/AIV/24/23/8'>Jer. 23:8</a>; <a href='/AIV/01/15/18'>Gen. 15:18</a>",
      "comment": "Restoration is promised. God’s faithfulness overcomes even the greatest exile, foreshadowing the ultimate gathering of the faithful in perfected unity—a theme realized spiritually in Christ."
    },
    {
      "pk": 30016016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 16,
      "text": "'I am about to send for many fishermen,' declares the LORD, 'and they will catch them; afterward I will send for many hunters, and they will hunt them from every mountain and hill and out of the clefts of the rocks.'",
      "links": "<a href='/AIV/40/4/19'>Matt. 4:19</a>; <a href='/AIV/24/49/9'>Jer. 49:9</a>",
      "comment": "This imagery is later echoed by Jesus in His call to make 'fishers of men.' The dual symbolism of gathering and searching points to conversion and the calling of the faithful into the new covenant community."
    },
    {
      "pk": 30016017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 17,
      "text": "'For My eyes are on all their ways; they are not hidden from Me, nor is their sin concealed from My sight.'",
      "links": "<a href='/AIV/19/139/2-3'>Ps. 139:2-3</a>; <a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "God’s omniscience is affirmed—nothing escapes His gaze. This assures us of both perfect judgment and merciful opportunity for repentance through confession and reconciliation with God."
    },
    {
      "pk": 30016018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 18,
      "text": "'First I will repay them double for their iniquity and their sin, because they have defiled My land with the carcasses of their detestable idols and have filled My inheritance with their abominations.'",
      "links": "<a href='/AIV/24/2/7'>Jer. 2:7</a>; <a href='/AIV/66/18/6'>Rev. 18:6</a>",
      "comment": "Repaying 'double' is a figure of speech expressing complete justice. The idea of sacred inheritance here also resonates with the theme of the promised land and, spiritually, points to the fullness of God’s eternal kingdom."
    },
    {
      "pk": 30016019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 19,
      "text": "'O LORD, my strength and my fortress, my refuge in the day of distress! To You nations shall come from the ends of the earth and say, “Our fathers possessed nothing but lies, worthless idols that did not profit.”'",
      "links": "<a href='/AIV/24/3/17'>Jer. 3:17</a>; <a href='/AIV/23/2/2'>Isa. 2:2</a>",
      "comment": "Here Jeremiah expresses trust in God amidst tribulation. The prophecy that nations will come to the LORD points to universal salvation and the gathering of believers from every people—a key theme in the Gospel."
    },
    {
      "pk": 30016020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 20,
      "text": "'Can a man make gods for himself? Such are not gods!'",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Idolatry is confronted as always futile. True worship depends on divine initiative, not human invention—affirming the principle of apostolic tradition and proper worship established by God."
    },
    {
      "pk": 30016021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 16,
      "verse": 21,
      "text": "'Therefore I will show them, this time, I will make them know My hand and My might; and they shall know that My name is the LORD.'",
      "links": "<a href='/AIV/02/6/7'>Ex. 6:7</a>; <a href='/AIV/24/33/2'>Jer. 33:2</a>",
      "comment": "God promises revelation of His power and identity. This prepares the way for the New Testament manifestation of God’s name and character, ultimately fulfilled in Christ who reveals the fullness of the divine."
    }
  ],
  "translatedAt": "2025-12-24T08:30:25.296Z"
}