{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 10,
  "verses": [
    {
      "pk": 2401001,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 1,
      "text": "Hear the word that the LORD speaks to you, O house of Israel.",
      "links": "<a href='/AIV/23/1/2'>Isa. 1:2</a>; <a href='/AIV/24/7/2'>Jer. 7:2</a>",
      "comment": "Jeremiah begins with a call to listen, emphasizing God's direct address to His people, continuing the prophetic tradition of demanding attention to God's word."
    },
    {
      "pk": 2401002,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 2,
      "text": "This is what the LORD says: Do not learn the way of the nations, nor be terrified by the signs in the heavens, though the nations are afraid of them.",
      "links": "<a href='/AIV/5/18/9-14'>Deut. 18:9-14</a>; <a href='/AIV/24/44/19'>Jer. 44:19</a>",
      "comment": "God warns against assimilating pagan customs and superstitions, setting Israel apart as a distinct people."
    },
    {
      "pk": 2401003,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 3,
      "text": "For the customs of the peoples are worthless; they cut a tree from the forest, a craftsman shapes it with his chisel.",
      "links": "<a href='/AIV/23/44/9-20'>Isa. 44:9–20</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4–8</a>",
      "comment": "This echoes other passages criticizing idolatry and the making of physical images for worship. See Isaiah 44:9–20 for an extended satire on idol making."
    },
    {
      "pk": 2401004,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 4,
      "text": "They decorate it with silver and gold; they fasten it with nails and hammers so it will not fall over.",
      "links": "<a href='/AIV/23/40/19'>Isa. 40:19</a>",
      "comment": "The care put into idols underscores their impotence—they need help even to stand, unlike the living God."
    },
    {
      "pk": 2401005,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 5,
      "text": "They are like a scarecrow in a cucumber field; they cannot speak. They must be carried, because they cannot walk. Do not be afraid of them, for they do no harm, nor can they do any good.",
      "links": "<a href='/AIV/24/46/7'>Jer. 46:7</a>; <a href='/AIV/19/115/5-7'>Ps. 115:5-7</a>",
      "comment": "The comparison intends to ridicule idols as lifeless and powerless. The psalmist similarly mocks idols in Ps. 115."
    },
    {
      "pk": 2401006,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 6,
      "text": "No one is like You, LORD; You are great, and Your name is mighty in power.",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/145/3'>Ps. 145:3</a>",
      "comment": "Affirmation of God's uniqueness and greatness, which is a central theme in worship and liturgy. The repeated emphasis on God's name and power later finds expression in New Testament Christology (see Phil. 2:9-11)."
    },
    {
      "pk": 2401007,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 7,
      "text": "Who would not fear You, O King of the nations? This is Your due. For among all the wise ones of the nations and in all their kingdoms, there is none like You.",
      "links": "<a href='/AIV/24/5/22'>Jer. 5:22</a>; <a href='/AIV/19/47/7'>Ps. 47:7</a>",
      "comment": "God's kingship over all nations hints at a universal kingdom, i.e. the fulfillment of the promise to Abraham. This principle reappears in understanding the Church as the gathering of all peoples."
    },
    {
      "pk": 2401008,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 8,
      "text": "All are senseless and foolish; their idol teachings are nothing but wooden images.",
      "links": "<a href='/AIV/23/44/18'>Isa. 44:18</a>",
      "comment": "Idolatry leads to spiritual blindness. Paul's argument in Romans 1:22-23 echoes this point about exchanging God's glory for images."
    },
    {
      "pk": 2401009,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 9,
      "text": "Hammered silver is brought from Tarshish, and gold from Uphaz—the work of craftsmen and goldsmiths. Their clothes are blue and purple—all made by skilled workers.",
      "links": "<a href='/AIV/26/27/12'>Ezek. 27:12</a>",
      "comment": "Despite the richness of materials, so-called sacred images are merely human art, not divine revelation. The colors blue and purple later are associated with sacred worship, foreshadowing deeper sacramental realities."
    },
    {
      "pk": 2401010,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 10,
      "text": "But the LORD is the true God; He is the living God and the everlasting King. At His wrath the earth quakes, and the nations cannot endure His indignation.",
      "links": "<a href='/AIV/19/42/2'>Ps. 42:2</a>; <a href='/AIV/24/23/29'>Jer. 23:29</a>",
      "comment": "God is living and eternal, in contrast to dead idols. The idea of God's kingship is a repeated motif throughout the whole Bible, finding its ultimate fulfillment in Christ's eternal reign (see Rev. 11:15)."
    },
    {
      "pk": 2401011,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 11,
      "text": "You shall say to them, 'The gods who did not make the heavens and the earth will perish from the earth and from under the heavens.'",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>",
      "comment": "This verse, unique in Aramaic, is a rebuke of false gods—only the Creator endures. See Ps. 96:5, which claims all other gods are idols."
    },
    {
      "pk": 2401012,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 12,
      "text": "He made the earth by His power; He established the world by His wisdom, and stretched out the heavens by His understanding.",
      "links": "<a href='/AIV/19/104/24'>Ps. 104:24</a>; <a href='/AIV/20/3/19'>Prov. 3:19</a>",
      "comment": "God's wisdom in creation ties to Wisdom literature and sets up later New Testament claims about Christ as divine wisdom (see Col. 1:15-17, John 1:3)."
    },
    {
      "pk": 2401013,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 13,
      "text": "When He thunders, the waters in the heavens roar; He makes clouds rise from the ends of the earth. He sends lightning with the rain and brings out the wind from His storehouses.",
      "links": "<a href='/AIV/19/135/7'>Ps. 135:7</a>",
      "comment": "Medieval commentators saw this as God’s sovereign control of nature, reinforcing faith in God’s providence and His ongoing work in creation."
    },
    {
      "pk": 2401014,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 14,
      "text": "Every man is senseless and lacks knowledge; every goldsmith is put to shame by his idols. His images are a fraud; they have no breath in them.",
      "links": "<a href='/AIV/23/42/17'>Isa. 42:17</a>; <a href='/AIV/19/135/18'>Ps. 135:18</a>",
      "comment": "The emphasis on 'no breath' contrasts with God’s gift of breath and life to Adam and all humanity. Lifelike form does not equal true life."
    },
    {
      "pk": 2401015,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 15,
      "text": "They are worthless, the work of mockery; at the time of their punishment they will perish.",
      "links": "<a href='/AIV/24/51/18'>Jer. 51:18</a>",
      "comment": "This previews the fate awaiting those who trust in idols—a reminder to trust God alone and not anything fashioned by human hands."
    },
    {
      "pk": 2401016,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 16,
      "text": "He who is the Portion of Jacob is not like these, for He is the Maker of all things; Israel is the tribe of His inheritance—the LORD of Hosts is His name.",
      "links": "<a href='/AIV/24/51/19'>Jer. 51:19</a>; <a href='/AIV/19/73/26'>Ps. 73:26</a>",
      "comment": "God as Israel’s 'portion' evokes the idea of inheritance and covenant. The emphasis on 'Maker of all' will be reflected in apostolic teaching on Christ."
    },
    {
      "pk": 2401017,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 17,
      "text": "Gather up your bundle from the land, you who live under siege.",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "An urgent call to prepare for exile. In the greater biblical narrative, such warnings are always an invitation to repentance and return."
    },
    {
      "pk": 2401018,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 18,
      "text": "For this is what the LORD says: 'Behold, I am about to sling out the inhabitants of the land this time, and will distress them so that they may feel it.'",
      "links": "<a href='/AIV/24/16/13'>Jer. 16:13</a>; <a href='/AIV/24/24/9'>Jer. 24:9</a>",
      "comment": "God’s discipline here has a redemptive purpose; suffering is never meaningless in the scriptural witness."
    },
    {
      "pk": 2401019,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 19,
      "text": "Woe to me because of my wound! My injury is severe. But I said, 'Truly this is my illness, and I must bear it.'",
      "links": "<a href='/AIV/25/3/39'>Lam. 3:39</a>",
      "comment": "This personal lament reflects the prophet’s solidarity with his people, a foreshadowing of the suffering servant theme later fulfilled in Christ."
    },
    {
      "pk": 2401020,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 20,
      "text": "My tent is destroyed; all my cords are broken. My children are gone from me, and they are no more. No one is left to pitch my tent or set up my curtains.",
      "links": "<a href='/AIV/25/2/5'>Lam. 2:5</a>",
      "comment": "The image of the tent evokes themes of pilgrimage, exile, and the transitory nature of life, drawing attention to the need for a true dwelling place with God."
    },
    {
      "pk": 2401021,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 21,
      "text": "The shepherds are senseless and do not seek the LORD; so they have not prospered, and all their flock is scattered.",
      "links": "<a href='/AIV/26/34/2-6'>Ezek. 34:2-6</a>; <a href='/AIV/24/23/1-2'>Jer. 23:1-2</a>",
      "comment": "Failure of spiritual leaders is sharply condemned. The motif of shepherds points forward to Christ, the true Shepherd (John 10:11), and underscores the need for authentic, apostolic leadership."
    },
    {
      "pk": 2401022,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 22,
      "text": "Listen! The sound of a report—behold, it comes: a great commotion from the north country to make the cities of Judah a desolation, a dwelling for jackals.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "The 'north' is symbolic of impending judgment, referring historically to Babylon. Yet, desolation prepares the way for promised restoration."
    },
    {
      "pk": 2401023,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 23,
      "text": "I know, O LORD, that the way of a man is not in himself, nor is it in man who walks to direct his steps.",
      "links": "<a href='/AIV/20/16/9'>Prov. 16:9</a>; <a href='/AIV/19/37/23'>Ps. 37:23</a>",
      "comment": "Affirms God’s sovereignty over human destiny—a theme closely interwoven with Christian doctrines about providence and grace."
    },
    {
      "pk": 2401024,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 24,
      "text": "Correct me, O LORD, but with justice—not in Your anger, or You would bring me to nothing.",
      "links": "<a href='/AIV/19/6/1'>Ps. 6:1</a>; <a href='/AIV/24/30/11'>Jer. 30:11</a>",
      "comment": "Seeks merciful discipline, distinguishing between God's justice and wrath. This prayer is echoed in psalms and points forward to the New Covenant understanding of divine mercy."
    },
    {
      "pk": 2401025,
      "translation": "AIV",
      "book": 24,
      "chapter": 10,
      "verse": 25,
      "text": "Pour out Your wrath on the nations that do not know You and on the peoples who do not call on Your name. For they have devoured Jacob; they have consumed him and have laid waste his home.",
      "links": "<a href='/AIV/19/79/6-7'>Ps. 79:6–7</a>; <a href='/AIV/24/30/16'>Jer. 30:16</a>",
      "comment": "A call for God’s justice against the enemies of God’s people. Yet, throughout Scripture, such judgments open space for future reconciliation and the gathering of all nations into one people under God."
    }
  ],
  "translatedAt": "2025-12-23T06:20:01.044Z"
}