{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 43,
  "verses": [
    {
      "pk": 4304301,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 1,
      "text": "When Jeremiah finished speaking to all the people all the words of the LORD their God, everything the LORD their God had sent him to tell them—",
      "links": "<a href='/AIV/24/42/7-22'>Jer. 42:7–22</a>",
      "comment": "This verse connects directly to the events in the previous chapter, where Jeremiah delivers God's full message. Notice the emphasis on both the authority of Jeremiah as a prophet and the completeness of God's instructions."
    },
    {
      "pk": 4304302,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 2,
      "text": "Azariah son of Hoshaiah, Johanan son of Kareah, and all the arrogant men said to Jeremiah, 'You are telling a lie! The LORD our God has not sent you to say, ‘Do not go to Egypt to settle there.’'",
      "links": "<a href='/AIV/24/42/1-6'>Jer. 42:1–6</a>; <a href='/AIV/24/44/1'>Jer. 44:1</a>",
      "comment": "Here, the people's leaders accuse Jeremiah of false prophecy. This highlights the recurring biblical theme of resistance to true prophecy, a pattern also seen with Jesus and the apostles (see Acts 7:51–52)."
    },
    {
      "pk": 4304303,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 3,
      "text": "'But Baruch son of Neriah is inciting you against us to hand us over to the Chaldeans, that they may put us to death or carry us off to Babylon.'",
      "links": "<a href='/AIV/24/36/4'>Jer. 36:4</a>",
      "comment": "Baruch, Jeremiah’s scribe, is falsely accused of conspiracy. This reflects a recurring biblical suspicion towards those faithful to divine revelation. A contrast exists here with loyal discipleship and trust in God's messengers."
    },
    {
      "pk": 4304304,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 4,
      "text": "So Johanan son of Kareah and all the commanders of the armies and all the people did not obey the voice of the LORD, to remain in the land of Judah.",
      "links": "<a href='/AIV/24/42/13'>Jer. 42:13</a>; <a href='/AIV/24/32/23'>Jer. 32:23</a>",
      "comment": "Their decision is a direct act of disobedience to God’s explicit command. Persistent disobedience results in exile, echoing Israel’s earlier history and pointing ahead to the consequences Jesus describes for rejecting God's kingdom (see Matt. 23:37–39)."
    },
    {
      "pk": 4304305,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 5,
      "text": "But Johanan son of Kareah and all the commanders of the armies took all the remnant of Judah who had returned from all the nations where they had been driven, to dwell in the land of Judah—",
      "links": "<a href='/AIV/24/40/11-12'>Jer. 40:11–12</a>",
      "comment": "Note the gathering of a remnant, paralleling other biblical uses of 'remnant' as those preserved by God for His purposes. The idea of a 'faithful remnant' is spiritually significant, fulfilled ultimately in Christ and His followers (Rom. 11:5)."
    },
    {
      "pk": 4304306,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 6,
      "text": "the men, the women, the children, the king’s daughters, every person whom Nebuzaradan, the captain of the guard, had left with Gedaliah son of Ahikam, son of Shaphan, and also Jeremiah the prophet and Baruch son of Neriah.",
      "links": "<a href='/AIV/24/39/10'>Jer. 39:10</a>; <a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "The inclusion of Jeremiah and Baruch, forced to go with the group, reinforces the prophet's role as both spokesman and sufferer alongside the people, prefiguring Christ who suffers with and for His people."
    },
    {
      "pk": 4304307,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 7,
      "text": "And they came into the land of Egypt, for they did not obey the voice of the LORD. They came as far as Tahpanhes.",
      "links": "<a href='/AIV/24/2/16'>Jer. 2:16</a>; <a href='/AIV/02/12/51'>Ex. 12:51</a>",
      "comment": "Their disobedience takes them back to Egypt, symbolically reversing the Exodus. This act of fleeing to Egypt represents a lack of trust in God's saving power, in sharp contrast to the first Exodus. Theological significance: salvation comes through obedience and trust in God's promise, not self-reliance."
    },
    {
      "pk": 4304308,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 8,
      "text": "Then the word of the LORD came to Jeremiah in Tahpanhes:",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>",
      "comment": "God continues to speak through His prophet even in exile, affirming the enduring ministry of true prophecy regardless of physical location, similar to how the Church carries forward the word of God across lands and ages."
    },
    {
      "pk": 4304309,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 9,
      "text": "'Take large stones in your hands and bury them in the mortar in the pavement at the entrance to Pharaoh’s palace in Tahpanhes, in the sight of the men of Judah,'",
      "links": "<a href='/AIV/24/27/2'>Jer. 27:2</a>",
      "comment": "A prophetic sign performed in public. Prophetic actions like these foreshadow later Christian sacramental signs, where visible reality points to a deeper spiritual truth."
    },
    {
      "pk": 4304310,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 10,
      "text": "and say to them, ‘This is what the LORD of hosts, the God of Israel, says: Behold, I will send and take Nebuchadnezzar the king of Babylon, my servant, and I will set his throne above these stones that I have hidden, and he will spread his royal canopy over them.",
      "links": "<a href='/AIV/24/27/6'>Jer. 27:6</a>; <a href='/AIV/24/25/9'>Jer. 25:9</a>",
      "comment": "God calls a pagan king 'my servant,' showing His sovereignty over history. The hidden stones foreshadow the visible/invisible aspects of God’s action throughout salvation history—a pattern fulfilled in Christ (see John 10:16; Eph. 1:10)."
    },
    {
      "pk": 4304311,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 11,
      "text": "He shall come and strike the land of Egypt, bringing death to those appointed for death, captivity to those appointed for captivity, and the sword to those appointed for the sword.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>",
      "comment": "Judgment is pronounced: a division occurs depending on the people’s response to God. This anticipates the prophetic separation of sheep and goats, emphasizing the consequences of rejecting God's command (Matt. 25:31–46)."
    },
    {
      "pk": 4304312,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 12,
      "text": "'He shall set fire to the temples of the gods of Egypt. He shall burn them and carry them away captive. He will clean the land of Egypt as a shepherd picks lice from his cloak, and he shall depart from there peacefully.'",
      "links": "<a href='/AIV/02/12/12'>Ex. 12:12</a>; <a href='/AIV/24/46/25'>Jer. 46:25</a>",
      "comment": "Destruction of Egypt’s idols echoes God’s past victory over false gods in the Exodus. The image of shepherding foreshadows Christ as the Good Shepherd who purifies and leads His flock (John 10:14–16)."
    },
    {
      "pk": 4304313,
      "translation": "AIV",
      "book": 24,
      "chapter": 43,
      "verse": 13,
      "text": "'He shall also break the obelisks of Heliopolis, which is in the land of Egypt, and shall burn the temples of the gods of Egypt with fire.'",
      "links": "<a href='/AIV/02/12/12'>Ex. 12:12</a>; <a href='/AIV/24/46/25'>Jer. 46:25</a>",
      "comment": "Breaking the obelisks (sun-pillars) is a sign of divine superiority over all idols. Throughout Scripture, the true worship of the one God is linked with outward and inward purity, pointing toward right worship and the unity of faith (see John 4:23–24)."
    }
  ],
  "translatedAt": "2025-12-23T06:36:40.512Z"
}