{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 12,
  "verses": [
    {
      "pk": 2401201,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 1,
      "text": "Righteous are You, O LORD, when I bring my case before You—yet still, I must speak with You about justice. Why does the way of the wicked prosper? Why do all who deal treacherously live at ease?",
      "links": "<a href='/AIV/18/21/7'>Job 21:7</a>; <a href='/AIV/19/73/3'>Ps. 73:3</a>",
      "comment": "Jeremiah voices a question echoed by Job (Job 21:7) and the Psalmist (Ps. 73:3): why do the wicked prosper while the righteous suffer? This tension foreshadows the suffering of Christ, who, though righteous, endured unjust suffering."
    },
    {
      "pk": 2401202,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 2,
      "text": "You plant them; they take root, they grow and bear fruit. You are near in their mouths yet far from their hearts.",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/40/15/8'>Matt. 15:8</a>",
      "comment": "Jeremiah laments the hypocrisy of those who appear religious outwardly but are inwardly far from God (cf. Isa. 29:13; quoted by Jesus in Matt. 15:8). True faith must be lived from the heart, not just spoken."
    },
    {
      "pk": 2401203,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 3,
      "text": "But You, O LORD, know me; You see me and examine my heart toward You. Drag them out like sheep for slaughter, and set them apart for the day of killing.",
      "links": "<a href='/AIV/19/139/23'>Ps. 139:23</a>; <a href='/AIV/23/53/7'>Isa. 53:7</a>",
      "comment": "Jeremiah appeals to God's knowledge of hearts (Ps. 139:23). The phrase 'like sheep for slaughter' prefigures Isaiah’s portrayal of the suffering servant (Isa. 53:7), ultimately fulfilled in Christ."
    },
    {
      "pk": 2401204,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 4,
      "text": "How long will the land mourn and the grass of every field wither? For the wickedness of those who dwell in it, the beasts and the birds are swept away, because they said, 'He will not see our end.'",
      "links": "<a href='/AIV/28/4/3'>Hos. 4:3</a>; <a href='/AIV/19/104/29'>Ps. 104:29</a>",
      "comment": "Wickedness affects not only sinners but all creation (cf. Hos. 4:3; Rom. 8:20-22). This anticipates the idea that sin brings universal corruption, only remedied by God's ultimate redemption."
    },
    {
      "pk": 2401205,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 5,
      "text": "If you have raced with men on foot, and they have worn you out, how will you compete with horses? If you feel secure only in a land of peace, how will you do in the thickets by the Jordan?",
      "links": "<a href='/AIV/20/24/10'>Prov. 24:10</a>",
      "comment": "God challenges Jeremiah to greater endurance. The journey of faith often requires perseverance through more difficult trials ahead, suggesting growth in grace over time."
    },
    {
      "pk": 2401206,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 6,
      "text": "For even your brothers and your family— even they have dealt treacherously with you, and they cry out loudly against you. Do not trust them, though they speak kindly to you.",
      "links": "<a href='/AIV/33/7/6'>Mic. 7:6</a>; <a href='/AIV/40/10/21-36'>Matt. 10:21, 36</a>",
      "comment": "Jeremiah experiences betrayal from his own family, echoing Jesus's words (Matt. 10:21, 36) about division within households for God's sake."
    },
    {
      "pk": 2401207,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 7,
      "text": "I have forsaken My house, I have abandoned My inheritance; I have given the beloved of My soul into the hands of her enemies.",
      "links": "<a href='/AIV/19/78/60-61'>Ps. 78:60-61</a>",
      "comment": "God poetically grieves His people's unfaithfulness and disciplines them, not out of hatred, but a desire for their ultimate return—an image of God as both just and merciful."
    },
    {
      "pk": 2401208,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 8,
      "text": "My inheritance has become to Me like a lion in the forest; she roars against Me, therefore I hate her.",
      "links": "<a href='/AIV/19/106/40'>Ps. 106:40</a>",
      "comment": "Judah’s rebellion is depicted as a wild, defiant animal. Yet God's 'hate' is better understood as righteous anger aimed at their sin, not personal animosity (cf. Ps. 106:40)."
    },
    {
      "pk": 2401209,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 9,
      "text": "Is My chosen one a speckled bird of prey that other birds surround and attack? Go, assemble all the beasts of the field; bring them to devour.",
      "links": "<a href='/AIV/19/79/2'>Ps. 79:2</a>",
      "comment": "Judah is isolated and under threat, symbolized as a strange bird attacked by others—emphasizing both judgment and the need for fulfillment beyond ethnic Israel."
    },
    {
      "pk": 2401210,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 10,
      "text": "Many shepherds have destroyed My vineyard; they have trampled My field; they have turned My pleasant field into a desolate wilderness.",
      "links": "<a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>; <a href='/AIV/43/10/12'>John 10:12</a>",
      "comment": "Unfaithful leaders, or 'shepherds,' bring ruin. Jesus later contrasts Himself as the Good Shepherd (John 10:12), pointing to the need for true spiritual leadership traced through apostolic succession."
    },
    {
      "pk": 2401211,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 11,
      "text": "They have made it a ruin; it mourns desolate before Me. The whole land is laid waste, because no one takes it to heart.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The leaders’ failure brings devastation 'because no one lays it to heart'; this appeals for a responsive heart, echoing the biblical call to repentance and personal conversion."
    },
    {
      "pk": 2401212,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 12,
      "text": "On all the barren heights in the desert the destroyers have come. The LORD has a sword that consumes from one end of the land to the other; no flesh is safe.",
      "links": "<a href='/AIV/24/25/33'>Jer. 25:33</a>",
      "comment": "Here is warning of judgment for unrepented sin—a sign that God's justice is impartial and all-encompassing until mercy is sought."
    },
    {
      "pk": 2401213,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 13,
      "text": "They have sown wheat but reaped thorns; they have exhausted themselves without profit. Be ashamed of your harvest because of the fierce anger of the LORD.",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>",
      "comment": "Efforts apart from God’s grace produce only futility (see Hos. 8:7). This underlines the need for God’s blessing and grace in every good work."
    },
    {
      "pk": 2401214,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 14,
      "text": "This is what the LORD says about all My evil neighbors who attack the inheritance that I gave My people Israel to possess: I will uproot them from their land, and uproot the house of Judah from among them.",
      "links": "<a href='/AIV/24/25/9'>Jer. 25:9</a>",
      "comment": "God will judge not only Israel but also the nations—a foretaste of God's universal plan for both judgment and eventual restoration."
    },
    {
      "pk": 2401215,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 15,
      "text": "After I have uprooted them, I will again have compassion on them and will bring each one back to his inheritance and to his own land.",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>",
      "comment": "God’s justice is never the end; His ultimate desire is restoration and mercy. This cycle of discipline followed by compassion reflects the outworking of divine love."
    },
    {
      "pk": 2401216,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 16,
      "text": "If they will diligently learn the ways of My people, to swear by My name, 'As the LORD lives,' just as they taught My people to swear by Baal, then they shall be built up among My people.",
      "links": "<a href='/AIV/24/4/2'>Jer. 4:2</a>; <a href='/AIV/19/87/4'>Ps. 87:4</a>",
      "comment": "Inclusion of the nations is God's plan—those who seek Him truly will be grafted in (cf. Ps. 87:4), prefiguring the gathering of the Gentiles into God's one people, fulfilled in the Church."
    },
    {
      "pk": 2401217,
      "translation": "AIV",
      "book": 24,
      "chapter": 12,
      "verse": 17,
      "text": "But if any nation will not listen, then I will completely uproot and destroy that nation, declares the LORD.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/24/18/7-10'>Jer. 18:7-10</a>",
      "comment": "God’s offer of mercy is extended to all, but persistent refusal ends in judgment (cf. Ps. 2:9). This both warns and encourages all peoples to heed God's call to obedience and faith."
    }
  ],
  "translatedAt": "2025-12-23T06:20:50.947Z"
}