{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 41,
  "verses": [
    {
      "pk": 2110041,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 1,
      "text": "In the seventh month, Ishmael son of Nethaniah, son of Elishama, of royal descent and one of the king's officials, came with ten men to Gedaliah son of Ahikam at Mizpah. While they were eating together there at Mizpah,",
      "links": "<a href='/AIV/24/40/8'>Jer. 40:8</a>; <a href='/AIV/12/25/25'>2 Kings 25:25</a>",
      "comment": "Ishmael's royal lineage is highlighted, underscoring the political intrigue. The setting at Mizpah is vital as it's the new administrative center after Jerusalem's fall."
    },
    {
      "pk": 2110042,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 2,
      "text": "Ishmael son of Nethaniah and the ten men who were with him got up and attacked Gedaliah son of Ahikam, and struck him down with the sword and killed him, whom the king of Babylon had appointed governor over the land.",
      "links": "<a href='/AIV/24/40/5'>Jer. 40:5</a>; <a href='/AIV/24/40/14'>Jer. 40:14</a>",
      "comment": "This assassination disrupted the fragile peace. Gedaliah’s appointment by Babylon shows foreign influence, echoing recurring themes of usurped authority and judgment for Israel."
    },
    {
      "pk": 2110043,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 3,
      "text": "Ishmael also killed all the Jews who were with Gedaliah at Mizpah, and the Chaldean soldiers found there.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "The text starkly reports the massacre of Jews and Babylonian soldiers, deepening tragedy and instability. The scope of violence signals sin’s consequences and the breakdown of order."
    },
    {
      "pk": 2110044,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 4,
      "text": "The next day, before anyone knew what had happened,",
      "links": "",
      "comment": "This phrase emphasizes secrecy, setting up further intrigue. It marks a transition before Ishmael’s next actions are revealed."
    },
    {
      "pk": 2110045,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 5,
      "text": "eighty men came from Shechem, Shiloh, and Samaria, with their beards shaved and clothes torn, and with cuts on their bodies, bringing offerings and incense to present at the house of the LORD.",
      "links": "<a href='/AIV/24/7/14'>Jer. 7:14</a>; <a href='/AIV/24/16/6'>Jer. 16:6</a>",
      "comment": "These mourning rites reflect deep sorrow and ritual purity. Their bringing offerings shows continued faithfulness amid destruction, a quiet testament to enduring worship."
    },
    {
      "pk": 2110046,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 6,
      "text": "Ishmael son of Nethaniah went out from Mizpah to meet them, weeping as he went. As he encountered them, he said, 'Come in to Gedaliah son of Ahikam.'",
      "links": "",
      "comment": "Ishmael feigns sorrow and deception here, exploiting their grief. The motif of false leaders is a foreshadowing warning later echoed by Christ about false shepherds (cf. John 10:12)."
    },
    {
      "pk": 2110047,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 7,
      "text": "When they entered the city, Ishmael son of Nethaniah and the men with him slaughtered them and threw them into a cistern.",
      "links": "<a href='/AIV/24/38/6'>Jer. 38:6</a>",
      "comment": "The cruel fate of these mourners mirrors earlier acts of violence in Jeremiah. The cistern imagery recalls Jeremiah’s own near-martyrdom (Jer. 38:6), suggesting the vulnerability of the faithful."
    },
    {
      "pk": 2110048,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 8,
      "text": "But ten men among them said to Ishmael, 'Don’t kill us! We have stores of wheat, barley, oil, and honey hidden in the fields.' So he refrained from killing them along with their brothers.",
      "links": "",
      "comment": "Resourcefulness saves some from death—physical provision can temporarily stave off judgment, alluding to salvation motifs where God preserves a remnant (cf. Rom. 11:5)."
    },
    {
      "pk": 2110049,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 9,
      "text": "The cistern into which Ishmael threw all the bodies of the men he had killed was the large cistern that King Asa had made for defense against Baasha king of Israel. This is where Ishmael filled it with the slain.",
      "links": "<a href='/AIV/11/15/22'>1 Kings 15:22</a>",
      "comment": "Connecting to King Asa roots the event in Israel’s divided monarchy. The repurposing of a defense structure for burial emphasizes themes of reversal and disgrace."
    },
    {
      "pk": 2110050,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 10,
      "text": "Then Ishmael took captive the rest of the people at Mizpah—the king’s daughters and all the people left at Mizpah, whom Nebuzaradan the captain of the guard had put under Gedaliah son of Ahikam. Ishmael son of Nethaniah took them and started toward the Ammonites.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>; <a href='/AIV/24/39/13'>Jer. 39:13</a>",
      "comment": "The mention of royal daughters links Jer. 41:10 to dynastic continuity and the fate of David’s line, an undercurrent for messianic hope fulfilled in Christ (see Matt. 1:1–16)."
    },
    {
      "pk": 2110051,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 11,
      "text": "But when Johanan son of Kareah and all the army officers with him heard of all the crimes Ishmael son of Nethaniah had committed,",
      "links": "",
      "comment": "Johanan’s hearing signals the beginning of resistance and restoration. Officers rising up represent God’s justice working through human agents."
    },
    {
      "pk": 2110052,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 12,
      "text": "they took all their men and went to fight Ishmael son of Nethaniah. They caught up with him by the great pool in Gibeon.",
      "links": "<a href='/AIV/10/2/13'>2 Sam. 2:13</a>",
      "comment": "Gibeon’s pool is a historic place of conflict (cf. 2 Sam. 2:13), linking memory of past strife in Israel with this moment of reckoning."
    },
    {
      "pk": 2110053,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 13,
      "text": "When all the people with Ishmael saw Johanan son of Kareah and the officers, they rejoiced.",
      "links": "",
      "comment": "Their rejoicing reflects relief at deliverance—a restoration of hope, reminiscent of the moments when God’s people are rescued through divinely-ordained leadership (cf. Ex. 14:30)."
    },
    {
      "pk": 2110054,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 14,
      "text": "All those whom Ishmael had taken captive from Mizpah turned back and went to Johanan son of Kareah.",
      "links": "",
      "comment": "Turning back to Johanan prefigures themes of repentance and return to rightful leadership, resonating with New Testament calls to repentance and reconciliation (cf. Luke 15:17–20)."
    },
    {
      "pk": 2110055,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 15,
      "text": "But Ishmael son of Nethaniah escaped from Johanan with eight men and fled to the Ammonites.",
      "links": "",
      "comment": "Ishmael's flight to the Ammonites deepens the motif of political betrayal. The remnant (eight men) echoes God’s saving of remnants in Scripture, often purified through ordeal."
    },
    {
      "pk": 2110056,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 16,
      "text": "Then Johanan son of Kareah and all the army officers took from Mizpah all the survivors whom Ishmael son of Nethaniah had rescued after murdering Gedaliah, the soldiers, women, children, and court officials he had brought from Gibeon.",
      "links": "<a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "The gathering of survivors evokes images of ingathering and salvation, foreshadowing later spiritual restoration of Israel and hints at the necessity of pastoral care of the flock."
    },
    {
      "pk": 2110057,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 17,
      "text": "They went and stayed at Geruth Kimham near Bethlehem on their way to Egypt,",
      "links": "<a href='/AIV/24/42/1'>Jer. 42:1</a>; <a href='/AIV/08/1/19'>Ruth 1:19</a>",
      "comment": "Bethlehem’s mention prefigures its importance in messianic prophecy (Mic. 5:2) and Christ’s birth. Their path towards Egypt repeats Israel's cycles of exodus and exile."
    },
    {
      "pk": 2110058,
      "translation": "AIV",
      "book": 24,
      "chapter": 41,
      "verse": 18,
      "text": "because they were afraid of the Chaldeans, for Ishmael son of Nethaniah had killed Gedaliah son of Ahikam, whom the king of Babylon had appointed governor over the land.",
      "links": "<a href='/AIV/24/40/5'>Jer. 40:5</a>",
      "comment": "Fear of retribution drives the remnant, echoing humanity’s recurring need for intercession and protection—key motifs in the spiritual tradition of Scriptural authority and guidance, later fulfilled in Christ’s pastoral care."
    }
  ],
  "translatedAt": "2025-12-23T06:35:52.698Z"
}