{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 2,
  "verses": [
    {
      "pk": 2400201,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/24/1/4'>Jeremiah 1:4</a>",
      "comment": "The book opens a new prophetic message from the LORD, emphasizing direct divine communication, highlighting the prophet's authority."
    },
    {
      "pk": 2400202,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 2,
      "text": "\"Go and proclaim to the hearing of Jerusalem, ‘Thus says the LORD: I remember the devotion of your youth, your love as a bride, how you followed me in the wilderness, in a land not sown.'\"",
      "links": "<a href='/AIV/26/16/8-14'>Ezekiel 16:8-14</a>; <a href='/AIV/28/2/14-15'>Hosea 2:14-15</a>",
      "comment": "God recalls Israel's early fidelity, likening Israel to a bride—a recurring image in Scripture portraying covenant faithfulness, later fulfilled in the New Testament with the Church as the bride of Christ (see <a href='/AIV/49/5/25-32'>Ephesians 5:25-32</a>)."
    },
    {
      "pk": 2400203,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 3,
      "text": "Israel was holy to the LORD, the firstfruits of his harvest. All who ate of it incurred guilt; disaster came upon them, declares the LORD.",
      "links": "<a href='/AIV/26/44/30'>Ezekiel 44:30</a>; <a href='/AIV/19/105/14-15'>Psalm 105:14-15</a>",
      "comment": "Israel’s unique, sanctified status echoes the idea of being set apart for God’s purposes, akin to the later concept of a chosen, priestly people (<a href='/AIV/60/2/9'>1 Peter 2:9</a>)."
    },
    {
      "pk": 2400204,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 4,
      "text": "Hear the word of the LORD, O house of Jacob, and all the clans of the house of Israel.",
      "links": "<a href='/AIV/24/10/1'>Jeremiah 10:1</a>",
      "comment": "A prophetic summons not only to the southern kingdom but to the whole nation, showing universal relevance of God’s message."
    },
    {
      "pk": 2400205,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 5,
      "text": "This is what the LORD says: 'What fault did your fathers find in me, that they went far from me and walked after worthless idols, and became worthless themselves?'",
      "links": "<a href='/AIV/24/16/11'>Jeremiah 16:11</a>; <a href='/AIV/19/115/4-8'>Psalm 115:4-8</a>",
      "comment": "God’s rhetorical question exposes the baselessness of Israel’s apostasy, warning how idolatry corrupts its followers."
    },
    {
      "pk": 2400206,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 6,
      "text": "\"They did not say, ‘Where is the LORD, who brought us up from the land of Egypt, who led us through the wilderness, through a land of deserts and pits, through a land of drought and deep darkness, through a land no one passes through and where no one lives?’\"",
      "links": "<a href='/AIV/02/14/10-12'>Exodus 14:10-12</a>; <a href='/AIV/05/8/15'>Deuteronomy 8:15</a>",
      "comment": "The LORD recalls their ingratitude, forgetting His saving acts. This foreshadows the importance of remembering salvation history, fulfilled in the Church’s celebration of the Paschal Mystery."
    },
    {
      "pk": 2400207,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 7,
      "text": "\"And I brought you into a plentiful land to eat its fruit and its good things. But when you entered, you defiled my land and made my heritage an abomination.\"",
      "links": "<a href='/AIV/05/6/10-12'>Deuteronomy 6:10-12</a>",
      "comment": "Points to the gift of the promised land, and humanity’s tendency toward ingratitude and corruption when blessed—a warning evident throughout salvation history."
    },
    {
      "pk": 2400208,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 8,
      "text": "\"The priests did not say, ‘Where is the LORD?’ Those who handle the law did not know me; the shepherds transgressed against me; the prophets prophesied by Baal and followed things that do not profit.\"",
      "links": "<a href='/AIV/09/2/12'>1 Samuel 2:12</a>; <a href='/AIV/11/18/18-19'>1 Kings 18:18-19</a>",
      "comment": "Leadership failure is highlighted, suggesting the need for true shepherds and authentic succession in teaching authority."
    },
    {
      "pk": 2400209,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 9,
      "text": "\"Therefore I still contend with you, declares the LORD, and with your children's children I will contend.\"",
      "links": "<a href='/AIV/03/26/39'>Leviticus 26:39</a>",
      "comment": "The LORD’s ongoing dialogue with His people implies generational responsibility and the perpetuity of the covenant."
    },
    {
      "pk": 2400210,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 10,
      "text": "\"Cross to the coasts of Cyprus and see, or send to Kedar and consider with care; see if there has ever been anything like this.\"",
      "links": "<a href='/AIV/23/41/5'>Isaiah 41:5</a>",
      "comment": "God invites comparison, asserting Israel’s unique relationship among nations."
    },
    {
      "pk": 2400211,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 11,
      "text": "\"Has a nation changed its gods, even though they are not gods? But my people have exchanged their glory for worthless things.\"",
      "links": "<a href='/AIV/19/106/20'>Psalm 106:20</a>",
      "comment": "Israel’s apostasy is unique, as even pagan nations remain faithful to false gods, underscoring the gravity of betraying the true God."
    },
    {
      "pk": 2400212,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 12,
      "text": "\"Be appalled, O heavens, at this; be shocked, be utterly desolate, declares the LORD.\"",
      "links": "<a href='/AIV/23/1/2'>Isaiah 1:2</a>",
      "comment": "All creation witnesses and laments Israel’s sin, hinting at the cosmic scope of covenant faithfulness and apostasy."
    },
    {
      "pk": 2400213,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 13,
      "text": "\"For my people have committed two evils: they have forsaken me, the fountain of living waters, and dug out for themselves broken cisterns that cannot hold water.\"",
      "links": "<a href='/AIV/43/4/14'>John 4:14</a>; <a href='/AIV/19/36/9'>Psalm 36:9</a>",
      "comment": "The imagery of living water finds fulfillment in Christ’s promise of eternal life, elevating the spiritual meaning. Broken cisterns represent human attempts at self-sufficiency apart from God."
    },
    {
      "pk": 2400214,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 14,
      "text": "\"Is Israel a slave? Was he born into slavery? Why then has he become prey?\"",
      "links": "<a href='/AIV/02/13/3'>Exodus 13:3</a>",
      "comment": "Israel’s chosen status is contrasted with its current humiliation as a result of sin."
    },
    {
      "pk": 2400215,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 15,
      "text": "\"Lions have roared against him, they have raised their voice. They have made his land a waste; his cities are burned and without inhabitants.\"",
      "links": "<a href='/AIV/24/4/7'>Jeremiah 4:7</a>",
      "comment": "Lions symbolize invading powers (see <a href='/AIV/24/5/6'>Jeremiah 5:6</a>), punishment for the nation’s rebellion."
    },
    {
      "pk": 2400216,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 16,
      "text": "\"Even the men of Memphis and Tahpanhes have shaved the crown of your head.\"",
      "links": "<a href='/AIV/26/30/14'>Ezekiel 30:14-18</a>",
      "comment": "Egyptian cities are mentioned as oppressors—shaving the crown may symbolize humiliation or defeat in battle."
    },
    {
      "pk": 2400217,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 17,
      "text": "\"Have you not brought this upon yourself by forsaking the LORD your God, when he led you in the way?\"",
      "links": "<a href='/AIV/24/7/19'>Jeremiah 7:19</a>",
      "comment": "Sin always has consequences. The verse highlights personal responsibility before God."
    },
    {
      "pk": 2400218,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 18,
      "text": "\"And now, what do you gain by going to Egypt to drink the waters of the Nile? Or by going to Assyria to drink the waters of the Euphrates?\"",
      "links": "<a href='/AIV/23/30/2-3'>Isaiah 30:2-3</a>",
      "comment": "Seeking political alliances rather than trusting in God leads only to further trouble, pointing to the spiritual peril of relying on worldly powers."
    },
    {
      "pk": 2400219,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 19,
      "text": "\"Your evil will chastise you, and your apostasy will reprove you. Know and see that it is evil and bitter for you to forsake the LORD your God; the fear of me is not in you, declares the Lord GOD of armies.\"",
      "links": "<a href='/AIV/28/13/9'>Hosea 13:9</a>",
      "comment": "Divine discipline is seen as corrective, meant to bring repentance. The title 'God of armies' emphasizes God’s sovereign power."
    },
    {
      "pk": 2400220,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 20,
      "text": "\"Long ago you broke your yoke and burst your bonds; you said, ‘I will not serve!’ But on every high hill and under every green tree you bowed down like a prostitute.\"",
      "links": "<a href='/AIV/05/12/2'>Deuteronomy 12:2</a>; <a href='/AIV/26/6/13'>Ezekiel 6:13</a>",
      "comment": "Idolatry is compared to spiritual adultery, an image Christ uses to describe faithlessness and calls His followers to fidelity."
    },
    {
      "pk": 2400221,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 21,
      "text": "\"Yet I planted you a choice vine, wholly pure. How then have you turned into a corrupt, wild vine?\"",
      "links": "<a href='/AIV/23/5/1-7'>Isaiah 5:1-7</a>; <a href='/AIV/43/15/1-8'>John 15:1-8</a>",
      "comment": "God’s planting Israel as a 'choice vine' anticipates the New Testament image of Christ as the True Vine, with the necessity of abiding in Him for fruitfulness."
    },
    {
      "pk": 2400222,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 22,
      "text": "\"Though you wash yourself with lye and use much soap, the stain of your guilt is still before me, declares the Lord GOD.\"",
      "links": "<a href='/AIV/18/9/30'>Job 9:30</a>",
      "comment": "Human efforts cannot remove guilt; only God provides true purification, foreshadowing the need for sacramental cleansing."
    },
    {
      "pk": 2400223,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 23,
      "text": "\"How can you say, ‘I am not defiled, I have not gone after Baals’? Look at your way in the valley; know what you have done. You are a swift young camel wandering aimlessly.\"",
      "links": "<a href='/AIV/07/6/25'>Judges 6:25</a>",
      "comment": "Israel’s denial of guilt is challenged, illustrating the self-deception common in fallen humanity."
    },
    {
      "pk": 2400224,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 24,
      "text": "\"A wild donkey accustomed to the wilderness, in her lust she sniffs the wind; in her heat, who can restrain her? All who seek her will not tire; in her season, they will find her.\"",
      "links": "<a href='/AIV/18/39/5-8'>Job 39:5-8</a>",
      "comment": "The metaphor accentuates Israel’s unrestrained pursuit of idolatry, akin to uncontainable passion."
    },
    {
      "pk": 2400225,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 25,
      "text": "\"Keep your feet from going bare and your throat from thirst. But you said, 'It’s hopeless! For I have loved strangers, and after them I will go.'\"",
      "links": "<a href='/AIV/24/18/15'>Jeremiah 18:15</a>",
      "comment": "Israel’s obstinacy is revealed, highlighting the deep-seated nature of rebellion."
    },
    {
      "pk": 2400226,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 26,
      "text": "\"As a thief is ashamed when caught, so the house of Israel is ashamed—they, their kings, their officials, their priests, and their prophets.\"",
      "links": "<a href='/AIV/24/8/1'>Jeremiah 8:1</a>",
      "comment": "Shame is universal among leaders and people alike, pointing to the communal aspect of sin."
    },
    {
      "pk": 2400227,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 27,
      "text": "\"They say to a tree, 'You are my father,' and to a stone, 'You gave me birth.' They have turned their back to me, and not their face. Yet when trouble comes, they say, 'Arise and save us!'\"",
      "links": "<a href='/AIV/05/32/18'>Deuteronomy 32:18</a>",
      "comment": "Idolatry is again condemned; yet in trouble, the people turn back, foreshadowing later calls to repentance."
    },
    {
      "pk": 2400228,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 28,
      "text": "\"But where are your gods that you made for yourself? Let them arise, if they can save you in the time of your trouble! For you have as many gods as you have cities, O Judah.\"",
      "links": "<a href='/AIV/24/11/13'>Jeremiah 11:13</a>",
      "comment": "The futility of idolatry is exposed, preparing the way for a deeper understanding of God’s singularity and sufficiency."
    },
    {
      "pk": 2400229,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 29,
      "text": "\"Why do you argue with me? You have all transgressed against me, declares the LORD.\"",
      "links": "<a href='/AIV/19/51/4'>Psalm 51:4</a>",
      "comment": "Human attempts to justify themselves before God are futile; all have sinned."
    },
    {
      "pk": 2400230,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 30,
      "text": "\"In vain I have struck your children; they took no correction. Your own sword has devoured your prophets, like a ravening lion.\"",
      "links": "<a href='/AIV/11/19/10'>1 Kings 19:10</a>; <a href='/AIV/40/23/37'>Matthew 23:37</a>",
      "comment": "The theme of persecuting the prophets finds resonance in later rejection of God’s messengers, culminating in Christ."
    },
    {
      "pk": 2400231,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 31,
      "text": "\"O generation, see the word of the LORD! Have I been a wilderness to Israel, or a land of darkness? Why do my people say, 'We are free, we will come to you no more'?\"",
      "links": "<a href='/AIV/28/13/4'>Hosea 13:4</a>",
      "comment": "God appeals to the record of His providence, confronting false perceptions of autonomy."
    },
    {
      "pk": 2400232,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 32,
      "text": "\"Can a virgin forget her ornaments, or a bride her bridal attire? Yet my people have forgotten me days without number.\"",
      "links": "<a href='/AIV/19/106/21'>Psalm 106:21</a>",
      "comment": "Again the bride image is invoked; major theme in biblical revelation, pointing toward the faithful’s union with God."
    },
    {
      "pk": 2400233,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 33,
      "text": "\"How well you direct your way to seek love! Even wicked women have taught your ways.\"",
      "links": "<a href='/AIV/20/7/12'>Proverbs 7:12</a>",
      "comment": "Shows that even Israel has outdone others in pursuing illicit relationships, including false worship."
    },
    {
      "pk": 2400234,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 34,
      "text": "\"Also, on your skirts is found the blood of the innocent poor; you did not find them breaking in, but it is because of all these things.\"",
      "links": "<a href='/AIV/23/1/15'>Isaiah 1:15</a>",
      "comment": "Social injustice is added to idolatry; true worship always includes care for the poor and innocent."
    },
    {
      "pk": 2400235,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 35,
      "text": "\"Yet you say, ‘I am innocent; surely his anger has turned from me.’ Behold, I will judge you, because you say, ‘I have not sinned.’\"",
      "links": "<a href='/AIV/19/94/7'>Psalm 94:7</a>",
      "comment": "Denial of guilt brings judgment; confession is the pathway to forgiveness, later clarified by Christ’s teaching."
    },
    {
      "pk": 2400236,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 36,
      "text": "\"How easily you change your way! You shall be put to shame by Egypt, just as you were put to shame by Assyria.\"",
      "links": "<a href='/AIV/12/17/4-6'>2 Kings 17:4-6</a>",
      "comment": "Reliance on foreign powers leads only to shame, reaffirming the call to remain within the family of God’s covenant."
    },
    {
      "pk": 2400237,
      "translation": "AIV",
      "book": 24,
      "chapter": 2,
      "verse": 37,
      "text": "\"From this place also you will go out with your hands on your head; for the LORD has rejected those in whom you trust, and you will not prosper by them.\"",
      "links": "<a href='/AIV/24/14/3'>Jeremiah 14:3</a>",
      "comment": "The final warning stresses that only faithfulness to God ensures blessing; human alliances cannot substitute for God’s protection. The imagery of hands on the head is grief and shame, pointing toward ultimate repentance and need for restoration."
    }
  ],
  "translatedAt": "2025-12-23T06:15:46.867Z"
}