{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 5,
  "verses": [
    {
      "pk": 1953050,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 1,
      "text": "Roam through the streets of Jerusalem. Look and see, search through its squares. If you can find a single person, anyone who acts justly, anyone who seeks truth, then I will pardon the city.",
      "links": "<a href='/AIV/18/9/4'>Job 9:4</a>; <a href='/AIV/26/22/30'>Ezek. 22:30</a>",
      "comment": "God's mercy is shown—He would forgive an entire city for the sake of even one righteous person (see also Gen. 18:32, where Abraham pleads for Sodom)."
    },
    {
      "pk": 1953051,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 2,
      "text": "But even when they say, 'As the LORD lives,' they swear falsely.",
      "links": "<a href='/AIV/24/4/2'>Jer. 4:2</a>; <a href='/AIV/28/4/2'>Hos. 4:2</a>",
      "comment": "Public declarations of faith are empty when not matched by truthful hearts (see Isaiah 29:13)."
    },
    {
      "pk": 1953052,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 3,
      "text": "O LORD, do You not look for truth? You struck them, but they felt no pain. You consumed them, but they refused to accept correction. They hardened their faces more than a rock; they refused to repent.",
      "links": "<a href='/AIV/19/94/10'>Ps. 94:10</a>; <a href='/AIV/23/42/25'>Isa. 42:25</a>",
      "comment": "God disciplines His people to bring them to repentance, using both justice and mercy. Hardness of heart is a repeated theme in Israel's history."
    },
    {
      "pk": 1953053,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 4,
      "text": "Then I thought, 'These are only the poor; they are foolish, for they do not know the way of the LORD, the law of their God.'",
      "links": "<a href='/AIV/28/4/6'>Hos. 4:6</a>",
      "comment": "The prophet considers whether ignorance is causing the people's rebellion, highlighting the importance of instruction and spiritual teaching."
    },
    {
      "pk": 1953054,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 5,
      "text": "So I will go to the great and speak to them, for they know the way of the LORD, the law of their God. But these also have broken the yoke; they all have torn off the bonds.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/19/2/3'>Ps. 2:3</a>",
      "comment": "Both leaders and common people share in guilt. Spiritual authority is significant—when it strays, the people often follow."
    },
    {
      "pk": 1953055,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 6,
      "text": "Therefore a lion from the forest will attack them, a wolf from the desert will destroy them, a leopard is watching their cities. Whoever goes out will be torn in pieces, for their transgressions are many, their apostasies are great.",
      "links": "<a href='/AIV/28/13/7'>Hos. 13:7-8</a>",
      "comment": "The beasts symbolize foreign invaders and God's judgment (compare Revelation 13 for the motif of beasts as enemies)."
    },
    {
      "pk": 1953056,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 7,
      "text": "Why should I pardon you? Your children have forsaken Me and sworn by gods that are not gods. I fed them to the full, and they committed adultery and assembled themselves at the houses of prostitutes.",
      "links": "<a href='/AIV/32/2/9'>Jonah 2:9</a>; <a href='/AIV/02/20/3'>Ex. 20:3</a>",
      "comment": "Spiritual adultery is equated with idolatry (see also Hosea). God as faithful spouse is suggested—a theme deepened in the New Covenant (Eph. 5:25-27)."
    },
    {
      "pk": 1953057,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 8,
      "text": "They were well-fed, lusty stallions, each neighing after his neighbor’s wife.",
      "links": "<a href='/AIV/23/1/21'>Isa. 1:21</a>",
      "comment": "A vivid image of unchecked desire and the breakdown of the family and moral order."
    },
    {
      "pk": 1953058,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 9,
      "text": "Should I not punish them for these things? declares the LORD. Should I not avenge Myself on such a nation as this?",
      "links": "<a href='/AIV/24/9/9'>Jer. 9:9</a>",
      "comment": "Divine justice requires a response to grave evil. This foreshadows God's ultimate justice revealed in Christ."
    },
    {
      "pk": 1953059,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 10,
      "text": "Go up through her vineyards and destroy, but do not make a total end; remove her branches, for they do not belong to the LORD.",
      "links": "<a href='/AIV/23/6/13'>Isa. 6:13</a>; <a href='/AIV/43/15/2'>Jn. 15:2</a>",
      "comment": "Remnants are spared, foreshadowing the concept of a faithful remnant through whom God's promises are preserved (see Rom. 11:5)."
    },
    {
      "pk": 1953060,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 11,
      "text": "For the house of Israel and the house of Judah have been utterly unfaithful to Me, declares the LORD.",
      "links": "<a href='/AIV/24/3/8'>Jer. 3:8</a>",
      "comment": "Both kingdoms have broken covenant, stressing the unity and corporate responsibility of God's people."
    },
    {
      "pk": 1953061,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 12,
      "text": "They have denied the LORD and said, 'It is not He. Disaster will not come upon us; we will not see sword or famine.'",
      "links": "<a href='/AIV/24/14/13'>Jer. 14:13</a>",
      "comment": "A warning against false optimism and denying divine warnings—a temptation throughout history."
    },
    {
      "pk": 1953062,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 13,
      "text": "'The prophets will become wind; the word is not in them. So let what they say be done to them!'",
      "links": "<a href='/AIV/24/23/25-32'>Jer. 23:25-32</a>",
      "comment": "False prophets who speak their own words, not God's. Spiritual discernment is needed in every age."
    },
    {
      "pk": 1953063,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 14,
      "text": "Therefore thus says the LORD, the God of Armies: Because you have spoken this word, behold, I am making My words in your mouth a fire, and this people wood, and it shall consume them.",
      "links": "<a href='/AIV/24/1/9'>Jer. 1:9-10</a>; <a href='/AIV/20/25/21-22'>Prov. 25:21-22</a>",
      "comment": "The prophetic word brings both comfort and judgment. This foreshadows Christ as the Word who judges and saves."
    },
    {
      "pk": 1953064,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 15,
      "text": "Behold, I am bringing against you a nation from far away, O house of Israel, declares the LORD. It is an enduring nation, an ancient nation, a nation whose language you do not know nor understand what they say.",
      "links": "<a href='/AIV/28/8/1'>Hos. 8:1</a>; <a href='/AIV/05/28/49'>Deut. 28:49</a>",
      "comment": "God uses even pagan nations to accomplish His discipline. The unfamiliar language recalls Pentecost, where God's message is universal (Acts 2:4-11)."
    },
    {
      "pk": 1953065,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 16,
      "text": "Their quiver is like an open grave; they are all mighty warriors.",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>",
      "comment": "Imagery of death and destruction. A warning against misplaced trust in human strength."
    },
    {
      "pk": 1953066,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 17,
      "text": "They will devour your harvest and your food; they will devour your sons and your daughters; they will devour your flocks and your herds; they will devour your vines and your fig trees. With the sword they will destroy your fortified cities in which you trust.",
      "links": "<a href='/AIV/24/8/13'>Jer. 8:13</a>",
      "comment": "Total devastation is promised for unrepentance. Even strongholds offer no protection without faithfulness to God."
    },
    {
      "pk": 1953067,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 18,
      "text": "But even in those days, declares the LORD, I will not make a complete end of you.",
      "links": "<a href='/AIV/24/4/27'>Jer. 4:27</a>",
      "comment": "God's mercy and the promise of a remnant always remain (see Rom. 11:5, Is. 10:21-22)."
    },
    {
      "pk": 1953068,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 19,
      "text": "When they ask, 'Why has the LORD our God done all these things to us?' you will say to them, 'Just as you have forsaken Me and served foreign gods in your land, so you will serve foreigners in a land that is not yours.'",
      "links": "<a href='/AIV/05/28/36'>Deut. 28:36</a>",
      "comment": "God's justice is fair and reciprocal—exile is the direct result of idolatry. Repentance always remains a solution."
    },
    {
      "pk": 1953069,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 20,
      "text": "Declare this in the house of Jacob and proclaim it in Judah:",
      "links": "<a href='/AIV/24/2/4'>Jer. 2:4</a>",
      "comment": "The message is for all of God's people, emphasizing unity and shared responsibility."
    },
    {
      "pk": 1953070,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 21,
      "text": "'Hear this, O foolish people, who have no understanding, who have eyes but do not see, who have ears but do not hear.'",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/40/13/14-15'>Matt. 13:14-15</a>",
      "comment": "Spiritual blindness and deafness recur throughout Scripture—Jesus applies this repeatedly in the Gospels."
    },
    {
      "pk": 1953071,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 22,
      "text": "Do you not fear Me? declares the LORD. Will you not tremble in My presence? I placed the sand as the boundary for the sea, an everlasting barrier that it cannot cross. Though its waves toss, they cannot prevail; though they roar, they cannot pass over it.",
      "links": "<a href='/AIV/18/38/8-11'>Job 38:8-11</a>",
      "comment": "God as Creator governs all things. Echoes of creation are found here, and Christ later reveals His command over nature (Mark 4:39-41)."
    },
    {
      "pk": 1953072,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 23,
      "text": "But this people has a stubborn and rebellious heart; they have turned aside and gone away.",
      "links": "<a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Rebellion comes from the heart. True conversion is an interior transformation."
    },
    {
      "pk": 1953073,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 24,
      "text": "They do not say in their hearts, 'Let us fear the LORD our God, who gives the rain in its season, the autumn rain and the spring rain, and keeps for us the appointed weeks of harvest.'",
      "links": "<a href='/AIV/28/6/3'>Hos. 6:3</a>; <a href='/AIV/05/11/14'>Deut. 11:14</a>",
      "comment": "God as provider in creation, sacramental overtones in God's sustaining presence (see also Matthew 5:45)."
    },
    {
      "pk": 1953074,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 25,
      "text": "Your sins have turned these away, and your iniquities have withheld good from you.",
      "links": "<a href='/AIV/23/59/2'>Isa. 59:2</a>",
      "comment": "Sin disrupts the relationship with God and blocks His blessings. The need for frequent confession and repentance is highlighted."
    },
    {
      "pk": 1953075,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 26,
      "text": "For wicked men are found among My people; they watch like fowlers lying in wait. They set a trap; they catch men.",
      "links": "<a href='/AIV/19/10/9'>Ps. 10:9</a>",
      "comment": "Evil within the community is even more dangerous than outside threats—see also Christ's warnings about wolves among the flock (Matt. 7:15)."
    },
    {
      "pk": 1953076,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 27,
      "text": "Their houses are full of deceit, like a bird-cage full of birds; therefore they have become great and rich.",
      "links": "<a href='/AIV/19/73/12'>Ps. 73:12</a>",
      "comment": "Wealth built on sin leads to spiritual emptiness (see Luke 12:20-21). True riches come from upright living."
    },
    {
      "pk": 1953077,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 28,
      "text": "They have grown fat and sleek. They surpass in evil deeds; they do not plead the cause, the cause of the orphan, so that they prosper; and they do not defend the rights of the poor.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/59/1/27'>Jas. 1:27</a>",
      "comment": "Social justice—care for the poor and orphan—is central to true religious practice, a theme reinforced by Jesus and the apostles."
    },
    {
      "pk": 1953078,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 29,
      "text": "Shall I not punish them for these things? declares the LORD; shall I not avenge Myself on such a nation as this?",
      "links": "<a href='/AIV/24/5/9'>Jer. 5:9</a>",
      "comment": "Repetition of this phrase marks the seriousness of their crimes and prepares the hearer for the coming judgment."
    },
    {
      "pk": 1953079,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 30,
      "text": "An appalling and horrible thing has happened in the land:",
      "links": "<a href='/AIV/24/23/14'>Jer. 23:14</a>",
      "comment": "The Prophet is shocked at the corruption. ‘Appalling’ signals an evil that reaches deeply into God's people."
    },
    {
      "pk": 1953080,
      "translation": "AIV",
      "book": 24,
      "chapter": 5,
      "verse": 31,
      "text": "The prophets prophesy falsely, and the priests rule by their own authority, and My people love it this way; but what will you do when the end comes?",
      "links": "<a href='/AIV/24/6/13-15'>Jer. 6:13-15</a>; <a href='/AIV/24/23/21-22'>Jer. 23:21-22</a>",
      "comment": "Failure of both spiritual and civil leaders brings ruin. Authentic spiritual authority remains a central theme throughout salvation history."
    }
  ],
  "translatedAt": "2025-12-23T06:17:30.669Z"
}