{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 17,
  "verses": [
    {
      "pk": 30017001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 1,
      "text": "The sin of Judah is written with an iron pen; with a diamond point it is engraved on the tablet of their heart and on the horns of their altars.",
      "links": "<a href='/AIV/02/32/16'>Ex. 32:16</a>; <a href='/AIV/20/3/3'>Prov. 3:3</a>; <a href='/AIV/26/8/10'>Ezek. 8:10</a>",
      "comment": "Sin is described as being permanently engraved on Judah's heart and their places of worship, echoing the seriousness and depth of their rebellion. The image points to the need for a new heart (see Jer. 31:33), fulfilled in the new covenant established by Christ."
    },
    {
      "pk": 30017002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 2,
      "text": "Their children remember their altars and their Asherah poles, beside every green tree on the high hills.",
      "links": "<a href='/AIV/05/12/2'>Deut. 12:2</a>; <a href='/AIV/11/14/23'>1 Kings 14:23</a>",
      "comment": "Worship of false gods had become tradition, passed from one generation to the next. This warns against the power of corrupt traditions, implying the importance of faithful worship and the danger of idolatry."
    },
    {
      "pk": 30017003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 3,
      "text": "O My mountain in the open field, I will give your wealth and all your treasures away as plunder, along with your high places, because of the sin throughout your territory.",
      "links": "<a href='/AIV/23/39/6'>Isa. 39:6</a>; <a href='/AIV/24/15/13'>Jer. 15:13</a>",
      "comment": "The 'mountain in the open field' likely refers to Jerusalem or Zion. Their treasures and places of worship will be lost because of their pervasive sin. This is a warning about the consequences of forsaking God, and prefigures judgment themes explained in the New Testament."
    },
    {
      "pk": 30017004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 4,
      "text": "You will lose the heritage that I gave you, and I will cause you to serve your enemies in a land that you do not know; for you have kindled a fire in My anger that will burn forever.",
      "links": "<a href='/AIV/05/28/36'>Deut. 28:36</a>; <a href='/AIV/24/15/14'>Jer. 15:14</a>",
      "comment": "Judah will lose its spiritual inheritance due to persistent sin. Yet God's justice and discipline ultimately lead to restoration, as seen in later prophecies."
    },
    {
      "pk": 30017005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 5,
      "text": "This is what the LORD says: Cursed is the man who trusts in people, who depends on human strength, and whose heart turns away from the LORD.",
      "links": "<a href='/AIV/19/118/8-9'>Ps. 118:8-9</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "Trust in human ability instead of God leads to a spiritual curse. True blessing comes from reliance on God alone—a theme fulfilled in Christ, who is the new source of trust for believers (cf. John 14:1)."
    },
    {
      "pk": 30017006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 6,
      "text": "He will be like a shrub in the desert, and will not see prosperity when it comes. He will dwell in the parched places of the wilderness, in a salt land where no one lives.",
      "links": "<a href='/AIV/24/48/6'>Jer. 48:6</a>; <a href='/AIV/05/29/23'>Deut. 29:23</a>",
      "comment": "Those who forsake God live spiritually barren lives. This imagery is echoed by Jesus' warnings about building on sand (Matt. 7:26-27)."
    },
    {
      "pk": 30017007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 7,
      "text": "Blessed is the man who trusts in the LORD, whose confidence is in Him.",
      "links": "<a href='/AIV/19/40/4'>Ps. 40:4</a>; <a href='/AIV/19/84/12'>Ps. 84:12</a>",
      "comment": "This verse, paired with v.5, presents two paths: blessing or curse. Early Christian thinkers saw this as typological of the two ways—life or death—articulated by Christ (cf. Matt. 7:13-14)."
    },
    {
      "pk": 30017008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 8,
      "text": "He will be like a tree planted by the waters, that sends out its roots by the stream, and does not fear when heat comes, for its leaves remain green. It is not anxious in the time of drought, and never stops bearing fruit.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/19/92/12-14'>Ps. 92:12-14</a>",
      "comment": "Intimacy with God brings life and steadfastness, a theme taken up by Jesus in John 15:5, where He is the vine and we are the branches. The continual 'bearing fruit' hints at perseverance fostered by grace."
    },
    {
      "pk": 30017009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 9,
      "text": "The heart is more deceitful than all things and desperately sick; who can understand it?",
      "links": "<a href='/AIV/01/6/5'>Gen. 6:5</a>; <a href='/AIV/19/14/1-3'>Ps. 14:1-3</a>; <a href='/AIV/40/15/19'>Matt. 15:19</a>",
      "comment": "This diagnosis of human nature underlines the necessity of supernatural grace. It also supports the doctrine of original sin and points toward the need for inner transformation, promised in the new covenant (Jer. 31:33; Ezek. 36:26)."
    },
    {
      "pk": 30017010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 10,
      "text": "I, the LORD, search the heart and examine the mind, to reward each person according to his ways, according to the fruit of his deeds.",
      "links": "<a href='/AIV/19/7/9'>Ps. 7:9</a>; <a href='/AIV/23/40/10'>Isa. 40:10</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>; <a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "God's justice considers both internal motives and outward actions. This is echoed in Paul's teachings (Rom. 2:6), emphasizing the harmony of faith and works in salvation."
    },
    {
      "pk": 30017011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 11,
      "text": "Like a partridge that gathers eggs it did not lay, so is he who gains riches unjustly; in the midst of his days they will abandon him, and at his end he will be a fool.",
      "links": "<a href='/AIV/19/39/6'>Ps. 39:6</a>; <a href='/AIV/20/13/11'>Prov. 13:11</a>",
      "comment": "Ill-gotten wealth eventually fails. This proverb underlines God's call to justice. It also hints at the futility of material riches apart from God, as Christ repeatedly taught (Luke 12:20)."
    },
    {
      "pk": 30017012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 12,
      "text": "A glorious throne on high from the beginning is the place of our sanctuary.",
      "links": "<a href='/AIV/19/89/14'>Ps. 89:14</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "This looks beyond the earthly temple to the heavenly throne. The true sanctuary is ultimately fulfilled in Christ, whose body is the temple (John 2:19-21)."
    },
    {
      "pk": 30017013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 13,
      "text": "O LORD, the hope of Israel, all who forsake You will be put to shame. Those who turn away from You will be written in the dust, for they have abandoned the LORD, the fountain of living water.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/43/8/6'>John 8:6</a>",
      "comment": "Those who leave God lose their true hope. The 'fountain of living water' imagery is fully realized in Christ's offer of living water (John 4:10, 14; 7:38)."
    },
    {
      "pk": 30017014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 14,
      "text": "Heal me, O LORD, and I will be healed. Save me, and I will be saved, for You are my praise.",
      "links": "<a href='/AIV/02/15/26'>Ex. 15:26</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "A prayer recognizing God's exclusive power to heal and save—physically and spiritually—foreshadowing Christ's ministry of healing and ultimate salvation."
    },
    {
      "pk": 30017015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 15,
      "text": "Look, they say to me, 'Where is the word of the LORD? Let it come now!'",
      "links": "<a href='/AIV/24/20/7'>Jer. 20:7</a>; <a href='/AIV/26/12/22'>Ezek. 12:22</a>",
      "comment": "Skeptics in Jeremiah’s day mocked prophetic warnings, demanding instant proof. This reflects unbelief seen throughout salvation history (see 2 Pet. 3:4)."
    },
    {
      "pk": 30017016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 16,
      "text": "But I have not run away from being a shepherd after You, nor have I desired the day of disaster. You know what came out of my lips—it was before You.",
      "links": "<a href='/AIV/24/20/9'>Jer. 20:9</a>; <a href='/AIV/19/139/4'>Ps. 139:4</a>",
      "comment": "Jeremiah affirms his faithfulness. The true shepherd motif recalls Christ as the Good Shepherd who lays down His life for the sheep (John 10:11)."
    },
    {
      "pk": 30017017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 17,
      "text": "Do not be a terror to me; You are my refuge in the day of disaster.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>; <a href='/AIV/24/16/19'>Jer. 16:19</a>",
      "comment": "God is both just judge and merciful refuge. Jeremiah’s prayer mirrors the cry of the faithful for God’s protection, later seen in the lives of the apostles and saints."
    },
    {
      "pk": 30017018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 18,
      "text": "Let my persecutors be put to shame, but do not let me be put to shame. Let them be terrified, but do not let me be terrified. Bring upon them the day of disaster and crush them with double destruction.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/24/20/11'>Jer. 20:11-12</a>",
      "comment": "Jeremiah calls for justice against those who reject God’s Word. While strong, this prayer reflects the righteous longing for God’s vindication. In the New Covenant, Christ models perfect forgiveness but also warns of ultimate judgment (Matt. 25:41-46)."
    },
    {
      "pk": 30017019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 19,
      "text": "This is what the LORD said to me: Go and stand at the Gate of the People, through which the kings of Judah enter and leave, and in all the gates of Jerusalem,",
      "links": "<a href='/AIV/24/22/2'>Jer. 22:2</a>",
      "comment": "God commands Jeremiah to deliver His message publicly, signifying the universal call to faithfulness for both leaders and people."
    },
    {
      "pk": 30017020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 20,
      "text": "and say: Hear the word of the LORD, you kings of Judah, all Judah, and all the inhabitants of Jerusalem who enter through these gates.",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>",
      "comment": "The call is addressed to everyone: religious and civil leaders, and the people. Hearing the word is essential—a hint at the importance of tradition and apostolic teaching."
    },
    {
      "pk": 30017021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 21,
      "text": "This is what the LORD says: Guard yourselves for the sake of your lives, and do not carry any burden on the Sabbath day, or bring it in through the gates of Jerusalem.",
      "links": "<a href='/AIV/02/20/8-10'>Ex. 20:8-10</a>; <a href='/AIV/24/17/27'>Jer. 17:27</a>",
      "comment": "Sabbath keeping is critical to covenant faithfulness. This prefigures the Lord’s Day in Christian practice—honoring God above all and finding true rest in Him."
    },
    {
      "pk": 30017022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 22,
      "text": "Do not carry burdens out of your houses on the Sabbath or do any work. Keep the Sabbath day holy, as I commanded your fathers.",
      "links": "<a href='/AIV/02/16/23'>Ex. 16:23</a>; <a href='/AIV/05/5/12'>Deut. 5:12</a>",
      "comment": "Keeping the Sabbath as 'holy' points to God’s desire for sanctified time. Early Christians celebrated the resurrection through regular communal worship, underlying the continuity of this principle."
    },
    {
      "pk": 30017023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 23,
      "text": "But they did not listen or incline their ear; they stiffened their necks so they would not hear, nor receive instruction.",
      "links": "<a href='/AIV/02/32/9'>Ex. 32:9</a>; <a href='/AIV/24/7/24'>Jer. 7:24</a>",
      "comment": "Persistent disobedience is a recurring theme. Openness to God’s word is vital for faith—closed hearts reject both law and grace."
    },
    {
      "pk": 30017024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 24,
      "text": "But if you listen to Me, declares the LORD, and do not carry any burden through the gates of this city on the Sabbath day, but keep the Sabbath day holy by not working on it,",
      "links": "<a href='/AIV/24/26/13'>Jer. 26:13</a>",
      "comment": "God offers blessings for obedience. The promise of restoration is linked to honoring God’s commandments, which Christ fulfills and deepens."
    },
    {
      "pk": 30017025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 25,
      "text": "then there will enter through the gates of this city kings and princes who sit on the throne of David, riding in chariots and on horses, they and their officials, the men of Judah, and the inhabitants of Jerusalem. This city will be inhabited forever.",
      "links": "<a href='/AIV/24/33/17'>Jer. 33:17</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "The permanence of David’s throne is conditional on obedience. This promise is ultimately fulfilled in Jesus, the heir to David’s throne, whose reign is eternal (Luke 1:32-33)."
    },
    {
      "pk": 30017026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 26,
      "text": "People will come from the towns of Judah, from the villages around Jerusalem, from the land of Benjamin, from the foothills, from the hill country, and from the Negev, bringing burnt offerings, sacrifices, grain offerings, frankincense, and thank offerings to the house of the LORD.",
      "links": "<a href='/AIV/23/66/20'>Isa. 66:20</a>; <a href='/AIV/24/32/44'>Jer. 32:44</a>",
      "comment": "An image of the restored worship of God, incorporating all regions. Later Christian liturgy understood this as foreshadowing the offering of spiritual sacrifices—the Eucharist and prayers—from the whole world."
    },
    {
      "pk": 30017027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 17,
      "verse": 27,
      "text": "But if you do not listen to Me to keep the Sabbath day holy by not carrying burdens and entering the gates of Jerusalem on the Sabbath, then I will kindle a fire in its gates, and it shall consume the palaces of Jerusalem and not be quenched.",
      "links": "<a href='/AIV/25/4/11'>Lam. 4:11</a>; <a href='/AIV/14/36/19'>2 Chron. 36:19</a>",
      "comment": "Disregarding God's commands brings destruction, as fulfilled in the Babylonian exile. Yet, within this judgment is a call to conversion, reminding us that return to true worship and obedience restores communion with God."
    }
  ],
  "translatedAt": "2025-12-24T08:31:04.283Z"
}