{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 33,
  "verses": [
    {
      "pk": 2413301,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 1,
      "text": "The word of the LORD came to Jeremiah a second time, while he was still shut up in the courtyard of the guard:",
      "links": "<a href='/AIV/24/32/2'>Jer. 32:2</a>",
      "comment": "Jeremiah receives another direct message from God during his imprisonment, highlighting his prophetic role even in adversity."
    },
    {
      "pk": 2413302,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 2,
      "text": "Thus says the LORD who made the earth, the LORD who formed it to establish it—his name is the LORD:",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/19/95/5'>Ps. 95:5</a>",
      "comment": "Here, God's creative authority is emphasized. The phrase echoes Genesis 1 and Psalm 95, reinforcing God's sovereignty."
    },
    {
      "pk": 2413303,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 3,
      "text": "Call to me and I will answer you, and will show you great and hidden things which you do not know.",
      "links": "<a href='/AIV/19/91/15'>Ps. 91:15</a>; <a href='/AIV/42/24/45'>Luke 24:45</a>",
      "comment": "God invites Jeremiah to pray and promises revelation. Note spiritual themes of mystery and divine revelation fulfilled through Christ, as seen in Luke 24:45."
    },
    {
      "pk": 2413304,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 4,
      "text": "For thus says the LORD, the God of Israel, concerning the houses of this city and the houses of the kings of Judah that are torn down to defend against the siege mounds and the sword:",
      "links": "<a href='/AIV/24/32/28-29'>Jer. 32:28-29</a>",
      "comment": "The destruction due to Babylonian attack is lamented here, continues themes from Jeremiah 32 about divine judgment and restoration."
    },
    {
      "pk": 2413305,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 5,
      "text": "They are coming to fight the Chaldeans and to fill them with the dead bodies of men whom I have struck in my anger and wrath, for I have hidden my face from this city because of all their wickedness.",
      "links": "<a href='/AIV/24/32/30-31'>Jer. 32:30-31</a>; <a href='/AIV/19/89/46'>Ps. 89:46</a>",
      "comment": "God’s hiddenness and wrath recall Psalm 89:46. This demonstrates divine justice towards persistent sin."
    },
    {
      "pk": 2413306,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 6,
      "text": "Behold, I will bring to it health and healing, and I will heal them and reveal to them an abundance of peace and truth.",
      "links": "<a href='/AIV/24/30/17'>Jer. 30:17</a>; <a href='/AIV/19/85/10'>Ps. 85:10</a>",
      "comment": "Despite judgment, God promises restoration—health, healing, peace, and truth. This offers literal and spiritual meanings, foreshadowing messianic redemption."
    },
    {
      "pk": 2413307,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 7,
      "text": "I will restore the fortunes of Judah and Israel and rebuild them as they were at first.",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>",
      "comment": "Restoration of Israel and Judah resonates with God’s covenant faithfulness (see Jeremiah 29:14). Restoration is both physical and anticipates spiritual renewal."
    },
    {
      "pk": 2413308,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 8,
      "text": "I will cleanse them from all the guilt of their sin against me, and I will forgive all their sins of rebellion against me.",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "God’s promise of forgiveness and cleansing points toward New Covenant forgiveness, which finds its true fulfillment in Christ (see Jeremiah 31:34)."
    },
    {
      "pk": 2413309,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 9,
      "text": "This city shall be to me a name of joy, a praise and a glory before all nations of the earth, who shall hear of all the good that I do for them. They shall fear and tremble because of all the good and all the peace I provide for it.",
      "links": "<a href='/AIV/19/47/2'>Ps. 47:2</a>; <a href='/AIV/24/33/14'>Jer. 33:14</a>",
      "comment": "The restored city’s reputation among the nations points to God’s universal plan, an early sign of the global mission of the Church."
    },
    {
      "pk": 2413310,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 10,
      "text": "Thus says the LORD: In this place of which you say, 'It is desolate, without man or beast,' in the cities of Judah and the streets of Jerusalem that are empty, without man or inhabitant or beast, there will be heard again",
      "links": "<a href='/AIV/24/9/11'>Jer. 9:11</a>",
      "comment": "Desolation is not the final word—God promises renewal where only ruin is seen, consistent with prophetic hope."
    },
    {
      "pk": 2413311,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 11,
      "text": "the voice of joy and the voice of gladness, the voice of the bridegroom and the voice of the bride, the voices of those who sing, 'Give thanks to the LORD of hosts, for the LORD is good, for his steadfast love endures forever,' as they bring thank offerings to the house of the LORD. For I will restore the fortunes of the land as at first, says the LORD.",
      "links": "<a href='/AIV/19/106/1'>Ps. 106:1</a>; <a href='/AIV/24/30/19'>Jer. 30:19</a>",
      "comment": "Return of joy and worship, especially the restored thank offering, hints at sacramental worship and the centrality of thanksgiving in God’s dwelling."
    },
    {
      "pk": 2413312,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 12,
      "text": "Thus says the LORD of hosts: In this desolate place, without man or beast, and in all its cities, there shall again be habitations of shepherds resting their flocks.",
      "links": "<a href='/AIV/26/34/13'>Ezek. 34:13</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "Shepherd imagery commonly refers to God's pastoral care, foreshadowing Christ (see Psalm 23, Ezekiel 34:13)."
    },
    {
      "pk": 2413313,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 13,
      "text": "In the towns of the hill country, the towns of the lowland, the towns of the Negev, the land of Benjamin, the surroundings of Jerusalem, and the towns of Judah, flocks shall again pass under the hands of the one who counts them, says the LORD.",
      "links": "<a href='/AIV/24/32/44'>Jer. 32:44</a>",
      "comment": "The restoration covers all regions. Passing under the hands recalls Levitical traditions and divine oversight."
    },
    {
      "pk": 2413314,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 14,
      "text": "Behold, the days are coming, declares the LORD, when I will fulfill the good word that I have spoken concerning the house of Israel and the house of Judah.",
      "links": "<a href='/AIV/24/31/31'>Jer. 31:31</a>; <a href='/AIV/23/9/6-7'>Isa. 9:6-7</a>",
      "comment": "This prophecy about future fulfillment links to New Covenant themes and messianic expectations, pointing to God’s faithfulness across covenants."
    },
    {
      "pk": 2413315,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 15,
      "text": "In those days and at that time I will cause a righteous Branch to spring up for David, and he shall execute justice and righteousness in the land.",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/24/23/5'>Jer. 23:5</a>",
      "comment": "The 'righteous Branch' is a strong messianic prophecy, directly pointing to Christ’s lineage and role as the true Davidic King."
    },
    {
      "pk": 2413316,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 16,
      "text": "In those days Judah will be saved and Jerusalem will dwell securely. And this is the name by which it will be called: 'The LORD is our righteousness.'",
      "links": "<a href='/AIV/24/23/6'>Jer. 23:6</a>; <a href='/AIV/45/3/22'>Rom. 3:22</a>",
      "comment": "'The LORD is our righteousness' deepens the Christological theme—righteousness coming from God, fulfilled in Jesus (Romans 3:22)."
    },
    {
      "pk": 2413317,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 17,
      "text": "For thus says the LORD: David shall never lack a man to sit on the throne of the house of Israel;",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "God's eternal covenant with David finds ultimate fulfillment in the perpetual kingship of Christ (Luke 1:32-33; see also 2 Sam. 7:16)."
    },
    {
      "pk": 2413318,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 18,
      "text": "and the Levitical priests shall never lack a man before me to offer burnt offerings, to burn grain offerings, and to make sacrifices continually.",
      "links": "<a href='/AIV/3/6/20-23'>Lev. 6:20-23</a>; <a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Unending priesthood hints at new priestly fulfillment, traditionally seen in the eternal priesthood referenced in Psalm 110:4."
    },
    {
      "pk": 2413319,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 19,
      "text": "The word of the LORD came to Jeremiah:",
      "links": "<a href='/AIV/24/33/1'>Jer. 33:1</a>",
      "comment": "Formulaic introduction signals an important prophecy, linking back to verse 1—emphasizing repeated divine communication."
    },
    {
      "pk": 2413320,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 20,
      "text": "Thus says the LORD: If you can break my covenant with the day and my covenant with the night, so that day and night no longer come at their appointed time,",
      "links": "<a href='/AIV/1/8/22'>Gen. 8:22</a>",
      "comment": "The permanence of day and night is used to illustrate the unbreakable nature of God’s covenant."
    },
    {
      "pk": 2413321,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 21,
      "text": "then also my covenant with David my servant may be broken, so that he shall not have a son to reign on his throne, and my covenant with the Levitical priests, my ministers.",
      "links": "<a href='/AIV/2/19/6'>Ex. 19:6</a>; <a href='/AIV/11/2/4'>1 Kgs. 2:4</a>",
      "comment": "God equates the certainty of His covenant with David and the priesthood to cosmic order, underscoring eternal promises and the continuity of spiritual leadership."
    },
    {
      "pk": 2413322,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 22,
      "text": "As the host of heaven cannot be numbered and the sands of the sea cannot be measured, so I will multiply the descendants of David my servant and the Levitical priests who serve me.",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>; <a href='/AIV/27/12/3'>Dan. 12:3</a>",
      "comment": "God’s promise to make David’s and the Levitical line innumerable echoes Abrahamic blessings—a sign that God’s plans are both widespread and spiritual in scope."
    },
    {
      "pk": 2413323,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 23,
      "text": "The word of the LORD came to Jeremiah:",
      "links": "<a href='/AIV/24/33/19'>Jer. 33:19</a>",
      "comment": "Repeated divine communication shows the emphasis and certainty of the coming promise."
    },
    {
      "pk": 2413324,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 24,
      "text": "Have you not noticed what these people are saying, that the LORD has rejected the two families that he chose? Thus they despise my people, so that they are no longer a nation in their sight.",
      "links": "<a href='/AIV/24/31/36-37'>Jer. 31:36-37</a>",
      "comment": "The ‘two families’ (Judah and Israel) seem rejected, but God stresses they are not abandoned—a theme of enduring election and unity."
    },
    {
      "pk": 2413325,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 25,
      "text": "Thus says the LORD: If I have not made my covenant with day and night and the fixed order of heaven and earth,",
      "links": "<a href='/AIV/1/9/9-10'>Gen. 9:9-10</a>",
      "comment": "God appeals to natural law and cosmic order to affirm His faithfulness, cementing the security of His promises."
    },
    {
      "pk": 2413326,
      "translation": "AIV",
      "book": 24,
      "chapter": 33,
      "verse": 26,
      "text": "then I will reject the descendants of Jacob and David my servant, so that I will not choose any of his descendants to rule over the seed of Abraham, Isaac, and Jacob. For I will restore their fortunes and have mercy on them.",
      "links": "<a href='/AIV/24/30/18'>Jer. 30:18</a>; <a href='/AIV/19/106/45'>Ps. 106:45</a>",
      "comment": "God reaffirms mercy and restoration. The line of David remains—and mercy is central, linking themes of grace across Scripture."
    }
  ],
  "translatedAt": "2025-12-23T06:32:28.768Z"
}