{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 11,
  "verses": [
    {
      "pk": 241101,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD:",
      "links": "",
      "comment": "Jeremiah frequently introduces messages with this phrase, highlighting prophetic authority (cf. Jer. 1:4)."
    },
    {
      "pk": 241102,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 2,
      "text": "Listen to the words of this covenant, and speak them to the men of Judah and the people of Jerusalem.",
      "links": "<a href='/AIV/02/19/5'>Ex. 19:5</a>; <a href='/AIV/05/29/1'>Deut. 29:1</a>",
      "comment": "God recalls the covenant made with Israel at Sinai; the communal aspect of the faith is emphasized, pointing to the necessity of both hearing and proclaiming God's law."
    },
    {
      "pk": 241103,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 3,
      "text": "You shall say to them, ‘This is what the LORD, the God of Israel, says: Cursed is the man who does not obey the words of this covenant,’",
      "links": "<a href='/AIV/05/27/26'>Deut. 27:26</a>; <a href='/AIV/48/3/10'>Gal. 3:10</a>",
      "comment": "This is a direct restatement of the curse from Deuteronomy, showing the seriousness of disobedience to God’s commandments."
    },
    {
      "pk": 241104,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 4,
      "text": "which I commanded your ancestors when I brought them out of the land of Egypt, out of the iron furnace, saying, ‘Obey my voice and do everything I command you. Then you will be my people, and I will be your God,’",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/05/4/20'>Deut. 4:20</a>",
      "comment": "The Exodus is foundational; obedience establishes the Israelite identity as God’s people. The ‘iron furnace’ imagery points to the purification through suffering and deliverance—foreshadowing spiritual transformation."
    },
    {
      "pk": 241105,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 5,
      "text": "so that I may fulfill the oath which I swore to your forefathers, to give them a land flowing with milk and honey, as it is today.” And I replied, ‘Amen, LORD.’",
      "links": "<a href='/AIV/01/15/18'>Gen. 15:18</a>; <a href='/AIV/02/3/8'>Ex. 3:8</a>",
      "comment": "'Amen' affirms agreement with God—this is the faithful response. The land promise is rooted in God's covenant with Abraham, echoed in later promises."
    },
    {
      "pk": 241106,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 6,
      "text": "Then the LORD said to me, “Proclaim all these words in the cities of Judah and in the streets of Jerusalem: ‘Listen to the words of this covenant and keep them.’",
      "links": "<a href='/AIV/05/6/6-7'>Deut. 6:6-7</a>",
      "comment": "God’s law is to be publicly proclaimed and internalized, reinforcing communal faith practice."
    },
    {
      "pk": 241107,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 7,
      "text": "For I solemnly warned your ancestors from the day I brought them out of the land of Egypt until today, rising early and warning them, saying, ‘Obey my voice.’",
      "links": "<a href='/AIV/02/15/26'>Ex. 15:26</a>; <a href='/AIV/26/18/9'>Ezek. 18:9</a>",
      "comment": "God’s persistent appeals underscore his patience and desire for relationship through obedience."
    },
    {
      "pk": 241108,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 8,
      "text": "But they did not listen or pay attention; instead, everyone followed the stubbornness of their evil heart. So I brought upon them all the words of this covenant, which I had commanded them to do, but they did not perform.",
      "links": "<a href='/AIV/05/29/19'>Deut. 29:19</a>; <a href='/AIV/24/7/24'>Jer. 7:24</a>",
      "comment": "Disobedience is described as ‘stubbornness of heart,’ a major theme throughout Scripture indicating rebellion against God’s will."
    },
    {
      "pk": 241109,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 9,
      "text": "And the LORD said to me, “A conspiracy has been found among the men of Judah and the inhabitants of Jerusalem.",
      "links": "<a href='/AIV/24/5/23'>Jer. 5:23</a>",
      "comment": "The use of 'conspiracy' shows deliberate rejection of God’s covenant; sin often takes root in communal rebellion."
    },
    {
      "pk": 241110,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 10,
      "text": "They have turned back to the iniquities of their forefathers, who refused to listen to my words. They have followed other gods to serve them. The house of Israel and the house of Judah have broken my covenant which I made with their fathers.”",
      "links": "<a href='/AIV/05/29/25'>Deut. 29:25</a>; <a href='/AIV/24/31/32'>Jer. 31:32</a>",
      "comment": "Idolatry is again presented as the root violation—breaking of covenant is equated with spiritual adultery."
    },
    {
      "pk": 241111,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 11,
      "text": "Therefore this is what the LORD says: ‘I am about to bring disaster upon them that they cannot escape. Though they cry out to me, I will not listen to them.’",
      "links": "<a href='/AIV/24/7/16'>Jer. 7:16</a>",
      "comment": "Persistent unrepentance eventually leads to judgment—a recurring theme in Jeremiah, reflected in God’s justice and holiness."
    },
    {
      "pk": 241112,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 12,
      "text": "Then the cities of Judah and the inhabitants of Jerusalem will go and cry out to the gods to whom they make offerings, but they will not save them at all in the time of their disaster.",
      "links": "<a href='/AIV/24/2/28'>Jer. 2:28</a>",
      "comment": "Idols are powerless; only the true God delivers. This demonstrates spiritual futility outside God's covenant."
    },
    {
      "pk": 241113,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 13,
      "text": "For your gods have become as many as your cities, Judah; and the altars you set up to burn incense to Baal are as numerous as the streets of Jerusalem.",
      "links": "<a href='/AIV/24/2/28'>Jer. 2:28</a>; <a href='/AIV/07/2/13'>Judg. 2:13</a>",
      "comment": "The multitude of idols and altars testify to the depths of apostasy, warning against the danger of divided worship."
    },
    {
      "pk": 241114,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 14,
      "text": "Therefore, do not pray for this people, nor lift up a cry or prayer for them; for I will not hear them in the time that they cry to me because of their trouble.",
      "links": "<a href='/AIV/24/7/16'>Jer. 7:16</a>; <a href='/AIV/19/66/18'>Ps. 66:18</a>",
      "comment": "Intercessory prayer is suspended as a sign of severity of judgment. This hints at the necessity of sincere repentance and mediation, a principle relevant throughout both Old and New Testaments."
    },
    {
      "pk": 241115,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 15,
      "text": "What right has my beloved in my house, when she has carried out so many evil schemes? Can holy offerings and sacrifices avert your disaster, while you continue doing evil?",
      "links": "<a href='/AIV/23/66/3'>Isa. 66:3</a>; <a href='/AIV/19/50/8-9'>Ps. 50:8-9</a>",
      "comment": "External rituals are worthless without inner conversion; the spiritual state of the worshiper matters more than the ritual itself (cf. Psalm 51:17)."
    },
    {
      "pk": 241116,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 16,
      "text": "The LORD once called you ‘a green olive tree, beautiful with good fruit.’ But with the roar of a great storm, he will set fire to it, and its branches will be broken.",
      "links": "<a href='/AIV/10/7/2'>2 Sam. 7:2</a>; <a href='/AIV/45/11/17'>Rom. 11:17</a>",
      "comment": "Olive tree is imagery for spiritual fullness and blessing—later adopted for the people of God in Romans. Broken branches foreshadow the consequence of rejecting God’s grace."
    },
    {
      "pk": 241117,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 17,
      "text": "The LORD of hosts, who planted you, has decreed disaster against you because of the evil done by the house of Israel and the house of Judah, provoking me by offering sacrifices to Baal.",
      "links": "<a href='/AIV/24/2/21'>Jer. 2:21</a>; <a href='/AIV/05/4/26'>Deut. 4:26</a>",
      "comment": "Despite being ‘planted’ by God, idolatry uproots the spiritual life of the people. The link to planting echoes the need for continuity in faith and obedience."
    },
    {
      "pk": 241118,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 18,
      "text": "The LORD made it known to me, and I knew; then you showed me their deeds.",
      "links": "<a href='/AIV/24/20/10'>Jer. 20:10</a>",
      "comment": "Jeremiah’s prophetic insight is portrayed as a gift of revelation, showing the close relationship between prophet and God."
    },
    {
      "pk": 241119,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 19,
      "text": "I was like a gentle lamb led to the slaughter. I did not know that they had devised plots against me, saying, ‘Let us destroy the tree with its fruit; let us cut him off from the land of the living, so that his name may be remembered no more.’",
      "links": "<a href='/AIV/23/53/7-8'>Isa. 53:7-8</a>; <a href='/AIV/44/8/32-33'>Acts 8:32-33</a>",
      "comment": "Jeremiah becomes a prefigurement of the suffering servant in Isaiah 53—a prophecy ultimately fulfilled in Christ, the innocent lamb led to slaughter (cf. John 1:29). The spiritual reading points to the redemptive role of suffering in God's plan."
    },
    {
      "pk": 241120,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 20,
      "text": "But, O LORD of hosts, who judges righteously, who tests the heart and the mind, let me see your vengeance on them, for to you I have revealed my case.",
      "links": "<a href='/AIV/19/7/9'>Ps. 7:9</a>; <a href='/AIV/64/1/5'>Jude 1:5</a>",
      "comment": "Jeremiah appeals to God’s justice and omniscience, entrusting judgment to Him alone. Spiritual interpretation suggests reliance on God’s ultimate vindication in times of persecution."
    },
    {
      "pk": 241121,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 21,
      "text": "Therefore thus says the LORD concerning the men of Anathoth, who seek your life, saying, ‘Do not prophesy in the name of the LORD, or you shall die by our hand’:",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "Anathoth was Jeremiah’s hometown. Persecution for speaking God’s truth aligns with the fate of many prophets and foreshadows Christ’s own rejection and suffering."
    },
    {
      "pk": 241122,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 22,
      "text": "Therefore, this is what the LORD of hosts says: ‘Behold, I will punish them. The young men shall die by the sword, their sons and daughters shall die by famine.",
      "links": "<a href='/AIV/24/5/17'>Jer. 5:17</a>; <a href='/AIV/26/14/21'>Ezek. 14:21</a>",
      "comment": "Divine judgment comes both by sword (war) and famine. The reality of judgment underscores God’s sovereignty and justice, affirming the consequences of unrepentant sin."
    },
    {
      "pk": 241123,
      "translation": "AIV",
      "book": 24,
      "chapter": 11,
      "verse": 23,
      "text": "And none of them will be left, for I will bring disaster upon the men of Anathoth, in the year of their punishment.",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>; <a href='/AIV/24/23/12'>Jer. 23:12</a>",
      "comment": "Total destruction is pronounced as a consequence of collective rejection of God’s prophetic word, reminding us of the necessity of faithfulness. Spiritual implication: divine discipline, while severe, prepares the way for ultimate restoration and redemption (cf. Heb. 12:5-11)."
    }
  ],
  "translatedAt": "2025-12-23T06:20:23.193Z"
}