{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 26,
  "verses": [
    {
      "pk": 2402601,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 1,
      "text": "In the beginning of the reign of Jehoiakim son of Josiah, king of Judah, this word came from the LORD:",
      "links": "<a href='/AIV/12/23/36'>2 Kings 23:36</a>; <a href='/AIV/24/25/1'>Jer. 25:1</a>",
      "comment": "The historical context is the early reign of Jehoiakim, placing Jeremiah’s prophecy within a politically tense moment for Judah."
    },
    {
      "pk": 2402602,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 2,
      "text": "Thus says the LORD: Stand in the courtyard of the house of the LORD and speak to all the cities of Judah that come to worship in the house of the LORD—all the words that I command you to speak to them; do not omit a word.",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>; <a href='/AIV/24/1/17'>Jer. 1:17</a>",
      "comment": "Jeremiah is instructed to proclaim God's full message boldly, reflecting the prophet’s duty to speak truth without compromise. (cf. Acts 20:27)"
    },
    {
      "pk": 2402603,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 3,
      "text": "Perhaps they will listen and each turn from his evil way, so that I may relent from the disaster I intend to bring upon them because of the evil of their deeds.",
      "links": "<a href='/AIV/24/18/8'>Jer. 18:8</a>; <a href='/AIV/32/3/10'>Jonah 3:10</a>",
      "comment": "God’s mercy remains open to repentance, echoing consistent biblical themes that judgment is meant to bring repentance, not destruction (see Ezek. 18:23)."
    },
    {
      "pk": 2402604,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 4,
      "text": "You shall say to them: 'Thus says the LORD: If you will not listen to Me, to walk in My law which I have set before you,",
      "links": "<a href='/AIV/05/28/15'>Deut. 28:15</a>; <a href='/AIV/24/7/23'>Jer. 7:23</a>",
      "comment": "The emphasis on God’s law highlights the covenant context of Israel's relationship with God, a motif fulfilled and reinterpreted in Christ (Matt. 5:17)."
    },
    {
      "pk": 2402605,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 5,
      "text": "to listen to the words of My servants the prophets whom I send to you, rising early and sending them—but you have not listened—",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>; <a href='/AIV/24/7/25'>Jer. 7:25</a>",
      "comment": "God’s persistent sending of prophets anticipates the ultimate sending of His Son (Heb. 1:1–2; Mark 12:6), showing the continuity of revelation."
    },
    {
      "pk": 2402606,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 6,
      "text": "then I will make this house like Shiloh, and this city I will make a curse to all the nations of the earth.'\"",
      "links": "<a href='/AIV/09/4/10-11'>1 Sam. 4:10–11</a>; <a href='/AIV/24/7/12'>Jer. 7:12</a>",
      "comment": "Referencing Shiloh, the first place of God’s dwelling, signifies God’s willingness to withdraw His presence if His people remain unfaithful."
    },
    {
      "pk": 2402607,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 7,
      "text": "The priests and the prophets and all the people heard Jeremiah speaking these words in the house of the LORD.",
      "links": "<a href='/AIV/24/5/31'>Jer. 5:31</a>",
      "comment": "Note the contrast: Jeremiah as true prophet, versus priests and prophets of the establishment who often opposed God’s message."
    },
    {
      "pk": 2402608,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 8,
      "text": "And when Jeremiah had finished speaking all that the LORD had commanded him to say to all the people, the priests, the prophets, and all the people seized him, saying, 'You shall surely die!'",
      "links": "<a href='/AIV/24/20/2'>Jer. 20:2</a>; <a href='/AIV/40/23/34'>Matt. 23:34</a>",
      "comment": "The opposition Jeremiah faces prefigures opposition to Christ and the apostles (cf. John 15:20), reflecting how God’s true messengers are often persecuted."
    },
    {
      "pk": 2402609,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 9,
      "text": "'Why have you prophesied in the name of the LORD, saying, ",
      "This house shall be like Shiloh, and this city shall be desolate, without inhabitant": "?' And all the people gathered around Jeremiah in the house of the LORD.",
      "links": "<a href='/AIV/24/7/14'>Jer. 7:14</a>",
      "comment": "Their shock reveals their misunderstanding of God’s sovereignty—God is not bound to any building or location if His people are unfaithful (see Acts 7:48)."
    },
    {
      "pk": 2402610,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 10,
      "text": "When the officials of Judah heard these things, they came up from the king's house to the house of the LORD and sat in the entry of the New Gate of the house of the LORD.",
      "links": "<a href='/AIV/24/20/2'>Jer. 20:2</a>",
      "comment": "The New Gate shows administrative order in temple life; the officials convene as a kind of council to address prophetic disputes—a foreshadowing of later church councils for discerning truth."
    },
    {
      "pk": 2402611,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 11,
      "text": "Then the priests and the prophets spoke to the officials and to all the people, saying, 'This man deserves the sentence of death, because he has prophesied against this city, as you have heard with your own ears.'",
      "links": "<a href='/AIV/03/20/27'>Lev. 20:27</a>",
      "comment": "Like Jesus and Stephen (Acts 6:13–14), Jeremiah faces death for God’s word—a pattern of righteous sufferers in salvation history."
    },
    {
      "pk": 2402612,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 12,
      "text": "But Jeremiah said to all the officials and all the people, 'The LORD sent me to prophesy against this house and this city all the words you have heard.",
      "links": "<a href='/AIV/24/1/7'>Jer. 1:7</a>",
      "comment": "Jeremiah’s claim to a divine commission validates his authority, a principle mirrored in apostolic authority for the leadership of the Church (John 20:21)."
    },
    {
      "pk": 2402613,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 13,
      "text": "Now, therefore, amend your ways and your deeds, and obey the voice of the LORD your God, and the LORD will relent of the disaster that he has pronounced against you.",
      "links": "<a href='/AIV/24/7/3'>Jer. 7:3</a>; <a href='/AIV/24/18/8'>Jer. 18:8</a>",
      "comment": "The call to repentance and conversion is the means for averting judgment—reflecting the biblical pattern that God’s justice is always open to mercy."
    },
    {
      "pk": 2402614,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 14,
      "text": "But as for me, behold, I am in your hands. Do with me as seems good and right to you.",
      "links": "<a href='/AIV/01/50/19'>Gen. 50:19</a>; <a href='/AIV/44/21/13'>Acts 21:13</a>",
      "comment": "Jeremiah’s willingness to submit is echoed in Christ’s own submission to unjust judgment (Matt. 26:39). There is a foreshadowing of self-offering for God’s will."
    },
    {
      "pk": 2402615,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 15,
      "text": "Only know for certain that if you put me to death, you will bring innocent blood upon yourselves and upon this city and its inhabitants, for in truth the LORD has sent me to you to speak all these words in your hearing.'",
      "links": "<a href='/AIV/40/27/24'>Matt. 27:24–25</a>",
      "comment": "The theme of innocent blood recurs in Scripture, both in the prophets and in the New Testament, culminating in the condemnation and crucifixion of Christ (Matt. 27:4)."
    },
    {
      "pk": 2402616,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 16,
      "text": "Then the officials and all the people said to the priests and the prophets, 'This man does not deserve the sentence of death, for he has spoken to us in the name of the LORD our God.'",
      "links": "<a href='/AIV/44/23/29'>Acts 23:29</a>",
      "comment": "Here, a council judges justly, discerning true prophecy, a key to right authority throughout biblical history and later in the Church."
    },
    {
      "pk": 2402617,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 17,
      "text": "And certain of the elders of the land rose up and spoke to all the assembled people, saying,",
      "links": "<a href='/AIV/24/5/5'>Jer. 5:5</a>",
      "comment": "The elders function as defenders of prophetic truth, showing a tradition where wisdom and discernment are exercised communally."
    },
    {
      "pk": 2402618,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 18,
      "text": "'Micah of Moresheth prophesied in the days of Hezekiah king of Judah, and said to all the people of Judah: ",
      "Thus says the LORD of hosts, 'Zion shall be plowed as a field; Jerusalem shall become a heap of ruins, and the mountain of the house a wooded height.'”'”": "",
      "links": "<a href='/AIV/33/3/12'>Mic. 3:12</a>; <a href='/AIV/24/7/13–14'>Jer. 7:13–14</a>",
      "comment": "The citation of Micah affirms prophetic continuity and the authority of earlier prophets, underscoring reverence for tradition in discerning truth."
    },
    {
      "pk": 2402619,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 19,
      "text": "Did Hezekiah king of Judah and all Judah put him to death? Did he not fear the LORD and seek the favor of the LORD, and did not the LORD relent of the disaster that he had pronounced against them? But we are about to bring great harm upon ourselves.'",
      "links": "<a href='/AIV/12/19/1–37'>2 Kings 19:1–37</a>; <a href='/AIV/24/18/8'>Jer. 18:8</a>",
      "comment": "Proper response to prophecy is repentance and trust, not violence; when leaders heed God's messengers, the people are blessed."
    },
    {
      "pk": 2402620,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 20,
      "text": "There was another man who prophesied in the name of the LORD—Uriah the son of Shemaiah from Kiriath-jearim—who prophesied against this city and against this land in words like those of Jeremiah.",
      "links": "<a href='/AIV/06/18/28'>Josh. 18:28</a>",
      "comment": "The mention of another persecuted prophet, Uriah, highlights the consistent resistance true prophecy faces—a pattern later fulfilled in Christ and the apostles."
    },
    {
      "pk": 2402621,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 21,
      "text": "And when King Jehoiakim, with all his warriors and all the officials, heard his words, the king sought to put him to death. But when Uriah heard of it, he was afraid and fled and escaped to Egypt.",
      "links": "<a href='/AIV/11/11/40'>1 Kings 11:40</a>",
      "comment": "Persecution drives Uriah into exile. Egypt often represents a place of temporary refuge but not ultimate restoration without God’s intervention."
    },
    {
      "pk": 2402622,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 22,
      "text": "Then King Jehoiakim sent men to Egypt: Elnathan son of Achbor, and others with him.",
      "links": "<a href='/AIV/12/22/12'>2 Kings 22:12</a>",
      "comment": "Royal authority overreaches in hunting Uriah; this shows how worldly power often seeks to suppress God’s word when uncomfortable."
    },
    {
      "pk": 2402623,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 23,
      "text": "And they took Uriah from Egypt and brought him to King Jehoiakim, who struck him down with the sword and threw his dead body into the graves of the common people.",
      "links": "<a href='/AIV/40/23/29–31'>Matt. 23:29–31</a>",
      "comment": "Uriah's martyrdom foreshadows the righteous suffering of later generations; burial with the common people signals a worldly dishonor but divine favor (Luke 14:11)."
    },
    {
      "pk": 2402624,
      "translation": "AIV",
      "book": 24,
      "chapter": 26,
      "verse": 24,
      "text": "But the hand of Ahikam son of Shaphan was with Jeremiah, so that he was not given over to the people to be put to death.",
      "links": "<a href='/AIV/24/39/14'>Jer. 39:14</a>; <a href='/AIV/12/22/12'>2 Kings 22:12</a>",
      "comment": "Ahikam's intervention shows how God preserves His prophets through the faithful, marking God's providence and using human agents for protection. The cooperation of the laity with God's work is a model for the role of all believers."
    }
  ],
  "translatedAt": "2025-12-23T06:28:06.437Z"
}