{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 40,
  "verses": [
    {
      "pk": 1234091,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD after Nebuzaradan, the captain of the guard, had released him from Ramah, when he had taken him bound in chains among all the exiles of Jerusalem and Judah, who were being carried away to Babylon.",
      "links": "<a href='/AIV/24/39/11-14'>Jer. 39:11–14</a>; <a href='/AIV/12/25/27'>2 Kgs. 25:27</a>",
      "comment": "This verse sets the stage for Jeremiah’s release. Note the detail that he is with the exiles, which supports the historical reliability of the text. The personal care of God for Jeremiah amid the judgment on Judah is highlighted."
    },
    {
      "pk": 1234092,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 2,
      "text": "The captain of the guard took Jeremiah and said to him, 'The LORD your God pronounced this disaster against this place.'",
      "links": "<a href='/AIV/24/7/15'>Jer. 7:15</a>; <a href='/AIV/24/25/9'>Jer. 25:9</a>",
      "comment": "Remarkably, a Babylonian acknowledges the LORD’s decree, showing God’s sovereignty over all nations. Compare with other pagan confessions in <a href='/AIV/27/4/34'>Daniel 4:34</a>."
    },
    {
      "pk": 1234093,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 3,
      "text": "'And the LORD has brought it about, and has done just as He said; because you sinned against the LORD and did not obey His voice, this thing has come upon you.'",
      "links": "<a href='/AIV/24/32/24'>Jer. 32:24</a>; <a href='/AIV/24/44/23'>Jer. 44:23</a>",
      "comment": "The captain recites Jeremiah’s prophecy nearly word-for-word. Notice how God’s justice and faithfulness are recognized, even by foreigners, reflecting universal moral order."
    },
    {
      "pk": 1234094,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 4,
      "text": "'Now, behold, I release you today from the chains on your hands. If it seems good to you to come with me to Babylon, come, and I will look after you. But if it seems wrong to you to come with me to Babylon, stay; see, the whole land is before you. Go wherever it seems good and right for you to go.'",
      "links": "<a href='/AIV/24/39/12'>Jer. 39:12</a>",
      "comment": "Jeremiah is given freedom, a contrast with the fate of most exiles, indicating God’s special providence. Spiritual interpretation sees in Jeremiah a type of the servant who suffers but is eventually exalted—compare with Christ’s vindication in <a href='/AIV/50/2/9-11'>Phil. 2:9-11</a>."
    },
    {
      "pk": 1234095,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 5,
      "text": "If you remain, return to Gedaliah son of Ahikam, son of Shaphan, whom the king of Babylon has appointed over the cities of Judah, and dwell with him among the people; or go wherever it seems right to you to go.' So the captain of the guard gave him an allowance of food and a gift, and let him go.",
      "links": "<a href='/AIV/24/39/14'>Jer. 39:14</a>; <a href='/AIV/24/40/7'>Jer. 40:7</a>",
      "comment": "Gedaliah is specifically mentioned as governor, reaffirming the continuity of leadership in Judah. Jeremiah’s sustenance points to the Lord’s practical care for His faithful in times of trial, foreshadowing spiritual nourishment given to God’s leaders."
    },
    {
      "pk": 1234096,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 6,
      "text": "Then Jeremiah went to Gedaliah the son of Ahikam, at Mizpah, and stayed with him among the people who were left in the land.",
      "links": "<a href='/AIV/12/25/23'>2 Kgs. 25:23</a>; <a href='/AIV/24/41/1'>Jer. 41:1</a>",
      "comment": "Jeremiah joins the remnant rather than seeking comfort elsewhere, modeling solidarity with the suffering people of God. This foreshadows the presence of true shepherds among their flock (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 1234097,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 7,
      "text": "Now when all the commanders of the forces in the field, they and their men, heard that the king of Babylon had appointed Gedaliah son of Ahikam over the land, and had committed to him men, women, and children, and those of the poorest of the land who had not been taken into exile to Babylon,",
      "links": "<a href='/AIV/24/39/10'>Jer. 39:10</a>; <a href='/AIV/24/52/16'>Jer. 52:16</a>",
      "comment": "The poorest are left to care for the land, a recurring Old Testament theme showing God’s concern for the humble and marginalized—cf. <a href='/AIV/19/113/7'>Psalm 113:7</a>."
    },
    {
      "pk": 1234098,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 8,
      "text": "They came to Gedaliah at Mizpah—namely, Ishmael son of Nethaniah, Johanan and Jonathan the sons of Kareah, Seraiah son of Tanhumeth, the sons of Ephai the Netophathite, and Jezaniah the son of the Maacathite, they and their men.",
      "links": "<a href='/AIV/24/41/1-2'>Jer. 41:1-2</a>",
      "comment": "These names are repeated elsewhere, supporting the narrative’s historicity. The assembly of leaders after judgment echoes restoration and the gathering of the faithful remnant."
    },
    {
      "pk": 1234099,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 9,
      "text": "Gedaliah the son of Ahikam, son of Shaphan, swore to them and to their men, saying, 'Do not be afraid to serve the Chaldeans. Dwell in the land and serve the king of Babylon, and it will go well with you.'",
      "links": "<a href='/AIV/24/27/12'>Jer. 27:12</a>; <a href='/AIV/24/29/7'>Jer. 29:7</a>",
      "comment": "This echoes Jeremiah’s earlier counsel to accept Babylonian authority as God’s discipline (see Jer. 29:7). Obedience here is a mark of fidelity to God’s will, even in exile."
    },
    {
      "pk": 1234100,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 10,
      "text": "'As for me, I will dwell at Mizpah, to represent you before the Chaldeans who come to us. But as for you, gather wine and summer fruits and oil, and store them in your vessels, and dwell in your cities that you have taken.'",
      "links": "<a href='/AIV/24/40/6'>Jer. 40:6</a>; <a href='/AIV/24/29/28'>Jer. 29:28</a>",
      "comment": "Gedaliah acts as a mediator for the remnant, anticipating the need for spiritual and practical leadership. See the typology of mediation, fulfilled ultimately in Christ (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 1234101,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 11,
      "text": "Likewise, when all the Jews who were in Moab and among the Ammonites and in Edom, and who were in all the countries, heard that the king of Babylon had left a remnant in Judah, and had appointed over them Gedaliah son of Ahikam, son of Shaphan,",
      "links": "<a href='/AIV/24/40/12'>Jer. 40:12</a>; <a href='/AIV/24/43/5'>Jer. 43:5</a>",
      "comment": "The gathering of the remnant from among the nations prefigures wider restoration and return—a recurring theme in both the Old and New Testaments (<a href='/AIV/23/11/11-12'>Isa. 11:11-12</a>)."
    },
    {
      "pk": 1234102,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 12,
      "text": "all the Jews returned from all the places where they had been driven and came to the land of Judah, to Gedaliah at Mizpah. And they gathered wine and summer fruits in great abundance.",
      "links": "<a href='/AIV/24/33/10-11'>Jer. 33:10-11</a>; <a href='/AIV/24/31/12'>Jer. 31:12</a>",
      "comment": "The abundant gathering of fruit is a sign of blessing and hope after judgment, hinting at the messianic banquet and eschatological renewal."
    },
    {
      "pk": 1234103,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 13,
      "text": "Now Johanan son of Kareah and all the commanders of the forces in the field came to Gedaliah at Mizpah",
      "links": "<a href='/AIV/24/40/8'>Jer. 40:8</a>",
      "comment": "Johanan’s leadership foreshadows coming problems and betrayals within the remnant, demonstrating the complexities of leadership among God's people."
    },
    {
      "pk": 1234104,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 14,
      "text": "and said to him, 'Do you know that Baalis the king of the Ammonites has sent Ishmael the son of Nethaniah to take your life?' But Gedaliah the son of Ahikam did not believe them.",
      "links": "<a href='/AIV/24/41/2'>Jer. 41:2</a>; <a href='/AIV/24/41/10'>Jer. 41:10</a>",
      "comment": "Political intrigue poses threats to the remnant’s fragile peace. Gedaliah’s refusal to believe in betrayal is a tragic foreshadowing, as later chapters show."
    },
    {
      "pk": 1234105,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 15,
      "text": "Then Johanan son of Kareah spoke secretly to Gedaliah at Mizpah, saying, 'Let me go and kill Ishmael son of Nethaniah, and no one will know it. Why should he take your life, so that all the Jews who are gathered to you would be scattered, and the remnant of Judah would perish?'",
      "links": "<a href='/AIV/24/41/15'>Jer. 41:15</a>",
      "comment": "The theme of intercession for the security of God’s people appears. Preservation of the remnant is seen as paramount, reflecting ongoing biblical concern for spiritual unity and protection."
    },
    {
      "pk": 1234106,
      "translation": "AIV",
      "book": 24,
      "chapter": 40,
      "verse": 16,
      "text": "But Gedaliah the son of Ahikam said to Johanan the son of Kareah, 'You shall not do this thing, for you are speaking falsely about Ishmael.'",
      "links": "<a href='/AIV/24/41/2'>Jer. 41:2</a>",
      "comment": "Gedaliah’s tragic misjudgment leads to disaster in following chapters. Spiritually, it warns against naivety and the need for discernment in leadership within the community, echoing Christ’s counsel in <a href='/AIV/40/10/16'>Matthew 10:16</a>."
    }
  ],
  "translatedAt": "2025-12-23T06:35:33.706Z"
}