{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 24,
  "verses": [
    {
      "pk": 235240,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 1,
      "text": "The LORD showed me, and there were two baskets of figs set before the temple of the LORD, after Nebuchadnezzar king of Babylon had taken Jeconiah the son of Jehoiakim, king of Judah, together with the officials of Judah, the craftsmen, and the metal workers, and had brought them captive to Babylon.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>; <a href='/AIV/24/29/2'>Jer. 29:2</a>",
      "comment": "The vision of the two baskets of figs comes after the first wave of exile, referencing the historical context of the Babylonian captivity. The precise mention of craftsmen and metal workers highlights those who were valuable to the Babylonians, implying God’s providence even in judgment. The setting at the temple points towards ongoing concern for true worship."
    },
    {
      "pk": 235241,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 2,
      "text": "One basket had very good figs, like early figs; but the other basket had very bad figs, so bad that they could not be eaten.",
      "links": "<a href='/AIV/28/9/10'>Hos. 9:10</a>; <a href='/AIV/33/7/1'>Mic. 7:1</a>",
      "comment": "The contrast between good and bad figs represents Israel’s divided spiritual state. The early figs are especially valued, referring to those who are first and faithful, while the bad figs evoke the total corruption of some. Early and good fruit is a recurring symbol for those faithful to God."
    },
    {
      "pk": 235242,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 3,
      "text": "Then the LORD said to me, 'What do you see, Jeremiah?' I said, 'Figs. The good figs are very good, and the bad are very bad, so bad that they cannot be eaten.'",
      "links": "<a href='/AIV/24/1/11'>Jer. 1:11–12</a>",
      "comment": "God draws Jeremiah’s attention to the clear division and quality of the figs, echoing earlier prophetic visions where God involves Jeremiah directly. The repetition emphasizes total separation between the faithful and the unfaithful."
    },
    {
      "pk": 235243,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 4,
      "text": "Then the word of the LORD came to me:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "A standard prophetic formula. This strengthens Jeremiah's role as a divinely sanctioned messenger, prefiguring the authority later given to the apostles in proclaiming the word of God (<a href='/AIV/40/10/40'>Matt. 10:40</a>)."
    },
    {
      "pk": 235244,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 5,
      "text": "Thus says the LORD, the God of Israel: Like these good figs, so I will regard as good the exiles from Judah, whom I have sent away from this place to the land of the Chaldeans.",
      "links": "<a href='/AIV/24/29/4-7'>Jer. 29:4–7</a>",
      "comment": "God’s surprising favor is for those taken into exile. The remnant, though suffering, are the ones God chooses to preserve and bless—mirroring the theme that suffering under God’s guidance can lead to purification and restoration. This has spiritual parallels with the idea of redemptive suffering in Christian theology."
    },
    {
      "pk": 235245,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 6,
      "text": "I will set my eyes upon them for their good, and I will bring them back to this land. I will build them up, and not tear them down; I will plant them, and not uproot them.",
      "links": "<a href='/AIV/24/31/28'>Jer. 31:28</a>; <a href='/AIV/24/42/10'>Jer. 42:10</a>",
      "comment": "Here God promises a future restoration, using the language of planting and building—frequent biblical metaphors for establishing His people. ‘I will bring them back’ anticipates the eventual return from exile but also prefigures future spiritual restoration in the New Covenant (<a href='/AIV/58/8/8-12'>Heb. 8:8–12</a>)."
    },
    {
      "pk": 235246,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 7,
      "text": "I will give them a heart to know that I am the LORD. They will be my people, and I will be their God, for they will return to me with all their heart.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/26/11/19'>Ezek. 11:19</a>; <a href='/AIV/40/22/37'>Matt. 22:37</a>",
      "comment": "This is a key promise: inner transformation and full-hearted return to God. The phrase echoes New Covenant promises in Jeremiah and Ezekiel, fulfilled in Christ when hearts are made new. The idea of ‘heart’ conversion is a precursor to later Christian emphasis on the interior life and ongoing spiritual renewal."
    },
    {
      "pk": 235247,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 8,
      "text": "But as for the bad figs, so bad that they cannot be eaten—this is what the LORD says—so I will treat Zedekiah king of Judah, his officials, the remnant of Jerusalem who remain in this land, and those who dwell in the land of Egypt.",
      "links": "<a href='/AIV/24/29/16-19'>Jer. 29:16–19</a>; <a href='/AIV/24/43/5-7'>Jer. 43:5–7</a>",
      "comment": "The focus shifts to those not taken into exile. Remaining in the land or fleeing to Egypt does not guarantee safety, but further exposes them to judgment. This shows that true security is in obedient fidelity to God’s will, not merely external location."
    },
    {
      "pk": 235248,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 9,
      "text": "I will make them a horror, a disaster to all the kingdoms of the earth, a reproach, a proverb, a taunt, and a curse in all the places where I shall drive them.",
      "links": "<a href='/AIV/24/29/18'>Jer. 29:18</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "The judgment upon the faithless is absolute: their fate serves as a warning and negative example, recalling covenant curses from Deuteronomy. The language here is strong—emphasizing the seriousness of choosing against God’s will."
    },
    {
      "pk": 235249,
      "translation": "AIV",
      "book": 24,
      "chapter": 24,
      "verse": 10,
      "text": "I will send upon them sword, famine, and pestilence, until they are destroyed from the land that I gave to them and their ancestors.",
      "links": "<a href='/AIV/24/27/8'>Jer. 27:8</a>; <a href='/AIV/24/16/4'>Jer. 16:4</a>",
      "comment": "The same pattern of judgment—sword, famine, and pestilence—repeats throughout Jeremiah. Loss of the land given to their ancestors underscores the gravity of breaking covenant. Still, note the divine justice and the sovereign right of God to discipline His people, which is a theme found throughout Scripture and challenges each generation to faithfulness within the covenant community."
    }
  ],
  "translatedAt": "2025-12-23T06:26:33.219Z"
}