{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 37,
  "verses": [
    {
      "pk": 30037001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 1,
      "text": "Zedekiah son of Josiah was made king in the land of Judah by Nebuchadnezzar king of Babylon, replacing Coniah son of Jehoiakim.",
      "links": "<a href='/AIV/12/24/17'>2 Kings 24:17</a>; <a href='/AIV/26/17/12'>Ezek. 17:12</a>",
      "comment": "This sets the historical context during the Babylonian occupation. Zedekiah is a puppet king installed by Babylon. The transition of power highlights foreign influence on God's chosen people, reminiscent of later periods of Church persecution and the importance of faithfulness under external rule."
    },
    {
      "pk": 30037002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 2,
      "text": "Neither he nor his servants nor the people of the land listened to the words of the LORD spoken through Jeremiah the prophet.",
      "links": "<a href='/AIV/24/36/24'>Jer. 36:24</a>; <a href='/AIV/24/7/25-27'>Jer. 7:25-27</a>",
      "comment": "Despite God's warning, the rulers and people are hardened in disobedience. This depicts the perennial struggle to heed God's revelation, paralleled in the rejection shown to Christ, for whom the prophets paved the way."
    },
    {
      "pk": 30037003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 3,
      "text": "King Zedekiah sent Jehucal son of Shelemiah and Zephaniah son of Maaseiah the priest to Jeremiah, saying, 'Please pray to the LORD our God for us.'",
      "links": "<a href='/AIV/24/21/2'>Jer. 21:2</a>; <a href='/AIV/24/29/25'>Jer. 29:25</a>",
      "comment": "The king seeks intercession through God's prophet, recognizing Jeremiah's unique standing as an intermediary. This foreshadows the enduring role of those empowered to pray for the people, signifying the ongoing need for spiritual mediation in salvation history."
    },
    {
      "pk": 30037004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 4,
      "text": "Now Jeremiah was still free to come and go among the people, for he had not yet been put into prison.",
      "links": "<a href='/AIV/24/32/2'>Jer. 32:2</a>",
      "comment": "At this point, Jeremiah's ministry is unhindered. His freedom symbolizes the unrestricted proclamation of God's truth, which would later be suppressed—much like the prophetic voice of Christ and the apostles in the face of opposition."
    },
    {
      "pk": 30037005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 5,
      "text": "Meanwhile, Pharaoh’s army had left Egypt, and when the Chaldeans who were besieging Jerusalem heard the report about them, they withdrew from Jerusalem.",
      "links": "<a href='/AIV/12/24/7'>2 Kings 24:7</a>; <a href='/AIV/24/34/21'>Jer. 34:21</a>",
      "comment": "Egypt's involvement temporarily relieves the siege, reflecting Israel’s recurring reliance on foreign powers instead of full trust in God—a theme seen throughout salvation history and a warning against worldly alliances."
    },
    {
      "pk": 30037006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 6,
      "text": "Then the word of the LORD came to Jeremiah the prophet:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>; <a href='/AIV/24/33/1-2'>Jer. 33:1-2</a>",
      "comment": "God continues to speak through Jeremiah, confirming the prophet's role as a divinely-appointed messenger. This fits the biblical motif of God using chosen individuals to convey His will and to challenge human authorities."
    },
    {
      "pk": 30037007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 7,
      "text": "‘This is what the LORD, the God of Israel, says: Tell the king of Judah who sent you to inquire of Me, “Pharaoh’s army, which came out to help you, will return to Egypt, to their own land.”’",
      "links": "<a href='/AIV/24/2/18'>Jer. 2:18</a>; <a href='/AIV/24/37/11'>Jer. 37:11</a>",
      "comment": "God declares that dependence on Egypt will fail. The futility of trusting in mere human strength is stressed, echoing New Testament admonitions to rely on God’s grace rather than worldly solutions (cf. John 15:5)."
    },
    {
      "pk": 30037008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 8,
      "text": "And the Chaldeans will return and fight against this city. They will capture it and burn it with fire.",
      "links": "<a href='/AIV/24/21/10'>Jer. 21:10</a>; <a href='/AIV/12/25/9'>2 Kings 25:9</a>",
      "comment": "Despite temporary relief, God's judgment will stand. The burning of Jerusalem foreshadows Christ’s prophecy about the destruction of Jerusalem (Luke 19:41-44), a theme picked up in both Old and New Testaments regarding judgment for persistent unbelief."
    },
    {
      "pk": 30037009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 9,
      "text": "Do not deceive yourselves by saying, ‘The Chaldeans will surely go away from us,’ for they will not.",
      "links": "<a href='/AIV/24/14/13-14'>Jer. 14:13-14</a>; <a href='/AIV/24/27/9-10'>Jer. 27:9-10</a>",
      "comment": "False security is warned against. Self-deception and false prophecy likewise afflicted the early Church, demonstrating the importance of discernment and submission to authentic prophetic voices reflected throughout Church history."
    },
    {
      "pk": 30037010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 10,
      "text": "Even if you were to defeat the entire army of Chaldeans who fight against you, and only wounded men remained among them, they would rise up each in his tent and burn this city with fire.",
      "links": "<a href='/AIV/24/21/4-10'>Jer. 21:4-10</a>",
      "comment": "God’s judgment cannot be thwarted by human effort, underlining the sovereignty of God's will. This principle undergirds the unity of the Church's mission and her trust in divine providence, not human strength."
    },
    {
      "pk": 30037011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 11,
      "text": "Now when the Chaldean army had withdrawn from Jerusalem because of Pharaoh’s army,",
      "links": "<a href='/AIV/24/37/5'>Jer. 37:5</a>",
      "comment": "This verse repeats the context of temporary relief, illustrating how fleeting worldly deliverance is. The passage hints at God's overarching plan, which is fulfilled through submission rather than resistance."
    },
    {
      "pk": 30037012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 12,
      "text": "Jeremiah left Jerusalem to go to the land of Benjamin in order to claim his share of property among the people.",
      "links": "<a href='/AIV/24/32/8'>Jer. 32:8</a>",
      "comment": "Jeremiah’s trip relates to his personal inheritance. Symbolically, God’s prophet securing an earthly portion hints at the incoming messianic promises of spiritual inheritance for all of God’s people—fulfilled in Christ."
    },
    {
      "pk": 30037013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 13,
      "text": "But when he came to the Gate of Benjamin, the captain of the guard, whose name was Irijah son of Shelemiah, son of Hananiah, arrested Jeremiah saying, 'You are defecting to the Chaldeans!'",
      "links": "<a href='/AIV/24/38/2'>Jer. 38:2</a>",
      "comment": "Jeremiah is wrongly accused of betrayal, paralleling accusations faced by Jesus and His apostles. Innocent suffering and unjust suspicion mark the lives of true prophets and prefigure Christ's Passion."
    },
    {
      "pk": 30037014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 14,
      "text": "Jeremiah replied, 'That is a lie. I am not defecting to the Chaldeans.' But Irijah would not listen to him; he arrested Jeremiah and brought him to the officials.",
      "links": "<a href='/AIV/24/38/24'>Jer. 38:24</a>; <a href='/AIV/24/18/18'>Jer. 18:18</a>",
      "comment": "The rejection of Jeremiah’s truth echoes the pattern of rejected prophecy. The silence or disregard for the true prophet is a theme reflected in both Testaments, most especially in Christ’s condemnation by religious leaders."
    },
    {
      "pk": 30037015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 15,
      "text": "The officials were angry with Jeremiah and beat him, and they put him in jail in the house of Jonathan the scribe, which they had made into a prison.",
      "links": "<a href='/AIV/24/20/2'>Jer. 20:2</a>; <a href='/AIV/24/38/6'>Jer. 38:6</a>",
      "comment": "Physical persecution of prophets is a recurring pattern. It foreshadows the sufferings of Christ and His followers (cf. Acts 5:40), emphasizing that fidelity to God may involve misunderstanding and suffering, yet perseverance is encouraged."
    },
    {
      "pk": 30037016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 16,
      "text": "Jeremiah was put into a vaulted cell in the dungeon, where he remained for many days.",
      "links": "<a href='/AIV/24/38/6-13'>Jer. 38:6-13</a>",
      "comment": "Prophets are often placed in confinement for their faithfulness, a motif continuing in apostolic times. The endurance shown by Jeremiah underlines the virtue of steadfastness, encouraged for all believers enduring trial."
    },
    {
      "pk": 30037017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 17,
      "text": "Then King Zedekiah sent for him and secretly questioned him in his house, asking, 'Is there any word from the LORD?' Jeremiah answered, 'There is.' Then he said, 'You will be delivered into the hand of the king of Babylon.'",
      "links": "<a href='/AIV/24/32/4'>Jer. 32:4</a>; <a href='/AIV/24/34/2'>Jer. 34:2</a>",
      "comment": "Zedekiah’s secret inquiry denotes his conflicted conscience, paralleling Pilate's reluctant questioning of Jesus. Jeremiah’s unwavering prophecy emphasizes the necessity of truth spoken even under pressure."
    },
    {
      "pk": 30037018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 18,
      "text": "Moreover, Jeremiah said to King Zedekiah, 'How have I sinned against you, or your servants, or this people, that you have put me in prison?'",
      "links": "<a href='/AIV/24/38/9'>Jer. 38:9</a>; <a href='/AIV/42/23/41'>Luke 23:41</a>",
      "comment": "Jeremiah asserts his innocence, reminiscent of Christ's innocence before Pilate. The theme of righteous suffering stands as a spiritual archetype in both Old and New Testaments."
    },
    {
      "pk": 30037019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 19,
      "text": "'Where are your prophets who prophesied to you, saying, “The king of Babylon will not come against you or against this land?”'",
      "links": "<a href='/AIV/24/14/13'>Jer. 14:13</a>; <a href='/AIV/24/28/7-9'>Jer. 28:7-9</a>",
      "comment": "Jeremiah points out the falsehood of hopeful prophecy. This verse advocates discernment in spiritual leadership and affirms the principle that tradition must align with authentic revelation."
    },
    {
      "pk": 30037020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 20,
      "text": "'Now please, my lord the king, let my petition come before you. Do not send me back to the house of Jonathan the scribe, or I will die there.'",
      "links": "<a href='/AIV/24/38/28'>Jer. 38:28</a>",
      "comment": "Jeremiah pleas for mercy and life. His humility and respect for authority reflect a model for intercession in prayer, prefiguring the petitions offered by saints and the faithful for deliverance and protection."
    },
    {
      "pk": 30037021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 37,
      "verse": 21,
      "text": "So King Zedekiah ordered that Jeremiah be placed in the court of the guard and given a daily loaf of bread from the bakers’ street, until all the bread in the city ran out. So Jeremiah remained in the court of the guard.",
      "links": "<a href='/AIV/24/38/13'>Jer. 38:13</a>; <a href='/AIV/19/105/16'>Ps. 105:16</a>",
      "comment": "Jeremiah is provided daily bread, foreshadowing God’s continual provision. The motif of daily sustenance echoes the Lord’s Prayer and the eucharistic promise of God’s sustenance for his people—a spiritual and literal fulfillment."
    }
  ],
  "translatedAt": "2025-12-24T08:42:27.962Z"
}