{
  "book": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 17,
  "verses": [
    {
      "pk": 24017001,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 1,
      "text": "The sin of Judah is written with an iron pen; with a diamond tip it is engraved on the tablet of their heart, and on the horns of your altars.",
      "links": "<a href='/AIV/20/3/3'>Prov. 3:3</a>; <a href='/AIV/26/14/3-5'>Ezek. 14:3-5</a>",
      "comment": "Sin is described as deeply ingrained, not just externally but internally, emphasizing the need for transformation of the heart rather than mere ritual compliance. The horns of the altar, a place of atonement (Ex. 27:2), ironically bear witness to their guilt, recalling the importance of true worship and repentance in the life of faith."
    },
    {
      "pk": 24017002,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 2,
      "text": "Their children remember their altars and their Asherah poles, beside the green trees on the high hills.",
      "links": "<a href='/AIV/05/12/2'>Deut. 12:2</a>; <a href='/AIV/06/23/7'>Josh. 23:7</a>",
      "comment": "Idol worship had permeated the family and community, leading even the children astray. This highlights how religious practice profoundly shapes generations and the critical role of teaching true worship (Deut. 6:4-7)."
    },
    {
      "pk": 24017003,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 3,
      "text": "O My mountain in the field, I will give your wealth and all your treasures for plunder, and your high places as sin throughout all your territory.",
      "links": "<a href='/AIV/23/39/6'>Isa. 39:6</a>; <a href='/AIV/24/15/13'>Jer. 15:13</a>",
      "comment": "'My mountain' likely refers to Zion, the sacred place God chose. Judgment falls not only on the land but on its central place of worship, showing that no place, even sacred, is immune from consequences of unfaithfulness."
    },
    {
      "pk": 24017004,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 4,
      "text": "You yourself shall let go of your heritage that I gave you, and I will make you serve your enemies in a land you do not know, for you have kindled a fire in My anger that shall burn forever.",
      "links": "<a href='/AIV/24/15/14'>Jer. 15:14</a>; <a href='/AIV/24/16/13'>Jer. 16:13</a>",
      "comment": "Loss of heritage and exile underline the seriousness of persistent rebellion. The 'forever' here expresses the totality and depth of the judgment, though restoration is a recurrent promise throughout Jeremiah."
    },
    {
      "pk": 24017005,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 5,
      "text": "This is what the LORD says: Cursed is the man who trusts in man and makes flesh his strength, whose heart turns away from the LORD.",
      "links": "<a href='/AIV/19/146/3'>Ps. 146:3</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "The heart’s allegiance is at stake: relying purely on human strength, rather than God, leads to spiritual ruin—a significant theme underlying the doctrine of grace and the need for divine assistance."
    },
    {
      "pk": 24017006,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 6,
      "text": "He is like a shrub in the desert and shall not see any good come. He shall dwell in the parched places of the wilderness, in a salt land where no one lives.",
      "links": "<a href='/AIV/05/29/23'>Deut. 29:23</a>",
      "comment": "A life apart from God is spiritually barren—similar imagery is used of Sodom and Gomorrah’s judgment (Deut. 29:23). Spiritual sterility results from forsaking God."
    },
    {
      "pk": 24017007,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 7,
      "text": "Blessed is the man who trusts in the LORD, whose confidence is in the LORD.",
      "links": "<a href='/AIV/19/1/1-3'>Ps. 1:1-3</a>; <a href='/AIV/19/34/8'>Ps. 34:8</a>",
      "comment": "A clear contrast: dependence on the Lord yields flourishing. Echoes Psalm 1, highlighting that true blessedness flows from trust in God, not oneself—a central truth reemphasized by Christ (Matt. 5:3-12)."
    },
    {
      "pk": 24017008,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 8,
      "text": "He will be like a tree planted by water, that sends out its roots by the stream. It does not fear when heat comes; its leaves are always green. It is not anxious in the year of drought, for it does not cease to bear fruit.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/19/92/12-14'>Ps. 92:12-14</a>",
      "comment": "Continues the Psalm 1 imagery—depicting the believer as steadfast and fruitful. The perseverance and fruitfulness reflect the life of grace and stability found in God's faithful people."
    },
    {
      "pk": 24017009,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 9,
      "text": "The heart is deceitful above all things and desperately sick; who can understand it?",
      "links": "<a href='/AIV/01/06/5'>Gen. 6:5</a>; <a href='/AIV/41/07/21-23'>Mark 7:21-23</a>",
      "comment": "Human nature’s fallenness is underlined—pointing forward to the necessity of renewal, which the New Covenant promises (Jer. 31:33). Jesus also teaches the corruption of the heart (Mark 7:21-23)."
    },
    {
      "pk": 24017010,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 10,
      "text": "I, the LORD, search the heart and test the mind, to give every man according to his ways, according to the fruit of his deeds.",
      "links": "<a href='/AIV/19/07/9'>Ps. 7:9</a>; <a href='/AIV/66/2/23'>Rev. 2:23</a>",
      "comment": "Divine judgment is just and all-seeing. Both interior motive and exterior action are evaluated. This theme is crucial for understanding the relationship between faith and works (cf. James 2:14-26)."
    },
    {
      "pk": 24017011,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 11,
      "text": "Like a partridge that gathers chicks she did not lay, so is one who gains riches unjustly; in the midst of his days they will leave him, and at his end he will be a fool.",
      "links": "<a href='/AIV/19/39/6'>Ps. 39:6</a>; <a href='/AIV/20/13/11'>Prov. 13:11</a>",
      "comment": "Ill-gotten gain is ultimately futile. The wisdom literature’s teachings on just stewardship and integrity are echoed here, supporting a holistic view of moral living."
    },
    {
      "pk": 24017012,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 12,
      "text": "A glorious throne, exalted from the beginning, is the place of our sanctuary.",
      "links": "<a href='/AIV/02/25/8'>Ex. 25:8</a>; <a href='/AIV/19/99/1'>Ps. 99:1</a>",
      "comment": "God’s eternal throne is linked to the sanctuary—His appointed place for worship—prefiguring the new and everlasting covenant and the heavenly sanctuary described in Revelation."
    },
    {
      "pk": 24017013,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 13,
      "text": "O LORD, the hope of Israel, all who forsake You will be put to shame; those who turn away from You will be written in the earth, for they have abandoned the LORD, the fountain of living water.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/43/4/10-14'>John 4:10-14</a>",
      "comment": "The 'fountain of living water' is later applied to Christ (John 4:10-14). Turning from God leads to spiritual dryness and shame. Those written 'in the earth' may contrast with those written in God's book (cf. Dan. 12:1; Luke 10:20)."
    },
    {
      "pk": 24017014,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 14,
      "text": "Heal me, O LORD, and I shall be healed; save me, and I shall be saved, for You are the one I praise.",
      "links": "<a href='/AIV/19/103/3'>Ps. 103:3</a>; <a href='/AIV/24/30/17'>Jer. 30:17</a>",
      "comment": "Healing and salvation come only from God, expressing dependence and setting the stage for the Messianic hope fulfilled in Christ’s ministry (cf. Luke 4:18-19)."
    },
    {
      "pk": 24017015,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 15,
      "text": "Look, they keep saying to me, 'Where is the word of the LORD? Let it come now!'",
      "links": "<a href='/AIV/24/5/12'>Jer. 5:12</a>; <a href='/AIV/24/20/7-8'>Jer. 20:7-8</a>",
      "comment": "Mockers demand immediate fulfillment of prophecy, not recognizing God's timing, echoing the challenges faced by prophets throughout salvation history."
    },
    {
      "pk": 24017016,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 16,
      "text": "But I have not run away from being a shepherd after You, nor have I desired the day of disaster. You know what came out of my lips; it was all before You.",
      "links": "<a href='/AIV/24/11/19'>Jer. 11:19</a>; <a href='/AIV/44/20/26-27'>Acts 20:26-27</a>",
      "comment": "Jeremiah stands as a faithful shepherd, prefiguring Christ the Good Shepherd (John 10:11), even amidst suffering brought by his prophetic ministry."
    },
    {
      "pk": 24017017,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 17,
      "text": "Do not be a terror to me; You are my refuge in the day of disaster.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "God is Jeremiah’s only safe haven—connecting to psalms that confess the Lord as refuge."
    },
    {
      "pk": 24017018,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 18,
      "text": "Let my persecutors be put to shame, but not me; let them be terrified, but not me. Bring upon them the day of disaster; destroy them with double destruction.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/24/11/20'>Jer. 11:20</a>",
      "comment": "An appeal for justice, not personal vengeance, reflecting the psalmic tradition of entrusting retribution to God."
    },
    {
      "pk": 24017019,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 19,
      "text": "Thus says the LORD to me: Go and stand in the gate of the children of the people, by which the kings of Judah come in and by which they go out, and in all the gates of Jerusalem;",
      "links": "<a href='/AIV/24/7/2'>Jer. 7:2</a>",
      "comment": "A public and prophetic pronouncement at the city gates, the place of assembly and justice; underscoring the communal dimension of God’s covenant."
    },
    {
      "pk": 24017020,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 20,
      "text": "Say to them, 'Hear the word of the LORD, you kings of Judah, and all Judah and all the inhabitants of Jerusalem who enter by these gates.'",
      "links": "<a href='/AIV/24/22/2'>Jer. 22:2</a>",
      "comment": "The call to hear is addressed to all, but especially leaders, highlighting their responsibility to the covenant community."
    },
    {
      "pk": 24017021,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 21,
      "text": "Thus says the LORD: Take care for the sake of your lives, and do not carry any burden on the Sabbath day or bring it in by the gates of Jerusalem.",
      "links": "<a href='/AIV/02/20/8-10'>Ex. 20:8-10</a>; <a href='/AIV/16/13/15-19'>Neh. 13:15-19</a>",
      "comment": "Sabbath observance is a sign of covenant faithfulness (Ex. 31:13). True rest, which finds its fulfillment in Christ (Matt. 11:28), is both outward command and spiritual reality."
    },
    {
      "pk": 24017022,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 22,
      "text": "And do not carry a burden out of your houses on the Sabbath day or do any work, but keep the Sabbath day holy, as I commanded your fathers.",
      "links": "<a href='/AIV/05/05/12-15'>Deut. 5:12-15</a>; <a href='/AIV/26/20/12'>Ezek. 20:12</a>",
      "comment": "Keeping the Sabbath set Israel apart, foreshadowing the Christian concept of sacred time and the rhythm of worship, rest, and renewal."
    },
    {
      "pk": 24017023,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 23,
      "text": "But they did not listen or incline their ear, but stiffened their neck, so that they would not hear or receive instruction.",
      "links": "<a href='/AIV/24/7/26'>Jer. 7:26</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "Rebellion is depicted as stubbornness against God’s clear revelation—an ongoing pattern later rebuked by early Christian preachers (Acts 7:51)."
    },
    {
      "pk": 24017024,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 24,
      "text": "But if you listen to Me, says the LORD, and bring no burden in by the gates of this city on the Sabbath day, but keep the Sabbath day holy and do no work on it,",
      "links": "<a href='/AIV/24/26/13'>Jer. 26:13</a>",
      "comment": "Obedience to God’s teaching brings life and blessing; God offers mercy and restoration through repentance."
    },
    {
      "pk": 24017025,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 25,
      "text": "Then there shall come in by the gates of this city kings and princes who sit on the throne of David, riding in chariots and on horses, they and their officials, the men of Judah, and the inhabitants of Jerusalem. And this city shall be inhabited forever.",
      "links": "<a href='/AIV/10/07/16'>2 Sam. 7:16</a>; <a href='/AIV/24/33/17'>Jer. 33:17</a>",
      "comment": "The Davidic promise is reiterated; dwelling in the city forever prefigures the everlasting kingdom inaugurated by God’s Messiah (Luke 1:32-33)."
    },
    {
      "pk": 24017026,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 26,
      "text": "And people will come from the cities of Judah, from the environs of Jerusalem, from the land of Benjamin, from the lowlands, from the hill country and from the Negev, bringing burnt offerings and sacrifices, grain offerings and incense, and bringing thank offerings to the house of the LORD.",
      "links": "<a href='/AIV/05/12/5-7'>Deut. 12:5-7</a>",
      "comment": "Universal pilgrimage hints at the gathering of all nations (Isa. 2:2-3). Sacrifices and offerings highlight the central place of worship, fulfilled spiritually through Christ’s sacrificial offering and ongoing liturgy of the new covenant."
    },
    {
      "pk": 24017027,
      "translation": "AIV",
      "book": 24,
      "chapter": 17,
      "verse": 27,
      "text": "But if you do not listen to Me to keep the Sabbath day holy and not to bear a burden and come in by the gates of Jerusalem on the Sabbath day, then I will kindle a fire in its gates, and it shall consume the palaces of Jerusalem and shall not be quenched.'",
      "links": "<a href='/AIV/24/7/20'>Jer. 7:20</a>; <a href='/AIV/25/4/11'>Lam. 4:11</a>",
      "comment": "Destruction is the result of persistent disobedience. The strong covenant warnings and the theme of judgment anticipate the final call to repentance and the ultimate restoration promised in the prophets (Rev. 21:1-4)."
    }
  ],
  "translatedAt": "2025-12-23T06:23:17.651Z"
}