{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 48,
  "verses": [
    {
      "pk": 30048001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 1,
      "text": "Concerning Moab: This is what the LORD of hosts, the God of Israel, says: 'Woe to Nebo! For it is ruined; Kiriathaim is put to shame and taken; the fortress is put to shame and shattered.'",
      "links": "<a href='/AIV/23/15/1'>Isa. 15:1</a>; <a href='/AIV/24/48/22'>Jer. 48:22</a>",
      "comment": "Moab is judged for its pride and idolatry. The mention of Nebo references Moabite high places—a subtle reminder of the importance of right worship and avoiding syncretism. This connects with the theme of reverence for God’s sanctified places (see Ex. 20:24-26)."
    },
    {
      "pk": 30048002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 2,
      "text": "There is no more praise for Moab. In Heshbon, they have plotted disaster against her, 'Come, let us cut her off from being a nation.' You too, Madmen, will be silenced; the sword will pursue you.",
      "links": "<a href='/AIV/23/15/4-5'>Isa. 15:4-5</a>",
      "comment": "Moab’s downfall was not only due to external threats, but because God allowed their enemies to rise up. God always preserves a remnant for his own purposes (see Isa. 10:20-22), a typology for his faithful people who endure judgment and correction."
    },
    {
      "pk": 30048003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 3,
      "text": "A voice cries from Horonaim, 'Devastation and great destruction!'",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "The theme of wailing recalls judgment upon sin but also the need for repentance and confession—essential aspects of returning to God. (Cf. Joel 2:12-13)."
    },
    {
      "pk": 30048004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 4,
      "text": "Moab is broken; her little ones have raised a cry.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "The suffering of 'little ones' shows how sin's consequences impact entire communities, reminding us of original sin and man’s need for spiritual renewal."
    },
    {
      "pk": 30048005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 5,
      "text": "For on the ascent of Luhith they go up weeping; for at the descent of Horonaim they have heard the cry of destruction.",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "The double mention of ascent and descent suggests a completeness of calamity and sorrow. God's justice permeates all regions, and His call to conversion is universal."
    },
    {
      "pk": 30048006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 6,
      "text": "'Flee! Save your lives, and be like a bush in the wilderness.'",
      "links": "<a href='/AIV/24/17/6'>Jer. 17:6</a>",
      "comment": "Comparing survivors to a bush in the desert alludes to spiritual dryness apart from God and the need to seek refuge in Him—the only source of true life."
    },
    {
      "pk": 30048007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 7,
      "text": "Because you trusted in your works and your treasures, you also shall be taken. Chemosh will go into exile with his priests and officials.",
      "links": "<a href='/AIV/24/48/13'>Jer. 48:13</a>; <a href='/AIV/4/21/29'>Num. 21:29</a>",
      "comment": "Moab’s idolatry led to their downfall; even their false god Chemosh could not save them. True worship, involving both laity and priesthood, is crucial in preserving a people’s identity (see Heb. 13:15)."
    },
    {
      "pk": 30048008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 8,
      "text": "The destroyer will come to every city, and no city shall escape; the valley will perish, and the plain will be destroyed, as the LORD has spoken.",
      "links": "<a href='/AIV/24/9/11'>Jer. 9:11</a>",
      "comment": "God’s judgment is total and comprehensive, much like the final judgement when all will be revealed and each person’s deeds will be tested (see 1 Cor. 3:13-15)."
    },
    {
      "pk": 30048009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 9,
      "text": "Give wings to Moab, for she would fly away; her cities will become desolate, with no one to dwell in them.",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "This poetic image points to the futility of self-reliant escape from God's sovereign plan, reminiscent of Psalm 55:6’s longing for escape from trouble."
    },
    {
      "pk": 30048010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 10,
      "text": "'Cursed is he who does the work of the LORD neglectfully; and cursed is he who withholds his sword from blood.'",
      "links": "<a href='/AIV/1/27/18-20'>Gen. 27:18-20</a>",
      "comment": "Those called to carry out God’s commands must do so wholeheartedly, paralleling Paul’s teaching that whatever we do, we do it as for the Lord (Col. 3:23)."
    },
    {
      "pk": 30048011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 11,
      "text": "Moab has been at ease from his youth and has settled on his dregs; he has not been emptied from vessel to vessel, nor has he gone into exile. Therefore his taste has remained in him, and his scent is not changed.",
      "links": "<a href='/AIV/36/1/12'>Zeph. 1:12</a>",
      "comment": "The image of wine unmoved from its dregs suggests spiritual complacency. Times of trial serve to purify faith, as seen in James 1:2–4."
    },
    {
      "pk": 30048012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 12,
      "text": "'Therefore, the days are coming,' declares the LORD, 'when I will send pourers to him, who will pour him out; they will empty his vessels and break his jars.'",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>",
      "comment": "God’s judgment purges sinful ways and brings about renewal. This motif prefigures the new wine of the Gospel (cf. Matt. 9:17)."
    },
    {
      "pk": 30048013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 13,
      "text": "Moab shall be ashamed of Chemosh, just as the house of Israel was ashamed of Bethel, their confidence.",
      "links": "<a href='/AIV/28/10/5'>Hos. 10:5</a>",
      "comment": "False worship inevitably leads to shame and downfall. This foreshadows Jesus’ insistence on worshiping God in spirit and truth (John 4:23)."
    },
    {
      "pk": 30048014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 14,
      "text": "'How can you say, We are mighty warriors, men valiant for battle?'",
      "links": "<a href='/AIV/23/10/9'>Isa. 10:9</a>",
      "comment": "Human strength and confidence are nothing before God’s purposes. True security is found in humble dependence and obedience."
    },
    {
      "pk": 30048015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 15,
      "text": "Moab is destroyed and his cities have gone up, and the choicest young men have gone down to the slaughter, declares the King, whose name is the LORD of hosts.",
      "links": "<a href='/AIV/23/10/16'>Isa. 10:16</a>",
      "comment": "God identifies himself as the King—foreshadowing later messianic claims and the divinity of Christ as King of kings (see Rev. 19:16)."
    },
    {
      "pk": 30048016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 16,
      "text": "The doom of Moab is near at hand, and his calamity hastens swiftly.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>",
      "comment": "Divine justice, though sometimes delayed, always comes with certainty (cf. 2 Pet. 3:9-10)."
    },
    {
      "pk": 30048017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 17,
      "text": "Mourn for him, all you who are around him, all who know his name; say, 'How the mighty scepter is broken, the glorious staff!'",
      "links": "<a href='/AIV/23/14/5'>Isa. 14:5</a>",
      "comment": "Symbols of authority broken points to God as the true source of all legitimate power and the legitimate shepherding of God’s people through divinely appointed leaders."
    },
    {
      "pk": 30048018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 18,
      "text": "Come down from your glory, and sit in thirst, O inhabitant of Dibon! For the destroyer of Moab has come up against you, he has destroyed your strongholds.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "The fall from pride parallels the call for humility in the Christian faith, echoing Christ’s teaching in Matt. 23:12."
    },
    {
      "pk": 30048019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 19,
      "text": "Stand by the road and watch, O inhabitant of Aroer! Ask him who flees and her who escapes; say, 'What has happened?'",
      "links": "<a href='/AIV/7/11/13'>Judg. 11:13</a>",
      "comment": "Witnessing God’s judgment is a call to reflect and repent, strengthening community awareness of God’s holiness."
    },
    {
      "pk": 30048020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 20,
      "text": "Moab is put to shame, for it is broken; wail and cry! Tell it beside the Arnon, that Moab is destroyed.",
      "links": "<a href='/AIV/4/21/13'>Num. 21:13</a>",
      "comment": "Destruction announced by the river Arnon underlines that judgment is visible for all to witness—a sign for other nations to learn from the fate of the disobedient."
    },
    {
      "pk": 30048021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 21,
      "text": "Judgment has come upon the land of the plateau, upon Holon, Jahzah, and Mephaath,",
      "links": "<a href='/AIV/6/13/18'>Josh. 13:18</a>",
      "comment": "Specific cities show that God’s judgment is thorough and detailed, underscoring His omniscience."
    },
    {
      "pk": 30048022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 22,
      "text": "and Dibon, Nebo, and Beth-diblathaim,",
      "links": "<a href='/AIV/4/33/47'>Num. 33:47</a>",
      "comment": "These cities were centers of Moabite power. Their mention shows the full reach and fairness of God’s judgment."
    },
    {
      "pk": 30048023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 23,
      "text": "and Kiriathaim, Beth-gamul, and Beth-meon,",
      "links": "<a href='/AIV/24/48/1'>Jer. 48:1</a>",
      "comment": "The repetition of cities reinforces the completeness of Moab’s fall."
    },
    {
      "pk": 30048024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 24,
      "text": "and Kerioth and Bozrah, and all the cities of the land of Moab, far and near.",
      "links": "<a href='/AIV/24/49/13'>Jer. 49:13</a>",
      "comment": "Universality of judgment is a biblical theme that points to the ultimate Day of the Lord (see Joel 2:31)."
    },
    {
      "pk": 30048025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 25,
      "text": "The horn of Moab is cut off and his arm is broken, declares the LORD.",
      "links": "<a href='/AIV/19/75/10'>Ps. 75:10</a>",
      "comment": "Symbols of authority and strength are removed by God, showing He ordains rise and fall of nations and powers, and by parallel, leaders in the Church."
    },
    {
      "pk": 30048026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 26,
      "text": "\"Make him drunk, for he magnified himself against the LORD. Moab will wallow in his vomit, and he too will be a laughingstock.",
      "links": "<a href='/AIV/23/19/14'>Isa. 19:14</a>; <a href='/AIV/24/25/27'>Jer. 25:27</a>",
      "comment": "Divine irony: Moab, self-exalted, is humbled. The image of drunkenness is a biblical symbol of spiritual blindness (see Isa. 28:7–8)."
    },
    {
      "pk": 30048027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 27,
      "text": "Was not Israel a laughingstock to you? Was he found among thieves, that whenever you spoke of him you wagged your head?",
      "links": "<a href='/AIV/19/44/14'>Ps. 44:14</a>",
      "comment": "Moab’s mockery of Israel comes back upon them, reflecting Jesus’ warning in Matt. 7:2 about how judgment returns upon the proud."
    },
    {
      "pk": 30048028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 28,
      "text": "Leave the cities, and dwell in the rock, O inhabitants of Moab! Be like a dove that nests at the mouth of a cave.",
      "links": "<a href='/AIV/19/55/6'>Ps. 55:6</a>",
      "comment": "Symbolism of the dove nest underscores the call to humility and the need to seek shelter in God, the true Rock."
    },
    {
      "pk": 30048029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 29,
      "text": "We have heard of Moab’s pride—he is exceedingly proud—of his loftiness, his pride, his arrogance, and the haughtiness of his heart.",
      "links": "<a href='/AIV/23/16/6'>Isa. 16:6</a>",
      "comment": "Pride is listed as one of the capital sins in Scripture and tradition; its remedy is humility, which Christ personified (Phil. 2:5–8)."
    },
    {
      "pk": 30048030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 30,
      "text": "'I know his wrath,' declares the LORD, 'but it is nothing; his boastings accomplish nothing.'",
      "links": "<a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Human anger and boasting are futile before God. True humility is the foundation of a right relationship with Him."
    },
    {
      "pk": 30048031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 31,
      "text": "Therefore I wail for Moab; I cry out for all Moab; for the men of Kir-heres I mourn.",
      "links": "<a href='/AIV/23/15/5'>Isa. 15:5</a>",
      "comment": "God’s prophets grieve over judgment. True shepherds have both zeal for righteousness and compassion for the lost. This mercy points to the heart of Christ (Matt. 9:36)."
    },
    {
      "pk": 30048032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 32,
      "text": "More than for Jazer I weep for you, O vine of Sibmah. Your branches passed over the sea; they reached as far as Jazer. The destroyer has fallen upon your summer fruits and your vintage.",
      "links": "<a href='/AIV/23/16/8-9'>Isa. 16:8-9</a>",
      "comment": "The vine, a repeated image for Israel (see John 15:1), shows how loss of blessing results from separation from the true source."
    },
    {
      "pk": 30048033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 33,
      "text": "Joy and gladness are taken away from the fruitful land of Moab. I have stopped the wine from the winepresses; no one treads them with shouts of joy. The shouting is not joyful shouting.",
      "links": "<a href='/AIV/23/16/10'>Isa. 16:10</a>",
      "comment": "Cutting off wine and joy is a symbol of lost spiritual celebration. By contrast, Christ’s first miracle brought abundance to the wedding at Cana (John 2:1-11) prefiguring the restoration and fullness found in union with God."
    },
    {
      "pk": 30048034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 34,
      "text": "From the cry of Heshbon even to Elealeh, as far as Jahaz, they have raised their voice—from Zoar to Horonaim, Eglath-shelishiyah—for even the waters of Nimrim have become desolate.",
      "links": "<a href='/AIV/23/15/6'>Isa. 15:6</a>",
      "comment": "Flowing water, often a metaphor for life or the Holy Spirit (cf. John 7:37-39), is dried up. Moab’s judgment brings dryness in place of fullness."
    },
    {
      "pk": 30048035,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 35,
      "text": "And I will bring an end in Moab, declares the LORD, to him who offers sacrifice in the high place and makes offerings to his god.",
      "links": "<a href='/AIV/5/12/2'>Deut. 12:2</a>",
      "comment": "The end of idolatrous sacrifice points to the necessity of right worship, prefiguring the one true Sacrifice and priesthood established in Christ."
    },
    {
      "pk": 30048036,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 36,
      "text": "Therefore my heart moans for Moab like pipes, and my heart moans like pipes for the men of Kir-heres, because the riches they gained have perished.",
      "links": "<a href='/AIV/23/16/11'>Isa. 16:11</a>",
      "comment": "A lament for earthly loss shows that ultimate treasure is spiritual and eternal (see Matt. 6:19–21)."
    },
    {
      "pk": 30048037,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 37,
      "text": "For every head is shaved and every beard cut off; all hands are gashed and the waist is covered with sackcloth.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "Mourning customs symbolize deep grief over sin and loss; sackcloth and ashes are used throughout Scripture as signs of true repentance and penance (Jonah 3:6)."
    },
    {
      "pk": 30048038,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 38,
      "text": "On all the housetops of Moab and in its squares, there is nothing but lamentation; for I have shattered Moab like a vessel in which no one delights, declares the LORD.",
      "links": "<a href='/AIV/19/31/12'>Ps. 31:12</a>",
      "comment": "The image of a broken vessel is paralleled by New Testament teaching about God as the potter who refashions us after His will (Rom. 9:21)."
    },
    {
      "pk": 30048039,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 39,
      "text": "How it is broken! How they wail! How Moab has turned his back in shame! So Moab has become a laughingstock and a terror to all those around him.",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "Sin always brings public disgrace; yet, in the new covenant, even the greatest of sinners can be restored through sincere repentance (cf. Luke 15:11–32)."
    },
    {
      "pk": 30048040,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 40,
      "text": "For thus says the LORD: 'Behold, one shall fly swiftly like an eagle and spread his wings against Moab.'",
      "links": "<a href='/AIV/5/28/49'>Deut. 28:49</a>",
      "comment": "The eagle is a symbol of swiftness and unstoppable judgment; the divine agent works in history as in prophecy and in the Church’s mission."
    },
    {
      "pk": 30048041,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 41,
      "text": "Kerioth is taken, and the strongholds are seized; and the hearts of the mighty men of Moab in that day shall be like the heart of a woman in labor.",
      "links": "<a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "Pain and helplessness in the face of God’s judgment is common biblical imagery (cf. 1 Thes. 5:3)."
    },
    {
      "pk": 30048042,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 42,
      "text": "Moab shall be destroyed from being a people, because he magnified himself against the LORD.",
      "links": "<a href='/AIV/24/13/9'>Jer. 13:9</a>",
      "comment": "Pride presents a great obstacle to grace. Christ embodies humility, and He teaches the path of self-emptying for His followers."
    },
    {
      "pk": 30048043,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 43,
      "text": "Terror and pit and snare are before you, O inhabitant of Moab! declares the LORD.",
      "links": "<a href='/AIV/23/24/17'>Isa. 24:17</a>",
      "comment": "Judgment imagery borrowed from Isaiah, implying there is no escape apart from God’s mercy."
    },
    {
      "pk": 30048044,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 44,
      "text": "He who flees from the terror shall fall into the pit, and he who climbs out of the pit shall be caught in the snare. For I will bring upon Moab the year of their punishment, declares the LORD.",
      "links": "<a href='/AIV/24/11/23'>Jer. 11:23</a>",
      "comment": "Divine retribution is inevitable apart from repentance. ‘Year’ points to a fixed period in God’s timing."
    },
    {
      "pk": 30048045,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 45,
      "text": "In the shadow of Heshbon the fugitives stand helpless; for fire goes out from Heshbon, a flame from the midst of Sihon; it has devoured the forehead of Moab, the crown of the sons of tumult.",
      "links": "<a href='/AIV/4/21/28-29'>Num. 21:28-29</a>",
      "comment": "The fire that comes from Israel’s enemies taking vengeance ironically fulfills Scripture: God sometimes uses unexpected means to achieve His will."
    },
    {
      "pk": 30048046,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 46,
      "text": "Woe to you, O Moab! The people of Chemosh are undone; for your sons have been taken captive, and your daughters into exile.",
      "links": "<a href='/AIV/24/49/3'>Jer. 49:3</a>",
      "comment": "Captivity of sons and daughters is a biblical sign of total defeat, but also prepares the way for God’s mercy and restoration in the future (see Deut. 30:3)."
    },
    {
      "pk": 30048047,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 48,
      "verse": 47,
      "text": "\"Yet I will restore the fortunes of Moab in the latter days,” declares the LORD. Thus far is the judgment on Moab.\"",
      "links": "<a href='/AIV/24/49/6'>Jer. 49:6</a>",
      "comment": "God’s promise of restoration shows that ultimate purpose is redemption, not wrath. The restoration of peoples foreshadows the universal call to salvation realized in Christ (see Acts 10:34–35), and the unity of God’s family from every nation."
    }
  ],
  "translatedAt": "2025-12-24T08:48:09.199Z"
}