{
  "book": 49,
  "bookName": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 3,
  "verses": [
    {
      "pk": 49003001,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 1,
      "text": "In the fifteenth year of Tiberius Caesar's reign—when Pontius Pilate was governor of Judea, Herod was tetrarch of Galilee, his brother Philip tetrarch of Ituraea and the region of Trachonitis, and Lysanias tetrarch of Abilene—",
      "links": "<a href='/AIV/44/4/27'>Acts 4:27</a>; <a href='/AIV/40/2/1'>Matt. 2:1</a>",
      "comment": "Luke provides precise historical context, grounding the gospel in actual events and specific rulers. This shows God's plan works through real history. Luke's attention to detail also affirms the trustworthiness and orderliness of God's revelation."
    },
    {
      "pk": 49003002,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 2,
      "text": "during the high priesthood of Annas and Caiaphas, the word of God came to John son of Zechariah in the wilderness.",
      "links": "<a href='/AIV/40/3/1'>Matt. 3:1</a>; <a href='/AIV/41/1/4'>Mark 1:4</a>",
      "comment": "Although there was only one high priest at a time, both Annas and Caiaphas are named, reflecting the unique historical situation. God chooses to speak through His prophet outside the established religious leadership, yet John’s ministry ultimately points to a greater priesthood in Christ (see Heb. 4:14)."
    },
    {
      "pk": 49003003,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 3,
      "text": "He went into all the region around the Jordan, preaching a baptism of repentance for the forgiveness of sins.",
      "links": "<a href='/AIV/44/13/24'>Acts 13:24</a>; <a href='/AIV/40/3/2'>Matt. 3:2</a>",
      "comment": "John’s baptism was a call to repentance as preparation for the Messiah. The theme of repentance and forgiveness anticipates the greater sacramental grace found later in Christ. Compare with Acts 2:38 regarding repentance and forgiveness of sins."
    },
    {
      "pk": 49003004,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 4,
      "text": "As it is written in the book of the words of Isaiah the prophet: 'A voice of one calling in the wilderness: Prepare the way for the Lord, make his paths straight.'",
      "links": "<a href='/AIV/23/40/3'>Isa. 40:3</a>; <a href='/AIV/43/1/23'>John 1:23</a>",
      "comment": "John fulfills Old Testament prophecy about preparing the way for the Lord. The original reference, Isaiah 40:3, applies to God Himself, implying the Lord who is coming is none other than God in the flesh—pointing subtly to Jesus’ divinity."
    },
    {
      "pk": 49003005,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 5,
      "text": "'Every valley will be filled, and every mountain and hill made low. The crooked will become straight, and the rough ways smooth.'",
      "links": "<a href='/AIV/23/40/4'>Isa. 40:4</a>",
      "comment": "This poetic language from Isaiah highlights the universal scope of salvation—barriers to God will be removed and all will be made ready for the Lord's coming."
    },
    {
      "pk": 49003006,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 6,
      "text": "'And all humanity will see the salvation of God.'",
      "links": "<a href='/AIV/23/40/5'>Isa. 40:5</a>; <a href='/AIV/2/14/13'>Ex. 14:13</a>",
      "comment": "The promise extends to all people—God’s salvation is universal in scope, not limited to one group. In Jesus, God’s love is revealed to the whole world."
    },
    {
      "pk": 49003007,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 7,
      "text": "So John said to the crowds coming out to be baptized by him, 'You brood of vipers! Who warned you to flee from the coming wrath?'",
      "links": "<a href='/AIV/40/3/7'>Matt. 3:7</a>",
      "comment": "John’s strong language confronts hypocritical repentance. True repentance leads to inner transformation, not just external acts."
    },
    {
      "pk": 49003008,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 8,
      "text": "Produce fruits that show your repentance. And do not begin to say to yourselves, 'We have Abraham as our father.' For I tell you that God can raise up children for Abraham from these stones.",
      "links": "<a href='/AIV/40/3/9'>Matt. 3:9</a>; <a href='/AIV/43/8/39'>John 8:39</a>",
      "comment": "Heritage or tradition isn't enough for salvation—God desires living faith expressed in transformed lives. Being the people of God is about faith and obedience, not only physical ancestry."
    },
    {
      "pk": 49003009,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 9,
      "text": "Even now the axe is laid at the root of the trees, so every tree that does not produce good fruit is cut down and thrown into the fire.",
      "links": "<a href='/AIV/40/3/10'>Matt. 3:10</a>; <a href='/AIV/43/15/6'>John 15:6</a>",
      "comment": "There is urgency to genuine repentance—the time for judgment is near. Bearing fruit is necessary, or else there are consequences. This speaks to the importance of perseverance and good works as evidence of faith."
    },
    {
      "pk": 49003010,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 10,
      "text": "So the crowds asked him, 'What then should we do?'",
      "links": "<a href='/AIV/44/2/37'>Acts 2:37</a>",
      "comment": "The crowds’ response reveals their openness to God’s call. Repentance involves practical action."
    },
    {
      "pk": 49003011,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 11,
      "text": "He answered, 'Whoever has two coats should share with someone who has none, and whoever has food should do the same.'",
      "links": "<a href='/AIV/24/22/16'>Jer. 22:16</a>; <a href='/AIV/40/25/35'>Matt. 25:35-36</a>",
      "comment": "Authentic repentance produces charitable deeds and generosity. Christian faith is lived out through concrete acts of love."
    },
    {
      "pk": 49003012,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 12,
      "text": "Even tax collectors came to be baptized. They said to him, 'Teacher, what should we do?'",
      "links": "<a href='/AIV/40/21/31'>Matt. 21:31-32</a>",
      "comment": "Tax collectors were seen as sinners, yet they too are called to repentance and share in God's mercy."
    },
    {
      "pk": 49003013,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 13,
      "text": "He told them, 'Collect no more than what you have been ordered to.'",
      "links": "<a href='/AIV/19/112/5'>Ps. 112:5</a>",
      "comment": "Repentance is shown by honesty and integrity, especially in one's vocation."
    },
    {
      "pk": 49003014,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 14,
      "text": "Some soldiers also asked him, 'What about us? What should we do?' He said to them, 'Do not take money by force or falsely accuse anyone, and be satisfied with your wages.'",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>",
      "comment": "John does not tell soldiers to leave their profession, but to live righteously within it. God’s call extends to all walks of life."
    },
    {
      "pk": 49003015,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 15,
      "text": "The people were waiting expectantly and were all wondering in their hearts if John might be the Christ.",
      "links": "<a href='/AIV/43/1/19-20'>John 1:19-20</a>",
      "comment": "There was a sense of anticipation about the Messiah’s coming. John is careful to point people not to himself, but to the One who is greater."
    },
    {
      "pk": 49003016,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 16,
      "text": "John answered them all, 'I baptize you with water, but he who is mightier than I is coming, the strap of whose sandals I am not worthy to untie. He will baptize you with the Holy Spirit and fire.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/44/2/3'>Acts 2:3</a>",
      "comment": "John distinguishes his preparatory ministry from the Messiah’s. Jesus' baptism with the Holy Spirit and fire points to both empowerment and purification—anticipating the coming of the Spirit at Pentecost (Acts 2)."
    },
    {
      "pk": 49003017,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 17,
      "text": "His winnowing fork is in his hand to clear his threshing floor and to gather the wheat into his barn, but the chaff he will burn with unquenchable fire.",
      "links": "<a href='/AIV/13/16/33'>1 Chr. 16:33</a>; <a href='/AIV/40/13/30'>Matt. 13:30</a>",
      "comment": "This speaks of the coming judgment and separation of the righteous from the wicked. The fire is a symbol both of the Spirit (for the repentant) and of judgment (for the unrepentant)."
    },
    {
      "pk": 49003018,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 18,
      "text": "So with many other exhortations, he proclaimed good news to the people.",
      "links": "<a href='/AIV/44/13/24'>Acts 13:24</a>",
      "comment": "John’s ministry is described as 'good news'—preparing people for the coming of Jesus, who brings fulfillment."
    },
    {
      "pk": 49003019,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 19,
      "text": "But when John rebuked Herod the tetrarch because of Herodias, his brother's wife, and for all the evil things Herod had done,",
      "links": "<a href='/AIV/40/14/3-4'>Matt. 14:3-4</a>",
      "comment": "John boldly confronted sin in high places, regardless of the risk. Prophetic ministry often calls the powerful to repentance."
    },
    {
      "pk": 49003020,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 20,
      "text": "Herod added this to everything else: he locked John up in prison.",
      "links": "<a href='/AIV/41/6/17'>Mark 6:17</a>",
      "comment": "Often, faithfulness to God’s message brings suffering, but this suffering has meaning in the context of God's redemptive plan. John points to Jesus, who also will be rejected by authorities."
    },
    {
      "pk": 49003021,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 21,
      "text": "When all the people were being baptized, Jesus also was baptized. And as he was praying, the heavens were opened,",
      "links": "<a href='/AIV/40/3/13'>Matt. 3:13-16</a>; <a href='/AIV/41/1/9'>Mark 1:9-10</a>",
      "comment": "Jesus is baptized, though he is sinless (see Heb. 4:15), fulfilling all righteousness and identifying fully with humanity. His prayer and humility serve as a model for believers."
    },
    {
      "pk": 49003022,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 22,
      "text": "and the Holy Spirit descended in bodily form like a dove upon him, and a voice came from heaven, 'You are my beloved Son; with you I am well pleased.'",
      "links": "<a href='/AIV/19/2/7'>Ps. 2:7</a>; <a href='/AIV/23/42/1'>Isa. 42:1</a>",
      "comment": "All three Persons of the Trinity are revealed here—the Father speaks, the Son is baptized, and the Spirit descends. The Father's words recall Psalm 2:7, a royal Messianic psalm, pointing to Jesus’ divinity and mission."
    },
    {
      "pk": 49003023,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 23,
      "text": "Jesus, when he began his ministry, was about thirty years old, being the son (as was supposed) of Joseph, son of Heli,",
      "links": "<a href='/AIV/40/1/16'>Matt. 1:16</a>; <a href='/AIV/4/8/24'>Num. 4:3</a>",
      "comment": "Luke gives Jesus’ age and genealogy, anchoring his ministry in history and fulfilling Old Testament expectations about priestly initiation (see Num. 4:3 for age). The phrase 'as was supposed' hints at Jesus’ divine origin."
    },
    {
      "pk": 49003024,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 24,
      "text": "the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph,",
      "links": "",
      "comment": "Luke’s genealogy traces Jesus’ human ancestry through several generations, showing the fullness of time and God’s providential plan."
    },
    {
      "pk": 49003025,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 25,
      "text": "the son of Mattathias, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai,",
      "links": "",
      "comment": "Each name recalls Israel's heritage and reveals Jesus’ true and full humanity."
    },
    {
      "pk": 49003026,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 26,
      "text": "the son of Maath, the son of Mattathias, the son of Semein, the son of Eliezer, the son of Josech,",
      "links": "",
      "comment": "The inclusion of each generation builds continuity, demonstrating Jesus’ inheritance from David, Abraham, and Adam."
    },
    {
      "pk": 49003027,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 27,
      "text": "the son of Jorim, the son of Matthat, the son of Levi,",
      "links": "",
      "comment": "This genealogy is structured to highlight key figures and reinforce Jesus’ rightful succession as the Messiah."
    },
    {
      "pk": 49003028,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 28,
      "text": "the son of Simeon, the son of Eliezer, the son of Josech, the son of Jorim, the son of Matthat,",
      "links": "",
      "comment": "Continued emphasis on ancestry reflects deep roots in Jewish history."
    },
    {
      "pk": 49003029,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 29,
      "text": "the son of Levi, the son of Symeon, the son of Simeon, the son of Josech, the son of Jonan,",
      "links": "",
      "comment": "The genealogy intentionally recalls important leaders and patriarchs."
    },
    {
      "pk": 49003030,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 30,
      "text": "the son of Melchi, the son of Addi, the son of Cosam, the son of Elmadam, the son of Er,",
      "links": "",
      "comment": "Even lesser-known ancestors are named, reflecting the fullness of God’s family and His inclusive plan."
    },
    {
      "pk": 49003031,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 31,
      "text": "the son of Eliezer, the son of Joshua, the son of Eliezer, the son of Jorim, the son of Matthat,",
      "links": "",
      "comment": "Names like Joshua recall God's saving acts in history. Luke meticulously preserves the line."
    },
    {
      "pk": 49003032,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 32,
      "text": "the son of Melea, the son of Menna, the son of Mattatha, the son of Nathan, the son of David,",
      "links": "<a href='/AIV/10/5/14'>2 Sam. 5:14</a>; <a href='/AIV/19/89/3-4'>Ps. 89:3-4</a>",
      "comment": "Luke’s genealogy links Jesus to David through Nathan (not Solomon as in Matthew), emphasizing a broad fulfillment of God's promise to David (see 2 Samuel 7:12-16)."
    },
    {
      "pk": 49003033,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 33,
      "text": "the son of Jesse, the son of Obed, the son of Boaz, the son of Sala, the son of Nahshon,",
      "links": "<a href='/AIV/8/4/21-22'>Ruth 4:21-22</a>",
      "comment": "References to Jesse, Obed, and Boaz emphasize fulfillment of Messianic prophecies, including those in Ruth. These names highlight God's use of faithful individuals regardless of their origins."
    },
    {
      "pk": 49003034,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 34,
      "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,",
      "links": "<a href='/AIV/1/46/12'>Gen. 46:12</a>",
      "comment": "Judah’s mention underscores Jesus as the Lion of Judah, a reference to Genesis 49:10—the scepter of kingship."
    },
    {
      "pk": 49003035,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 35,
      "text": "the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,",
      "links": "<a href='/AIV/1/11/26'>Gen. 11:26</a>; <a href='/AIV/1/21/3'>Gen. 21:3</a>",
      "comment": "Tracing Jesus’ line to Abraham fulfills God’s promise that all nations would be blessed through his seed (Genesis 12:3)."
    },
    {
      "pk": 49003036,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 36,
      "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah,",
      "links": "<a href='/AIV/1/11/18'>Gen. 11:18</a>",
      "comment": "The genealogy passes through the post-flood patriarchs, emphasizing God’s faithful continuity through generations."
    },
    {
      "pk": 49003037,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 37,
      "text": "the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,",
      "links": "<a href='/AIV/1/5/29-32'>Gen. 5:29-32</a>",
      "comment": "Moving from Shem, Noah, and beyond, Luke’s genealogy subtly signifies Jesus as the new beginning for all humanity."
    },
    {
      "pk": 49003038,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 3,
      "verse": 38,
      "text": "the son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalalel, the son of Cainan, the son of Enosh, the son of Seth, the son of Adam, the son of God.",
      "links": "<a href='/AIV/1/5/3-24'>Gen. 5:3-24</a>; <a href='/AIV/45/5/12-21'>Rom. 5:12-21</a>",
      "comment": "Luke ends the genealogy with Adam, 'the son of God.' This emphasizes Jesus’ universal mission—He is not only Israel’s Messiah but the Savior of all humanity. As the new Adam, Jesus inaugurates a new creation and undoes the effects of the fall (see Rom. 5:12-21; 1 Cor. 15:22)."
    }
  ],
  "translatedAt": "2025-12-24T10:38:27.543Z"
}