{
  "book": 49,
  "bookName": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 13,
  "verses": [
    {
      "pk": 49013001,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 1,
      "text": "At that same time, some were present who reported to Jesus about the Galileans whose blood Pilate had mixed with their sacrifices.",
      "links": "<a href='/AIV/42/23/1'>Luke 23:1</a>;<a href='/AIV/44/5/37'>Acts 5:37</a>",
      "comment": "Pilate’s reputation for brutality is highlighted here, showing the political and religious tensions in Jerusalem. The suffering of the Galileans is used as a teaching moment by Jesus."
    },
    {
      "pk": 49013002,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 2,
      "text": "And Jesus answered them, 'Do you think that those Galileans were worse sinners than all the other Galileans because they suffered these things?'",
      "links": "<a href='/AIV/18/4/7'>Job 4:7</a>",
      "comment": "Jesus rejects the idea that suffering in this life means someone is a worse sinner—a common view in antiquity."
    },
    {
      "pk": 49013003,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 3,
      "text": "'No, I tell you; but unless you repent, you will all likewise perish.'",
      "links": "<a href='/AIV/40/4/17'>Matt. 4:17</a>;<a href='/AIV/42/15/7'>Luke 15:7</a>",
      "comment": "Repentance is emphasized as necessary for all, not just those experiencing tragedy. True repentance involves an interior transformation, both spiritual and practical."
    },
    {
      "pk": 49013004,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 4,
      "text": "'Or those eighteen on whom the tower in Siloam fell and killed them, do you think they were worse offenders than all the people living in Jerusalem?'",
      "links": "<a href='/AIV/16/3/15'>Neh. 3:15</a>;<a href='/AIV/43/9/7'>John 9:7</a>",
      "comment": "Here Jesus uses another local tragedy to continue teaching that calamity does not necessarily reflect personal guilt. He stresses universal need for repentance."
    },
    {
      "pk": 49013005,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 5,
      "text": "'No, I tell you; but unless you repent, you will all likewise perish.'",
      "links": "<a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "Jesus repeats his urgent call for repentance. Both the literal and spiritual consequences of unrepented sin are in view."
    },
    {
      "pk": 49013006,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 6,
      "text": "And he told this parable: 'A man had a fig tree planted in his vineyard, and he came looking for fruit on it and found none.'",
      "links": "<a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>;<a href='/AIV/40/21/19'>Matt. 21:19</a>",
      "comment": "The fig tree often symbolizes Israel. Fruitfulness in Scripture is a frequent metaphor for faithful obedience and good works."
    },
    {
      "pk": 49013007,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 7,
      "text": "'So he said to the vinedresser, ‘Look, for three years I have come seeking fruit on this fig tree and find none. Cut it down. Why should it even use up the soil?’'",
      "links": "<a href='/AIV/23/1/8'>Isa. 1:8</a>",
      "comment": "Three years likely reflects the patience of God, and the call for accountability. There is an implied authority structure and the need of stewardship."
    },
    {
      "pk": 49013008,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 8,
      "text": "'But he answered him, ‘Master, leave it alone this year also, until I dig around it and put on manure.'",
      "links": "<a href='/AIV/23/55/6-7'>Isa. 55:6-7</a>",
      "comment": "The vinedresser intercedes, seeking mercy and more time. This hints at the mediatory role in salvation, showing patience before final judgment."
    },
    {
      "pk": 49013009,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 9,
      "text": "'If it bears fruit next year, fine; but if not, then you can cut it down.'",
      "links": "<a href='/AIV/40/7/19'>Matt. 7:19</a>",
      "comment": "The possibility of future judgment emphasizes that divine justice is patient but real. Intercession can delay judgment, pointing toward the importance of the ministry of reconciliation."
    },
    {
      "pk": 49013010,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 10,
      "text": "Now he was teaching in one of the synagogues on the Sabbath.",
      "links": "<a href='/AIV/40/12/9'>Matt. 12:9</a>",
      "comment": "Jesus respects Jewish worship practices, showing he is the promised Messiah acting within the context of Old Covenant worship."
    },
    {
      "pk": 49013011,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 11,
      "text": "And look, a woman was there who had a disabling spirit for eighteen years; she was bent over and could not fully straighten herself.",
      "links": "<a href='/AIV/42/8/2'>Luke 8:2</a>",
      "comment": "Physical and spiritual suffering are understood together in the Gospels; the healing work of Jesus restores both body and spirit."
    },
    {
      "pk": 49013012,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 12,
      "text": "When Jesus saw her, he called her over and said to her, 'Woman, you are freed from your sickness.'",
      "links": "<a href='/AIV/19/146/8'>Ps. 146:8</a>; <a href='/AIV/42/6/19'>Luke 6:19</a>",
      "comment": "Jesus’ authority to heal and forgive points to his divine nature. He speaks with authority only God has."
    },
    {
      "pk": 49013013,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 13,
      "text": "And he laid his hands on her, and immediately she was made straight, and she glorified God.",
      "links": "<a href='/AIV/44/9/17'>Acts 9:17</a>; <a href='/AIV/40/15/31'>Matt. 15:31</a>",
      "comment": "The laying on of hands is a gesture of power and blessing, continued as a sign of healing and commissioning in the Church."
    },
    {
      "pk": 49013014,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 14,
      "text": "But the synagogue ruler, indignant because Jesus healed on the Sabbath, said to the crowd, 'There are six days on which work ought to be done; come on those days and be healed, and not on the Sabbath day.'",
      "links": "<a href='/AIV/2/20/9-10'>Ex. 20:9-10</a>",
      "comment": "Legalistic interpretations of the Sabbath are contrasted with Jesus’ authority and mercy. Jesus fulfills the law and shows the Sabbath is made for people, not to bind them."
    },
    {
      "pk": 49013015,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 15,
      "text": "Then the Lord answered him, 'You hypocrites! Does not each of you on the Sabbath untie his ox or his donkey from the manger and lead it away to water it?'",
      "links": "<a href='/AIV/5/5/14'>Deut. 5:14</a>;<a href='/AIV/24/17/21-22'>Jer. 17:21–22</a>",
      "comment": "Jesus’ rebuke aligns mercy with the true intent of the law, showing both compassion and divine authority over the Sabbath."
    },
    {
      "pk": 49013016,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 16,
      "text": "'And ought not this woman, a daughter of Abraham whom Satan bound for eighteen years, be released from this bondage on the Sabbath day?'",
      "links": "<a href='/AIV/40/12/12'>Matt. 12:12</a>; <a href='/AIV/10/16/11'>1 Sam. 16:11</a>",
      "comment": "Jesus identifies her as a true child of Abraham—a term signifying inheritance and faith. The Sabbath is set apart for liberation, not for restriction."
    },
    {
      "pk": 49013017,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 17,
      "text": "As he said these things, all his opponents were put to shame, and all the people rejoiced at all the glorious things he was doing.",
      "links": "<a href='/AIV/19/72/18-19'>Ps. 72:18-19</a>",
      "comment": "Jesus’ teachings evoke both hostility and praise, foreshadowing the divided response to his identity and mission."
    },
    {
      "pk": 49013018,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 18,
      "text": "So he said, 'To what is the kingdom of God like? And to what shall I compare it?'",
      "links": "<a href='/AIV/40/13/31'>Matt. 13:31</a>",
      "comment": "Jesus often uses parables to reveal the mysterious but present nature of God’s kingdom, already at work even if not fully visible."
    },
    {
      "pk": 49013019,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 19,
      "text": "'It is like a grain of mustard seed that a man took and sowed in his garden. It grew and became a tree, and the birds of the air made nests in its branches.'",
      "links": "<a href='/AIV/26/17/23'>Ezek. 17:23</a>; <a href='/AIV/27/4/12'>Dan. 4:12</a>",
      "comment": "The mustard seed shows the kingdom's humble beginnings and extraordinary growth, hinting at the unity of diverse peoples and nations in one faith."
    },
    {
      "pk": 49013020,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 20,
      "text": "And again he said, 'To what shall I compare the kingdom of God?'",
      "links": "<a href='/AIV/40/13/33'>Matt. 13:33</a>",
      "comment": "Repetition underlines the importance of grasping the mysterious and transformative power of the kingdom."
    },
    {
      "pk": 49013021,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 21,
      "text": "'It is like leaven that a woman took and hid in three measures of flour, until it was all leavened.'",
      "links": "<a href='/AIV/2/16/33'>Ex. 16:33</a>",
      "comment": "The leaven symbolizes the transformation of the whole by a small part, reflective not just of the kingdom’s spread but also the sanctifying effect in the lives of believers."
    },
    {
      "pk": 49013022,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 22,
      "text": "He went on his way through towns and villages, teaching and journeying toward Jerusalem.",
      "links": "<a href='/AIV/42/9/51'>Luke 9:51</a>",
      "comment": "Luke often highlights Jesus' journey to Jerusalem, foreshadowing his approaching passion, sacrifice, and fulfillment of prophecy."
    },
    {
      "pk": 49013023,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 23,
      "text": "And someone said to him, 'Lord, will those who are saved be few?' And he said to them,",
      "links": "<a href='/AIV/40/7/13-14'>Matt. 7:13–14</a>",
      "comment": "The question reflects concern over eschatological salvation. Jesus shifts focus from curiosity to urgency and personal response."
    },
    {
      "pk": 49013024,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 24,
      "text": "'Strive to enter through the narrow door. For many, I tell you, will seek to enter and will not be able.'",
      "links": "<a href='/AIV/19/118/20'>Ps. 118:20</a>",
      "comment": "This points to the necessity of a disciplined, persevering faith—a call to reject spiritual complacency. Salvation is a real gift—but requires striving and grace together."
    },
    {
      "pk": 49013025,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 25,
      "text": "'When once the master of the house has risen and shut the door, and you begin to stand outside and knock at the door, saying, ‘Lord, open to us,’ then he will answer you, ‘I do not know where you come from.’'",
      "links": "<a href='/AIV/40/25/11-12'>Matt. 25:11-12</a>",
      "comment": "There is a definitive future point when the opportunity for repentance closes, echoing later imagery of Heaven’s gates."
    },
    {
      "pk": 49013026,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 26,
      "text": "'Then you will begin to say, ‘We ate and drank in your presence, and you taught in our streets.’'",
      "links": "<a href='/AIV/40/7/22-23'>Matt. 7:22-23</a>",
      "comment": "Mere external association with Jesus is not enough. There is a call for a living, obedient faith, not simply familiarity."
    },
    {
      "pk": 49013027,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 27,
      "text": "'But he will say, ‘I tell you, I do not know where you come from. Depart from me, all you workers of evil!’'",
      "links": "<a href='/AIV/19/6/8'>Ps. 6:8</a>; <a href='/AIV/40/25/41'>Matt. 25:41</a>",
      "comment": "Having a true relationship with Christ involves moral and actual transformation. This strong warning supports the need for a living, holy obedience, not nominal faith."
    },
    {
      "pk": 49013028,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 28,
      "text": "'In that place there will be weeping and gnashing of teeth, when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God but you yourselves cast out.'",
      "links": "<a href='/AIV/40/8/12'>Matt. 8:12</a>; <a href='/AIV/13/29/18'>1 Chron. 29:18</a>",
      "comment": "There is a clear distinction between the saved and the lost in Jesus’ teaching, underlining the seriousness of the call to conversion and separation from sin."
    },
    {
      "pk": 49013029,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 29,
      "text": "'They will come from east and west, and from north and south, and will recline at table in the kingdom of God.'",
      "links": "<a href='/AIV/23/25/6'>Isa. 25:6</a>; <a href='/AIV/42/22/30'>Luke 22:30</a>",
      "comment": "Universal invitation—people from all nations share in the Messianic banquet. God’s family transcends ethnicity, embracing all who are united to Christ."
    },
    {
      "pk": 49013030,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 30,
      "text": "'And look, there are some who are last who will be first, and some who are first who will be last.'",
      "links": "<a href='/AIV/40/19/30'>Matt. 19:30</a>;<a href='/AIV/41/10/31'>Mark 10:31</a>",
      "comment": "God’s kingdom reverses worldly expectations. Humility and perseverance, not status, are rewarded by God."
    },
    {
      "pk": 49013031,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 31,
      "text": "That very hour, some Pharisees came and said to him, 'Leave here, for Herod wants to kill you.'",
      "links": "<a href='/AIV/41/6/14'>Mark 6:14</a>",
      "comment": "This shows opposition from political and religious leaders. Herod Antipas’ threat foreshadows the coming passion of Christ."
    },
    {
      "pk": 49013032,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 32,
      "text": "And he said to them, 'Go and tell that fox, “Look, I cast out demons and perform healings today and tomorrow, and on the third day I finish my work.”'",
      "links": "<a href='/AIV/28/5/13'>Hos. 5:13</a>;<a href='/AIV/42/9/22'>Luke 9:22</a>",
      "comment": "“Fox” implies cunning and corruption. Jesus' mission is determined by divine, not human, authority. The reference to the 'third day' foreshadows resurrection, subtly claiming divine authority over life and death."
    },
    {
      "pk": 49013033,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 33,
      "text": "'Nevertheless, I must journey today and tomorrow and the next day, for it cannot be that a prophet should perish outside Jerusalem.'",
      "links": "<a href='/AIV/16/9/26'>Neh. 9:26</a>; <a href='/AIV/42/24/19'>Luke 24:19</a>",
      "comment": "Jerusalem, the city of the prophets, is also the city where God’s Messiah must suffer. Here, Jesus signals his acceptance of the prophetic mission as fulfillment of Old Testament prophecy."
    },
    {
      "pk": 49013034,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 34,
      "text": "'O Jerusalem, Jerusalem, you who kill the prophets and stone those sent to you! How often I have desired to gather your children together, as a hen gathers her brood under her wings—but you were not willing!'",
      "links": "<a href='/AIV/19/91/4'>Ps. 91:4</a>, <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "Jesus here expresses divine longing for his people’s repentance and unity, echoing God’s protective love in the Old Testament and alluding to his own identity as the true shepherd."
    },
    {
      "pk": 49013035,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 13,
      "verse": 35,
      "text": "'Look, your house is left to you desolate. And I tell you, you will not see me until you say, “Blessed is he who comes in the name of the Lord!”'",
      "links": "<a href='/AIV/19/118/26'>Ps. 118:26</a>; <a href='/AIV/42/19/38'>Luke 19:38</a>",
      "comment": "Desolation means judgment and the loss of true worship. The final phrase is a quotation from a Psalm sung at Passover, signaling Jesus as Messiah. True blessing comes from recognizing Jesus’ divine mission and the fulfillment of Scripture. There is an anticipation of liturgical worship and a future gathering for those who accept him as Lord."
    }
  ],
  "translatedAt": "2025-12-24T10:51:17.237Z"
}