{
  "book": 49,
  "bookName": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 23,
  "verses": [
    {
      "pk": 49023001,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 1,
      "text": "Then the entire assembly rose up and brought Jesus before Pilate.",
      "links": "<a href='/AIV/40/27/2'>Matt 27:2</a>; <a href='/AIV/41/15/1'>Mark 15:1</a>; <a href='/AIV/43/18/28'>John 18:28</a>",
      "comment": "The religious leaders take Jesus to Pilate, the Roman governor, as only he had authority for capital punishment. This fulfills Jesus' prophecy of being handed over to Gentiles (<a href='/AIV/42/18/32'>Luke 18:32</a>), prefiguring the universality of His redemptive work."
    },
    {
      "pk": 49023002,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 2,
      "text": "They began to accuse him, saying, 'We found this man misleading our nation, forbidding us to pay taxes to Caesar, and declaring himself to be Christ, a king.'",
      "links": "<a href='/AIV/42/20/22'>Luke 20:22</a>; <a href='/AIV/41/12/17'>Mark 12:17</a>",
      "comment": "Notice their claims are distortions: Jesus neither forbade paying taxes (<a href='/AIV/42/20/25'>Luke 20:25</a>), nor did He seek political kingship. Here, 'Christ' means Messiah, yet the Roman authorities understood it as a rival political king, which heightens the drama of Jesus' true kingship—a spiritual kingdom."
    },
    {
      "pk": 49023003,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 3,
      "text": "Pilate asked him, 'Are you the king of the Jews?' He replied, 'You say so.'",
      "links": "<a href='/AIV/40/27/11'>Matt 27:11</a>; <a href='/AIV/41/15/2'>Mark 15:2</a>; <a href='/AIV/43/18/33-37'>John 18:33-37</a>",
      "comment": "Jesus’ response indicates He is King, but not in the worldly sense Pilate imagines. His kingdom is not of this world (<a href='/AIV/43/18/36'>John 18:36</a>), underlining His divine mission."
    },
    {
      "pk": 49023004,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 4,
      "text": "Pilate said to the chief priests and the crowd, 'I find no guilt in this man.'",
      "links": "<a href='/AIV/43/18/38'>John 18:38</a>; <a href='/AIV/41/15/14'>Mark 15:14</a>",
      "comment": "Pilate publicly declares Jesus innocent, increasing the injustice of His condemnation, and highlighting His role as the suffering servant (see <a href='/AIV/23/53/9'>Isa 53:9</a>)."
    },
    {
      "pk": 49023005,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 5,
      "text": "But they kept insisting, 'He stirs up the people! He teaches throughout all Judea, starting from Galilee even to this place.'",
      "links": "<a href='/AIV/40/4/23'>Matt 4:23</a>",
      "comment": "The reference to Galilee serves as a turning point, giving Pilate an opportunity to shift responsibility, also showing how Jesus’ ministry covered all Israel, fulfilling messianic expectations (see <a href='/AIV/23/9/1-2'>Isa 9:1-2</a>)."
    },
    {
      "pk": 49023006,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 6,
      "text": "When Pilate heard this, he asked if the man was a Galilean.",
      "links": "<a href='/AIV/42/3/1'>Luke 3:1</a>",
      "comment": "Pilate's political calculation seeks to avoid responsibility, demonstrating human authorities acting according to self-interest. Galilee was under Herod’s jurisdiction, offering Pilate a way to decline judgment."
    },
    {
      "pk": 49023007,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 7,
      "text": "When he learned that Jesus was under Herod’s authority, he sent him to Herod, who was also in Jerusalem at that time.",
      "links": "<a href='/AIV/42/13/31'>Luke 13:31</a>",
      "comment": "Jesus stands trial before both Gentile and Jewish rulers, fulfilling the pattern in the Psalms of God’s Anointed opposed by kings (see <a href='/AIV/19/2/2'>Psalm 2:2</a>)."
    },
    {
      "pk": 49023008,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 8,
      "text": "When Herod saw Jesus, he was very glad; he had been hoping to see him for a long time because he had heard about him and wanted to see a sign performed by him.",
      "links": "<a href='/AIV/42/9/9'>Luke 9:9</a>",
      "comment": "Herod’s interest is shallow and superstitious, focused on signs rather than truth. Jesus came for those with real faith, showing signs for faith’s sake not curiosity (<a href='/AIV/40/12/39'>Matt 12:39</a>)."
    },
    {
      "pk": 49023009,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 9,
      "text": "So he questioned him at great length, but Jesus gave him no answer.",
      "links": "<a href='/AIV/23/53/7'>Isa 53:7</a>",
      "comment": "Jesus’ silence fulfills Isaiah’s prophecy of the suffering servant: 'He was oppressed, and he was afflicted, yet he did not open his mouth.' This is a model for humility and suffering for believers."
    },
    {
      "pk": 49023010,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 10,
      "text": "The chief priests and the scribes stood by, vehemently accusing him.",
      "links": "<a href='/AIV/19/27/12'>Ps 27:12</a>",
      "comment": "Religious authorities repeatedly accuse Jesus, fulfilling the Psalmist's prayer—false witnesses rise up against the righteous."
    },
    {
      "pk": 49023011,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 11,
      "text": "Then Herod, together with his soldiers, treated him with contempt and mocked him. Dressing him in a splendid robe, they sent him back to Pilate.",
      "links": "<a href='/AIV/19/22/7-8'>Ps 22:7-8</a>; <a href='/AIV/42/18/32'>Luke 18:32</a>",
      "comment": "Mockery fulfills messianic prophecy from the Psalms (cf. <a href='/AIV/19/22/7'>Ps 22:7</a>), and Jesus embraces humiliation, indicating His true kingship manifests through suffering for others."
    },
    {
      "pk": 49023012,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 12,
      "text": "That very day Herod and Pilate became friends with each other; previously, they had been at enmity.",
      "links": "",
      "comment": "Jesus, even in trial, is a point of unity for enemies; their friendship is superficial, based on self-interest. This subtly foreshadows how Christ is to unite humanity, but only rightly when founded in Him."
    },
    {
      "pk": 49023013,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 13,
      "text": "Pilate called together the chief priests, the rulers, and the people,",
      "links": "",
      "comment": "Pilate includes not just leaders but the assembled people, signifying how the whole nation participates in Jesus’ rejection."
    },
    {
      "pk": 49023014,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 14,
      "text": "and said to them, 'You have brought this man to me as one who was perverting the people. But look, after examining him before you, I have found no guilt in this man regarding your charges against him.'",
      "links": "<a href='/AIV/42/23/4'>Luke 23:4</a>",
      "comment": "Pilate’s innocence verdict is repeated for emphasis, highlighting the wrongful condemnation of the truly innocent."
    },
    {
      "pk": 49023015,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 15,
      "text": "Neither has Herod, for he sent him back to us. Look, nothing deserving death has been done by him.",
      "links": "",
      "comment": "Pilate and Herod, as Gentile authorities, find Jesus guiltless. This is an ironic testament that even foreigners did not recognize a fault in Jesus, contrasting with Israel’s religious elite."
    },
    {
      "pk": 49023016,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 16,
      "text": "Therefore, I will punish him and release him.'",
      "links": "<a href='/AIV/42/23/22'>Luke 23:22</a>",
      "comment": "Pilate attempts a compromise of justice and appeasement. 'Punish' likely means scourging. Even with innocence, Jesus suffers; this points toward the redemptive value of suffering for others."
    },
    {
      "pk": 49023017,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 17,
      "text": "[Now he was required to release one prisoner to them at the festival.]",
      "links": "<a href='/AIV/40/27/15'>Matt 27:15</a>",
      "comment": "This narrative detail about the custom is omitted in some manuscripts but is clear elsewhere. The custom prefigures Christ as the true Passover Lamb, who is sacrificed while a guilty one goes free."
    },
    {
      "pk": 49023018,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 18,
      "text": "But the whole crowd shouted together, 'Away with this man! Release Barabbas to us!'",
      "links": "<a href='/AIV/40/27/21'>Matt 27:21</a>",
      "comment": "Barabbas (meaning 'son of the father') is a violent criminal. The crowd chooses a false son over the true Son, a profound inversion with spiritual symbolism, highlighting humanity's preference for rebellion over divine mercy."
    },
    {
      "pk": 49023019,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 19,
      "text": "(Barabbas had been put in prison for insurrection in the city and for murder.)",
      "links": "",
      "comment": "Luke clarifies Barabbas committed the very crime falsely ascribed to Jesus. Barabbas is guilty of political rebellion, reinforcing the substitutionary nature of what follows."
    },
    {
      "pk": 49023020,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 20,
      "text": "Pilate, wanting to release Jesus, addressed them again.",
      "links": "<a href='/AIV/41/15/9'>Mark 15:9</a>",
      "comment": "Pilate repeatedly attempts to free Jesus, again testifying to His innocence, but is overruled by popular demand. Democracy here demonstrates its fallibility; truth and justice transcend majority opinion."
    },
    {
      "pk": 49023021,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 21,
      "text": "But they kept shouting, 'Crucify! Crucify him!'",
      "links": "<a href='/AIV/42/23/23'>Luke 23:23</a>",
      "comment": "'Crucify' was a distinctly Roman method of execution, reserved for the worst criminals and slaves. The crowd’s persistence fulfills prophetic lament over the suffering righteous one (<a href='/AIV/19/22/16'>Psalm 22:16</a>)."
    },
    {
      "pk": 49023022,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 22,
      "text": "A third time he said to them, 'Why? What evil has he done? I have found no reason for the death penalty in him. Therefore, I will punish him and release him.'",
      "links": "",
      "comment": "Pilate’s third declaration of innocence underlines Jesus’ total righteousness. The theme of the just suffering for the unjust is at the heart of Christian redemption (<a href='/AIV/60/3/18'>1 Pet 3:18</a>)."
    },
    {
      "pk": 49023023,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 23,
      "text": "But they were insistent, demanding with loud voices that he be crucified. And their voices prevailed.",
      "links": "",
      "comment": "The victory of the crowd’s voice over justice depicts the fallen state of humanity, which so often rejects true righteousness. The submission of Jesus to this will is part of His redemptive offering."
    },
    {
      "pk": 49023024,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 24,
      "text": "So Pilate decided that their demand should be granted.",
      "links": "",
      "comment": "Pilate’s weakness contrasts with Jesus’ courage. Jesus’ sacrifice is freely chosen and permitted by God's providential plan."
    },
    {
      "pk": 49023025,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 25,
      "text": "He released the man who had been thrown into prison for insurrection and murder, the one they asked for; but he handed Jesus over to their will.",
      "links": "",
      "comment": "Barabbas, the guilty, goes free while the innocent is condemned. This exchange deeply foreshadows the substitutionary nature of Christ's redemptive work—He takes our place."
    },
    {
      "pk": 49023026,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 26,
      "text": "As they led him away, they seized Simon of Cyrene, who was coming in from the country, and laid the cross on him to carry it behind Jesus.",
      "links": "<a href='/AIV/41/15/21'>Mark 15:21</a>; <a href='/AIV/40/27/32'>Matt 27:32</a>",
      "comment": "Simon’s bearing of the cross becomes a model for discipleship; to follow Christ includes sharing in His suffering (<a href='/AIV/42/9/23'>Luke 9:23</a>)."
    },
    {
      "pk": 49023027,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 27,
      "text": "A great multitude of the people followed him, and women were mourning and wailing for him.",
      "links": "<a href='/AIV/38/12/10'>Zech 12:10</a>",
      "comment": "The faithful women’s mourning fulfills prophecy, and their loyalty contrasts with the desertion of many disciples. Women as witnesses convey reliability and highlight the importance of their faithfulness."
    },
    {
      "pk": 49023028,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 28,
      "text": "But Jesus turned to them and said, 'Daughters of Jerusalem, do not weep for me, but weep for yourselves and for your children.'",
      "links": "<a href='/AIV/24/9/17-18'>Jer 9:17-18</a>",
      "comment": "Jesus prophesies coming judgment on Jerusalem, drawing from Old Testament prophetic traditions, showing care for His people even while suffering."
    },
    {
      "pk": 49023029,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 29,
      "text": "For look, the days are coming when they will say, 'Blessed are the barren, the wombs that never bore, and the breasts that never nursed.'",
      "links": "<a href='/AIV/28/9/14'>Hosea 9:14</a>",
      "comment": "This reversal of Old Testament blessings signals catastrophic judgment—a prophecy fulfilled in the destruction of Jerusalem in AD 70."
    },
    {
      "pk": 49023030,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 30,
      "text": "Then they will begin to say to the mountains, 'Fall on us!' and to the hills, 'Cover us!'",
      "links": "<a href='/AIV/23/2/19'>Isa 2:19</a>; <a href='/AIV/28/10/8'>Hos 10:8</a>; <a href='/AIV/66/6/16'>Rev 6:16</a>",
      "comment": "A prophetic image of destruction and fear of the Lord’s judgment. Jesus is the true prophet whose words echo Old Testament prophecy and apocalyptic warning."
    },
    {
      "pk": 49023031,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 31,
      "text": "For if they do these things when the wood is green, what will happen when it is dry?'",
      "links": "",
      "comment": "'Green wood' refers to innocence (Jesus); 'dry' refers to the guilty nation. If judgment falls on the innocent, how much more will it fall on the impenitent."
    },
    {
      "pk": 49023032,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 32,
      "text": "Two others, who were criminals, were also led away to be executed with him.",
      "links": "<a href='/AIV/23/53/12'>Isa 53:12</a>",
      "comment": "Jesus is numbered among the transgressors, precisely as prophesied in Isaiah. Even His death is solidarity with sinners, showing the reach of His mercy."
    },
    {
      "pk": 49023033,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 33,
      "text": "When they came to the place called The Skull, they crucified him there, with the criminals, one on his right and the other on his left.",
      "links": "<a href='/AIV/40/27/33'>Matt 27:33</a>",
      "comment": "'The Skull' (Golgotha/Calvary). Jesus’ position at the center signifies His unique mediation—between God and sinful humanity."
    },
    {
      "pk": 49023034,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 34,
      "text": "Then Jesus said, 'Father, forgive them, for they do not know what they are doing.' And they divided up his clothes by casting lots.",
      "links": "<a href='/AIV/19/22/18'>Ps 22:18</a>",
      "comment": "Jesus prays for His persecutors even as they crucify Him, embodying perfect forgiveness. The soldiers’ actions fulfill Psalm 22. This anticipation of God’s mercy prefigures the forgiveness available through Christ, later efficaciously offered to the world."
    },
    {
      "pk": 49023035,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 35,
      "text": "The people stood watching, but even the rulers sneered at him, saying, 'He saved others; let him save himself if he is the Christ of God, his Chosen One!'",
      "links": "<a href='/AIV/19/22/7-8'>Ps 22:7-8</a>",
      "comment": "The mockery fulfills prophecy and reveals the paradox of salvation: Jesus refuses to save Himself so that He might save others, fulfilling His messianic role as the true Chosen One."
    },
    {
      "pk": 49023036,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 36,
      "text": "The soldiers also mocked him, coming up to him, offering him sour wine,",
      "links": "<a href='/AIV/19/69/21'>Ps 69:21</a>",
      "comment": "The offering of sour wine mirrors the prophetic suffering of the righteous in the Psalms, again affirming that Jesus’ passion is not a surprise but divinely foretold."
    },
    {
      "pk": 49023037,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 37,
      "text": "and saying, 'If you are the King of the Jews, save yourself!'",
      "links": "<a href='/AIV/42/23/35'>Luke 23:35</a>",
      "comment": "This appeal to self-rescue echoes the devil’s temptation in the wilderness (<a href='/AIV/42/4/9-11'>Luke 4:9-11</a>). True kingship is shown not by saving oneself, but by self-sacrifice."
    },
    {
      "pk": 49023038,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 38,
      "text": "A written notice was above him: 'This is the King of the Jews.'",
      "links": "<a href='/AIV/40/27/37'>Matt 27:37</a>",
      "comment": "Pilate’s inscription ironically proclaims the truth about Jesus’ identity as King, though misunderstood by the authorities. This signals universal kingship, ultimately confirmed in His resurrection."
    },
    {
      "pk": 49023039,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 39,
      "text": "One of the criminals who was hanging there hurled insults at him, saying, 'Aren’t you the Christ? Save yourself and us!'",
      "links": "",
      "comment": "The unrepentant criminal echoes the challenge of Jesus’ enemies. There is a tension between worldly expectations of the Messiah and the reality of Christ’s mission as Redeemer through suffering."
    },
    {
      "pk": 49023040,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 40,
      "text": "But the other rebuked him, saying, 'Don’t you even fear God, since you are under the same sentence?'",
      "links": "",
      "comment": "The repentant thief recognizes their just punishment and Jesus’ innocence, exemplifying contrition—a necessary disposition for mercy."
    },
    {
      "pk": 49023041,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 41,
      "text": "'We are punished justly, for we are getting back what we deserve for what we did; but this man has done nothing wrong.'",
      "links": "<a href='/AIV/23/53/9'>Isa 53:9</a>",
      "comment": "Confession of sin is the beginning of justification. The thief’s words echo Isaiah's prophecy, highlighting Jesus’ sinlessness."
    },
    {
      "pk": 49023042,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 42,
      "text": "Then he said, 'Jesus, remember me when you come into your kingdom.'",
      "links": "",
      "comment": "The thief’s prayer is an act of faith in Jesus’ kingship and life after death, recognizing Him as a spiritual King. This is a profound moment of repentance and faith, anticipating the hope for all believers."
    },
    {
      "pk": 49023043,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 43,
      "text": "He replied, 'Truly I tell you, today you will be with me in Paradise.'",
      "links": "<a href='/AIV/47/12/4'>2 Cor 12:4</a>",
      "comment": "Immediate assurance is given—the thief is promised heavenly communion with Christ. This verse teaches the possibility of reconciliation with God, even at the last moment, if there is repentance and faith. It also hints at the continuity of the soul after death."
    },
    {
      "pk": 49023044,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 44,
      "text": "It was now about noon, and darkness came over the whole land until three in the afternoon,",
      "links": "<a href='/AIV/30/8/9'>Amos 8:9</a>",
      "comment": "The miraculous darkness echoes prophetic warning at the Day of the Lord and signifies both judgment and the cosmic importance of Christ’s death."
    },
    {
      "pk": 49023045,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 45,
      "text": "for the sun's light failed. And the curtain of the sanctuary was torn down the middle.",
      "links": "<a href='/AIV/40/27/51'>Matt 27:51</a>",
      "comment": "The torn temple curtain symbolizes direct access to God is now possible through Christ’s sacrifice—He is the new Mediator. This points to a new covenant and the transformation of worship."
    },
    {
      "pk": 49023046,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 46,
      "text": "Then Jesus called out with a loud voice, 'Father, into your hands I commit my spirit.' After he said this, he breathed his last.",
      "links": "<a href='/AIV/19/31/5'>Psalm 31:5</a>",
      "comment": "Jesus voluntarily gives up His life, fulfilling Psalm 31. His trust in the Father and sovereign handing over of His spirit show His divinity and total obedience."
    },
    {
      "pk": 49023047,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 47,
      "text": "When the centurion saw what happened, he glorified God, saying, 'Certainly this man was righteous.'",
      "links": "<a href='/AIV/40/27/54'>Matt 27:54</a>",
      "comment": "The gentile centurion recognizes Jesus' righteousness, foreshadowing the worldwide acknowledgment of His identity. This is an important sign of God’s plan for all nations to know His Son."
    },
    {
      "pk": 49023048,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 48,
      "text": "All the crowds who had gathered for this spectacle, when they saw what had taken place, went home beating their chests.",
      "links": "",
      "comment": "'Beating their chests' signals recognition of guilt and remorse. The impact of Jesus’ death brings many to repentance and contemplation, a sign that His sacrifice convicts hearts."
    },
    {
      "pk": 49023049,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 49,
      "text": "But all those who knew him, including the women who had followed him from Galilee, stood at a distance, watching these things.",
      "links": "<a href='/AIV/42/8/2-3'>Luke 8:2-3</a>",
      "comment": "The faithful women again serve as witnesses to Jesus’ death, demonstrating the importance of steadfast devotion, even in crisis. True disciples persevere to the end."
    },
    {
      "pk": 49023050,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 50,
      "text": "Now there was a man named Joseph, a member of the council, a good and righteous man",
      "links": "<a href='/AIV/40/27/57'>Matt 27:57</a>",
      "comment": "Joseph of Arimathea is called 'good and righteous,' showing integrity and courage, especially significant as a council member. God raises up faithful individuals from unexpected places."
    },
    {
      "pk": 49023051,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 51,
      "text": "who had not consented to their decision and action. He was from Arimathea, a city of the Jews, and was waiting for the kingdom of God.",
      "links": "<a href='/AIV/42/2/25'>Luke 2:25</a>",
      "comment": "Joseph, like others (e.g., Simeon), awaits the kingdom’s fulfillment. His dissent from the council underlines hope among the faithful remnant in Israel."
    },
    {
      "pk": 49023052,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 52,
      "text": "He went to Pilate and asked for Jesus’ body.",
      "links": "",
      "comment": "By publicly asking for the body, Joseph exhibits great courage. The respectful burial of Jesus affirms both His humanity and the honor due to Him—a theme which shaped Christian reverence for burial."
    },
    {
      "pk": 49023053,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 53,
      "text": "Then he took it down, wrapped it in a linen shroud, and laid it in a tomb cut in stone, where no one had ever yet been laid.",
      "links": "<a href='/AIV/23/53/9'>Isa 53:9</a>",
      "comment": "The burial fulfills Isaiah’s prophecy—'with a rich man in his death.' The care and dignity affirm the importance of Jesus’ real death and anticipation of His resurrection, showing continuity with the tradition of reverence for the body."
    },
    {
      "pk": 49023054,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 54,
      "text": "It was the day of Preparation, and the Sabbath was about to begin.",
      "links": "<a href='/AIV/41/15/42'>Mark 15:42</a>",
      "comment": "Jesus dies as the Sabbath draws near, signifying His work of redemption as the fulfillment of the Sabbath rest, and the connection between His death and the rhythm of worship established in Scripture."
    },
    {
      "pk": 49023055,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 55,
      "text": "The women who had come with him from Galilee followed and saw the tomb and how his body was laid.",
      "links": "",
      "comment": "Women continue as primary witnesses to Jesus’ death and burial, highlighting their important role in the unfolding of salvation history and in the life of the early church."
    },
    {
      "pk": 49023056,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 23,
      "verse": 56,
      "text": "They returned and prepared spices and ointments. On the Sabbath they rested according to the commandment.",
      "links": "<a href='/AIV/2/20/10'>Exod 20:10</a>",
      "comment": "Obedience to the Sabbath command shows deep reverence for God’s law, even in grief. This prepares for the resurrection: after Sabbath rest comes the new creation, signaled in Christ rising on the first day of the week, the day after the Sabbath."
    }
  ],
  "translatedAt": "2025-12-24T10:58:56.408Z"
}