{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 11,
  "verses": [
    {
      "pk": 1101101,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 1,
      "text": "Imitate me, just as I also imitate Christ.",
      "links": "<a href='/AIV/50/3/17'>Philippians 3:17</a>; <a href='/AIV/52/1/6'>1 Thessalonians 1:6</a>",
      "comment": "Paul calls the Corinthians to follow his example because he himself follows Jesus. True Christian leadership points to Christ, not self."
    },
    {
      "pk": 1101102,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 2,
      "text": "Now I praise you because you remember me in everything and hold firmly to the traditions, just as I delivered them to you.",
      "links": "<a href='/AIV/53/2/15'>2 Thessalonians 2:15</a>",
      "comment": "The use of 'traditions' (Greek: paradosis) refers to practices handed down by the apostles. This emphasizes continuity in the Church and the importance of apostolic instruction."
    },
    {
      "pk": 1101103,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 3,
      "text": "But I want you to know that the head of every man is Christ, the head of a woman is the man, and the head of Christ is God.",
      "links": "<a href='/AIV/49/5/23'>Ephesians 5:23</a>; <a href='/AIV/43/14/28'>John 14:28</a>",
      "comment": "Paul reflects the order and unity in God's household, showing relational hierarchy. Christ submits to the Father in his incarnate role, while remaining fully divine."
    },
    {
      "pk": 1101104,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 4,
      "text": "Every man praying or prophesying with his head covered dishonors his head.",
      "links": "<a href='/AIV/46/14/34'>1 Corinthians 14:34</a>",
      "comment": "Paul addresses appropriate conduct in worship and its symbolism—showing honor and reverence in the assembly."
    },
    {
      "pk": 1101105,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 5,
      "text": "But every woman who prays or prophesies with her head uncovered dishonors her head; for it is the same as having her head shaved.",
      "links": "<a href='/AIV/16/9/5'>Nehemiah 9:5</a>",
      "comment": "The head covering in Paul’s time was a sign of respect and modesty within worship. The symbolism may connect to creation order, as Paul explains further."
    },
    {
      "pk": 1101106,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 6,
      "text": "For if a woman does not cover her head, let her also have her hair cut off; but if it is shameful for a woman to be shorn or shaved, let her cover her head.",
      "links": "<a href='/AIV/19/40/11'>Ps. 40:11</a>",
      "comment": "The stress on head coverings reflects both cultural modesty and deeper spiritual realities about order and sign of authority."
    },
    {
      "pk": 1101107,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 7,
      "text": "For a man ought not to cover his head, since he is the image and glory of God; but woman is the glory of man.",
      "links": "<a href='/AIV/1/1/27'>Genesis 1:27</a>; <a href='/AIV/1/2/23'>Genesis 2:23</a>",
      "comment": "Paul points to creation, teaching both men and women reflect God's image, but highlighting roles in relationship to each other."
    },
    {
      "pk": 1101108,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 8,
      "text": "For man did not come from woman, but woman from man.",
      "links": "<a href='/AIV/1/2/21-22'>Genesis 2:21–22</a>",
      "comment": "Paul uses creation order to ground the theological symbolism in worship practices."
    },
    {
      "pk": 1101109,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 9,
      "text": "Neither was man created for the woman, but woman for the man.",
      "links": "<a href='/AIV/1/2/18'>Genesis 2:18</a>",
      "comment": "The creation narrative is central for Paul's argument on worship decorum, indicating complementary roles."
    },
    {
      "pk": 1101110,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 10,
      "text": "For this reason, a woman ought to have authority on her head, because of the angels.",
      "links": "<a href='/AIV/18/5/1'>Job 5:1</a>; <a href='/AIV/40/18/10'>Matthew 18:10</a>",
      "comment": "Paul’s reference to angels reminds us of the holiness of worship and the presence of spiritual beings during the assembly. Authority here can mean a sign of authority or power."
    },
    {
      "pk": 1101111,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 11,
      "text": "Nevertheless, in the Lord, woman is not independent of man nor man independent of woman.",
      "links": "<a href='/AIV/48/3/28'>Galatians 3:28</a>",
      "comment": "Despite the order in creation, mutual dependence exists in Christ. Both are equal in dignity and value."
    },
    {
      "pk": 1101112,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 12,
      "text": "For as woman was from man, so also man is born through woman; but all things are from God.",
      "links": "<a href='/AIV/1/3/20'>Genesis 3:20</a>",
      "comment": "Paul keeps the focus on God as the source of all things, harmonizing the relationship between the sexes."
    },
    {
      "pk": 1101113,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 13,
      "text": "Judge for yourselves: is it proper for a woman to pray to God uncovered?",
      "links": "",
      "comment": "Paul invites the Corinthians to discern fitting worship practices shaped by both culture and theological truth."
    },
    {
      "pk": 1101114,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 14,
      "text": "Does not even nature itself teach you that if a man has long hair, it is a dishonor to him?",
      "links": "<a href='/AIV/4/6/5'>Numbers 6:5</a>",
      "comment": "Paul appeals to at-the-time common sense about appearances. Special exceptions (e.g. Nazarite vow) are elsewhere in scripture."
    },
    {
      "pk": 1101115,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 15,
      "text": "But if a woman has long hair, it is a glory to her? For her hair is given to her as a covering.",
      "links": "",
      "comment": "Paul points to how natural differences in male and female appearance can teach spiritual truths."
    },
    {
      "pk": 1101116,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 16,
      "text": "But if anyone seems to be contentious, we have no other practice, nor do the churches of God.",
      "links": "<a href='/AIV/16/8/10'>Nehemiah 8:10</a>",
      "comment": "Paul appeals to the uniformity in practice among all the assemblies, emphasizing unity in worship."
    },
    {
      "pk": 1101117,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 17,
      "text": "But in giving this instruction, I do not praise you, for when you come together it is not for the better but for the worse.",
      "links": "",
      "comment": "Paul corrects abuses among the Corinthians concerning their gatherings, laying groundwork for teaching on the Lord’s Supper."
    },
    {
      "pk": 1101118,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 18,
      "text": "For, first of all, when you come together as a church, I hear that there are divisions among you, and in part I believe it.",
      "links": "<a href='/AIV/46/1/10'>1 Corinthians 1:10</a>",
      "comment": "Division undermines the unity that Christ intended for his community. Paul insists that unity marks genuine worship."
    },
    {
      "pk": 1101119,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 19,
      "text": "For there must also be factions among you so that those who are approved may become evident among you.",
      "links": "<a href='/AIV/62/2/19'>1 John 2:19</a>",
      "comment": "God can use even strife to clarify who remains faithful and true in the faith community."
    },
    {
      "pk": 1101120,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 20,
      "text": "Therefore when you come together in one place, it is not really to eat the Lord’s Supper.",
      "links": "<a href='/AIV/40/26/26'>Matthew 26:26</a>",
      "comment": "Paul’s rebuke sets up his sacred teaching on the true meaning of the Lord’s Supper, the central act of Christian worship."
    },
    {
      "pk": 1101121,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 21,
      "text": "For in eating, each one takes his own supper ahead of others; and one is hungry, and another is drunk.",
      "links": "<a href='/AIV/45/13/13'>Romans 13:13</a>",
      "comment": "Paul criticizes selfishness and disorder at these gatherings, which diminish their sacred purpose."
    },
    {
      "pk": 1101122,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 22,
      "text": "What! Do you not have houses to eat and drink in? Or do you despise the church of God and shame those who have nothing? What shall I say to you? Shall I praise you? In this I do not praise you.",
      "links": "<a href='/AIV/59/2/6'>James 2:6</a>",
      "comment": "Paul rebukes the neglect of the poor among them, highlighting the call to charity and unity in worship."
    },
    {
      "pk": 1101123,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 23,
      "text": "For I received from the Lord that which I also delivered to you: that the Lord Jesus, on the night he was betrayed, took bread;",
      "links": "<a href='/AIV/42/22/19'>Luke 22:19</a>; <a href='/AIV/40/26/26'>Matthew 26:26</a>",
      "comment": "Paul roots his teaching about the Lord’s Supper in the direct tradition received from Christ—showing its unbroken and sacred origin."
    },
    {
      "pk": 1101124,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 24,
      "text": "And when He had given thanks, He broke it and said: 'This is my body, which is for you; do this in remembrance of me.'",
      "links": "<a href='/AIV/42/22/19'>Luke 22:19</a>; <a href='/AIV/19/116/13'>Psalm 116:13</a>",
      "comment": "Jesus’ words at the Last Supper point to his real presence and the command for ongoing ritual remembrance. Tradition holds an unbroken practice of this meal."
    },
    {
      "pk": 1101125,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 25,
      "text": "In the same way also, after supper He took the cup, saying, 'This cup is the new covenant in my blood. Do this, as often as you drink it, in remembrance of me.'",
      "links": "<a href='/AIV/24/31/31'>Jeremiah 31:31</a>; <a href='/AIV/58/9/15'>Hebrews 9:15</a>",
      "comment": "Jesus inaugurates the new covenant (see Jeremiah 31:31), establishing the fulfillment of Old Testament prophecy in his self-giving."
    },
    {
      "pk": 1101126,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 26,
      "text": "For as often as you eat this bread and drink this cup, you proclaim the Lord’s death until he comes.",
      "links": "<a href='/AIV/66/19/9'>Revelation 19:9</a>; <a href='/AIV/40/24/30'>Matthew 24:30</a>",
      "comment": "The eating and drinking are a true proclamation of Jesus’ sacrifice, and point toward his return in glory. This expresses both past fulfillment and future hope."
    },
    {
      "pk": 1101127,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 27,
      "text": "Therefore, whoever eats the bread or drinks the cup of the Lord in an unworthy manner will be guilty of the body and blood of the Lord.",
      "links": "<a href='/AIV/58/10/29'>Hebrews 10:29</a>",
      "comment": "Partaking in the Lord’s Supper requires self-examination and reverence, as unworthy reception is a grave matter with real spiritual effects."
    },
    {
      "pk": 1101128,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 28,
      "text": "But let a person examine himself, and so eat of the bread and drink of the cup.",
      "links": "<a href='/AIV/19/139/23-24'>Psalm 139:23–24</a>",
      "comment": "Self-examination before partaking in the Lord’s Supper is a key practice, emphasizing interior repentance and holiness."
    },
    {
      "pk": 1101129,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 29,
      "text": "For anyone who eats and drinks not discerning the body eats and drinks judgment on himself.",
      "links": "<a href='/AIV/10/6/7'>2 Samuel 6:7</a>",
      "comment": "Failure to recognize the sacredness and presence in the Eucharist brings spiritual consequences."
    },
    {
      "pk": 1101130,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 30,
      "text": "That is why many among you are weak and sick, and quite a number have died.",
      "links": "<a href='/AIV/4/11/33'>Numbers 11:33</a>",
      "comment": "Paul teaches that spiritual realities are tied to physical consequences in the life of the Church—God’s discipline leads back to reverence and life."
    },
    {
      "pk": 1101131,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 31,
      "text": "But if we judged ourselves truly, we would not be judged.",
      "links": "<a href='/AIV/19/32/5'>Psalm 32:5</a>",
      "comment": "Practicing self-examination and repentance brings healing and protection from divine judgment."
    },
    {
      "pk": 1101132,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 32,
      "text": "But when we are judged by the Lord, we are disciplined so that we may not be condemned with the world.",
      "links": "<a href='/AIV/58/12/6'>Hebrews 12:6</a>",
      "comment": "God disciplines his people so they will avoid final condemnation, highlighting the ongoing process of sanctification."
    },
    {
      "pk": 1101133,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 33,
      "text": "So then, my brothers and sisters, when you come together to eat, wait for one another.",
      "links": "<a href='/AIV/45/12/10'>Romans 12:10</a>",
      "comment": "Paul calls for unity, charity, and order when celebrating the Lord’s Supper, ensuring the communal nature of worship is preserved."
    },
    {
      "pk": 1101134,
      "translation": "AIV",
      "book": 46,
      "chapter": 11,
      "verse": 34,
      "text": "If anyone is hungry, let him eat at home, so that you may not come together for judgment. And the rest I will arrange when I come.",
      "links": "",
      "comment": "Paul sets rules for the Lord’s Supper to avoid judgment and preserve its sacredness, deferring further instructions to his next visit. The Eucharist is a sacred meal, not a common one."
    }
  ],
  "translatedAt": "2025-12-23T03:43:05.370Z"
}