{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 5,
  "verses": [
    {
      "pk": 2005001,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 1,
      "text": "It is actually reported among you that there is sexual immorality, and such immorality as is not even tolerated among the pagans—a man has his father’s wife.",
      "links": "<a href='/AIV/3/18/8'>Lev. 18:8</a>; <a href='/AIV/5/27/20'>Deut. 27:20</a>",
      "comment": "The sin described refers to incest, specifically forbidden in the Law of Moses—see Leviticus 18:8. Early Christian communities strove for moral purity, notably surpassing pagan standards. The seriousness of church discipline is introduced here."
    },
    {
      "pk": 2005002,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 2,
      "text": "And you are proud! Should you not rather have mourned, so that the one who has done this deed would be removed from among you?",
      "links": "<a href='/AIV/40/5/4'>Matt. 5:4</a>; <a href='/AIV/40/18/17'>Matt. 18:17</a>",
      "comment": "Paul’s rebuke echoes Christ’s teaching about mourning over sin and practicing discipline (see Matthew 18:17). Paul here expects a deep sense of communal responsibility—implicating a visible, authoritative body."
    },
    {
      "pk": 2005003,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 3,
      "text": "For though I am absent in body, I am present in spirit; and as if present, I have already judged the one who has so acted.",
      "links": "<a href='/AIV/51/2/5'>Col. 2:5</a>",
      "comment": "Paul shows that spiritual authority transcends physical presence, supporting the idea of an ongoing, visible leadership structure."
    },
    {
      "pk": 2005004,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 4,
      "text": "When you are assembled in the name of our Lord Jesus, and my spirit is present, with the power of our Lord Jesus,",
      "links": "<a href='/AIV/18/2/6'>Job 2:6</a>; <a href='/AIV/40/18/20'>Matt. 18:20</a>",
      "comment": "The communal gathering, invoked in the Lord’s name, suggests real sacramental unity—a means by which the Lord’s authority is exercised among the faithful (see Matthew 18:20)."
    },
    {
      "pk": 2005005,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 5,
      "text": "you are to hand this man over to Satan for the destruction of the flesh, so that his spirit may be saved on the day of the Lord.",
      "links": "<a href='/AIV/54/1/20'>1 Tim. 1:20</a>; <a href='/AIV/40/18/17'>Matt. 18:17</a>",
      "comment": "This refers to excommunication—a severe but medicinal act meant for repentance and ultimate salvation. Restoration and salvation remain the goal through this authoritative act."
    },
    {
      "pk": 2005006,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 6,
      "text": "Your boasting is not good. Do you not know that a little leaven leavens the whole lump?",
      "links": "<a href='/AIV/2/12/15'>Ex. 12:15</a>; <a href='/AIV/48/5/9'>Gal. 5:9</a>",
      "comment": "Paul uses leaven as a metaphor for sin—a motif from both Old and New Testaments (see Exodus 12:15; Galatians 5:9). Sin corrupts the whole community if left unchecked."
    },
    {
      "pk": 2005007,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 7,
      "text": "Cleanse out the old leaven so that you may be a new batch, as you really are unleavened. For Christ, our Passover lamb, has been sacrificed.",
      "links": "<a href='/AIV/2/12/21-27'>Ex. 12:21-27</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "Christ’s role as Passover lamb fulfills the Old Testament (Exodus 12; John 1:29) and connects the act of cleansing to participation in Christ’s sacrificial work—hinting at sanctifying rites."
    },
    {
      "pk": 2005008,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 8,
      "text": "Therefore let us celebrate the feast, not with old leaven, the leaven of malice and evil, but with the unleavened bread of sincerity and truth.",
      "links": "<a href='/AIV/2/12/17-20'>Ex. 12:17-20</a>",
      "comment": "Here is both literal and spiritual application—an exhortation to live genuinely, and a hint toward an ongoing, sacred communal celebration reflective of Old Testament feasts, fulfilled in Christ."
    },
    {
      "pk": 2005009,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 9,
      "text": "I wrote to you in my letter not to associate with sexually immoral people—",
      "links": "<a href='/AIV/47/6/14'>2 Cor. 6:14</a>",
      "comment": "A previous letter referenced here, implying ongoing apostolic correspondence and instruction."
    },
    {
      "pk": 2005010,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 10,
      "text": "not at all meaning the sexually immoral of this world, or the greedy and swindlers, or idolaters, for then you would have to leave the world.",
      "links": "<a href='/AIV/43/17/15'>John 17:15</a>",
      "comment": "Christians are called to engage with the world, not withdraw entirely. Jesus Himself prays for protection while remaining ‘in the world’ (cf. John 17:15)."
    },
    {
      "pk": 2005011,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 11,
      "text": "But now I am writing to you not to associate with anyone who claims to be a brother but is sexually immoral, greedy, an idolater, a slanderer, a drunkard, or a swindler—not even to eat with such a one.",
      "links": "<a href='/AIV/40/18/17'>Matt. 18:17</a>; <a href='/AIV/52/3/6'>2 Thess. 3:6</a>",
      "comment": "The call is for discipline among self-identified believers. Notably, even sharing a meal—possibly an allusion to the Lord’s Supper—is forbidden, emphasizing the holiness expected within the visible Church."
    },
    {
      "pk": 2005012,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 12,
      "text": "For what have I to do with judging outsiders? Is it not those inside the church whom you are to judge?",
      "links": "<a href='/AIV/40/18/17'>Matt. 18:17</a>; <a href='/AIV/54/3/15'>1 Tim. 3:15</a>",
      "comment": "Paul distinguishes those ‘inside’ and ‘outside’ the visible assembly, reiterating the community’s authority and responsibility for internal discipline (cf. 1 Timothy 3:15, ‘pillar and foundation of the truth’)."
    },
    {
      "pk": 2005013,
      "translation": "AIV",
      "book": 46,
      "chapter": 5,
      "verse": 13,
      "text": "God judges those outside. 'Remove the evil person from among yourselves.'",
      "links": "<a href='/AIV/5/17/7'>Deut. 17:7</a>; <a href='/AIV/5/19/19'>Deut. 19:19</a>",
      "comment": "Paul cites Deuteronomy, invoking God’s directive for communal purity. This evokes continuity between the people of God in the Old and New Covenants; discipline is enacted for the preservation of holiness."
    }
  ],
  "translatedAt": "2025-12-23T03:40:03.751Z"
}