{
  "book": 53,
  "bookName": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 2,
  "verses": [
    {
      "pk": 53002001,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 1,
      "text": "And I, brothers, when I came to you, did not come proclaiming the testimony of God with lofty speech or wisdom.",
      "links": "<a href='/AIV/44/18/1'>Acts 18:1</a>; <a href='/AIV/46/1/17'>1 Cor. 1:17</a>",
      "comment": "Paul emphasizes humility in sharing the Gospel, relying not on eloquence or human wisdom, but on the message itself. This reflects an apostolic approach relying on divine power rather than mere human skill."
    },
    {
      "pk": 53002002,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 2,
      "text": "For I determined to know nothing among you except Jesus Christ and Him crucified.",
      "links": "<a href='/AIV/48/6/14'>Gal. 6:14</a>; <a href='/AIV/46/1/23'>1 Cor. 1:23</a>",
      "comment": "Paul’s focus on the crucified Christ highlights the centrality of the cross in salvation. Spiritual progress begins with this mystery, leading believers into deeper understanding. Both literal and mystical interpretations connect here: Christ’s sacrifice is also reflected in the sacramental life of the Church."
    },
    {
      "pk": 53002003,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 3,
      "text": "And I was with you in weakness, in fear, and in much trembling.",
      "links": "<a href='/AIV/47/7/15'>2 Cor. 7:15</a>; <a href='/AIV/44/18/9-10'>Acts 18:9-10</a>",
      "comment": "Paul’s own human frailty shows that the power in preaching is not of men, but of God who works through vessels. The Church has always acknowledged that human weakness does not thwart divine purpose."
    },
    {
      "pk": 53002004,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 4,
      "text": "My speech and my message were not in persuasive words of wisdom, but in demonstration of the Spirit and of power,",
      "links": "<a href='/AIV/45/15/19'>Rom. 15:19</a>; <a href='/AIV/52/1/5'>1 Thess. 1:5</a>",
      "comment": "True proclamation of Christ is confirmed by the Spirit’s power, not merely human philosophy. The Church continues to rely on the Spirit’s action in teaching and miracles, reinforcing that faith rests first on God’s initiative."
    },
    {
      "pk": 53002005,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 5,
      "text": "so that your faith might not rest in the wisdom of men, but in the power of God.",
      "links": "<a href='/AIV/44/4/12'>Acts 4:12</a>; <a href='/AIV/19/115/1'>Ps. 115:1</a>",
      "comment": "Faith is founded upon God’s power and revelation, not human ideas. The Church is built on this supernatural foundation, guarding against inventions of man in matters of doctrine and practice."
    },
    {
      "pk": 53002006,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 6,
      "text": "Yet we do speak wisdom among the mature, but not the wisdom of this age, nor of the rulers of this age, who are coming to nothing.",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>; <a href='/AIV/51/1/9'>Col. 1:9</a>",
      "comment": "Spiritual maturity brings a deeper divine wisdom surpassing worldly philosophies. The enduring wisdom of God is preserved and taught faithfully among those initiated into sacred mysteries (see spiritual interpretation)."
    },
    {
      "pk": 53002007,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 7,
      "text": "But we speak the wisdom of God in a mystery, which God decreed before the ages for our glory.",
      "links": "<a href='/AIV/45/16/25'>Rom. 16:25</a>; <a href='/AIV/49/3/9'>Eph. 3:9</a>",
      "comment": "Mystery here refers to hidden divine truths, revealed progressively. The Church continues to guard and interpret these mysteries, guiding believers into a deeper participation in Christ’s glory."
    },
    {
      "pk": 53002008,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 8,
      "text": "None of the rulers of this age understood it; for if they had, they would not have crucified the Lord of glory.",
      "links": "<a href='/AIV/44/3/15'>Acts 3:15</a>; <a href='/AIV/19/24/7-10'>Ps. 24:7-10</a>",
      "comment": "Calling Jesus 'the Lord of glory' is a high christological statement, affirming His divinity (see Ps. 24:7-10). The ignorance of earthly rulers led to the crucifixion, yet fulfilled divine prophecy and plan."
    },
    {
      "pk": 53002009,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 9,
      "text": "But as it is written: 'No eye has seen, nor ear heard, nor has it entered into the heart of man, what God has prepared for those who love Him.'",
      "links": "<a href='/AIV/23/64/4'>Isa. 64:4</a>; <a href='/AIV/19/31/19'>Ps. 31:19</a>",
      "comment": "This allusion expresses the unimaginable blessings promised to those who love God. Both literal hope and spiritual interpretation suggest a future union with God, realized most fully through sacramental and mystical participation."
    },
    {
      "pk": 53002010,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 10,
      "text": "But God has revealed them to us through the Spirit. For the Spirit searches all things, even the depths of God.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/19/139/1-6'>Ps. 139:1-6</a>",
      "comment": "The Holy Spirit is the divine Person by whom believers are initiated into the mysteries of God. Full knowledge comes, not by natural reason alone, but by the gift and indwelling of the Spirit."
    },
    {
      "pk": 53002011,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 11,
      "text": "For who among men knows the things of a man except the spirit of the man which is in him? So also no one knows the things of God except the Spirit of God.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Only the Spirit of God can fully reveal divine mysteries. This passage supports the Church’s teaching that divine revelation requires supernatural guidance, not merely private interpretation."
    },
    {
      "pk": 53002012,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 12,
      "text": "Now we have not received the spirit of the world, but the Spirit who is from God, so that we may know what has been freely given to us by God.",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/49/1/18'>Eph. 1:18</a>",
      "comment": "The Spirit from God enables us to understand His generous gifts. This points to ongoing illumination, as the treasures of salvation continue to unfold in the life and liturgy of the Church."
    },
    {
      "pk": 53002013,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 13,
      "text": "Which things we also speak, not in words taught by human wisdom, but taught by the Spirit, interpreting spiritual truths to those who are spiritual.",
      "links": "<a href='/AIV/47/3/6'>2 Cor. 3:6</a>; <a href='/AIV/43/6/63'>John 6:63</a>",
      "comment": "Divine teaching comes through the Spirit, not mere human learning. Church tradition holds that the deposit of faith is safeguarded and expounded through spiritual interpretation passed down from the apostles."
    },
    {
      "pk": 53002014,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 14,
      "text": "But the natural man does not accept the things of the Spirit of God, for they are foolishness to him; and he cannot understand them, because they are spiritually discerned.",
      "links": "<a href='/AIV/45/8/7-8'>Rom. 8:7-8</a>; <a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "Apart from the Spirit, man cannot grasp spiritual realities. The necessity of spiritual discernment underscores the importance of ongoing formation within the believing community."
    },
    {
      "pk": 53002015,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 15,
      "text": "But he who is spiritual judges all things, yet he himself is judged by no one.",
      "links": "<a href='/AIV/62/2/27'>1 John 2:27</a>; <a href='/AIV/45/8/1'>Rom. 8:1</a>",
      "comment": "Those led by the Spirit can discern truth and error, enjoying a security that comes from belonging to an authoritative, apostolic tradition handed down from the earliest believers."
    },
    {
      "pk": 53002016,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 2,
      "verse": 16,
      "text": "For who has known the mind of the Lord so as to instruct Him? But we have the mind of Christ.",
      "links": "<a href='/AIV/23/40/13'>Isa. 40:13</a>; <a href='/AIV/45/11/34'>Rom. 11:34</a>",
      "comment": "The mind of Christ is imparted to believers, especially through the Spirit and sacramental union. This passage also affirms the unity and continuity of apostolic teaching: true interpretation rests in the fullness of truth held by the whole Church."
    }
  ],
  "translatedAt": "2025-12-24T11:44:36.982Z"
}