{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 16,
  "verses": [
    {
      "pk": 1003901,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 1,
      "text": "Now concerning the collection for the saints: as I directed the churches of Galatia, so you also are to do.",
      "links": "<a href='/AIV/48/2/10'>Gal 2:10</a>; <a href='/AIV/45/15/26'>Rom 15:26</a>",
      "comment": "Paul gives instructions about supporting believers in need, just as he did for other churches. This demonstrates the unity and charity among all Christian communities, rooted in the call to care for the faithful."
    },
    {
      "pk": 1003902,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 2,
      "text": "On the first day of every week, each of you should set aside something and store it up, as he may prosper, so that there will be no collections when I come.",
      "links": "<a href='/AIV/44/20/7'>Acts 20:7</a>; <a href='/AIV/47/9/7'>2 Cor 9:7</a>",
      "comment": "Paul refers to gathering on the first day—the Lord’s Day, Sunday—showing how early Christians observed weekly worship on this day. The regular collection points to organized communal worship and stewardship."
    },
    {
      "pk": 1003903,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 3,
      "text": "And when I arrive, I will send those whom you approve with letters to carry your gift to Jerusalem.",
      "links": "<a href='/AIV/47/8/19'>2 Cor 8:19</a>",
      "comment": "Paul wants the Corinthians to appoint trustworthy people to deliver their gifts, emphasizing responsible stewardship and the importance of unity with the church in Jerusalem."
    },
    {
      "pk": 1003904,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 4,
      "text": "If it seems good for me to go also, they will go with me.",
      "links": "<a href='/AIV/44/19/21'>Acts 19:21</a>",
      "comment": "Paul offers to accompany the delegation, showing the importance he places on transparency and shared responsibility in ministry."
    },
    {
      "pk": 1003905,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 5,
      "text": "But I will come to you after I have gone through Macedonia, for I am passing through Macedonia.",
      "links": "<a href='/AIV/44/19/21'>Acts 19:21</a>; <a href='/AIV/47/1/15-16'>2 Cor 1:15-16</a>",
      "comment": "Paul maps out his missionary itinerary, showing open communication and pastoral care for the local congregation."
    },
    {
      "pk": 1003906,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 6,
      "text": "And perhaps I will stay with you, or even spend the winter, so that you may help me on my journey wherever I go.",
      "links": "<a href='/AIV/56/3/13'>Titus 3:13</a>",
      "comment": "Paul’s plans highlight mutual support between minister and congregation. The model of Christians supporting ministers for further missions echoes the New Testament’s emphasis on partnership in spreading the Gospel."
    },
    {
      "pk": 1003907,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 7,
      "text": "For I do not want to see you now just in passing; I hope to remain with you for some time, if the Lord permits.",
      "links": "<a href='/AIV/59/4/15'>James 4:15</a>",
      "comment": "Paul submits his plans to God’s will, demonstrating dependence on divine providence—a key aspect of authentic faith and discernment."
    },
    {
      "pk": 1003908,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 8,
      "text": "But I will remain in Ephesus until Pentecost,",
      "links": "<a href='/AIV/44/19/1'>Acts 19:1</a>; <a href='/AIV/03/23/16'>Lev 23:16</a>",
      "comment": "Paul marks time by the liturgical calendar, underscoring the continued relevance of sacred feasts reinterpreted in Christian tradition."
    },
    {
      "pk": 1003909,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 9,
      "text": "for a wide door for effective work has opened to me, and there are many adversaries.",
      "links": "<a href='/AIV/44/19/8-9'>Acts 19:8-9</a>",
      "comment": "Paul recognizes opportunities and opposition as part of mission. Trials and fruitful ministry often come together—persistent devotion is required to persevere."
    },
    {
      "pk": 1003910,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 10,
      "text": "If Timothy comes, see that he is with you without fear, for he is doing the work of the Lord, as I am.",
      "links": "<a href='/AIV/52/3/2'>1 Thess 3:2</a>; <a href='/AIV/54/4/12'>1 Tim 4:12</a>",
      "comment": "Paul urges the church to receive Timothy with respect, reminding them that true apostolic work deserves honor."
    },
    {
      "pk": 1003911,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 11,
      "text": "Therefore let no one despise him. Help him on his way in peace, so that he may come to me, for I am expecting him with the brothers.",
      "links": "<a href='/AIV/54/4/12'>1 Tim 4:12</a>",
      "comment": "The call to support Timothy echoes the need for unity, encouragement, and proper esteem for God’s appointed messengers."
    },
    {
      "pk": 1003912,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 12,
      "text": "Now concerning our brother Apollos: I strongly urged him to visit you with the brothers, but it was not at all his will to come now. He will come when he has opportunity.",
      "links": "<a href='/AIV/44/18/24'>Acts 18:24</a>; <a href='/AIV/46/1/12'>1 Cor 1:12</a>",
      "comment": "Though Apollos was a respected leader, Paul shows respect for his discernment and decision, demonstrating the collaborative and ordered nature of ministry leadership."
    },
    {
      "pk": 1003913,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 13,
      "text": "Be watchful, stand firm in the faith, act like men, be strong.",
      "links": "<a href='/AIV/49/6/10-18'>Eph 6:10-18</a>; <a href='/AIV/60/5/8-9'>1 Pet 5:8-9</a>",
      "comment": "Paul exhorts the Corinthians to vigilance, steadfastness, and spiritual maturity—a call to virtue and perseverance. This spiritual firmness is central to both individual sanctity and the health of the community."
    },
    {
      "pk": 1003914,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 14,
      "text": "Let all that you do be done in love.",
      "links": "<a href='/AIV/46/13/1-13'>1 Cor 13:1-13</a>; <a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "Christian life is to be motivated and saturated by love, the greatest spiritual virtue, and the heart of Christ’s teaching to his followers."
    },
    {
      "pk": 1003915,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 15,
      "text": "Now I urge you, brothers, you know that the household of Stephanas were the first converts in Achaia, and that they have devoted themselves to the service of the saints—",
      "links": "<a href='/AIV/46/1/16'>1 Cor 1:16</a>",
      "comment": "Paul points out the steadfast leadership and service of Stephanas’ family, setting them as an example for the whole church. Early conversion and devotion to service are presented as models to follow."
    },
    {
      "pk": 1003916,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 16,
      "text": "that you also be subject to such people, and to every fellow worker and laborer.",
      "links": "<a href='/AIV/52/5/12-13'>1 Thess 5:12-13</a>; <a href='/AIV/58/13/17'>Heb 13:17</a>",
      "comment": "Paul calls for respectful submission to those who lead in spiritual service. Obedience and respect toward church leaders is an enduring apostolic principle."
    },
    {
      "pk": 1003917,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 17,
      "text": "I rejoice at the coming of Stephanas and Fortunatus and Achaicus, because they have supplied what was lacking on your part,",
      "links": "<a href='/AIV/50/2/30'>Phil 2:30</a>",
      "comment": "Paul’s joy at their visit shows the importance of spiritual fellowship and practical help in the life of the church."
    },
    {
      "pk": 1003918,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 18,
      "text": "for they refreshed my spirit as well as yours. Give recognition therefore to such people.",
      "links": "<a href='/AIV/45/16/4'>Rom 16:4</a>; <a href='/AIV/50/2/29'>Phil 2:29</a>",
      "comment": "Recognition and honor for faithful service is encouraged as part of the proper order and encouragement in the community."
    },
    {
      "pk": 1003919,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 19,
      "text": "The churches of Asia send you greetings. Aquila and Prisca, together with the church in their house, greet you heartily in the Lord.",
      "links": "<a href='/AIV/45/16/5'>Rom 16:5</a>; <a href='/AIV/44/18/2'>Acts 18:2</a>",
      "comment": "Paul references the wider, interconnected community of believers spanning regions and families, highlighting unity and hospitality in the worshiping church."
    },
    {
      "pk": 1003920,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 20,
      "text": "All the brothers greet you. Greet one another with a holy kiss.",
      "links": "<a href='/AIV/45/16/16'>Rom 16:16</a>; <a href='/AIV/52/5/26'>1 Thess 5:26</a>",
      "comment": "The ‘holy kiss’ was a traditional sign of peace, fellowship, and unity expressed in Christian worship and community."
    },
    {
      "pk": 1003921,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 21,
      "text": "I, Paul, write this greeting with my own hand.",
      "links": "<a href='/AIV/53/3/17'>2 Thess 3:17</a>; <a href='/AIV/51/4/18'>Col 4:18</a>",
      "comment": "Paul’s personal signature authenticates the letter, a practice to guard against forgeries and confirm apostolic authority."
    },
    {
      "pk": 1003922,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 22,
      "text": "If anyone does not love the Lord, let him be accursed. Our Lord, come!",
      "links": "<a href='/AIV/48/1/8-9'>Gal 1:8-9</a>; <a href='/AIV/66/22/20'>Rev 22:20</a>",
      "comment": "The warning against not loving Christ shows the centrality of personal devotion to Jesus as Lord. The phrase 'Our Lord, come!' (Aramaic: Maranatha) expresses the expectation of Christ’s return—an essential hope in Christian faith."
    },
    {
      "pk": 1003923,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 23,
      "text": "The grace of the Lord Jesus be with you.",
      "links": "<a href='/AIV/54/1/2'>1 Tim 1:2</a>; <a href='/AIV/47/13/14'>2 Cor 13:14</a>",
      "comment": "Paul closes with a blessing, bringing the grace of Christ to the believers. The consistent invocation of grace is a spiritual reality administered especially through the apostolic ministry."
    },
    {
      "pk": 1003924,
      "translation": "AIV",
      "book": 46,
      "chapter": 16,
      "verse": 24,
      "text": "My love be with you all in Christ Jesus. Amen.",
      "links": "<a href='/AIV/50/1/8'>Phil 1:8</a>",
      "comment": "Paul’s concluding expression of love highlights Christian unity in Christ and the primacy of love in all relationships within the church."
    }
  ],
  "translatedAt": "2025-12-23T03:45:34.352Z"
}