{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 8,
  "verses": [
    {
      "pk": 2009801,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 1,
      "text": "Now concerning food offered to idols: We know that ‘all of us have knowledge.’ Knowledge puffs up, but love builds up.",
      "links": "<a href='/AIV/40/22/36-40'>Matt. 22:36-40</a>; <a href='/AIV/13/13/10'>1 Chron. 13:10</a>",
      "comment": "Paul begins with the issue of meat offered to idols. The contrast between knowledge and love echoes Jesus’ teaching that love of God and neighbor summarizes the law (Matt. 22:36-40). The emphasis on love as the higher virtue aligns with a spiritually mature faith, encouraging humility."
    },
    {
      "pk": 2009802,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 2,
      "text": "If anyone thinks he knows something, he does not yet know as he ought to know.",
      "links": "<a href='/AIV/20/3/5-7'>Prov. 3:5-7</a>",
      "comment": "True knowledge requires humility and openness to correction, consistent with biblical wisdom literature (Prov. 3:5-7) urging trust in God rather than oneself."
    },
    {
      "pk": 2009803,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 3,
      "text": "But if anyone loves God, he is known by Him.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/62/4/8-10'>1 John 4:8-10</a>",
      "comment": "Love for God surpasses mere intellectual understanding. Being ‘known by God’ is covenant language, reflecting deep relationship found throughout Scripture (Ps. 1:6). There is a hint of divine election—God initiates relationship with those who love Him."
    },
    {
      "pk": 2009804,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 4,
      "text": "Therefore, concerning the eating of food offered to idols: We know that an idol is nothing in the world, and that there is no God but one.",
      "links": "<a href='/AIV/05/6/4'>Deut. 6:4</a>; <a href='/AIV/23/44/6'>Isa. 44:6</a>",
      "comment": "Paul reaffirms strict monotheism from the Shema (Deut. 6:4). Idol worship is futile, but the true God is unique and supreme. This is foundational to both Old and New Testament faith."
    },
    {
      "pk": 2009805,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 5,
      "text": "For even if there are so-called gods, whether in heaven or on earth—as indeed there are many ‘gods’ and many ‘lords’—",
      "links": "<a href='/AIV/19/82/1'>Ps. 82:1</a>; <a href='/AIV/02/12/12'>Ex. 12:12</a>",
      "comment": "Paul acknowledges that others claim spiritual beings as gods or lords, resonating with references to false gods in Psalms and Exodus. The contrast sets up the uniqueness of the one true God."
    },
    {
      "pk": 2009806,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 6,
      "text": "Yet for us there is one God, the Father, from whom all things come and for whom we exist, and one Lord, Jesus Christ, through whom all things exist and through whom we exist.",
      "links": "<a href='/AIV/43/1/1-3'>John 1:1-3</a>; <a href='/AIV/51/1/15-17'>Col. 1:15-17</a>",
      "comment": "This verse has high Christology, placing Jesus as the agent of creation and closely relating Him to the Father (John 1:1-3, Col. 1:15-17). The language hints at the unity of God but also a distinction of persons, implying later doctrinal developments about the triune God."
    },
    {
      "pk": 2009807,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 7,
      "text": "However, not everyone has this knowledge. Some, because of their former association with idols, eat such food as truly offered to an idol, and their conscience, being weak, is defiled.",
      "links": "<a href='/AIV/45/14/14'>Rom. 14:14</a>",
      "comment": "The issue of conscience is pastoral; Paul distinguishes between the theological truth and the subjective state of believers who struggle due to past idolatrous practices. Weak conscience here means spiritual immaturity."
    },
    {
      "pk": 2009808,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 8,
      "text": "Food does not bring us closer to God. We are not worse off if we do not eat, and we are not better off if we do.",
      "links": "<a href='/AIV/40/15/11'>Matt. 15:11</a>",
      "comment": "Paul emphasizes that spiritual standing before God is not dependent on ritual food laws—the heart is what matters (Matt. 15:11). This signals a move away from the old ceremonial law, increasing focus on interior disposition and grace."
    },
    {
      "pk": 2009809,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 9,
      "text": "But take care that your liberty does not become a stumbling block to those who are weak.",
      "links": "<a href='/AIV/45/14/13'>Rom. 14:13</a>; <a href='/AIV/40/18/6'>Matt. 18:6</a>",
      "comment": "Christian freedom must be tempered by charity. Paul insists that love requires consideration of others, echoing Jesus’ warnings against causing others to fall (Matt. 18:6). Mature believers are called to bear with the weaknesses of others."
    },
    {
      "pk": 2009810,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 10,
      "text": "For if someone sees you, who have knowledge, eating in an idol's temple, will not his conscience, if weak, be encouraged to eat food offered to idols?",
      "links": "<a href='/AIV/45/14/15'>Rom. 14:15</a>",
      "comment": "Paul describes how the actions of knowledgeable believers can set an example that might lead less mature believers into sin. This highlights the responsibility of authority and witness, which is also a theme in broader church tradition."
    },
    {
      "pk": 2009811,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 11,
      "text": "And so, by your knowledge, this weak person is destroyed—the brother for whom Christ died.",
      "links": "<a href='/AIV/62/2/2'>1 John 2:2</a>; <a href='/AIV/45/14/15'>Rom. 14:15</a>",
      "comment": "Paul draws attention to the sacrificial love of Christ, making it clear that our actions ought to reflect the value Christ places on each person. Christ died for even the weakest; this calls for sacrificial love from all believers."
    },
    {
      "pk": 2009812,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 12,
      "text": "By sinning against your brothers and wounding their weak conscience, you sin against Christ.",
      "links": "<a href='/AIV/40/25/40'>Matt. 25:40</a>; <a href='/AIV/44/9/4'>Acts 9:4</a>",
      "comment": "Sin against fellow believers is ultimately sin against Christ Himself. This reinforces the mystical union of Christ with His people (Matt. 25:40; Acts 9:4), and echoes the importance of sacramental unity, where harming the body hurts the Lord."
    },
    {
      "pk": 2009813,
      "translation": "AIV",
      "book": 46,
      "chapter": 8,
      "verse": 13,
      "text": "Therefore, if food causes my brother to stumble, I will never eat meat, so that I may not cause my brother to stumble.",
      "links": "<a href='/AIV/45/14/21'>Rom. 14:21</a>",
      "comment": "Paul’s personal commitment to self-denial for the sake of others is a model of sacrificial love, echoing the call to self-denial and concern for the brethren (Rom. 14:21). This principle is foundational for the development of ascetic practice and communal discernment."
    }
  ],
  "translatedAt": "2025-12-23T03:41:13.709Z"
}