{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 1,
  "verses": [
    {
      "pk": 3101001,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, called by the will of God to be an apostle of Jesus Christ, and our brother Sosthenes,",
      "links": "<a href='/AIV/45/1/1'>Rom. 1:1</a>; <a href='/AIV/47/1/1'>2 Cor. 1:1</a>",
      "comment": "Paul establishes his authority as divinely appointed, referencing his calling as 'apostle.' Sosthenes, likely the same figure from Acts 18:17, is acknowledged as a fellow believer."
    },
    {
      "pk": 3101002,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 2,
      "text": "To the church of God that is in Corinth, to those who are sanctified in Christ Jesus, called to be holy, together with all who in every place call on the name of our Lord Jesus Christ, both their Lord and ours:",
      "links": "<a href='/AIV/47/1/1'>2 Cor. 1:1</a>; <a href='/AIV/45/1/7'>Rom. 1:7</a>",
      "comment": "The phrase 'sanctified in Christ Jesus' hints at the ongoing consecration of believers through unity and shared worship–an early sign of the visible gathered community throughout the world."
    },
    {
      "pk": 3101003,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 3,
      "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/54/1/2'>1 Tim. 1:2</a>",
      "comment": "Paul’s greeting echoes traditional blessing, showing Jesus’s divine status alongside the Father, a profound early witness to Christian belief in Jesus’s divinity."
    },
    {
      "pk": 3101004,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 4,
      "text": "I always thank my God for you because of the grace of God given to you in Christ Jesus,",
      "links": "<a href='/AIV/50/1/3'>Phil. 1:3</a>; <a href='/AIV/45/1/8'>Rom. 1:8</a>",
      "comment": "Paul’s thanksgiving is rooted in the transformative power of grace, emphasizing the centrality of Christ’s role in the believer’s life."
    },
    {
      "pk": 3101005,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 5,
      "text": "For in every way you were made rich in him, in all speech and knowledge,",
      "links": "<a href='/AIV/46/12/8'>1 Cor. 12:8-10</a>; <a href='/AIV/45/15/14'>Rom. 15:14</a>",
      "comment": "Spiritual gifts such as speech and understanding are signs of participation in a larger spiritual body, not merely personal possessions."
    },
    {
      "pk": 3101006,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 6,
      "text": "Just as the testimony about Christ has been confirmed among you,",
      "links": "<a href='/AIV/47/2/2'>2 Cor. 2:2</a>; <a href='/AIV/62/5/6'>1 John 5:6</a>",
      "comment": "Conversion and spiritual gifts confirm the truth of Christ’s work and authority. The confirmation points to tangible signs of God’s presence."
    },
    {
      "pk": 3101007,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 7,
      "text": "So that you do not lack any gift as you wait for the revealing of our Lord Jesus Christ.",
      "links": "<a href='/AIV/50/3/20'>Phil. 3:20</a>; <a href='/AIV/60/4/13'>1 Pet. 4:13</a>",
      "comment": "The expectation of Christ’s return is linked with a present fullness of gifts, suggesting the church’s ongoing mission until that day."
    },
    {
      "pk": 3101008,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 8,
      "text": "He will also keep you strong to the end, so that you will be blameless on the day of our Lord Jesus Christ.",
      "links": "<a href='/AIV/50/1/6'>Phil. 1:6</a>; <a href='/AIV/52/3/13'>1 Thess. 3:13</a>",
      "comment": "Blamelessness is promised for those persevering in Christ. The language hints at the final judgment and the necessity of perseverance within the community."
    },
    {
      "pk": 3101009,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 9,
      "text": "God is faithful, by whom you were called into fellowship with his Son, Jesus Christ our Lord.",
      "links": "<a href='/AIV/60/5/10'>1 Pet. 5:10</a>; <a href='/AIV/62/1/3'>1 John 1:3</a>",
      "comment": "The believer's fellowship is not private, but an invitation into the community surrounding Christ. This conveys a theological emphasis on unity."
    },
    {
      "pk": 3101010,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 10,
      "text": "I appeal to you, brothers and sisters, by the name of our Lord Jesus Christ, that you all agree, and that there be no divisions among you, but that you be united in the same mind and purpose.",
      "links": "<a href='/AIV/46/12/25'>1 Cor. 12:25</a>; <a href='/AIV/45/12/16'>Rom. 12:16</a>",
      "comment": "Unity is a recurring theme in the apostolic writings, indicating the importance of one visible, undivided communion. Spiritual and practical unity are equally emphasized."
    },
    {
      "pk": 3101011,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 11,
      "text": "For it has been reported to me by Chloe’s people that there are quarrels among you, my brothers and sisters.",
      "links": "<a href='/AIV/46/3/3'>1 Cor. 3:3</a>",
      "comment": "Paul addresses community division, based on a report from trusted members, reflecting the early church’s mechanisms of accountability."
    },
    {
      "pk": 3101012,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 12,
      "text": "What I mean is that each one of you says, 'I follow Paul,' or 'I follow Apollos,' or 'I follow Cephas,' or 'I follow Christ.'",
      "links": "<a href='/AIV/46/3/4'>1 Cor. 3:4</a>",
      "comment": "Distinctions among leaders threaten unity; the mention of Cephas (Peter) highlights apostolic authority and the need to recognize a higher, cohesive leadership."
    },
    {
      "pk": 3101013,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 13,
      "text": "Is Christ divided? Was Paul crucified for you? Or were you baptized in the name of Paul?",
      "links": "<a href='/AIV/46/3/22-23'>1 Cor. 3:22-23</a>; <a href='/AIV/45/6/3-4'>Rom. 6:3-4</a>",
      "comment": "Paul underscores Christ as the central figure. Refers to baptism as an initiatory, unifying rite into Christ’s death and resurrection, with crucifixion exclusive to Christ."
    },
    {
      "pk": 3101014,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 14,
      "text": "I thank God that I baptized none of you except Crispus and Gaius,",
      "links": "<a href='/AIV/44/18/8'>Acts 18:8</a>; <a href='/AIV/45/16/23'>Rom. 16:23</a>",
      "comment": "Paul mentions only having baptized a few, reinforcing the idea that it is Christ, not human leaders, who is central to faith and identity."
    },
    {
      "pk": 3101015,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 15,
      "text": "So that no one may say that you were baptized in my name.",
      "links": "<a href='/AIV/46/1/13'>1 Cor. 1:13</a>",
      "comment": "Paul is careful not to create cults of personality; baptism’s spiritual effect is tied with Christ, not human intermediaries."
    },
    {
      "pk": 3101016,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 16,
      "text": "I did also baptize the household of Stephanas. Beyond that, I do not remember baptizing anyone else.",
      "links": "<a href='/AIV/46/16/15'>1 Cor. 16:15</a>",
      "comment": "Household baptisms hint at a family faith journey, showing the incorporation of entire families, a practice consistent with historic Christian tradition."
    },
    {
      "pk": 3101017,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 17,
      "text": "For Christ did not send me to baptize but to preach the gospel, and not with words of human wisdom, so that the cross of Christ would not be emptied of its power.",
      "links": "<a href='/AIV/47/4/2'>2 Cor. 4:2</a>; <a href='/AIV/46/2/1'>1 Cor. 2:1</a>",
      "comment": "The focus on preaching over technique or eloquence maintains the central place of Christ’s sacrificial work rather than human effort."
    },
    {
      "pk": 3101018,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 18,
      "text": "For the message of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God.",
      "links": "<a href='/AIV/45/1/16'>Rom. 1:16</a>; <a href='/AIV/46/2/14'>1 Cor. 2:14</a>",
      "comment": "Salvation is described as an active process, not a one-time experience. The cross is central both literarily and sacramentally."
    },
    {
      "pk": 3101019,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 19,
      "text": "For it is written: 'I will destroy the wisdom of the wise, and the intelligence of the intelligent I will frustrate.'",
      "links": "<a href='/AIV/23/29/14'>Isa. 29:14</a>",
      "comment": "Paul cites Isaiah, connecting Old Testament prophecy to Christ’s work and showing continuity of divine revelation and fulfillment."
    },
    {
      "pk": 3101020,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 20,
      "text": "Where is the wise person? Where is the scribe? Where is the debater of this age? Has not God made the wisdom of the world foolish?",
      "links": "<a href='/AIV/23/33/18'>Isa. 33:18</a>; <a href='/AIV/19/94/8-11'>Ps. 94:8-11</a>",
      "comment": "Paul’s rhetorical questions challenge worldly philosophy, exalting a revealed wisdom that surpasses human intellect. Implies divine guidance above all human opinion."
    },
    {
      "pk": 3101021,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 21,
      "text": "For since in the wisdom of God, the world did not know God through wisdom, it pleased God through the foolishness of what we preach to save those who believe.",
      "links": "<a href='/AIV/45/16/25'>Rom. 16:25</a>; <a href='/AIV/24/8/9'>Jer. 8:9</a>",
      "comment": "Revealed truth rather than philosophical reasoning is the means of salvation, foreshadowing the enduring tradition of teaching by proclamation."
    },
    {
      "pk": 3101022,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 22,
      "text": "For Jews demand signs and Greeks seek wisdom,",
      "links": "<a href='/AIV/43/2/18'>John 2:18</a>; <a href='/AIV/44/17/18-21'>Acts 17:18-21</a>",
      "comment": "Paul highlights the cultural expectations of both groups, stressing the universal appeal and unique nature of the gospel."
    },
    {
      "pk": 3101023,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 23,
      "text": "But we preach Christ crucified, a stumbling block to Jews and foolishness to Gentiles,",
      "links": "<a href='/AIV/45/9/33'>Rom. 9:33</a>; <a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "The cross’s offensiveness fulfills Old Testament prophecy (see Isaiah 53), yet is proclaimed at the center of the Christian message and worship."
    },
    {
      "pk": 3101024,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 24,
      "text": "But to those who are called, both Jews and Greeks, Christ is the power of God and the wisdom of God.",
      "links": "<a href='/AIV/45/8/28'>Rom. 8:28</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>",
      "comment": "Christ embodies both divine power and wisdom, fulfilling expectations of Messiah and revealing God’s plan for salvation for all."
    },
    {
      "pk": 3101025,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 25,
      "text": "For the foolishness of God is wiser than men, and the weakness of God is stronger than men.",
      "links": "<a href='/AIV/46/3/19'>1 Cor. 3:19</a>; <a href='/AIV/61/1/16'>2 Pet. 1:16</a>",
      "comment": "Paul points to the mystery and paradox of the gospel; God’s methods may appear weak but are divinely powerful."
    },
    {
      "pk": 3101026,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 26,
      "text": "Consider your own calling, brothers and sisters: not many of you were wise by human standards, not many were powerful, not many were of noble birth.",
      "links": "<a href='/AIV/43/7/48'>John 7:48</a>; <a href='/AIV/45/16/13'>Rom. 16:13</a>",
      "comment": "Paul reminds believers that their status comes from spiritual calling, not worldly advantages, illustrating God’s preference for humility."
    },
    {
      "pk": 3101027,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 27,
      "text": "But God chose what is foolish in the world to shame the wise; God chose what is weak in the world to shame the strong;",
      "links": "<a href='/AIV/19/8/2'>Ps. 8:2</a>; <a href='/AIV/20/3/34'>Prov. 3:34</a>",
      "comment": "God’s choice inverts human expectations, exalting the lowly and equipping them for spiritual purposes, reminiscent of Old Testament patterns."
    },
    {
      "pk": 3101028,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 28,
      "text": "God chose what is low and despised in the world, even things that are nothing, to bring to nothing things that are;",
      "links": "<a href='/AIV/19/113/7-8'>Ps. 113:7-8</a>; <a href='/AIV/23/41/14'>Isa. 41:14</a>",
      "comment": "Paul stresses that God’s plan glorifies humility and dependency upon Him, consistent with a tradition of elevation of the poor and outcast."
    },
    {
      "pk": 3101029,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 29,
      "text": "So that no human being might boast in the presence of God.",
      "links": "<a href='/AIV/49/2/9'>Eph. 2:9</a>",
      "comment": "Boasting is excluded, underscoring the principle of grace and substantiating a theology where salvation and sanctification are gifts, not achievements."
    },
    {
      "pk": 3101030,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 30,
      "text": "But it is because of him that you are in Christ Jesus, who became for us wisdom from God, righteousness, holiness, and redemption,",
      "links": "<a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/45/3/24'>Rom. 3:24</a>",
      "comment": "Christ is the source of all spiritual benefits—wisdom, righteousness, sanctification, and redemption—highlighting that salvation is a continual work in those joined to Christ."
    },
    {
      "pk": 3101031,
      "translation": "AIV",
      "book": 46,
      "chapter": 1,
      "verse": 31,
      "text": "So that, as it is written: 'Let the one who boasts, boast in the Lord.'",
      "links": "<a href='/AIV/24/9/23-24'>Jer. 9:23-24</a>; <a href='/AIV/47/10/17'>2 Cor. 10:17</a>",
      "comment": "Paul closes with Jeremiah’s exhortation, celebrating God’s initiative and authority. Humility before God is the hallmark of true Christian worship and discipleship."
    }
  ],
  "translatedAt": "2025-12-23T03:38:33.185Z"
}