{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 12,
  "verses": [
    {
      "pk": 1812001,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 1,
      "text": "Now concerning spiritual gifts, brothers, I do not want you to be uninformed.",
      "links": "<a href='/AIV/45/1/13'>Rom. 1:13</a>; <a href='/AIV/46/10/1'>1 Cor. 10:1</a>;",
      "comment": "Paul is beginning to address questions about spiritual gifts, seeking to instruct the church so that there is clarity and unity in how the Spirit works among believers. He addresses the entire church, emphasizing the importance of communal understanding."
    },
    {
      "pk": 1812002,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 2,
      "text": "You know that when you were Gentiles, you were led astray to mute idols, however you were led.",
      "links": "<a href='/AIV/19/115/5'>Ps. 115:5</a>; <a href='/AIV/23/44/18-20'>Isa. 44:18-20</a>;",
      "comment": "Paul reminds them of their past, when they were separated from the true God and followed lifeless idols. The mention of 'mute idols' recalls passages about the powerlessness of false gods (see Psalm 115)."
    },
    {
      "pk": 1812003,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 3,
      "text": "Therefore, I make known to you that no one speaking by the Spirit of God ever says, 'Jesus is accursed!' and no one can say, 'Jesus is Lord,' except by the Holy Spirit.",
      "links": "<a href='/AIV/40/16/16-17'>Matt. 16:16-17</a>; <a href='/AIV/62/4/2-3'>1 John 4:2-3</a>;",
      "comment": "Declaring Jesus as Lord is a sign of the Holy Spirit’s activity. The outward confession of Christ’s lordship is rooted in a spiritual reality brought about by the Spirit, a significant truth that recalls Peter’s declaration (Matt 16) and the spiritual authority given to the apostolic leaders."
    },
    {
      "pk": 1812004,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 4,
      "text": "Now there are different kinds of gifts, but the same Spirit.",
      "links": "<a href='/AIV/45/12/6'>Rom. 12:6</a>; <a href='/AIV/60/4/10'>1 Pet. 4:10</a>;",
      "comment": "Paul highlights both the diversity and unity of divine gifts. It’s through the one Spirit that varied gifts are given to the church, emphasizing the source and the harmony among believers."
    },
    {
      "pk": 1812005,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 5,
      "text": "And there are different kinds of ministries, but the same Lord.",
      "links": "<a href='/AIV/49/4/11'>Eph. 4:11</a>;",
      "comment": "Not only are there different gifts, but also different ways of serving, all coordinated under the lordship of Christ, suggesting the variety of roles found within the Church’s organizational structure."
    },
    {
      "pk": 1812006,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 6,
      "text": "And there are different kinds of activities, but it is the same God who empowers them all in everyone.",
      "links": "<a href='/AIV/50/2/13'>Phil. 2:13</a>;",
      "comment": "The Trinity is subtly present here: Spirit (v.4), Lord (v.5), and God (v.6)—each involved in the bestowing and empowering of gifts within the Church."
    },
    {
      "pk": 1812007,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 7,
      "text": "But to each is given the manifestation of the Spirit for the common good.",
      "links": "<a href='/AIV/45/12/7'>Rom. 12:7</a>; <a href='/AIV/49/4/12'>Eph. 4:12</a>;",
      "comment": "Spiritual gifts are not for personal glory but for building up the whole community of believers, reinforcing the idea that the Church is one body working together."
    },
    {
      "pk": 1812008,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 8,
      "text": "For to one is given through the Spirit the word of wisdom, and to another the word of knowledge according to the same Spirit;",
      "links": "<a href='/AIV/49/1/17'>Eph. 1:17</a>; <a href='/AIV/45/15/14'>Rom. 15:14</a>;",
      "comment": "The Spirit bestows different gifts as needed, such as wisdom and knowledge, both foundational for guiding the church in truth and prudent decision-making."
    },
    {
      "pk": 1812009,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 9,
      "text": "to another faith by the same Spirit, to another gifts of healing by the one Spirit,",
      "links": "<a href='/AIV/59/5/15'>Jas. 5:15</a>; <a href='/AIV/44/3/6'>Acts 3:6</a>;",
      "comment": "The Spirit may grant special confidence in God’s power, or the ability to heal. These serve to point to the authority and presence of Christ in His Church through visible signs."
    },
    {
      "pk": 1812010,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 10,
      "text": "to another the working of miracles, to another prophecy, to another the ability to distinguish spirits, to another various kinds of tongues, to another the interpretation of tongues.",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/62/4/1'>1 John 4:1</a>; <a href='/AIV/46/14/1'>1 Cor. 14:1</a>;",
      "comment": "Miracles, prophecy, and discernment are all gifts for the discernment and growth of the Church. The mention of tongues and interpretation roots these phenomena in the apostolic tradition, emphasizing a need for order and authenticity, not confusion."
    },
    {
      "pk": 1812011,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 11,
      "text": "All these are empowered by one and the same Spirit, who apportions to each one individually as He wills.",
      "links": "<a href='/AIV/58/2/4'>Heb. 2:4</a>;",
      "comment": "It is the Spirit who sovereignly distributes gifts, reinforcing unity amidst diversity in the Church and revealing the Spirit’s personal and powerful guidance."
    },
    {
      "pk": 1812012,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 12,
      "text": "For just as the body is one and has many members, and all the members of the body, though many, are one body, so also is Christ.",
      "links": "<a href='/AIV/45/12/4-5'>Rom. 12:4-5</a>;",
      "comment": "Paul uses the metaphor of a body for the Church, stressing unity and the deep spiritual connectedness of Christians under Christ, the head."
    },
    {
      "pk": 1812013,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 13,
      "text": "For by one Spirit we were all baptized into one body—Jews or Greeks, slaves or free—and all were made to drink of one Spirit.",
      "links": "<a href='/AIV/48/3/27-28'>Gal. 3:27-28</a>; <a href='/AIV/49/2/18'>Eph. 2:18</a>;",
      "comment": "Baptism is understood as entry into the Church, unifying all believers regardless of background. The phrase 'drink of one Spirit' recalls the spiritual sustenance given through the Church’s sacraments (cf. John 7:37-39; the water imagery)."
    },
    {
      "pk": 1812014,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 14,
      "text": "For the body does not consist of one member, but of many.",
      "links": "<a href='/AIV/45/12/5'>Rom. 12:5</a>;",
      "comment": "The diversity within the Church is by design, not accident. Each member, though different, is essential."
    },
    {
      "pk": 1812015,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 15,
      "text": "If the foot should say, 'Because I am not a hand, I do not belong to the body,' it would not for that reason stop being part of the body.",
      "links": "",
      "comment": "Paul uses humor to make the point: every part is needed and has a purpose in God’s design for the Church."
    },
    {
      "pk": 1812016,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 16,
      "text": "And if the ear should say, 'Because I am not an eye, I do not belong to the body,' it would not for that reason stop being part of the body.",
      "links": "",
      "comment": "No one should feel that their role is insignificant. Diversity is essential for the full life of the Church."
    },
    {
      "pk": 1812017,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 17,
      "text": "If the whole body were an eye, where would be the hearing? If the whole were hearing, where would be the sense of smell?",
      "links": "",
      "comment": "The body analogy emphasizes the need for the full range of gifts and ministries for a healthy Church."
    },
    {
      "pk": 1812018,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 18,
      "text": "But now God has set the members, each one of them, in the body just as He desired.",
      "links": "",
      "comment": "God himself arranges the members of the Church, giving each their place and role. This suggests a divinely ordained structure and order in the Church, not human invention."
    },
    {
      "pk": 1812019,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 19,
      "text": "If they were all one member, where would the body be?",
      "links": "",
      "comment": "Unity does not mean uniformity; all roles are needed for the Church’s perfection."
    },
    {
      "pk": 1812020,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 20,
      "text": "But as it is, there are many members, but one body.",
      "links": "",
      "comment": "Paul repeats this theme for emphasis—the reality of many members united as the one Church."
    },
    {
      "pk": 1812021,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 21,
      "text": "And the eye cannot say to the hand, 'I have no need of you,' nor again the head to the feet, 'I have no need of you.'",
      "links": "",
      "comment": "No part of the Church can claim self-sufficiency. All depend upon one another, reinforcing a spirit of humility and mutual support."
    },
    {
      "pk": 1812022,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 22,
      "text": "On the contrary, those members of the body which seem to be weaker are indispensable.",
      "links": "",
      "comment": "Even the less visible or honored ministries are essential—every believer has dignity and importance in God’s plan."
    },
    {
      "pk": 1812023,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 23,
      "text": "And those members of the body which we think to be less honorable, we bestow greater honor, and our unpresentable parts are treated with greater modesty,",
      "links": "",
      "comment": "Paul points to a deep respect and even reverence for all, especially for roles that may be overlooked. This underlines the Church’s call to honor each member, echoing traditions of showing respect for the humble and hidden aspects of the Church."
    },
    {
      "pk": 1812024,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 24,
      "text": "whereas our presentable parts have no need. But God has arranged the body, giving greater honor to the part that lacked it,",
      "links": "",
      "comment": "God’s design is to uplift the lowly, again showing His wisdom in structuring the Church."
    },
    {
      "pk": 1812025,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 25,
      "text": "so that there would be no division in the body, but that the members would have the same care for one another.",
      "links": "<a href='/AIV/45/12/16'>Rom. 12:16</a>;",
      "comment": "Unity is God’s purpose for the Church—a unity expressed in real love and concern for each member."
    },
    {
      "pk": 1812026,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 26,
      "text": "And if one member suffers, all the members suffer together; if one member is honored, all rejoice together.",
      "links": "<a href='/AIV/45/12/15'>Rom. 12:15</a>;",
      "comment": "There is a deep solidarity that reflects Christ’s love—a call to compassionate interdependence modeled after Christ, who is united to His body."
    },
    {
      "pk": 1812027,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 27,
      "text": "Now you are the body of Christ, and individually members of it.",
      "links": "<a href='/AIV/49/5/30'>Eph. 5:30</a>;",
      "comment": "This profound truth means the Church embodies Christ’s presence on earth, with every faithful member taking part in that mission. This also points to the need for clear leadership and structure for the sake of unity and mission."
    },
    {
      "pk": 1812028,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 28,
      "text": "And God has appointed in the church first apostles, second prophets, third teachers, then miracles, then gifts of healings, helps, administrations, and various kinds of tongues.",
      "links": "<a href='/AIV/49/4/11'>Eph. 4:11</a>; <a href='/AIV/44/14/23'>Acts 14:23</a>;",
      "comment": "Here we see an ordered, hierarchical structure: apostles (those uniquely commissioned by Christ), then teachers and others. This divinely-willed order ensures faithfulness to Christ’s teaching throughout history."
    },
    {
      "pk": 1812029,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 29,
      "text": "Are all apostles? Are all prophets? Are all teachers? Do all work miracles?",
      "links": "",
      "comment": "Paul expects the answer is no: different roles create a Church in which all gifts are respected and needed for its fullness."
    },
    {
      "pk": 1812030,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 30,
      "text": "Do all possess gifts of healings? Do all speak with tongues? Do all interpret?",
      "links": "",
      "comment": "Again, diversity of gifts is intentional and a sign of God’s wisdom at work in the Church."
    },
    {
      "pk": 1812031,
      "translation": "AIV",
      "book": 46,
      "chapter": 12,
      "verse": 31,
      "text": "But earnestly desire the greater gifts. And I will show you a still more excellent way.",
      "links": "<a href='/AIV/46/13/13'>1 Cor. 13:13</a>;",
      "comment": "Paul ends with the call to seek the greatest gifts—especially love (chapter 13). This anticipates the primacy of charity as the unifying force in the Church, above all spiritual gifts."
    }
  ],
  "translatedAt": "2025-12-23T03:43:36.508Z"
}