{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 6,
  "verses": [
    {
      "pk": 1932600,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 1,
      "text": "When one of you has a dispute with another, does he dare to take it before the unrighteous for judgment, instead of before the holy ones?",
      "links": "<a href='/AIV/40/18/15-17'>Matt. 18:15–17</a>; <a href='/AIV/19/82/1'>Ps. 82:1</a>",
      "comment": "Paul urges believers to resolve conflicts within the community of the faithful, rather than relying on secular courts. The term 'holy ones' refers to fellow believers, set apart for God."
    },
    {
      "pk": 1932601,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 2,
      "text": "Or do you not know that the holy ones will judge the world? And if the world is to be judged by you, are you not competent to judge trivial cases?",
      "links": "<a href='/AIV/27/7/22'>Dan. 7:22</a>; <a href='/AIV/19/149/9'>Ps. 149:9</a>",
      "comment": "Paul draws from Old Testament imagery suggesting that the faithful will participate in God’s judgment, indicating a profound dignity and spiritual authority given to believers."
    },
    {
      "pk": 1932602,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 3,
      "text": "Do you not know that we will judge angels? How much more, then, things of this life!",
      "links": "<a href='/AIV/65/1/6'>Jude 6</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "Paul emphasizes the extraordinary destiny of the faithful, entrusted with supernatural judgment in Christ, hinting at the eternal scope of their vocation."
    },
    {
      "pk": 1932603,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 4,
      "text": "So if you have disputes about ordinary matters, do you appoint as judges those whose standing in the church is least esteemed?",
      "links": "<a href='/AIV/40/5/19'>Matt. 5:19</a>; <a href='/AIV/59/2/5'>James 2:5</a>",
      "comment": "Paul’s rhetorical question highlights the importance of choosing spiritually mature individuals to help resolve community matters. There’s an implicit call toward respect for spiritual authority and order."
    },
    {
      "pk": 1932604,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 5,
      "text": "I say this to shame you. Is there really no one among you wise enough to settle a dispute between brothers?",
      "links": "<a href='/AIV/20/11/14'>Prov. 11:14</a>",
      "comment": "Paul appeals to communal wisdom, which, nourished by faith, should naturally arise among those living in the Spirit. Genuine wisdom is shown in arbitration that reflects Christ’s teaching."
    },
    {
      "pk": 1932605,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 6,
      "text": "But brother goes to law against brother, and that before unbelievers!",
      "links": "<a href='/AIV/43/13/35'>John 13:35</a>",
      "comment": "Allowing such disputes to go public damages the witness of the church’s unity and love. Paul’s concern is for the visible holiness of the community."
    },
    {
      "pk": 1932606,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 7,
      "text": "To have lawsuits at all with one another is already a defeat for you. Why not rather be wronged? Why not rather be cheated?",
      "links": "<a href='/AIV/40/5/39-40'>Matt. 5:39–40</a>",
      "comment": "Paul points to the radical selflessness modeled by Christ, who calls us to bear injustice for the sake of peace. This reflects the spiritual counsel of enduring wrong for greater unity."
    },
    {
      "pk": 1932607,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 8,
      "text": "Instead, you yourselves do wrong and cheat, even your own brothers!",
      "links": "<a href='/AIV/32/3/34'>Obadiah 1:12</a>",
      "comment": "Such behavior is condemned as a serious violation of brotherly love, contrary to the heart of the gospel."
    },
    {
      "pk": 1932608,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 9,
      "text": "Do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice sexual perversion,",
      "links": "<a href='/AIV/3/18/22'>Lev. 18:22</a>; <a href='/AIV/65/1/7'>Jude 7</a>",
      "comment": "Paul enumerates serious sins, connecting morality to salvation. The ‘inheritance’ language recalls familial, covenantal promises in scripture."
    },
    {
      "pk": 1932609,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 10,
      "text": "nor thieves, nor greedy people, nor drunkards, nor revilers, nor swindlers will inherit the kingdom of God.",
      "links": "<a href='/AIV/19/5/4-5'>Ps. 5:4–5</a>; <a href='/AIV/48/5/19-21'>Gal. 5:19–21</a>",
      "comment": "Continuation of the vice list, underscoring the seriousness of unrepentant sin. Paul’s teaching points toward ongoing transformation and repentance, not just forensic justification."
    },
    {
      "pk": 1932610,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 11,
      "text": "And that is what some of you were. But you were washed, you were made holy, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.",
      "links": "<a href='/AIV/45/6/3-4'>Rom. 6:3–4</a>; <a href='/AIV/56/3/5'>Titus 3:5</a>",
      "comment": "Paul describes conversion using baptismal language: washing, sanctifying, and justifying by Christ and the Spirit. This points to the transformative power of sacramental grace through faith."
    },
    {
      "pk": 1932611,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 12,
      "text": "‘All things are lawful for me,’ but not all things are beneficial. ‘All things are lawful for me,’ but I will not be mastered by anything.",
      "links": "<a href='/AIV/48/5/13'>Gal. 5:13</a>",
      "comment": "Paul distinguishes liberty from license, teaching that Christian freedom is ordered toward holiness. True freedom is found under the lordship of Christ, not slavery to passion."
    },
    {
      "pk": 1932612,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 13,
      "text": "‘Food is for the stomach and the stomach for food,’ and God will destroy both one and the other. The body is not meant for sexual immorality but for the Lord, and the Lord for the body.",
      "links": "<a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Paul sets apart the body for spiritual purpose, affirming its role in God’s plan. The body is not disposable—its destiny is union with the Lord, echoing sacramental theology of physical holiness."
    },
    {
      "pk": 1932613,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 14,
      "text": "And God raised the Lord and will also raise us up by His power.",
      "links": "<a href='/AIV/45/8/11'>Rom. 8:11</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "Affirms bodily resurrection as a central Christian hope. This verse ties the resurrection of Jesus with the ultimate destiny of believers, both spiritually and physically."
    },
    {
      "pk": 1932614,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 15,
      "text": "Do you not know that your bodies are members of Christ? Shall I then take the members of Christ and make them members of a prostitute? Never!",
      "links": "<a href='/AIV/62/3/6'>1 John 3:6</a>",
      "comment": "The believer’s union with Christ is holistic, extending to physical life. Paul warns against sacrilegious misuse of what is consecrated to the Lord."
    },
    {
      "pk": 1932615,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 16,
      "text": "Or do you not know that he who is joined to a prostitute becomes one body with her? For it is written, ‘The two shall become one flesh.’",
      "links": "<a href='/AIV/1/2/24'>Gen. 2:24</a>; <a href='/AIV/40/19/5'>Matt. 19:5</a>",
      "comment": "Paul references Genesis to emphasize the spiritual gravity of sexual union. The body’s actions matter spiritually and are inseparable from one’s relationship with Christ."
    },
    {
      "pk": 1932616,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 17,
      "text": "But whoever is joined to the Lord becomes one spirit with Him.",
      "links": "<a href='/AIV/43/17/21'>John 17:21</a>",
      "comment": "Highlights mystical union with Christ, a reality both spiritual and sacramental. The oneness echoes Jesus’s prayer for his disciples to share the unity of the divine life."
    },
    {
      "pk": 1932617,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 18,
      "text": "Flee from sexual immorality. Every other sin a person commits is outside the body, but the sexually immoral person sins against his own body.",
      "links": "<a href='/AIV/20/6/32'>Prov. 6:32</a>",
      "comment": "Sexual sin especially defiles the body, which is set apart for the Lord. Paul calls the faithful to radically avoid it, protecting the integrity of their spiritual and physical unity in Christ."
    },
    {
      "pk": 1932618,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 19,
      "text": "Do you not know that your body is a temple of the Holy Spirit within you, whom you have from God? You are not your own,",
      "links": "<a href='/AIV/40/3/16'>Matt. 3:16</a>; <a href='/AIV/19/139/13-14'>Ps. 139:13–14</a>",
      "comment": "Affirms the indwelling of the Holy Spirit, making each believer a living temple. The teaching underscores reverence for the body and self-giving as the shape of Christian life."
    },
    {
      "pk": 1932619,
      "translation": "AIV",
      "book": 46,
      "chapter": 6,
      "verse": 20,
      "text": "for you were bought at a price. So glorify God with your body.",
      "links": "<a href='/AIV/60/1/18-19'>1 Pet. 1:18–19</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Paul concludes by reminding believers that salvation came through Christ’s sacrifice—implying both spiritual and physical devotion in response. Our bodies are instruments for worship, echoing the call to offer ourselves wholly to God."
    }
  ],
  "translatedAt": "2025-12-23T03:40:24.126Z"
}