{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 4,
  "verses": [
    {
      "pk": 3010401,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 1,
      "text": "Let a man consider us in this way: as servants of Christ and stewards of the mysteries of God.",
      "links": "<a href='/AIV/56/1/7'>Titus 1:7</a>; <a href='/AIV/60/4/10'>1 Pet. 4:10</a>",
      "comment": "Paul emphasizes the apostolic role as stewards of God's mysteries, referring especially to the sacraments and divine revelation, an idea carried through the history of the Church. The Greek 'hypēretas', for 'servant,' suggests a subordinate position under Christ."
    },
    {
      "pk": 3010402,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 2,
      "text": "Moreover, it is required of stewards that they be found faithful.",
      "links": "<a href='/AIV/42/16/10-12'>Luke 16:10-12</a>",
      "comment": "Faithfulness is the essential quality for anyone entrusted with God's mysteries, implying that leaders are held to a high standard of loyalty and perseverance."
    },
    {
      "pk": 3010403,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 3,
      "text": "But to me it is a very small thing that I should be judged by you or by any human court. In fact, I do not even judge myself.",
      "links": "<a href='/AIV/45/14/4'>Rom. 14:4</a>",
      "comment": "Paul stresses that ultimate judgment belongs to God alone, removing any human authority to declare final verdicts on apostolic ministry."
    },
    {
      "pk": 3010404,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 4,
      "text": "For I am not aware of anything against myself, but I am not justified by this. It is the Lord who judges me.",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/2/16'>Rom. 2:16</a>",
      "comment": "A clear distinction is drawn between personal conscience and divine judgment—justification comes only from the Lord, not our feelings or human standards."
    },
    {
      "pk": 3010405,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 5,
      "text": "Therefore, do not pronounce judgment before the time, before the Lord comes, who will bring to light the hidden things of darkness and disclose the purposes of the heart. Then each will receive his praise from God.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/45/2/16'>Rom. 2:16</a>",
      "comment": "'Before the time' references the ultimate judgment at Christ’s return. This underscores the value of patience and humility in spiritual matters, and echoes Jesus' command to refrain from judgment until all is revealed."
    },
    {
      "pk": 3010406,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 6,
      "text": "Now these things, brothers, I have applied to myself and Apollos for your sake, so that you may learn by us not to go beyond what is written, that none of you may be puffed up in favor of one against another.",
      "links": "<a href='/AIV/47/10/8'>2 Cor. 10:8</a>; <a href='/AIV/19/119/101'>Ps. 119:101</a>",
      "comment": "Paul discourages factionalism based on personal loyalties and insists nothing surpass the authority of Scripture and apostolic teaching."
    },
    {
      "pk": 3010407,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 7,
      "text": "For who makes you different from anyone else? What do you have that you did not receive? And if you received it, why do you boast as if you did not receive it?",
      "links": "<a href='/AIV/43/3/27'>John 3:27</a>",
      "comment": "Paul attacks pride in spiritual gifts, affirming all is received from God’s grace, echoing John the Baptist’s acknowledgment that a person can receive only what is given from heaven."
    },
    {
      "pk": 3010408,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 8,
      "text": "Already you are filled! Already you have become rich! Without us you have become kings! And would that you did reign, so that we might also reign with you!",
      "links": "<a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "Paul is speaking with irony to correct the Corinthians' spiritual pride. True reigning with Christ is eschatological, not yet fully realized."
    },
    {
      "pk": 3010409,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 9,
      "text": "For I think that God has exhibited us apostles as last of all, like men sentenced to death; for we have become a spectacle to the world, to angels, and to men.",
      "links": "<a href='/AIV/45/8/36'>Rom. 8:36</a>; <a href='/AIV/19/44/22'>Ps. 44:22</a>",
      "comment": "The 'spectacle' references the Roman arena, showing the suffering and humility of apostles as an example for all believers."
    },
    {
      "pk": 3010410,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 10,
      "text": "We are fools for Christ’s sake, but you are wise in Christ. We are weak, but you are strong. You are held in honor, but we in disrepute.",
      "links": "<a href='/AIV/46/1/18-25'>1 Cor. 1:18-25</a>",
      "comment": "Paul contrasts apparent earthly wisdom and the apparent foolishness of the true apostolic path, echoing 1 Cor. 1:18–25 on the wisdom of God and the cross."
    },
    {
      "pk": 3010411,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 11,
      "text": "To this very hour we go hungry and thirsty, we are poorly clothed, mistreated, and homeless;",
      "links": "<a href='/AIV/47/6/4-5'>2 Cor. 6:4-5</a>",
      "comment": "Paul catalogs the sufferings of apostles to model humility and endurance as virtues for Christian leaders."
    },
    {
      "pk": 3010412,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 12,
      "text": "And we labor, working with our own hands. When reviled, we bless; when persecuted, we endure;",
      "links": "<a href='/AIV/40/5/44'>Matt. 5:44</a>; <a href='/AIV/45/12/14'>Rom. 12:14</a>",
      "comment": "Paul highlights manual labor and non-retaliation, reflecting Jesus’ teaching on loving enemies and blessing those who persecute you."
    },
    {
      "pk": 3010413,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 13,
      "text": "When slandered, we respond kindly. We have become as the scum of the world, the refuse of all things, even until now.",
      "links": "<a href='/AIV/42/6/22'>Luke 6:22</a>",
      "comment": "Paul underscores the continuity between Christ’s own rejection and the apostolic experience. The humility and patience required for leadership in the Church is foreshadowed here."
    },
    {
      "pk": 3010414,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 14,
      "text": "I do not write these things to shame you, but to admonish you as my beloved children.",
      "links": "<a href='/AIV/47/6/13'>2 Cor. 6:13</a>",
      "comment": "Apostolic correction comes from love, not pride or malice. The spiritual parenthood of Church leaders is evident here."
    },
    {
      "pk": 3010415,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 15,
      "text": "For though you have countless guides in Christ, you do not have many fathers. For I became your father in Christ Jesus through the gospel.",
      "links": "<a href='/AIV/50/2/22'>Phil. 2:22</a>; <a href='/AIV/57/10'>Philem. 10</a>",
      "comment": "Paul asserts a unique spiritual fatherhood, linking the apostles’ role to authoritative spiritual guidance and care."
    },
    {
      "pk": 3010416,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 16,
      "text": "Therefore, I urge you, be imitators of me.",
      "links": "<a href='/AIV/46/11/1'>1 Cor. 11:1</a>; <a href='/AIV/50/3/17'>Phil. 3:17</a>",
      "comment": "Paul’s life is a model for believers; apostolic succession is hinted here, as the faithful are encouraged to imitate their spiritual shepherds."
    },
    {
      "pk": 3010417,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 17,
      "text": "For this reason I have sent Timothy to you, who is my beloved and faithful child in the Lord. He will remind you of my ways in Christ, as I teach everywhere in every church.",
      "links": "<a href='/AIV/52/3/2'>1 Thess. 3:2</a>; <a href='/AIV/54/1/2'>1 Tim. 1:2</a>",
      "comment": "This verse testifies to the missionary work and continuity of teaching across the Church, passed on through trusted disciples."
    },
    {
      "pk": 3010418,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 18,
      "text": "Some are arrogant, as though I were not coming to you.",
      "links": "<a href='/AIV/46/5/2'>1 Cor. 5:2</a>",
      "comment": "Paul confronts pride and independent attitudes, reaffirming apostolic authority in local congregations."
    },
    {
      "pk": 3010419,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 19,
      "text": "But I will come to you soon, if the Lord wills, and I will find out not the talk of these arrogant people but their power.",
      "links": "<a href='/AIV/59/4/15'>James 4:15</a>",
      "comment": "'If the Lord wills' points to submission to divine providence, a key virtue in the Christian life and leadership."
    },
    {
      "pk": 3010420,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 20,
      "text": "For the kingdom of God does not consist in talk but in power.",
      "links": "<a href='/AIV/45/14/17'>Rom. 14:17</a>",
      "comment": "Paul contrasts empty words with the true transforming power of the Holy Spirit—an emphasis on a living, effective faith."
    },
    {
      "pk": 3010421,
      "translation": "AIV",
      "book": 46,
      "chapter": 4,
      "verse": 21,
      "text": "What do you want? Shall I come to you with a rod, or with love and a gentle spirit?",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>; <a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "Paul leaves the Corinthians with a choice: correction can be severe or gentle, depending on their response—a shepherd guiding his flock."
    }
  ],
  "translatedAt": "2025-12-23T03:39:50.492Z"
}