{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 3,
  "verses": [
    {
      "pk": 2003001,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 1,
      "text": "Brothers and sisters, I could not speak to you as spiritual people, but as people of the flesh, as infants in Christ.",
      "links": "<a href='/AIV/58/5/12'>Heb. 5:12</a>; <a href='/AIV/47/1/12'>2 Cor. 1:12</a>",
      "comment": "Paul contrasts spiritual maturity with immaturity, calling the Corinthians 'infants,' highlighting their spiritual underdevelopment. This begins his admonition about divisions within the church."
    },
    {
      "pk": 2003002,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 2,
      "text": "I fed you with milk, not with solid food, for you were not ready for it. Even now you are still not ready,",
      "links": "<a href='/AIV/58/5/12-13'>Heb. 5:12–13</a>; <a href='/AIV/60/2/2'>1 Pet. 2:2</a>",
      "comment": "Paul uses 'milk' and 'solid food' as images for basic and deeper teachings. This image is also used in Hebrews and 1 Peter, pointing to the need for growth and deeper understanding."
    },
    {
      "pk": 2003003,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 3,
      "text": "for you are still of the flesh. For where there is jealousy and strife among you, are you not of the flesh and behaving in a merely human way?",
      "links": "<a href='/AIV/48/5/19-21'>Gal. 5:19–21</a>; <a href='/AIV/59/3/14-16'>Jas. 3:14-16</a>",
      "comment": "Paul defines 'flesh' as marked by envy and quarrels, which are signs of spiritual immaturity. Compare Gal. 5, where works of the flesh oppose the Spirit."
    },
    {
      "pk": 2003004,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 4,
      "text": "For when one says, 'I follow Paul,' and another, 'I follow Apollos,' are you not being merely human?",
      "links": "<a href='/AIV/46/1/12'>1 Cor. 1:12</a>; <a href='/AIV/46/4/6'>1 Cor. 4:6</a>",
      "comment": "Paul rebukes party spirit, warning against divisiveness that elevates leaders above unity in Christ. See earlier in 1 Cor. 1:12."
    },
    {
      "pk": 2003005,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 5,
      "text": "What then is Apollos? What is Paul? Servants through whom you believed, as the Lord assigned to each.",
      "links": "<a href='/AIV/47/4/5'>2 Cor. 4:5</a>",
      "comment": "Paul and Apollos are merely ministers. Faith comes through God’s action, not human leaders."
    },
    {
      "pk": 2003006,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 6,
      "text": "I planted, Apollos watered, but God gave the growth.",
      "links": "<a href='/AIV/44/18/24-28'>Acts 18:24–28</a>; <a href='/AIV/45/15/20'>Rom. 15:20</a>",
      "comment": "Paul began the church, Apollos built on his work, but only God gives life and growth. This verse encourages dependence on divine grace beyond human effort."
    },
    {
      "pk": 2003007,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 7,
      "text": "So neither he who plants nor he who waters is anything, but only God who gives the growth.",
      "links": "<a href='/AIV/46/3/6'>1 Cor. 3:6</a>",
      "comment": "Paul re-emphasizes God's sole agency in spiritual development. Christian leaders serve as God's instruments."
    },
    {
      "pk": 2003008,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 8,
      "text": "He who plants and he who waters are one, and each will receive his own reward according to his own labor.",
      "links": "<a href='/AIV/40/16/27'>Matt. 16:27</a>; <a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "Though roles differ, unity prevails. Each minister is accountable to the Lord, who rewards faithful service."
    },
    {
      "pk": 2003009,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 9,
      "text": "For we are God’s fellow-workers. You are God’s field, God’s building.",
      "links": "<a href='/AIV/46/15/10'>1 Cor. 15:10</a>; <a href='/AIV/49/2/21-22'>Eph. 2:21–22</a>",
      "comment": "Believers are both a cultivated field and a spiritual building, emphasizing both growth and stability. Spiritual leaders serve alongside God, not in place of Him."
    },
    {
      "pk": 2003010,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 10,
      "text": "According to the grace of God given to me, like a wise master builder I laid the foundation, and another builds on it. But each one must be careful how he builds.",
      "links": "<a href='/AIV/45/15/20'>Rom. 15:20</a>; <a href='/AIV/52/5/12'>1 Thess. 5:12</a>",
      "comment": "Paul identifies the specific responsibility of foundation-laying, with others continuing the work. This verse suggests apostolic foundations, on which others build, reflecting the importance of right teaching and tradition."
    },
    {
      "pk": 2003011,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 11,
      "text": "For no one can lay any foundation other than the one already laid, which is Jesus Christ.",
      "links": "<a href='/AIV/60/2/4-6'>1 Pet. 2:4–6</a>; <a href='/AIV/19/118/22'>Ps. 118:22</a>",
      "comment": "Jesus Christ is the foundation stone prophesied in Psalm 118 and fulfilled in the New Testament. The singular foundation alludes to the unity and continuity of the one Church founded on Christ."
    },
    {
      "pk": 2003012,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 12,
      "text": "If anyone builds on this foundation with gold, silver, precious stones, wood, hay, or straw,",
      "links": "<a href='/AIV/46/3/10'>1 Cor. 3:10</a>",
      "comment": "The materials symbolize the quality of doctrine or works by which the Church is built. Some interpretations see gold and precious stones as higher, durable teachings and deeds; others as lower, temporary efforts."
    },
    {
      "pk": 2003013,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 13,
      "text": "each one’s work will become clear, for the Day will show it, because it will be revealed by fire, and the fire will test the quality of each person’s work.",
      "links": "<a href='/AIV/39/3/2-3'>Mal. 3:2–3</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>",
      "comment": "God tests all deeds. The 'Day' refers to final judgment. The doctrine of fire testing works foreshadows notions of purification and accountability beyond this life ([see Mal. 3:2–3](#))."
    },
    {
      "pk": 2003014,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 14,
      "text": "If anyone’s work which he has built survives, he will receive a reward.",
      "links": "<a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "Faithful work endures and is rewarded by God. Note continuity with the theme of merit for good works."
    },
    {
      "pk": 2003015,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 15,
      "text": "If anyone’s work is burned up, he will suffer loss; but he himself will be saved, yet only as through fire.",
      "links": "<a href='/AIV/38/13/9'>Zech. 13:9</a>; <a href='/AIV/60/4/12'>1 Pet. 4:12</a>",
      "comment": "This verse uniquely refers to saved persons being purified, even with faults. The idea of post-mortem purification of the faithful through fire finds echoes in some older interpretations of the Church."
    },
    {
      "pk": 2003016,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 16,
      "text": "Do you not know that you are God’s temple and that God’s Spirit dwells in you?",
      "links": "<a href='/AIV/47/6/16'>2 Cor. 6:16</a>; <a href='/AIV/03/26/12'>Lev. 26:12</a>",
      "comment": "The collective body of believers is the temple where God’s Spirit abides, not merely individual bodies. This emphasizes the sacredness and unity of the Christian community."
    },
    {
      "pk": 2003017,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 17,
      "text": "If anyone destroys God’s temple, God will destroy him. For God’s temple is holy, and you are that temple.",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>; <a href='/AIV/40/21/12-13'>Matt. 21:12–13</a>",
      "comment": "To attack the Church or Christian community is to attack God’s holy dwelling. This demonstrates how seriously God regards unity and purity in His people."
    },
    {
      "pk": 2003018,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 18,
      "text": "Let no one deceive himself. If anyone among you thinks he is wise in this age, let him become a fool so that he may become wise.",
      "links": "<a href='/AIV/46/1/20-21'>1 Cor. 1:20–21</a>; <a href='/AIV/24/8/9'>Jer. 8:9</a>",
      "comment": "True wisdom comes by humility and submission to God, contrasting worldly and spiritual wisdom. See Paul's theme in earlier chapters."
    },
    {
      "pk": 2003019,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 19,
      "text": "For the wisdom of this world is foolishness with God. For it is written, 'He catches the wise in their craftiness.'",
      "links": "<a href='/AIV/18/5/13'>Job 5:13</a>",
      "comment": "Paul quotes Job 5:13, emphasizing the limitations and dangers of earthly wisdom versus divine wisdom."
    },
    {
      "pk": 2003020,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 20,
      "text": "And again, 'The Lord knows the thoughts of the wise, that they are futile.'",
      "links": "<a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Paul relies on Old Testament authority (Ps. 94:11) to remind believers of the futility of purely human understanding compared to revelation."
    },
    {
      "pk": 2003021,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 21,
      "text": "So let no one boast in men. For all things are yours,",
      "links": "<a href='/AIV/46/1/12-13'>1 Cor. 1:12–13</a>; <a href='/AIV/45/8/32'>Rom. 8:32</a>",
      "comment": "The emphasis is on belonging to Christ, not to human leaders. Everything is subject to the church through Christ."
    },
    {
      "pk": 2003022,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 22,
      "text": "whether Paul or Apollos or Cephas or the world or life or death or things present or things to come—all are yours,",
      "links": "<a href='/AIV/45/8/38-39'>Rom. 8:38–39</a>",
      "comment": "Paul, Apollos, and Cephas (Peter) are mentioned together, each having a role within the same Church. This highlights unity and inclusion of diversity under Christ’s lordship."
    },
    {
      "pk": 2003023,
      "translation": "AIV",
      "book": 46,
      "chapter": 3,
      "verse": 23,
      "text": "and you are Christ’s, and Christ is God’s.",
      "links": "<a href='/AIV/43/17/9-10'>John 17:9–10</a>; <a href='/AIV/15/7/23'>Ezra 7:23</a>",
      "comment": "The relationships signify order and communion in the Church's life: believers belong to Christ, and Christ to the Father, reflecting perfect unity and hierarchy, as seen in John 17’s prayer of Jesus."
    }
  ],
  "translatedAt": "2025-12-23T03:39:29.003Z"
}