{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 9,
  "verses": [
    {
      "pk": 74090001,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 1,
      "text": "Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you not my work in the Lord?",
      "links": "<a href='/AIV/44/22/14'>Acts 22:14</a>; <a href='/AIV/46/15/8'>1 Cor. 15:8</a>",
      "comment": "Paul begins with a series of rhetorical questions to assert his apostolic authority, referencing his encounter with Jesus. Seeing the risen Jesus was considered an essential qualification for apostleship (cf. Acts 22:14)."
    },
    {
      "pk": 74090002,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 2,
      "text": "If I am not an apostle to others, at least I am to you; for you are the seal of my apostleship in the Lord.",
      "links": "<a href='/AIV/47/3/2-3'>2 Cor. 3:2–3</a>",
      "comment": "The Corinthian church itself is living evidence of Paul's apostleship, as his spiritual children. The notion of a 'seal' hints at the visible sign and continuity of apostolic authority (see 2 Cor. 3:2–3)."
    },
    {
      "pk": 74090003,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 3,
      "text": "This is my defense to those who examine me:",
      "links": "<a href='/AIV/46/4/3'>1 Cor. 4:3</a>",
      "comment": "Paul makes a defense against critics questioning his rights or authority (cf. 1 Cor. 4:3)."
    },
    {
      "pk": 74090004,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 4,
      "text": "Do we not have the right to eat and drink?",
      "links": "<a href='/AIV/9/18/31'>Deut. 18:31</a>",
      "comment": "Paul refers to the apostolic right to receive material support (see also Deut. 18:31, though note that typical cross-references are Deut. 18:1–2; Num. 18:31)."
    },
    {
      "pk": 74090005,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 5,
      "text": "Do we not have the right to take along a believing wife, as the other apostles and the brothers of the Lord and Cephas?",
      "links": "<a href='/AIV/40/8/14'>Matt. 8:14</a>; <a href='/AIV/43/7/3-5'>John 7:3–5</a>",
      "comment": "Paul asserts the right to marry and travel with a believing wife as Peter (Cephas) and Jesus' brothers did (see Matt. 8:14; John 7:3–5). This affirms normalcy of marriage in apostolic ministry and the continuity with the wider tradition."
    },
    {
      "pk": 74090006,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 6,
      "text": "Or is it only Barnabas and I who lack the right to not work for a living?",
      "links": "<a href='/AIV/44/4/36-37'>Acts 4:36–37</a>",
      "comment": "Paul and Barnabas willingly forgo their rights, working to support themselves (see Acts 4:36–37 for Barnabas's background as a laborer and supporter of the church)."
    },
    {
      "pk": 74090007,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 7,
      "text": "Who ever serves as a soldier at his own expense? Who plants a vineyard and does not eat its fruit? Or who tends a flock and does not drink from the flock’s milk?",
      "links": "<a href='/AIV/5/20/6'>Deut. 20:6</a>; <a href='/AIV/43/15/2'>John 15:2</a>",
      "comment": "Paul appeals to common sense and traditional images: the worker deserves sustenance from his labor (cf. Deut. 20:6; John 15:1–2)."
    },
    {
      "pk": 74090008,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 8,
      "text": "Do I say these things only as a man, or does the Law not also say the same?",
      "links": "<a href='/AIV/45/3/19'>Rom. 3:19</a>",
      "comment": "Paul directs attention to the authority of the Mosaic Law, giving greater weight to his argument (Rom. 3:19)."
    },
    {
      "pk": 74090009,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 9,
      "text": "For it is written in the Law of Moses, 'You shall not muzzle an ox while it treads out the grain.' Is it for oxen that God is concerned?",
      "links": "<a href='/AIV/5/25/4'>Deut. 25:4</a>; <a href='/AIV/54/5/18'>1 Tim. 5:18</a>",
      "comment": "Paul quotes Deut. 25:4 and applies this law spiritually, teaching the principle that those who work in ministry deserve material support (1 Tim. 5:18)."
    },
    {
      "pk": 74090010,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 10,
      "text": "Does he not speak entirely for our sake? It was written for us, because the one who plows should plow in hope, and the one who threshes should thresh in expectation of sharing in the harvest.",
      "links": "<a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "Paul reveals the spiritual meaning underlying the law: those who minister in hope should expect support (Rom. 15:4 on scriptural instruction being for us)."
    },
    {
      "pk": 74090011,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 11,
      "text": "If we have sown spiritual things among you, is it too much if we reap material things from you?",
      "links": "<a href='/AIV/48/6/6'>Gal. 6:6</a>",
      "comment": "Paul states the principle of reciprocity: the sharing of material support in response to spiritual teaching (see Gal. 6:6)."
    },
    {
      "pk": 74090012,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 12,
      "text": "If others share this rightful claim on you, do not we even more? Nevertheless, we did not use this right, but we endure everything rather than put any obstacle in the way of the gospel of Christ.",
      "links": "<a href='/AIV/47/11/9'>2 Cor. 11:9</a>",
      "comment": "Paul and his companions forgo their legitimate rights to avoid hindering the gospel, showing exemplary self-denial (2 Cor. 11:9). This models the sacrificial ministry expected of true shepherds."
    },
    {
      "pk": 74090013,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 13,
      "text": "Do you not know that those who serve in the temple receive their food from the temple, and those who serve at the altar share in what is offered at the altar?",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>; <a href='/AIV/4/18/8-9'>Num. 18:8–9</a>",
      "comment": "Paul teaches continuity between Old Testament temple practices and New Testament ministry: just as priests received offerings, so do those who serve at the altar—an image foreshadowing the Christian minister's role."
    },
    {
      "pk": 74090014,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 14,
      "text": "In the same way, the Lord has commanded that those who proclaim the gospel should get their living by the gospel.",
      "links": "<a href='/AIV/40/10/10'>Matt. 10:10</a>; <a href='/AIV/42/10/7'>Luke 10:7</a>",
      "comment": "Jesus Himself ordained that ministers be supported by those they serve (see Matt. 10:10; Luke 10:7), showing the continuity of apostolic tradition."
    },
    {
      "pk": 74090015,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 15,
      "text": "But I have made no use of any of these rights, nor am I writing these things to secure such provision. For I would rather die than have anyone deprive me of my reason for boasting.",
      "links": "<a href='/AIV/47/11/10'>2 Cor. 11:10</a>",
      "comment": "Paul refuses material support, demonstrating his singular motive in serving Christ, not financial gain. His 'boast' is in offering the gospel freely (cf. 2 Cor. 11:10)."
    },
    {
      "pk": 74090016,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 16,
      "text": "For if I preach the gospel, I have nothing to boast of, for necessity is laid upon me. Woe to me if I do not preach the gospel!",
      "links": "<a href='/AIV/24/20/9'>Jer. 20:9</a>; <a href='/AIV/44/9/15-16'>Acts 9:15–16</a>",
      "comment": "Paul expresses a prophetic compulsion, echoing Jeremiah's call (Jer. 20:9), and the divine commission from Christ (Acts 9:15–16)."
    },
    {
      "pk": 74090017,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 17,
      "text": "For if I do this willingly, I have a reward; but if not willingly, I am entrusted with a stewardship.",
      "links": "<a href='/AIV/42/17/10'>Luke 17:10</a>",
      "comment": "The language of 'stewardship' shows that ministry is a divine assignment (cf. Luke 17:10). Here the idea of sacred trust implies the minister is fulfilling a responsibility entrusted by the Lord."
    },
    {
      "pk": 74090018,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 18,
      "text": "What then is my reward? That when I preach the gospel, I may present the gospel free of charge, so as not to make full use of my rights in the gospel.",
      "links": "<a href='/AIV/47/12/13-15'>2 Cor. 12:13–15</a>",
      "comment": "Paul's reward is found not in material benefit, but in offering the gospel freely. This anticipates the ideal of loving, sacrificial ministry (see 2 Cor. 12:13–15)."
    },
    {
      "pk": 74090019,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 19,
      "text": "For though I am free from all, I have made myself a servant to all, that I might win more of them.",
      "links": "<a href='/AIV/48/5/13'>Gal. 5:13</a>; <a href='/AIV/50/2/7'>Phil. 2:7</a>",
      "comment": "Paul echoes Christ’s own humility and self-giving love in service of others (Phil. 2:7), modeling Christian servanthood (Gal. 5:13)."
    },
    {
      "pk": 74090020,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 20,
      "text": "To the Jews I became as a Jew, in order to win Jews. To those under the law I became as one under the law—even though I myself am not under the law—that I might win those under the law.",
      "links": "<a href='/AIV/45/3/19'>Rom. 3:19</a>",
      "comment": "Paul’s adaptability in mission echoes Christ’s incarnation—entering into people’s condition to bring salvation. Being ‘under the law’ refers to the Mosaic regulations (cf. Rom. 3:19)."
    },
    {
      "pk": 74090021,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 21,
      "text": "To those outside the law I became as one outside the law—not being without law toward God but under law toward Christ—that I might win those outside the law.",
      "links": "<a href='/AIV/45/8/2'>Rom. 8:2</a>; <a href='/AIV/48/6/2'>Gal. 6:2</a>",
      "comment": "Paul makes clear he is not lawless but lives under the 'law of Christ'—the higher law of love (Gal. 6:2; Rom. 8:2)."
    },
    {
      "pk": 74090022,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 22,
      "text": "To the weak I became weak, that I might win the weak. I have become all things to all men, so that by all means I might save some.",
      "links": "<a href='/AIV/45/15/1'>Rom. 15:1</a>",
      "comment": "Paul’s identification with the weak foreshadows Christ’s self-lowering (cf. Rom. 15:1), and the Church’s ongoing mission to meet people where they are for their salvation."
    },
    {
      "pk": 74090023,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 23,
      "text": "Now I do all things for the sake of the gospel, so that I may share with others in its blessings.",
      "links": "<a href='/AIV/50/1/7'>Phil. 1:7</a>",
      "comment": "Paul emphasizes the communal nature of salvation—sharing in the blessings of the gospel together. This unity in blessing finds spiritual fulfillment in the Church’s sacramental life (see Phil. 1:7)."
    },
    {
      "pk": 74090024,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 24,
      "text": "Do you not know that those who run in a race all run, but only one receives the prize? So run, that you may obtain it.",
      "links": "<a href='/AIV/50/3/13-14'>Phil. 3:13–14</a>; <a href='/AIV/58/12/1'>Heb. 12:1</a>",
      "comment": "Salvation involves a lifelong pursuit, echoing perseverance in faith and good works (Phil. 3:13–14; Heb. 12:1)."
    },
    {
      "pk": 74090025,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 25,
      "text": "Everyone who competes in the games exercises self-control in all things. They do it to receive a perishable wreath, but we do it for an imperishable crown.",
      "links": "<a href='/AIV/55/4/8'>2 Tim. 4:8</a>; <a href='/AIV/60/5/4'>1 Pet. 5:4</a>",
      "comment": "Paul compares Christian perseverance to athletic discipline, but with an eternal reward (2 Tim. 4:8; 1 Pet. 5:4). The imperishable crown alludes to salvation as a gift and a prize."
    },
    {
      "pk": 74090026,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 26,
      "text": "So I do not run aimlessly; I do not box as one beating the air.",
      "links": "<a href='/AIV/50/2/16'>Phil. 2:16</a>",
      "comment": "Paul insists upon intentionality and purpose in the Christian life. He avoids wasted effort by staying focused on the mission entrusted to him (Phil. 2:16)."
    },
    {
      "pk": 74090027,
      "translation": "AIV",
      "book": 46,
      "chapter": 9,
      "verse": 27,
      "text": "But I discipline my body and keep it under control, so that, after preaching to others, I myself will not be disqualified.",
      "links": "<a href='/AIV/50/2/12'>Phil. 2:12</a>; <a href='/AIV/58/4/1'>Heb. 4:1</a>",
      "comment": "Paul warns that even an apostle is not immune to falling away, stressing the necessity of self-discipline and perseverance. This persistent effort in faith and works resonates with historic teaching that salvation requires cooperation with grace (Phil. 2:12; Heb. 4:1)."
    }
  ],
  "translatedAt": "2025-12-23T03:41:53.015Z"
}