{
  "book": 53,
  "bookName": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 9,
  "verses": [
    {
      "pk": 53009001,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 1,
      "text": "Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you not my work in the Lord?",
      "links": "<a href='/AIV/44/9/3-5'>Acts 9:3-5</a>; <a href='/AIV/46/15/8'>1 Cor. 15:8</a>",
      "comment": "Paul begins by asserting his apostolic authority and reminds them he has personally seen the risen Jesus, a requirement for apostleship. His claim is both literal (witness to Christ) and spiritual (appointed authority)."
    },
    {
      "pk": 53009002,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 2,
      "text": "If I am not an apostle to others, at least I am to you. For you are the seal of my apostleship in the Lord.",
      "links": "<a href='/AIV/47/3/2'>2 Cor. 3:2</a>",
      "comment": "Paul points out the Corinthians themselves are evidence of his mission—his spiritual children. Authority in the church is confirmed by visible fruit among believers."
    },
    {
      "pk": 53009003,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 3,
      "text": "This is my defense to those who examine me:",
      "links": "",
      "comment": "Paul anticipates criticism, reinforcing the ordered nature of church leadership and discipline."
    },
    {
      "pk": 53009004,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 4,
      "text": "Do we not have the right to eat and drink?",
      "links": "<a href='/AIV/40/10/10'>Matt. 10:10</a>",
      "comment": "Paul underlines the right of apostles (and by implication, ministers) to receive material support from believers, showing the value of providing for those who serve the faith."
    },
    {
      "pk": 53009005,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 5,
      "text": "Do we not have the right to take along a believing wife, as the other apostles do, and the brothers of the Lord, and Cephas?",
      "links": "<a href='/AIV/40/8/14'>Matt. 8:14</a>; <a href='/AIV/43/7/5'>John 7:5</a>",
      "comment": "Paul mentions the right to marry and travel with believing wives—a hint of the diversity of lifestyles among church leaders, suggesting that pastoral life and family are not opposed."
    },
    {
      "pk": 53009006,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 6,
      "text": "Or is it only Barnabas and I who have no right to refrain from working?",
      "links": "<a href='/AIV/44/4/36-37'>Acts 4:36-37</a>",
      "comment": "Paul raises the question of bi-vocational ministry, yet suggests apostles are entitled to full-time ministry supported by the faithful."
    },
    {
      "pk": 53009007,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 7,
      "text": "Who at any time serves as a soldier at his own expense? Who plants a vineyard and does not eat its fruit? Or who tends a flock and does not drink of the herd's milk?",
      "links": "<a href='/AIV/05/20/6'>Deut. 20:6</a>; <a href='/AIV/43/21/15-17'>John 21:15-17</a>",
      "comment": "Paul uses everyday analogies to show that it is natural to receive support for service, pointing to the wisdom of God's order for caring for ministers."
    },
    {
      "pk": 53009008,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 8,
      "text": "Am I speaking these things according to human judgment, or does the Law not say the same also?",
      "links": "<a href='/AIV/05/25/4'>Deut. 25:4</a>",
      "comment": "He appeals not just to reason, but to Scriptural authority, asserting continuity between Old Testament Law and New Testament practice."
    },
    {
      "pk": 53009009,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 9,
      "text": "For it is written in the Law of Moses: 'You shall not muzzle an ox while it treads out the grain.' Is God concerned about oxen,",
      "links": "<a href='/AIV/05/25/4'>Deut. 25:4</a>; <a href='/AIV/54/5/18'>1 Tim. 5:18</a>",
      "comment": "The Old Testament law points to the underlying principle of justice, not just literal animals. Early church fathers saw many such laws as carrying spiritual meaning."
    },
    {
      "pk": 53009010,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 10,
      "text": "or does He speak altogether for our sake? Yes, for our sake it was written, because the plowman ought to plow in hope, and the thresher to thresh in hope of sharing the crop.",
      "links": "<a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "This spiritual interpretation links Old and New Covenants, showing how physical laws point to spiritual realities in the church's ministry."
    },
    {
      "pk": 53009011,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 11,
      "text": "If we have sown spiritual things among you, is it too much if we reap material things from you?",
      "links": "<a href='/AIV/45/15/27'>Rom. 15:27</a>",
      "comment": "Paul emphasizes the unity and reciprocity between the spiritual leaders and the local believers—a model of sharing that continues to define the church."
    },
    {
      "pk": 53009012,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 12,
      "text": "If others share this rightful claim on you, do not we even more? Nevertheless we have not made use of this right, but we endure everything so as not to put any obstacle in the way of the gospel of Christ.",
      "links": "<a href='/AIV/47/11/9'>2 Cor. 11:9</a>",
      "comment": "Paul forgoes his rightful support, highlighting the sacrificial nature of ministry—a Christlike model of self-giving for the good of others."
    },
    {
      "pk": 53009013,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 13,
      "text": "Do you not know that those who work in the temple eat food from the temple, and those who serve at the altar share in what is sacrificed at the altar?",
      "links": "<a href='/AIV/03/6/16-18'>Lev. 6:16-18</a>; <a href='/AIV/04/18/8-11'>Num. 18:8-11</a>",
      "comment": "Paul draws a parallel between Old Testament priestly service and those ministering in the new covenant, supporting the practice of supporting those set apart for sacred ministry."
    },
    {
      "pk": 53009014,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 14,
      "text": "In the same way, the Lord commanded that those who proclaim the gospel should get their living by the gospel.",
      "links": "<a href='/AIV/40/10/10'>Matt. 10:10</a>; <a href='/AIV/42/10/7'>Luke 10:7</a>",
      "comment": "This command from Christ ties the authority of apostolic ministry to a divinely established order—a sign of an orderly, visible church structure rooted in divine command."
    },
    {
      "pk": 53009015,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 15,
      "text": "But I have used none of these rights, nor have I written these things so that it would be done in my case; for I would rather die than have anyone deprive me of my reason for boasting.",
      "links": "<a href='/AIV/47/11/9'>2 Cor. 11:9</a>",
      "comment": "Paul’s example encourages sacrificial giving and humility—an ideal of ministry that is both deeply Christological and communal."
    },
    {
      "pk": 53009016,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 16,
      "text": "For if I preach the gospel, I have nothing to boast of, for necessity is laid upon me; woe to me if I do not preach the gospel!",
      "links": "<a href='/AIV/40/28/19'>Matt. 28:19</a>; <a href='/AIV/44/9/15'>Acts 9:15</a>",
      "comment": "Paul’s call is divine compulsion. This echoes many OT prophets sent by God (e.g., Jeremiah), showing the continuity of God's calling of messengers."
    },
    {
      "pk": 53009017,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 17,
      "text": "For if I do this of my own will, I have a reward; but if against my will, I have been entrusted with a stewardship.",
      "links": "<a href='/AIV/42/12/48'>Luke 12:48</a>; <a href='/AIV/46/4/1'>1 Cor. 4:1</a>",
      "comment": "Paul’s ministry is a stewardship, not a personal project—the sacred trust of transmitting the gospel with fidelity."
    },
    {
      "pk": 53009018,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 18,
      "text": "What then is my reward? That in preaching the gospel I may offer it free of charge, so as not to use up my full rights in the gospel.",
      "links": "<a href='/AIV/47/11/7'>2 Cor. 11:7</a>",
      "comment": "Paul highlights voluntary poverty for the sake of the gospel—a powerful witness of holiness and detachment from worldly gain."
    },
    {
      "pk": 53009019,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 19,
      "text": "For though I am free from all, I have made myself a servant to all, that I might win more of them.",
      "links": "<a href='/AIV/45/1/14'>Rom. 1:14</a>; <a href='/AIV/48/5/13'>Gal. 5:13</a>",
      "comment": "This imitation of Christ (see Phil. 2:7) points to spiritual leadership through humble service, a model for all church leaders."
    },
    {
      "pk": 53009020,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 20,
      "text": "To the Jews I became as a Jew, in order to win Jews; to those under the Law I became as one under the Law—though I myself am not under the Law—that I might win those under the Law.",
      "links": "<a href='/AIV/44/21/20-26'>Acts 21:20-26</a>",
      "comment": "Paul's flexibility in method shows an incarnational approach to evangelism—meeting people where they are, a pattern seen in the Incarnation itself."
    },
    {
      "pk": 53009021,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 21,
      "text": "To those without the Law I became as one without the Law (though I am not without the law of God but under the law of Christ), that I might win those without the Law.",
      "links": "<a href='/AIV/48/6/2'>Gal. 6:2</a>",
      "comment": "Paul places himself under the 'law of Christ'—a phrase signifying Christ’s commands as the new Torah, fulfilled in love (John 13:34)."
    },
    {
      "pk": 53009022,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 22,
      "text": "To the weak I became weak, that I might win the weak; I have become all things to all people, that by all means I might save some.",
      "links": "<a href='/AIV/45/14/1'>Rom. 14:1</a>; <a href='/AIV/46/8/9'>1 Cor. 8:9</a>",
      "comment": "Paul shows the church's mission: to meet people in their weakness and draw them into the fullness of Christ."
    },
    {
      "pk": 53009023,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 23,
      "text": "I do it all for the sake of the gospel, so that I may become a partner in its blessings.",
      "links": "<a href='/AIV/45/15/27'>Rom. 15:27</a>",
      "comment": "Paul’s desire is not just to preach but to truly share in the life of the gospel—an echo of participation in the mysteries (sacraments) that unite believers."
    },
    {
      "pk": 53009024,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 24,
      "text": "Do you not know that in a race all the runners run, but only one receives the prize? Run in such a way that you may win.",
      "links": "<a href='/AIV/50/3/14'>Phil. 3:14</a>; <a href='/AIV/58/12/1'>Heb. 12:1</a>",
      "comment": "Paul uses the imagery of athletic discipline—reminding believers of the need for perseverance and intentional striving for holiness."
    },
    {
      "pk": 53009025,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 25,
      "text": "Every athlete exercises self-control in all things. They do it to receive a perishable crown, but we an imperishable.",
      "links": "<a href='/AIV/55/4/8'>2 Tim. 4:8</a>; <a href='/AIV/60/5/4'>1 Pet. 5:4</a>",
      "comment": "The 'imperishable crown' is a symbol of eternal life, highlighting that Christian self-discipline is oriented toward supernatural reward."
    },
    {
      "pk": 53009026,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 26,
      "text": "So I do not run aimlessly; I do not box as one beating the air.",
      "links": "<a href='/AIV/50/2/16'>Phil. 2:16</a>",
      "comment": "Paul’s disciplined approach is meant to be imitated—living purposefully, striving for unity with Christ and the ultimate prize."
    },
    {
      "pk": 53009027,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 9,
      "verse": 27,
      "text": "But I discipline my body and keep it under control, lest after preaching to others I myself should be disqualified.",
      "links": "<a href='/AIV/50/2/12'>Phil. 2:12</a>; <a href='/AIV/40/24/13'>Matt. 24:13</a>",
      "comment": "Paul teaches that self-mastery is essential for all Christians. Even apostles must persevere to the end, as assurance does not exclude the need for continued faith and obedience."
    }
  ],
  "translatedAt": "2025-12-24T11:48:04.406Z"
}