{
  "book": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 10,
  "verses": [
    {
      "pk": 1932501,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 1,
      "text": "Brothers, I do not want you to be unaware that all our fathers were under the cloud, and all passed through the sea;",
      "links": "<a href='/AIV/2/13/21'>Exod. 13:21</a>; <a href='/AIV/2/14/22'>Exod. 14:22</a>",
      "comment": "Paul refers to Israel's journey out of Egypt as a warning for Christians. The 'cloud' and 'sea' represent God's saving and guiding presence—foreshadowing the sacraments and Christ's deliverance."
    },
    {
      "pk": 1932502,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 2,
      "text": "and all were baptized into Moses in the cloud and in the sea;",
      "links": "<a href='/AIV/2/14/29-31'>Exod. 14:29-31</a>",
      "comment": "Paul describes Israel’s passing through the sea as a kind of ‘baptism’—a symbol fulfilled in Christian baptism, where new believers are united with Christ through water."
    },
    {
      "pk": 1932503,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 3,
      "text": "and all ate the same spiritual food,",
      "links": "<a href='/AIV/2/16/4'>Exod. 16:4</a>; <a href='/AIV/19/78/24-25'>Ps. 78:24-25</a>",
      "comment": "‘Spiritual food’ refers to manna from heaven, prefiguring the true bread from heaven—Christ Himself (cf. John 6:31–33)."
    },
    {
      "pk": 1932504,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 4,
      "text": "and all drank the same spiritual drink. For they drank from the spiritual rock that followed them, and the rock was Christ.",
      "links": "<a href='/AIV/2/17/6'>Exod. 17:6</a>; <a href='/AIV/4/20/11'>Num. 20:11</a>; <a href='/AIV/43/7/37-38'>John 7:37-38</a>",
      "comment": "Paul applies a spiritual meaning to the water from the rock, identifying the Rock with Christ—showing His presence with God’s people and hinting at His ongoing presence in the sacraments."
    },
    {
      "pk": 1932505,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 5,
      "text": "Nevertheless, with most of them God was not pleased, for they were struck down in the wilderness.",
      "links": "<a href='/AIV/4/14/29-35'>Num. 14:29-35</a>",
      "comment": "Despite receiving these blessings, many Israelites fell due to disobedience—serving as a warning that spiritual privilege does not guarantee salvation without perseverance in faith and obedience."
    },
    {
      "pk": 1932506,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 6,
      "text": "Now these things took place as examples for us, so that we would not desire evil as they did.",
      "links": "<a href='/AIV/4/11/4-6'>Num. 11:4-6</a>",
      "comment": "Paul teaches the value of biblical history as moral lessons for the Church. The stories are types and warnings for Christians to avoid repeating Israel's mistakes."
    },
    {
      "pk": 1932507,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 7,
      "text": "Do not be idolaters as some of them were, as it is written: 'The people sat down to eat and drink and rose up to play.'",
      "links": "<a href='/AIV/2/32/6'>Exod. 32:6</a>",
      "comment": "Paul quotes the aftermath of the golden calf incident, warning against blending worship of God with idolatry and immorality."
    },
    {
      "pk": 1932508,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 8,
      "text": "Nor let us commit sexual immorality, as some of them did, and twenty-three thousand fell in a single day.",
      "links": "<a href='/AIV/4/25/1-9'>Num. 25:1-9</a>",
      "comment": "Reference to Israel’s sin with the Moabite women and Baal of Peor. Paul shows God’s judgment on immorality, and the call to holiness for believers."
    },
    {
      "pk": 1932509,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 9,
      "text": "Nor let us test Christ, as some of them did, and were destroyed by serpents.",
      "links": "<a href='/AIV/4/21/5-9'>Num. 21:5-9</a>; <a href='/AIV/43/3/14-15'>John 3:14-15</a>",
      "comment": "Paul says, 'test Christ,' underlining Christ’s pre-existence and role in the Old Testament. The bronze serpent in Numbers foreshadows Christ’s crucifixion."
    },
    {
      "pk": 1932510,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 10,
      "text": "Nor grumble, as some of them did, and were destroyed by the destroyer.",
      "links": "<a href='/AIV/4/16/41-49'>Num. 16:41-49</a>",
      "comment": "Grumbling represents rebellion against God’s appointed leaders. Paul applies this to spiritual authority and unity in the Church."
    },
    {
      "pk": 1932511,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 11,
      "text": "Now these things happened to them as examples, and they were written down for our instruction, on whom the ends of the ages have come.",
      "links": "<a href='/AIV/45/15/4'>Rom. 15:4</a>",
      "comment": "Paul affirms the Old Testament’s relevance and its meaning fulfilled in Christ, for the Church as it approaches the culmination of salvation history."
    },
    {
      "pk": 1932512,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 12,
      "text": "Therefore, let the one who thinks he stands be careful that he does not fall.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "Humility is required. Overconfidence leads to spiritual downfall; true security comes from remaining within Christ’s grace."
    },
    {
      "pk": 1932513,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 13,
      "text": "No temptation has overtaken you except what is common to man. God is faithful, and He will not let you be tempted beyond your ability, but with the temptation will also provide the way of escape, that you may be able to endure it.",
      "links": "<a href='/AIV/58/2/18'>Heb. 2:18</a>; <a href='/AIV/59/1/12'>James 1:12</a>",
      "comment": "A comforting assurance: God’s grace enables perseverance and victory over temptation. Cooperation with grace is key (cf. Phil. 2:12-13)."
    },
    {
      "pk": 1932514,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 14,
      "text": "Therefore, my beloved, flee from idolatry.",
      "links": "<a href='/AIV/46/6/18'>1 Cor. 6:18</a>; <a href='/AIV/62/5/21'>1 John 5:21</a>",
      "comment": "Paul commands decisiveness in avoiding idolatry; the Church must separate from pagan rituals and cling to Christ alone."
    },
    {
      "pk": 1932515,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 15,
      "text": "I speak as to sensible people; judge for yourselves what I say.",
      "links": "",
      "comment": "Paul appeals to reason and discernment among mature believers. The faith uses both Scripture and reason."
    },
    {
      "pk": 1932516,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 16,
      "text": "The cup of blessing that we bless, is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ?",
      "links": "<a href='/AIV/42/22/19-20'>Luke 22:19-20</a>; <a href='/AIV/46/11/23-26'>1 Cor. 11:23-26</a>",
      "comment": "Here Paul describes the Eucharist as real participation (Greek: koinonia) in Christ’s body and blood, not just symbols—supporting a more sacramental understanding."
    },
    {
      "pk": 1932517,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 17,
      "text": "Because there is one bread, we who are many are one body; for we all partake of the one bread.",
      "links": "<a href='/AIV/12/4/43'>2 Kings 4:43</a>; <a href='/AIV/46/12/12-13'>1 Cor. 12:12-13</a>",
      "comment": "Unity through sacramental participation. The Church’s unity is not just spiritual but established and expressed through the Eucharist."
    },
    {
      "pk": 1932518,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 18,
      "text": "Consider the people of Israel: Are not those who eat the sacrifices partners in the altar?",
      "links": "<a href='/AIV/3/7/15-18'>Lev. 7:15-18</a>",
      "comment": "Participation in sacrifices meant real communion with the altar. So too with the new covenant altar: communion with Christ's sacrifice."
    },
    {
      "pk": 1932519,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 19,
      "text": "What do I mean then? That what is offered to idols is anything, or that an idol is anything?",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>",
      "comment": "Paul does not suggest idols have real power; yet, participation in their rites can entangle people in spiritual dangers."
    },
    {
      "pk": 1932520,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 20,
      "text": "No, but the things that the Gentiles sacrifice, they sacrifice to demons and not to God; and I do not want you to be partners with demons.",
      "links": "<a href='/AIV/5/32/17'>Deut. 32:17</a>",
      "comment": "Offering to idols amounts to sacrificing to demons behind the idols—clear division between true worship and false, highlighting need for spiritual discernment and pure worship."
    },
    {
      "pk": 1932521,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 21,
      "text": "You cannot drink the cup of the Lord and the cup of demons; you cannot partake of the table of the Lord and the table of demons.",
      "links": "<a href='/AIV/5/16/21-22'>Deut. 16:21-22</a>",
      "comment": "Paul insists on exclusive loyalty in worship and sacramental life. To mix the two is spiritual adultery."
    },
    {
      "pk": 1932522,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 22,
      "text": "Or do we provoke the Lord to jealousy? Are we stronger than He?",
      "links": "<a href='/AIV/5/4/24'>Deut. 4:24</a>",
      "comment": "Reference to God as 'jealous,' asserting fidelity is necessary—echoes covenant themes and points to the Church as Christ's bride."
    },
    {
      "pk": 1932523,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 23,
      "text": "'All things are lawful,' but not all things are beneficial. 'All things are lawful,' but not all things build up.",
      "links": "<a href='/AIV/46/6/12'>1 Cor. 6:12</a>",
      "comment": "Paul distinguishes between mere permission and true spiritual benefit—growth in charity and upbuilding of the Church community is prioritized."
    },
    {
      "pk": 1932524,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 24,
      "text": "Let no one seek his own good, but rather the good of his neighbor.",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/50/2/3-4'>Phil. 2:3-4</a>",
      "comment": "This command encapsulates Christian love—charity toward others over selfish liberty is the highest Christian ethic."
    },
    {
      "pk": 1932525,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 25,
      "text": "Eat whatever is sold in the marketplace without raising any question for the sake of conscience,",
      "links": "",
      "comment": "Paul allows for liberty in matters not involving idolatry directly, showing the Church’s pastoral wisdom in non-essential matters."
    },
    {
      "pk": 1932526,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 26,
      "text": "for 'the earth is the Lord’s and the fullness thereof.'",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "All creation belongs to God—food is morally neutral by itself."
    },
    {
      "pk": 1932527,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 27,
      "text": "If one of the unbelievers invites you and you want to go, eat whatever is set before you, without raising any question for the sake of conscience.",
      "links": "",
      "comment": "Showing hospitality and being at peace with all, unless it risks participation in pagan worship."
    },
    {
      "pk": 1932528,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 28,
      "text": "But if someone says to you, 'This has been offered in sacrifice,' then do not eat it, for the sake of the one who informed you and for conscience’ sake.",
      "links": "",
      "comment": "Conscience includes concern for others’ faith and scandal; Christian freedom is subordinated to charity and edification of the brethren."
    },
    {
      "pk": 1932529,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 29,
      "text": "I do not mean your own conscience, but the other person’s. For why should my liberty be judged by another’s conscience?",
      "links": "",
      "comment": "Christian freedom is real, but it is limited for the sake of weaker believers, ensuring unity and holiness."
    },
    {
      "pk": 1932530,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 30,
      "text": "If I partake with thankfulness, why am I denounced because of that for which I give thanks?",
      "links": "",
      "comment": "Paul again asserts true liberty; but charity may require self-denial."
    },
    {
      "pk": 1932531,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 31,
      "text": "So, whether you eat or drink, or whatever you do, do all to the glory of God.",
      "links": "<a href='/AIV/51/3/17'>Col. 3:17</a>",
      "comment": "Every action—no matter how ordinary—can be sanctified for God’s glory, anticipating the later development of a sacramental vision of life."
    },
    {
      "pk": 1932532,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 32,
      "text": "Give no offense to Jews or to Greeks or to the church of God,",
      "links": "",
      "comment": "Paul exhorts harmony within the diverse body of the Church, prioritizing unity and charity over personal rights."
    },
    {
      "pk": 1932533,
      "translation": "AIV",
      "book": 46,
      "chapter": 10,
      "verse": 33,
      "text": "just as I try to please everyone in everything I do, not seeking my own advantage, but that of many, that they may be saved.",
      "links": "<a href='/AIV/45/15/2'>Rom. 15:2</a>",
      "comment": "Paul gives himself as an example of sacrificial love, pointing ultimately to Christ’s example and the purpose of winning souls through unity and charity."
    }
  ],
  "translatedAt": "2025-12-23T03:42:23.199Z"
}