{
  "book": 66,
  "bookName": "James",
  "bookAbbreviation": "Jas",
  "chapter": 4,
  "verses": [
    {
      "pk": 66004001,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 1,
      "text": "What causes quarrels and fights among you? Do they not come from your own desires for pleasure that wage war within you?",
      "links": "<a href='/AIV/45/7/23'>Rom. 7:23</a>; <a href='/AIV/48/5/17'>Gal. 5:17</a>",
      "comment": "James introduces moral conflict as rooted in a battle of desires within each person. This echoes Paul's teachings on internal warfare (Rom. 7:23). The focus on the inner struggle hints at the importance of spiritual discipline and self-mastery, often developed through sacramental living and prayer."
    },
    {
      "pk": 66004002,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 2,
      "text": "You desire but do not have, so you kill. You covet but cannot obtain, so you quarrel and fight. You do not have because you do not ask.",
      "links": "<a href='/AIV/19/37/4'>Ps. 37:4</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>; <a href='/AIV/62/3/15'>1 John 3:15</a>",
      "comment": "James exposes how unfulfilled desires lead to sinful actions. The mention of 'do not ask' draws attention to the power and necessity of prayer (Matt. 7:7), suggesting a deeper communion with God, cultivated through an intentional prayer life."
    },
    {
      "pk": 66004003,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 3,
      "text": "You ask and do not receive, because you ask with wrong motives, wanting to spend it on your own pleasures.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/43/16/24'>John 16:24</a>",
      "comment": "The text teaches the need for pure intentions in prayer. God responds to prayers offered with selfless motives, aligning with Jesus’ instructions (John 16:24). This underlines the significance of personal transformation and detachment from worldly desires."
    },
    {
      "pk": 66004004,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 4,
      "text": "Adulterous people! Don’t you know that friendship with the world is hostility toward God? Whoever wants to be a friend of the world becomes an enemy of God.",
      "links": "<a href='/AIV/19/73/27'>Ps. 73:27</a>; <a href='/AIV/62/2/15'>1 John 2:15</a>",
      "comment": "James uses strong language, likening worldliness to adultery, echoing the prophetic tradition (Ps. 73:27). The call to separate from worldly values points toward a deeper holiness, marked by faithful love for God, similar to the biblical marital covenant imagery."
    },
    {
      "pk": 66004005,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 5,
      "text": "Or do you think Scripture says without reason that the Spirit He caused to dwell in us longs with jealousy?",
      "links": "<a href='/AIV/19/42/1'>Ps. 42:1</a>; <a href='/AIV/02/20/5'>Ex. 20:5</a>",
      "comment": "James refers to God’s jealous longing for His people, reflecting covenant imagery (Ex. 20:5). This spiritual jealousy emphasizes the relational nature of God, desiring the full devotion of His people, and points to the Spirit’s indwelling presence."
    },
    {
      "pk": 66004006,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 6,
      "text": "But He gives greater grace. That is why Scripture says: God opposes the proud but gives grace to the humble.",
      "links": "<a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/60/5/5'>1 Pet. 5:5</a>",
      "comment": "James teaches that humility unlocks grace. This principle is drawn directly from Proverbs, and is repeated in Peter’s writings. Humility is vital for receiving God’s grace, reflected sacramentally and communally in the life of the Church."
    },
    {
      "pk": 66004007,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 7,
      "text": "So submit yourselves to God. Resist the devil, and he will flee from you.",
      "links": "<a href='/AIV/60/5/9'>1 Pet. 5:9</a>; <a href='/AIV/40/4/10'>Matt. 4:10</a>",
      "comment": "Submission to God is foundational to spiritual warfare. This reflects Jesus’ own resistance to temptation (Matt. 4:10). The implication is that spiritual authority grows through obedience and right relation to God."
    },
    {
      "pk": 66004008,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 8,
      "text": "Draw near to God, and He will draw near to you. Cleanse your hands, sinners, and purify your hearts, double-minded people.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/23/1/16'>Isa. 1:16</a>",
      "comment": "James calls for a twofold cleansing: external (hands) and internal (hearts). The pattern recalls Old Testament rituals (Ps. 24:3-4, Isa. 1:16), hinting at the importance of both moral and sacramental purification in approaching God."
    },
    {
      "pk": 66004009,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 9,
      "text": "Be distressed, mourn, and weep. Let your laughter be turned to mourning and your joy to gloom.",
      "links": "<a href='/AIV/40/5/4'>Matt. 5:4</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "Repentance is shown through sorrow for sin. Jesus commends those who mourn (Matt. 5:4), and the Psalms speak of sorrow leading to joy. The turning of hearts through contrition is essential for spiritual renewal."
    },
    {
      "pk": 66004010,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 10,
      "text": "Humble yourselves before the Lord, and He will lift you up.",
      "links": "<a href='/AIV/40/23/12'>Matt. 23:12</a>; <a href='/AIV/60/5/6'>1 Pet. 5:6</a>",
      "comment": "Humility before God brings exaltation, echoing Christ’s own teaching (Matt. 23:12). The promise of being raised up points to both spiritual elevation now and future glorification, as seen in the lives of the saints."
    },
    {
      "pk": 66004011,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 11,
      "text": "Brothers, do not speak evil against one another. Whoever speaks against a brother or judges him speaks against the law and judges the law. But if you judge the law, you are not a doer of the law but a judge.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/03/19/16'>Lev. 19:16</a>",
      "comment": "James exhorts the community to avoid slander and judgment, reminding them of Jesus’ warnings (Matt. 7:1). This underlines the need for charity and unity among believers, modeled through the pursuit of holiness together."
    },
    {
      "pk": 66004012,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 12,
      "text": "There is one Lawgiver and Judge, He who is able to save and to destroy. But who are you to judge your neighbor?",
      "links": "<a href='/AIV/40/10/28'>Matt. 10:28</a>; <a href='/AIV/45/14/4'>Rom. 14:4</a>",
      "comment": "James reaffirms God’s absolute authority as Judge, echoing Jesus’ words about God’s power (Matt. 10:28). Encouraging humility, he teaches that judgment belongs to God alone, reinforcing respect for the mystery of His mercy and justice."
    },
    {
      "pk": 66004013,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 13,
      "text": "Come now, you who say, 'Today or tomorrow we will go into this city, spend a year there, trade, and make a profit,'",
      "links": "<a href='/AIV/20/27/1'>Prov. 27:1</a>; <a href='/AIV/42/12/16-20'>Luke 12:16-20</a>",
      "comment": "James warns against human presumptions. This echoes Old Testament wisdom on the unpredictability of life (Prov. 27:1) and Jesus’ parable of the rich fool (Luke 12:16-20). The text teaches reliance on divine Providence."
    },
    {
      "pk": 66004014,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 14,
      "text": "Yet you do not know what tomorrow will bring. What is your life? You are a mist that appears for a little time and then vanishes.",
      "links": "<a href='/AIV/19/39/5'>Ps. 39:5</a>; <a href='/AIV/21/1/2'>Eccl. 1:2</a>",
      "comment": "Human life is brief and uncertain, emphasized by imagery used in the Psalms and Ecclesiastes. This encourages humility and dependence on God’s will, a key aspect of spiritual maturity."
    },
    {
      "pk": 66004015,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 15,
      "text": "Instead you should say, 'If the Lord wills, we will live and do this or that.'",
      "links": "<a href='/AIV/44/18/21'>Acts 18:21</a>; <a href='/AIV/45/1/10'>Rom. 1:10</a>",
      "comment": "James instructs believers to acknowledge divine will, mirroring the practices of the apostles (Acts 18:21). This acknowledges God’s sovereignty and aligns daily life with His guiding purpose."
    },
    {
      "pk": 66004016,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 16,
      "text": "But as it is, you boast in your arrogance. All such boasting is evil.",
      "links": "<a href='/AIV/24/9/23'>Jer. 9:23</a>; <a href='/AIV/46/3/21'>1 Cor. 3:21</a>",
      "comment": "Boasting reveals prideful independence from God, condemned in both Old and New Testaments. The Christian life is marked by humility and grace, with all virtue attributed to God’s favor."
    },
    {
      "pk": 66004017,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 4,
      "verse": 17,
      "text": "So whoever knows the right thing to do and fails to do it, for him it is sin.",
      "links": "<a href='/AIV/42/12/47'>Luke 12:47</a>; <a href='/AIV/45/14/23'>Rom. 14:23</a>",
      "comment": "James draws attention to sins of omission as well as commission. This teaching, also found in Jesus’ words (Luke 12:47), stresses the need for active participation and moral responsibility in the faith community."
    }
  ],
  "translatedAt": "2025-12-24T12:25:40.783Z"
}