{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 13,
  "verses": [
    {
      "pk": 2139001,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 1,
      "text": "In the one hundred forty-ninth year, news came to Judas and his men that Antiochus Eupator was advancing with a vast army against Judea,",
      "links": "<a href='/AIV/49/10/1'>2 Macc. 10:1</a>; <a href='/AIV/15/6/1'>Ezra 6:1</a>",
      "comment": "The historical context sets this during the Seleucid expeditions against Judea. Antiochus V Eupator reigned after Antiochus IV Epiphanes."
    },
    {
      "pk": 2139002,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 2,
      "text": "and with him was Lysias, his guardian, who acted as the supervisor of the government. Each had a Greek army numbering 110,000 foot soldiers and 5,300 cavalry, twenty-two elephants, and three hundred chariots fitted with blades.",
      "links": "<a href='/AIV/49/11/1'>2 Macc. 11:1</a>",
      "comment": "The precision about army composition reflects the seriousness of the threat. Elephants symbolize overwhelming force (cf. 1 Macc. 6:34)."
    },
    {
      "pk": 2139003,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 3,
      "text": "Menelaus also joined them, and with hypocritical flattery urged Antiochus, not for the good of his nation, but in the hope he might be appointed over the government.",
      "links": "<a href='/AIV/49/4/23'>2 Macc. 4:23</a>; <a href='/AIV/40/6/5'>Matt. 6:5</a>",
      "comment": "Menelaus, the high priest, is portrayed negatively, acting for personal gain rather than the nation—echoing themes of hypocritical leadership."
    },
    {
      "pk": 2139004,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 4,
      "text": "But the King of kings stirred up the anger of Antiochus against that traitor, and when Lysias explained that Menelaus was the cause of all evil, he commanded him to be taken to Berea and executed according to their local custom.",
      "links": "<a href='/AIV/27/4/37'>Dan. 4:37</a>;<a href='/AIV/49/7/33'>2 Macc. 7:33</a>",
      "comment": "'King of kings'—a title ascribed to God—shows Providential sovereignty over earthly kings (see also Daniel 2:37)."
    },
    {
      "pk": 2139005,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 5,
      "text": "In that place, the custom is for a man guilty of sacrilege to be thrown from a tower filled with ashes, and as he sinks into them on all sides, he is suffocated.",
      "links": "<a href='/AIV/49/4/39'>2 Macc. 4:39</a>",
      "comment": "Menelaus's punishment for sacrilege fulfills earlier warnings against corrupt religious leaders, reinforcing reverence for sacred worship."
    },
    {
      "pk": 2139006,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 6,
      "text": "Thus the lawbreaker met a fitting death, and with the very dust heaped upon the altar, he was laid to rest.",
      "links": "<a href='/AIV/49/4/41'>2 Macc. 4:41</a>;<a href='/AIV/2/32/20'>Deut. 32:20</a>",
      "comment": "Menelaus’s fate contrasts earthly power with divine justice. Spiritual: Sacred things should not be profaned; literal: his death is poetic justice."
    },
    {
      "pk": 2139007,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 7,
      "text": "And the law had its triumph over the wicked.",
      "links": "<a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "Displays the victory of God's justice—see also James 4:6; humility is exalted, the proud laid low."
    },
    {
      "pk": 2139008,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 8,
      "text": "Now Antiochus, with an ever more intense hatred for the Jews, marched on, aiming to deal more cruelly with them than his father had.",
      "links": "<a href='/AIV/49/7/2'>2 Macc. 7:2</a>",
      "comment": "Antiochus’s malice references earlier persecutions. The persistence of suffering often precedes God's vindication."
    },
    {
      "pk": 2139009,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 9,
      "text": "When Judas learned of this, he ordered the people to call upon the Lord day and night, that He would now, if ever, come to their aid, preserving their Law and His holy Temple, and not let those who had only recently returned be again handed over to blasphemous nations.",
      "links": "<a href='/AIV/19/44/23-26'>Ps. 44:23-26</a>; <a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "Emphasizes the power of continual, communal prayer in the face of persecution. (See Acts 12:5; note importance of intercessory prayer.)"
    },
    {
      "pk": 2139010,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 10,
      "text": "After widespread fasting and lying in sackcloth and ashes, they stretched their hands toward heaven, imploring the Lord to show mercy.",
      "links": "<a href='/AIV/19/35/13'>Ps. 35:13</a>; <a href='/AIV/32/3/5-9'>Jonah 3:5-9</a>",
      "comment": "The posture and acts of repentance echo numerous Old Testament fasts; links to the New Testament (Joel 2:12–13, Matt. 6:17–18) on the value of physical expressions of repentance."
    },
    {
      "pk": 2139011,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 11,
      "text": "Judas himself exhorted everyone, both privately and publicly, not to lose hope in God's help but to remember the past deliverances He had given, how they had escaped overwhelming multitudes.",
      "links": "<a href='/AIV/2/14/13'>Ex. 14:13</a>; <a href='/AIV/7/7/7'>Judg. 7:7</a>",
      "comment": "Remembrance of God's prior acts bolsters current faith; patterns seen in Psalm 77:11-12. Encourages confidence in God's faithfulness."
    },
    {
      "pk": 2139012,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 12,
      "text": "He assured them that if they remained steadfast in the Law, the Lord would mercifully shield them from the enemy.",
      "links": "<a href='/AIV/2/23/22'>Ex. 23:22</a>; <a href='/AIV/19/91/1-4'>Ps. 91:1-4</a>",
      "comment": "Faithfulness to God's commandments brings divine protection—see John 14:15, 'If you love me, keep my commandments.'"
    },
    {
      "pk": 2139013,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 13,
      "text": "After the Maccabees armed their men and divided them into units, Judas urged them continually to trust in God and to fight bravely for the Temple, the city, and their ancestral way of life. Then he camped near Modein.",
      "links": "<a href='/AIV/50/1/13'>Phil. 1:13</a>",
      "comment": "Physical and spiritual preparation go hand in hand. The defense of sacred tradition and worship is underscored."
    },
    {
      "pk": 2139014,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 14,
      "text": "Giving his men the password, 'Victory is God's', Judas then chose the bravest young men, attacked the royal camp at night, and killed six hundred men.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16-22</a>",
      "comment": "'Victory is God's'—an echo of Israelite battle cries highlighting faith that deliverance belongs to the Lord (see 1 Sam. 17:47)."
    },
    {
      "pk": 2139015,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 15,
      "text": "They also wounded the leading elephant handler and forced the army into panic and confusion.",
      "links": "<a href='/AIV/49/11/4'>2 Macc. 11:4</a>",
      "comment": "Small numbers effect great fear among larger armies—cf. 2 Chr. 20:15, Zech. 4:6."
    },
    {
      "pk": 2139016,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 16,
      "text": "Full of courage because of the Lord’s protection, Judas’s men returned after daybreak with joy.",
      "links": "<a href='/AIV/19/126/3'>Ps. 126:3</a>",
      "comment": "Experiencing God’s protection inspires joy—see also Luke 10:17."
    },
    {
      "pk": 2139017,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 17,
      "text": "Now, because the king had learned that the Jews had accomplished these things by divine will, he tried different strategies against their strongholds.",
      "links": "<a href='/AIV/49/5/20'>2 Macc. 5:20</a>",
      "comment": "Even the enemy begins to acknowledge the hand of God. Echoes Pharaoh in Exodus 8:19."
    },
    {
      "pk": 2139018,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 18,
      "text": "He marched against Beth-zur, a well-fortified Jewish stronghold, but was repeatedly driven back, failing to win any advantage.",
      "links": "<a href='/AIV/6/15/58'>Josh. 15:58</a>; <a href='/AIV/13/11/7'>1 Chr. 11:7</a>",
      "comment": "The futility of human might when set against God’s chosen people is highlighted."
    },
    {
      "pk": 2139019,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 19,
      "text": "Judas sent the necessary supplies to the garrison inside.",
      "links": "<a href='/AIV/49/12/36'>2 Macc. 12:36</a>",
      "comment": "Logistics and care for the defending remnant recalls Neh. 4:16—God’s work involves order and charity in action."
    },
    {
      "pk": 2139020,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 20,
      "text": "But one of the king's men, named Rhodocus, betrayed the Jews; he was detected, arrested, and put into custody.",
      "links": "<a href='/AIV/49/10/13'>2 Macc. 10:13</a>",
      "comment": "Internal betrayal hampers God’s people more than external threats—cf. Judas Iscariot in John 13:2."
    },
    {
      "pk": 2139021,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 21,
      "text": "The king again negotiated with the defenders at Beth-zur, made peace, and withdrew, marching against Judas and his men. He was defeated,",
      "links": "<a href='/AIV/49/12/11'>2 Macc. 12:11</a>",
      "comment": "King’s repeated change of tactics shows divine frustration of his plans—see Psalm 2:1-4."
    },
    {
      "pk": 2139022,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 22,
      "text": "learning that Philip, whom he had left in Antioch to govern, was planning a revolt. Fearful, he hurriedly made peace with the Jews, submitted to their terms, and gave oaths to respect their rights.",
      "links": "<a href='/AIV/49/10/11'>2 Macc. 10:11</a>",
      "comment": "God’s providence is seen in the enemy’s internal strife forcing withdrawal, as often happens in salvation history."
    },
    {
      "pk": 2139023,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 23,
      "text": "He made offerings, honored the Temple, and generously showed respect to the sanctuary.",
      "links": "<a href='/AIV/16/6/10'>Neh. 6:10</a>; <a href='/AIV/49/3/2'>2 Macc. 3:2</a>",
      "comment": "Enemy reverence toward the Temple fulfills Isaiah 60:14, foreshadowing a time when all nations honor God's house."
    },
    {
      "pk": 2139024,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 24,
      "text": "He welcomed Maccabeus, left Hegemonides as governor from Ptolemais to Gerar, and then returned to Antioch.",
      "links": "<a href='/AIV/49/10/39'>2 Macc. 10:39</a>",
      "comment": "Hegemonides, a Seleucid appointee, maintains order. The text emphasizes how political situations are influenced by divine action."
    },
    {
      "pk": 2139025,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 25,
      "text": "The king, troubled by what had happened, was often defeated in his plans.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Frustration of wicked plans is a principle seen repeatedly (cf. Prov. 19:21, James 4:15)."
    },
    {
      "pk": 2139026,
      "translation": "AIV",
      "book": 49,
      "chapter": 13,
      "verse": 26,
      "text": "So everything turned out in this expedition of the king.",
      "links": "<a href='/AIV/49/10/8'>2 Macc. 10:8</a>",
      "comment": "This closing summary recalls the biblical theme of God’s ultimate sovereignty over human history (cf. Daniel 4:35). The passage invites reflection on the role of prayer, tradition, and the visible, sacramental defense of the faith—a lesson believers still learn today."
    }
  ],
  "translatedAt": "2025-12-23T09:40:18.530Z"
}