{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 4,
  "verses": [
    {
      "pk": 240401,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 1,
      "text": "The previously mentioned Simon, who was denounced for controlling the money of the temple, slandered Onias, saying he was the one who incited Heliodorus and was the cause of this disaster.",
      "links": "<a href='/AIV/15/3/25'>2 Macc. 3:25</a>; <a href='/AIV/15/3/28'>2 Macc. 3:28</a>",
      "comment": "Slander and false accusation of the high priest resemble the opposition righteous leaders often face. See parallels: <a href='/AIV/19/35/11'>Ps. 35:11</a>."
    },
    {
      "pk": 240402,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 2,
      "text": "He dared to call Onias a traitor to the kingdom because he loved the city, cared for the people, and was devoted to the laws.",
      "links": "<a href='/AIV/15/3/1'>2 Macc. 3:1</a>",
      "comment": "Here, true loyalty to God’s law is falsely branded as treason—a frequent trial of prophets and saints."
    },
    {
      "pk": 240403,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 3,
      "text": "Such hostility grew that even some of Simon’s friends fell victim to violence.",
      "links": "",
      "comment": "Divisions among believers often lead to suffering, foreshadowing Christ’s call for unity among His followers."
    },
    {
      "pk": 240404,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 4,
      "text": "When Onias saw that the conflict was dangerous and that Apollonius, the governor of Coele-Syria and Phoenicia, was part of Simon’s malice, he went to the king, not to accuse his people, but to uphold the common good, both privately and publicly.",
      "links": "<a href='/AIV/15/3/5'>2 Macc. 3:5</a>",
      "comment": "Onias’ actions highlight the primacy of peace and justice over personal interest—serving for the good of the whole people."
    },
    {
      "pk": 240405,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 5,
      "text": "He saw that Simon’s discord was not only a threat to their neighbors but to the whole nation.",
      "links": "",
      "comment": "The unity of believers is vital for the prosperity of the whole body, as Christ prayed for oneness—see <a href='/AIV/43/17/21'>John 17:21</a>."
    },
    {
      "pk": 240406,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 6,
      "text": "Though Onias considered that the king might not provide protection regarding such matters, he still went to him for the sake of preserving the people.",
      "links": "",
      "comment": "Persistent advocacy for the faithful mirrors intercessory prayer and shepherding even amid political uncertainty."
    },
    {
      "pk": 240407,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 7,
      "text": "But after Seleucus died and Antiochus, called Epiphanes, took the throne, Jason, Onias’s brother, seized the opportunity.",
      "links": "<a href='/AIV/15/4/21'>2 Macc. 4:21</a>",
      "comment": "Transitions of power often coincide with threats to faith and the temptation to compromise spiritual integrity."
    },
    {
      "pk": 240408,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 8,
      "text": "Promising to pay the king more money if he were appointed high priest, Jason offered three hundred sixty talents of silver, eighty talents from other revenues, and proposed a hundred and fifty more if he was allowed to introduce new customs.",
      "links": "",
      "comment": "Corruption in spiritual leadership is portrayed here; financial motivation outweighs devotion. See similar warning: <a href='/AIV/40/21/12-13'>Matt. 21:12–13</a>."
    },
    {
      "pk": 240409,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 9,
      "text": "The king agreed, and Jason immediately imposed the foreign Greek way of life on his own people.",
      "links": "",
      "comment": "Adoption of external practices undermined the distinctiveness of the faithful, challenging the call to holiness and separation."
    },
    {
      "pk": 240410,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 10,
      "text": "Upon receiving royal authority, Jason quickly turned his fellow citizens into Antiochians, abandoning ancestral ways.",
      "links": "",
      "comment": "The relinquishing of tradition for cultural assimilation has deep spiritual consequences; compare with Paul’s exhortation to hold fast to tradition: <a href='/AIV/53/2/15'>2 Thess. 2:15</a>."
    },
    {
      "pk": 240411,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 11,
      "text": "He abolished the royal prerogatives granted to the Jews by John, the father of Eupolemus, which had previously guaranteed rights to diplomacy and freedoms.",
      "links": "",
      "comment": "Revocation of privileges symbolically marks the decline in religious liberty, foreshadowing later persecutions and challenges."
    },
    {
      "pk": 240412,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 12,
      "text": "With the king’s permission, Jason built a fully equipped sports stadium under the city’s citadel.",
      "links": "",
      "comment": "Physical pursuits were elevated over spiritual discipline, a precedent critiqued throughout the wisdom literature."
    },
    {
      "pk": 240413,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 13,
      "text": "Eager to adopt the Greek way, Jason forced some of the noblest young men to wear the cap, making them appear Greek in attire.",
      "links": "",
      "comment": "Changing outward identity reflected inward spiritual compromise; see <a href='/AIV/45/12/2'>Rom. 12:2</a>."
    },
    {
      "pk": 240414,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 14,
      "text": "This was the height of Hellenization and loss of the faith, as priests abandoned the altar, neglected sacrifices, and rushed to join foreign contests.",
      "links": "",
      "comment": "Neglect of sacred duties for worldly pursuits brings spiritual ruin; similar warnings given in <a href='/AIV/19/106/35-39'>Ps. 106:35–39</a>."
    },
    {
      "pk": 240415,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 15,
      "text": "They cared nothing for the temple’s honor or the sacrifices, instead finding glory in exercise and athletic competitions.",
      "links": "",
      "comment": "Idolatrous focus on physical achievement over spiritual devotion forms a recurring biblical caution."
    },
    {
      "pk": 240416,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 16,
      "text": "Because they adopted foreign customs, their dignity was soon stripped from them. As those whose ways offend God, they became subjugated to those they tried to imitate.",
      "links": "",
      "comment": "Those who abandon God become captives to the very cultures they idolize; a principle found throughout prophetic literature."
    },
    {
      "pk": 240417,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 17,
      "text": "It is not easy to separate from God’s law and His ways; setting up rival practices always leads to disaster.",
      "links": "",
      "comment": "This verse foreshadows the consequences of doctrinal division, underscoring unity and true doctrine as safeguards for spiritual health."
    },
    {
      "pk": 240418,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 18,
      "text": "During the games held every four years in Tyre, which had the king’s sponsorship, the lawless sent representatives, carrying silver to pay for sacrifices to Hercules.",
      "links": "",
      "comment": "Participation in pagan custom with financial offering shows clear apostasy, blurring lines between the sacred and profane."
    },
    {
      "pk": 240419,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 19,
      "text": "Even the bearers of this silver did not take the offering for sacrifice; embarrassed, they asked the money be used for another need.",
      "links": "",
      "comment": "Some retained remnants of conscience; divine law cannot be supplanted altogether, echoing the struggle of the faithful remnant."
    },
    {
      "pk": 240420,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 20,
      "text": "So the money intended for the sacrifice to Hercules was instead used to outfit the triremes.",
      "links": "",
      "comment": "Misappropriation of sacred resources for secular use is sharply shown here, a theme revisited in the teachings of stewardship."
    },
    {
      "pk": 240421,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 21,
      "text": "Apollonius, son of Menestheus, had been sent to Egypt for the funeral of King Philometor’s father. When he saw the king’s hospitality to Jason’s political party, he returned to inform Antiochus.",
      "links": "",
      "comment": "Political rivalries often intersect with religious compromise, paving the way for conflict and challenge for the faithful community."
    },
    {
      "pk": 240422,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 22,
      "text": "Upon receiving this report, Antiochus believed the Jews were turning against his authority. He traveled from Tyre to Jerusalem in full military display.",
      "links": "<a href='/AIV/15/5/11'>2 Macc. 5:11</a>",
      "comment": "Secular rulers respond harshly to perceived threats, encroaching on religious liberty and peace."
    },
    {
      "pk": 240423,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 23,
      "text": "Jason and his supporters received the king with splendor, offering sacrifices and appearing enthusiastic for his favor.",
      "links": "<a href='/AIV/15/4/9'>2 Macc. 4:9</a>",
      "comment": "Superficial ceremonies and displays replace genuine faith—hypocrisy will always be exposed."
    },
    {
      "pk": 240424,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 24,
      "text": "But Menelaus, Simon’s brother, saw an opportunity, and, scheming against Jason, promised more than Jason had.",
      "links": "",
      "comment": "Ambition and rivalry for spiritual leadership lead to deeper division—a warning regarding the sanctity and selfless nature of true leadership."
    },
    {
      "pk": 240425,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 25,
      "text": "Menelaus, though not from the priestly line, secured the high priesthood by outbidding Jason. He then quickly obtained the office, but failed to pay the funds he had promised.",
      "links": "",
      "comment": "Unauthorized claims to spiritual authority bear grave consequences, highlighting the necessity of legitimate succession and promise keeping; see <a href='/AIV/43/10/1-2'>John 10:1-2</a>."
    },
    {
      "pk": 240426,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 26,
      "text": "Even though Sostratus, governor of the citadel and in charge of temple finances, was called upon by the king, Menelaus remained without the funds promised.",
      "links": "",
      "comment": "Temple finances and administration were deeply entwined with religious affairs, foreshadowing later disputes in the New Testament church."
    },
    {
      "pk": 240427,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 27,
      "text": "Due to this delay, both Menelaus and Sostratus were summoned before the king.",
      "links": "",
      "comment": "Accountability among spiritual leaders is required both before God and governing authorities."
    },
    {
      "pk": 240428,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 28,
      "text": "Menelaus left his brother Lysimachus as deputy in the high priesthood; Sostratus left Crates as acting governor of the citadel.",
      "links": "",
      "comment": "Succession and delegation in spiritual offices must be handled faithfully, maintaining integrity despite absent leadership."
    },
    {
      "pk": 240429,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 29,
      "text": "As proceedings dragged on, the people in Tarsus and Mallus rose up against their governor, insisting their cities belonged to Antiochus.",
      "links": "",
      "comment": "Political unrest leads to instability for religious communities, a recurring motif in biblical history."
    },
    {
      "pk": 240430,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 30,
      "text": "In response, the king swiftly traveled to Tarsus to suppress the revolt.",
      "links": "",
      "comment": "Secular authority often intervenes forcefully in situations affecting religious governance."
    },
    {
      "pk": 240431,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 31,
      "text": "While the king was away, Menelaus tried to seize temple loot in Jerusalem, stirring a great uproar among priests and citizens.",
      "links": "",
      "comment": "Seizure of temple treasures underscores the profaning of sacred things when spiritual offices are perverted for personal gain."
    },
    {
      "pk": 240432,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 32,
      "text": "When Menelaus fled to the citadel, Lysimachus began to steal more temple valuables using force.",
      "links": "",
      "comment": "Violence and theft committed against the sanctuary parallel warnings against those who harm God’s house; cf. <a href='/AIV/19/74/7'>Ps. 74:7</a>."
    },
    {
      "pk": 240433,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 33,
      "text": "The news quickly spread, and the people gathered in anger at Lysimachus over his many acts of robbery.",
      "links": "",
      "comment": "Community response to sacrilege demonstrates corporate responsibility for defending the faith."
    },
    {
      "pk": 240434,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 34,
      "text": "Lysimachus, backed by about three thousand men, armed with reckless aggression and led by a certain Auranus, attacked.",
      "links": "",
      "comment": "The escalation to violence reveals folly born from corrupted leadership—see warnings in <a href='/AIV/20/11/14'>Prov. 11:14</a>."
    },
    {
      "pk": 240435,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 35,
      "text": "But when the people realized Lysimachus had committed sacrilege, they armed themselves with stones. Many were wounded, some killed; the rest fled, and Lysimachus was killed near the temple treasury itself.",
      "links": "<a href='/AIV/15/4/31'>2 Macc. 4:31</a>",
      "comment": "Zeal for the sanctuary recalls the righteous anger shown by Jesus when the temple was defiled: <a href='/AIV/40/21/12-13'>Matt. 21:12–13</a>."
    },
    {
      "pk": 240436,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 36,
      "text": "Charges were brought against Menelaus for these acts.",
      "links": "",
      "comment": "Accountability for sacrilege is vital for upholding holiness in the community and leadership."
    },
    {
      "pk": 240437,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 37,
      "text": "While the king was at Tyre, three men from the council, known for their uprightness, stood before him and presented their case.",
      "links": "",
      "comment": "Bearing witness to wickedness before authorities is highlighted as a duty of righteous individuals."
    },
    {
      "pk": 240438,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 38,
      "text": "Menelaus, desperate to win the case, bribed Ptolemy, son of Dorymenes, to influence the king.",
      "links": "",
      "comment": "Corruption through bribery distorts justice. See God’s condemnation of bribes: <a href='/AIV/5/16/19'>Deut. 16:19</a>."
    },
    {
      "pk": 240439,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 39,
      "text": "As a result, the king, swayed by Ptolemy’s influence, ruled in favor of the corrupt Menelaus, condemning to death even those who had pleaded the case for the city, people, and sacred vessels.",
      "links": "<a href='/AIV/15/4/36'>2 Macc. 4:36</a>",
      "comment": "Unjust judgment against defenders of holiness recalls persecution of the righteous throughout history; see <a href='/AIV/40/5/10-12'>Matt. 5:10–12</a>."
    },
    {
      "pk": 240440,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 40,
      "text": "Immediately, without any proof or investigation, those men suffered an unjust death.",
      "links": "",
      "comment": "Martyrdom for defending the faith is shown here—foreshadowing later Christian witness and suffering for truth."
    },
    {
      "pk": 240441,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 41,
      "text": "Even the Tyrians were outraged and provided extravagant funerals for the men who had died so honorably.",
      "links": "",
      "comment": "Respect for those who suffer for righteousness is recognized, even among outsiders."
    },
    {
      "pk": 240442,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 42,
      "text": "Menelaus survived because of bribery, even though he was guilty of robbery and sacrilege.",
      "links": "",
      "comment": "Evil may appear victorious for a time, but true justice will ultimately prevail—see <a href='/AIV/19/37/7'>Ps. 37:7</a>."
    },
    {
      "pk": 240443,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 43,
      "text": "Regarding the king’s visit to the region, it should be noted that by Menelaus’s treachery, the city suffered a grave setback.",
      "links": "",
      "comment": "When unholy leaders rise, the spiritual wellbeing of the people declines; responsible stewardship is critical."
    },
    {
      "pk": 240444,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 44,
      "text": "Menelaus remained as high priest, accumulating further sins and increasing hostility among the people.",
      "links": "",
      "comment": "Persistence in evil leadership sows division and distresses the faithful. True leaders bring unity—see <a href='/AIV/19/133/1'>Ps. 133:1</a>."
    },
    {
      "pk": 240445,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 45,
      "text": "Jason, who had ruthlessly supplanted his own brother, was now himself driven from office by Menelaus and forced to flee.",
      "links": "",
      "comment": "Scheming for spiritual authority inevitably leads to instability and downfall, echoing Christ’s teaching on humility and true greatness."
    },
    {
      "pk": 240446,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 46,
      "text": "He fled first to the Ammonites, then to Arabia, for fear of Menelaus.",
      "links": "",
      "comment": "Exile and wandering result from faithless ambition; stability comes only through humble, legitimate succession."
    },
    {
      "pk": 240447,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 47,
      "text": "Menelaus, meanwhile, maintained his position through constant bribery, despite his clear guilt.",
      "links": "",
      "comment": "Unholy means of attaining spiritual office exemplify the dangers of compromising with secular authority."
    },
    {
      "pk": 240448,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 48,
      "text": "Honorable men, who boldly spoke for the city and its people, suffered unjust execution.",
      "links": "",
      "comment": "Defenders of truth and tradition are often persecuted, yet their sacrifice echoes prophetic witness throughout both Testaments."
    },
    {
      "pk": 240449,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 49,
      "text": "The tyrannical acts of Menelaus and his cohort were so grave they even angered foreign rulers against him.",
      "links": "",
      "comment": "Wickedness in spiritual leadership harms not only the flock but draws condemnation from the world outside."
    },
    {
      "pk": 240450,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 50,
      "text": "Thus ended this chapter—Menelaus continued in power, increasing in wickedness, and sowing disaster for his own people.",
      "links": "",
      "comment": "This passage serves as a powerful warning against corruption, emphasizing the importance of righteous succession, reverence for the temple, and unity in faith. Enduring patience in adversity and trust in God’s ultimate justice are highlighted—see <a href='/AIV/60/5/10'>1 Pet. 5:10</a>."
    }
  ],
  "translatedAt": "2025-12-23T09:35:04.876Z"
}