{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 14,
  "verses": [
    {
      "pk": 2001401,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 1,
      "text": "In the year three of King Demetrius, Nicanor, son of Patroclus, was sent to the land of Judea.",
      "links": "<a href='/AIV/14/12/2'>2 Macc. 12:2</a>",
      "comment": "Demetrius I became king after Antiochus Epiphanes. The political situation sets the stage for conflict."
    },
    {
      "pk": 2001402,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 2,
      "text": "He brought with him orders to put Judas to death and to scatter his followers.",
      "links": "<a href='/AIV/14/13/1'>2 Macc. 13:1</a>",
      "comment": "Nicanor is given explicit instructions to destroy the leader of Israel's resistance."
    },
    {
      "pk": 2001403,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 3,
      "text": "At the same time, Simon, who belonged to the tribe of Benjamin, had been at odds with Judas, and he told Nicanor that the treasury of the Temple was filled with money, and that it would be possible to seize it.",
      "links": "<a href='/AIV/14/3/11'>2 Macc. 3:11</a>",
      "comment": "Simon’s betrayal foreshadows later biblical themes of personal gain over true worship, reminiscent of Judas Iscariot (Matt. 26:14-16)."
    },
    {
      "pk": 2001404,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 4,
      "text": "Nicanor, upon hearing this, went to the high priests and elders in the Temple, and told them of his orders and intentions.",
      "links": "<a href='/AIV/40/26/3'>Matt. 26:3</a>",
      "comment": "The intrusion into the Temple echoes the desecration by foreign powers; the presence of the high priests underlines the continuity of priestly authority in Israel."
    },
    {
      "pk": 2001405,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 5,
      "text": "The priests and elders strongly protested, saying, 'Judas is noble, devout, and innocent in all matters.'",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>",
      "comment": "Intercession for the righteous parallels Old Testament prayers for the just."
    },
    {
      "pk": 2001406,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 6,
      "text": "But Nicanor, determined to achieve his goal, sent for Judas and his brothers to appear before him.",
      "links": "<a href='/AIV/16/6/2'>Neh. 6:2</a>",
      "comment": "The summoning of Israel’s leaders echoes previous hostile attempts at negotiation leading to betrayal."
    },
    {
      "pk": 2001407,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 7,
      "text": "When Judas learned of this, he saw that Nicanor's intentions were hostile, and he prayed with his companions, seeking God’s help.",
      "links": "<a href='/AIV/19/17/6'>Ps. 17:6</a>; <a href='/AIV/14/13/10'>2 Macc. 13:10</a>",
      "comment": "Prayer before confrontation underlines dependence on God and signals spiritual warfare, reminiscent of Christ in Gethsemane (Luke 22:41-44)."
    },
    {
      "pk": 2001408,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 8,
      "text": "Nicanor and Judas met, but Nicanor, despite his outward friendliness, sought to deceive and capture Judas by treacherous means.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "The duplicity is reminiscent of Psalms speaking of enemies who speak peace but have war in their hearts."
    },
    {
      "pk": 2001409,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 9,
      "text": "He ordered Judas to be handed over, but Judas knew the plot and withdrew, refusing to trust the enemy.",
      "links": "<a href='/AIV/20/27/12'>Prov. 27:12</a>",
      "comment": "Wise discernment in the face of danger is praised in Proverbs."
    },
    {
      "pk": 2001410,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 10,
      "text": "Nicanor, being denied, became enraged and swore by the gods to punish the Jewish people unless Judas was delivered into his hands.",
      "links": "<a href='/AIV/07/11/30'>Judg. 11:30</a>",
      "comment": "An enemy’s oath underscores the seriousness of the threat, contrasting pagan oaths with the Israelites’ trust in the living God."
    },
    {
      "pk": 2001411,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 11,
      "text": "When the elders of Jerusalem heard this, they urged the people not to surrender Judas, recalling the example of past deliverances.",
      "links": "<a href='/AIV/09/07/12'>1 Sam. 7:12</a>",
      "comment": "Remembering God’s faithfulness in history is crucial; a practice taught through the Psalms and historical books."
    },
    {
      "pk": 2001412,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 12,
      "text": "So the community gathered to pray for their deliverance, placing their trust in God rather than men.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Corporate prayer for deliverance underlines the power of united supplication—see Acts 12:5."
    },
    {
      "pk": 2001413,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 13,
      "text": "Judas, trusting in the Lord Who judges secret things, encouraged his men not to fear the threat of Nicanor but to remember past victories.",
      "links": "<a href='/AIV/05/31/6'>Deut. 31:6</a>",
      "comment": "Echoes biblical calls to courage in times of crisis and faith in God’s sovereignty."
    },
    {
      "pk": 2001414,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 14,
      "text": "He reminded them how God had rebuked King Sennacherib, sending His angel, who destroyed 185,000 in one night.",
      "links": "<a href='/AIV/12/19/35'>2 Kings 19:35</a>; <a href='/AIV/23/37/36'>Isa. 37:36</a>",
      "comment": "God’s miraculous deliverance through angels is referenced; emphasizes the ministry of angels and the power of God."
    },
    {
      "pk": 2001415,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 15,
      "text": "So the men took heart from Judas’ words, and readied themselves for battle, seeking God in prayer.",
      "links": "<a href='/AIV/06/23/10'>Josh. 23:10</a>",
      "comment": "Preparation for battle is undertaken with prayer and reliance on God—a spiritual and practical pattern found throughout Scripture."
    },
    {
      "pk": 2001416,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 16,
      "text": "Nicanor, learning of their determination, marched out with a fierce army, hoping to defeat the Judeans quickly.",
      "links": "<a href='/AIV/09/17/1'>1 Sam. 17:1</a>",
      "comment": "Enemy forces gathering against God's people mirrors other biblical battles."
    },
    {
      "pk": 2001417,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 17,
      "text": "But Judas and his men went out to meet them in battle, relying not on swords but on the Lord.",
      "links": "<a href='/AIV/09/17/47'>1 Sam. 17:47</a>",
      "comment": "Victory comes from God, not military might—a spiritual principle throughout Scripture."
    },
    {
      "pk": 2001418,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 18,
      "text": "A certain Razis, a leader in Jerusalem well spoken of for his love of his country, was accused before Nicanor.",
      "links": "<a href='/AIV/14/4/2'>2 Macc. 4:2</a>",
      "comment": "Introduction of Razis, a defender of Jerusalem’s traditions, shows the personal stakes involved."
    },
    {
      "pk": 2001419,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 19,
      "text": "In former days, he had risked his life for the Jewish faith and was renowned for his boldness.",
      "links": "<a href='/AIV/14/2/21'>2 Macc. 2:21</a>",
      "comment": "His reputation connects with previous acts of heroism among Israel’s leaders."
    },
    {
      "pk": 2001420,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 20,
      "text": "Nicanor, wishing to display his fury towards the Jews, sent more than five hundred soldiers to seize Razis.",
      "links": "",
      "comment": "Hostility intensifies as Nicanor increases military pressure."
    },
    {
      "pk": 2001421,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 21,
      "text": "Razis, seeing the soldiers approaching and believing he could not escape, chose to die nobly rather than be abused by the enemy.",
      "links": "<a href='/AIV/09/31/4'>1 Sam. 31:4</a>",
      "comment": "Razis’ suicide recalls Saul’s choice in the face of capture, raising questions about martyrdom and fidelity under pressure."
    },
    {
      "pk": 2001422,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 22,
      "text": "He stabbed himself with his sword, preferring death to falling into enemy hands.",
      "links": "",
      "comment": "Razis demonstrates the depth of commitment to avoiding desecration and dishonor."
    },
    {
      "pk": 2001423,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 23,
      "text": "However, in haste, he did not die immediately, so he rushed to a wall and threw himself down with valor.",
      "links": "",
      "comment": "His act is reported as courageous and rooted in his faith; the narrative underscores perseverance for one’s beliefs."
    },
    {
      "pk": 2001424,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 24,
      "text": "As he lay bleeding, and still breathing, he summoned his spirit and, lifting his hands to heaven, prayed for deliverance of his people.",
      "links": "<a href='/AIV/19/143/6'>Ps. 143:6</a>",
      "comment": "Razis’ final prayer lifts up his nation’s fate, a spiritual act echoing Moses, Samuel, and Jesus (Luke 23:34) in praying for others."
    },
    {
      "pk": 2001425,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 25,
      "text": "Then, in noble suffering, he died, leaving behind an example of courage and faith.",
      "links": "",
      "comment": "Martyrdom tradition surfaces in this account, valuing witness and perseverance to the end—see Hebrews 12:1-2."
    },
    {
      "pk": 2001426,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 26,
      "text": "Nicanor, meanwhile, advanced to Jerusalem and made peace with Judas and his people for a time.",
      "links": "<a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "Temporary alliances often mask deeper intentions, emphasizing discernment and wisdom."
    },
    {
      "pk": 2001427,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 27,
      "text": "But he was always watching for an opportunity to betray Judas.",
      "links": "",
      "comment": "Echoes themes of betrayal; points forward to the New Testament betrayal by Judas Iscariot."
    },
    {
      "pk": 2001428,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 28,
      "text": "Judas, seeing the treachery, prayed for guidance and protection for his people.",
      "links": "<a href='/AIV/59/1/5'>James 1:5</a>",
      "comment": "Prayer for wisdom in leadership is a repeated biblical pattern."
    },
    {
      "pk": 2001429,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 29,
      "text": "Nicanor spoke deceitfully to Judas, trying to draw him out with false promises.",
      "links": "<a href='/AIV/19/120/2'>Ps. 120:2</a>",
      "comment": "The deceitful enemy is a motif in Psalms and prophetic texts."
    },
    {
      "pk": 2001430,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 30,
      "text": "But Judas, perceiving Nicanor’s trickery, kept his men at the ready.",
      "links": "",
      "comment": "Discernment and vigilance are key traits for leaders and believers (Matt. 10:16)."
    },
    {
      "pk": 2001431,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 31,
      "text": "Nicanor, frustrated, resorted to threats, vowing to destroy the Temple if Judas was not handed over.",
      "links": "<a href='/AIV/23/39/8'>Isa. 39:8</a>",
      "comment": "Threats against the sanctuary are frequent in biblical history; the Temple stands as the center of worship and covenant."
    },
    {
      "pk": 2001432,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 32,
      "text": "The priests and people were in great distress, praying for God’s mercy on His sanctuary.",
      "links": "<a href='/AIV/19/74/3'>Ps. 74:3</a>",
      "comment": "Intercessory prayer for God’s house recalls Jesus cleansing the Temple (John 2:17)."
    },
    {
      "pk": 2001433,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 33,
      "text": "The priests, clad in their vestments, stood before the altar and called on the Lord, 'Look upon us, do not let these things happen to Your people.'",
      "links": "<a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "Priestly intercession is highlighted, their special role pointing to the importance of sacrificial ministry and liturgical worship."
    },
    {
      "pk": 2001434,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 34,
      "text": "They continued in prayer and song, remembering the covenant made with their ancestors and the promises given to David.",
      "links": "<a href='/AIV/19/89/3'>Ps. 89:3</a>",
      "comment": "Invoking the covenant and Davidic promise connects the Temple to prophetic fulfillment; see Luke 1:32-33 for messianic implications."
    },
    {
      "pk": 2001435,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 35,
      "text": "'Protect this holy house, which You have sanctified for Yourself.'",
      "links": "<a href='/AIV/14/2/2'>2 Macc. 2:2</a>; <a href='/AIV/19/132/14'>Ps. 132:14</a>",
      "comment": "God’s sanctification of the Temple foreshadows the ultimate sanctification through Christ (John 2:21)."
    },
    {
      "pk": 2001436,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 36,
      "text": "Nicanor, moved to anger by this, gathered his allies and prepared his forces for war against Judas.",
      "links": "",
      "comment": "Repeated preparations for battle highlight the persistent threat to divine worship and covenant fidelity."
    },
    {
      "pk": 2001437,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 37,
      "text": "Judas, seeing that Nicanor intended to fight, rallied his men and encouraged them to trust in the Lord’s deliverance.",
      "links": "<a href='/AIV/14/13/10'>2 Macc. 13:10</a>",
      "comment": "Faith in deliverance is a theme of God’s people throughout Scripture; see Romans 8:31."
    },
    {
      "pk": 2001438,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 38,
      "text": "He reminded them that their ancestors had conquered by faith, not by strength.",
      "links": "<a href='/AIV/58/11/32-34'>Heb. 11:32–34</a>",
      "comment": "Faith history is a crucial element inspiring contemporary believers; Hebrews references many Old Testament heroes."
    },
    {
      "pk": 2001439,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 39,
      "text": "The people prayed earnestly, asking for protection and victory that God’s holy name would be glorified.",
      "links": "<a href='/AIV/19/44/4'>Ps. 44:4</a>",
      "comment": "Victory is sought for God’s glory, not personal gain, echoing principles found in the Lord’s Prayer (Matt. 6:9)."
    },
    {
      "pk": 2001440,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 40,
      "text": "Once again, Nicanor advanced and the two forces prepared to meet in battle.",
      "links": "",
      "comment": "The persistence of the conflict underscores the reality of spiritual and earthly warfare."
    },
    {
      "pk": 2001441,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 41,
      "text": "Eleazar, an officer among Judas’ men, noticed Nicanor was focusing his attack on Judas himself.",
      "links": "",
      "comment": "Leadership is singled out as a target, reflecting the weight leaders bear and the importance of intercessors."
    },
    {
      "pk": 2001442,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 42,
      "text": "So Eleazar intervened, risking his life to defend Judas, displaying loyalty in the face of danger.",
      "links": "<a href='/AIV/09/14/1'>1 Sam. 14:1</a>",
      "comment": "Acts of sacrifice by companions evoke themes of laying down one's life for friends (John 15:13)."
    },
    {
      "pk": 2001443,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 43,
      "text": "In the midst of the battle, the Lord shielded Judas, and the enemy suffered great loss.",
      "links": "<a href='/AIV/14/8/23'>2 Macc. 8:23</a>",
      "comment": "Divine intervention secures victory, demonstrating faithfulness to His people."
    },
    {
      "pk": 2001444,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 44,
      "text": "Nicanor retreated in shame, having failed to overthrow Judas and the Jews.",
      "links": "",
      "comment": "Enemy humiliation after divine deliverance fulfills many Psalms about God’s vindication (Ps. 35:4)."
    },
    {
      "pk": 2001445,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 45,
      "text": "So there was temporary peace in Jerusalem, and the people continued to worship in the Temple.",
      "links": "<a href='/AIV/14/3/1'>2 Macc. 3:1</a>",
      "comment": "Order restored enables ongoing worship; the Temple’s centrality foreshadows continuity of tradition and worship as means of grace."
    },
    {
      "pk": 2001446,
      "translation": "AIV",
      "book": 14,
      "chapter": 14,
      "verse": 46,
      "text": "But the story of Nicanor’s treachery and Razis’ noble death became a lesson for all, as the memory of these events shaped future generations.",
      "links": "<a href='/AIV/58/12/1'>Heb. 12:1</a>",
      "comment": "History remembered shapes faith and piety, encouraging fidelity, perseverance and sacrificial love in the community of believers."
    }
  ],
  "translatedAt": "2025-12-23T09:40:51.161Z"
}