{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 15,
  "verses": [
    {
      "pk": 20001501,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 1,
      "text": "When Nicanor heard that Judas and his companions were in the region of Samaria, he decided to attack them on the day of rest.",
      "links": "<a href='/AIV/14/8/9'>2 Macc 8:9</a>; <a href='/AIV/40/12/10'>Matt 12:10</a>",
      "comment": "Nicanor plans to assault on the Sabbath, highlighting the Jewish observance and the enemy's disregard."
    },
    {
      "pk": 20001502,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 2,
      "text": "When the Jews living in distress followed him in groups, he was forced to meet them in battle.",
      "links": "<a href='/AIV/14/8/23'>2 Macc 8:23</a>",
      "comment": "The Jews stand together against oppression, emphasizing unity amid trial (cf. Acts 4:32)."
    },
    {
      "pk": 20001503,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 3,
      "text": "But Nicanor, with disdain, sent messengers to Judas and his followers, saying, 'Surrender yourselves; you will receive mercy.'",
      "links": "<a href='/AIV/14/7/27'>2 Macc 7:27</a>",
      "comment": "The offer of mercy echoes how adversaries seek to persuade the faithful; a test of resolve."
    },
    {
      "pk": 20001504,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 4,
      "text": "Judas replied, 'Heaven is our refuge; we will trust in Almighty God, who can deliver us from your assault.'",
      "links": "<a href='/AIV/19/20/7'>Ps 20:7</a>; <a href='/AIV/20/3/5'>Prov 3:5</a>",
      "comment": "Judas's confidence in God recalls Old Testament faith, reflecting complete reliance on divine strength."
    },
    {
      "pk": 20001505,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 5,
      "text": "Nicanor, angered by Judas’ words, ordered his troops to prepare for battle at once.",
      "links": "<a href='/AIV/14/10/10'>2 Macc 10:10</a>",
      "comment": "Hostility is intensified by the faith-driven response of the Jews, similar to Pharaoh's response to Moses (Ex 14:5)."
    },
    {
      "pk": 20001506,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 6,
      "text": "Then Nicanor declared, 'If Judas and his army are not delivered into my hands, I will burn this sacred temple.'",
      "links": "<a href='/AIV/14/10/3'>2 Macc 10:3</a>; <a href='/AIV/26/24/21'>Ezek 24:21</a>",
      "comment": "Threatening the sanctuary shows the enemy’s contempt for holy places and practices."
    },
    {
      "pk": 20001507,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 7,
      "text": "But the priests, stretching out their hands toward heaven, prayed that God would defend and preserve the temple, which had been recently purified.",
      "links": "<a href='/AIV/14/10/3'>2 Macc 10:3</a>; <a href='/AIV/19/28/2'>Ps 28:2</a>",
      "comment": "Priestly intercession for the sanctuary reflects trust in divine protection, drawing parallels to Aaron’s prayers (Num 16:48)."
    },
    {
      "pk": 20001508,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 8,
      "text": "Judas, urging his companions not to fear the enemy or their vast army, recalled how God had rescued them from many dangers before.",
      "links": "<a href='/AIV/19/44/7'>Ps 44:7</a>; <a href='/AIV/07/7/7'>Judg 7:7</a>",
      "comment": "Assurance built on historical divine deliverance, a recurring biblical theme encouraging steadfast faith."
    },
    {
      "pk": 20001509,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 9,
      "text": "He encouraged them with the words of the Law and the Prophets, reminding them of the battles they had already won.",
      "links": "<a href='/AIV/05/20/1-4'>Deut 20:1–4</a>; <a href='/AIV/06/10/8'>Josh 10:8</a>",
      "comment": "Scripture is used for encouragement, reinforcing the authority and power of God’s word."
    },
    {
      "pk": 20001510,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 10,
      "text": "By raising their spirits, he prepared them to stand firm and fight bravely, so that they would not fear the enemies but remember the injustices done to their nation.",
      "links": "<a href='/AIV/19/27/14'>Ps 27:14</a>",
      "comment": "Upholding justice and recalling past wrongs motivates righteous resistance; perseverance in faith."
    },
    {
      "pk": 20001511,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 11,
      "text": "After equipping his forces, he joined with the seniors and, together, they pleaded for mercy and favor from God.",
      "links": "<a href='/AIV/19/106/1'>Ps 106:1</a>",
      "comment": "Appeal for mercy and guidance highlights collective prayer, reminiscent of communal intercession (Acts 1:14)."
    },
    {
      "pk": 20001512,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 12,
      "text": "In a dream, Judas saw Onias, the former high priest, a distinguished and virtuous man, his manner holy and majestic.",
      "links": "<a href='/AIV/14/4/34'>2 Macc 4:34</a>",
      "comment": "The vision underscores the reverence for the priesthood and spiritual leadership—dreams bear divine revelation."
    },
    {
      "pk": 20001513,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 13,
      "text": "Onias stretched out his hands, praying for the entire Jewish community.",
      "links": "<a href='/AIV/19/122/6'>Ps 122:6</a>",
      "comment": "Again, emphasis on intercessory prayer, showing the deep spiritual connection within the body of believers."
    },
    {
      "pk": 20001514,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 14,
      "text": "Then a majestic, elderly man appeared, dressed in wonderful splendor and glory.",
      "links": "<a href='/AIV/27/7/9'>Dan 7:9</a>",
      "comment": "Imagery aligns with descriptions of heavenly beings; reflection on glory points to spiritual realities."
    },
    {
      "pk": 20001515,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 15,
      "text": "Onias said, 'This is Jeremiah, the prophet of God, who dearly loves the Jewish people.'",
      "links": "<a href='/AIV/24/15/20'>Jer 15:20</a>",
      "comment": "Jeremiah’s role as intercessor for Israel is recognized, reflecting respect for prophetic authority."
    },
    {
      "pk": 20001516,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 16,
      "text": "Jeremiah extended his right hand, giving Judas a golden sword, and said,",
      "links": "<a href='/AIV/13/29/17'>1 Chr 29:17</a>",
      "comment": "The gift of the sword symbolizes divine empowerment for victory; connecting heavenly gifts and earthly action."
    },
    {
      "pk": 20001517,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 17,
      "text": "'Take this holy sword—a gift from God—by which you will defeat your enemies.'",
      "links": "<a href='/AIV/49/6/17'>Eph 6:17</a>; <a href='/AIV/58/4/12'>Heb 4:12</a>",
      "comment": "The sword parallels New Testament imagery of the Word of God as a spiritual weapon."
    },
    {
      "pk": 20001518,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 18,
      "text": "Awakened by the dream, having received this vision, Judas shared it with all, inspiring them for the battle.",
      "links": "<a href='/AIV/14/10/29'>2 Macc 10:29</a>",
      "comment": "The dream encourages faith, showing how God speaks to His people through visions (cf. Acts 10:9–16)."
    },
    {
      "pk": 20001519,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 19,
      "text": "Once, soon after, Judas’s men were still doubtful and afraid of the armies of Nicanor.",
      "links": "<a href='/AIV/19/56/3'>Ps 56:3</a>",
      "comment": "Fear is met by encouragement—human weakness balanced by God’s promises."
    },
    {
      "pk": 20001520,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 20,
      "text": "Judas, seeing their fear, reminded them of the miracles God had performed in the past and of their present vision.",
      "links": "<a href='/AIV/19/105/5'>Ps 105:5</a>",
      "comment": "Remembrance of miracles strengthens faith; sets a pattern of relying on God’s provision."
    },
    {
      "pk": 20001521,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 21,
      "text": "When all had been encouraged by his words, they prepared for battle, facing their enemies with courage.",
      "links": "<a href='/AIV/06/1/9'>Josh 1:9</a>",
      "comment": "Courage rooted in spiritual encouragement, a biblical principle found throughout redemptive history."
    },
    {
      "pk": 20001522,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 22,
      "text": "Just at the moment of battle, Judas raised his hands toward heaven, praying:",
      "links": "<a href='/AIV/19/28/2'>Ps 28:2</a>",
      "comment": "Gesture of prayer underscores leadership dependent on God; mirrors Moses’s intercession (Ex 17:11)."
    },
    {
      "pk": 20001523,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 23,
      "text": "'Lord, You sent Your angel under King Hezekiah and destroyed one hundred and eighty-five thousand soldiers of Sennacherib.'",
      "links": "<a href='/AIV/12/19/35'>2 Kings 19:35</a>; <a href='/AIV/23/37/36'>Isa 37:36</a>",
      "comment": "Reference to miraculous deliverance, highlighting God’s intervention throughout history."
    },
    {
      "pk": 20001524,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 24,
      "text": "'Now also, Sovereign of the heavens, send a good angel ahead of us who will bring terror and dread to our enemies.'",
      "links": "<a href='/AIV/02/23/20'>Ex 23:20</a>; <a href='/AIV/19/34/7'>Ps 34:7</a>",
      "comment": "Angelology: the ministry of angels in protection and victory—a theme deepened in Christian theology."
    },
    {
      "pk": 20001525,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 25,
      "text": "With this prayer, Judas and his men swiftly advanced toward Nicanor.",
      "links": "<a href='/AIV/19/18/39'>Ps 18:39</a>",
      "comment": "Faith leads to action; confidence in God emboldens believers to confront opposition."
    },
    {
      "pk": 20001526,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 26,
      "text": "But, being divinely supported, they brought down over nine thousand of Nicanor’s troops, wounded most, and forced the rest to flee.",
      "links": "<a href='/AIV/19/118/10'>Ps 118:10</a>",
      "comment": "Victory attributed to divine aid, not human strength—a foreshadowing of salvation by grace."
    },
    {
      "pk": 20001527,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 27,
      "text": "Nicanor himself fell in battle, and they stripped him of his armor.",
      "links": "<a href='/AIV/09/17/51'>1 Sam 17:51</a>",
      "comment": "Defeat of the leader causes confusion for the enemy; reminiscent of David and Goliath."
    },
    {
      "pk": 20001528,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 28,
      "text": "Raising shouts of praise, they returned, blessing the Lord who had preserved them.",
      "links": "<a href='/AIV/19/149/6'>Ps 149:6</a>",
      "comment": "Worship after victory reflects an attitude of gratitude, a repeated pattern in salvation history."
    },
    {
      "pk": 20001529,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 29,
      "text": "They celebrated for thirty days, rejoicing with much gladness.",
      "links": "<a href='/AIV/16/8/12'>Neh 8:12</a>",
      "comment": "Extended celebration mirrors Old Testament feasts, fostering unity and remembrance."
    },
    {
      "pk": 20001530,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 30,
      "text": "With Nicanor’s head and right hand displayed publicly near Jerusalem, they showed all the clear sign of the Lord’s assistance.",
      "links": "<a href='/AIV/07/7/25'>Judg 7:25</a>",
      "comment": "Physical signs underscore spiritual victory; outward symbols of God’s deliverance."
    },
    {
      "pk": 20001531,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 31,
      "text": "Then the people decreed by unanimous decision never to let this day pass unobserved, but to celebrate it annually on the thirteenth of Adar.",
      "links": "<a href='/AIV/08/9/17'>Esth 9:17</a>",
      "comment": "Institution of a memorial day connects with tradition, remembrance, and communal liturgical practice."
    },
    {
      "pk": 20001532,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 32,
      "text": "Thus, things worked out well with respect to Nicanor, and from then onward, the city remained at peace.",
      "links": "<a href='/AIV/14/10/8'>2 Macc 10:8</a>",
      "comment": "Peace as a divine gift—shaping the blessing of the people after faithful endurance."
    },
    {
      "pk": 20001533,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 33,
      "text": "I, then, will end my account at this point.",
      "links": "<a href='/AIV/14/2/32'>2 Macc 2:32</a>",
      "comment": "The narrator’s conclusion invites reflection on God’s faithfulness throughout history."
    },
    {
      "pk": 20001534,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 34,
      "text": "If what I have related is well written and arranged, that is what I desired; but if it is trivial and incomplete, that is all I could do.",
      "links": "<a href='/AIV/14/2/32'>2 Macc 2:32</a>",
      "comment": "Expressions of humility in writing, recognizing human limitation; reminiscent of Paul’s admission in 1 Cor 2:3."
    },
    {
      "pk": 20001535,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 35,
      "text": "For just as it is harmful to drink only wine or only water, but pleasant to blend wine with water,",
      "links": "<a href='/AIV/20/9/2'>Prov 9:2</a>",
      "comment": "Metaphor of mixing suggests careful craftsmanship in writing and teaching; blending human effort with divine wisdom."
    },
    {
      "pk": 20001536,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 36,
      "text": "So also the arrangement of the account brings delight to the listener.",
      "links": "<a href='/AIV/19/33/3'>Ps 33:3</a>",
      "comment": "Joy in the ordering of salvation history; testimony as a medium for spiritual edification."
    },
    {
      "pk": 20001537,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 37,
      "text": "So now, this is the end.",
      "links": "",
      "comment": "The text closes, signaling completion and inviting the reader to consider what has been shared for personal growth."
    },
    {
      "pk": 20001538,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 38,
      "text": "If things have been presented effectively, that is what I hoped; if not, please forgive me.",
      "links": "<a href='/AIV/14/2/32'>2 Macc 2:32</a>",
      "comment": "Acknowledges human weakness and appeals to the reader's mercy—mirroring the principle of grace."
    },
    {
      "pk": 20001539,
      "translation": "AIV",
      "book": 14,
      "chapter": 15,
      "verse": 39,
      "text": "For just as it is harmful to drink wine alone or water alone, but delightful to combine them, so too the account meant to delight the attentive.",
      "links": "<a href='/AIV/20/9/5'>Prov 9:5</a>",
      "comment": "Another metaphor likening good storytelling to spiritual nourishment, subtly suggesting the value of Tradition along with Scripture for a richer faith."
    }
  ],
  "translatedAt": "2025-12-23T09:41:25.435Z"
}