{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 8,
  "verses": [
    {
      "pk": 2800801,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 1,
      "text": "But Judas Maccabeus and those with him secretly entered the villages, summoned their relatives, and, calling on those who had remained faithful to their ancestors, gathered together about six thousand men.",
      "links": "<a href='/AIV/11/19/18'>1 Kings 19:18</a>; <a href='/AIV/58/11/32-34'>Heb. 11:32-34</a>",
      "comment": "Judas Maccabeus, whose name means 'hammer,' leads a small, faithful group like Elijah’s remnant. Their faithfulness echoes Old Testament examples of God preserving a holy remnant even in times of great trouble."
    },
    {
      "pk": 2800802,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 2,
      "text": "They prayed to the Lord to look upon the people who were oppressed by all, and to have mercy on the temple, which had been profaned by ungodly men.",
      "links": "<a href='/AIV/19/74/3-7'>Ps. 74:3-7</a>; <a href='/AIV/27/9/17'>Dan. 9:17</a>",
      "comment": "The prayer here resembles Psalms and Daniel, crying out for God’s mercy on His holy place. Reverence for the temple shows the importance of sacred worship and the seriousness of desecration, which prefigures New Testament concern for the holiness of God’s house (see John 2:16-17)."
    },
    {
      "pk": 2800803,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 3,
      "text": "They also prayed for the city, which was being destroyed and about to be leveled, and for the law, which was being trampled underfoot, and for the people who were suffering exile.",
      "links": "<a href='/AIV/19/79/1-7'>Ps. 79:1-7</a>; <a href='/AIV/23/64/10-12'>Isa. 64:10-12</a>",
      "comment": "This verse highlights intercessory prayer for Jerusalem, the Law, and the people—a pattern continued in the life of the Church. The concern for the Law’s respect points to the necessity of tradition and proper authority."
    },
    {
      "pk": 2800804,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 4,
      "text": "Then, gathering together, they begged the Lord to save Israel quickly from these profane men, for the nation was being destroyed.",
      "links": "<a href='/AIV/19/94/20-23'>Ps. 94:20-23</a>",
      "comment": "Deliverance from evil is a constant theme throughout Scripture (see Matthew 6:13). The call to save Israel is also a prayer for the restoration of God’s kingdom."
    },
    {
      "pk": 2800805,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 5,
      "text": "Judas Maccabeus, after organizing his followers, attacked the arrogant men by night and burned their encampments. He often found success with such daring actions.",
      "links": "<a href='/AIV/7/7/19-22'>Judges 7:19-22</a>; <a href='/AIV/9/10/2-11'>1 Sam. 10:2-11</a>",
      "comment": "Judas’s strategy is reminiscent of Gideon’s surprise attack, showing God’s power is not limited by numbers but by faith and obedience. This foreshadows New Testament passages where “the gates of hell shall not prevail” against the faithful (Matt 16:18)."
    },
    {
      "pk": 2800806,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 6,
      "text": "By the courage and joy he gave his soldiers, he took full advantage of the darkness in the night, causing talk of his prowess to spread everywhere.",
      "links": "<a href='/AIV/6/10/9-10'>Josh. 10:9-10</a>",
      "comment": "The emphasis on the leader’s courage and the inspiration he gives speaks to the value of virtuous leadership in God’s plan. Analogous to Christ as the Good Shepherd, the leader strengthens the people (John 10:11)."
    },
    {
      "pk": 2800807,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 7,
      "text": "Then the fame of Judas spread everywhere, and even King Philip heard about his daring exploits.",
      "links": "<a href='/AIV/9/18/7'>1 Sam. 18:7</a>; <a href='/AIV/42/4/14'>Luke 4:14</a>",
      "comment": "Just as David’s fame spread after defeating Goliath (1 Sam. 18:7), so too does Judas’s reputation. Fame, in a biblical sense, is often a side-effect of faithfulness to God."
    },
    {
      "pk": 2800808,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 8,
      "text": "When Ptolemy, the governor of Coele-Syria and Phoenicia, learned what had happened, he urgently reported it to King Antiochus, seeking reinforcements.",
      "links": "<a href='/AIV/27/6/4'>Dan. 6:4</a>",
      "comment": "The mention of local governors shows the political complexity and foreign domination Israel faced. Similar bureaucratic obstacles are faced by God’s people throughout Scripture."
    },
    {
      "pk": 2800809,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 9,
      "text": "So the king immediately sent Nicanor, the commander of the elephants, and Gorgias, a general with better experience in war, with more than twenty thousand infantry and cavalry, to wipe out the entire nation of Judea. He added with them Lysias, an experienced officer in military affairs.",
      "links": "<a href='/AIV/14/14/9-12'>2 Chr. 14:9-12</a>",
      "comment": "The overwhelming force here recalls times when God’s people faced impossible odds—inviting trust in divine power rather than in human numbers."
    },
    {
      "pk": 2800810,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 10,
      "text": "The enemy intended to make Jerusalem a home for Greeks, to tax the temple, and to sell high office in God’s sanctuary.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>",
      "comment": "The plan to desecrate the temple and corrupt religious office foreshadows Jesus’s critique of mercenaries and money-changers in the temple (John 2:14–16). The importance of legitimate authority and pure worship is underlined."
    },
    {
      "pk": 2800811,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 11,
      "text": "The Gentiles planned to enslave the people of Israel, sending messengers to the surrounding cities to offer the Israelites as slaves for sale. They hoped to raise funds for the king through this trade, though they did not expect divine justice to intervene.",
      "links": "<a href='/AIV/28/3/3-8'>Joel 3:3-8</a>",
      "comment": "The selling of God’s people for financial gain is condemned throughout scripture. God’s justice prevails over economic systems that dehumanize the innocent."
    },
    {
      "pk": 2800812,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 12,
      "text": "Though all the other nearby cities joined in the plot against the Israelites, they joined forces only because they hoped for spoil from the Judeans’ defeat.",
      "links": "<a href='/AIV/24/30/16'>Jer. 30:16</a>",
      "comment": "The expectation of destruction and spoil is a recurring motif (see Jer. 30:16), but God often reverses expectations, vindicating His people."
    },
    {
      "pk": 2800813,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 13,
      "text": "But Judas and his men prayed to God, with their faces to the ground, entreating Him to have mercy and not to hand over the people, the city, and the sacred things to those who scorned them.",
      "links": "<a href='/AIV/19/44/23-26'>Ps. 44:23-26</a>",
      "comment": "Prostration in prayer shows humility. Intercessory prayer was a powerful weapon, a theme mirrored throughout the New Testament (James 5:16–18)."
    },
    {
      "pk": 2800814,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 14,
      "text": "They begged the Lord to show His might and bring justice, as the Law says, by putting to death those who acted wickedly.",
      "links": "<a href='/AIV/5/32/35'>Deut. 32:35</a>",
      "comment": "Prayer for divine justice is consistent with Moses’ teaching on vengeance belonging to God alone (Deut. 32:35)."
    },
    {
      "pk": 2800815,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 15,
      "text": "Judas, after rallying his men with these holy prayers, positioned the weakest to the rear, armed them, and urged them to be ready for battle if needed.",
      "links": "<a href='/AIV/7/7/21'>Judges 7:21</a>",
      "comment": "The organization of the army respects both prudence and trust in God's guidance, showing the balance of human effort and divine help."
    },
    {
      "pk": 2800816,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 16,
      "text": "He instructed his men not to fear the multitude of Gentiles gathered against them, but to fight bravely, remembering the outrages committed against the temple, the city, and the ancestral traditions.",
      "links": "<a href='/AIV/6/23/8-10'>Josh. 23:8-10</a>",
      "comment": "Judas calls to mind the spiritual importance of tradition and sacred places. Courage is rooted in fidelity to God and the inherited faith."
    },
    {
      "pk": 2800817,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 17,
      "text": "‘For they trust in arms and daring,’ he said, ‘but we trust in the almighty God who can, with a gesture, cast down both those who come against us and the entire world.’",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>; <a href='/AIV/47/1/9'>2 Cor. 1:9-10</a>",
      "comment": "The contrast is drawn between human confidence and divine power. The ultimate trust is in God’s might, seen repeatedly through salvation history (see Ps. 20:7; 2 Cor. 1:9-10)."
    },
    {
      "pk": 2800818,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 18,
      "text": "He ended, ‘He will crush our enemies before us; so you, do not be afraid.’",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>",
      "comment": "God's assurance to be present with His people echoes His promises to Joshua and other leaders."
    },
    {
      "pk": 2800819,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 19,
      "text": "Judas reminded them of God’s past help: the deliverance of their ancestors from Sennacherib’s army, when one hundred eighty-five thousand perished in a single night.",
      "links": "<a href='/AIV/12/19/35'>2 Kings 19:35</a>",
      "comment": "Judas recalls the miraculous deliverance during Hezekiah’s time, underscoring the reality of God’s intervention through history."
    },
    {
      "pk": 2800820,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 20,
      "text": "He also spoke of the battle against the Galatians in Babylonia, when just eight thousand Israelites, with four thousand Macedonian allies, destroyed one hundred twenty thousand enemies because of their trust in the Lord.",
      "links": "<a href='/AIV/9/14/6-15'>1 Sam. 14:6-15</a>",
      "comment": "Historical references show God’s faithfulness regardless of odds and encourage continued faith."
    },
    {
      "pk": 2800821,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 21,
      "text": "After such words, courage filled his men’s hearts, and they resolved to rush upon the enemy and seize victory, for the city and its sacred things were at stake.",
      "links": "<a href='/AIV/7/7/18-22'>Judges 7:18-22</a>",
      "comment": "Holy zeal for the city and the temple foreshadows Christ’s zeal for His Father’s house (John 2:17)."
    },
    {
      "pk": 2800822,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 22,
      "text": "Judas divided his force into four groups, placing his brothers Simon, Joseph, and Jonathan in command, assigning one thousand five hundred men to each.",
      "links": "<a href='/AIV/2/6/19'>Exod. 6:19</a>",
      "comment": "Prudent division of forces shows military wisdom and shared leadership—foreshadowing the apostolic succession and collegial ministry seen later."
    },
    {
      "pk": 2800823,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 23,
      "text": "Judas then read from the holy book and gave the signal, ‘God is our helper!’ leading the first attack against Nicanor.",
      "links": "<a href='/AIV/16/4/20'>Neh. 4:20</a>",
      "comment": "Reading from Scripture before battle strengthens and sanctifies the assembly—an ancient tradition maintained in worship. The shout invokes God’s presence in the struggle."
    },
    {
      "pk": 2800824,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 24,
      "text": "With God alongside them, they killed over nine thousand men, wounded and disabled most of Nicanor’s force, forced everyone to flee,",
      "links": "<a href='/AIV/7/4/15-16'>Judges 4:15-16</a>",
      "comment": "Victory is attributed to God’s direct intervention, not merely military strength."
    },
    {
      "pk": 2800825,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 25,
      "text": "seized the money of those who had come to buy them, and pursued their enemies far. When they returned, they sang hymns and gave thanks to the Lord, for He is good and His mercy endures forever.",
      "links": "<a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "The phrase 'His mercy endures forever' is a classic refrain in Israel’s worship, and its use here shows the continuity between worship and thanksgiving following deliverance."
    },
    {
      "pk": 2800826,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 26,
      "text": "They had won a great rescue, but those of their enemies who had escaped returned terrified to their rulers, recounting all that had happened.",
      "links": "<a href='/AIV/7/7/22'>Judges 7:22</a>",
      "comment": "God’s action not only saves but also serves as a witness to surrounding nations, prompting awe or fear of the Lord."
    },
    {
      "pk": 2800827,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 27,
      "text": "When their commander Nicanor and those with him realized the defeat they had suffered, they decided to attack the Jews again by mustering reinforcements.",
      "links": "<a href='/AIV/19/2/1'>Ps. 2:1</a>",
      "comment": "The enemies’ persistence echoes the continual opposition between God’s faithful and the world—a recurring biblical theme."
    },
    {
      "pk": 2800828,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 28,
      "text": "But Judas, trusting that the Lord would help them, crossed over to the stronger part of the enemy’s camp by night.",
      "links": "<a href='/AIV/7/7/19'>Judges 7:19</a>",
      "comment": "Once more, night attacks show both courage and wisdom, mirroring Old Testament precedents set by leaders who trusted in the Lord over human calculation."
    },
    {
      "pk": 2800829,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 29,
      "text": "He struck them hard, killing about two thousand men, and returned safely. Day broke, and their city was filled with delight.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "Judas’s night victories bring joy and hope to God’s people—daybreak symbolizes divine favor and new beginnings."
    },
    {
      "pk": 2800830,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 30,
      "text": "But when they saw the strength of Judas and his men, and that courage was given to them by the Lord, the Gentiles determined that he could not be overcome by human means.",
      "links": "<a href='/AIV/6/2/24'>Josh. 2:24</a>",
      "comment": "Acknowledgment by outsiders that God was with the Jews recalls the testimony of Rahab about Israel (Josh. 2:24)."
    },
    {
      "pk": 2800831,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 31,
      "text": "So they sent messengers to Judas to arrange terms, and he agreed to make peace with them after they had granted just conditions. He removed the amassed hostages and returned them to their families.",
      "links": "<a href='/AIV/9/10/12-14'>1 Sam. 10:12-14</a>",
      "comment": "Making peace is possible after just reparation, showing the priority of justice and reconciliation in God’s plan."
    },
    {
      "pk": 2800832,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 32,
      "text": "But Lysias, being a man without sense, broke his promises, marched out with a strong force, and was defeated by the Jews.",
      "links": "<a href='/AIV/19/5/10'>Ps. 5:10</a>",
      "comment": "Lack of integrity and deceit ultimately lead to defeat, a theme affirmed throughout Wisdom literature."
    },
    {
      "pk": 2800833,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 33,
      "text": "He then left for Antioch in disgrace, deeply troubled by the destruction of his army.",
      "links": "<a href='/AIV/2/14/25-28'>Exod. 14:25-28</a>",
      "comment": "The humiliation of the enemy recalls similar defeats of proud rulers who opposed God’s people."
    },
    {
      "pk": 2800834,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 34,
      "text": "So he who had promised to collect tribute from the captives of Jerusalem, and had boasted he would lay siege to the city, was now forced to retreat by those he had despised.",
      "links": "<a href='/AIV/12/19/22'>2 Kings 19:22-23</a>",
      "comment": "Boasting against God’s people leads to downfall; God upends human pride."
    },
    {
      "pk": 2800835,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 35,
      "text": "He, who had so arrogantly entered the Holy Land, now fled, leaving behind his weapons and in disgrace.",
      "links": "<a href='/AIV/19/76/5-7'>Ps. 76:5-7</a>",
      "comment": "The flight of the arrogant enemy has spiritual implications: those who attack what is holy are ultimately defeated."
    },
    {
      "pk": 2800836,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 36,
      "text": "He who had thought to enslave the citizens of Jerusalem for sale, now even confessed that the Jews had a defender in God, and because of this, he could not stand against them.",
      "links": "<a href='/AIV/19/46/1-2'>Ps. 46:1-2</a>",
      "comment": "The recognition by enemies that God defends His people foreshadows Christ’s ultimate victory over evil. Perseverance in faith and rightful worship establishes the community’s security through God’s ongoing presence."
    }
  ],
  "translatedAt": "2025-12-23T09:37:24.057Z"
}