{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 1,
  "verses": [
    {
      "pk": 2311001,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 1,
      "text": "To the Jews, our brothers living in Egypt: Greetings. May God bless you and remember his covenant with Abraham, Isaac, and Jacob.",
      "links": "<a href='/AIV/1/12/1-3'>Gen. 12:1-3</a>; <a href='/AIV/1/26/24'>Gen. 26:24</a>",
      "comment": "The greeting emphasizes the continuity of the promise to the patriarchs, tying the Jewish people to their roots. This highlights God's faithfulness across generations, anticipating the fulfillment found in Christ."
    },
    {
      "pk": 2311002,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 2,
      "text": "May he give you all a wholehearted heart to worship him and do his will with desire and willingness.",
      "links": "<a href='/AIV/19/119/2'>Ps. 119:2</a>; <a href='/AIV/26/36/26'>Ezek. 36:26</a>",
      "comment": "The prayer for a unified heart echoes the need for spiritual renewal and transformation—a theme present in Ezekiel and fulfilled under the new covenant."
    },
    {
      "pk": 2311003,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 3,
      "text": "May he open your hearts to his law and his commands, granting you peace.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>; <a href='/AIV/23/54/13'>Isa. 54:13</a>",
      "comment": "Opening hearts to the Law anticipates the promise that God will inscribe his law upon hearts (Jer. 31:33), pointing to interior conversion."
    },
    {
      "pk": 2311004,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 4,
      "text": "May he hear your prayers and be reconciled to you, not abandoning you in times of trouble.",
      "links": "<a href='/AIV/19/66/19'>Ps. 66:19</a>; <a href='/AIV/19/22/24'>Ps. 22:24</a>",
      "comment": "God’s forgiveness and faithfulness are central themes, foundational for understanding salvation history and ultimately fulfilled in Christ’s reconciliation."
    },
    {
      "pk": 2311005,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 5,
      "text": "For even in our trials, we still pray for you, and for your prosperity.",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/50/1/3-4'>Phil. 1:3-4</a>",
      "comment": "Intercessory prayer for others is seen here, laying groundwork for the continuing practice of praying for the community, a vital aspect of worship and faith."
    },
    {
      "pk": 2311006,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 6,
      "text": "While we were ruled by King Demetrius, we suffered greatly, and we fought against him and against those with him.",
      "links": "<a href='/AIV/13/14/1'>1 Macc. 14:1</a>",
      "comment": "Historical context is given here, showing faith under persecution—a recurring theme in both the Old and New Testaments."
    },
    {
      "pk": 2311007,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 7,
      "text": "Yet, in spite of all these challenges, we did not abandon our faith in God.",
      "links": "<a href='/AIV/58/11/32-40'>Heb. 11:32-40</a>",
      "comment": "The perseverance of faith under adversity is celebrated and serves as a model for trust in God, looking ahead toward eternal reward."
    },
    {
      "pk": 2311008,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 8,
      "text": "When we offered sacrifices at the Temple and lit the lamps, we presented the sacred bread, and we did all this in accordance with the Law.",
      "links": "<a href='/AIV/2/25/30'>Ex. 25:30</a>; <a href='/AIV/3/24/5-9'>Lev. 24:5-9</a>",
      "comment": "Worship according to the Law is a sign of faithfulness. The mention of sacrifices and sacred bread foreshadows the Eucharist."
    },
    {
      "pk": 2311009,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 9,
      "text": "Now, we urge you to celebrate the festival of Booths in the month of Kislev, as we have done.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>; <a href='/AIV/13/10/6'>1 Macc. 10:6</a>",
      "comment": "Celebration of the festival in Kislev connects the original feast with Hanukkah. Ritual worship as a sign of faithfulness is highlighted."
    },
    {
      "pk": 2311010,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 10,
      "text": "Written by the people of Jerusalem and Judea, and the council, and Judas, addressed to Aristobulus, a teacher among the descendants of the priests, and to the Jews in Egypt: Greetings and good health.",
      "links": "<a href='/AIV/13/2/42'>1 Macc. 2:42</a>",
      "comment": "This letter demonstrates unity across geographical boundaries and emphasizes connection and spiritual leadership rooted in apostolic succession."
    },
    {
      "pk": 2311011,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 11,
      "text": "Since God has rescued us from great peril, we thank him greatly, who has defeated the evil king.",
      "links": "<a href='/AIV/19/124/6-8'>Ps. 124:6-8</a>",
      "comment": "Thanksgiving for deliverance from evil recalls various moments in Scripture where God acts as redeemer, climaxing in Christ."
    },
    {
      "pk": 2311012,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 12,
      "text": "For God led our army against King Antiochus and into the fortress, and then out again unharmed.",
      "links": "<a href='/AIV/13/4/36'>1 Macc. 4:36</a>",
      "comment": "Narration of victory by divine hand. God’s intervention in history prepares for understanding Christ as God acting decisively for his people."
    },
    {
      "pk": 2311013,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 13,
      "text": "He purified the Temple as a result of his mercy, and we returned to the temple service.",
      "links": "<a href='/AIV/13/4/41-52'>1 Macc. 4:41-52</a>",
      "comment": "Purification of the Temple prefigures spiritual cleansing and is reminiscent of Christ purifying the temple (John 2:13-21)."
    },
    {
      "pk": 2311014,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 14,
      "text": "We prayed to the Lord, asking that no further calamities would come upon us and that he would kindly look upon his chosen people.",
      "links": "<a href='/AIV/19/28/9'>Ps. 28:9</a>",
      "comment": "Prayer for protection reveals the communal intercessory role, a practice seen later in Christ’s teaching and in apostolic tradition."
    },
    {
      "pk": 2311015,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 15,
      "text": "After purifying the Temple, we began offering sacrifices and the lamp was lit, and the sacred bread was set on the table.",
      "links": "<a href='/AIV/3/24/5-9'>Lev. 24:5-9</a>; <a href='/AIV/2/40/22-25'>Ex. 40:22-25</a>",
      "comment": "The details of worship reflect the continuity of liturgical tradition, underscoring sacred ritual as a means of approaching God."
    },
    {
      "pk": 2311016,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 16,
      "text": "When this happened, we made vows and fasted, and we earnestly prayed to the Lord for his mercy.",
      "links": "<a href='/AIV/19/35/13'>Ps. 35:13</a>; <a href='/AIV/40/6/16'>Matt. 6:16</a>",
      "comment": "Fasting and vows as acts of devotion foreshadow Christian practices, emphasizing penance, prayer, and seeking God’s mercy."
    },
    {
      "pk": 2311017,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 17,
      "text": "Through God's kindness, we had success, and we continue to remember the day of purification every year.",
      "links": "<a href='/AIV/13/4/52-59'>1 Macc. 4:52-59</a>",
      "comment": "Annual commemoration points toward the significance of sacred feasts and rituals in maintaining spiritual memory."
    },
    {
      "pk": 2311018,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 18,
      "text": "Therefore, we urge you to also celebrate these days, just as the law prescribes.",
      "links": "<a href='/AIV/3/23/41'>Lev. 23:41</a>",
      "comment": "Celebrating religious feasts is a command grounded in the Law, showing continuity between worship practices across generations."
    },
    {
      "pk": 2311019,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 19,
      "text": "When Antiochus was driven out of our land, the high priests and the people took the fire, and concealed it secretly in a dry pit, careful not to let anyone find it.",
      "links": "<a href='/AIV/3/6/12'>Lev. 6:12</a>",
      "comment": "The preservation of the sacred fire reflects the need to maintain divine worship and protection of holy mysteries, a principle of sacramental theology."
    },
    {
      "pk": 2311020,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 20,
      "text": "After years had passed, Nehemiah sent the descendants of the priests to retrieve the fire, but they reported finding only thick liquid.",
      "links": "<a href='/AIV/16/1/1-7'>Neh. 1:1-7</a>",
      "comment": "Reference to Nehemiah strengthens the connection with the post-exilic restoration, and hints at enduring sacred tradition."
    },
    {
      "pk": 2311021,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 21,
      "text": "Nehemiah ordered them to bring the thick liquid; after sacrifices were placed on the altar, he sprinkled the liquid on the wood and the sacrifices.",
      "links": "<a href='/AIV/3/9/23'>Lev. 9:23</a>",
      "comment": "The mysterious restoration of fire is presented as a miracle through obedience and faith, prefiguring God's miraculous provision."
    },
    {
      "pk": 2311022,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 22,
      "text": "When the sun, previously hidden by clouds, shone down, a great fire flashed, amazing everyone watching.",
      "links": "<a href='/AIV/2/40/34-38'>Ex. 40:34-38</a>",
      "comment": "Manifestation of divine fire recalls the Shekinah glory and prefigures divine presence, as in Acts 2 and the Holy Spirit’s descent."
    },
    {
      "pk": 2311023,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 23,
      "text": "The priests began to pray while their sacrifices burned; Jonathan began, followed by the others—Nehemiah included.",
      "links": "<a href='/AIV/16/8/6'>Neh. 8:6</a>",
      "comment": "Communal leadership in prayer underscores the priestly role in worship and the importance of collective intercession."
    },
    {
      "pk": 2311024,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 24,
      "text": "Their prayer was offered this way: 'O Lord, God, Creator of all, awesome and powerful, righteous and merciful, you alone are king and good.'",
      "links": "<a href='/AIV/19/145/9'>Ps. 145:9</a>; <a href='/AIV/54/6/15'>1 Tim. 6:15</a>",
      "comment": "The prayer acknowledges God’s unique kingship, goodness, and mercy, themes developed throughout the Old and New Testaments."
    },
    {
      "pk": 2311025,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 25,
      "text": "'You are just and compassionate; you alone are ruler over all, and no one can resist you.'",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>",
      "comment": "God’s unrivaled authority and justice highlighted here prepare for understanding Christ’s divinity and sovereignty."
    },
    {
      "pk": 2311026,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 26,
      "text": "'You have chosen our ancestors to be set apart for you, giving them promises of hope and blessing.'",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>; <a href='/AIV/19/105/8'>Ps. 105:8</a>",
      "comment": "Election of the ancestors links to the covenant and foreshadows the new people of God united in Christ."
    },
    {
      "pk": 2311027,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 27,
      "text": "'Accept our sacrifices on behalf of all your people and preserve them.'",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/58/9/24'>Heb. 9:24</a>",
      "comment": "Sacrifices offered for the people prefigure Christ’s intercession and sacrificial offering for all humanity."
    },
    {
      "pk": 2311028,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 28,
      "text": "'Sanctify your people and guide them; gather those scattered among the nations to stand firm in your law and holiness.'",
      "links": "<a href='/AIV/23/11/12'>Isa. 11:12</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "Gathering the dispersed and sanctifying them prefigures the church as the unified people of God from every nation."
    },
    {
      "pk": 2311029,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 29,
      "text": "'Save those who are persecuted and despised because they are your people, so that all nations may know you are God.'",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/19/67/1-2'>Ps. 67:1-2</a>",
      "comment": "Salvation of the oppressed and witness to the nations echo the universal scope of God’s redemptive plan."
    },
    {
      "pk": 2311030,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 30,
      "text": "The priests then sang hymns after offering sacrifice.",
      "links": "<a href='/AIV/19/29/2'>Ps. 29:2</a>; <a href='/AIV/19/100/1-2'>Ps. 100:1-2</a>",
      "comment": "Singing hymns in worship is both an Old and New Testament practice, underscoring the importance of reverent praise."
    },
    {
      "pk": 2311031,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 31,
      "text": "When the sacrifice was completed, Nehemiah ordered that the remaining liquid should be poured out on large stones.",
      "links": "<a href='/AIV/21/9/1-2'>Eccl. 9:1-2</a>",
      "comment": "The careful use of the sacred liquid signifies reverence for holy things, a principle seen in other sacramental acts."
    },
    {
      "pk": 2311032,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 32,
      "text": "As this was done, a flame appeared that consumed what had been poured out. But the light from the altar spread brightly.",
      "links": "<a href='/AIV/2/40/38'>Ex. 40:38</a>",
      "comment": "The miraculous sign of divine fire echoes earlier manifestations, showing God’s approval of worship and divine presence."
    },
    {
      "pk": 2311033,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 33,
      "text": "When the fact was reported to the king of Persia, he investigated the matter.",
      "links": "<a href='/AIV/17/3/12'>Esth. 3:12</a>",
      "comment": "Royal investigation links sacred history with secular power, demonstrating the impact of religious miracles on rulers."
    },
    {
      "pk": 2311034,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 34,
      "text": "After Nehemiah’s explanation, the king ordered the site to be designated as sacred and marked for remembrance.",
      "links": "<a href='/AIV/16/2/8'>Neh. 2:8</a>",
      "comment": "Setting apart holy places for memory and worship points to the ongoing role of sacred objects and places in spiritual life."
    },
    {
      "pk": 2311035,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 35,
      "text": "Those with Nehemiah called this liquid 'Nephi,' meaning purification, but most called it 'Naphta.'",
      "links": "",
      "comment": "Naming the sacred liquid emphasizes the enduring reverence for mystery, as God uses ordinary things for holy purposes."
    },
    {
      "pk": 2311036,
      "translation": "AIV",
      "book": 13,
      "chapter": 1,
      "verse": 36,
      "text": "It is recorded that Nehemiah and his companions purified the temple using this discovery and even used it for sacrifices in ancient times.",
      "links": "<a href='/AIV/16/12/27'>Neh. 12:27</a>",
      "comment": "The continuity of ritual purification and sacrifice points to an unbroken chain of worship and tradition, preparing hearts for the fullness revealed in Christ."
    }
  ],
  "translatedAt": "2025-12-23T09:33:11.870Z"
}