{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 2,
  "verses": [
    {
      "pk": 3202001,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 1,
      "text": "One finds in the records that Jeremiah the prophet commanded those who were being taken into exile to bring the fire, as has been described,",
      "links": "<a href='/AIV/24/29/1-7'>Jer. 29:1-7</a>; <a href='/AIV/14/1/20'>2 Macc. 1:20</a>",
      "comment": "Jeremiah’s care for the sacred fire symbolizes the continuity of authentic worship even in times of suffering and displacement."
    },
    {
      "pk": 3202002,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 2,
      "text": "and how he gave them instructions, that if they should find the place, they would never forget them.",
      "links": "<a href='/AIV/14/1/22'>2 Macc. 1:22</a>",
      "comment": "Jeremiah’s instructions echo the Old Testament theme of the preservation of God’s holy mysteries through faithful remembrance."
    },
    {
      "pk": 3202003,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 3,
      "text": "And how he went up to the mountain, where Moses had seen God’s inheritance, and Jeremiah came and found a cave, and brought inside the tent, the ark, and the altar of incense, and sealed up the entrance.",
      "links": "<a href='/AIV/5/34/1-4'>Deut. 34:1-4</a>; <a href='/AIV/2/40/3-5'>Exod. 40:3-5</a>",
      "comment": "This verse draws a connection between Moses’ vision and Jeremiah’s actions, suggesting a continuity and protection of the sacred vessels and sites."
    },
    {
      "pk": 3202004,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 4,
      "text": "Some of those who followed him came to mark the way, but they could not find it.",
      "links": "<a href='/AIV/14/2/3'>2 Macc. 2:3</a>",
      "comment": "The secret location of these items emphasizes their holiness and the mystery surrounding God’s providential care for His people’s worship."
    },
    {
      "pk": 3202005,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 5,
      "text": "When Jeremiah learned of it, he rebuked them and said, \"No one will know about this place until God gathers His people again and shows them mercy.\"",
      "links": "<a href='/AIV/24/23/3'>Jer. 23:3</a>; <a href='/AIV/14/2/18'>2 Macc. 2:18</a>",
      "comment": "Jeremiah foresees a restoration that points forward to messianic hope and the revelation of God’s glory to His assembled people."
    },
    {
      "pk": 3202006,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 6,
      "text": "Then the Lord will disclose them, and the glory of the Lord will appear, as it was shown in the cloud to Moses, and as it was seen by Solomon when he prayed that the house might be gloriously sanctified.",
      "links": "<a href='/AIV/2/40/34-38'>Exod. 40:34-38</a>; <a href='/AIV/11/8/10-11'>1 Kings 8:10-11</a>",
      "comment": "This resurrection of hidden glory mirrors the return of the divine presence and recalls God’s manifestation during the Exodus and at Solomon’s temple dedication."
    },
    {
      "pk": 3202007,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 7,
      "text": "Solomon, in his wisdom, offered a sacrifice to dedicate and finish the temple.",
      "links": "<a href='/AIV/11/8/62-64'>1 Kings 8:62-64</a>",
      "comment": "Solomon prefigures the high priestly ministry fulfilled ultimately in Christ, who perfects the sacrifice once for all."
    },
    {
      "pk": 3202008,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 8,
      "text": "Just as Moses prayed to the Lord and fire came down from heaven, so Solomon also prayed and fire came down and consumed the burnt offering.",
      "links": "<a href='/AIV/2/9/23-24'>Lev. 9:23-24</a>; <a href='/AIV/14/7/1'>2 Chr. 7:1</a>",
      "comment": "This descent of fire signifies acceptance of the offering and has typological resonance with pentecost and the spiritual sanctification of God’s people."
    },
    {
      "pk": 3202009,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 9,
      "text": "Moses said, ‘Because the sin offering was not eaten, it was consumed.’",
      "links": "<a href='/AIV/3/10/16-20'>Lev. 10:16-20</a>",
      "comment": "The manner of consuming the sin offering underscores the seriousness of atonement before God."
    },
    {
      "pk": 3202010,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 10,
      "text": "Likewise, Solomon celebrated the dedication for eight days.",
      "links": "<a href='/AIV/11/8/65'>1 Kings 8:65</a>",
      "comment": "Eight days alludes to the fullness of consecration and hints at the new creation, fulfilling creation through worship."
    },
    {
      "pk": 3202011,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 11,
      "text": "At the same time, there was public reading from the records; Nehemiah and his companions encouraged the people to keep the sacred fire, as has been told.",
      "links": "<a href='/AIV/16/8/1-3'>Neh. 8:1-3</a>; <a href='/AIV/14/1/20-22'>2 Macc. 1:20-22</a>",
      "comment": "This connects the practice of public proclamation of the word with the preservation of the holy traditions, indicating liturgical continuity."
    },
    {
      "pk": 3202012,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 12,
      "text": "And after many attempts, Nehemiah built up the temple and offered sacrifices.",
      "links": "<a href='/AIV/16/6/15-16'>Neh. 6:15-16</a>; <a href='/AIV/14/1/33'>2 Macc. 1:33</a>",
      "comment": "Nehemiah’s restoration work echoes the persistence in building up worship, vital for continuity of the faith community."
    },
    {
      "pk": 3202013,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 13,
      "text": "He also established the customs and instructions, as both David and Solomon had given them;",
      "links": "<a href='/AIV/13/23/24-32'>1 Chr. 23:24-32</a>; <a href='/AIV/11/8/1-6'>1 Kings 8:1-6</a>",
      "comment": "Successive generations handed on tradition, emphasizing the role of oral and written transmission for faithfulness."
    },
    {
      "pk": 3202014,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 14,
      "text": "Solomon’s letters concerning offerings were also preserved, as well as instructions about the temple’s construction and liturgy.",
      "links": "<a href='/AIV/11/8/22-53'>1 Kings 8:22-53</a>",
      "comment": "Reference to established liturgy demonstrates the value of sacred order for worship."
    },
    {
      "pk": 3202015,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 15,
      "text": "It is told how these matters and others were handled by Nehemiah, including the founding of libraries and the gathering of books about the kings, the prophets, and writings about David, and letters of royal decrees.",
      "links": "<a href='/AIV/16/2/8'>Neh. 2:8</a>",
      "comment": "The gathering and preservation of sacred writings anticipates the establishment of a canon."
    },
    {
      "pk": 3202016,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 16,
      "text": "So also Judas gathered together all the books that had been scattered because of the war, and they are with us.",
      "links": "<a href='/AIV/14/1/6'>2 Macc. 1:6</a>",
      "comment": "Judas’s action secures the inheritance of sacred tradition for future generations."
    },
    {
      "pk": 3202017,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 17,
      "text": "Therefore, if anyone needs these, let him send for them.",
      "links": "<a href='/AIV/14/2/15'>2 Macc. 2:15</a>",
      "comment": "Invitation to seek the writings shows openness and universality of God’s revelation."
    },
    {
      "pk": 3202018,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 18,
      "text": "Since we are about to celebrate the purification, we write to you; do well to keep these days.",
      "links": "<a href='/AIV/14/1/9'>2 Macc. 1:9</a>; <a href='/AIV/3/16/29-34'>Lev. 16:29-34</a>",
      "comment": "Reference to days of purification echoes the themes of repentance and liturgical year."
    },
    {
      "pk": 3202019,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 19,
      "text": "God, who saved all His people and gave them the heritage of kingship, priesthood, and holiness,",
      "links": "<a href='/AIV/2/19/6'>Exod. 19:6</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "This trifold description finds fulfillment in Christ, our King, High Priest, and Holy One."
    },
    {
      "pk": 3202020,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 20,
      "text": "just as He promised through the law—may He soon show mercy to us and gather us from everywhere under heaven into His holy place.",
      "links": "<a href='/AIV/5/30/3-5'>Deut. 30:3-5</a>; <a href='/AIV/14/2/5'>2 Macc. 2:5</a>",
      "comment": "Gathering into the holy place prefigures the eschatological ingathering of the faithful. (Cf. Jesus’ gathering of disciples: <a href='/AIV/40/23/37'>Matt. 23:37</a>)"
    },
    {
      "pk": 3202021,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 21,
      "text": "For He has delivered us from great evils and has purified this place.",
      "links": "<a href='/AIV/19/66/12'>Ps. 66:12</a>; <a href='/AIV/14/1/33-36'>2 Macc. 1:33-36</a>",
      "comment": "Purification of the temple is a sign of God’s sanctifying work among His people."
    },
    {
      "pk": 3202022,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 22,
      "text": "The details of Judas Maccabeus’s wars, his noble leadership and great exploits, the rebuilding of the sanctuary,",
      "links": "<a href='/AIV/14/1/18'>2 Macc. 1:18</a>; <a href='/AIV/14/8/1'>2 Macc. 8:1</a>",
      "comment": "Judas is presented as a type of redeemer, pointing beyond himself to the ultimate deliverer."
    },
    {
      "pk": 3202023,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 23,
      "text": "will be explained in the following chapters, which we have tried to summarize.",
      "links": "<a href='/AIV/14/8/1-36'>2 Macc. 8</a>",
      "comment": "The book intends to preserve a reliable account to edify and inform."
    },
    {
      "pk": 3202024,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 24,
      "text": "For when Jason of Cyrene compiled a five-volume history,",
      "links": "",
      "comment": "Historical mention shows the value placed on thorough record keeping for truthfulness."
    },
    {
      "pk": 3202025,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 25,
      "text": "we have tried to produce an abridged version, considering the vastness of the material.",
      "links": "",
      "comment": "Abridgment here ensures accessibility without sacrificing orthodoxy."
    },
    {
      "pk": 3202026,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 26,
      "text": "For those eager to read, making it easy to remember; for those wanting to commit things to memory, a convenient help; and for all, ease for those who read.",
      "links": "",
      "comment": "This statement reflects pastoral concern for transmitting faith."
    },
    {
      "pk": 3202027,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 27,
      "text": "So for us who have tried to summarize, it’s no easy task. Instead, it’s work, poured out with effort, just as preparing a banquet takes effort to please many.",
      "links": "",
      "comment": "The analogy to a banquet alludes to the spiritual nourishment provided by Scripture (<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/40/26/26-29'>Matt. 26:26-29</a>)."
    },
    {
      "pk": 3202028,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 28,
      "text": "But for those who make a long and detailed history, the task is to compile material, but for the one who summarizes, it takes careful attention to style.",
      "links": "",
      "comment": "The concern for clarity and beauty signals the importance of reverent proclamation of the word."
    },
    {
      "pk": 3202029,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 29,
      "text": "So now, let’s begin the story, not failing in the work itself, but following in summary form what Jason has set down.",
      "links": "",
      "comment": "Readiness to transmit tradition is presented as an act of stewardship."
    },
    {
      "pk": 3202030,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 30,
      "text": "Indeed, we will allow those who undertake a detailed account to analyze each part.",
      "links": "",
      "comment": "Encourages deeper study and reflection—hallmarks of growing in wisdom and truth."
    },
    {
      "pk": 3202031,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 31,
      "text": "For, as the builder of a new house is expected to take care of the whole structure, but the one who decorates and paints it looks for what is fitting to please the viewer, so we will handle the summary.",
      "links": "",
      "comment": "Imparts a sense of harmony between truth and beauty, both essential in worship and doctrine."
    },
    {
      "pk": 3202032,
      "translation": "AIV",
      "book": 14,
      "chapter": 2,
      "verse": 32,
      "text": "Let this then suffice as a summary, and we will begin the story itself.",
      "links": "",
      "comment": "Concludes the prologue, inviting readers deeper into the narrative of salvation history."
    }
  ],
  "translatedAt": "2025-12-23T09:33:41.646Z"
}