{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 2,
  "verses": [
    {
      "pk": 21002001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 1,
      "text": "One finds in the records that Jeremiah the prophet commanded those who were exiled to take from the fire the sacred fire, just as has been related.",
      "links": "<a href='/AIV/24/29/1-14'>Jer. 29:1-14</a>; <a href='/AIV/16/1/1-3'>Neh. 1:1-3</a>",
      "comment": "This introduces the tradition surrounding Jeremiah and the preservation of sacred elements during the exile, a theme present in other post-exilic books. The emphasis on safeguarding divine things echoes the continuity and protection of holy faith through tribulations."
    },
    {
      "pk": 21002002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 2,
      "text": "He also gave them the law, telling them not to forget the commandments of the Lord, and not to be led astray in their minds upon seeing idols of gold and silver and their adornments.",
      "links": "<a href='/AIV/2/20/1-17'>Exod. 20:1-17</a>; <a href='/AIV/5/6/12-14'>Deut. 6:12-14</a>",
      "comment": "Jeremiah's words reinforce the enduring call to fidelity to God's commandments, even amidst foreign cultures. The rejection of idolatry and cling to divine law foreshadows Christ's teaching to worship in spirit and truth (<a href='/AIV/43/4/23'>John 4:23</a>)."
    },
    {
      "pk": 21002003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 3,
      "text": "With these words, he exhorted them to never let the law fade from their hearts.",
      "links": "<a href='/AIV/19/119/11'>Ps. 119:11</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "A heart-centered faith is encouraged; the law written on the heart parallels the new covenant promise, a theme fulfilled in Christ’s indwelling Holy Spirit (<a href='/AIV/58/8/10'>Heb. 8:10</a>)."
    },
    {
      "pk": 21002004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 4,
      "text": "It is reported in the records, by the same writing, that Jeremiah, being warned by God, took the tent, the ark, and the altar of incense, and went out to the mountain where Moses had gone up and seen the inheritance of God.",
      "links": "<a href='/AIV/5/34/1'>Deut. 34:1</a>; <a href='/AIV/2/40/3'>Exod. 40:3</a>",
      "comment": "God’s instructions to Jeremiah to safeguard sacred objects demonstrates the enduring importance of tangible signs of God’s covenant, anticipating Christ as the definitive tabernacle (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 21002005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 5,
      "text": "When Jeremiah arrived, he found a cavern and brought the tent, the ark, and the altar of incense into it, then sealed the entrance.",
      "links": "<a href='/AIV/11/8/10-11'>1 Kings 8:10-11</a>",
      "comment": "The hidden sacred objects signify the temporary withdrawal of God’s visible presence and anticipate restoration—an idea later fulfilled spiritually in Christ’s resurrection, where the hidden becomes revealed (<a href='/AIV/51/3/3'>Col. 3:3-4</a>)."
    },
    {
      "pk": 21002006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 6,
      "text": "Some of those who followed him tried to mark the way, but they could not find it.",
      "links": "<a href='/AIV/2/25/9'>Exod. 25:9</a>",
      "comment": "The mystery of the hidden things again points to divine providence; the inability to locate them underscores God’s sovereignty over holy mysteries, foreshadowed in the hiddenness of Christ’s childhood and the sacraments."
    },
    {
      "pk": 21002007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 7,
      "text": "When Jeremiah learned of it, he rebuked them, saying, 'The place will remain unknown until God gathers His people again and shows them mercy.'",
      "links": "<a href='/AIV/24/31/8-9'>Jer. 31:8-9</a>",
      "comment": "The prophecy of restoration and mercy points to the final gathering of God’s people, which believers see spiritually fulfilled in Christ’s work and the unified body of believers (<a href='/AIV/45/11/25-26'>Rom. 11:25-26</a>)."
    },
    {
      "pk": 21002008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 8,
      "text": "Then the Lord will reveal these things, and the glory of the Lord and the cloud will appear, just as it was shown to Moses, and as Solomon prayed that the holy place might be glorified greatly.",
      "links": "<a href='/AIV/2/40/34-35'>Exod. 40:34-35</a>; <a href='/AIV/11/8/10-11'>1 Kings 8:10-11</a>",
      "comment": "Here is an eschatological hope for God’s glory to return. Christians interpret the cloud and glory as foreshadowing the glory revealed through Christ and the outpouring of the Spirit at Pentecost (<a href='/AIV/44/2/2-4'>Acts 2:2-4</a>)."
    },
    {
      "pk": 21002009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 9,
      "text": "It is also recorded how Solomon, full of wisdom, offered a dedication and prayer at the consecration of the temple.",
      "links": "<a href='/AIV/11/8/22-53'>1 Kings 8:22-53</a>",
      "comment": "Recalling the temple’s consecration ties this narrative to the continuity of worship through temple and priesthood, elements fulfilled and spiritualized in Christ as the true high priest (<a href='/AIV/58/4/14'>Heb. 4:14</a>)."
    },
    {
      "pk": 21002010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 10,
      "text": "It is stated in the writings that at the offering, the fire came down and consumed the burnt offering, just as it did in the days of Moses, for Moses prayed and fire came down from heaven and consumed the sacrifices.",
      "links": "<a href='/AIV/3/9/24'>Lev. 9:24</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "Divine fire signifies God’s acceptance and presence, recalling the Pentecost tongues of fire—a visible sign of God’s new covenant work through the Spirit (<a href='/AIV/44/2/3'>Acts 2:3</a>)."
    },
    {
      "pk": 21002011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 11,
      "text": "And Solomon, in like manner, prayed and fire came down from heaven and burned up the whole burnt offering.",
      "links": "<a href='/AIV/14/7/1'>2 Chr. 7:1</a>",
      "comment": "Solomon’s prayer echoes Moses, affirming the continuing pattern of prayer, sacrifice, and divine response, prefiguring Christ’s ultimate sacrifice on the cross."
    },
    {
      "pk": 21002012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 12,
      "text": "And Moses said, 'Because the sin offering was not eaten, it was consumed.'",
      "links": "<a href='/AIV/3/10/16-20'>Lev. 10:16-20</a>",
      "comment": "Reference to prescribed rituals shows the importance of obedience even in details—foreshadowing Christ’s full obedience and fulfillment of the law (<a href='/AIV/40/5/17'>Matt. 5:17</a>)."
    },
    {
      "pk": 21002013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 13,
      "text": "The same things were written and explained in the records and memoirs of Nehemiah, and also how he founded a library and collected books concerning the kings, prophets, and writings of David, and the letters of royal gifts.",
      "links": "<a href='/AIV/16/13/1-3'>Neh. 13:1-3</a>",
      "comment": "Early compilation of sacred writings mirrors the later development of the Scriptures; it testifies to the value of tradition and written record in preserving faith."
    },
    {
      "pk": 21002014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 14,
      "text": "In the same way, Judas gathered together all the writings that had been scattered by the war, and so they remain with us.",
      "links": "<a href='/AIV/16/8/1-8'>Neh. 8:1-8</a>",
      "comment": "The assembly and preservation of sacred writings demonstrate the importance of continuity and apostolic tradition, a practice continued through the centuries."
    },
    {
      "pk": 21002015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 15,
      "text": "If you need these things, send for them.",
      "links": "<a href='/AIV/16/2/7-8'>Neh. 2:7-8</a>",
      "comment": "An invitation for mutual sharing of tradition and knowledge, reflecting the unity and communal aspect of the faith community."
    },
    {
      "pk": 21002016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 16,
      "text": "Now, as we are about to celebrate the purification, we write to you. You should do the same.",
      "links": "<a href='/AIV/42/2/22'>Luke 2:22</a>",
      "comment": "Reference to the purification suggests continuity with temple practices and worship, which are fulfilled spiritually for Christians in the cleansing work of Christ."
    },
    {
      "pk": 21002017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 17,
      "text": "For God has saved all His people and given the kingdom, priesthood, and sanctuary to us, just as He promised through the law.",
      "links": "<a href='/AIV/2/19/6'>Exod. 19:6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "God’s promises involving kingdom, priesthood, and sanctuary are central themes found in both Testaments. The reality of a priestly nation becomes spiritualized in the new covenant community (<a href='/AIV/66/1/6'>Rev. 1:6</a>)."
    },
    {
      "pk": 21002018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 18,
      "text": "Just as He promised in the law, we have high hopes that God will soon have mercy on us and gather us from every land under heaven to His holy place, for He has rescued us from great evils and purified the place.",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/23/11/12'>Isa. 11:12</a>",
      "comment": "Anticipating a worldwide gathering, foreshadowing the global nature of Christ’s kingdom and the restoration of all believers into one united family."
    },
    {
      "pk": 21002019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 19,
      "text": "The purification of the temple will be celebrated on the twenty-fifth of Kislev. We thought it right to inform you about it.",
      "links": "<a href='/AIV/43/10/22'>John 10:22</a>",
      "comment": "This verse refers to the feast of rededication (Hanukkah) later alluded to in John’s Gospel. The idea of temple purification connects to the sanctification of believers and the indwelling of the Holy Spirit."
    },
    {
      "pk": 21002020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 20,
      "text": "God has delivered us from great dangers and has fought in battle against King Antiochus.",
      "links": "<a href='/AIV/27/8/21-25'>Dan. 8:21-25</a>",
      "comment": "God’s deliverance from Antiochus prefigures His victory over evil, culminating in Christ’s triumph over sin and death."
    },
    {
      "pk": 21002021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 21,
      "text": "Therefore, we are grateful to offer sacrifices, to present the lamp, and to set out the showbread.",
      "links": "<a href='/AIV/2/25/30'>Exod. 25:30</a>; <a href='/AIV/3/24/5-7'>Lev. 24:5-7</a>",
      "comment": "The restoration of temple rituals foreshadows Christian worship centered around spiritual sacrifices and the Bread of Life (<a href='/AIV/43/6/35'>John 6:35</a>)."
    },
    {
      "pk": 21002022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 22,
      "text": "This is all explained in detail in the writings about Judas Maccabeus, his brothers, and the purification of the great temple, the dedication of the altar,",
      "links": "<a href='/AIV/43/10/22'>John 10:22</a>",
      "comment": "Historical records witness to God’s faithfulness through hard times and the tradition of altar dedication mirrors the new covenant celebration of Christ’s sacrificial offering."
    },
    {
      "pk": 21002023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 23,
      "text": "as well as battles against Antiochus Epiphanes, and his son Eupator,",
      "links": "<a href='/AIV/27/11/21'>Dan. 11:21</a>",
      "comment": "Reference to historical events roots salvation history in concrete reality; God’s actions in history foreshadow His saving acts in the fullness of time through Christ."
    },
    {
      "pk": 21002024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 24,
      "text": "and the visions that appeared from heaven to those who bravely fought to restore Jewish honor.",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/44/7/55-56'>Acts 7:55-56</a>",
      "comment": "Heavenly visions reinforce the reality of the supernatural dimension to God’s deliverance, foreshadowed in Christ's resurrection and appearances to his disciples."
    },
    {
      "pk": 21002025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 25,
      "text": "Because Jason of Cyrene has set out, in five volumes, to recount all these happenings,",
      "links": "",
      "comment": "Reference to Jason’s work shows care for accurate tradition and testimony, reflecting the commitment to truth and careful transmission of faith."
    },
    {
      "pk": 21002026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 26,
      "text": "we have tried, in this summary, to compress into one book what is useful for reflection.",
      "links": "",
      "comment": "A faithful summary ensures accessibility—a model for catechesis and transmission of faith, focused on essentials."
    },
    {
      "pk": 21002027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 27,
      "text": "For, attempting to create a concise record from a great mass of material, is not easy—it involves hard work and sleepless effort, just as compiling a grand banquet for others.",
      "links": "",
      "comment": "Comparison to a banquet calls to mind Divine feasting—the spiritual nourishment given to God’s people through the sacred tradition and Word."
    },
    {
      "pk": 21002028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 28,
      "text": "But just as preparing a banquet pleases many, so too does the careful retelling of sacred history bring delight to those who read.",
      "links": "",
      "comment": "The analogy of spiritual nourishment aligns with the way believers partake in the Word and spiritual mysteries for growth and unity."
    },
    {
      "pk": 21002029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 29,
      "text": "For us, who have summarized, it is a challenge; for those who simply read, it is easier.",
      "links": "",
      "comment": "Recognition of the labor involved in transmission echoes the role of teaching authority and care for the faithful."
    },
    {
      "pk": 21002030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 30,
      "text": "But, just as the builder of a new house must concern himself with the whole structure, so too the one presenting history must care for each part. Yet, for the one who enters it, it is easy to enjoy.",
      "links": "",
      "comment": "This image suggests the value of a well-ordered faith, built with care—an echo of apostolic foundations for the lasting building of the Church."
    },
    {
      "pk": 21002031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 31,
      "text": "So from here, we will begin the story, giving only a summary. For we ourselves are not writing to outdo Jason’s work, but to provide a brief source for those who wish to read.",
      "links": "",
      "comment": "Emphasizes humility and service, the goal being edification and unity for all readers—not rivalry, but faithful witness."
    },
    {
      "pk": 21002032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 2,
      "verse": 32,
      "text": "For as the farmer does not aim for greatness by collecting all the grains, so too is our effort for those who desire to reflect quietly, and for those who wish to memorize.",
      "links": "",
      "comment": "The metaphor of the farmer and grain reflects the spiritual work of sowing and reaping in due season, a common image for teaching and spiritual formation throughout Scripture (<a href='/AIV/48/6/9'>Gal. 6:9</a>)."
    }
  ],
  "translatedAt": "2025-12-24T05:29:55.952Z"
}