{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 12,
  "verses": [
    {
      "pk": 20012001,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 1,
      "text": "When these agreements were completed, Lysias returned to the king, and the Jews went about farming their land.",
      "links": "<a href='/AIV/14/11/34-38'>2 Macc. 11:34-38</a>; <a href='/AIV/27/11/33'>Dan. 11:33</a>",
      "comment": "After Lysias made peace, the Jewish people experienced a time of restoration, returning to their normal way of life. The context recalls periods in Israel's history when God allowed return and rebuilding after hardship."
    },
    {
      "pk": 20012002,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 2,
      "text": "But some of the local area commanders, Timotheus and Apollonius, the son of Gennaeus, and also Hieronymus and Demophon, along with Nicanor, commander of Cyprus, would not let the Jews live in peace.",
      "links": "<a href='/AIV/14/10/24'>2 Macc. 10:24</a>",
      "comment": "Opponents of Israel's faith often rose up to cause trouble, much like in other biblical times. The pattern of opposition can be compared to the ongoing struggle of God’s people throughout salvation history."
    },
    {
      "pk": 20012003,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 3,
      "text": "People from Joppa, too, committed a wicked deed: they invited the Jews living among them to board ships with their wives and children, claiming they wanted to show them goodwill.",
      "links": "<a href='/AIV/44/10/23'>Acts 10:23</a>",
      "comment": "Joppa’s action is striking for its deception. The story reminds us of false promises and betrayals often faced by God’s people, as seen later even in the New Testament (Acts 10:23)."
    },
    {
      "pk": 20012004,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 4,
      "text": "But when the Jews accepted, at least two hundred of them sailed off, and the people of Joppa drowned them at sea, not less than two hundred.",
      "links": "<a href='/AIV/19/35/11'>Ps. 35:11</a>",
      "comment": "The treacherous murder of these Jews illustrates the depth of persecution endured, echoing lamentations in the Psalms against enemies."
    },
    {
      "pk": 20012005,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 5,
      "text": "When Judas learned of this cruelty done to his people, he called together the men and, after calling on God, leader of all, to judge justly, he attacked the murderers at night, burning the harbor and the ships.",
      "links": "<a href='/AIV/19/7/11'>Ps. 7:11</a>; <a href='/AIV/14/8/23'>2 Macc. 8:23</a>",
      "comment": "Judas' response involved both prayer and action, a pattern found throughout Scripture. The appeal to God's justice reflects the Jewish tradition of entrusting vengeance to the Lord (Ps. 7:11)."
    },
    {
      "pk": 20012006,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 6,
      "text": "He killed those who had fled there, and as he left, he had the city filled with terror.",
      "links": "<a href='/AIV/19/58/9-10'>Ps. 58:9-10</a>",
      "comment": "The severity of Judas’ actions serves as a retributive measure in alignment with justice, paralleling the psalmist’s confidence in God avenging wrongdoing (Ps. 58:10)."
    },
    {
      "pk": 20012007,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 7,
      "text": "When he learned that the people of Jamnia planned to treat the Jews living among them in a similar way,",
      "links": "<a href='/AIV/14/12/3'>2 Macc. 12:3</a>",
      "comment": "The threat of widespread violence against the faithful prompts further intervention, mirroring earlier instances of Jewish protection from their enemies."
    },
    {
      "pk": 20012008,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 8,
      "text": "he attacked the Jamnians by night, set fire to the harbor and fleet, and so the glow was seen as far as Jerusalem, two hundred miles away.",
      "links": "<a href='/AIV/15/7/9'>Nehemiah 7:9</a>",
      "comment": "This verse highlights divine deliverance and miraculous signs, reminiscent of Old Testament moments when God’s presence was revealed in fire."
    },
    {
      "pk": 20012009,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 9,
      "text": "When Judas and his men had gone nine days, gathering the spoils of battle for the wounded, widows, orphans, and elderly, they encouraged everyone to keep the law as their highest goal.",
      "links": "<a href='/AIV/24/22/16'>Jer. 22:16</a>, <a href='/AIV/19/68/5'>Ps. 68:5</a>",
      "comment": "Their care for vulnerable groups suggests a spiritual calling to charity and mercy, a constant theme in the Scriptures (Ps. 68:5), and a clear prefigurement of Christ’s teaching about caring for the least among us."
    },
    {
      "pk": 20012010,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 10,
      "text": "Then they entered into the region of Gorgias, leader of the Idumeans, who came out against them with three thousand men and four hundred cavalry.",
      "links": "<a href='/AIV/14/10/14'>2 Macc. 10:14</a>",
      "comment": "The context includes military challenges against God's people, similar to the opposition faced by Israel in the Old Testament."
    },
    {
      "pk": 20012011,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 11,
      "text": "After a fierce battle, Judas’ men prayed to God for help and were victorious over Gorgias and his men, so that many of the enemy fell and the rest fled.",
      "links": "<a href='/AIV/07/7/22'>Judges 7:22</a>, <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Victory is attributed to prayer and divine intervention rather than human strength (Ps. 44:3). This foreshadows New Testament themes of spiritual warfare and dependence on God."
    },
    {
      "pk": 20012012,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 12,
      "text": "Judas seized on the villages nearby, setting fire to them; he won considerable plunder, and so he calmed the people of Gorgias.",
      "links": "<a href='/AIV/14/8/8'>2 Macc. 8:8</a>",
      "comment": "The conquering and distributing of plunder echoed ancient practices of dedicating the spoils to God’s service, as seen in earlier biblical battles."
    },
    {
      "pk": 20012013,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 13,
      "text": "Having taken Gaza, he besieged the fortress and burned it, with everything inside.",
      "links": "<a href='/AIV/07/6/25'>Judges 6:25</a>",
      "comment": "Gaza's destruction recalls judges-era purifications and the zeal for holiness by eradicating idolatrous strongholds (Judg. 6:25)."
    },
    {
      "pk": 20012014,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 14,
      "text": "He then moved on to the city of Jamnia, where, after capturing it, he slaughtered those who defended the city and then withdrew.",
      "links": "",
      "comment": "The text continues the theme of justice as an act of communal deliverance, similar to episodes of judgment described in Joshua."
    },
    {
      "pk": 20012015,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 15,
      "text": "Afterward, Judas assembled his soldiers and marched towards Ephron, a strongly fortified city on a major road.",
      "links": "<a href='/AIV/01/13/18'>Gen. 13:18</a>",
      "comment": "Ephron's strategic position recalls its mention in Genesis as a place of importance in Israel’s history."
    },
    {
      "pk": 20012016,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 16,
      "text": "He could not pass through or leave off attacking since the city blocked all passage and its people defended the walls.",
      "links": "",
      "comment": "Israel often had to confront hostile forces that hindered their journey, connecting this episode with the Israelites’ journey to the Promised Land."
    },
    {
      "pk": 20012017,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 17,
      "text": "Judas called upon God, the great commander, who shatters the strongest of armies.",
      "links": "<a href='/AIV/19/46/7'>Ps. 46:7</a>, <a href='/AIV/11/18/36'>1 Kings 18:36</a>",
      "comment": "Judas’ prayer shows reliance on God for victory, a spiritual principle consistent in both Old and New Testaments."
    },
    {
      "pk": 20012018,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 18,
      "text": "With God’s help, they captured the city, killed over twenty-five thousand men, and looted it before moving on.",
      "links": "<a href='/AIV/06/10/20'>Joshua 10:20</a>",
      "comment": "God’s powerful intervention echoes earlier victories attributed to Him alone, emphasizing that spiritual success comes from divine providence."
    },
    {
      "pk": 20012019,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 19,
      "text": "After crossing the Jordan into the large plain in front of Beth-shan, Judas gathered his men.",
      "links": "<a href='/AIV/09/31/10'>1 Sam. 31:10</a>",
      "comment": "Beth-shan is referenced elsewhere in Scripture (1 Sam. 31:10) as a key location in battles involving God’s people."
    },
    {
      "pk": 20012020,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 20,
      "text": "He organized the troops and entered into the territory of the Scythians.",
      "links": "",
      "comment": "Movement into new territory symbolizes Israel’s expanding influence and God’s sovereignty over all nations."
    },
    {
      "pk": 20012021,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 21,
      "text": "Timotheus gathered foreign troops, many horsemen, and a large army from Asia, came to attack Judas.",
      "links": "<a href='/AIV/14/10/24'>2 Macc. 10:24</a>",
      "comment": "The coalition against Judah mirrors Old Testament alliances forged against God’s people, yet God’s protection is steadfast."
    },
    {
      "pk": 20012022,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 22,
      "text": "The Jews saw this huge force and trembled, so Judas prayed to God, Who alone gives victory, urging His followers to trust.",
      "links": "<a href='/AIV/19/60/11'>Ps. 60:11</a>",
      "comment": "This verse highlights faith in God over fear, reinforcing the spiritual lesson of trusting in divine strength rather than numbers."
    },
    {
      "pk": 20012023,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 23,
      "text": "He struck down Timotheus’s force, about twenty thousand men; the rest fled into a strong fortress called Gazara.",
      "links": "<a href='/AIV/14/10/32'>2 Macc. 10:32</a>",
      "comment": "Victory despite overwhelming odds demonstrates God’s sovereignty and favor towards those who serve Him."
    },
    {
      "pk": 20012024,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 24,
      "text": "Judas’s brother Simon surrounded the fortress and fought bravely against it for several days.",
      "links": "<a href='/AIV/14/10/19'>2 Macc. 10:19</a>",
      "comment": "Simon’s participation advances the idea of brotherly support in spiritual and military struggles, reminiscent of united effort in building up God’s people."
    },
    {
      "pk": 20012025,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 25,
      "text": "The defenders called for a truce; Simon accepted and expelled them, then captured the city and took its spoils.",
      "links": "",
      "comment": "Truce and mercy, but also judgment, reflect both God’s justice and compassion in warfare, balancing discipline and grace."
    },
    {
      "pk": 20012026,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 26,
      "text": "Judas also attacked the city of Karnion and the sanctuary of Atargatis, destroying them with fire.",
      "links": "<a href='/AIV/05/7/5'>Deut. 7:5</a>",
      "comment": "Destruction of pagan sanctuaries reaffirms the command to purify worship central to Israel’s mission (Deut. 7:5)."
    },
    {
      "pk": 20012027,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 27,
      "text": "After this, they turned towards Ephron, a fortified city with a large population of different peoples. Brave young men defended it walls.",
      "links": "",
      "comment": "The challenge of diverse opposition echoes the spiritual struggle against sin and division."
    },
    {
      "pk": 20012028,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 28,
      "text": "Judas called on God, and with His power, Ephron was taken by storm.",
      "links": "<a href='/AIV/19/60/11'>Ps. 60:11</a>",
      "comment": "God’s deliverance is again emphasized. Prayer and reliance on divine strength is a motif pointing towards Christian practices and the value of trusting God in spiritual conflict."
    },
    {
      "pk": 20012029,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 29,
      "text": "Many were killed, and the rest begged for mercy, which Judas granted. Then they looted the city.",
      "links": "",
      "comment": "Mercy and judgment exist side by side. This spiritual principle is reflected in God’s justice and the call to forgive, yet also uphold holiness."
    },
    {
      "pk": 20012030,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 30,
      "text": "The Jews then crossed the Jordan and entered a vast land called Arabia, coming upon the tribe of Bani who opposed them.",
      "links": "",
      "comment": "Jews encountering foreign opposition brings to mind the universality of God’s plan and the challenge of remaining faithful amid adversity."
    },
    {
      "pk": 20012031,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 31,
      "text": "After a fierce contest, Judas’s men defeated the Bani, accepted their pledges of peace, and returned to Jerusalem with much plunder.",
      "links": "",
      "comment": "The acceptance of peace offers and return home notes God’s provision and faithfulness, reminiscent of New Testament calls to peace and reconciliation."
    },
    {
      "pk": 20012032,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 32,
      "text": "Now, on the day after the Sabbath, the Jews went out to gather up the bodies of their fallen, to bury them with their relatives.",
      "links": "<a href='/AIV/14/8/34'>2 Macc. 8:34</a>, <a href='/AIV/21/6/3'>Eccl. 6:3</a>",
      "comment": "The reverence for burial foreshadows the respect for the body and resurrection themes in later Christian teaching."
    },
    {
      "pk": 20012033,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 33,
      "text": "They found, under the tunics of each of the dead, sacred charms taken from the idols at Jamnia, forbidden by law. The Jews saw why these men had died.",
      "links": "<a href='/AIV/02/32/8'>Exodus 32:8</a>",
      "comment": "The forbidden charms the dead carried were in violation of God’s law, recalling the golden calf episode in Exodus. This underlines the seriousness of idolatry and spiritual compromise."
    },
    {
      "pk": 20012034,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 34,
      "text": "All blessed the Lord, the righteous judge, who reveals things that are hidden.",
      "links": "<a href='/AIV/19/139/1-12'>Ps. 139:1-12</a>",
      "comment": "This inspires confidence in God’s omniscience; nothing is hidden from Him. Justice and truth will be manifested."
    },
    {
      "pk": 20012035,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 35,
      "text": "They prayed, asking that the sin they had committed might be completely erased. Judas urged the rest to keep themselves free from sin after having seen what happened to the fallen because of their sin.",
      "links": "<a href='/AIV/19/19/12'>Ps. 19:12</a>, <a href='/AIV/40/6/12'>Matt. 6:12</a>",
      "comment": "Prayer for the forgiveness of sin highlights the communal responsibility for holiness, and the need for recourse to divine mercy — foreshadowing New Testament teachings on forgiveness."
    },
    {
      "pk": 20012036,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 36,
      "text": "He then took up a collection among the soldiers, sending two thousand silver drachmas to Jerusalem to offer a sin offering. This was a good and noble act, rooted in his belief in the resurrection.",
      "links": "<a href='/AIV/14/12/45'>2 Macc. 12:45</a>, <a href='/AIV/40/22/31'>Matt. 22:31</a>",
      "comment": "Here, offering for the dead is described as ‘noble,’ done with the faith that God will raise the dead. This practice resonates with later Christian views on praying for those who have died, reinforcing belief in resurrection."
    },
    {
      "pk": 20012037,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 37,
      "text": "If he did not expect that those who died would rise again, it would have been senseless and foolish to pray for the dead.",
      "links": "<a href='/AIV/46/15/29'>1 Cor. 15:29</a>, <a href='/AIV/40/22/31'>Matt. 22:31</a>",
      "comment": "Judas’s reason for prayer is rooted in faith in resurrection. Reference to praying for the dead subtly affirms communal prayer across the entire body of believers, both living and departed."
    },
    {
      "pk": 20012038,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 38,
      "text": "But since he believed that the fallen would rise again, it was right and holy to pray for the dead, so they might be freed from their sin.",
      "links": "<a href='/AIV/46/15/42'>1 Cor. 15:42</a>, <a href='/AIV/40/22/31'>Matt. 22:31</a>",
      "comment": "This verse powerfully affirms belief in the resurrection and the efficacy of communal prayers for the departed, which later Christians continued."
    },
    {
      "pk": 20012039,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 39,
      "text": "Therefore, he made atonement for the dead, so that they might be absolved from their sin.",
      "links": "<a href='/AIV/14/12/36'>2 Macc. 12:36</a>, <a href='/AIV/62/2/2'>1 John 2:2</a>",
      "comment": "Atonement for the dead demonstrates belief in God’s mercy transcending death. This reflects divine forgiveness fully realized in the New Covenant (1 John 2:2) through Christ’s expiation."
    },
    {
      "pk": 20012040,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 40,
      "text": "Having completed all this, Judas and his army returned home with joy, glorifying God, who had shown them favor.",
      "links": "<a href='/AIV/19/126/3'>Ps. 126:3</a>",
      "comment": "Judas and his army’s gratitude is directed to God alone, expressing a heart of thanksgiving echoing many of the Psalms."
    },
    {
      "pk": 20012041,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 41,
      "text": "After these events and many prayers, God's people enjoyed a period of peace for a time.",
      "links": "<a href='/AIV/14/10/28'>2 Macc. 10:28</a>, <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "Peace follows acts of faith and prayer, reinforcing the rhythm of trial and restoration common throughout Scripture."
    },
    {
      "pk": 20012042,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 42,
      "text": "But soon, the enemies began to stir again, and Judas prepared the people for possible hardships.",
      "links": "<a href='/AIV/14/8/22'>2 Macc. 8:22</a>",
      "comment": "The pattern of conflict and peace stands as a spiritual lesson in perseverance and vigilance against evil."
    },
    {
      "pk": 20012043,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 43,
      "text": "He encouraged them to trust in the promises made by their ancestors, in the Law, and in the worship of God.",
      "links": "<a href='/AIV/05/6/5'>Deut. 6:5</a>, <a href='/AIV/14/7/27'>2 Macc. 7:27</a>",
      "comment": "Faith and tradition are highlighted as sources of strength; the Law is honored as the foundation of worship, echoing Deuteronomy’s call to love God with all one's strength."
    },
    {
      "pk": 20012044,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 44,
      "text": "And so, all were encouraged, trusting that God would reward those who remain faithful, both in this life and in the life to come.",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>, <a href='/AIV/40/19/29'>Matt. 19:29</a>",
      "comment": "The promise of reward for faithfulness bridges Old Testament hope for resurrection with Christ’s assurance of eternal life and reward for service."
    },
    {
      "pk": 20012045,
      "translation": "AIV",
      "book": 14,
      "chapter": 12,
      "verse": 45,
      "text": "Thus, the story ended with the people strengthened, their faith renewed by the actions of their leader and God’s provision in battle, and their hope fixed on eternal salvation.",
      "links": "<a href='/AIV/58/11/1'>Heb. 11:1</a>, <a href='/AIV/46/15/51-52'>1 Cor. 15:51-52</a>",
      "comment": "Eternal salvation is the ultimate focus, the culmination of faith and perseverance. This anticipates the fulfillment of God’s promises in the New Testament — resurrection through and in Christ, and the unity of the whole people of God."
    }
  ],
  "translatedAt": "2025-12-23T09:39:42.039Z"
}