{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 6,
  "verses": [
    {
      "pk": 2606001,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 1,
      "text": "Not long after this, the king sent an old man from Athens to force the Jews to abandon the customs of their ancestors and to stop living by the laws of God.",
      "links": "<a href='/AIV/14/2/21'>2 Macc. 2:21</a>; <a href='/AIV/3/18/4'>Lev. 18:4</a>",
      "comment": "The appointment of an outsider to enforce religious assimilation represents a direct challenge to the divine law received by the Jewish people, prefiguring later persecutions of believers holding to revealed truth."
    },
    {
      "pk": 2606002,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 2,
      "text": "He also ordered that the temple in Jerusalem be renamed for the Olympian Zeus, and that the temple in Samaria be named for Zeus the Friend of Strangers, as the people in that place had requested.",
      "links": "<a href='/AIV/11/8/27'>1 Kings 8:27</a>",
      "comment": "The desecration and renaming of the temple underscores the battle between the worship of the one God and the pagan influences; similar typology appears later during Roman occupation, deepening the foreshadowing of Christ's own cleansing of the temple."
    },
    {
      "pk": 2606003,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 3,
      "text": "The oppression was severe and terrible for the people.",
      "links": "<a href='/AIV/19/44/17-19'>Ps. 44:17–19</a>",
      "comment": "This verse shows the extent to which faithfulness to God may require suffering and steadfastness, echoing the psalms where Israel endures persecution for God's sake."
    },
    {
      "pk": 2606004,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 4,
      "text": "For Gentiles filled the temple with wild revelry and debauchery. They played games with prostitutes inside the sacred precincts, bringing in forbidden things.",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "Defilement of the temple foreshadows later events in salvation history where true worship is threatened by corruption; see typology with Ezekiel’s vision of the abominations in the temple."
    },
    {
      "pk": 2606005,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 5,
      "text": "The altar was covered with sacrifices that were prohibited by law.",
      "links": "<a href='/AIV/3/11/44'>Lev. 11:44</a>; <a href='/AIV/19/106/37-39'>Ps. 106:37–39</a>",
      "comment": "Illicit offerings contrast legal sacrificial worship prescribed in the Torah, highlighting a spiritual warfare over the right way to honor God."
    },
    {
      "pk": 2606006,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 6,
      "text": "It was forbidden for anyone to keep the sabbath or to celebrate the traditional feasts.",
      "links": "<a href='/AIV/2/20/8-11'>Exodus 20:8–11</a>; <a href='/AIV/3/23/1-4'>Lev. 23:1–4</a>",
      "comment": "Forbidding Sabbath and festivals attacks core elements of divine worship, setting precedents for later attempts to restrict communal worship among believers."
    },
    {
      "pk": 2606007,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 7,
      "text": "People were forced by bitter constraint to honor the king’s birthday each month by eating the sacrifices, and they were compelled to join in the festival of Dionysus, wearing wreaths of ivy.",
      "links": "<a href='/AIV/27/3/7'>Daniel 3:7</a>",
      "comment": "Participation in pagan rituals was a sign of political and spiritual allegiance to the worldly power, similar to the image-worship demanded in Daniel’s time."
    },
    {
      "pk": 2606008,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 8,
      "text": "Such orders went out to the neighboring Greek cities, forcing them to do likewise to the Jews. They were compelled to participate in similar sacrifices.",
      "links": "<a href='/AIV/15/3/3'>Ezra 3:3</a>",
      "comment": "The spread of anti-worship legislation mirrors later government interventions into religious practice, reminding of the importance of fidelity."
    },
    {
      "pk": 2606009,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 9,
      "text": "Anyone caught with the scroll of the Law was put to death according to the royal decree, and anyone who practiced or lived by the traditions was similarly punished.",
      "links": "<a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "The persecution of those who keep the Law demonstrates the costliness of discipleship and the imperative of treasuring God's Word, with parallels to later periods under oppressive regimes."
    },
    {
      "pk": 2606010,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 10,
      "text": "Month after month, on the king’s birthday, they brutalized those brought before them for refusing to participate in these rituals.",
      "links": "<a href='/AIV/58/11/35-38'>Heb. 11:35–38</a>",
      "comment": "The suffering of the faithful calls to mind the ‘hall of faith’ in Hebrews, where steadfast endurance is glorified."
    },
    {
      "pk": 2606011,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 11,
      "text": "In their zeal for devotion, some from among Israel were discovered to have secretly observed the feast of Tabernacles; they were captured and publicly punished by being burned alive.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>",
      "comment": "Devotion in secret at personal cost illustrates the hidden life of spiritual commitment, a theme later seen in the catacombs and the quiet endurance of the early Church."
    },
    {
      "pk": 2606012,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 12,
      "text": "Let this be a warning for those who come after us—not to give up, but to endure under all circumstances and not to be led astray by sins.",
      "links": "<a href='/AIV/58/12/3-4'>Heb. 12:3–4</a>",
      "comment": "Endurance and perseverance in the face of suffering is a consistent biblical call, urging believers to remain steadfast."
    },
    {
      "pk": 2606013,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 13,
      "text": "It is not a sign of weakness, but of God’s robust justice that those who go astray are chastened for a time so that they may find mercy.",
      "links": "<a href='/AIV/19/119/75'>Ps. 119:75</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "Here, discipline is presented as a pathway to restoration, in line with the teaching that God’s love chastens even the righteous."
    },
    {
      "pk": 2606014,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 14,
      "text": "In contrast, with other nations the Master waits patiently until their sins reach full measure before He punishes them.",
      "links": "<a href='/AIV/1/15/16'>Gen. 15:16</a>",
      "comment": "This doctrine of gradual judgement delivers an important insight into God’s providence and timing; for His people, correction is a sign of belonging, rather than abandonment."
    },
    {
      "pk": 2606015,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 15,
      "text": "So then, He does not deal with us as He does with the rest, but lets our punishment overtake us quickly, so that His mercy might not be withdrawn.",
      "links": "<a href='/AIV/19/79/8'>Ps. 79:8</a>",
      "comment": "Swift correction is a mercy, serving to guide Israel back to covenant fidelity before God’s presence is withdrawn; this theology flows into later interpretations of suffering as sanctifying."
    },
    {
      "pk": 2606016,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 16,
      "text": "For God does not, as He has said, forsake His people completely, even in the midst of their suffering.",
      "links": "<a href='/AIV/5/31/6'>Deut. 31:6</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "Divine faithfulness remains a central theme, anticipating Christ’s assurance to never leave nor forsake His followers."
    },
    {
      "pk": 2606017,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 17,
      "text": "These words come before our account, so that our people may know that adversities are not for their destruction, but serve for correction.",
      "links": "<a href='/AIV/19/119/67'>Ps. 119:67</a>",
      "comment": "Suffering understood as discipline rather than condemnation is a framework often repeated in both Old and New Testament teaching."
    },
    {
      "pk": 2606018,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 18,
      "text": "Elazar, one of the leading teachers, a man well advanced in age, renowned for his noble appearance, was forced to open his mouth to eat unclean meat.",
      "links": "<a href='/AIV/3/11/47'>Lev. 11:47</a>",
      "comment": "The story now turns to personal courage under persecution, highlighting the model of faithfulness among the spiritual leaders."
    },
    {
      "pk": 2606019,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 19,
      "text": "But he, choosing an honorable death rather than an unlawful life, spat it out and went forward willingly to the torture chamber.",
      "links": "<a href='/AIV/58/11/24'>Heb. 11:24</a>; <a href='/AIV/27/6/22'>Daniel 6:22</a>",
      "comment": "Elazar’s resolve echoes Moses and Daniel, choosing holiness and truth over personal safety."
    },
    {
      "pk": 2606020,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 20,
      "text": "It was unlawful for him even to pretend to eat such food, not just for his own sake, but for the sake of preserving the traditions.",
      "links": "<a href='/AIV/3/11/7-8'>Lev. 11:7–8</a>",
      "comment": "Upholding both private and public witness is emphasized, suggesting the elevated importance of visible faith within the community."
    },
    {
      "pk": 2606021,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 21,
      "text": "Some of those in charge, longstanding friends, out of compassion for him, tried to persuade him to bring his own meat, proper according to the Law, and act as if he were eating what had been ordered by the king.",
      "links": "<a href='/AIV/26/14/14'>Ezek. 14:14</a>",
      "comment": "This attempt at compromise presents the moral dilemma about the place of true witness versus simulated compliance."
    },
    {
      "pk": 2606022,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 22,
      "text": "But he refused their suggestion, choosing instead the path of suffering, declaring that it would be shameful, in his old age, to give a bad example of hypocrisy.",
      "links": "<a href='/AIV/19/71/18'>Ps. 71:18</a>; <a href='/AIV/40/6/24'>Matt. 6:24</a>",
      "comment": "True integrity is favored above life itself; the passage underscores the gravity of scandal and the vital role of testimony by elders."
    },
    {
      "pk": 2606023,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 23,
      "text": "“Suppose for a short moment I do avoid punishment from men, yet whether living or dead I shall not escape the hands of the Almighty,” he said.",
      "links": "<a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "Fear of God above all else is an essential biblical principle, mirrored in Christ’s own teaching on eternal judgement."
    },
    {
      "pk": 2606024,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 24,
      "text": "He continued, “So I will show courage now and leave a noble example for those who come after me, so that they may see, even in death, how one ought to die for the sake of the Law.”",
      "links": "<a href='/AIV/47/1/9'>2 Cor. 1:9</a>; <a href='/AIV/58/11/13'>Heb. 11:13</a>",
      "comment": "Martyrdom as ultimate witness prefigures the later accounts of saints whose deaths spread faith, building the foundations of tradition."
    },
    {
      "pk": 2606025,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 25,
      "text": "After speaking this, he was taken to the torture chamber.",
      "links": "",
      "comment": "Physical suffering for truth foreshadows later sacrificial acts of faith, deepening the call to steadfastness."
    },
    {
      "pk": 2606026,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 26,
      "text": "Those conducting the punishment, whom just before had been friendly, now turned against him because they felt his words were folly.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Even friends may become adversaries in matters of witness, reminiscent of other psalms about betrayal."
    },
    {
      "pk": 2606027,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 27,
      "text": "While he was being tortured, he uttered a groan and said, “The Lord in His holy knowledge knows that even though I could escape death, I suffer these pains in my body, yet in my soul I gladly endure them for His sake.”",
      "links": "<a href='/AIV/19/44/21'>Ps. 44:21</a>; <a href='/AIV/40/5/10-12'>Matt. 5:10–12</a>",
      "comment": "Enduring suffering for righteousness speaks to the mystery of redemptive pain, anticipating New Testament beatitudes about those persecuted for God’s sake."
    },
    {
      "pk": 2606028,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 28,
      "text": "Elazar died in this manner, leaving not only his courage but also a record of his virtue, not only for young people but for everyone in his nation.",
      "links": "<a href='/AIV/58/13/7'>Heb. 13:7</a>",
      "comment": "The idea of heroic witness echoes the New Testament call to imitate the faith of elders and leaders."
    },
    {
      "pk": 2606029,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 29,
      "text": "His death was mourned in the place where it happened.",
      "links": "",
      "comment": "Martyrdom elicits communal grief, establishing the example as both sobering and inspiring within sacred memory."
    },
    {
      "pk": 2606030,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 30,
      "text": "Such was the story of Elazar, who, through his life and death, left an example of courage and a memorial of integrity that will never fade.",
      "links": "<a href='/AIV/19/112/6'>Ps. 112:6</a>",
      "comment": "Integrity and witness live on after death, reminiscent of the righteous whose remembrance endures through generations."
    },
    {
      "pk": 2606031,
      "translation": "AIV",
      "book": 14,
      "chapter": 6,
      "verse": 31,
      "text": "And so, by his actions, he encouraged many in his people to stand firm in their faith, even at the cost of their lives.",
      "links": "<a href='/AIV/40/16/24-26'>Matt. 16:24–26</a>",
      "comment": "This final verse illustrates the powerful effect of exemplary sacrifice on the faith of the community; it anticipates future deeds of self-offering for the sake of truth and tradition."
    }
  ],
  "translatedAt": "2025-12-23T09:36:04.714Z"
}