{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 7,
  "verses": [
    {
      "pk": 3208701,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 1,
      "text": "It happened that seven brothers and their mother were arrested and forced by the king to taste unlawful pork, being tortured with whips and scourges.",
      "links": "<a href='/AIV/3/11/7'>Lev. 11:7</a>; <a href='/AIV/5/14/8'>Deut. 14:8</a>",
      "comment": "The refusal to eat pork shows their faithfulness to God's law. This episode is rooted in the law regarding clean and unclean foods (see Lev. 11:7; Deut. 14:8)."
    },
    {
      "pk": 3208702,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 2,
      "text": "One of them, speaking for the others, said, “What do you hope to learn by questioning us? We are ready to die rather than break the law of our ancestors.”",
      "links": "<a href='/AIV/27/3/17-18'>Dan. 3:17-18</a>",
      "comment": "Their readiness to die recalls the faith seen in Daniel 3: the three young men refusing to bow to Nebuchadnezzar's image."
    },
    {
      "pk": 3208703,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 3,
      "text": "The king became furious and commanded that pans and cauldrons be heated.",
      "links": "",
      "comment": "The escalation of punishment demonstrates the cost of true fidelity to God's commands."
    },
    {
      "pk": 3208704,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 4,
      "text": "These were quickly made hot, and then he commanded his men to cut out the tongue of the one who had spoken, to scalp him, and to cut off his hands and feet, while the other brothers and their mother looked on.",
      "links": "",
      "comment": "The suffering of the martyrs is depicted in graphic detail, prefiguring the suffering of future saints."
    },
    {
      "pk": 3208705,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 5,
      "text": "When he was reduced to a helpless, breathing carcass, the king ordered that he be brought to the fire and fried, while the smoke from the pan spread far and wide. But the rest, together with their mother, encouraged one another to die nobly, saying,",
      "links": "",
      "comment": "Despite extreme torture, they showed unity and courage, testifying to the strength found in community and faith."
    },
    {
      "pk": 3208706,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 6,
      "text": "“The Lord God is watching over us. Surely he will pity us, as Moses declared in his song, when he said, ‘He will have compassion on his servants.’”",
      "links": "<a href='/AIV/5/32/36'>Deut. 32:36</a>",
      "comment": "They recall Deut. 32:36. This expresses confidence in God's mercy for those who are faithful."
    },
    {
      "pk": 3208707,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 7,
      "text": "After the first brother died in this way, they brought forward the second to mock him. They tore the skin from his head and asked, “Will you eat before your body is punished limb by limb?”",
      "links": "",
      "comment": "Each brother is tested in his own way, yet their resolve remains unshaken."
    },
    {
      "pk": 3208708,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 8,
      "text": "But he replied in his native language, “No.” And so he too was tortured in the same manner as the first.",
      "links": "",
      "comment": "The original text emphasizes the use of their 'native language,' indicating deep identity with their heritage."
    },
    {
      "pk": 3208709,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 9,
      "text": "As he was dying, he said, “You wicked man, you take our lives away from this world, but the King of the world will raise us up to live again forever, because we die for his laws.”",
      "links": "<a href='/AIV/27/12/2'>Dan. 12:2</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "This is a strong assertion of the resurrection of the dead (Dan. 12:2), a doctrine developed in later Judaism and affirmed by Jesus (John 11:25)."
    },
    {
      "pk": 3208710,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 10,
      "text": "After him, the third one was tortured. When it was demanded that he put out his tongue, he did so quickly, and bravely stretched forth his hands,",
      "links": "",
      "comment": "The voluntary nature of his sacrifice foreshadows the self-gift seen in Christ's Passion."
    },
    {
      "pk": 3208711,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 11,
      "text": "saying courageously, “From Heaven I received these, and for the sake of his laws I give them up. From him I hope to receive them back again.”",
      "links": "<a href='/AIV/18/19/25-26'>Job 19:25-26</a>",
      "comment": "Here is a clear statement of bodily resurrection (see Job 19:25-26). The belief in restoration is foundational to later Christian faith in resurrection."
    },
    {
      "pk": 3208712,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 12,
      "text": "The king and those with him were amazed at this young man’s spirit, for he regarded his sufferings as nothing.",
      "links": "",
      "comment": "The courage of the martyrs is so striking even the persecutors marvel—highlighting the power of God’s grace."
    },
    {
      "pk": 3208713,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 13,
      "text": "After he died, they tormented and tortured the fourth brother in the same way.",
      "links": "",
      "comment": "The repetition shows the persistent and steadfast faith through trials."
    },
    {
      "pk": 3208714,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 14,
      "text": "When he was near his end, he cried out, “It is far better to be killed by men, while hoping God will raise us up again. But there will be no resurrection to life for you.”",
      "links": "<a href='/AIV/58/10/35'>Heb. 10:35</a>",
      "comment": "Here, judgment is pronounced on the persecutors, recognizing the hope of resurrection only for the righteous. Compare Heb. 10:35."
    },
    {
      "pk": 3208715,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 15,
      "text": "Next, they led the fifth brother forward and tortured him.",
      "links": "",
      "comment": "The narrative repeats, underlining the completeness of their testimony."
    },
    {
      "pk": 3208716,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 16,
      "text": "Looking at the king, he said, “You have authority among men, and though you do what you want, you yourself are immortal.",
      "links": "",
      "comment": "A stark reminder of the limits of earthly power against divine authority."
    },
    {
      "pk": 3208717,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 17,
      "text": "Do not think that God has abandoned our people. Be patient, and you will see his great power when he punishes you and your descendants.”",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>",
      "comment": "Judgment on the persecutors is aligned with Psalm 94’s promise of God’s justice for the oppressed."
    },
    {
      "pk": 3208718,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 18,
      "text": "After him, they brought the sixth brother. When he was about to die, he said, “Do not be deceived. We suffer these things because of our own sins against our God. This is why amazing things have happened to us.",
      "links": "<a href='/AIV/3/26/39-42'>Lev. 26:39-42</a>",
      "comment": "Here, he confesses the communal responsibility and punishment for sin (see Lev. 26:39-42), a theme also seen in Daniel."
    },
    {
      "pk": 3208719,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 19,
      "text": "But you, do not think you will go unpunished for trying to fight against God.”",
      "links": "<a href='/AIV/19/2/4-5'>Ps. 2:4-5</a>",
      "comment": "Echoes the warning from Psalm 2 to those who oppose the Lord."
    },
    {
      "pk": 3208720,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 20,
      "text": "But most of all, their mother was marvelously courageous and bore her suffering with hope.",
      "links": "",
      "comment": "The mother’s example is celebrated here, showing the unique strength found in maternal love—a theme later fulfilled in Mary at the Cross."
    },
    {
      "pk": 3208721,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 21,
      "text": "She watched all her seven sons die in a single day, yet she bore up bravely because of her hope in the Lord.",
      "links": "",
      "comment": "The mother’s hope in God is shown as the foundation for her extraordinary strength."
    },
    {
      "pk": 3208722,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 22,
      "text": "She urged each of them in their native language, filled with noble emotion, stirred by a woman’s reasoning to reinforce the courage of her sons.",
      "links": "",
      "comment": "Her encouragement is both motherly and wise, combining emotion and conviction."
    },
    {
      "pk": 3208723,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 23,
      "text": "She said to them, “I do not know how you came to be in my womb. I did not give you life or breath, nor did I shape each of you.",
      "links": "",
      "comment": "She acknowledges God as the author of life—a theological principle foundational for understanding God’s creative power (Gen. 1:27)."
    },
    {
      "pk": 3208724,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 24,
      "text": "Therefore, the Creator of the world, who formed humanity at its beginning, and made everything as it now is, will, in his mercy, give both breath and life back to you again, because you now disregard yourselves for the sake of his laws.”",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/27/12/2'>Dan. 12:2</a>",
      "comment": "Resurrection from the dead and bodily renewal is expected as God’s mercy. See also Genesis on God’s creative power."
    },
    {
      "pk": 3208725,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 25,
      "text": "Antiochus, suspecting insult and feeling himself mocked by her words, tried to persuade the youngest, who was still alive, not only with words but even with promises of riches and honor if he would turn from his beliefs and become a friend of the king.",
      "links": "",
      "comment": "The king tries bribery and flattery, showing how earthly temptations are used."
    },
    {
      "pk": 3208726,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 26,
      "text": "When the young man paid no attention to him, the king called the mother, urging her to advise the boy to save himself.",
      "links": "",
      "comment": "The king tries to use the deep influence of a mother to coerce him. This shows the significance of parental authority in spiritual matters."
    },
    {
      "pk": 3208727,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 27,
      "text": "After much pressure, the mother agreed to persuade her son.",
      "links": "",
      "comment": "Outwardly, the mother seems to obey, but inwardly her faith remains steadfast."
    },
    {
      "pk": 3208728,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 28,
      "text": "She leaned over him and, mocking the cruel tyrant, spoke in her native language, “My son, have pity on me, who carried you for nine months, nursed you for three years, cared for you, and brought you up to this age.",
      "links": "",
      "comment": "The mother appeals to the bond between parent and child to strengthen his resolve."
    },
    {
      "pk": 3208729,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 29,
      "text": "I beg you, my child, look at the sky and the earth; see all that is in them, and realize that God made them all from nothing, just as he made the human race.",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/58/11/3'>Heb. 11:3</a>",
      "comment": "Creation ex nihilo (out of nothing) is explicitly affirmed, an important doctrine found in Hebrew 11:3."
    },
    {
      "pk": 3208730,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 30,
      "text": "Do not be afraid of this executioner, but show yourself worthy of your brothers, accept death, so that in God’s time I may receive you back together with your brothers.”",
      "links": "",
      "comment": "She expresses hope in reunion after death, reinforcing a faith in the afterlife."
    },
    {
      "pk": 3208731,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 31,
      "text": "While she was still speaking, the young man said, “What are you waiting for? I will not obey the king’s command, but the command of the Law given to our ancestors through Moses.",
      "links": "<a href='/AIV/5/6/4-6'>Deut. 6:4-6</a>",
      "comment": "Again, devotion to the Law of Moses is the chief concern. See Deut. 6:4-6."
    },
    {
      "pk": 3208732,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 32,
      "text": "But you, who have invented every kind of evil, will not escape the hand of God.",
      "links": "<a href='/AIV/45/12/19'>Rom. 12:19</a>",
      "comment": "Divine judgment is promised for those who persist in evil (Rom. 12:19)."
    },
    {
      "pk": 3208733,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 33,
      "text": "We are suffering these things because of our own sins.",
      "links": "",
      "comment": "Personal and communal responsibility for sin is a recurring theme."
    },
    {
      "pk": 3208734,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 34,
      "text": "Even though our living Lord is angry for a little while to discipline us, he will be reconciled with his servants again.",
      "links": "<a href='/AIV/23/54/7-8'>Isa. 54:7-8</a>",
      "comment": "Divine discipline is for the sake of reconciliation and restoration (Isa. 54:7-8)."
    },
    {
      "pk": 3208735,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 35,
      "text": "But you, impious man, most wicked of all people, do not be lifted up without cause, puffed up by uncertain hopes, when you raise your hand against the children of Heaven.",
      "links": "",
      "comment": "Warns against pride and presumption before God."
    },
    {
      "pk": 3208736,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 36,
      "text": "You have not escaped the judgment of the Almighty, all-seeing God.",
      "links": "<a href='/AIV/19/139/1-12'>Ps. 139:1-12</a>",
      "comment": "The omniscience and ultimate judgment of God is clear (Ps. 139)."
    },
    {
      "pk": 3208737,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 37,
      "text": "My brothers, after enduring brief suffering, have entered into everlasting life, under God’s promise. But you, by God’s judgment, will receive the just punishment for your arrogance.",
      "links": "<a href='/AIV/45/8/18'>Rom. 8:18</a>",
      "comment": "Contrast between brief suffering and eternal reward echoes apostolic teaching (Rom. 8:18)."
    },
    {
      "pk": 3208738,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 38,
      "text": "But I, like my brothers, give up my body and life for the laws of our ancestors, calling on God to show soon his mercy to our people, and to make you acknowledge with torment that he alone is God.”",
      "links": "<a href='/AIV/2/20/11'>Exod. 20:11</a>",
      "comment": "Monotheism is emphasized—'he alone is God,' referencing the core commandment."
    },
    {
      "pk": 3208739,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 39,
      "text": "With this, the king was furious and treated him worse than the others, being full of rage over being mocked.",
      "links": "",
      "comment": "The resistance of the faithful intensifies the oppressor’s rage."
    },
    {
      "pk": 3208740,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 40,
      "text": "So, the young man died undefiled and trusting completely in the Lord.",
      "links": "",
      "comment": "Dying 'undefiled' is a mark of true holiness and sacrifice."
    },
    {
      "pk": 3208741,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 41,
      "text": "Last of all, after her sons, the mother died.",
      "links": "<a href='/AIV/19/116/15'>Ps. 116:15</a>",
      "comment": "Martyrdom of the mother caps the story. ‘Precious in the sight of the Lord is the death of his faithful ones’ (Ps. 116:15)."
    },
    {
      "pk": 3208742,
      "translation": "AIV",
      "book": 49,
      "chapter": 7,
      "verse": 42,
      "text": "So, this is how they and their mother bore themselves with courage, steadfast in faith, and endured because of their loyalty to God’s holy law.",
      "links": "<a href='/AIV/58/12/1'>Heb. 12:1</a>",
      "comment": "Their endurance for the law anticipates the New Testament idea of the 'great cloud of witnesses' (Heb. 12:1). The story highlights faithful endurance, tradition, and communal intercession, seen later as fulfilled in Christ and his followers."
    }
  ],
  "translatedAt": "2025-12-23T09:36:44.810Z"
}