{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 10,
  "verses": [
    {
      "pk": 21010001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 1,
      "text": "But Maccabeus and his companions, under the Lord’s guidance, recaptured the temple and the city of Jerusalem.",
      "links": "<a href='/AIV/21/8/1'>2Macc 8:1</a>; <a href='/AIV/13/29/15'>1Chr 29:15</a>",
      "comment": "This marks a decisive turning point, showing God’s favor upon faithful leaders who restore true worship, prefiguring the restoration found in Christ (cf. John 2:19–21)."
    },
    {
      "pk": 21010002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 2,
      "text": "They tore down the altars that the foreigners had set up in the public square and also the shrines.",
      "links": "<a href='/AIV/21/6/2'>2Macc 6:2</a>; <a href='/AIV/11/18/30'>1Kgs 18:30</a>",
      "comment": "Cleansing the city of idolatry is reminiscent of Elijah’s actions at Mount Carmel, emphasizing the singular worship of the Lord."
    },
    {
      "pk": 21010003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 3,
      "text": "After purifying the temple, they built a new altar, then, using fire from flint stones, they offered sacrifices after a two-year interval. They burned incense, lighted the lamps, and set out the bread of the Presence.",
      "links": "<a href='/AIV/2/40/24-26'>Ex. 40:24–26</a>; <a href='/AIV/3/24/5-7'>Lev. 24:5–7</a>",
      "comment": "Restoration of sacrificial worship foreshadows Christ as High Priest, fulfilling the sacrificial system and the new covenant (Hebrews 9:11–15)."
    },
    {
      "pk": 21010004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 4,
      "text": "Once these things were done, they fell on their faces and prayed, asking the Lord never again to allow them to fall into such calamities, but if they ever sinned, to discipline them with mercy rather than hand them over to blasphemous and barbaric nations.",
      "links": "<a href='/AIV/2/34/6-7'>Ex. 34:6–7</a>; <a href='/AIV/19/51/1'>Ps. 51:1</a>",
      "comment": "Their prayer invokes God’s mercy, showing an understanding of divine discipline for the sake of repentance and restoration, a pattern fulfilled in Christ’s intercession (Romans 8:34)."
    },
    {
      "pk": 21010005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 5,
      "text": "On the anniversary of the temple’s defilement by foreigners, the purification occurred on the twenty-fifth day of the same month, Kislev.",
      "links": "<a href='/AIV/3/23/15-16'>Lev. 23:15–16</a>; <a href='/AIV/43/10/22'>John 10:22</a>",
      "comment": "This established the Feast of Dedication (Hanukkah), later referenced in the Gospel when Jesus is in Jerusalem for ‘the Feast of Dedication’."
    },
    {
      "pk": 21010006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 6,
      "text": "With gladness, they kept an eight-day festival, like the Festival of Tabernacles, and carried branches and ripe fruit, singing hymns of praise to Him who had brought the purification of His holy place to fulfillment.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>; <a href='/AIV/43/7/2'>John 7:2</a>",
      "comment": "Linking the dedication to Tabernacles evokes themes of God dwelling among His people, ultimately fulfilled in Christ’s incarnation (John 1:14)."
    },
    {
      "pk": 21010007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 7,
      "text": "A decree was made by public vote and agreement among themselves that the entire Jewish nation should celebrate these days annually.",
      "links": "<a href='/AIV/17/9/27-28'>Esth. 9:27–28</a>",
      "comment": "Annual commemoration underscores the significance of collective memory and tradition in preserving God’s mighty acts among His people."
    },
    {
      "pk": 21010008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 8,
      "text": "Such things happened concerning the purification of the temple. Meanwhile, Antiochus called Epiphanes met his end elsewhere, punished for his transgressions against the altar.",
      "links": "<a href='/AIV/21/9/28'>2Macc 9:28</a>; <a href='/AIV/19/9/17'>Ps. 9:17</a>",
      "comment": "God’s judgement against a blasphemer reveals divine justice; echoes the fate of enemies of God throughout Scripture (cf. Psalm 73:19)."
    },
    {
      "pk": 21010009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 9,
      "text": "Now we shall tell how Antiochus’s son, called Eupator, led a campaign against the Jews after his father’s death.",
      "links": "<a href='/AIV/21/13/1'>2Macc 13:1</a>",
      "comment": "The narrative continues, shifting focus to ongoing trials, revealing continuity in suffering and perseverance for God’s people."
    },
    {
      "pk": 21010010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 10,
      "text": "When Eupator took over the government, a certain Gorgias was appointed commander and began to stir up hostilities against the Jews.",
      "links": "<a href='/AIV/21/8/9'>2Macc 8:9</a>",
      "comment": "Foreign oppression resumes, typifying the age-old pattern of hostility toward the worshippers of the one true God."
    },
    {
      "pk": 21010011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 11,
      "text": "Along with him, Ptolemy son of Dorymenes, and Nicanor, and Timotheus, joined in these hostilities.",
      "links": "<a href='/AIV/21/8/9-10'>2Macc 8:9–10</a>",
      "comment": "The coalition of foreign leaders demonstrates the unified opposition to the people of God, much like the confederacies against Israel in earlier times."
    },
    {
      "pk": 21010012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 12,
      "text": "But Maccabeus and his companions, by the Lord’s help, overcame these hostile commanders, recapturing the important towns they had lost earlier.",
      "links": "<a href='/AIV/21/8/22'>2Macc 8:22</a>; <a href='/AIV/19/44/5-7'>Ps. 44:5–7</a>",
      "comment": "Victory ‘by the Lord’s help’ shows the ongoing pattern that salvation comes not by human strength but by divine intervention, pointing toward Christ as the ultimate deliverer."
    },
    {
      "pk": 21010013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 13,
      "text": "As for Timotheus, who had escaped the region earlier, he was finally captured in a town fortified with many walls.",
      "links": "<a href='/AIV/21/8/30-32'>2Macc 8:30–32</a>",
      "comment": "Justice eventually reaches even the enemies hidden behind strong defenses, resonating with psalmist’s assurance of God’s victory."
    },
    {
      "pk": 21010014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 14,
      "text": "While Dositheus and one of the Maccabees’ company closed in on the stronghold, Timotheus called upon men who fortified themselves in the region, about ten thousand.",
      "links": "<a href='/AIV/21/8/31'>2Macc 8:31</a>",
      "comment": "The remnant of the enemies seek safety, depicting the futility of resisting God’s people when He is with them."
    },
    {
      "pk": 21010015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 15,
      "text": "But Maccabeus besieged them for four days, and the defenders showed confidence in the strength of their walls and abundant supplies.",
      "links": "<a href='/AIV/7/7/17-21'>Judg. 7:17–21</a>",
      "comment": "The narrative stresses reliance on human fortifications, which never stand against God’s plans."
    },
    {
      "pk": 21010016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 16,
      "text": "But on the fifth day, twenty young men among Maccabeus’ forces, inflamed with righteous anger, stormed the wall with wild courage, slaughtering everyone they met.",
      "links": "<a href='/AIV/7/6/12'>Judg. 6:12</a>",
      "comment": "Such zeal, while violent in context, underscores the seriousness of defending true worship and the consequences of opposing it."
    },
    {
      "pk": 21010017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 17,
      "text": "Others climbed up behind them, bringing up the attackers and setting fire to the towers, thus capturing the defenders.",
      "links": "<a href='/AIV/7/9/51'>Judg. 9:51</a>",
      "comment": "Victory by bold faith and divine guidance highlights the God-given courage of the faithful."
    },
    {
      "pk": 21010018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 18,
      "text": "Timotheus himself was found in a pit, where he had hidden. They killed him, and many others with him, and destroyed the stronghold.",
      "links": "<a href='/AIV/21/8/32'>2Macc 8:32</a>",
      "comment": "An end comes to the leader of oppression, echoing God’s perfect justice against those who defy Him."
    },
    {
      "pk": 21010019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 19,
      "text": "Then Maccabeus and his men quickly turned toward the walls, marching against their enemies.",
      "links": "<a href='/AIV/21/8/31'>2Macc 8:31</a>",
      "comment": "Continued offensive action shows persistence in completing the divinely appointed mission."
    },
    {
      "pk": 21010020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 20,
      "text": "Some of the defenders sold out the stronghold for personal gain, allowing some who were besieged to escape.",
      "links": "<a href='/AIV/2/23/8'>Ex. 23:8</a>",
      "comment": "Moral compromise for wealth brings destruction, highlighting God’s opposition to bribery and injustice."
    },
    {
      "pk": 21010021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 21,
      "text": "But when Maccabeus learned of this treachery, he gathered the leaders and accused those responsible for having sold their brothers’ lives for money.",
      "links": "<a href='/AIV/1/37/27'>Gen. 37:27</a>",
      "comment": "Selling out fellow believers evokes Joseph’s betrayal, reminding readers of the destructive power of avarice and the restoration possible in forgiveness."
    },
    {
      "pk": 21010022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 22,
      "text": "He executed the traitors and immediately captured the stronghold.",
      "links": "<a href='/AIV/3/24/23'>Lev. 24:23</a>",
      "comment": "Swift judgment on betrayal maintains justice and the purity of the community’s worship, consistent with God's judgment for grave offenses."
    },
    {
      "pk": 21010023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 23,
      "text": "With these matters resolved, Maccabeus moved against Carnion and Atargatis, and destroyed their shrines.",
      "links": "<a href='/AIV/11/18/40'>1Kgs 18:40</a>",
      "comment": "Destroying pagan shrines is a theme familiar from Elijah’s day, testifying to the commandment against idolatry and the need to preserve true worship."
    },
    {
      "pk": 21010024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 24,
      "text": "Timotheus gathered another army and encamped opposite Raphon across the stream.",
      "links": "<a href='/AIV/21/12/2'>2Macc 12:2</a>",
      "comment": "The enemy persists, echoing the ongoing spiritual battle faced by God’s people throughout Sacred Scripture."
    },
    {
      "pk": 21010025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 25,
      "text": "Maccabeus dispatched his scouts and found that the enemy intended a surprise attack that night on the Jewish camp.",
      "links": "<a href='/AIV/7/7/10'>Judg. 7:10</a>",
      "comment": "Vigilance and discernment are spiritual virtues recommended throughout scripture (Matthew 26:41)."
    },
    {
      "pk": 21010026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 26,
      "text": "When night fell, Maccabeus commanded his men to keep watch throughout the camp everywhere, prepared for battle.",
      "links": "<a href='/AIV/2/12/42'>Ex. 12:42</a>",
      "comment": "Readiness for spiritual and physical conflict reflects the need for persistence in prayer and faithfulness."
    },
    {
      "pk": 21010027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 27,
      "text": "With sunrise, Maccabeus and his companions invoked the Lord through prayer and petition, armed themselves, and marched forth to fight.",
      "links": "<a href='/AIV/16/4/9'>Neh. 4:9</a>; <a href='/AIV/19/18/3'>Ps. 18:3</a>",
      "comment": "Prayer before action shows dependence on God; reminiscent of Jesus praying before major events."
    },
    {
      "pk": 21010028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 28,
      "text": "After crossing the stream and engaging the enemy, they were face to face, both disputing victory, with their armies drawn up for battle.",
      "links": "<a href='/AIV/11/18/22'>1Kgs 18:22</a>",
      "comment": "The struggle for victory points to the ongoing challenge of fidelity in the midst of conflict."
    },
    {
      "pk": 21010029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 29,
      "text": "Suddenly, five men riding on horses with golden bridles appeared before the Jewish army, leading them. Two of them took Maccabeus between them, shielded him in all directions, and threw darts at the enemy.",
      "links": "<a href='/AIV/12/6/17'>2Kgs 6:17</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "This episode displays divine assistance through angelic intervention, a precursor to Christ’s promised help to His people through the Spirit and ministering angels."
    },
    {
      "pk": 21010030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 30,
      "text": "The enemy, overwhelmed by terror and confusion at the sight of these heavenly beings, fell back and fled in every direction.",
      "links": "<a href='/AIV/12/6/18'>2Kgs 6:18</a>",
      "comment": "God’s deliverance through supernatural means assures believers of protection far beyond human power."
    },
    {
      "pk": 21010031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 31,
      "text": "Twenty thousand of their men perished, and six thousand were driven into a fortified fortress nearby.",
      "links": "<a href='/AIV/9/7/6'>Josh. 7:6</a>",
      "comment": "God’s judgment is both severe and righteous toward those who oppose Him, seen repeatedly throughout biblical history."
    },
    {
      "pk": 21010032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 32,
      "text": "Maccabeus besieged them in this stronghold for four days.",
      "links": "<a href='/AIV/9/6/3-5'>Josh. 6:3–5</a>",
      "comment": "The pattern of besieging echoes Jericho’s defeat, emphasizing faith and perseverance."
    },
    {
      "pk": 21010033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 33,
      "text": "Those within, trusting the strength of their defenses, cursed and hurled insults at the Jews.",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "The enemy’s blasphemy highlights the spiritual dimension of these conflicts—a battle against the faith."
    },
    {
      "pk": 21010034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 34,
      "text": "At dawn, Maccabeus and his men, with prayers of supplication, made an assault upon the fortress, and God granted victory.",
      "links": "<a href='/AIV/19/18/3'>Ps. 18:3</a>; <a href='/AIV/14/20/20'>2Chr. 20:20</a>",
      "comment": "Persistent prayer and reliance on God are central themes throughout scripture and model the spiritual life."
    },
    {
      "pk": 21010035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 35,
      "text": "He struck down those within the fortress, killing over twenty thousand men.",
      "links": "<a href='/AIV/6/11/8'>Josh. 11:8</a>",
      "comment": "Total victory over the enemy reveals God’s power to save despite overwhelming odds."
    },
    {
      "pk": 21010036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 36,
      "text": "When at last nine thousand ran to two towers, with all provisions for defense,",
      "links": "<a href='/AIV/21/10/31'>2Macc 10:31</a>",
      "comment": "Desperation of the enemy highlights the difference between trusting human strength and relying on God."
    },
    {
      "pk": 21010037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 37,
      "text": "Maccabeus left Simon and Joseph, along with Zacchaeus and his men, to complete the siege, while he led his own troops against other targets.",
      "links": "<a href='/AIV/13/27/6'>1Chr 27:6</a>",
      "comment": "Delegation of leadership and teamwork reflects both practical wisdom and the collaborative nature of ministry."
    },
    {
      "pk": 21010038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 38,
      "text": "Those with Simon were enticed by bribery from the tower defenders, twenty thousand drachmas. They released some of the men and failed to finish the siege—this was denounced by Maccabeus in a written report for betrayal.",
      "links": "<a href='/AIV/20/17/23'>Prov. 17:23</a>; <a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "Final warning against bribery and compromise affirms the importance of uprightness. Faithfulness to God in every detail matters—an essential biblical principle seen fulfilled in the life of Christ, who remained obedient even to death (Philippians 2:8)."
    }
  ],
  "translatedAt": "2025-12-24T05:35:44.501Z"
}