{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 12,
  "verses": [
    {
      "pk": 21012001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 1,
      "text": "When these agreements had been made, Lysias went back to the king, and the Jews returned to their farming life.",
      "links": "<a href='/AIV/21/11/34'>2Macc 11:34</a>",
      "comment": "The peace secured by Judas led to a restoration of ordinary life for the Jewish people. Farming and daily labor are presented as good and godly occupations, reflecting God's original intent for humankind (cf. <a href='/AIV/1/2/15'>Gen 2:15</a>)."
    },
    {
      "pk": 21012002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 2,
      "text": "But some of the local governors, Timothy, Apollonius son of Gennaeus, as well as Hieronymus and Demophon, along with Nicanor, the governor of Cyprus, would not let them be at peace or live quietly.",
      "links": "",
      "comment": "Persistent enemies of the Jews continued their opposition. In salvation history, we often see that God's people must remain vigilant against ongoing opposition (<a href='/AIV/19/2/1'>Ps 2:1-2</a>)."
    },
    {
      "pk": 21012003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 3,
      "text": "Some people of Joppa, also, committed a terrible crime: they invited the Jews who lived among them to embark with their wives and children on boats they had prepared, as though there was nothing to fear.",
      "links": "",
      "comment": "Such treachery reveals a violation of trust and hospitality. The suffering of the innocent echoes the afflictions of the righteous in Scripture (<a href='/AIV/19/10/2'>Ps 10:2</a>)."
    },
    {
      "pk": 21012004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 4,
      "text": "But when the Jews, trusting in the arrangement the people of Joppa had made, went out to sea, they drowned at least two hundred of them.",
      "links": "",
      "comment": "Trust was betrayed through a calculated act of murder at sea. This tragedy recalls other biblical betrayals and emphasizes the need for discernment (<a href='/AIV/19/41/9'>Ps 41:9</a>)."
    },
    {
      "pk": 21012005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 5,
      "text": "When Judas heard what had happened to his fellow countrymen, he called his men together, summoned the leaders, and sought justice for the innocent.",
      "links": "",
      "comment": "Judas, as a godly leader, acts to bring justice, a theme prominent in biblical history (<a href='/AIV/20/31/8-9'>Prov 31:8-9</a>), showing zeal for the well-being of his people."
    },
    {
      "pk": 21012006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 6,
      "text": "He attacked the people of Joppa at night and set fire to the harbor, burning the ships, and killing those who had fled there.",
      "links": "",
      "comment": "Judas’s actions are motivated by a passion for justice rather than vengeance. This reflects God's retributive justice seen elsewhere in Scripture (<a href='/AIV/2/15/7'>Ex 15:7</a>)."
    },
    {
      "pk": 21012007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 7,
      "text": "Then, having left the city, since it was already daytime, Judas marched to Jamnia, where he also attacked the people there.",
      "links": "",
      "comment": "Judas responds decisively, continuing to protect his people. This demonstrates strong leadership and the necessity of defending the faith community."
    },
    {
      "pk": 21012008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 8,
      "text": "When the people of Jamnia tried to do the same to the Jews who lived among them, he attacked them by night, set fire to the harbor and fleet, so that the light from the flames was visible in Jerusalem, almost two hundred and fifty miles away.",
      "links": "",
      "comment": "The scale of the destruction signals a warning and a sign, recalling previous signs in biblical history (<a href='/AIV/1/19/28'>Gen 19:28</a> fire and smoke of Sodom)."
    },
    {
      "pk": 21012009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 9,
      "text": "From there, they marched nine days, heading for the region of Gorgias, the governor.",
      "links": "",
      "comment": "The narrative continues the theme of perseverance and the need for faithful endurance, which is echoed by Christ's own call to perseverance in the Gospels (<a href='/AIV/42/21/19'>Luke 21:19</a>)."
    },
    {
      "pk": 21012010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 10,
      "text": "But Gorgias came out with three thousand infantry and four hundred cavalry.",
      "links": "",
      "comment": "Formidable opposition highlights the odds faced by God's people, reminding us that victory comes not by might but by the Lord's guidance (<a href='/AIV/38/4/6'>Zech 4:6</a>)."
    },
    {
      "pk": 21012011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 11,
      "text": "In the ensuing battle, the Jews called upon the Lord for help, especially since they were risking their lives for the sake of His laws and the holy place. So He gave them courage and they defeated Gorgias’s army.",
      "links": "<a href='/AIV/19/20/7'>Ps 20:7</a>; <a href='/AIV/11/8/44'>1Kings 8:44</a>",
      "comment": "Faith in God, and fighting for God's law and the sanctuary, invokes God's favor. Trust in God’s name for victory connects to both Old and New Testament themes."
    },
    {
      "pk": 21012012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 12,
      "text": "Gorgias fled to a fortress in a village called Marisa, but Judas’s soldiers captured the village, killing over twenty-five hundred men and seizing great spoils.",
      "links": "",
      "comment": "The taking of spoils echoes earlier biblical narratives illustrating God’s deliverance and provision (<a href='/AIV/6/8/27'>Josh 8:27</a>)."
    },
    {
      "pk": 21012013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 13,
      "text": "After this, Judas and his forces marched against Ephron, a heavily fortified city with a strong wall and people from many nations inside.",
      "links": "",
      "comment": "Cities with mixed inhabitants are common as sites of conflict in the Old Testament (<a href='/AIV/6/10/5'>Josh 10:5</a>), reflecting ongoing struggles for holiness and identity amid surrounding nations."
    },
    {
      "pk": 21012014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 14,
      "text": "Strong young men defended the walls vigorously, but the Jews, trusting in God’s aid, took the city, killed twenty-five thousand in all, and captured much of value.",
      "links": "",
      "comment": "The people’s confidence in God recalls multiple Old Testament deliverances; victory often comes to those who trust in the Lord rather than human strength."
    },
    {
      "pk": 21012015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 15,
      "text": "They continued their march, coming to Scythopolis, a city seventy-five miles from Jerusalem.",
      "links": "",
      "comment": "The specific geography highlights the historicity of the events, and underlines the widespread scope of the Jewish struggle in the region."
    },
    {
      "pk": 21012016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 16,
      "text": "But the Jews who lived there claimed they’d been treated kindly by people of Scythopolis and the city’s authorities, so Judas and his men thanked them and offered prayers for their well-being. Then they left them alone.",
      "links": "",
      "comment": "Gratitude and intercessory prayer for benefactors is modeled here, reflecting a principle echoed in the apostolic teaching (<a href='/AIV/54/2/1-2'>1 Tim 2:1-2</a>)."
    },
    {
      "pk": 21012017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 17,
      "text": "After the festival called Pentecost, they moved quickly against Gorgias, the governor of Idumea.",
      "links": "<a href='/AIV/3/23/16'>Lev 23:16</a>; <a href='/AIV/44/2/1'>Acts 2:1</a>",
      "comment": "The mention of Pentecost situates these events on a key biblical feast that also has spiritual fulfillment in Christian tradition (cf. <a href='/AIV/44/2/1'>Acts 2:1</a>)."
    },
    {
      "pk": 21012018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 18,
      "text": "He came out with three thousand infantry and four hundred cavalry.",
      "links": "<a href='/AIV/21/12/10'>2Macc 12:10</a>",
      "comment": "This verse mirrors verse 10, reinforcing the challenges faced by the Jewish army."
    },
    {
      "pk": 21012019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 19,
      "text": "In the battle, a few Jews were killed.",
      "links": "",
      "comment": "Despite many victories, God’s people still suffer losses, reminding us that faithfulness doesn’t always mean escape from suffering (<a href='/AIV/55/3/12'>2 Tim 3:12</a>)."
    },
    {
      "pk": 21012020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 20,
      "text": "But Dositheus, one of Bacenor’s captains, fought bravely and captured Gorgias alive. However, because Dositheus was a strong horseman and overpowered by Gorgias’s cavalry, Gorgias escaped to Maresa.",
      "links": "",
      "comment": "The escape of Gorgias highlights the unpredictable outcomes of war and a recurring theme that final victories belong to God alone."
    },
    {
      "pk": 21012021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 21,
      "text": "At that time, Judas and his men turned toward Adullam, since the seventh day was approaching; they purified themselves according to custom and observed the Sabbath there.",
      "links": "<a href='/AIV/2/20/8-11'>Exod 20:8-11</a>",
      "comment": "Observance of the Sabbath amid war underscores the centrality of worship and rest in God's law, reflecting obedience even in hardship."
    },
    {
      "pk": 21012022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 22,
      "text": "After the Sabbath, they took some of their fallen men to bury them with their relatives in the tombs of their ancestors.",
      "links": "<a href='/AIV/1/50/13'>Gen 50:13</a>",
      "comment": "Proper burial with ancestors is a sign of respect for the dead, a value deeply rooted in biblical history and closely connected to hope in God's promises."
    },
    {
      "pk": 21012023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 23,
      "text": "But when they found on each of the dead men hidden amulets dedicated to idols of Jamnia, which the Law forbids Jews to wear, everyone saw that this was why they had fallen.",
      "links": "<a href='/AIV/3/19/4'>Lev 19:4</a>, <a href='/AIV/5/5/7-9'>Deut 5:7-9</a>",
      "comment": "Idolatry is seen as the cause of their defeat, recalling consistent biblical teaching against pagan practices (<a href='/AIV/2/20/3-6'>Exod 20:3-6</a>)."
    },
    {
      "pk": 21012024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 24,
      "text": "So everyone praised the ways of the Lord, the righteous Judge who exposes hidden things, and they offered a prayer that the sin just committed might be completely forgiven.",
      "links": "<a href='/AIV/58/4/13'>Heb 4:13</a>",
      "comment": "God as a just and omniscient Judge is a key biblical principle. The prayer for forgiveness underscores communal responsibility and intercession for the dead, themes woven throughout Scripture."
    },
    {
      "pk": 21012025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 25,
      "text": "Noble Judas also urged the people to keep themselves free from sin, since they had witnessed with their own eyes what happened because of the sin of those who had died.",
      "links": "",
      "comment": "Moral exhortation follows judgment. Moral instruction based on lived experience is a biblical model for teaching (<a href='/AIV/46/10/6-12'>1 Cor 10:6-12</a>)."
    },
    {
      "pk": 21012026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 26,
      "text": "Then he took up a collection from each man, and sent it to Jerusalem to provide for a sin offering. In doing this, he acted very well and honorably, taking account of the resurrection.",
      "links": "<a href='/AIV/40/5/23-24'>Matt 5:23-24</a>, <a href='/AIV/27/12/2'>Dan 12:2</a>",
      "comment": "The practice of making offerings for the dead reflects belief in the resurrection of the just—a doctrine supported in later Scriptural revelation. Also, the idea of intercessory acts for others anticipates developments in later Christian worship and sacramental theology."
    },
    {
      "pk": 21012027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 27,
      "text": "If he were not expecting that those who had fallen would rise again, it would have been foolish and useless to pray for the dead.",
      "links": "",
      "comment": "This is a direct affirmation of faith in the resurrection, which is a core belief in later Christian theology and is foreshadowed here."
    },
    {
      "pk": 21012028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 28,
      "text": "But since he believed that those who had died with godliness would receive a glorious reward, he acted out of great devotion.",
      "links": "<a href='/AIV/58/11/35'>Heb 11:35</a>",
      "comment": "This verse testifies to faith in eternal reward after death. The connection to resurrection hope is a major theme later illuminated in the New Testament."
    },
    {
      "pk": 21012029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 29,
      "text": "So he made atonement for the dead, so that they might be released from their sins.",
      "links": "<a href='/AIV/54/1/4'>1 Tim 1:4</a>",
      "comment": "Offering prayers and sacrifices for the dead presumes that the faithful departed can benefit from the prayers of the living, a teaching that resonates with certain Christian traditions of intercession and atonement for souls beyond this life."
    },
    {
      "pk": 21012030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 30,
      "text": "Returning from there, they went quickly to attack the stronghold of Charax, where Timothy was.",
      "links": "",
      "comment": "The transition returns to the military narrative. Timothy’s opposition reflects the recurring challenges faced by God’s people."
    },
    {
      "pk": 21012031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 31,
      "text": "Timothy, however, they found had left the city, but they attacked those who remained, defeated them, and seized much spoil. Then they divided the loot among themselves, the wounded, the widows, and orphans, and distributed the rest among themselves and their families.",
      "links": "",
      "comment": "Caring for widows and orphans is a consistent biblical command (<a href='/AIV/19/68/5'>Ps 68:5</a>, <a href='/AIV/59/1/27'>James 1:27</a>)."
    },
    {
      "pk": 21012032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 32,
      "text": "So when they had done all this, they prayed together, asking the merciful Lord to be completely reconciled with His servants.",
      "links": "<a href='/AIV/19/51/1'>Ps 51:1</a>",
      "comment": "Communal prayer for mercy and reconciliation indicates a deeply spiritual approach to national adversity, modeling reliance on God’s grace and forgiveness."
    },
    {
      "pk": 21012033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 33,
      "text": "They attacked the stronghold of Ephron, a fortified city, with Lysias’ governor inside, and all kinds of people. Their forces, both inside and outside the city, resisted bravely.",
      "links": "",
      "comment": "Again, perseverance amid strong resistance is a theme through this section."
    },
    {
      "pk": 21012034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 34,
      "text": "But the Jews called upon Almighty God, who shatters the power of enemies, conquered the city, killed about twenty-five thousand of those inside, and pursued the rest up to Gazara.",
      "links": "<a href='/AIV/7/7/10'>Judges 7:10</a>",
      "comment": "The language of God shattering enemies recalls key moments in Israelite history (see <a href='/AIV/7/7/20-22'>Judg 7:20-22</a>), again attributing victory to divine intervention."
    },
    {
      "pk": 21012035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 35,
      "text": "After these victories, they marched on to Ephron, a strong city. They besieged and captured it, killing twenty-five thousand who were inside.",
      "links": "",
      "comment": "The repetition of this episode emphasizes the completeness of victory as God’s people remain faithful in adversity."
    },
    {
      "pk": 21012036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 36,
      "text": "From there they went to Scythopolis, seventy-five miles from Jerusalem. The Jews who lived there testified that the people of Scythopolis had treated them well.",
      "links": "",
      "comment": "Gratitude is shown for justice and kindness received from outsiders, in line with the biblical principle of returning good for good."
    },
    {
      "pk": 21012037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 37,
      "text": "So Judas and his men thanked the people and exhorted them to continue in goodwill toward the Jews, then returned to Jerusalem as the Feast of Weeks was at hand.",
      "links": "<a href='/AIV/3/23/15-21'>Lev 23:15-21</a>",
      "comment": "The Feast of Weeks (Pentecost) is a time of thanksgiving for the harvest and points forward to the fuller outpouring of the Spirit in the New Covenant (<a href='/AIV/44/2/1-4'>Acts 2:1-4</a>)."
    },
    {
      "pk": 21012038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 38,
      "text": "After the Feast, they marched against Gorgias, the governor of Idumea.",
      "links": "",
      "comment": "Persistent opposition is a motif throughout both Old and New Testaments. The cycle of worship and conflict mirrors the Christian rhythm of liturgy and mission."
    },
    {
      "pk": 21012039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 39,
      "text": "Gorgias came out with three thousand infantry and four hundred cavalry. The Jews engaged them, some fell wounded but they kept fighting with the help of God.",
      "links": "",
      "comment": "Divine assistance in battle recalls biblical accounts in which God fights on behalf of His people (see <a href='/AIV/2/14/14'>Exod 14:14</a>)."
    },
    {
      "pk": 21012040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 40,
      "text": "Dositheus, a cavalry leader, attacked and captured Gorgias, but, overpowered by Gorgias’s soldiers, had to let him go.",
      "links": "<a href='/AIV/21/12/20'>2Macc 12:20</a>",
      "comment": "Parallels to earlier verses (see v.20). Not all attempts succeed, reminding us that ultimate victory is God’s alone in salvation history."
    },
    {
      "pk": 21012041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 41,
      "text": "Then Judas gathered his army and went to Adullam. It was the seventh day, so they purified themselves and kept the Sabbath according to custom.",
      "links": "<a href='/AIV/2/20/8'>Exod 20:8</a>",
      "comment": "Observing the Sabbath was central even during battle. Spiritual discipline is prioritized amid conflict; this attitude is foundational for spiritual perseverance."
    },
    {
      "pk": 21012042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 42,
      "text": "On the next day, when they went to collect the bodies of those who had fallen in battle, they found under the tunic of each of the dead men amulets sacred to the idols of Jamnia, which the Law strictly forbids the Jews to wear.",
      "links": "<a href='/AIV/3/19/4'>Lev 19:4</a>; <a href='/AIV/5/5/7-8'>Deut 5:7-8</a>",
      "comment": "The repeated discovery of the idols underscores both the gravity of idolatry and the need for repentance and purity. Religious compromise has real consequences."
    },
    {
      "pk": 21012043,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 43,
      "text": "So everyone understood this was the cause of their defeat. Therefore, they praised the Lord, the righteous Judge who makes hidden things known, and prayed that this sin might be wholly blotted out.",
      "links": "<a href='/AIV/19/90/8'>Ps 90:8</a>",
      "comment": "God as the Revealer of secrets and the Just Judge is foundational in biblical theology. Prayer for the forgiveness of others' sins is strikingly significant, anticipating intercessory practices in the Christian tradition."
    },
    {
      "pk": 21012044,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 44,
      "text": "Noble Judas exhorted the people to avoid sin, observing the consequences suffered by the fallen. Taking up a collection, he sent it to Jerusalem to provide a sin offering for the dead, acting in a very excellent and devout manner, keeping in mind the resurrection.",
      "links": "<a href='/AIV/27/12/2'>Dan 12:2</a>",
      "comment": "The explicit reference to prayer and sacrifice for the dead in view of the resurrection is unique and prefigures later Christian understandings about the communion of saints and the ongoing spiritual solidarity among the living and the dead."
    },
    {
      "pk": 21012045,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 12,
      "verse": 45,
      "text": "For if he were not expecting those who had fallen would rise again, it would have been foolish to pray for the dead. But if he believed that a splendid reward is reserved for those who fall asleep in godliness, it was a holy and devout thought. Therefore he made atonement for the dead, so that they might be delivered from their sin.",
      "links": "<a href='/AIV/58/11/35'>Heb 11:35</a>; <a href='/AIV/40/12/32'>Matt 12:32</a>",
      "comment": "This profound conclusion affirms belief in the resurrection and the benefit of prayers and offerings for the dead—a conviction echoed in the Christian tradition regarding remembrance and intercession for the departed."
    }
  ],
  "translatedAt": "2025-12-24T05:37:13.289Z"
}