{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 13,
  "verses": [
    {
      "pk": 21013001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 1,
      "text": "In the year one hundred forty-nine, news reached Judas and his companions that Antiochus was marching against Judea with a huge army.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "This sets the historical context during the reign of Antiochus Eupator, reinforcing the persistent threats against the faithful remnant of Israel. The precision of the date grounds the narrative in real events."
    },
    {
      "pk": 21013002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 2,
      "text": "He brought with him Lysias, his guardian, who was also the commander-in-chief, and a large force of Greeks and mercenaries—one hundred and ten thousand infantry, five thousand three hundred cavalry, twenty-two elephants, and three hundred chariots armed with scythes.",
      "links": "<a href='/AIV/1/4/28'>1 Macc. 4:28</a>",
      "comment": "The impressive military force emphasizes the odds faced by the Jewish people. The mention of war elephants and chariots highlights the advanced technology of the period."
    },
    {
      "pk": 21013003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 3,
      "text": "Menelaus also joined them, pretending to help but only seeking to secure his position as high priest.",
      "links": "<a href='/AIV/2/4/23-25'>2 Macc. 4:23-25</a>",
      "comment": "Menelaus is portrayed as self-serving, highlighting the dangers of corrupt leadership within God's people (cf. John 10:12, 'the hired hand cares nothing for the sheep')."
    },
    {
      "pk": 21013004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 4,
      "text": "But the King of kings stirred the anger of Antiochus against this wicked man, and when Lysias filed charges against Menelaus, Antiochus ordered him to be taken to Berea and executed according to local custom.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>; <a href='/AIV/19/75/7'>Ps. 75:7</a>",
      "comment": "This shows divine justice at work within the governance of nations (see Daniel 2:21, God 'changes times and seasons; he removes kings and sets up kings')."
    },
    {
      "pk": 21013005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 5,
      "text": "For in that city the custom is that criminals are thrown from a tower full of ashes, and suffocated in the thick dust.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "The execution method underlines the severe judgment reserved for betraying God's people and office."
    },
    {
      "pk": 21013006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 6,
      "text": "So Menelaus died by a fate he deserved, and no one mourned his passing.",
      "links": "<a href='/AIV/9/10/6'>2 Sam. 10:6</a>",
      "comment": "His death is shown as God’s judgment—a consistent theme, as unfaithful shepherds receive just penalties (see Zechariah 11:17)."
    },
    {
      "pk": 21013007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 7,
      "text": "The land, then, was relieved of this man who had caused so much trouble, and the sacred altar was cleansed.",
      "links": "<a href='/AIV/2/10/5-8'>2 Macc. 10:5-8</a>",
      "comment": "Purification of the altar foreshadows the New Covenant’s emphasis on the restoration and sanctity of worship (Hebrews 9:13-14)."
    },
    {
      "pk": 21013008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 8,
      "text": "Antiochus, meanwhile, continued his campaign with his heart full of hatred, determined to inflict greater suffering on the Jews than his father had.",
      "links": "<a href='/AIV/2/7/26'>2 Macc. 7:26</a>",
      "comment": "Hatred against God’s chosen foreshadows the persecution faced by the faithful throughout Scripture (John 15:18)."
    },
    {
      "pk": 21013009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 9,
      "text": "With threats and wild words, he ordered his charioteer to drive without stopping until he reached Jerusalem—while the army followed him.",
      "links": "<a href='/AIV/18/21/7'>Job 21:7</a>",
      "comment": "The king’s rashness reveals pride, a recurring cause of downfall in Scripture (Proverbs 16:18)."
    },
    {
      "pk": 21013010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 10,
      "text": "But when the people heard the news, they prayed to the One who made all things, not to surrender them to such a ruthless nation, but to rescue them by his mighty power.",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>; <a href='/AIV/2/1/11-12'>2 Macc. 1:11-12</a>",
      "comment": "The faithful cry to God as Creator; prayer and reliance on divine help stand at the center of God's redemptive acts (Psalm 121:2; Jonah 2:2)."
    },
    {
      "pk": 21013011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 11,
      "text": "They also remembered how God had helped their ancestors, how he had destroyed 185,000 men under Sennacherib, the king of Assyria.",
      "links": "<a href='/AIV/12/19/35'>2 Kgs. 19:35</a>; <a href='/AIV/23/37/36'>Isa. 37:36</a>",
      "comment": "The people recall God's past deliverance, an encouragement to trust Him amid trial (cf. 2 Kings 19:35; Hebrews 13:8, 'Jesus Christ is the same yesterday and today and forever')."
    },
    {
      "pk": 21013012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 12,
      "text": "With hands raised, they cried out: 'Lord of all, you need nothing, but it has pleased you to give us our inheritance.'",
      "links": "<a href='/AIV/19/16/2'>Ps. 16:2</a>",
      "comment": "The acknowledgment that God ‘needs nothing’ mirrors Acts 17:25 and stresses his self-sufficiency—a trait carried forward in New Testament theology."
    },
    {
      "pk": 21013013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 13,
      "text": "Protect this city, now dedicated to your name; do not let our enemies destroy your sanctuary.'",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>; <a href='/AIV/11/8/29'>1 Kgs. 8:29</a>",
      "comment": "This prayer recalls Solomon’s prayer at the temple dedication and anticipates the New Testament understanding of the Church as God’s dwelling place on earth (1 Corinthians 3:16)."
    },
    {
      "pk": 21013014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 14,
      "text": "Judas gathered his men together, urging them to remain faithful, prepared either to die bravely or to secure victory for their nation and the holy city.",
      "links": "<a href='/AIV/2/15/17'>2 Macc. 15:17</a>; <a href='/AIV/58/11/35-39'>Heb. 11:35-39</a>",
      "comment": "Judas Maccabeus exemplifies the leader who encourages perseverance, later echoed in the faith of the martyrs (Hebrews 11)."
    },
    {
      "pk": 21013015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 15,
      "text": "He set apart the night before the battle for fervent prayer, together with the elders, seeking God’s help.",
      "links": "<a href='/AIV/2/8/23-24'>2 Macc. 8:23-24</a>",
      "comment": "Communal prayer for deliverance foreshadows Christ praying before his Passion, with the apostles supporting him (Matthew 26:36-46; Acts 1:14)."
    },
    {
      "pk": 21013016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 16,
      "text": "Trusting in the Lord, and armed with courage more than weapons, they advanced upon the enemy, striking down six hundred soldiers.",
      "links": "<a href='/AIV/7/7/19-20'>Judges 7:19-20</a>",
      "comment": "God’s people prevail through faith, not merely human strength—a theme fulfilled in salvation by grace (Ephesians 2:8-9)."
    },
    {
      "pk": 21013017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 17,
      "text": "When Lysias saw that the Jews were prepared to fight, he tried to use strategy, attacking their strongholds.",
      "links": "<a href='/AIV/2/11/3'>2 Macc. 11:3</a>",
      "comment": "Human efforts to circumvent God’s people can never prevail against his ultimate will (Matthew 16:18)."
    },
    {
      "pk": 21013018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 18,
      "text": "He besieged the fortress of Beth-zur by blockade, while Judas’s men harassed the enemy with secret attacks.",
      "links": "<a href='/AIV/1/6/26'>1 Macc. 6:26</a>",
      "comment": "The siege at Beth-zur highlights the strategic importance of certain places for Israel, a theme also seen in the battles over Jerusalem across salvation history."
    },
    {
      "pk": 21013019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 19,
      "text": "But when Judas heard that Lysias was besieging Beth-zur, he and all the people prayed before the Lord, that he would not allow the city to be handed over to the enemy.",
      "links": "<a href='/AIV/19/122/6-7'>Ps. 122:6-7</a>",
      "comment": "Continual prayer for the preservation of sacred places shows the importance of set-apart spaces for worship—a principle that persists in Christian liturgy."
    },
    {
      "pk": 21013020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 20,
      "text": "At the same time, the army of the king encountered resistance—Philip, who had been left to govern Antioch, rebelled.",
      "links": "<a href='/AIV/2/9/29'>2 Macc. 9:29</a>",
      "comment": "The mention of rebellion highlights the instability of human kingdoms compared to God’s unfailing kingdom (Daniel 2:44)."
    },
    {
      "pk": 21013021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 21,
      "text": "Alarmed by this, Lysias quickly persuaded the king and the commanders to withdraw, saying, 'We are at risk here; let us make peace.'",
      "links": "<a href='/AIV/2/11/13'>2 Macc. 11:13</a>",
      "comment": "God often frustrates the designs of the wicked through unexpected means (Psalm 33:10)."
    },
    {
      "pk": 21013022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 22,
      "text": "So there was a parley, and the king and Lysias granted just terms to the Jews, swearing to honor them and to respect their laws.",
      "links": "<a href='/AIV/16/6/15-16'>Neh. 6:15-16</a>",
      "comment": "The granting of justice and recognition of Jewish law hints at the enduring value of God’s law and his guidance for nations."
    },
    {
      "pk": 21013023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 23,
      "text": "They returned to Antioch. That was how the attack and withdrawal of the king happened.",
      "links": "<a href='/AIV/1/6/63'>1 Macc. 6:63</a>",
      "comment": "This outcome is another testament to God’s sovereignty in the affairs of the world (Romans 8:28)."
    },
    {
      "pk": 21013024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 24,
      "text": "King Antiochus then appointed governors for the region from Ptolemais to Gerar.",
      "links": "<a href='/AIV/1/1/10'>1 Macc. 1:10</a>",
      "comment": "Administrative reorganization shows attempts to strengthen control, but lasting peace comes only by God’s hand."
    },
    {
      "pk": 21013025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 25,
      "text": "He returned to Ptolemais, but the people there were angry and demanded that the treaty be abolished.",
      "links": "<a href='/AIV/2/4/21'>2 Macc. 4:21</a>",
      "comment": "Human opposition and instability are incapable of overturning God’s decrees and favor toward his people."
    },
    {
      "pk": 21013026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 26,
      "text": "So Lysias went up to the tribunal to speak publicly in defense of the agreement. The king heard him, ratified the treaty, and departed.",
      "links": "<a href='/AIV/16/6/16'>Neh. 6:16</a>",
      "comment": "The ratification of peace, following prayer and perseverance, is a reminder of God’s faithfulness and the efficacy of communal intercession—a principle emphasized in Christian worship when the church prays as one (Acts 12:5, Matthew 18:19-20)."
    }
  ],
  "translatedAt": "2025-12-24T05:37:51.819Z"
}