{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 10,
  "verses": [
    {
      "pk": 2101001,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 1,
      "text": "Simon was informed that Nicanor and his forces had been defeated, so he called together all the people of Jerusalem, who rejoiced and celebrated what had happened.",
      "links": "<a href='/AIV/12/8/36'>2 Macc. 8:36</a>; <a href='/AIV/12/9/28'>2 Macc. 9:28</a>",
      "comment": "The defeat of Nicanor marks the turning point in the liberation of Jerusalem, illustrating God's providence over His chosen people. See also 2 Maccabees 8:36 for the earlier defeats."
    },
    {
      "pk": 2101002,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 2,
      "text": "They agreed together to purify the temple and to restore it, and they organized a great celebration.",
      "links": "<a href='/AIV/12/1/7'>2 Macc. 1:7</a>; <a href='/AIV/12/10/5-8'>2 Macc. 10:5-8</a>",
      "comment": "Purification of the temple prefigures the renewal of worship and foreshadows the spiritual cleansing offered through Christ. See Hebrews 9:13-14 for typology."
    },
    {
      "pk": 2101003,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 3,
      "text": "They rebuilt the altar, offered sacrifices according to the law, and lit lamps in the sanctuary, restoring its sacred furnishings.",
      "links": "<a href='/AIV/3/8/1-5'>Lev. 8:1–5</a>; <a href='/AIV/12/1/21-22'>2 Macc. 1:21–22</a>",
      "comment": "The restoration of liturgical worship highlights continuity with the Mosaic law and the importance of sacred ritual. Altar rebuilding echoes Exodus 40:29."
    },
    {
      "pk": 2101004,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 4,
      "text": "They burned incense on the altar and lit lamps which gave light throughout the temple. They also set out the bread of the Presence on the table.",
      "links": "<a href='/AIV/3/24/5-8'>Lev. 24:5–8</a>; <a href='/AIV/2/25/30'>Exod. 25:30</a>",
      "comment": "Bread of Presence symbolizes God's continual provision. This act points to the idea of holy presence and prefigures greater spiritual realities."
    },
    {
      "pk": 2101005,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 5,
      "text": "After all of this was completed, they fell down and worshiped, praying to the Lord that they would no longer experience such misfortunes and might never again be subject to similar troubles.",
      "links": "<a href='/AIV/19/106/47'>Ps. 106:47</a>; <a href='/AIV/23/64/9'>Isa. 64:9</a>",
      "comment": "The humility in prayer reflects a recurrent theme of repentance and reliance on God's mercy—see Psalm 106:47."
    },
    {
      "pk": 2101006,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 6,
      "text": "They remembered what had happened and began to observe a festival on the twenty-fifth day of the ninth month, Chislev, for eight days, with rejoicing, like the festival of Tabernacles.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>; <a href='/AIV/12/1/18'>2 Macc. 1:18</a>",
      "comment": "The festival described here becomes known as Hanukkah, commemorating the restoration of temple worship. Tabernacles reference ties to Israel’s deliverance."
    },
    {
      "pk": 2101007,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 7,
      "text": "They carried branches, leafy boughs, and palm fronds, singing hymns to Him who had successfully purified His own holy place.",
      "links": "<a href='/AIV/3/23/40'>Lev. 23:40</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "Carrying palm branches recalls the Feast of Tabernacles; John 12:13 references Jesus entering Jerusalem with palm branches, a sign of victory and messianic hope."
    },
    {
      "pk": 2101008,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 8,
      "text": "They decreed by public proclamation and vote that all the Jewish people should celebrate these days every year.",
      "links": "<a href='/AIV/8/22/30'>Neh. 8:9–12</a>; <a href='/AIV/12/1/9'>2 Macc. 1:9</a>",
      "comment": "Institution of recurring festivals for commemoration underscores the value of tradition in collective memory and worship."
    },
    {
      "pk": 2101009,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 9,
      "text": "Such was the story of the purification of the temple.",
      "links": "",
      "comment": "This summarizes the rededication—the foundation for future temple observance and spiritual renewal."
    },
    {
      "pk": 2101010,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 10,
      "text": "Antiochus called Epiphanes, now dead, was succeeded by his son Antiochus Eupator.",
      "links": "<a href='/AIV/12/9/28'>2 Macc. 9:28</a>",
      "comment": "Context: Provides historical continuity, linking prior events to the new phase under Antiochus Eupator."
    },
    {
      "pk": 2101011,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 11,
      "text": "The king’s chief minister, Lysias, managed affairs for the young king and governed the kingdom.",
      "links": "<a href='/AIV/12/13/1'>2 Macc. 13:1–2</a>",
      "comment": "Lysias’ stewardship sets up further conflict. His role parallels other biblical situations where ministers rule as regents."
    },
    {
      "pk": 2101012,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 12,
      "text": "Men who had occupied Jerusalem, fleeing from Judas, went to Lysias, hoping for protection.",
      "links": "<a href='/AIV/12/5/8'>2 Macc. 5:8</a>",
      "comment": "Persecuted ungodly leaders seeking protection echoes the fate of those opposed to God's people."
    },
    {
      "pk": 2101013,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 13,
      "text": "Lysias, troubled by what had happened, recruited many mercenaries and gathered his army.",
      "links": "<a href='/AIV/12/13/2'>2 Macc. 13:2</a>",
      "comment": "Preparation for renewed conflict highlights human efforts against God’s deliverance."
    },
    {
      "pk": 2101014,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 14,
      "text": "He appointed Ptolemy son of Dorymenes, governor of Coele-Syria and Phoenicia, with military support.",
      "links": "<a href='/AIV/12/13/1-3'>2 Macc. 13:1–3</a>",
      "comment": "Emerging political powers attempt to suppress the resurgence of pious worship in Jerusalem."
    },
    {
      "pk": 2101015,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 15,
      "text": "Timothy, who had previously defeated Jews, and some other leaders recruited foreign forces, gathered great armies, and planned to capture Judea.",
      "links": "<a href='/AIV/12/8/30'>2 Macc. 8:30</a>; <a href='/AIV/12/12/2,5'>2 Macc. 12:2,5</a>",
      "comment": "Persistent aggression against God’s people signifies ongoing spiritual warfare; typology links to the perseverance of the faithful."
    },
    {
      "pk": 2101016,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 16,
      "text": "Judas and his brothers learned about their schemes and prayed to God, who defends His people, then fought bravely.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/12/8/23'>2 Macc. 8:23</a>",
      "comment": "Prayer before action reflects trust in divine strength over military might. See Psalm 18:2 for God as fortress."
    },
    {
      "pk": 2101017,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 17,
      "text": "They attacked the fortresses of the enemy, overpowered them with God’s help, and took control of the city.",
      "links": "<a href='/AIV/12/8/36'>2 Macc. 8:36</a>",
      "comment": "Victory attributed to God, not human achievement. Points toward understanding God’s sovereignty in history."
    },
    {
      "pk": 2101018,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 18,
      "text": "Those inside the citadel who had escaped earlier, supported by many defiant men, kept resisting.",
      "links": "<a href='/AIV/12/13/3'>2 Macc. 13:3</a>",
      "comment": "Persistence of opposition shows ongoing tension between godly and ungodly influences."
    },
    {
      "pk": 2101019,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 19,
      "text": "Judas assigned Joseph and Azarias to lead forces while he himself took charge of the fighting in Jerusalem.",
      "links": "<a href='/AIV/12/8/22,23'>2 Macc. 8:22,23</a>",
      "comment": "Division of labor among leaders is reminiscent of Moses’ appointing elders—see Numbers 11:16."
    },
    {
      "pk": 2101020,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 20,
      "text": "Meanwhile, those in the citadel managed to pressure Joseph and Azarias, forcing these commanders to retreat in defeat.",
      "links": "<a href='/AIV/12/12/35'>2 Macc. 12:35</a>",
      "comment": "The enemy’s resilience shows the danger of presumption when relying solely on human strength."
    },
    {
      "pk": 2101021,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 21,
      "text": "Because they had not followed the instructions of Judas, they experienced defeat.",
      "links": "<a href='/AIV/4/16/1'>Num. 16:1–3</a>",
      "comment": "Failure to submit to godly leadership results in disaster—a lesson in obedience aligning with biblical authority structures."
    },
    {
      "pk": 2101022,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 22,
      "text": "Judas and his brothers won great glory before all Israel and among the Gentiles, for their courage and faithfulness.",
      "links": "<a href='/AIV/12/15/27'>2 Macc. 15:27</a>",
      "comment": "Public acknowledgement of heroism for God’s cause recalls Hebrews 11 and God rewarding faith."
    },
    {
      "pk": 2101023,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 23,
      "text": "Many of the Gentiles brought gifts and sought peace with Judas, who accepted them, granting peace and building alliances.",
      "links": "<a href='/AIV/12/11/34'>2 Macc. 11:34</a>",
      "comment": "Conversion of enemies via peaceful means highlights reconciliation, a theme pointing to universal redemption through Christ."
    },
    {
      "pk": 2101024,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 24,
      "text": "But among Judas’s enemies, one named Timotheus, who had previously caused trouble for the Jews, began to raise armies for war.",
      "links": "<a href='/AIV/12/8/30'>2 Macc. 8:30</a>; <a href='/AIV/12/12/2'>2 Macc. 12:2</a>",
      "comment": "Continued oppression from Timotheus illustrates the persistence of evil against the faithful."
    },
    {
      "pk": 2101025,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 25,
      "text": "He called on many foreign forces and gathered a large organization of cavalry from Asia, planning a surprise attack.",
      "links": "<a href='/AIV/12/12/2,20'>2 Macc. 12:2,20</a>",
      "comment": "Foreign alliances against God’s people echo similar gatherings in later biblical history (Acts 4:27)."
    },
    {
      "pk": 2101026,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 26,
      "text": "Judas saw the large enemy forces, prayed, and called upon the Lord, who upholds His people and their heritage by law.",
      "links": "<a href='/AIV/19/74/2'>Ps. 74:2</a>; <a href='/AIV/19/118/21'>Ps. 118:21</a>",
      "comment": "Invocation of God as defender of Israel ties to Psalm 74:2 and foreshadows Christ as intercessor."
    },
    {
      "pk": 2101027,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 27,
      "text": "He prayed in this way: “Lord, when Your messenger struck down Sennacherib’s army, so now may You strike down this force.”",
      "links": "<a href='/AIV/12/8/19'>2 Macc. 8:19</a>; <a href='/AIV/12/15/22'>2 Macc. 15:22</a>; <a href='/AIV/23/37/36'>Isa. 37:36</a>",
      "comment": "Reference to Isaiah 37:36: God’s intervention against Sennacherib connects to themes of angelic help and divine deliverance."
    },
    {
      "pk": 2101028,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 28,
      "text": "In this way, facing the enemy, they prayed and fought at the same time, and with God’s help, they overcame the cavalry and the enemy forces.",
      "links": "<a href='/AIV/12/8/23,24'>2 Macc. 8:23–24</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Victory through faith and action, reminiscent of Psalm 44:3: ‘Not by our own sword did we win the land…’"
    },
    {
      "pk": 2101029,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 29,
      "text": "While the battle was raging, two men dressed in white, shining armor appeared before the Jewish fighters, protected them, and led them into the fight.",
      "links": "<a href='/AIV/1/19/15'>Gen. 19:15</a>; <a href='/AIV/12/11/8'>2 Macc. 11:8</a>",
      "comment": "Appearance of angelic beings signals divine intervention, paralleling angelic help in Genesis 19:15; typology of messengers as protectors."
    },
    {
      "pk": 2101030,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 30,
      "text": "They protected Judas from injury by using their armor as shields, and struck terror into the enemy and confusion into their ranks.",
      "links": "<a href='/AIV/2/14/25'>Exod. 14:25</a>; <a href='/AIV/12/11/10'>2 Macc. 11:10</a>",
      "comment": "God’s supernatural protection echoes Exodus 14:25, reminding all that victory is ultimately given by God."
    },
    {
      "pk": 2101031,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 31,
      "text": "Twenty thousand enemy soldiers fell, along with six hundred cavalry men.",
      "links": "<a href='/AIV/12/8/30'>2 Macc. 8:30</a>",
      "comment": "Large-scale victory marks the magnitude of God’s intervention."
    },
    {
      "pk": 2101032,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 32,
      "text": "Timothy himself fled to a strong fortress called Gazara, where Chereas commanded.",
      "links": "<a href='/AIV/12/12/35'>2 Macc. 12:35</a>",
      "comment": "Enemy’s retreat to fortresses echoes the theme of hiding from God’s judgment."
    },
    {
      "pk": 2101033,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 33,
      "text": "Judas and his men gladly besieged Gazara for four days.",
      "links": "<a href='/AIV/6/6/3'>Josh. 6:3</a>",
      "comment": "Persistence in siege recalls Joshua’s conquest at Jericho—fortresses cannot withstand God’s will."
    },
    {
      "pk": 2101034,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 34,
      "text": "Those inside, trusting in the strength of the fortress, insulted and blasphemed against Judas and his men.",
      "links": "<a href='/AIV/12/7/1'>2 Macc. 7:1</a>; <a href='/AIV/19/44/16'>Ps. 44:16</a>",
      "comment": "Blasphemy and mockery against God’s people set the stage for divine justice."
    },
    {
      "pk": 2101035,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 35,
      "text": "When the fifth day came, twenty men from the Jewish army, enraged by their blasphemy, bravely went up on the wall and destroyed many of the enemy.",
      "links": "<a href='/AIV/12/8/21'>2 Macc. 8:21</a>",
      "comment": "Action prompted by zeal for righteousness. Numbers 25:7–13: Zeal rewarded."
    },
    {
      "pk": 2101036,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 36,
      "text": "Another group climbed up after them, set fire to the gates, and allowed the army to charge in and capture the city.",
      "links": "<a href='/AIV/6/6/20'>Josh. 6:20</a>",
      "comment": "Victory after persistence and risk parallels stories of faithful warriors in Israel’s history."
    },
    {
      "pk": 2101037,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 37,
      "text": "They killed Timothy, who had hidden in a cistern, and his brother Chereas, as well as Apollophanes.",
      "links": "<a href='/AIV/7/16/1'>Judg. 16:1–3</a>",
      "comment": "Judgment upon persecutors affirms God’s justice, connecting to judges who punish Israel’s enemies."
    },
    {
      "pk": 2101038,
      "translation": "AIV",
      "book": 12,
      "chapter": 10,
      "verse": 38,
      "text": "After this, they praised the Lord with hymns and thanksgiving, for He had shown greatness in delivering them.",
      "links": "<a href='/AIV/19/106/1'>Ps. 106:1</a>; <a href='/AIV/19/118/28'>Ps. 118:28</a>",
      "comment": "Concluding praise links to Israel’s tradition of hymn and thanksgiving after deliverance; see Psalms 106:1 and 118:28."
    }
  ],
  "translatedAt": "2025-12-23T09:38:21.783Z"
}