{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 11,
  "verses": [
    {
      "pk": 10234511,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 1,
      "text": "Very soon after, Lysias, the king’s guardian and kinsman, and the one in charge of governance, greatly resented what had happened.",
      "links": "<a href='/AIV/52/10/11'>2 Macc. 10:11</a>",
      "comment": "Lysias, close to the king, takes special interest in Judea’s events. The mention of governance signals his authority over the region."
    },
    {
      "pk": 10234512,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 2,
      "text": "He gathered about eighty thousand infantry and all his cavalry and marched against the Jews, intending to make Jerusalem a Greek city,",
      "links": "<a href='/AIV/52/4/36'>2 Macc. 4:36</a>",
      "comment": "The intent to Hellenize Jerusalem shows a religious and cultural conflict, setting up the defense of faith."
    },
    {
      "pk": 10234513,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 3,
      "text": "to collect tribute from the temple as he did from other holy places of the nations, and to sell the high priesthood every year.",
      "links": "<a href='/AIV/52/4/27'>2 Macc. 4:27</a>",
      "comment": "The plan to desecrate the temple and commodify the high priesthood points to the profanation of what God had made holy."
    },
    {
      "pk": 10234514,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 4,
      "text": "He did not consider the power of the Lord who rules over all, but was filled with arrogance, relying on his countless infantry and thousands of horsemen, and his eighty elephants.",
      "links": "<a href='/AIV/19/33/16-17'>Psalm 33:16-17</a>",
      "comment": "This verse foreshadows divine intervention—a theme threaded throughout salvation history where God delivers amid human impossibility (cf. Exodus 14, Daniel 3)."
    },
    {
      "pk": 10234515,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 5,
      "text": "He entered Judea and approached Beth-zur, a strong fort about five miles from Jerusalem, and began to besiege it.",
      "links": "<a href='/AIV/52/10/32'>2 Macc. 10:32</a>",
      "comment": "Beth-zur’s prominence lies in its strategic location for controlling access to Jerusalem and is a reminder of God’s providential use of places and events."
    },
    {
      "pk": 10234516,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 6,
      "text": "When Maccabeus and his companions learned that the fortress was being besieged, they and all the people cried out to the Lord with lamentation and tears, pleading with him to send a good angel to save Israel.",
      "links": "<a href='/AIV/02/14/10-14'>Exod. 14:10–14</a>",
      "comment": "Prayer for angelic help highlights God’s ongoing use of mediators, angels, and the power of intercession—a pattern seen throughout Scripture."
    },
    {
      "pk": 10234517,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 7,
      "text": "Maccabeus himself was the first to take up arms, encouraging others to risk their lives with him to help their fellow countrymen. So they boldly set out together in confidence that the Lord would support them.",
      "links": "<a href='/AIV/07/6/12-16'>Judges 6:12-16</a>",
      "comment": "Leadership rooted in faith and self-sacrifice is emphasized, prefiguring servant leadership later reflected in Christ (cf. John 13:12-15)."
    },
    {
      "pk": 10234518,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 8,
      "text": "As they were near Jerusalem, a horseman dressed in white appeared to them, leading the way with his golden armor, brandishing weapons.",
      "links": "<a href='/AIV/06/5/13-15'>Josh. 5:13–15</a>; <a href='/AIV/44/10/30'>Acts 10:30</a>",
      "comment": "This angelic appearance confirms divine assistance for Israel’s battles, which is echoed in Revelation’s angelic interventions."
    },
    {
      "pk": 10234519,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 9,
      "text": "All together they praised the Merciful One with thanks, and their hearts were courageous. Ready for battle, not only against men but also trusting in divine strength, they went out like lions.",
      "links": "<a href='/AIV/19/107/8'>Psalm 107:8</a>",
      "comment": "Their courage comes from confidence in both natural and supernatural help, a motif central to both Old Testament and Christ’s assurance of Spirit-led victory."
    },
    {
      "pk": 10234520,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 10,
      "text": "They rushed upon the enemy unexpectedly. A detachment of cavalry went out ahead with the help of the Lord,",
      "links": "<a href='/AIV/07/7/19-22'>Judges 7:19–22</a>",
      "comment": "God’s interventions manifest often in the form of surprise and power, not through mere human strategizing."
    },
    {
      "pk": 10234521,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 11,
      "text": "and instantly they killed about eleven thousand infantry and sixteen hundred horsemen, while forcing the rest to flee.",
      "links": "<a href='/AIV/09/17/52-53'>1 Sam. 17:52–53</a>",
      "comment": "This dramatic victory points to God’s favor accompanying bold and prayerful faith."
    },
    {
      "pk": 10234522,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 12,
      "text": "Most of them escaped naked and wounded. Lysias himself also barely escaped with dishonor.",
      "links": "<a href='/AIV/09/19/24'>1 Sam. 19:24</a>",
      "comment": "Humiliation of enemies is a biblical sign of God defending his people (compare with Egypt’s defeat in Exodus)."
    },
    {
      "pk": 10234523,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 13,
      "text": "He was not without intelligence—considering the defeat he had suffered, and realizing the Hebrews were invincible because almighty God fought on their side, he sent a message,",
      "links": "<a href='/AIV/02/14/25'>Exod. 14:25</a>",
      "comment": "Recognition of divine favor and the implicit call to humble repentance is a pattern found throughout Scripture."
    },
    {
      "pk": 10234524,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 14,
      "text": "persuading them with promises and pledging to persuade the king to let them live by their own laws.",
      "links": "<a href='/AIV/17/9/27'>Esther 9:27</a>",
      "comment": "Respect for religious liberty and traditional faith is again elevated here, anticipating later Christian concerns for freedom to practice the faith."
    },
    {
      "pk": 10234525,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 15,
      "text": "Maccabeus agreed to all that Lysias proposed concerning the common good. Whatever Maccabeus delivered to Lysias in writing was presented to the king.",
      "links": "<a href='/AIV/16/2/7'>Neh. 2:7</a>",
      "comment": "Diplomacy and written agreements are a hallmark of Old Testament prudence (see Nehemiah’s dealings with Persian kings)."
    },
    {
      "pk": 10234526,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 16,
      "text": "The king granted the requests written by Lysias concerning the Jews. The letter was as follows:",
      "links": "",
      "comment": "A formal royal decree follows, demonstrating how God uses even earthly kings to accomplish his providential designs (cf. Cyrus in Isaiah 45)."
    },
    {
      "pk": 10234527,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 17,
      "text": "\"King Antiochus to his brother Lysias, greeting:",
      "links": "",
      "comment": "Royal correspondence introduces the decree."
    },
    {
      "pk": 10234528,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 18,
      "text": "Since our father set out for the upper provinces, we have heard about the hostility of the Jews, who prefer their own way of life and ask that they may be allowed to live according to their customs.",
      "links": "",
      "comment": "The centrality of tradition and holding fast to divinely-given customs is a consistent biblical theme."
    },
    {
      "pk": 10234529,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 19,
      "text": "We wish this nation to enjoy peace and tranquility as well.",
      "links": "",
      "comment": "Peace and true order follow when religious life flourishes—a principle echoed in Romans 13 and 1 Timothy 2:2."
    },
    {
      "pk": 10234530,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 20,
      "text": "Therefore, upon your return, grant them permission to follow their own ways that they may live without disturbance.",
      "links": "",
      "comment": "The wisdom in granting religious liberty is highlighted. Early Christians, too, would appeal for this right in the Roman Empire (Acts 24:14)."
    },
    {
      "pk": 10234531,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 21,
      "text": "We have heard that they are ready, if you grant them this, to resume looking after their interests and ours.",
      "links": "",
      "comment": "Faithfulness to God is shown not to be opposed to the good of society, but in harmony with it (cf. Jeremiah 29:7)."
    },
    {
      "pk": 10234532,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 22,
      "text": "Therefore grant them amnesty, and allow them to seek their own customs, so that our government is not troubled further.",
      "links": "",
      "comment": "Religious amnesty, like the later Edict of Milan for Christians, prepares for a harmonious and stable order in society."
    },
    {
      "pk": 10234533,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 23,
      "text": "Let them return to their homes, and all of you remain at peace.",
      "links": "",
      "comment": "Earthly peace as the result of wise sovereignty anticipates the greater peace Christ brings (John 20:19, 21)."
    },
    {
      "pk": 10234534,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 24,
      "text": "Let none of them be troubled by past offenses. I have sent Menelaus to assure you of their good conduct.",
      "links": "<a href='/AIV/52/4/23'>2 Macc. 4:23</a>",
      "comment": "Forgiveness of past offenses reflects a principle found in both Old and New Testaments—anticipating the fuller teaching on forgiveness in Christ."
    },
    {
      "pk": 10234535,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 25,
      "text": "Farewell. Dated the one hundred forty-eighth year, the twenty-fourth day of the month Dioscorinthius.\"",
      "links": "",
      "comment": "The exact date records the importance of this act in salvation history."
    },
    {
      "pk": 10234536,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 26,
      "text": "The same message the king wrote to the Jews:",
      "links": "",
      "comment": "The decree is now addressed directly to the Jewish community."
    },
    {
      "pk": 10234537,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 27,
      "text": "\"King Antiochus to the Senate of the Jews, and the rest of the Jews, greeting:",
      "links": "",
      "comment": "Formality of the letter reflects the honor accorded to the Jewish governing council."
    },
    {
      "pk": 10234538,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 28,
      "text": "If you fare well, that is what we desire. We are well ourselves.",
      "links": "",
      "comment": "The formal salutation echoes conventions in Greco-Roman letter-writing, seen also in Acts 15:23."
    },
    {
      "pk": 10234539,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 29,
      "text": "Menelaus has informed us of your desire to return home and care for your own affairs.",
      "links": "",
      "comment": "Menelaus acts as intermediary, a role that anticipates the importance of mediators in salvation history—fulfilled ultimately in Christ (1 Timothy 2:5)."
    },
    {
      "pk": 10234540,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 30,
      "text": "Therefore, those returning between now and the thirtieth day of Xanthicus shall have protection and safe conduct.",
      "links": "",
      "comment": "Granting safe passage evokes the biblical tradition of holy pilgrimage and exile (see Exodus 12:37–39)."
    },
    {
      "pk": 10234541,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 31,
      "text": "Let the Jews henceforth observe their own food laws and customs, just as before; none of them shall be oppressed because of past transgressions.",
      "links": "<a href='/AIV/03/11/1-47'>Leviticus 11:1-47</a>",
      "comment": "Assurance of religious liberty, especially regarding law and tradition, parallels the concern in Acts 15 for the ongoing importance of tradition for the people of God."
    },
    {
      "pk": 10234542,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 32,
      "text": "I have sent Menelaus to assure you of these things.",
      "links": "",
      "comment": "Mediator role of Menelaus once again highlighted, connecting to biblical themes of intercession and peacekeeping."
    },
    {
      "pk": 10234543,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 33,
      "text": "Farewell. Dated the one hundred forty-eighth year, the fifteenth day of the month Xanthicus.\"",
      "links": "",
      "comment": "The repetition of dating fixes these events firmly in history, paralleling how gospel events are conscientiously recorded."
    },
    {
      "pk": 10234544,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 34,
      "text": "The Romans also sent a letter with the following content:",
      "links": "",
      "comment": "The involvement of Rome foreshadows their later key role in the biblical narrative, especially in the Gospels and Acts."
    },
    {
      "pk": 10234545,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 35,
      "text": "\"Quintus Memmius, Titus Manius, ambassadors of the Romans, to the Jewish people, greeting:",
      "links": "",
      "comment": "Roman diplomacy in Judea anticipates the Church's later interaction with the broader Gentile world."
    },
    {
      "pk": 10234546,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 36,
      "text": "With regard to what Lysias, the king’s kinsman, has granted you, we also approve.",
      "links": "",
      "comment": "Rome’s response reinforces the legitimacy of the decree. The Church’s universality is anticipated in these international dealings."
    },
    {
      "pk": 10234547,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 37,
      "text": "But since some matters require the king’s decision, send someone quickly after you have carefully discussed them, so we may propose your interests, for we are heading to Antioch.",
      "links": "",
      "comment": "International mediation again anticipates later patterns of ecclesial and secular governance. The principle of jurisdiction emerges, showing ordered mediation."
    },
    {
      "pk": 10234548,
      "translation": "AIV",
      "book": 52,
      "chapter": 11,
      "verse": 38,
      "text": "Farewell. Dated the fifteenth day of the month Xanthicus, in the one hundred forty-eighth year.\"",
      "links": "",
      "comment": "The conclusion of official letters formalizes the peace accord. Restoration, amnesty, and rightful practice of faith are upheld. This careful preservation of tradition and intercession are foundational for understanding the ongoing role of the people of God as bearers of divine promises."
    }
  ],
  "translatedAt": "2025-12-23T09:39:02.864Z"
}