{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 3,
  "verses": [
    {
      "pk": 2043001,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 1,
      "text": "While holy city life was peaceful and the laws strictly observed, because Onias the high priest was devout and hated evil,",
      "links": "<a href='/AIV/51/2/1'>1 Maccabees 2:1</a>; <a href='/AIV/23/11/9'>Isaiah 11:9</a>",
      "comment": "Onias is known for his faithfulness to God's law. This aligns with the expectation that God's chosen leaders are models of piety."
    },
    {
      "pk": 2043002,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 2,
      "text": "it came about that the kings themselves honored the holy place, making the temple glorious with their finest gifts,",
      "links": "<a href='/AIV/44/21/26-28'>Acts 21:26-28</a>",
      "comment": "Even foreign rulers recognized the sanctity of the temple—a foreshadowing of how all nations would eventually come to reverence the one true God (cf. Isaiah 2:2-3)."
    },
    {
      "pk": 2043003,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 3,
      "text": "to such an extent that Seleucus, king of Asia, even provided from his own revenues the expenses required for the service of the sacrifices.",
      "links": "<a href='/AIV/21/7/11-12'>Ezra 7:11-12</a>",
      "comment": "The participation of Gentile rulers echoes Ezra's time, showing God's providential care through unexpected means."
    },
    {
      "pk": 2043004,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 4,
      "text": "But a certain Simon, of the tribe of Benjamin, who had become an official over the temple, quarreled with the high priest about the management of the market in the city.",
      "links": "<a href='/AIV/41/11/15-18'>Mark 11:15-18</a>",
      "comment": "Temple disputes were not uncommon. Jesus later cleansed the temple, fulfilling its greater destiny (John 2:13-17)."
    },
    {
      "pk": 2043005,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 5,
      "text": "Unable to prevail against Onias, Simon resorted to bribery, working with Apollonius, son of Thraseus, who was then governor of Coelesyria and Phoenicia.",
      "links": "<a href='/AIV/20/17/23'>Proverbs 17:23</a>",
      "comment": "Corruption enters even holy places, but God's justice prevails. Compare Israel's ongoing struggle with interior corruption."
    },
    {
      "pk": 2043006,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 6,
      "text": "Simon told him that the treasury in Jerusalem was full and could not be accounted for by the offerings, and that it was full of untold sums of money, not belonging to the temple, and could therefore be taken by the king.",
      "links": "<a href='/AIV/15/36/21'>2 Chronicles 36:21</a>",
      "comment": "Misrepresenting holy things for personal gain is condemned throughout Scripture."
    },
    {
      "pk": 2043007,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 7,
      "text": "When Apollonius informed the king, he ordered Heliodorus, who was his chief minister, to go and remove the supposed funds.",
      "links": "<a href='/AIV/27/6/2'>Daniel 6:2</a>",
      "comment": "The king's trust in his chief advisor shows the political structures at play."
    },
    {
      "pk": 2043008,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 8,
      "text": "So Heliodorus set out immediately, making it appear as if he would tour the cities of Coelesyria and Phoenicia, but actually intending to carry out the king’s plan.",
      "links": "<a href='/AIV/09/16/2'>1 Samuel 16:2</a>",
      "comment": "Heliodorus' covert strategy resembles times in the Old Testament where spies and secret plans were involved."
    },
    {
      "pk": 2043009,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 9,
      "text": "When he arrived in Jerusalem and was welcomed by the high priest with reverence for the sacred offering, he explained the intentions and asked if these things were true.",
      "links": "<a href='/AIV/16/13/13'>Nehemiah 13:13</a>",
      "comment": "The high priest's response highlights the vigilance required of spiritual leaders overseeing holy things."
    },
    {
      "pk": 2043010,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 10,
      "text": "Onias replied that some deposits belonged to widows and orphans, and some was property of Hyrcanus, son of Tobias, a man of high position. None had been wrongfully retained, and all had been kept safe.",
      "links": "<a href='/AIV/02/22/24'>Exodus 22:24</a>",
      "comment": "The use of temple as a safe-keeping place is important—symbolic of God's house as a refuge for the vulnerable (James 1:27)."
    },
    {
      "pk": 2043011,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 11,
      "text": "Hyrcanus, son of Tobias, a man worthy of trust, had deposited some funds. Altogether, this was not what Simon had said, but Heliodorus insisted that the money be brought for the king’s treasury.",
      "links": "<a href='/AIV/20/12/22'>Proverbs 12:22</a>",
      "comment": "The fact-checking of Simon's claim reveals the dangers of false accusations and the virtue of integrity in leadership."
    },
    {
      "pk": 2043012,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 12,
      "text": "On the appointed day, Heliodorus entered the treasury with his guards to take possession of the funds, but the whole city was in deep distress.",
      "links": "<a href='/AIV/51/1/25'>1 Maccabees 1:25</a>",
      "comment": "The city's distress recalls the anguish felt when sacred things are threatened. The people's prayers will play a key role."
    },
    {
      "pk": 2043013,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 13,
      "text": "The priests, clothed in their priestly robes, stood before the altar and prayed for God to preserve the deposits for those who had entrusted them.",
      "links": "<a href='/AIV/02/28/2-4'>Exodus 28:2-4</a>",
      "comment": "Intercessory prayer by priests connects to later Christian ideas about mediation and sacred ministry (cf. James 5:16)."
    },
    {
      "pk": 2043014,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 14,
      "text": "Whoever saw the high priest in agony, his countenance and manner altered by inward anguish, would have been moved to tears.",
      "links": "<a href='/AIV/01/50/10'>Genesis 50:10</a>",
      "comment": "The high priest as spiritual father and advocate foreshadows Christ, our High Priest (Hebrews 4:14-16)."
    },
    {
      "pk": 2043015,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 15,
      "text": "The crowd rushed out of their houses to make a public appeal, because the temple was in danger of being dishonored.",
      "links": "<a href='/AIV/16/8/1'>Nehemiah 8:1</a>",
      "comment": "The unity of the people in defending the temple is exemplary—mirroring the unity expected among the faithful (John 17:21)."
    },
    {
      "pk": 2043016,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 16,
      "text": "Women, clothed in sackcloth, ran into the streets, and the maidens who were kept indoors ran out with the elders, all lifting their hands to heaven in prayer.",
      "links": "<a href='/AIV/32/3/6'>Jonah 3:6</a>",
      "comment": "Communal repentance is a deep Old Testament tradition, and points to the importance of shared intercession in the community."
    },
    {
      "pk": 2043017,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 17,
      "text": "People were grieved, expecting the worst. The women who were expecting children prayed, lifting their voices to the Lord.",
      "links": "<a href='/AIV/09/01/10-11'>1 Samuel 1:10-11</a>",
      "comment": "Heartfelt prayer in distress is an act of trust in God, who is seen as the ultimate protector."
    },
    {
      "pk": 2043018,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 18,
      "text": "All the people fell prostrate together, urging the Lord Almighty to keep what had been entrusted safe and not to permit it to be stolen.",
      "links": "<a href='/AIV/02/14/10-14'>Exodus 14:10-14</a>",
      "comment": "The people's reverence for the temple as God's dwelling place shows acute awareness of its unique holiness."
    },
    {
      "pk": 2043019,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 19,
      "text": "The high priest was moved by fear and trembling, remembering that the Lord is the Judge and reveals what is hidden.",
      "links": "<a href='/AIV/09/16/7'>1 Samuel 16:7</a>",
      "comment": "The role of priestly intercession underlines the need for reverence before the Lord, who knows hearts and motives."
    },
    {
      "pk": 2043020,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 20,
      "text": "As Heliodorus was about to open the treasury, the Sovereign of Spirits and all power brought forth such a manifestation that all who dared to accompany him were struck with astonishment.",
      "links": "<a href='/AIV/02/40/34-35'>Exodus 40:34-35</a>",
      "comment": "God makes His presence manifest, just as at the completion of the tabernacle and Temple. The majesty and mystery of God are central to the biblical experience."
    },
    {
      "pk": 2043021,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 21,
      "text": "They saw a horse, with a fierce rider clothed in golden armor, charging at Heliodorus and striking him with two powerful forefeet.",
      "links": "<a href='/AIV/04/22/23-31'>Numbers 22:23-31</a>",
      "comment": "This appearance of a heavenly figure echoes other Old Testament theophanies, where angels act as God’s agents."
    },
    {
      "pk": 2043022,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 22,
      "text": "Two young men appeared, remarkably strong, beautiful, and gloriously dressed, standing on either side of Heliodorus and scourging him without ceasing.",
      "links": "<a href='/AIV/01/19/1-13'>Genesis 19:1-13</a>",
      "comment": "God’s intervention through angelic beings is a hallmark of divine protection and judgment."
    },
    {
      "pk": 2043023,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 23,
      "text": "Heliodorus fell suddenly to the ground, shrouded in darkness, carried away on a stretcher, and all was thrown into confusion.",
      "links": "<a href='/AIV/45/11/8-10'>Romans 11:8-10</a>",
      "comment": "Judicial blindness is often a sign of divine judgment."
    },
    {
      "pk": 2043024,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 24,
      "text": "Those who had come with him picked him up, fearing for their own lives, as this man had been struck with a force from God.",
      "links": "<a href='/AIV/06/7/20-26'>Joshua 7:20-26</a>",
      "comment": "God protects the holiness of places and people set apart for Him."
    },
    {
      "pk": 2043025,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 25,
      "text": "Heliodorus lay speechless and without hope, as if dead.",
      "links": "<a href='/AIV/09/28/20'>1 Samuel 28:20</a>",
      "comment": "The seemingly fatal result intensifies the wonder of what is about to follow—God shows mercy even in judgment."
    },
    {
      "pk": 2043026,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 26,
      "text": "But those who had seen the Lord’s power prayed that Heliodorus might be spared, for he had been sent by the king with authority.",
      "links": "<a href='/AIV/40/5/44'>Matthew 5:44</a>",
      "comment": "Petitioning for even one's adversaries is significant—reflecting the virtue of praying for enemies, as Jesus later taught."
    },
    {
      "pk": 2043027,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 27,
      "text": "The high priest, fearing the king would suspect foul play among the Jews regarding Heliodorus, offered a sacrifice for his recovery.",
      "links": "<a href='/AIV/18/42/8'>Job 42:8</a>",
      "comment": "Offering sacrifice for another’s well-being is a rich biblical theme, and hints toward the future value of prayer and sacrifice for others."
    },
    {
      "pk": 2043028,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 28,
      "text": "While the high priest was praying, the same young men clothed in the same garments appeared to Heliodorus and said, 'Be grateful to the high priest, for on his behalf the Lord has granted you life.'",
      "links": "<a href='/AIV/43/11/41-44'>John 11:41-44</a>",
      "comment": "Heliodorus’ healing is attributed directly to God’s favor via the high priest’s intercession, echoing the importance of spiritual mediation."
    },
    {
      "pk": 2043029,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 29,
      "text": "They warned him to tell everyone of the glory of God. After this, they vanished.",
      "links": "<a href='/AIV/44/4/20'>Acts 4:20</a>",
      "comment": "Bearing witness to God's glory is a duty. Similarly, after encounters with the divine, one is sent to proclaim God's works."
    },
    {
      "pk": 2043030,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 30,
      "text": "Heliodorus then offered a sacrifice to the Lord, made solemn promises to the One who had spared him, and gave thanks to Onias and his men. He returned with his army to the king.",
      "links": "<a href='/AIV/10/24/25'>2 Samuel 24:25</a>",
      "comment": "Offering thanks and sacrifice after deliverance is consistent throughout Scripture."
    },
    {
      "pk": 2043031,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 31,
      "text": "He described publicly to all what had happened to him by the hand of God.",
      "links": "<a href='/AIV/19/66/16'>Psalm 66:16</a>",
      "comment": "Public testimony is encouraged. The focus is always on giving glory to God for His works."
    },
    {
      "pk": 2043032,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 32,
      "text": "When the king asked Heliodorus who would be best suited to send again to Jerusalem, he replied,",
      "links": "<a href='/AIV/20/16/7'>Proverbs 16:7</a>",
      "comment": "Recognition of divine power even by secular rulers points to the sovereignty of God among all nations."
    },
    {
      "pk": 2043033,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 33,
      "text": "'If you have an enemy or a traitor, send him, and he will meet with the same fate as I did if he comes to that place.'",
      "links": "<a href='/AIV/02/15/9-10'>Exodus 15:9-10</a>",
      "comment": "The temple’s holiness as a place of justice and defense is upheld."
    },
    {
      "pk": 2043034,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 34,
      "text": "So Heliodorus, having experienced the power of God, refrained from stealing any more funds,",
      "links": "<a href='/AIV/02/20/15'>Exodus 20:15</a>",
      "comment": "Obedience to God follows genuine encounter with Him. True experiences of God lead to conversion."
    },
    {
      "pk": 2043035,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 35,
      "text": "and from then on, he spoke of the majesty of the Lord to all.",
      "links": "<a href='/AIV/19/96/3'>Psalm 96:3</a>",
      "comment": "Proclaiming God’s greatness is the response required of those who have witnessed His power."
    },
    {
      "pk": 2043036,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 36,
      "text": "The temple was preserved unharmed, and the city enjoyed peace. All saw that the Lord watches over the temple.",
      "links": "<a href='/AIV/19/121/4'>Psalm 121:4</a>",
      "comment": "The preservation of the Temple foreshadows God's perfect protection for His people and His dwelling."
    },
    {
      "pk": 2043037,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 37,
      "text": "From this event, all understood that the temple was under the special care and protection of the Most High.",
      "links": "<a href='/AIV/19/46/4-5'>Psalm 46:4-5</a>",
      "comment": "The temple’s consecration as the Lord’s particular possession hints at the ongoing sanctity of sacred space in divine worship."
    },
    {
      "pk": 2043038,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 38,
      "text": "So, whoever came against it would not be spared, for punishment awaited even sovereigns and kings for trespassing there.",
      "links": "<a href='/AIV/19/2/10-12'>Psalm 2:10-12</a>",
      "comment": "God's justice is impartial, applying even to those with worldly power. This points toward the universal authority of God over every nation and leader."
    },
    {
      "pk": 2043039,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 39,
      "text": "This was an example for all of how, though God’s dwelling is not among mortals, He has His eye upon that place and comes to its aid.",
      "links": "<a href='/AIV/19/33/13-15'>Psalm 33:13-15</a>",
      "comment": "God is transcendent yet intimately involved with His people, especially in worship. Compare the spiritual belief that God’s presence is uniquely real in sacred acts."
    },
    {
      "pk": 2043040,
      "translation": "AIV",
      "book": 52,
      "chapter": 3,
      "verse": 40,
      "text": "Such is the outcome of Heliodorus and the preservation of the treasury in accordance with the Lord’s righteous judgment.",
      "links": "<a href='/AIV/19/97/2'>Psalm 97:2</a>",
      "comment": "The final verse summarizes divine justice and mercy, themes fulfilled in Christ, who intercedes as the true High Priest (Hebrews 7:25-27)."
    }
  ],
  "translatedAt": "2025-12-23T09:34:25.575Z"
}