{
  "book": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 5,
  "verses": [
    {
      "pk": 2050051,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 1,
      "text": "About this time, Antiochus was preparing for a second invasion of Egypt.",
      "links": "<a href='/AIV/10/8/10'>Daniel 8:10</a>;<a href='/AIV/10/11/25'>Daniel 11:25</a>",
      "comment": "Antiochus IV Epiphanes' actions fulfill earlier prophecies concerning desecration and conflict against the faithful, as foretold especially in Daniel."
    },
    {
      "pk": 2050052,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 2,
      "text": "But in Jerusalem, certain people spread a rumor that Antiochus had died, so Jason took at least a thousand men and suddenly attacked the city. The defenders were forced to flee, and the city was captured; Menelaus took refuge in the fortress.",
      "links": "<a href='/AIV/14/36/14'>2 Chron. 36:14</a>",
      "comment": "The violent civil unrest in Jerusalem shows the deep division among the Jewish people at this time. Those loyal to God's ways are contrasted with those seduced by foreign practices."
    },
    {
      "pk": 2050053,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 3,
      "text": "Jason slaughtered his own fellow citizens without mercy, disregarding that success among his own people is a defeat.",
      "links": "<a href='/AIV/19/55/12-14'>Ps. 55:12–14</a>",
      "comment": "The text highlights a moral lesson: victory over your own, especially in matters of faith, is self-destructive—a theme echoed elsewhere in the Scriptures."
    },
    {
      "pk": 2050054,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 4,
      "text": "Yet he did not gain control of the government; in the end, Jason was forced to flee back to the region of the Ammonites.",
      "links": "<a href='/AIV/7/11/4'>Judges 11:4</a>",
      "comment": "Jason's failure demonstrates the futility of seeking power through violence and betrayal among God’s chosen people."
    },
    {
      "pk": 2050055,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 5,
      "text": "He ultimately ended up with ruin as his reward for his disloyalty, being driven from one place to another, hated everywhere as a traitor to his nation and laws, and finally cast out to Egypt.",
      "links": "<a href='/AIV/10/12/2'>Daniel 12:2</a>",
      "comment": "A spiritual lesson is found here: faithlessness and rebellion have consequences, not just within this life but eternally as well."
    },
    {
      "pk": 2050056,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 6,
      "text": "He, who had driven so many from their own land, ended his own life among foreigners, after retreating to the territory of the Spartans, hoping to find protection because they shared his ancestry.",
      "links": "<a href='/AIV/19/109/6-8'>Ps. 109:6–8</a>",
      "comment": "This turn of events reinforces the biblical principle of what one sows, that he also reaps. (Gal 6:7)"
    },
    {
      "pk": 2050057,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 7,
      "text": "Jason, rejected by all, was driven from city to city, pursued by everyone as a traitor, forced to take refuge among those he had once persecuted. Finally, he perished in exile on foreign soil.",
      "links": "<a href='/AIV/19/109/10'>Ps. 109:10</a>",
      "comment": "This verse reminds us that human glory fades quickly, especially when achieved through unrighteous ways."
    },
    {
      "pk": 2050058,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 8,
      "text": "He suffered the punishment he deserved for his many crimes, dying in a foreign land, in the wilderness and the mountains; no one mourned him or gave him a decent burial.",
      "links": "<a href='/AIV/19/88/5'>Ps. 88:5</a>",
      "comment": "Unrepentant sin leads to isolation and dishonor—a contrast with the hope held out in the promises of the one true God."
    },
    {
      "pk": 2050059,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 9,
      "text": "When King returned from Egypt, angry at what had happened, he attacked the city. He ordered his soldiers to show no mercy to anyone they met and to slaughter all who hid in their houses.",
      "links": "<a href='/AIV/10/8/24'>Daniel 8:24</a>",
      "comment": "Here, we see the king’s fury unleashed, a sign of the severity of judgment upon the city for its sins and divisions."
    },
    {
      "pk": 2050060,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 10,
      "text": "So there was massacre—young and old, destroyed together; boys and girls, women and infants, all slaughtered.",
      "links": "<a href='/AIV/25/2/21'>Lamentations 2:21</a>",
      "comment": "A tragic fulfillment of prophetic warnings about judgment when God’s people fail to keep His covenant."
    },
    {
      "pk": 2050061,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 11,
      "text": "In just three days, eighty thousand people perished: forty thousand killed in the attack, and the same number sold into slavery.",
      "links": "<a href='/AIV/10/11/33'>Daniel 11:33</a>",
      "comment": "The scale of suffering in Jerusalem was immense, underscoring the consequences of rejecting divine law and order."
    },
    {
      "pk": 2050062,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 12,
      "text": "Out of rage against the Jews, Antiochus boldly entered the holiest temple on earth, led by Menelaus, who had betrayed the laws and country.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The desecration of the Temple echoes earlier occasions of unholy incursions and looks ahead to later acts that prefigure ultimate abomination."
    },
    {
      "pk": 2050063,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 13,
      "text": "With unclean hands, Antiochus took the sacred holy vessels, which other kings had respected and left untouched after their victories.",
      "links": "<a href='/AIV/14/36/18'>2 Chron. 36:18</a>",
      "comment": "Respect for holy things is demanded by God throughout the Scriptures. Those who violate sacred vessels face severe judgment (see also Daniel 5:2–4)."
    },
    {
      "pk": 2050064,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 14,
      "text": "Antiochus, in his arrogance, looted the Temple, lifting his impious hands against all its treasures.",
      "links": "<a href='/AIV/19/74/18'>Ps. 74:18</a>",
      "comment": "This verse highlights the profaning of what has been set apart by God, a foreshadowing of the greater and final desecration predicted by prophet Daniel."
    },
    {
      "pk": 2050065,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 15,
      "text": "He gloated, wrongly believing his power was from the Lord, and did not see that the Lord, in His patience, had turned away His anger for a little while for the sake of His people.",
      "links": "<a href='/AIV/19/7/11'>Ps. 7:11</a>; <a href='/AIV/35/2/3'>Hab. 2:3</a>",
      "comment": "God sometimes allows trials, even great desecrations, for the testing and ultimate purification of His people—a theme echoed in Christ's suffering for redemption."
    },
    {
      "pk": 2050066,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 16,
      "text": "But the Lord did not choose the people for the sake of the sanctuary, but the sanctuary for the sake of the people.",
      "links": "<a href='/AIV/23/66/1-2'>Isaiah 66:1–2</a>",
      "comment": "The true value is in the people set apart for God, not merely the earthly building. In the New Testament, the Church is called the new temple of God (see 1 Cor. 3:16)."
    },
    {
      "pk": 2050067,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 17,
      "text": "So, in His anger, God allowed the Temple to be defiled because of the sins of those who lived in the city.",
      "links": "<a href='/AIV/23/64/10-11'>Isa. 64:10–11</a>",
      "comment": "The Lord's discipline is meant to bring the people to repentance, revealing a pattern continued in the New Covenant whenever the people stray from truth."
    },
    {
      "pk": 2050068,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 18,
      "text": "But even Antiochus' actions would not have happened if the city’s people had not sinned; therefore the Lord, in His justice, did not choose the nation for the sake of the place, but the place for the sake of the nation.",
      "links": "<a href='/AIV/5/9/5-6'>Deut. 9:5–6</a>",
      "comment": "Echoing Deuteronomy, the source of holiness is God’s grace, not merely ancestral descent or location."
    },
    {
      "pk": 2050069,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 19,
      "text": "Therefore, the sanctuary also shared in the sufferings of the people and was abandoned when the people deserved punishment, but again honored when the Lord showed favor.",
      "links": "<a href='/AIV/19/30/4-5'>Ps. 30:4–5</a>",
      "comment": "This points to an intimate connection between worship, the life of the people, and God’s restorative mercy, hinting at the future renewal in Christ (see John 2:19–21)."
    },
    {
      "pk": 2050070,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 20,
      "text": "The Lord abandoned the Temple so that it might be devastated. Those who looted it rejoiced as much as those who helped build it had once rejoiced.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "Joy from looters is fleeting, but God’s redemption lasts. In the New Testament, the destruction and rebuilding of the Temple are fulfilled in the death and resurrection of Jesus (see Matt. 26:61)."
    },
    {
      "pk": 2050071,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 21,
      "text": "Antiochus carried away from the Temple eighteen hundred talents of silver, and hurried back to Antioch, proud as a conqueror.",
      "links": "<a href='/AIV/14/36/7'>2 Chron. 36:7</a>",
      "comment": "This detail illustrates the immense material loss caused by sin and division. True wealth is spiritual, as taught repeatedly by Christ."
    },
    {
      "pk": 2050072,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 22,
      "text": "He left governors to oppress the people: a man named Philip, a non-Jew, over Jerusalem; Andronicus in Samaria; and a cruel Apollonius over the Alexandrians.",
      "links": "<a href='/AIV/25/1/5'>Lam. 1:5</a>",
      "comment": "Foreign governors symbolize the loss of Israel’s autonomy due to their unfaithfulness, again anticipating the spiritual need for a true King and Shepherd (compare John 10:11)."
    },
    {
      "pk": 2050073,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 23,
      "text": "Apollonius, with a military force, behaved as a tyrant, and in Jerusalem and Samaria, he ruled with cruelty.",
      "links": "<a href='/AIV/7/6/2-6'>Judges 6:2–6</a>",
      "comment": "Foreign rule always resulted in the oppression of Israel, revealing the need for deliverance by a faithful leader—a theme fulfilled in the coming Messiah."
    },
    {
      "pk": 2050074,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 24,
      "text": "He sent Apollonius with an army of twenty-two thousand, commanding him to kill all the grown men and to sell the women and boys as slaves.",
      "links": "<a href='/AIV/10/7/21-25'>Daniel 7:21–25</a>",
      "comment": "The savagery shows the hostility of worldly powers toward the faithful. Persecution and martyrdom are recurring trials for the just."
    },
    {
      "pk": 2050075,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 25,
      "text": "Arriving in Jerusalem, under the pretense of peace, he waited until the holy Sabbath. Then, finding the Jews at rest, he ordered his men to launch a surprise attack.",
      "links": "<a href='/AIV/19/55/20-21'>Ps. 55:20–21</a>",
      "comment": "The sanctity of the Sabbath is exploited for treachery—a violation reminiscent of future betrayals (see Matt. 26:47–50)."
    },
    {
      "pk": 2050076,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 26,
      "text": "He destroyed many people, but those who fled to the mountains escaped. The city was taken, and Apollonius set it on fire, pulled down its houses and city walls on every side.",
      "links": "<a href='/AIV/19/79/7'>Ps. 79:7</a>",
      "comment": "Those who take refuge in God are spared, even in the midst of judgment. The motif of 'remnant' echoes consistently throughout redemption history."
    },
    {
      "pk": 2050077,
      "translation": "AIV",
      "book": 50,
      "chapter": 5,
      "verse": 27,
      "text": "But Judas Maccabeus, with about nine others, withdrew into the wilderness, living like wild animals among the mountains. They continued to observe the Sabbath in secret, eating only what plants grew there.",
      "links": "<a href='/AIV/58/11/38'>Hebrews 11:38</a>",
      "comment": "Judas' faithfulness amid persecution foreshadows the resilience of the persecuted Church. God's law, communal worship, and hope in His promises sustain the faithful remnant."
    }
  ],
  "translatedAt": "2025-12-23T09:35:35.506Z"
}