{
  "book": "1 Thessalonians",
  "bookAbbreviation": "1Thess",
  "chapter": 1,
  "verses": [
    {
      "pk": 1100101,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, Silvanus, and Timothy, to the church of the Thessalonians in God the Father and the Lord Jesus Christ: Grace to you and peace.",
      "links": "<a href='/AIV/1/1/2'>Gen. 1:2</a>; <a href='/AIV/46/1/3'>1 Cor. 1:3</a>",
      "comment": "Paul begins his letter with a greeting typical of his epistles, invoking grace and peace from both God the Father and the Lord Jesus Christ. Notably, Jesus is described as 'Lord', affirming His divinity (see John 1:1; Phil. 2:11), and Paul addresses the church corporately, suggesting a unified community established in apostolic authority."
    },
    {
      "pk": 1100102,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 2,
      "text": "We always give thanks to God for all of you, making mention of you in our prayers.",
      "links": "<a href='/AIV/49/1/16'>Eph. 1:16</a>; <a href='/AIV/50/1/3'>Phil. 1:3</a>",
      "comment": "Paul's practice of continual thanksgiving and intercessory prayer demonstrates deep pastoral care, reflecting how leaders intercede for the spiritual growth of their flocks. This highlights the importance of praying for one another, consistent with spiritual traditions that emphasize communal prayer (cf. James 5:16)."
    },
    {
      "pk": 1100103,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 3,
      "text": "Remembering before our God and Father your work of faith, labor of love, and steadfastness of hope in our Lord Jesus Christ.",
      "links": "<a href='/AIV/46/13/13'>1 Cor. 13:13</a>; <a href='/AIV/58/6/10'>Heb. 6:10</a>",
      "comment": "Faith, love, and hope are interconnected virtues, considered by Paul to be foundational. This echoes Paul's famous triad in 1 Corinthians 13:13 and highlights the visible fruits of true Christian life. The order—faith, love, hope—suggests a progression from belief to action, culminating in confident perseverance."
    },
    {
      "pk": 1100104,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 4,
      "text": "For we know, brothers loved by God, that He has chosen you,",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/49/1/4'>Eph. 1:4</a>",
      "comment": "Paul affirms their election, which in Scripture often refers to God's sovereign initiative in salvation. This concept of being 'chosen' reflects both divine grace and a calling to holy living (cf. Deut. 7:6), encouraging believers to see themselves as part of God’s continuing plan."
    },
    {
      "pk": 1100105,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 5,
      "text": "because our gospel did not come to you in word only, but also in power, and in the Holy Spirit, and with full conviction. You know what manner of men we became among you for your sake.",
      "links": "<a href='/AIV/46/2/4'>1 Cor. 2:4</a>; <a href='/AIV/44/2/4'>Acts 2:4</a>",
      "comment": "The gospel is affirmed not only as a message, but as an experience powered by the Holy Spirit. The reference to 'power' and 'conviction' points to the Spirit’s role in confirming truth (see John 16:13), and the apostolic example provides a living witness. A sacramental understanding can be seen here: spiritual realities made visible through human ministry."
    },
    {
      "pk": 1100106,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 6,
      "text": "And you became imitators of us and of the Lord, receiving the word in much affliction, with the joy of the Holy Spirit.",
      "links": "<a href='/AIV/46/11/1'>1 Cor. 11:1</a>; <a href='/AIV/40/5/10-12'>Matt. 5:10–12</a>",
      "comment": "Christian discipleship involves imitation of apostolic example as well as Christ Himself. The paradox of suffering with joy through the Holy Spirit echoes both Jesus’ teaching on persecution (Matt. 5:10–12) and the call to joy amid trials (James 1:2). By enduring affliction while remaining faithful, believers share in Christ’s suffering and victory."
    },
    {
      "pk": 1100107,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 7,
      "text": "So that you became an example to all the believers in Macedonia and Achaia.",
      "links": "<a href='/AIV/47/8/1'>2 Cor. 8:1</a>",
      "comment": "The Thessalonians’ faithfulness made their church a model for others, illustrating how local communities can inspire broader spiritual renewal. Their example foreshadows the principle that the Church is called to be a visible witness in the world (cf. Matt. 5:14–16)."
    },
    {
      "pk": 1100108,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 8,
      "text": "For from you the word of the Lord has sounded forth, not only in Macedonia and Achaia, but also everywhere your faith toward God has gone out, so that we have no need to say anything.",
      "links": "<a href='/AIV/45/1/8'>Rom. 1:8</a>",
      "comment": "The spread of the gospel through the Thessalonian believers shows their active participation in the mission. Paul is emphasizing a living, proclaiming community that fulfills the Great Commission (Matt. 28:19), and their witness is so effective that their reputation precedes any explanation."
    },
    {
      "pk": 1100109,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 9,
      "text": "For they themselves report about us what kind of welcome we had among you, and how you turned to God from idols to serve the living and true God,",
      "links": "<a href='/AIV/44/14/15'>Acts 14:15</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Paul notes their conversion—abandoning idols for the worship of the living and true God. This recalls Old Testament teachings against idolatry (Exod. 20:3–5) and further links the continuity between the old and new covenants, as well as radical transformation in Christ."
    },
    {
      "pk": 1100110,
      "translation": "AIV",
      "book": 52,
      "chapter": 1,
      "verse": 10,
      "text": "and to wait for His Son from heaven, whom He raised from the dead—Jesus, who delivers us from the wrath to come.",
      "links": "<a href='/AIV/40/24/30'>Matt. 24:30</a>; <a href='/AIV/45/5/9'>Rom. 5:9</a>; <a href='/AIV/19/2/12'>Ps. 2:12</a>",
      "comment": "The Thessalonians are directed to wait for Christ’s second coming, affirming both His resurrection and universal deliverance from judgment. Reference to Jesus as the Son and the one 'raised from the dead' underlines His divine sonship and fulfills messianic prophecy (Ps. 2:7). The anticipation of deliverance echoes themes of salvation, judgment, and eternal hope, encouraging believers to remain steadfast in faith and unity until the Lord’s return."
    }
  ],
  "translatedAt": "2025-12-23T03:59:08.674Z"
}