{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 11,
  "verses": [
    {
      "pk": 9011001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 1,
      "text": "Then Nahash the Ammonite came up and besieged Jabesh-gilead. And all the men of Jabesh said to Nahash, 'Make a treaty with us, and we will serve you.'",
      "links": "<a href='/AIV/7/21/8'>Judg 21:8-12</a>; <a href='/AIV/9/12/12'>1 Sam 12:12</a>",
      "comment": "The willingness of the Israelites to make a treaty points to their desperation and lack of leadership before Saul's rise. This sets up God raising a deliverer, foreshadowing the need for a divinely appointed, unifying leadership in God's people. See Judg 21:8-12 for context on Jabesh-gilead's unique history."
    },
    {
      "pk": 9011002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 2,
      "text": "But Nahash the Ammonite said to them, 'On this condition I will make a treaty with you, that I gouge out the right eye of each one of you and thus bring disgrace on all Israel.'",
      "links": "<a href='/AIV/5/28/65'>Deut 28:65</a>; <a href='/AIV/9/17/45'>1 Sam 17:45</a>",
      "comment": "Nahash's demand isn't just cruel, but meant to humiliate Israel as a nation. Physical mutilation recalls curses for turning away from God (Deut 28:65). This sets up the necessity of saving intervention through anointed leadership."
    },
    {
      "pk": 9011003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 3,
      "text": "The elders of Jabesh said to him, 'Give us seven days' time, so we may send messengers throughout all Israel. Then, if there is no one to save us, we will come out to you.'",
      "links": "<a href='/AIV/7/2/15'>Judg 2:15</a>; <a href='/AIV/9/9/16'>1 Sam 9:16</a>",
      "comment": "Their request for a delay expresses hope for a savior—a theme in Israel’s history (see Judg 2:15; 1 Sam 9:16). Spiritually, it foreshadows longing for a true deliverer."
    },
    {
      "pk": 9011004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 4,
      "text": "So the messengers came to Gibeah of Saul and told the news in the ears of the people, and all the people wept aloud.",
      "links": "<a href='/AIV/9/10/26'>1 Sam 10:26</a>; <a href='/AIV/2/2/23'>Exodus 2:23</a>",
      "comment": "The people’s reaction mirrors Israel’s history of crying out for help (cf. Judges and Exodus). Gibeah, Saul’s home, is the place of hope’s renewal through God’s chosen leader."
    },
    {
      "pk": 9011005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 5,
      "text": "Now Saul was coming from the field, behind the oxen. And Saul said, 'What is wrong with the people, for they are weeping?' So they told him the words of the men of Jabesh.",
      "links": "<a href='/AIV/9/10/22'>1 Sam 10:22</a>; <a href='/AIV/9/10/27'>1 Sam 10:27</a>",
      "comment": "Saul’s humble posture (working the field) is like that of a servant-leader, reminiscent of Christ’s humility as the Good Shepherd (Phil 2:6-8). Saul is now confronted with his calling."
    },
    {
      "pk": 9011006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 6,
      "text": "And the Spirit of God rushed upon Saul when he heard these words, and his anger burned greatly.",
      "links": "<a href='/AIV/7/3/10'>Judg 3:10</a>; <a href='/AIV/9/10/6'>1 Sam 10:6</a>; <a href='/AIV/44/13/9'>Acts 13:9</a>",
      "comment": "The Spirit empowers Saul as God’s chosen instrument, echoing how the Spirit came upon the judges. This aligns with the pattern of divine commissioning. In the New Testament, the Spirit descends on apostles to equip them for their mission."
    },
    {
      "pk": 9011007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 7,
      "text": "He took a yoke of oxen and cut them in pieces and sent them throughout all the territory of Israel by the hand of messengers, saying, 'Whoever does not follow Saul and Samuel, so shall it be done to his oxen!' Then the dread of the LORD fell upon the people, and they came out as one man.",
      "links": "<a href='/AIV/7/19/29'>Judg 19:29</a>; <a href='/AIV/2/15/16'>Ex 15:16</a>",
      "comment": "Saul’s action recalls the precedent in Judg 19:29, signaling the seriousness of national sin and unity. The involvement of both Saul and Samuel reflects a union of kingly and prophetic (priestly) leadership, pointing to the intertwining of spiritual and civil authority, as seen most perfectly in Christ—King, Prophet, and Priest."
    },
    {
      "pk": 9011008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 8,
      "text": "When he numbered them at Bezek, the people of Israel were three hundred thousand, and the men of Judah thirty thousand.",
      "links": "<a href='/AIV/7/20/2'>Judg 20:2</a>; <a href='/AIV/10/24/9'>2 Sam 24:9</a>",
      "comment": "Israel gathers as a united nation under one leadership, presaging the fullness of unity that God intends for His people—a theme found throughout the Old and New Testaments (John 17:21)."
    },
    {
      "pk": 9011009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 9,
      "text": "They said to the messengers who came, 'Say this to the men of Jabesh-gilead, “Tomorrow, by the time the sun is hot, you will have deliverance.”' The messengers came and reported it to the men of Jabesh, and they were glad.",
      "links": "<a href='/AIV/2/14/13'>Ex 14:13</a>; <a href='/AIV/6/10/6'>Josh 10:6-10</a>",
      "comment": "Saul’s promise of deliverance echoes Moses’ assurance before the Red Sea (Ex 14:13), showing that God still raises up saviors for His people. The motif of joyful proclamation anticipates the ‘good news’ (gospel) in its earliest form."
    },
    {
      "pk": 9011010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 10,
      "text": "Therefore the men of Jabesh said, 'Tomorrow we will come out to you, and you may do to us whatever seems good to you.'",
      "links": "<a href='/AIV/9/11/3'>1 Sam 11:3</a>",
      "comment": "The men of Jabesh feign surrender, buying time for Saul's rescue. Their faith parallels times of hopeful waiting on God’s deliverance despite apparent defeat."
    },
    {
      "pk": 9011011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 11,
      "text": "On the next day, Saul put the people in three companies. They came into the midst of the camp during the morning watch and struck down the Ammonites until the heat of the day. Those who survived were scattered, so that no two of them were left together.",
      "links": "<a href='/AIV/7/7/16'>Judg 7:16-22</a>; <a href='/AIV/9/13/2'>1 Sam 13:2</a>",
      "comment": "Saul’s victory echoes earlier God-given triumphs (Judg 7:16-22, Gideon). The unity and discipline of the people prefigures the unity required of the Church."
    },
    {
      "pk": 9011012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 12,
      "text": "Then the people said to Samuel, 'Who is it that said, “Shall Saul reign over us?” Bring those men, that we may put them to death.'",
      "links": "<a href='/AIV/9/10/27'>1 Sam 10:27</a>; <a href='/AIV/16/2/19'>Neh 2:19</a>",
      "comment": "After God’s vindication of Saul, public opinion turns to enforce unity. The pattern of opposing and then submitting to God’s anointed mirrors the way Christ’s kingship is eventually recognized (Phil 2:9-11)."
    },
    {
      "pk": 9011013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 13,
      "text": "But Saul said, 'No one shall be put to death this day, for today the LORD has saved Israel.'",
      "links": "<a href='/AIV/9/14/45'>1 Sam 14:45</a>; <a href='/AIV/1/50/20'>Gen 50:20</a>",
      "comment": "Saul’s mercy reflects the principle that vengeance is God’s. The focus is on divine salvation and forgiveness—anticipating Christ’s teaching and the command to forgive."
    },
    {
      "pk": 9011014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 14,
      "text": "Then Samuel said to the people, 'Come, let us go to Gilgal and renew the kingdom there.'",
      "links": "<a href='/AIV/6/4/19'>Josh 4:19</a>; <a href='/AIV/9/10/8'>1 Sam 10:8</a>",
      "comment": "Gilgal is a place of covenant renewal: here, the kingship is affirmed before God, aligning spiritual with earthly authority. The renewal emphasizes sacramental covenant and obedience—themes later fulfilled in the New Covenant."
    },
    {
      "pk": 9011015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 11,
      "verse": 15,
      "text": "So all the people went to Gilgal, and there they made Saul king before the LORD in Gilgal. There they sacrificed peace offerings before the LORD, and Saul and all the men of Israel rejoiced greatly.",
      "links": "<a href='/AIV/9/10/24'>1 Sam 10:24</a>; <a href='/AIV/3/3/1'>Lev 3:1</a>",
      "comment": "The public, liturgical confirmation of kingship through sacrifice signifies that every major event for God’s people is accompanied by thanksgiving and worship. This pattern continues into the New Covenant Church, where sacramental celebration marks the great acts of God."
    }
  ],
  "translatedAt": "2025-12-24T02:54:17.325Z"
}