{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 22,
  "verses": [
    {
      "pk": 1902201,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 1,
      "text": "David left there and escaped to the cave of Adullam. When his brothers and all his father's house heard, they went down there to him.",
      "links": "<a href='/ESV/10/21/15'>1 Sam. 21:15</a>; <a href='/ESV/13/12/16'>1 Chr. 12:16</a>",
      "comment": "Adullam cave is located in Judah, and David's family joins to seek safety."
    },
    {
      "pk": 1902202,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 2,
      "text": "And everyone who was in distress, and everyone who was in debt, and everyone who was discontented gathered to him, and he became captain over them. About four hundred men were with him.",
      "links": "<a href='/ESV/13/12/8'>1 Chr. 12:8</a>",
      "comment": "The Hebrew terms for distress and discontent represent those under oppression and hardship."
    },
    {
      "pk": 1902203,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 3,
      "text": "David went from there to Mizpeh of Moab. He said to the king of Moab, 'Please let my father and my mother stay with you, until I know what God will do for me.'",
      "links": "<a href='/ESV/08/1/1-2'>Ruth 1:1–2</a>",
      "comment": "David's request may reflect his Moabite lineage through Ruth."
    },
    {
      "pk": 1902204,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 4,
      "text": "He left them with the king of Moab, and they stayed with him all the time that David was in the stronghold.",
      "links": "<a href='/ESV/09/23/14'>1 Sam. 23:14</a>",
      "comment": "\"The stronghold\" refers generally to David’s place of refuge; possible location is Masada."
    },
    {
      "pk": 1902205,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 5,
      "text": "Then the prophet Gad said to David, 'Do not stay in the stronghold; depart, and go into the land of Judah.' So David left and came into the forest of Hereth.",
      "links": "<a href='/ESV/09/21/9'>1 Sam. 21:9</a>; <a href='/ESV/13/29/29'>1 Chr. 29:29</a>",
      "comment": "Gad later becomes known as David’s seer. Hereth's location is not precisely known."
    },
    {
      "pk": 1902206,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 6,
      "text": "When Saul heard that David and the men with him had been discovered—Saul was sitting at Gibeah under the tamarisk tree on the height, with his spear in his hand, and all his servants were standing around him—",
      "links": "<a href='/ESV/09/14/2'>1 Sam. 14:2</a>; <a href='/ESV/09/19/10'>1 Sam. 19:10</a>",
      "comment": "Saul’s spear symbolizes his kingship and volatility."
    },
    {
      "pk": 1902207,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 7,
      "text": "Saul said to his servants who stood around him, 'Hear now, you Benjaminites! Will the son of Jesse give every one of you fields and vineyards, will he make you all commanders of thousands and commanders of hundreds,",
      "links": "<a href='/ESV/09/8/12-14'>1 Sam. 8:12–14</a>",
      "comment": "Saul appeals to tribal loyalty and accuses his servants of conspiracy."
    },
    {
      "pk": 1902208,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 8,
      "text": "that all of you have conspired against me? No one tells me when my son makes a covenant with the son of Jesse. None of you is sorry for me or tells me that my son has stirred up my servant against me to lie in wait, as at this day.'",
      "links": "<a href='/ESV/09/18/3'>1 Sam. 18:3</a>; <a href='/ESV/09/20/16'>1 Sam. 20:16</a>",
      "comment": "Saul suspects a plot with Jonathan’s covenant with David."
    },
    {
      "pk": 1902209,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 9,
      "text": "Then Doeg the Edomite, who stood by the servants of Saul, said, 'I saw the son of Jesse come to Nob, to Ahimelech the son of Ahitub,",
      "links": "<a href='/ESV/09/21/7'>1 Sam. 21:7</a>",
      "comment": "Doeg had earlier witnessed David at Nob."
    },
    {
      "pk": 1902210,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 10,
      "text": "and he inquired of the LORD for him, and gave him provisions, and gave him the sword of Goliath the Philistine.'",
      "links": "<a href='/ESV/09/21/9'>1 Sam. 21:9</a>",
      "comment": "Doeg gives an account accurate but omitting David’s claim to Ahimelech."
    },
    {
      "pk": 1902211,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 11,
      "text": "Then the king sent to summon Ahimelech the priest, the son of Ahitub, and all his father's house, the priests who were at Nob, and all of them came to the king.",
      "links": "<a href='/ESV/09/21/1'>1 Sam. 21:1</a>",
      "comment": "All priests at Nob are summoned for the king’s council."
    },
    {
      "pk": 1902212,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 12,
      "text": "Saul said, 'Hear now, son of Ahitub.' He answered, 'Here I am, my lord.'",
      "links": "<a href='/ESV/09/3/6'>1 Sam. 3:6</a>",
      "comment": "Standard address formula in Hebrew narrative."
    },
    {
      "pk": 1902213,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 13,
      "text": "Saul said to him, 'Why have you conspired against me, you and the son of Jesse, in that you have given him bread and a sword and have inquired of God for him, so that he has rebelled against me and lies in wait, as at this day?'",
      "links": "<a href='/ESV/09/21/6'>1 Sam. 21:6</a>; <a href='/ESV/09/22/8'>1 Sam. 22:8</a>",
      "comment": "Saul assumes conspiracy without evidence."
    },
    {
      "pk": 1902214,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 14,
      "text": "Then Ahimelech answered the king, 'Who among all your servants is so faithful as David, who is the king’s son-in-law, and is captain over your guard, and honored in your house?",
      "links": "<a href='/ESV/09/18/27'>1 Sam. 18:27</a>; <a href='/ESV/09/18/13'>1 Sam. 18:13</a>",
      "comment": "Ahimelech appeals to David’s status and innocence."
    },
    {
      "pk": 1902215,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 15,
      "text": "Was today the first time I inquired of God for him? Far from it! Let not the king impute anything to his servant, or to all the house of my father, for your servant knew nothing of all this, little or much.'",
      "links": "<a href='/ESV/09/20/2'>1 Sam. 20:2</a>",
      "comment": "Ahimelech pleads ignorance and innocence."
    },
    {
      "pk": 1902216,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 16,
      "text": "But the king said, 'You shall surely die, Ahimelech, you and all your father’s house.'",
      "links": "<a href='/ESV/09/2/31-33'>1 Sam. 2:31–33</a>",
      "comment": "Fulfills earlier judgment from God against Eli’s house."
    },
    {
      "pk": 1902217,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 17,
      "text": "The king said to the guard who stood about him, 'Turn and kill the priests of the LORD, because their hand also is with David, and they knew that he fled and did not tell me.' But the servants of the king would not put out their hand to strike the priests of the LORD.",
      "links": "<a href='/ESV/09/13/17-18'>1 Sam. 13:17–18</a>",
      "comment": "The king’s men refuse to attack the priests, fearing God."
    },
    {
      "pk": 1902218,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 18,
      "text": "Then the king said to Doeg, 'You turn and strike the priests.' And Doeg the Edomite turned and struck down the priests, and he killed on that day eighty-five men who wore the linen ephod.",
      "links": "<a href='/ESV/09/2/33'>1 Sam. 2:33</a>",
      "comment": "Eighty-five is from the Hebrew; “linen ephod” denotes serving priests."
    },
    {
      "pk": 1902219,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 19,
      "text": "And he put Nob, the city of the priests, to the sword: both men and women, children and infants, oxen, donkeys, and sheep, he put to the sword.",
      "links": "<a href='/ESV/09/15/3'>1 Sam. 15:3</a>",
      "comment": "The execution mirrors herem (devotion to destruction) from earlier commands."
    },
    {
      "pk": 1902220,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 20,
      "text": "But one of the sons of Ahimelech the son of Ahitub, named Abiathar, escaped and fled after David.",
      "links": "<a href='/ESV/09/23/6'>1 Sam. 23:6</a>",
      "comment": "Abiathar becomes the last surviving priest of this family."
    },
    {
      "pk": 1902221,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 21,
      "text": "Abiathar told David that Saul had killed the priests of the LORD.",
      "links": "<a href='/ESV/09/22/18'>1 Sam. 22:18</a>",
      "comment": "Abiathar becomes David’s priest."
    },
    {
      "pk": 1902222,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 22,
      "text": "David said to Abiathar, 'I knew on that day, when Doeg the Edomite was there, that he would surely tell Saul. I am responsible for the death of all your father’s house.'",
      "links": "<a href='/ESV/09/21/7'>1 Sam. 21:7</a>",
      "comment": "David confesses his indirect role in the tragedy."
    },
    {
      "pk": 1902223,
      "translation": "AIV",
      "book": 9,
      "chapter": 22,
      "verse": 23,
      "text": "Stay with me; do not be afraid, for he who seeks my life seeks your life. With me you will be kept safe.'",
      "links": "<a href='/ESV/09/23/17'>1 Sam. 23:17</a>",
      "comment": "David offers protection to Abiathar in his flight from Saul."
    }
  ],
  "translatedAt": "2025-12-22T08:35:07.092Z"
}