{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 1,
  "verses": [
    {
      "pk": 9001001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 1,
      "text": "There was a man from Ramathaim Zophim, from the hill country of Ephraim, and his name was Elkanah the son of Jeroham, son of Elihu, son of Tohu, son of Zuph, an Ephraimite.",
      "links": "<a href='/AIV/09/09/4'>1 Samuel 9:4</a>; <a href='/AIV/13/06/22-28'>1 Chronicles 6:22-28</a>",
      "comment": "The genealogy here sets the background for Samuel's priestly and prophetic authority, highlighting his Levite heritage through the Ephraimite region (cf. 1 Chronicles 6)."
    },
    {
      "pk": 9001002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 2,
      "text": "He had two wives. The name of one was Hannah, and the name of the other, Peninnah. Peninnah had children, but Hannah had no children.",
      "links": "<a href='/AIV/01/16/1-5'>Genesis 16:1-5</a>; <a href='/AIV/09/01/5'>1 Samuel 1:5</a>",
      "comment": "The mention of two wives recalls similar situations among the patriarchs (Genesis 16). Hannah's barrenness foreshadows God's intervention; the theme of God granting children is common in the biblical narrative."
    },
    {
      "pk": 9001003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 3,
      "text": "This man went up from his city every year to worship and to sacrifice to the Lord of hosts in Shiloh. The two sons of Eli, Hophni and Phinehas, were there as priests of the Lord.",
      "links": "<a href='/AIV/05/16/16'>Deuteronomy 16:16</a>; <a href='/AIV/09/04/4'>1 Samuel 4:4</a>",
      "comment": "Elkanah's faithful attendance at worship highlights obedience to the Law (Deut 16:16). The mention of Eli's sons points forward to coming contrasts between genuine and corrupt priesthood."
    },
    {
      "pk": 9001004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 4,
      "text": "Whenever Elkanah offered sacrifice, he gave portions to Peninnah his wife and to all her sons and daughters.",
      "links": "<a href='/AIV/03/07/15'>Leviticus 7:15</a>",
      "comment": "Sharing the sacrificial meal was a family act of worship, showing the communal nature of offerings."
    },
    {
      "pk": 9001005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 5,
      "text": "But to Hannah he gave a double portion, because he loved Hannah, though the Lord had closed her womb.",
      "links": "<a href='/AIV/01/29/31'>Genesis 29:31</a>; <a href='/AIV/09/01/19'>1 Samuel 1:19</a>",
      "comment": "Elkanah's extra care for Hannah recalls God's attention to the downtrodden (Gen 29:31). Barrenness is presented as something God can reverse."
    },
    {
      "pk": 9001006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 6,
      "text": "Her rival provoked her severely to make her miserable, because the Lord had closed her womb.",
      "links": "<a href='/AIV/01/16/4'>Genesis 16:4</a>",
      "comment": "Peninnah's actions parallel those of Hagar toward Sarah (Gen 16:4), showing the pain that can exist even in religious families."
    },
    {
      "pk": 9001007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 7,
      "text": "So it was, year by year, when she went up to the house of the Lord, she provoked her; therefore Hannah wept and would not eat.",
      "links": "<a href='/AIV/09/01/3'>1 Samuel 1:3</a>",
      "comment": "This persistent suffering highlights Hannah's steadfastness and faith. Her turning to God during affliction is a model for endurance."
    },
    {
      "pk": 9001008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 8,
      "text": "Elkanah her husband said to her, 'Hannah, why do you weep? Why do you not eat? Why is your heart sad? Am I not better to you than ten sons?'",
      "links": "<a href='/AIV/08/04/15'>Ruth 4:15</a>",
      "comment": "A husband's consolation falls short of meeting deep spiritual longings. The number ‘ten’ is a figure of completeness."
    },
    {
      "pk": 9001009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 9,
      "text": "After they had eaten and drunk in Shiloh, Hannah arose. Now Eli the priest was sitting on his seat by the doorpost of the temple of the Lord.",
      "links": "<a href='/AIV/09/03/3'>1 Samuel 3:3</a>",
      "comment": "The 'temple' refers to the sanctuary at Shiloh, preceding the Jerusalem temple. Eli’s role frames the forthcoming miracle in a sanctioned place of worship."
    },
    {
      "pk": 9001010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 10,
      "text": "She was deeply distressed and prayed to the Lord, weeping bitterly.",
      "links": "<a href='/AIV/19/06/6'>Psalm 6:6</a>; <a href='/AIV/19/42/3'>Psalm 42:3</a>",
      "comment": "Hannah’s prayer in the sanctuary underscores the importance of personal, heartfelt prayer, even when voiceless."
    },
    {
      "pk": 9001011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 11,
      "text": "She vowed a vow and said, 'O Lord of hosts, if You will indeed look on the affliction of Your servant, and remember me, and not forget Your servant, but will give Your servant a male child, then I will give him to the Lord all the days of his life, and no razor shall touch his head.'",
      "links": "<a href='/AIV/04/06/2-7'>Numbers 6:2-7</a>; <a href='/AIV/09/28/2'>1 Samuel 28:2</a>",
      "comment": "This vow is a Nazarite vow, marking Samuel as set apart for God (Num 6). Her immediate offering reflects an understanding of dedication and consecration, which has enduring meaning for Christian vocations."
    },
    {
      "pk": 9001012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 12,
      "text": "As she continued praying before the Lord, Eli observed her mouth.",
      "links": "<a href='/AIV/09/01/13'>1 Samuel 1:13</a>",
      "comment": "Unseen, silent prayer is presented as powerful, and God hears the heart."
    },
    {
      "pk": 9001013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 13,
      "text": "Hannah was speaking in her heart; only her lips moved, but her voice was not heard. Therefore Eli thought she was drunk.",
      "links": "<a href='/AIV/44/02/13-15'>Acts 2:13-15</a>",
      "comment": "The confusion of prayer with drunkenness appears again at Pentecost (Acts 2), a sign of the spiritual reality behind appearances."
    },
    {
      "pk": 9001014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 14,
      "text": "Eli said to her, 'How long will you be drunk? Put your wine away from you.'",
      "links": "<a href='/AIV/23/28/7'>Isaiah 28:7</a>",
      "comment": "Priests admonish sobriety, yet sometimes misjudge the spiritual state of others."
    },
    {
      "pk": 9001015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 15,
      "text": "But Hannah answered, 'No, my lord. I am a woman troubled in spirit. I have drunk neither wine nor strong drink, but I have been pouring out my soul before the Lord.'",
      "links": "<a href='/AIV/19/142/2'>Psalm 142:2</a>",
      "comment": "Hannah's response reveals that prayer can be an outpouring of one's soul; God values sincerity and humility."
    },
    {
      "pk": 9001016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 16,
      "text": "Do not regard your servant as a worthless woman, for all this time I have been speaking out of my great anxiety and distress.'",
      "links": "<a href='/AIV/19/62/8'>Psalm 62:8</a>",
      "comment": "Hannah’s humility and brokenness is honored by God, demonstrating the value of prayers in suffering."
    },
    {
      "pk": 9001017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 17,
      "text": "Then Eli answered, 'Go in peace, and the God of Israel grant your petition that you have made to Him.'",
      "links": "<a href='/AIV/01/25/21'>Genesis 25:21</a>; <a href='/AIV/09/01/27'>1 Samuel 1:27</a>",
      "comment": "The blessing of the priest mediates God's favor; intercession from God’s appointed leaders is effectual."
    },
    {
      "pk": 9001018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 18,
      "text": "And she said, 'Let your servant find favor in your eyes.' Then the woman went her way and ate, and her face was no longer sad.",
      "links": "<a href='/AIV/42/01/38'>Luke 1:38</a>",
      "comment": "Hannah trusts in God's answer before seeing the outcome, reflecting faith. Her peace anticipates Mary's faith (Luke 1:38)."
    },
    {
      "pk": 9001019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 19,
      "text": "They rose early in the morning and worshipped before the Lord. Then they returned and came to their house at Ramah. Elkanah knew Hannah his wife, and the Lord remembered her.",
      "links": "<a href='/AIV/01/21/1'>Genesis 21:1</a>",
      "comment": "God's remembering results in the fulfillment of His promises. The language echoes Isaac’s birth, suggesting God's ongoing plan for salvation."
    },
    {
      "pk": 9001020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 20,
      "text": "And in due time Hannah conceived and bore a son, and she named him Samuel, for she said, 'I have asked for him from the Lord.'",
      "links": "<a href='/AIV/01/30/22-24'>Genesis 30:22-24</a>",
      "comment": "Samuel means ‘heard by God.’ The naming again reflects answered prayer and divine initiative in raising leaders."
    },
    {
      "pk": 9001021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 21,
      "text": "The man Elkanah and all his house went up to offer to the Lord the yearly sacrifice and to fulfill his vow.",
      "links": "<a href='/AIV/02/23/14-17'>Exodus 23:14-17</a>",
      "comment": "Elkanah participates in regular temple worship and faithful obedience to vows, underscoring the importance of communal worship and commitment."
    },
    {
      "pk": 9001022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 22,
      "text": "But Hannah did not go up, for she said to her husband, 'As soon as the child is weaned, I will bring him, so that he may appear in the presence of the Lord and remain there forever.'",
      "links": "<a href='/AIV/03/27/21'>Leviticus 27:21</a>",
      "comment": "To be dedicated to lifelong service foreshadows a later New Testament dedication of lives for God (cf. Luke 1:80 – John the Baptist)."
    },
    {
      "pk": 9001023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 23,
      "text": "Elkanah her husband said to her, 'Do what seems best to you; wait until you have weaned him. Only, may the Lord establish His word.' So the woman stayed and nursed her son until she had weaned him.",
      "links": "<a href='/AIV/07/13/8'>Judges 13:8</a>",
      "comment": "Elkanah supports the fulfillment of the vow, emphasizing the importance of parental unity and obedience to God's calling."
    },
    {
      "pk": 9001024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 24,
      "text": "When she had weaned him, she took him up with her, along with a three-year-old bull, an ephah of flour, and a skin of wine, and brought him to the house of the Lord at Shiloh. The child was young.",
      "links": "<a href='/AIV/03/01/10-11'>Leviticus 1:10-11</a>",
      "comment": "The offerings represent the completeness of dedication; giving her son and these sacrifices prefigure total self-offering to God."
    },
    {
      "pk": 9001025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 25,
      "text": "They slaughtered the bull and brought the child to Eli.",
      "links": "<a href='/AIV/03/17/5'>Leviticus 17:5</a>",
      "comment": "Offering a sacrifice and presenting the child to the priest highlights the priestly role as a mediator and the importance of sacrificial worship."
    },
    {
      "pk": 9001026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 26,
      "text": "She said, 'Oh, my lord! As you live, my lord, I am the woman who was standing here in your presence, praying to the Lord.'",
      "links": "<a href='/AIV/09/01/10-11'>1 Samuel 1:10-11</a>",
      "comment": "Hannah respectfully identifies herself, recalling her previous prayer. Testifying to answered prayer confirms the reality of God's intervention."
    },
    {
      "pk": 9001027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 27,
      "text": "For this child I prayed, and the Lord has granted me my petition that I made to Him.",
      "links": "<a href='/AIV/40/07/7'>Matthew 7:7</a>",
      "comment": "God’s faithfulness in answering prayer sets a precedent for trust and confidence in intercession (see Matthew 7:7 – 'Ask and you shall receive')."
    },
    {
      "pk": 9001028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 1,
      "verse": 28,
      "text": "Therefore I have lent him to the Lord. As long as he lives, he is lent to the Lord.' And he worshipped the Lord there.",
      "links": "<a href='/AIV/42/02/22'>Luke 2:22</a>; <a href='/AIV/09/02/11'>1 Samuel 2:11</a>",
      "comment": "Like Jesus, who was presented at the temple (Luke 2:22), Samuel's consecration prefigures complete dedication to God’s service. The notion of giving one’s life or one’s children completely to God’s work is the basis for the spiritual commitment seen in the Church."
    }
  ],
  "translatedAt": "2025-12-24T02:46:00.007Z"
}