{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 20,
  "verses": [
    {
      "pk": 9020001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 1,
      "text": "Then David fled from Naioth in Ramah and came to Jonathan. He said, \"What have I done? What is my guilt? What sin have I committed against your father, that he wants to take my life?\"",
      "links": "<a href='/AIV/9/19/18'>1Sam 19:18</a>; <a href='/AIV/19/59/3'>Ps. 59:3</a>",
      "comment": "David appeals to Jonathan, expressing his innocence and confusion at Saul’s hostility. This reflects the motif of the innocent suffering unjustly, prefiguring Christ's innocence before His accusers (see <a href='/AIV/40/27/23'>Matt. 27:23</a>)."
    },
    {
      "pk": 9020002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 2,
      "text": "Jonathan replied, \"Far from it! You will not die. My father does nothing, great or small, without telling me. Why would he hide this from me? It is not so!\"",
      "links": "<a href='/AIV/9/19/6'>1Sam 19:6</a>; <a href='/AIV/9/20/9'>1Sam 20:9</a>",
      "comment": "Jonathan asserts his trust in his relationship with Saul, but the disconnect illustrates how sin can fracture family bonds. The spiritual reading hints at how knowledge of hidden things is not always given to man, pointing to the mystery of God’s providence."
    },
    {
      "pk": 9020003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 3,
      "text": "But David solemnly swore again, saying, \"Your father knows that I have found favor in your eyes, and he has said, ‘Do not let Jonathan know this, lest he be grieved.’ But truly, as the Lord lives and as you live, there is only a step between me and death.\"",
      "links": "<a href='/AIV/9/19/2'>1Sam 19:2</a>; <a href='/AIV/19/116/3'>Ps. 116:3</a>",
      "comment": "David invokes the Lord’s name, heightening the seriousness. The sense of being near death points to the Psalms and to Christ’s Passion, linking the suffering of the righteous with God’s saving plan."
    },
    {
      "pk": 9020004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 4,
      "text": "Jonathan said to David, \"Whatever you ask, I will do for you.\"",
      "links": "<a href='/AIV/9/18/3'>1Sam 18:3</a>; <a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "Jonathan’s willingness shows deep covenant friendship. Such unity and sacrifice reflects Christ’s words on laying down one’s life for friends (<a href='/AIV/43/15/13'>John 15:13</a>)."
    },
    {
      "pk": 9020005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 5,
      "text": "David said to Jonathan, \"Behold, tomorrow is the New Moon, and I should not fail to sit at the king’s table. But let me go and hide in the field until evening.\"",
      "links": "<a href='/AIV/4/10/10'>Num. 10:10</a>; <a href='/AIV/9/20/24'>1Sam 20:24</a>",
      "comment": "The mention of the New Moon hints at sacred times and communal gatherings. David’s absence is a sign of conflict with established authority, paralleling Christ’s withdrawal before His Passion."
    },
    {
      "pk": 9020006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 6,
      "text": "\"If your father misses me at all, say, ‘David earnestly asked leave of me to run to Bethlehem, his city, for there is a yearly sacrifice there for all the family.’\"",
      "links": "<a href='/AIV/9/16/1'>1Sam 16:1</a>; <a href='/AIV/42/2/4'>Luke 2:4</a>",
      "comment": "David chooses a plausible excuse tied to religious duty. The reference to Bethlehem foreshadows the birthplace of Jesus and underlying themes of sacrifice and covenant."
    },
    {
      "pk": 9020007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 7,
      "text": "\"If he says, ‘Good,’ it will be well with your servant; but if he is angry, know that harm is determined by him.\"",
      "links": "<a href='/AIV/9/18/11'>1Sam 18:11</a>; <a href='/AIV/9/19/10'>1Sam 19:10</a>",
      "comment": "David teaches discernment through observation, a principle echoed in the Wisdom literature and Jesus’ call to judge righteously (<a href='/AIV/40/7/16'>Matt. 7:16</a>)."
    },
    {
      "pk": 9020008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 8,
      "text": "\"Therefore, deal kindly with your servant, for you have brought your servant into a covenant of the Lord with you. But if there is guilt in me, kill me yourself! Why should you bring me to your father?\"",
      "links": "<a href='/AIV/9/18/3'>1Sam 18:3</a>; <a href='/AIV/9/20/16'>1Sam 20:16</a>",
      "comment": "The covenant language foreshadows the New Covenant in Christ’s blood. David’s commitment mirrors the depth of self-sacrifice demanded by divine covenants."
    },
    {
      "pk": 9020009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 9,
      "text": "Jonathan replied, \"Far be it from you! If I knew that my father was determined to harm you, would I not tell you?\"",
      "links": "<a href='/AIV/9/20/2'>1Sam 20:2</a>; <a href='/AIV/9/20/13'>1Sam 20:13</a>",
      "comment": "Jonathan’s loyalty establishes a model for virtue, echoing the fidelity expected of followers of Christ and the bond of trust among believers."
    },
    {
      "pk": 9020010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 10,
      "text": "David said to Jonathan, \"Who will tell me if your father answers you harshly?\"",
      "links": "<a href='/AIV/9/20/3'>1Sam 20:3</a>",
      "comment": "David seeks assurance and a trustworthy messenger. The request echoes the need for reliable witnesses, a theme prominent throughout Scripture."
    },
    {
      "pk": 9020011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 11,
      "text": "Jonathan said to David, \"Come, let us go out into the field.\" So they both went out into the field.",
      "links": "<a href='/AIV/9/21/2'>1Sam 21:2</a>",
      "comment": "The field is set apart from the palace, symbolizing intimate and private counsel, reminiscent of Christ withdrawing to pray with His disciples (<a href='/AIV/40/26/36'>Matt. 26:36</a>)."
    },
    {
      "pk": 9020012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 12,
      "text": "Jonathan said to David, \"By the Lord, the God of Israel, I will sound out my father about this time tomorrow. If he is well disposed toward you, will I not then send word to you and disclose it to you?\"",
      "links": "<a href='/AIV/9/20/7'>1Sam 20:7</a>",
      "comment": "Jonathan invokes a divine oath, expressing the seriousness of his commitment. This points to the sacredness of covenants and sworn promises, essential in biblical theology."
    },
    {
      "pk": 9020013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 13,
      "text": "\"But if my father intends to harm you, may the Lord deal with me, be it ever so severely, if I do not disclose it to you and send you away, so that you may go in safety. May the Lord be with you as He was with my father.\"",
      "links": "<a href='/AIV/8/1/17'>Ruth 1:17</a>; <a href='/AIV/9/10/7'>1Sam 10:7</a>",
      "comment": "Jonathan’s vow includes an imprecation upon himself. The phrase \"may the Lord be with you\" echoes divine blessing passed from one chosen leader to another, hinting at apostolic succession by implication."
    },
    {
      "pk": 9020014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 14,
      "text": "\"If I am still alive, show me the steadfast love of the Lord, that I may not die;\"",
      "links": "<a href='/AIV/19/17/7'>Ps. 17:7</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "Jonathan appeals to mercy, invoking God’s hesed (covenant love). Spiritual readers see in this a foreshadowing of Christ’s mercy and the call to keep covenant love alive even in suffering."
    },
    {
      "pk": 9020015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 15,
      "text": "\"and do not ever cut off your steadfast love from my house, not even when the Lord cuts off every one of David’s enemies from the face of the earth.\"",
      "links": "<a href='/AIV/10/9/1'>2Sam 9:1</a>; <a href='/AIV/19/89/28-29'>Ps. 89:28-29</a>",
      "comment": "Jonathan seeks for his descendants to benefit from David’s kindness, anticipating the fulfillment and protection of the king’s eternal dynasty, a type of the everlasting kingdom established in Christ."
    },
    {
      "pk": 9020016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 16,
      "text": "So Jonathan made a covenant with the house of David, saying, \"May the Lord call David’s enemies to account.\"",
      "links": "<a href='/AIV/9/18/3'>1Sam 18:3</a>; <a href='/AIV/19/25/22'>Ps. 25:22</a>",
      "comment": "The covenant transcends personal friendship, becoming lasting and generational. This foreshadows the new and everlasting covenant in Christ, made with His people and their families."
    },
    {
      "pk": 9020017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 17,
      "text": "And Jonathan made David swear again because of his love for him, for he loved him as he loved his own soul.",
      "links": "<a href='/AIV/9/18/1'>1Sam 18:1</a>; <a href='/AIV/41/12/31'>Mark 12:31</a>",
      "comment": "The deep love indicated here models Christ’s teaching to love others as oneself. Friendship rooted in self-giving points to the ultimate love shown by Christ on the Cross."
    },
    {
      "pk": 9020018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 18,
      "text": "Then Jonathan said to him, \"Tomorrow is the New Moon, and you will be missed because your seat will be empty.\"",
      "links": "<a href='/AIV/9/20/5'>1Sam 20:5</a>; <a href='/AIV/9/20/25'>1Sam 20:25</a>",
      "comment": "Absence at the sacred meal signals estrangement. In liturgical practice, absence from communal worship is noteworthy—hinting at the importance of gathering for worship."
    },
    {
      "pk": 9020019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 19,
      "text": "\"On the third day, go down quickly to the place where you hid yourself when this trouble began, and wait by the stone mound.\"",
      "links": "<a href='/AIV/9/19/2'>1Sam 19:2</a>; <a href='/AIV/19/71/3'>Ps. 71:3</a>",
      "comment": "The ‘third day’ language always has christological echo, pointing to resurrection themes throughout Scripture (<a href='/AIV/42/24/7'>Luke 24:7</a>)."
    },
    {
      "pk": 9020020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 20,
      "text": "\"I will shoot three arrows to the side, as if I were shooting at a target.\"",
      "links": "<a href='/AIV/9/20/36'>1Sam 20:36</a>",
      "comment": "Jonathan pre-arranges a secret system to communicate. Three arrows may subtly suggest a typological foreshadowing of the Trinity, in accordance with spiritual readings."
    },
    {
      "pk": 9020021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 21,
      "text": "\"Then I will send the boy, saying, ‘Go, find the arrows.’ If I say to the boy, ‘Look, the arrows are on this side of you, bring them here,’ then you can come, for as the Lord lives, it is safe and there is no danger.\"",
      "links": "<a href='/AIV/9/20/36'>1Sam 20:36</a>",
      "comment": "Jonathan uses coded communication to protect David. The care taken for the message's delivery models prudent discernment, key in Christian moral teaching."
    },
    {
      "pk": 9020022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 22,
      "text": "\"But if I say to the youth, ‘Look, the arrows are beyond you,’ then go, for the Lord has sent you away.\"",
      "links": "<a href='/AIV/9/20/37'>1Sam 20:37</a>",
      "comment": "God’s providence is affirmed: if David must go, it is because the Lord wills. The spiritual interpretation sees in this the call to be attentive to God’s will above human plans."
    },
    {
      "pk": 9020023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 23,
      "text": "\"And about the matter you and I have discussed, remember, the Lord is witness between you and me forever.\"",
      "links": "<a href='/AIV/1/31/50'>Gen. 31:50</a>; <a href='/AIV/19/89/3'>Ps. 89:3</a>",
      "comment": "Invoking the Lord as witness of a covenant bonds it eternally. Such calling on God reflects the seriousness of sacramental promises and the Church’s understanding of binding oaths."
    },
    {
      "pk": 9020024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 24,
      "text": "So David hid in the field; and when the New Moon came, the king sat down to eat the meal.",
      "links": "<a href='/AIV/9/20/5'>1Sam 20:5</a>; <a href='/AIV/9/20/18'>1Sam 20:18</a>",
      "comment": "David’s absence from the king’s table can be read as symbolic exclusion from the holy feast, underscoring but prefiguring exclusion and restoration found in salvation history."
    },
    {
      "pk": 9020025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 25,
      "text": "He sat in his customary place by the wall; Jonathan sat opposite him, and Abner sat beside Saul, but David’s place was empty.",
      "links": "<a href='/AIV/9/20/18'>1Sam 20:18</a>; <a href='/AIV/9/20/27'>1Sam 20:27</a>",
      "comment": "David’s absence at this important meal causes tension. The empty seat parallels later themes when Judas leaves the Last Supper (<a href='/AIV/43/13/30'>John 13:30</a>)."
    },
    {
      "pk": 9020026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 26,
      "text": "Saul did not say anything that day, for he thought, \"Something has happened to him. He is not ceremonially clean; surely he is not clean.\"",
      "links": "<a href='/AIV/3/7/20-21'>Lev. 7:20-21</a>; <a href='/AIV/9/16/5'>1Sam 16:5</a>",
      "comment": "Concerns for ritual purity underline the seriousness of communal worship, the importance of which is echoed throughout Scripture (<a href='/AIV/58/10/22'>Heb. 10:22</a>)."
    },
    {
      "pk": 9020027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 27,
      "text": "But the next day, the second day of the month, David’s place was still empty. Saul said to Jonathan, \"Why has the son of Jesse not come to the meal, either yesterday or today?\"",
      "links": "<a href='/AIV/9/20/18'>1Sam 20:18</a>",
      "comment": "Saul refers to David as the son of Jesse, emphasizing David’s outsider status and foreshadowing the root of Jesse prophecy (<a href='/AIV/23/11/1'>Isa. 11:1</a>)."
    },
    {
      "pk": 9020028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 28,
      "text": "Jonathan answered, \"David earnestly asked leave of me to go to Bethlehem.\"",
      "links": "<a href='/AIV/9/20/6'>1Sam 20:6</a>",
      "comment": "Jonathan faithfully presents the arrangement, further reinforcing the trust and integrity between true friends."
    },
    {
      "pk": 9020029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 29,
      "text": "\"He said, ‘Please let me go, because our family has a sacrifice in the city, and my brother has commanded me to be there. So now, if I have found favor in your eyes, let me get away to see my brothers.’ That is why he has not come to the king’s table.\"",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>; <a href='/AIV/42/2/4'>Luke 2:4</a>",
      "comment": "Return to Bethlehem for a sacrifice continues to reinforce messianic associations. The focus on favor and family points to unity at the heart of God’s plan."
    },
    {
      "pk": 9020030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 30,
      "text": "Then Saul’s anger was kindled against Jonathan, and he said, \"You son of a perverse and rebellious woman! Do I not know that you have chosen the son of Jesse to your own shame and to the shame of your mother’s nakedness?\"",
      "links": "<a href='/AIV/9/20/34'>1Sam 20:34</a>; <a href='/AIV/9/22/8'>1Sam 22:8</a>",
      "comment": "Saul’s harsh rebuke is a tragic effect of jealousy and spiritual blindness, similar to the opposition Christ encounters from earthly authorities."
    },
    {
      "pk": 9020031,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 31,
      "text": "\"For as long as the son of Jesse lives on the earth, neither you nor your kingdom will be established. Now, send and bring him to me, for he must die.\"",
      "links": "<a href='/AIV/9/15/28'>1Sam 15:28</a>; <a href='/AIV/9/24/20'>1Sam 24:20</a>",
      "comment": "Saul’s concern for inheritance and kingship underscores the tension between earthly rule and God’s chosen. The theme is fulfilled in Christ, whose kingdom is not of this world (<a href='/AIV/43/18/36'>John 18:36</a>)."
    },
    {
      "pk": 9020032,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 32,
      "text": "Jonathan answered his father Saul, \"Why should he be put to death? What has he done?\"",
      "links": "<a href='/AIV/9/20/1'>1Sam 20:1</a>; <a href='/AIV/40/27/23'>Matt. 27:23</a>",
      "comment": "Jonathan pleads innocence, paralleling Pilate’s questioning at Christ’s trial. Again, the theme of the righteous suffering unjustly."
    },
    {
      "pk": 9020033,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 33,
      "text": "But Saul hurled his spear at him to kill him. So Jonathan knew that his father was determined to kill David.",
      "links": "<a href='/AIV/9/18/11'>1Sam 18:11</a>; <a href='/AIV/9/19/10'>1Sam 19:10</a>",
      "comment": "Saul turns his anger violently toward Jonathan himself. The rejection of genuine love and virtue leads to spiritual self-destruction."
    },
    {
      "pk": 9020034,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 34,
      "text": "Jonathan rose from the table in fierce anger and did not eat food on the second day of the month, for he was grieved for David because his father had disgraced him.",
      "links": "<a href='/AIV/9/20/27'>1Sam 20:27</a>",
      "comment": "Jonathan’s mourning and fasting reflect biblical themes of grief and solidarity in suffering, later fulfilled in Christ’s agony and the disciples’ mourning during His Passion."
    },
    {
      "pk": 9020035,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 35,
      "text": "In the morning, Jonathan went out into the field at the time appointed with David, and a little boy was with him.",
      "links": "<a href='/AIV/9/20/19'>1Sam 20:19</a>",
      "comment": "Jonathan keeps his word, emphasizing the virtue of fidelity even amid hardship—an echo of Christ’s faithfulness."
    },
    {
      "pk": 9020036,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 36,
      "text": "He said to his boy, \"Run and find the arrows that I shoot.\" As the boy ran, he shot an arrow beyond him.",
      "links": "<a href='/AIV/9/20/20'>1Sam 20:20</a>; <a href='/AIV/9/20/22'>1Sam 20:22</a>",
      "comment": "Jonathan’s sign signals to David in secret. The scene bears typological resemblance to spiritual discernment and the reception of divine messages."
    },
    {
      "pk": 9020037,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 37,
      "text": "When the boy reached the place where Jonathan’s arrow had fallen, Jonathan called out after him, \"Is not the arrow beyond you?\"",
      "links": "<a href='/AIV/9/20/22'>1Sam 20:22</a>",
      "comment": "Jonathan’s coded message fulfills the agreed plan, showing careful adherence to commitments with solemnity and care."
    },
    {
      "pk": 9020038,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 38,
      "text": "Jonathan called out, \"Hurry! Go quickly! Do not stop!\" The boy picked up Jonathan’s arrow and brought it to his master.",
      "links": "<a href='/AIV/9/20/22'>1Sam 20:22</a>",
      "comment": "Urgency of the instructions may point to the necessity of swift obedience to heavenly guidance."
    },
    {
      "pk": 9020039,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 39,
      "text": "But the boy knew nothing; only Jonathan and David knew the signal.",
      "links": "<a href='/AIV/9/20/22'>1Sam 20:22</a>",
      "comment": "Secrecy is maintained; the mystery known only to the initiates suggests the idea of sacred truths entrusted to the faithful and the need for initiation."
    },
    {
      "pk": 9020040,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 40,
      "text": "Jonathan gave his weapons to the boy and said, \"Go, carry them to the city.\"",
      "links": "<a href='/AIV/9/20/35'>1Sam 20:35</a>",
      "comment": "Jonathan’s action concludes the communication, and the weapon’s transfer symbolizes the end of the secret audience. Spiritual interpretations see the passing on of duties within sacred tradition."
    },
    {
      "pk": 9020041,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 41,
      "text": "After the boy had gone, David rose from the south side, fell on his face to the ground, and bowed three times. They kissed each other and wept together, but David wept the more.",
      "links": "<a href='/AIV/10/1/12'>2Sam 1:12</a>; <a href='/AIV/9/18/1'>1Sam 18:1</a>",
      "comment": "David bows three times, a sign of deep respect and submission. The mutual weeping shows genuine love and grief, a vivid model for Christian friendship and holy sorrow."
    },
    {
      "pk": 9020042,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 20,
      "verse": 42,
      "text": "Then Jonathan said to David, \"Go in peace, because we have sworn both of us in the name of the Lord, saying, ‘The Lord shall be between me and you, and between my descendants and your descendants, forever.’\" So David rose and departed, and Jonathan went into the city.",
      "links": "<a href='/AIV/9/20/23'>1Sam 20:23</a>; <a href='/AIV/19/89/3'>Ps. 89:3</a>",
      "comment": "Their oath invokes the Lord’s perpetual witness over generations, quietly pointing to the unbroken faith that marks God’s people and how the continuity of such covenants prefigures the lasting unity of the Church."
    }
  ],
  "translatedAt": "2025-12-24T03:00:50.114Z"
}