{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 6,
  "verses": [
    {
      "pk": 9006001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 1,
      "text": "The ark of the Lord remained in the land of the Philistines for seven months.",
      "links": "<a href='/AIV/9/5/1'>1Sam 5:1</a>; <a href='/AIV/24/25/11'>Jer. 25:11</a>",
      "comment": "The number seven often signifies completeness in Scripture. The continued presence of the Ark among the Philistines emphasizes God's sovereign control over all nations."
    },
    {
      "pk": 9006002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 2,
      "text": "And the Philistines called for the priests and the diviners, saying, 'What should we do with the ark of the Lord? Tell us how we should send it back to its place.'",
      "links": "<a href='/AIV/2/7/11'>Exod. 7:11</a>; <a href='/AIV/21/10/15'>Eccl. 10:15</a>",
      "comment": "The Philistines sought spiritual advice, showing their belief in supernatural power and ritual. Notice the need for authoritative guidance in matters of worship."
    },
    {
      "pk": 9006003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 3,
      "text": "They responded, 'If you send away the ark of the God of Israel, do not send it empty. You must certainly return with it a guilt offering. Then you will be healed, and you shall know why His hand has not been removed from you.'",
      "links": "<a href='/AIV/3/5/14'>Lev. 5:14-19</a>; <a href='/AIV/9/5/6'>1Sam 5:6</a>",
      "comment": "The mention of a ‘guilt offering’ underscores the importance of atonement and restitution, anticipating the ultimate sacrifice Christ would offer (see <a href='/AIV/58/9/26'>Heb. 9:26</a>)."
    },
    {
      "pk": 9006004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 4,
      "text": "And they asked, 'What is the guilt offering that we should return to Him?' They answered, 'Five golden tumors and five golden mice, according to the number of the rulers of the Philistines. For the same plague was on all of you and on your rulers.'",
      "links": "<a href='/AIV/9/5/6'>1Sam 5:6</a>",
      "comment": "The gifts correspond to both the affliction and the cities struck. Physical objects are used to represent spiritual realities, pointing toward the use of material elements in sacred acts."
    },
    {
      "pk": 9006005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 5,
      "text": "So make images of your tumors and images of your mice that ravage the land, and give glory to the God of Israel. Perhaps He will lighten His hand from you, your gods, and your land.",
      "links": "<a href='/AIV/2/8/19'>Exod. 8:19</a>",
      "comment": "‘Give glory to the God of Israel’—even enemies must recognize God’s supremacy. The use of images here contrasts with the prohibition of idolatry for Israelites, showing a developing understanding of right worship."
    },
    {
      "pk": 9006006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 6,
      "text": "Why should you harden your hearts as the Egyptians and Pharaoh hardened their hearts? When He dealt harshly with them, did they not let the Israelites go, and they departed?",
      "links": "<a href='/AIV/2/7/13'>Exod. 7:13</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "Comparing their own situation to Egypt’s plagues urges humility before God. The lesson is the necessity of obedience and repentance."
    },
    {
      "pk": 9006007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 7,
      "text": "Now then, make a new cart and take two milk cows on which there has never been a yoke. Harness the cows to the cart, but take their calves home, away from them.",
      "links": "<a href='/AIV/4/19/2'>Num. 19:2</a>; <a href='/AIV/10/6/3'>2 Sam. 6:3</a>",
      "comment": "The command to use unyoked animals set apart for a sacred purpose reflects rituals of purity and dedication, paralleling later liturgical customs."
    },
    {
      "pk": 9006008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 8,
      "text": "Take the ark of the Lord and put it on the cart. Place the golden objects that you are returning to Him as a guilt offering in a box beside it. Then send it off, and let it go on its way.",
      "links": "<a href='/AIV/9/6/4'>1Sam 6:4</a>",
      "comment": "Symbols of restitution are sent alongside the Ark, emphasizing the need for visible acts accompanying repentance—a theme echoed in sacramental acts."
    },
    {
      "pk": 9006009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 9,
      "text": "'And watch: if it goes up the road to its own land, to Beth-shemesh, then He has done us this great evil. But if not, then we shall know that it was not His hand that struck us; it happened to us by chance.'",
      "links": "<a href='/AIV/9/5/10'>1Sam 5:10</a>",
      "comment": "This test reveals the belief in divine providence. God’s actions are not random or accidental, but purposeful, as in the New Testament’s teachings on divine direction (<a href='/AIV/40/10/29-31'>Matt. 10:29-31</a>)."
    },
    {
      "pk": 9006010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 10,
      "text": "The men did so, and took two milk cows, harnessed them to the cart, and shut up their calves at home.",
      "links": "<a href='/AIV/9/6/7'>1Sam 6:7</a>",
      "comment": "The obedience of the Philistines underscores the importance of following instructions in religious observance."
    },
    {
      "pk": 9006011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 11,
      "text": "They put the ark of the Lord on the cart, along with the box containing the golden mice and images of their tumors.",
      "links": "<a href='/AIV/9/6/8'>1Sam 6:8</a>",
      "comment": "The offerings were intended as reparation for their trespass, a principle echoed in the call for penance and confession."
    },
    {
      "pk": 9006012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 12,
      "text": "And the cows headed straight for the road to Beth-shemesh. They went along the highway, lowing as they went, and did not turn to the right or the left. The rulers of the Philistines followed them as far as the border of Beth-shemesh.",
      "links": "<a href='/AIV/9/6/9'>1Sam 6:9</a>",
      "comment": "The supernatural guidance of the cows indicates divine intervention, revealing God’s direct involvement in sacred matters and foreshadowing miraculous signs in later biblical history."
    },
    {
      "pk": 9006013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 13,
      "text": "Now the people of Beth-shemesh were reaping their wheat harvest in the valley. When they looked up and saw the ark, they rejoiced at the sight.",
      "links": "<a href='/AIV/9/6/15'>1Sam 6:15</a>",
      "comment": "The return of the Ark brought joy—a theme later connected to God’s presence bringing rejoicing among the people (see <a href='/AIV/19/16/11'>Ps. 16:11</a>)."
    },
    {
      "pk": 9006014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 14,
      "text": "The cart came into the field of Joshua of Beth-shemesh and stopped there. A large stone was there. They split the wood of the cart and offered the cows as a burnt offering to the Lord.",
      "links": "<a href='/AIV/7/13/19'>Judg. 13:19</a>; <a href='/AIV/1/22/9'>Gen. 22:9</a>",
      "comment": "They offered spontaneous sacrifice—highlighting the natural response to God’s saving acts. The burnt offering is a complete surrender and a shadow of complete sacrifice (<a href='/AIV/45/12/1'>Rom. 12:1</a>)."
    },
    {
      "pk": 9006015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 15,
      "text": "The Levites took down the ark of the Lord and the box that was beside it, containing the golden objects, and placed them on the large stone. The men of Beth-shemesh offered burnt offerings and made sacrifices to the Lord on that day.",
      "links": "<a href='/AIV/4/4/15'>Num. 4:15</a>",
      "comment": "Only the Levites handled the Ark, reflecting the necessity of proper authority in leading worship. This mirrors the importance of ministerial order in the worshiping community."
    },
    {
      "pk": 9006016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 16,
      "text": "When the five rulers of the Philistines saw this, they returned that same day to Ekron.",
      "links": "<a href='/AIV/9/5/10'>1Sam 5:10</a>",
      "comment": "The Philistine rulers witnessed the power of Israel’s God and departed. Their involvement underscores the regional significance of Israel’s faith."
    },
    {
      "pk": 9006017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 17,
      "text": "These are the golden tumors that the Philistines returned as a guilt offering to the Lord: one for Ashdod, one for Gaza, one for Ashkelon, one for Gath, and one for Ekron.",
      "links": "<a href='/AIV/9/6/4'>1Sam 6:4</a>",
      "comment": "Each Philistine city is represented, showing the complete submission to God required from all sides, and how unity is necessary before God."
    },
    {
      "pk": 9006018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 18,
      "text": "And the golden mice, according to the number of all the cities of the Philistines under the rule of the five rulers, both fortified cities and country villages, even to the great stone on which they set the ark of the Lord. This stone remains to this day in the field of Joshua of Beth-shemesh.",
      "links": "<a href='/AIV/9/6/14'>1Sam 6:14</a>",
      "comment": "The memorial stone marks God’s faithfulness and power. Sacred memorials continue to have significant roles as reminders of God’s mighty works."
    },
    {
      "pk": 9006019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 19,
      "text": "But God struck some of the men of Beth-shemesh, because they looked into the ark of the Lord. He struck down seventy men; the people mourned because the Lord had struck the people with a great blow.",
      "links": "<a href='/AIV/4/4/15'>Num. 4:15</a>; <a href='/AIV/10/6/7'>2 Sam. 6:7</a>",
      "comment": "Unauthorized contact with the Ark results in judgment. God’s holiness requires reverence and respect for sacred things—a principle maintained in later ritual practice."
    },
    {
      "pk": 9006020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 20,
      "text": "The men of Beth-shemesh said, 'Who is able to stand before the Lord, this holy God? And to whom shall He go up from us?'",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>; <a href='/AIV/2/19/21'>Exod. 19:21</a>",
      "comment": "This question highlights human unworthiness before God’s holiness and the need for a mediating priesthood—a theme fulfilled in Christ the mediator (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 9006021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 6,
      "verse": 21,
      "text": "So they sent messengers to the inhabitants of Kiriath-jearim, saying, 'The Philistines have returned the ark of the Lord; come down and take it up to you.'",
      "links": "<a href='/AIV/9/7/1'>1Sam 7:1</a>",
      "comment": "The arc is received among a prepared people. This echoes the importance of readiness and proper preparation when hosting the presence of the Lord—a principle embodied in reverent worship and discipline."
    }
  ],
  "translatedAt": "2025-12-24T02:51:40.876Z"
}