{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 11,
  "verses": [
    {
      "pk": 1101101,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 1,
      "text": "Now Nahash the Ammonite came up and encamped against Jabesh-gilead. All the men of Jabesh said to Nahash, 'Make a treaty with us, and we will serve you.'",
      "links": "<a href='/ESV/7/21/8-14'>Judg. 21:8-14</a>; <a href='/ESV/24/40/14'>Jer. 40:14</a>",
      "comment": "In Hebrew, 'cut a covenant with us' is a literal phrase meaning to make a treaty."
    },
    {
      "pk": 1101102,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 2,
      "text": "But Nahash the Ammonite said to them, 'On this condition I will make a treaty with you, that I gouge out everyone’s right eye, and bring disgrace on all Israel.'",
      "links": "<a href='/ESV/7/16/21'>Judg. 16:21</a>; <a href='/ESV/19/44/13'>Ps. 44:13</a>",
      "comment": "Gouging out the right eye was meant to shame and weaken Israel militarily."
    },
    {
      "pk": 1101103,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 3,
      "text": "The elders of Jabesh said to him, 'Give us seven days' respite, so that we may send messengers throughout all the territory of Israel. Then, if there is no one to save us, we will give ourselves up to you.'",
      "links": "<a href='/ESV/7/21/8'>Judg. 21:8</a>",
      "comment": "The term 'give ourselves up' is literal; it means surrender."
    },
    {
      "pk": 1101104,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 4,
      "text": "So the messengers came to Gibeah of Saul and spoke these words in the ears of the people, and all the people lifted up their voices and wept.",
      "links": "<a href='/ESV/9/10/26'>1 Sam. 10:26</a>; <a href='/ESV/15/9/4'>Ezra 9:4</a>",
      "comment": "Gibeah was Saul's hometown. 'Lifted up their voices' is a Hebrew idiom."
    },
    {
      "pk": 1101105,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 5,
      "text": "Now, behold, Saul was coming from the field behind the oxen, and Saul said, 'What is wrong with the people, that they are weeping?' So they told him the words of the men of Jabesh.",
      "links": "<a href='/ESV/9/10/26'>1 Sam. 10:26</a>",
      "comment": "Saul is depicted as a working man, showing his humble background."
    },
    {
      "pk": 1101106,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 6,
      "text": "And the Spirit of God rushed upon Saul when he heard these words, and his anger was greatly kindled.",
      "links": "<a href='/ESV/7/3/10'>Judg. 3:10</a>; <a href='/ESV/9/10/6'>1 Sam. 10:6</a>",
      "comment": "'The Spirit of God rushed upon' is a common phrase indicating empowerment for God's work."
    },
    {
      "pk": 1101107,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 7,
      "text": "He took a yoke of oxen, cut them in pieces, and sent them throughout all the territory of Israel by the hand of the messengers, saying, 'Whoever does not come out after Saul and after Samuel, so shall it be done to his oxen!' Then the fear of the LORD fell upon the people, and they came out as one man.",
      "links": "<a href='/ESV/7/19/29'>Judg. 19:29</a>; <a href='/ESV/9/12/17'>1 Sam. 12:17</a>",
      "comment": "'Came out as one man' means united, all together."
    },
    {
      "pk": 1101108,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 8,
      "text": "When he mustered them at Bezek, the people of Israel were three hundred thousand, and the men of Judah thirty thousand.",
      "links": "<a href='/ESV/9/15/4'>1 Sam. 15:4</a>",
      "comment": "Reflects later tribal distinction between Israel and Judah."
    },
    {
      "pk": 1101109,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 9,
      "text": "They said to the messengers who had come, 'Say this to the men of Jabesh-gilead: “Tomorrow, by the time the sun is hot, you will have deliverance.”' So the messengers came and told the men of Jabesh, and they were glad.",
      "links": "<a href='/ESV/9/11/3'>1 Sam. 11:3</a>",
      "comment": "'By the time the sun is hot' means late morning or midday."
    },
    {
      "pk": 1101110,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 10,
      "text": "Therefore the men of Jabesh said, 'Tomorrow we will give ourselves up to you, and you may do to us whatever seems good to you.'",
      "links": "<a href='/ESV/9/11/3'>1 Sam. 11:3</a>",
      "comment": "Repeats the surrender offer; the people conceal the plan to attack."
    },
    {
      "pk": 1101111,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 11,
      "text": "The next day Saul put the people in three companies. They came into the midst of the camp in the morning watch and struck down the Ammonites until the heat of the day. Those who survived were scattered, so that no two of them were left together.",
      "links": "<a href='/ESV/7/7/16'>Judg. 7:16</a>; <a href='/ESV/9/13/17'>1 Sam. 13:17</a>",
      "comment": "'Morning watch' is the time just before sunrise."
    },
    {
      "pk": 1101112,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 12,
      "text": "Then the people said to Samuel, 'Who is it that said, “Shall Saul reign over us?” Bring those men, so that we may put them to death.'",
      "links": "<a href='/ESV/9/10/27'>1 Sam. 10:27</a>",
      "comment": "References the previous doubters of Saul's kingship."
    },
    {
      "pk": 1101113,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 13,
      "text": "But Saul said, 'No man shall be put to death this day, for today the LORD has worked salvation in Israel.'",
      "links": "<a href='/ESV/9/14/45'>1 Sam. 14:45</a>",
      "comment": "'Salvation' here means deliverance."
    },
    {
      "pk": 1101114,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 14,
      "text": "Then Samuel said to the people, 'Come, let us go to Gilgal and there renew the kingdom.'",
      "links": "<a href='/ESV/9/10/8'>1 Sam. 10:8</a>",
      "comment": "Renewal of Saul's kingship with all the people."
    },
    {
      "pk": 1101115,
      "translation": "AIV",
      "book": 9,
      "chapter": 11,
      "verse": 15,
      "text": "So all the people went to Gilgal, and there they made Saul king before the LORD in Gilgal. There they offered peace offerings before the LORD, and Saul and all the men of Israel rejoiced greatly.",
      "links": "<a href='/ESV/9/10/24'>1 Sam. 10:24</a>; <a href='/ESV/3/3/1'>Lev. 3:1</a>",
      "comment": "'Peace offerings' are fellowship offerings, a key part of Israelite worship."
    }
  ],
  "translatedAt": "2025-12-22T08:29:32.593Z"
}