{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 15,
  "verses": [
    {
      "pk": 9015001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 1,
      "text": "Samuel said to Saul, 'The LORD sent me to anoint you king over His people Israel; now listen to the words of the LORD.'",
      "links": "<a href='/AIV/9/10/1'>1Sam 10:1</a>; <a href='/AIV/9/12/14'>1Sam 12:14</a>",
      "comment": "The authority of the king comes through God's prophet, showing the importance of divinely ordained leadership. This sets the stage for later understandings of apostolic succession and spiritual authority."
    },
    {
      "pk": 9015002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 2,
      "text": "This is what the LORD Almighty says: 'I will punish Amalek for what they did to Israel when they opposed them on the way as they came up from Egypt.'",
      "links": "<a href='/AIV/2/17/8-16'>Exod 17:8-16</a>; <a href='/AIV/5/25/17-19'>Deut 25:17-19</a>",
      "comment": "The LORD's justice against Amalek recalls the persistent opposition faced by God's people. This foreshadows the final defeat of evil, linking to eschatological themes."
    },
    {
      "pk": 9015003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 3,
      "text": "Now go, attack Amalek, and devote all that they have to destruction. Do not spare them, but kill man and woman, child and infant, ox and sheep, camel and donkey.'",
      "links": "<a href='/AIV/6/6/21'>Josh 6:21</a>; <a href='/AIV/9/28/18'>1Sam 28:18</a>",
      "comment": "God commands utter destruction as a judgment, reflecting the seriousness of sin and divine holiness. This anticipates total purity required in God's community, also seen in New Testament calls to radical conversion."
    },
    {
      "pk": 9015004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 4,
      "text": "So Saul summoned the people and counted them at Telaim: two hundred thousand foot soldiers and ten thousand men of Judah.",
      "links": "<a href='/AIV/9/13/15'>1Sam 13:15</a>",
      "comment": "Saul's leadership is confirmed by numbers, but numbers alone do not guarantee spiritual obedience."
    },
    {
      "pk": 9015005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 5,
      "text": "Saul came to the city of Amalek and lay in wait in the valley.",
      "links": "<a href='/AIV/9/27/8'>1Sam 27:8</a>",
      "comment": "Saul prepares to ambush Amalek, closely following prophetic instructions, but the coming events will highlight his partial obedience."
    },
    {
      "pk": 9015006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 6,
      "text": "Then Saul said to the Kenites, 'Go, leave from among the Amalekites, so that I do not destroy you with them. You showed kindness to all the Israelites when they came up from Egypt.' So the Kenites separated themselves from Amalek.",
      "links": "<a href='/AIV/2/18/9-12'>Exod 18:9-12</a>",
      "comment": "Mercy to the Kenites highlights God's justice and remembrance of good deeds, reflecting divine reward for fidelity—an important biblical theme."
    },
    {
      "pk": 9015007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 7,
      "text": "Saul attacked the Amalekites from Havilah all the way to Shur, which is east of Egypt.",
      "links": "<a href='/AIV/1/25/18'>Gen 25:18</a>; <a href='/AIV/2/15/22'>Exod 15:22</a>",
      "comment": "The scope of Saul's campaign fulfills the LORD's command geo-politically, but obedience will soon be found lacking."
    },
    {
      "pk": 9015008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 8,
      "text": "He took Agag king of the Amalekites alive, and devoted all the people to destruction with the edge of the sword.",
      "links": "<a href='/AIV/9/15/32'>1Sam 15:32</a>",
      "comment": "Saul spared Agag against God's command, revealing incomplete obedience. This event becomes a symbol of compromise in spiritual leadership."
    },
    {
      "pk": 9015009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 9,
      "text": "But Saul and the people spared Agag and the best of the sheep, oxen, fattened lambs, and all that was good, and were unwilling to utterly destroy them. Everything despised and worthless, they destroyed completely.",
      "links": "<a href='/AIV/9/15/15'>1Sam 15:15</a>; <a href='/AIV/9/15/21'>1Sam 15:21</a>",
      "comment": "Selective obedience shows the temptation to follow God's will partially. This underlines the need for full submission to divine command—a theme central to discipleship."
    },
    {
      "pk": 9015010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 10,
      "text": "Then the word of the LORD came to Samuel:",
      "links": "<a href='/AIV/9/13/13'>1Sam 13:13</a>; <a href='/AIV/9/3/11'>1Sam 3:11</a>",
      "comment": "God’s direct communication with the prophet serves as a model for divine revelation through spiritual leaders."
    },
    {
      "pk": 9015011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 11,
      "text": "'I regret that I have made Saul king, for he has turned back from following Me and has not carried out My commands.' Samuel was angry, and he cried out to the LORD all night.",
      "links": "<a href='/AIV/9/13/14'>1Sam 13:14</a>; <a href='/AIV/9/16/1'>1Sam 16:1</a>",
      "comment": "God's regret is not changeable emotion, but a way of expressing the seriousness of disobedience. Samuel's intercession emphasizes the power of prayer for leaders and the necessity of persevering in prayer."
    },
    {
      "pk": 9015012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 12,
      "text": "Early in the morning Samuel got up and went to meet Saul. But Samuel was told, 'Saul went to Carmel, and indeed, he set up a monument for himself, and has turned and gone on to Gilgal.'",
      "links": "<a href='/AIV/9/7/16'>1Sam 7:16</a>; <a href='/AIV/9/11/14'>1Sam 11:14</a>",
      "comment": "Saul’s self-promotion contrasts with humility required of leaders. Building monuments for oneself reflects pride, which opposes God’s favor."
    },
    {
      "pk": 9015013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 13,
      "text": "When Samuel reached him, Saul said to him, 'Blessed are you by the LORD! I have carried out the command of the LORD.'",
      "links": "<a href='/AIV/9/9/25'>1Sam 9:25</a>; <a href='/AIV/9/15/20'>1Sam 15:20</a>",
      "comment": "Saul's greeting implies obedience, but his actions will soon be exposed. This illustrates how external piety is not sufficient without inner conformity to God’s will."
    },
    {
      "pk": 9015014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 14,
      "text": "Samuel said, 'Then what is this bleating of sheep in my ears, and the lowing of oxen that I hear?'",
      "links": "<a href='/AIV/9/15/9'>1Sam 15:9</a>",
      "comment": "Visible evidence of disobedience cannot be hidden. Spiritual discernment exposes the reality beneath outward claims."
    },
    {
      "pk": 9015015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 15,
      "text": "Saul answered, 'They brought them from the Amalekites, for the people spared the best of the sheep and oxen to sacrifice to the LORD your God; but we destroyed the rest.'",
      "links": "<a href='/AIV/9/15/9'>1Sam 15:9</a>; <a href='/AIV/9/13/9'>1Sam 13:9</a>",
      "comment": "Saul attempts to justify disobedience by religious motives, showing that ritual alone is not pleasing without heartfelt obedience."
    },
    {
      "pk": 9015016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 16,
      "text": "Then Samuel said to Saul, 'Stop! Let me tell you what the LORD said to me last night.' Saul replied, 'Speak.'",
      "links": "<a href='/AIV/9/15/10'>1Sam 15:10</a>",
      "comment": "The prophet interrupts, asserting the primacy of the Word of God over human rationalization—a foreshadow of the importance of prophecy and authoritative teaching."
    },
    {
      "pk": 9015017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 17,
      "text": "Samuel said, 'Even though you were small in your own eyes, were you not made the head of the tribes of Israel? The LORD anointed you as king over Israel.'",
      "links": "<a href='/AIV/9/9/21'>1Sam 9:21</a>; <a href='/AIV/9/10/1'>1Sam 10:1</a>",
      "comment": "God exalts the humble to positions of authority. Saul's rise is due to divine election, not human merit, echoing themes of grace and calling."
    },
    {
      "pk": 9015018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 18,
      "text": "And the LORD sent you on a mission and said, ‘Go, devote the Amalekites to destruction and fight against them until they are consumed.’",
      "links": "<a href='/AIV/9/15/3'>1Sam 15:3</a>",
      "comment": "God’s commission demands total obedience; partial fulfillment falls short of God’s will."
    },
    {
      "pk": 9015019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 19,
      "text": "Why then did you not obey the voice of the LORD? Why did you swoop down on the plunder and do what was evil in the eyes of the LORD?'",
      "links": "<a href='/AIV/9/15/9'>1Sam 15:9</a>",
      "comment": "Failure to obey God fully is considered evil, even when masked by apparent religious intentions. The text contrasts true obedience and mere external religion."
    },
    {
      "pk": 9015020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 20,
      "text": "Saul said to Samuel, 'I have obeyed the voice of the LORD. I went on the mission the LORD sent me; I have brought back Agag king of Amalek, and I have utterly destroyed the Amalekites.'",
      "links": "<a href='/AIV/9/13/11'>1Sam 13:11</a>; <a href='/AIV/9/15/8'>1Sam 15:8</a>",
      "comment": "Saul’s response reveals rationalization and self-delusion—warning against relying on one’s own interpretation over the clear word of God."
    },
    {
      "pk": 9015021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 21,
      "text": "But the people took sheep and oxen, the best of the devoted things, to sacrifice to the LORD your God at Gilgal.'",
      "links": "<a href='/AIV/9/15/15'>1Sam 15:15</a>",
      "comment": "Excusing disobedience as a means of worship contrasts true sacrifice and mere external offerings. True devotion is interior, as seen in later New Testament teachings (see <a href='/AIV/40/9/13'>Matt 9:13</a>)."
    },
    {
      "pk": 9015022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 22,
      "text": "Samuel said, 'Does the LORD delight in burnt offerings and sacrifices as much as in obeying the voice of the LORD? Behold, to obey is better than sacrifice, and to listen than the fat of rams.'",
      "links": "<a href='/AIV/19/51/16-17'>Ps 51:16-17</a>; <a href='/AIV/28/6/6'>Hos 6:6</a>; <a href='/AIV/40/12/7'>Matt 12:7</a>",
      "comment": "Obedience is superior to ritual sacrifice, prefiguring teachings on the need for interior conversion and faithfulness above mere external religious acts."
    },
    {
      "pk": 9015023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 23,
      "text": "For rebellion is like the sin of divination, and arrogance is as iniquity and idolatry. Because you have rejected the word of the LORD, He has rejected you as king.'",
      "links": "<a href='/AIV/9/13/14'>1Sam 13:14</a>; <a href='/AIV/9/16/1'>1Sam 16:1</a>; <a href='/AIV/9/28/18'>1Sam 28:18</a>",
      "comment": "Rejection of God’s word is equated with serious sin, linking obedience to legitimate authority and spiritual health. The motif of divine rejection for disobedience resonates as a warning throughout Scripture."
    },
    {
      "pk": 9015024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 24,
      "text": "Saul said to Samuel, 'I have sinned. I have transgressed the command of the LORD and your words, because I feared the people and listened to their voice.'",
      "links": "<a href='/AIV/9/15/30'>1Sam 15:30</a>",
      "comment": "Saul confesses his sin, but the confession is motivated more by loss of power than genuine repentance—highlighting the need for heartfelt contrition. The parallel to Peter’s later repentance (<a href='/AIV/42/22/61-62'>Luke 22:61-62</a>) shows the priority of authentic conversion."
    },
    {
      "pk": 9015025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 25,
      "text": "Now, please forgive my sin and return with me so that I may worship the LORD.'",
      "links": "<a href='/AIV/9/15/30'>1Sam 15:30</a>",
      "comment": "Saul asks for forgiveness but as a means of restoring status. True worship is inseparable from wholehearted repentance and reconciliation."
    },
    {
      "pk": 9015026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 26,
      "text": "But Samuel said to Saul, 'I will not return with you, for you have rejected the word of the LORD, and the LORD has rejected you from being king over Israel.'",
      "links": "<a href='/AIV/9/13/14'>1Sam 13:14</a>",
      "comment": "Samuel’s refusal demonstrates the finality of God’s decision and the seriousness of spurning divine authority. This echoes principles of divine judgment and the irrevocable consequences of disobedience."
    },
    {
      "pk": 9015027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 27,
      "text": "As Samuel turned to leave, Saul seized the edge of his robe, and it tore.",
      "links": "<a href='/AIV/9/24/4'>1Sam 24:4</a>",
      "comment": "The tearing of the robe is symbolic and prophetic; later, David cutting Saul’s robe will echo this incident. Garments signify office and authority in biblical tradition."
    },
    {
      "pk": 9015028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 28,
      "text": "Samuel said to him, 'The LORD has torn the kingdom of Israel away from you today and has given it to a neighbor of yours who is better than you.'",
      "links": "<a href='/AIV/9/28/17'>1Sam 28:17</a>",
      "comment": "Loss of authority is described as a tearing away, reinforcing the gravity of spiritual and temporal authority, and its proper succession."
    },
    {
      "pk": 9015029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 29,
      "text": "The Glory of Israel will not lie or change His mind, for He is not a man that He should change His mind.'",
      "links": "<a href='/AIV/4/23/19'>Num 23:19</a>; <a href='/AIV/19/89/35'>Ps 89:35</a>",
      "comment": "God’s unchangeable nature is emphasized. His justice stands eternally, highlighting divine immutability—a key doctrine in biblical theology."
    },
    {
      "pk": 9015030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 30,
      "text": "Then Saul said, 'I have sinned. But please honor me now before the elders of my people and before Israel, and return with me, that I may worship the LORD your God.'",
      "links": "<a href='/AIV/9/15/25'>1Sam 15:25</a>",
      "comment": "Saul seeks external honor, not true contrition. Authentic worship and leadership require humility before God and faithful acceptance of correction."
    },
    {
      "pk": 9015031,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 31,
      "text": "So Samuel turned back after Saul, and Saul worshiped the LORD.",
      "links": "<a href='/AIV/9/15/25'>1Sam 15:25</a>",
      "comment": "Samuel’s accompaniment to worship preserves public order, but God’s judgment has not been revoked. This underlines the resilience of public liturgical worship and the enduring need for repentance."
    },
    {
      "pk": 9015032,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 32,
      "text": "Then Samuel said, 'Bring me Agag king of the Amalekites.' Agag came to him cheerfully, thinking, 'Surely the bitterness of death is past.'",
      "links": "<a href='/AIV/9/15/8'>1Sam 15:8</a>",
      "comment": "Agag presumes mercy, but God's justice is uncompromising. Agag’s fate foreshadows the ultimate triumph of justice over wickedness."
    },
    {
      "pk": 9015033,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 33,
      "text": "But Samuel said, 'As your sword has made women childless, so your mother shall be childless among women.' And Samuel put Agag to death before the LORD at Gilgal.",
      "links": "<a href='/AIV/9/10/8'>1Sam 10:8</a>",
      "comment": "Samuel executes divine judgment, taking up the prophetic responsibility to enforce God’s will when leaders fail. Gilgal is a notable sacred site of worship and covenant."
    },
    {
      "pk": 9015034,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 34,
      "text": "Then Samuel went to Ramah, and Saul went up to his house in Gibeah of Saul.",
      "links": "<a href='/AIV/9/7/17'>1Sam 7:17</a>; <a href='/AIV/9/10/26'>1Sam 10:26</a>",
      "comment": "Prophet and king go separate ways, a visual indication of the broken relationship. Ramah and Gibeah serve as bases for prophetic and royal authority, introducing themes of divided leadership later fulfilled in Christ as prophet, priest, and king."
    },
    {
      "pk": 9015035,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 15,
      "verse": 35,
      "text": "Samuel did not see Saul again until the day of his death. But Samuel grieved over Saul, and the LORD regretted that He had made Saul king over Israel.",
      "links": "<a href='/AIV/9/16/1'>1Sam 16:1</a>; <a href='/AIV/9/15/11'>1Sam 15:11</a>",
      "comment": "Samuel’s grief shows the responsible heart of true spiritual leadership and prayerful sorrow over sin. The sadness anticipates the longing for the coming Anointed King who will rule with perfect obedience and mercy."
    }
  ],
  "translatedAt": "2025-12-24T02:57:31.437Z"
}