{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 6,
  "verses": [
    {
      "pk": 1932600,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 1,
      "text": "The ark of the LORD was in the land of the Philistines seven months.",
      "links": "<a href='/AIV/9/5/1'>1 Sam. 5:1</a>",
      "comment": "Straightforward translation; preserves the original time period."
    },
    {
      "pk": 1932601,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 2,
      "text": "And the Philistines called for the priests and the diviners, saying, \"What shall we do with the ark of the LORD? Tell us how we should return it to its place.\"",
      "links": "<a href='/AIV/9/9/6'>1 Sam. 9:6</a>",
      "comment": "Maintains the phrasing of consulting religious leaders."
    },
    {
      "pk": 1932602,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 3,
      "text": "They said, \"If you send away the ark of the God of Israel, do not send it empty; but by all means send a guilt offering to him. Then you will be healed, and it will be revealed to you why his hand does not turn away from you.\"",
      "links": "<a href='/AIV/9/5/6'>1 Sam. 5:6</a>; <a href='/AIV/10/21/3'>2 Sam. 21:3</a>",
      "comment": "Preserves the concept of a guilt offering as in the original Hebrew."
    },
    {
      "pk": 1932603,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 4,
      "text": "And they said, \"What is the guilt offering that we should return to him?\" They answered, \"Five golden tumors and five golden mice, corresponding to the number of the rulers of the Philistines, because the same plague was on all of you and on your rulers.\"",
      "links": "<a href='/AIV/9/5/6'>1 Sam. 5:6</a>; <a href='/AIV/9/6/17'>1 Sam. 6:17</a>",
      "comment": "Preserves the imagery and symbolism of the original text."
    },
    {
      "pk": 1932604,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 5,
      "text": "So make images of your tumors and images of your mice that ravage the land, and give glory to the God of Israel. Perhaps he will lighten his hand from you, your gods, and your land.",
      "links": "<a href='/AIV/9/5/6'>1 Sam. 5:6</a>; <a href='/AIV/9/6/9'>1 Sam. 6:9</a>",
      "comment": "Uses 'ravage' to clarify mice's destructive role; follows original sense."
    },
    {
      "pk": 1932605,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 6,
      "text": "Why then do you harden your hearts as the Egyptians and Pharaoh hardened their hearts? When he had dealt severely with them, did they not send the Israelites away so they left?",
      "links": "<a href='/AIV/2/7/13'>Ex. 7:13</a>; <a href='/AIV/2/12/31'>Ex. 12:31</a>",
      "comment": "References Exodus narrative; straightforward rendering."
    },
    {
      "pk": 1932606,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 7,
      "text": "Now, prepare a new cart and take two milk cows, on which no yoke has ever come, and hitch the cows to the cart, but take their calves away from them.",
      "links": "<a href='/AIV/9/6/10'>1 Sam. 6:10</a>",
      "comment": "Translates idioms; 'milk cows' clarifies 'never been yoked.'"
    },
    {
      "pk": 1932607,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 8,
      "text": "Take the ark of the LORD and set it on the cart, and put the golden things that you are sending as a guilt offering in a box beside it. Then send it off and let it go.",
      "links": "<a href='/AIV/9/6/4'>1 Sam. 6:4</a>; <a href='/AIV/9/6/11'>1 Sam. 6:11</a>",
      "comment": "Clarifies the arrangement on the cart; matches original intention."
    },
    {
      "pk": 1932608,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 9,
      "text": "Watch; if it goes up by the way of its own land to Beth-shemesh, then he has done us this great harm. But if not, then we shall know that it was not his hand that struck us; it happened to us by chance.\"",
      "links": "<a href='/AIV/9/6/19'>1 Sam. 6:19</a>",
      "comment": "Preserves the test of divine intervention."
    },
    {
      "pk": 1932609,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 10,
      "text": "The men did so, and took two milk cows and hitched them to the cart, and shut up their calves at home.",
      "links": "<a href='/AIV/9/6/7'>1 Sam. 6:7</a>",
      "comment": "Plain, word-for-word; clarifies action of separating calves."
    },
    {
      "pk": 1932610,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 11,
      "text": "And they put the ark of the LORD on the cart, and the box with the golden mice and the images of their tumors.",
      "links": "<a href='/AIV/9/6/8'>1 Sam. 6:8</a>",
      "comment": "Maintains original order and items."
    },
    {
      "pk": 1932611,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 12,
      "text": "The cows went straight in the direction of Beth-shemesh, along one highway, lowing as they went, and did not turn aside to the right or to the left. The rulers of the Philistines followed them to the border of Beth-shemesh.",
      "links": "<a href='/AIV/9/6/9'>1 Sam. 6:9</a>",
      "comment": "Clarifies 'lowing' as the sound cows make; preserves details."
    },
    {
      "pk": 1932612,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 13,
      "text": "Now the people of Beth-shemesh were reaping their wheat harvest in the valley. When they looked up and saw the ark, they rejoiced to see it.",
      "links": "<a href='/AIV/7/21/21'>Judg. 21:21</a>",
      "comment": "Translates 'were reaping'; keeps the timing explicit."
    },
    {
      "pk": 1932613,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 14,
      "text": "The cart came into the field of Joshua of Beth-shemesh and stopped there. A large stone was there, and they split the wood of the cart and offered the cows as a burnt offering to the LORD.",
      "links": "<a href='/AIV/9/6/18'>1 Sam. 6:18</a>",
      "comment": "Preserves sacrificial action; uses modern terms."
    },
    {
      "pk": 1932614,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 15,
      "text": "And the Levites took down the ark of the LORD and the box that was beside it, which contained the golden items, and put them on the large stone. The men of Beth-shemesh offered burnt offerings and sacrificed sacrifices on that day to the LORD.",
      "links": "<a href='/AIV/3/9/7'>Lev. 9:7</a>",
      "comment": "Rephrased for clarity but preserves sacrificial language."
    },
    {
      "pk": 1932615,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 16,
      "text": "When the five rulers of the Philistines saw it, they returned that same day to Ekron.",
      "links": "<a href='/AIV/9/6/17'>1 Sam. 6:17</a>; <a href='/AIV/9/5/10'>1 Sam. 5:10</a>",
      "comment": "Matches the narrative of their return."
    },
    {
      "pk": 1932616,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 17,
      "text": "These are the golden tumors that the Philistines sent as a guilt offering to the LORD: one for Ashdod, one for Gaza, one for Ashkelon, one for Gath, one for Ekron.",
      "links": "<a href='/AIV/9/6/4'>1 Sam. 6:4</a>",
      "comment": "Lists the Philistine cities as in the Hebrew."
    },
    {
      "pk": 1932617,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 18,
      "text": "And the golden mice, equal in number to all the cities of the Philistines belonging to the five rulers, both fortified cities and country villages. The great stone beside which they set down the ark of the LORD remains to this day in the field of Joshua of Beth-shemesh.",
      "links": "<a href='/AIV/9/6/14'>1 Sam. 6:14</a>",
      "comment": "Clarifies scope of Philistine towns; 'remains to this day' mirrors Hebrew word."
    },
    {
      "pk": 1932618,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 19,
      "text": "And God struck some of the men of Beth-shemesh, because they looked upon the ark of the LORD. He struck seventy men among them. And the people mourned because the LORD had struck the people with a great blow.",
      "links": "<a href='/AIV/4/4/20'>Num. 4:20</a>",
      "comment": "Most manuscripts report seventy men struck; preserves traditional reading. Some ancient traditions differ (see text critical notes)."
    },
    {
      "pk": 1932619,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 20,
      "text": "The men of Beth-shemesh said, \"Who is able to stand before the LORD, this holy God? And to whom shall he go up away from us?\"",
      "links": "<a href='/AIV/6/24/19'>Josh. 24:19</a>",
      "comment": "Retains the fear and question of holiness."
    },
    {
      "pk": 1932620,
      "translation": "AIV",
      "book": 9,
      "chapter": 6,
      "verse": 21,
      "text": "So they sent messengers to the inhabitants of Kiriath-jearim, saying, \"The Philistines have returned the ark of the LORD. Come down and take it up to you.\"",
      "links": "<a href='/AIV/9/7/1'>1 Sam. 7:1</a>",
      "comment": "Echoes original invitation and transition to next chapter."
    }
  ],
  "translatedAt": "2025-12-22T08:27:44.358Z"
}