{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 24,
  "verses": [
    {
      "pk": 9024001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 1,
      "text": "After Saul returned from pursuing the Philistines, he was told, 'David is in the wilderness of En-gedi.'",
      "links": "<a href='/AIV/9/23/28'>1Sam 23:28</a>; <a href='/AIV/9/23/19'>1Sam 23:19</a>",
      "comment": "En-gedi is an oasis west of the Dead Sea, known for its caves and vegetation. David often sought safety in such remote places, illustrating the peril he lived under fleeing Saul."
    },
    {
      "pk": 9024002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 2,
      "text": "Then Saul took three thousand chosen men from all Israel and went to look for David and his men in front of the Rocks of the Wild Goats.",
      "links": "<a href='/AIV/9/23/8'>1Sam 23:8</a>",
      "comment": "Saul mobilizes a large elite force to hunt one man. This reflects the intensity of Saul’s jealousy and David’s extraordinary threat to his throne, foreshadowing David’s importance in the divine plan."
    },
    {
      "pk": 9024003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 3,
      "text": "He came to the sheepfolds along the way, where there was a cave. Saul went in to relieve himself. Now David and his men were sitting in the recesses of the cave.",
      "links": "<a href='/AIV/9/22/1'>1Sam 22:1</a>",
      "comment": "God’s providence is at work: Saul unwittingly enters the very cave where David and his men are hidden. This sets up a dramatic test of David's character and submission to God’s authority."
    },
    {
      "pk": 9024004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 4,
      "text": "David’s men said to him, 'This is the day the Lord said to you: “See, I am giving your enemy into your hand, and you shall do to him as it seems good to you.”' Then David crept up quietly and cut off the edge of Saul’s robe in secret.",
      "links": "<a href='/AIV/9/23/17'>1Sam 23:17</a>; <a href='/AIV/9/26/8'>1Sam 26:8</a>",
      "comment": "David's men interpret this providential moment as God's will for David to kill Saul. However, David chooses restraint, teaching the value of obedience to divine authority rather than personal revenge. The cutting of the robe symbolizes the sovereignty being transferred from Saul to David (cf. 1Sam 15:27-28)."
    },
    {
      "pk": 9024005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 5,
      "text": "Afterward, David’s heart struck him, because he had cut off the edge of Saul’s robe.",
      "links": "<a href='/AIV/9/24/11'>1Sam 24:11</a>; <a href='/AIV/9/26/9'>1Sam 26:9</a>",
      "comment": "David’s conscience is sensitive even to symbolic disrespect; he feels conviction for dishonoring the one anointed by God. This illustrates the weight of reverence due to divinely appointed authority."
    },
    {
      "pk": 9024006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 6,
      "text": "He said to his men, 'The Lord forbid that I should do this thing to my master, the Lord’s anointed, to stretch out my hand against him, for he is the anointed of the Lord.'",
      "links": "<a href='/AIV/9/26/11'>1Sam 26:11</a>; <a href='/AIV/9/10/1'>1Sam 10:1</a>",
      "comment": "David refuses to harm Saul because he respects the sacredness of the Lord’s anointed. This prefigures the New Testament teaching on authority and submission (see Rom 13:1-2)."
    },
    {
      "pk": 9024007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 7,
      "text": "David restrained his men with these words and did not allow them to attack Saul. Then Saul rose up, left the cave, and went on his way.",
      "links": "<a href='/AIV/9/26/9-11'>1Sam 26:9-11</a>",
      "comment": "David actively prevents injustice, showing mercy and self-control. Such restraint demonstrates virtue and anticipates Christ’s own meekness under persecution (cf. Mt 5:44, 1 Pet 2:23)."
    },
    {
      "pk": 9024008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 8,
      "text": "Afterward, David arose and went out of the cave and called after Saul, saying, 'My lord the king!' When Saul looked behind him, David bowed with his face to the ground and paid him homage.",
      "links": "<a href='/AIV/9/26/17'>1Sam 26:17</a>; <a href='/AIV/2/18/7'>Exod 18:7</a>",
      "comment": "David shows humility, even toward one who seeks his life. This act of deep respect further highlights the importance of honoring legitimate rulers and God’s order (see 1 Pet 2:17)."
    },
    {
      "pk": 9024009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 9,
      "text": "David said to Saul, 'Why do you listen to the words of men who say, “David seeks your harm”?'",
      "links": "<a href='/AIV/9/22/9'>1Sam 22:9</a>",
      "comment": "David appeals directly to Saul, exposing the lies that have stirred mistrust. He models reconciliation and transparency, a virtue called for in Christian relationships (cf. Eph 4:25)."
    },
    {
      "pk": 90240010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 10,
      "text": "This day your eyes have seen how the Lord delivered you today into my hand in the cave. Some urged me to kill you, but I spared you. I said, “I will not stretch out my hand against my master, for he is the Lord’s anointed.”",
      "links": "<a href='/AIV/9/24/4-6'>1Sam 24:4-6</a>",
      "comment": "David gives testimony to his own integrity and respect for God’s appointment. The restraint seen here is a foreshadowing of Christ’s response to evil with goodness (cf. Rom 12:17-21)."
    },
    {
      "pk": 90240011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 11,
      "text": "See, my father, look! Here is the edge of your robe in my hand. I cut off the edge of your robe, but did not kill you. Know and recognize that there is no evil or rebellion in my hand, and I have not sinned against you, though you hunt my life to take it.",
      "links": "<a href='/AIV/9/24/4'>1Sam 24:4</a>; <a href='/AIV/9/26/23'>1Sam 26:23</a>",
      "comment": "David appeals to visible evidence of his innocence, echoing biblical principles of verifying truth by witnesses and tangible proofs (see Deut 19:15). His calling Saul 'father' shows continued familial and kingly loyalty."
    },
    {
      "pk": 90240012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 12,
      "text": "May the Lord judge between me and you, and may the Lord avenge me on you, but my hand shall not be against you.",
      "links": "<a href='/AIV/9/24/15'>1Sam 24:15</a>; <a href='/AIV/3/19/18'>Lev 19:18</a>; <a href='/AIV/45/12/19'>Rom 12:19</a>",
      "comment": "David entrusts vengeance to God alone, refusing to take justice into his own hands. This gatekeeps against cycles of violence, reflecting the command to 'not repay evil for evil' (Rom 12:17-19)."
    },
    {
      "pk": 90240013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 13,
      "text": "As the old proverb says, 'Out of the wicked comes wickedness.' But my hand will not be against you.",
      "links": "<a href='/AIV/9/26/23'>1Sam 26:23</a>",
      "comment": "David applies wisdom tradition to his own actions—he will not return evil for evil. This kind of wisdom, seen in the Old Testament, is fulfilled perfectly in Christ’s teaching (see Mt 5:39, 43-48)."
    },
    {
      "pk": 90240014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 14,
      "text": "After whom has the king of Israel come out? After whom are you pursuing? After a dead dog, after a single flea?",
      "links": "<a href='/AIV/9/26/20'>1Sam 26:20</a>; <a href='/AIV/9/17/43'>1Sam 17:43</a>",
      "comment": "David’s humility is on display—he likens himself to something lowly and harmless. Humility in the face of persecution anticipates the lowliness Christ embraced (cf. Phil 2:7)."
    },
    {
      "pk": 90240015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 15,
      "text": "May the Lord therefore be judge and decide between me and you. May he see and plead my case and deliver me out of your hand.",
      "links": "<a href='/AIV/9/24/12'>1Sam 24:12</a>; <a href='/AIV/19/7/8'>Ps 7:8</a>",
      "comment": "David trusts divine justice and makes God his defender. This approach reappears throughout the Psalms and in the New Covenant teaching that ultimate judgment belongs to the Lord."
    },
    {
      "pk": 90240016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 16,
      "text": "When David finished speaking these words to Saul, Saul said, 'Is that your voice, my son David?' Then Saul lifted up his voice and wept.",
      "links": "<a href='/AIV/9/18/12'>1Sam 18:12</a>; <a href='/AIV/9/24/11'>1Sam 24:11</a>",
      "comment": "Saul’s emotional response shows the power of mercy to move even hardened hearts, mirroring how kindness can be a tool for reconciliation and conversion (cf. Prov 25:21-22; Rom 2:4)."
    },
    {
      "pk": 90240017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 17,
      "text": "He said to David, 'You are more righteous than I, for you have repaid me good, whereas I have repaid you evil.'",
      "links": "<a href='/AIV/9/24/18-19'>1Sam 24:18-19</a>; <a href='/AIV/40/5/44'>Mt 5:44</a>",
      "comment": "Saul acknowledges David’s righteousness—repaying evil with good. Jesus commands the same in the Sermon on the Mount, showing the continuity of the call to forgiveness and love for one’s enemies."
    },
    {
      "pk": 90240018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 18,
      "text": "You have declared today how you have dealt well with me, in that when the Lord gave me into your hand, you did not kill me.",
      "links": "<a href='/AIV/9/24/10'>1Sam 24:10</a>",
      "comment": "Saul openly affirms David’s mercy, confirming David’s uprightness as a true servant of the Lord. The narrative emphasizes David’s legitimate, God-given moral authority—an authority confirmed by mercy and restraint."
    },
    {
      "pk": 90240019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 19,
      "text": "For who, when he finds his enemy, will let him go away safely? So may the Lord reward you with good for what you have done to me this day.",
      "links": "<a href='/AIV/40/5/7'>Mt 5:7</a>; <a href='/AIV/19/18/25'>Ps 18:25</a>",
      "comment": "Saul's blessing is prophetic; God's blessings often come to those who show merciful forgiveness. This anticipates promises found in the Beatitudes ('Blessed are the merciful')."
    },
    {
      "pk": 90240020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 20,
      "text": "Now I know surely that you shall indeed become king, and that the kingdom of Israel shall be established in your hand.",
      "links": "<a href='/AIV/9/23/17'>1Sam 23:17</a>; <a href='/AIV/10/7/5'>2Sam 7:5</a>",
      "comment": "Saul explicitly acknowledges David’s divine calling. This transitional period hints at the dawning of a new covenant leadership, foreshadowing Christ's own descent from David (cf. Luke 1:32-33)."
    },
    {
      "pk": 90240021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 21,
      "text": "Swear to me now by the Lord that you will not cut off my descendants after me, and that you will not destroy my name from my father’s house.",
      "links": "<a href='/AIV/9/20/14-15'>1Sam 20:14-15</a>; <a href='/AIV/10/9/7'>2Sam 9:7</a>",
      "comment": "A plea for mercy toward Saul’s lineage recalls the biblical concern for family lines and legitimate heirs. Preservation of the royal line, even of a fallen king, supports the Old Testament’s concern for covenant, succession, and the sanctity of oaths."
    },
    {
      "pk": 90240022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 24,
      "verse": 22,
      "text": "David swore this to Saul. Then Saul went home, but David and his men went up to the stronghold.",
      "links": "<a href='/AIV/10/9/7'>2Sam 9:7</a>",
      "comment": "David keeps his oath—an act of integrity and faithfulness. Throughout Scripture, vows and oaths are regarded as sacred and binding, reflecting God’s own fidelity to His promises. The delay in David joining Saul indicates continued caution and discernment."
    }
  ],
  "translatedAt": "2025-12-24T03:04:44.531Z"
}