{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 29,
  "verses": [
    {
      "pk": 1029001,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 1,
      "text": "Now the Philistines gathered all their armies at Aphek, and the Israelites camped by the spring that is in Jezreel.",
      "links": "<a href='/AIV/9/4/1'>1 Sam. 4:1</a>; <a href='/AIV/6/15/56'>Josh. 15:56</a>",
      "comment": "Literal translation; 'armies' refers to military units, and the locations match established sites in Israel."
    },
    {
      "pk": 1029002,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 2,
      "text": "As the Philistine lords were passing on by hundreds and by thousands, and David and his men were passing on in the rear with Achish,",
      "links": "<a href='/AIV/9/28/1-2'>1 Sam. 28:1–2</a>",
      "comment": "'Lords' translates 'serenim,' chief Philistine rulers. 'Hundreds and thousands' follows Hebrew phrasing."
    },
    {
      "pk": 1029003,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 3,
      "text": "the commanders of the Philistines said, 'What are these Hebrews doing here?' And Achish said to the commanders of the Philistines, 'Is this not David, the servant of Saul king of Israel, who has been with me these days, or these years? I have found no fault in him from the day he defected to me until today.'",
      "links": "<a href='/AIV/9/27/7'>1 Sam. 27:7</a>; <a href='/AIV/9/28/2'>1 Sam. 28:2</a>",
      "comment": "'Defected' translates literally 'came' but means 'deserted to.' Time period 'these days or these years' keeps the possible ambiguity."
    },
    {
      "pk": 1029004,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 4,
      "text": "But the commanders of the Philistines were angry with him, and the commanders of the Philistines said to him, 'Send the man back, so that he may return to the place you have assigned him. He must not go with us into the battle, or he might become our adversary in the fight. For how could this man reconcile himself to his lord? Would it not be with the heads of these men?'",
      "links": "<a href='/AIV/9/27/2-6'>1 Sam. 27:2–6</a>; <a href='/AIV/9/18/25'>1 Sam. 18:25</a>",
      "comment": "'Heads of these men' refers to taking Philistine soldiers' heads as trophies, a Hebrew idiom for turning against them."
    },
    {
      "pk": 1029005,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 5,
      "text": "Is this not David, of whom they sing to one another in dances, saying, ‘Saul has struck down his thousands, and David his ten thousands’?",
      "links": "<a href='/AIV/9/18/7'>1 Sam. 18:7</a>; <a href='/AIV/9/21/11'>1 Sam. 21:11</a>",
      "comment": "The quotation preserves the poetic structure from previous references."
    },
    {
      "pk": 1029006,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 6,
      "text": "Then Achish called David and said to him, 'As surely as the LORD lives, you have been honest, and it seems good to me that you should march out and in with me in the army, for I have found no evil in you from the day you came to me until today. Nevertheless, you are not acceptable in the eyes of the lords.'",
      "links": "<a href='/AIV/9/27/3'>1 Sam. 27:3</a>; <a href='/AIV/9/28/1-2'>1 Sam. 28:1–2</a>",
      "comment": "'As surely as the LORD lives' translates the standard Hebrew oath formula."
    },
    {
      "pk": 1029007,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 7,
      "text": "So now, go back peacefully, so that you do not displease the lords of the Philistines.",
      "links": "",
      "comment": "'Lords of the Philistines' is a literal translation of the Hebrew rulers' title."
    },
    {
      "pk": 1029008,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 8,
      "text": "And David said to Achish, 'But what have I done? What have you found in your servant from the day I came to you until today, that I may not go and fight against the enemies of my lord the king?'",
      "links": "<a href='/AIV/9/27/8-12'>1 Sam. 27:8–12</a>",
      "comment": "'Enemies of my lord the king' possibly ambiguous—David may be concealing his true loyalty."
    },
    {
      "pk": 1029009,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 9,
      "text": "And Achish answered David and said, 'I know that you are as blameless in my sight as an angel of God; nevertheless, the commanders of the Philistines have said, “He shall not go up with us to the battle.”'",
      "links": "<a href='/AIV/9/28/1-2'>1 Sam. 28:1–2</a>; <a href='/AIV/10/14/17'>2 Sam. 14:17</a>",
      "comment": "'Angel of God' is a Hebrew idiom for a person fully trustworthy or upright."
    },
    {
      "pk": 1029010,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 10,
      "text": "So get up early in the morning, you and your lord’s servants who came with you. As soon as you have risen early in the morning and have light, depart.'",
      "links": "",
      "comment": "'Your lord’s servants' refers to David’s men, who are technically loyal to Saul."
    },
    {
      "pk": 1029011,
      "translation": "AIV",
      "book": 9,
      "chapter": 29,
      "verse": 11,
      "text": "So David rose early, he and his men, to depart in the morning, to return to the land of the Philistines. But the Philistines went up to Jezreel.",
      "links": "<a href='/AIV/9/28/1'>1 Sam. 28:1</a>",
      "comment": "'To the land of the Philistines'—refers to the territory assigned to David (Ziklag, 1 Sam. 27:6)."
    }
  ],
  "translatedAt": "2025-12-22T08:38:05.961Z"
}