{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 26,
  "verses": [
    {
      "pk": 2002601,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 1,
      "text": "The Ziphites came to Saul at Gibeah and said, \"Is not David hiding himself on the hill of Hachilah, which is facing Jeshimon?\"",
      "links": "<a href='/AIV/9/23/19'>1 Sam. 23:19</a>",
      "comment": "The location Hachilah and Jeshimon are kept as in the Hebrew text; modern names are not substituted."
    },
    {
      "pk": 2002602,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 2,
      "text": "So Saul arose and went down to the wilderness of Ziph, with three thousand chosen men of Israel, to search for David in the wilderness of Ziph.",
      "links": "<a href='/AIV/9/24/2'>1 Sam. 24:2</a>",
      "comment": "The number and detail are as per the Hebrew."
    },
    {
      "pk": 2002603,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 3,
      "text": "Saul encamped on the hill of Hachilah, which faces Jeshimon, beside the road. But David remained in the wilderness. When he saw that Saul had come after him into the wilderness,",
      "links": "<a href='/AIV/9/26/1'>1 Sam. 26:1</a>",
      "comment": "Sentence break adjusted for readability, maintaining original narrative."
    },
    {
      "pk": 2002604,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 4,
      "text": "David sent out spies and learned that Saul had truly arrived.",
      "links": "<a href='/AIV/9/23/23'>1 Sam. 23:23</a>",
      "comment": "Hebrew word for spies also means 'scouts'; 'arrived' is a direct rendering."
    },
    {
      "pk": 2002605,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 5,
      "text": "Then David rose and came to the place where Saul had encamped. David saw the place where Saul and Abner son of Ner, the commander of his army, were lying. Saul was lying within the camp, and the people were encamped around him.",
      "links": "<a href='/AIV/9/14/50'>1 Sam. 14:50</a>",
      "comment": "Clear identification of Abner; 'the commander of his army' clarifies role."
    },
    {
      "pk": 2002606,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 6,
      "text": "David answered and spoke to Ahimelech the Hittite and to Abishai the son of Zeruiah, Joab’s brother, saying, \"Who will go down with me to Saul in the camp?\" And Abishai said, \"I will go down with you.\"",
      "links": "<a href='/AIV/9/23/18'>1 Sam. 23:18</a>",
      "comment": "Hittite ethnicity and family relationships are explicit as in Hebrew."
    },
    {
      "pk": 2002607,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 7,
      "text": "So David and Abishai came to the camp by night. Saul was lying asleep inside the camp, with his spear stuck in the ground at his head, and Abner and the army were lying around him.",
      "links": "<a href='/AIV/9/26/5'>1 Sam. 26:5</a>",
      "comment": "Details maintained; minor word order for clarity in English."
    },
    {
      "pk": 2002608,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 8,
      "text": "Then Abishai said to David, \"God has delivered your enemy into your hand today. Now, let me pin him to the ground with one stroke of the spear; I will not need to strike him twice.\"",
      "links": "<a href='/AIV/9/24/4'>1 Sam. 24:4</a>",
      "comment": "Retains literal 'pin him to the ground' phrasing."
    },
    {
      "pk": 2002609,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 9,
      "text": "But David said to Abishai, \"Do not destroy him! For who can put out his hand against the LORD’s anointed and be guiltless?\"",
      "links": "<a href='/AIV/9/24/6'>1 Sam. 24:6</a>",
      "comment": "Original idiom 'put out his hand' preserved."
    },
    {
      "pk": 2002610,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 10,
      "text": "And David said, \"As the LORD lives, the LORD will strike him, or his day will come that he dies, or he will go down into battle and perish.\"",
      "links": "<a href='/AIV/9/25/38'>1 Sam. 25:38</a>; <a href='/AIV/10/1/14'>2 Sam. 1:14</a>",
      "comment": "Threefold possible outcomes kept as in Hebrew."
    },
    {
      "pk": 2002611,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 11,
      "text": "\"The LORD forbid that I should put out my hand against the LORD’s anointed. But now take the spear that is at his head and the jar of water, and let us go.\"",
      "links": "<a href='/AIV/9/24/10'>1 Sam. 24:10</a>",
      "comment": "Literal 'jar of water' (sometimes 'cruse' in older translations)."
    },
    {
      "pk": 2002612,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 12,
      "text": "So David took the spear and the jar of water from Saul’s head, and they departed. No one saw or knew, nor did anyone wake up, for they were all asleep, because a deep sleep from the LORD had fallen upon them.",
      "links": "<a href='/AIV/9/26/7'>1 Sam. 26:7</a>",
      "comment": "The phrase 'deep sleep from the LORD' matches Hebrew phrasing."
    },
    {
      "pk": 2002613,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 13,
      "text": "Then David crossed over to the other side and stood on top of the hill far away, with a great distance between them.",
      "links": "<a href='/AIV/9/24/8'>1 Sam. 24:8</a>",
      "comment": "Added 'with a great distance' for clarity, as per Hebrew."
    },
    {
      "pk": 2002614,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 14,
      "text": "David called out to the army and to Abner son of Ner, saying, \"Will you not answer, Abner?\" Abner replied, \"Who are you who calls to the king?\"",
      "links": "<a href='/AIV/9/17/55'>1 Sam. 17:55</a>",
      "comment": "Direct address and dialogue maintained."
    },
    {
      "pk": 2002615,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 15,
      "text": "David said to Abner, \"Are you not a man? Who is like you in Israel? Why then have you not guarded your lord the king? For one of the people came in to destroy your lord the king.\"",
      "links": "<a href='/AIV/9/26/9'>1 Sam. 26:9</a>",
      "comment": "Irony expressed directly per Hebrew narrative."
    },
    {
      "pk": 2002616,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 16,
      "text": "\"What you have done is not good. As the LORD lives, you deserve to die, because you have not guarded your lord, the LORD’s anointed. And now, see where the king’s spear is, and the jar of water that was at his head.\"",
      "links": "<a href='/AIV/9/2/10'>1 Sam. 2:10</a>",
      "comment": "Literal phrase 'deserve to die' translated for clear meaning."
    },
    {
      "pk": 2002617,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 17,
      "text": "Saul recognized David’s voice and said, \"Is this your voice, my son David?\" And David said, \"It is my voice, my lord, O king.\"",
      "links": "<a href='/AIV/9/24/16'>1 Sam. 24:16</a>",
      "comment": "The terms of address reflect reverence and relationship."
    },
    {
      "pk": 2002618,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 18,
      "text": "And he said, \"Why does my lord pursue his servant? What have I done? What evil is in my hand?\"",
      "links": "<a href='/AIV/9/24/11'>1 Sam. 24:11</a>",
      "comment": "'What evil is in my hand?' kept as literal idiom."
    },
    {
      "pk": 2002619,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 19,
      "text": "\"Now therefore, please let my lord the king hear the words of his servant. If the LORD has stirred you up against me, let him accept an offering. But if it is men, may they be cursed before the LORD, for they have driven me out today that I should not have a share in the inheritance of the LORD, saying, 'Go, serve other gods.'\"",
      "links": "<a href='/AIV/9/26/11'>1 Sam. 26:11</a>",
      "comment": "‘Inheritance of the LORD’ refers to his place in Israel; rendered literal."
    },
    {
      "pk": 2002620,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 20,
      "text": "\"Now therefore, do not let my blood fall to the earth away from the presence of the LORD. For the king of Israel has come out to seek a single flea, as one would hunt a partridge in the mountains.\"",
      "links": "<a href='/AIV/9/24/14'>1 Sam. 24:14</a>",
      "comment": "Metaphors (flea, partridge) kept as original."
    },
    {
      "pk": 2002621,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 21,
      "text": "Then Saul said, \"I have sinned. Return, my son David, for I will no longer do you harm, because my life was precious in your eyes this day. Behold, I have acted foolishly and have made a great mistake.\"",
      "links": "<a href='/AIV/9/24/17'>1 Sam. 24:17</a>",
      "comment": "Saul’s confession and regret are rendered plain."
    },
    {
      "pk": 2002622,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 22,
      "text": "David answered, \"Here is the spear, O king! Let one of the young men come over and take it.\"",
      "links": "<a href='/AIV/9/26/7'>1 Sam. 26:7</a>",
      "comment": "Direct form as dialogue."
    },
    {
      "pk": 2002623,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 23,
      "text": "\"The LORD rewards every person for his righteousness and faithfulness. For the LORD delivered you into my hand today, but I would not put out my hand against the LORD’s anointed.\"",
      "links": "<a href='/AIV/9/24/6'>1 Sam. 24:6</a>",
      "comment": "'Every person' is a direct translation of 'each' in Hebrew, without inclusive modification."
    },
    {
      "pk": 2002624,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 24,
      "text": "\"As your life was precious this day in my sight, so may my life be precious in the sight of the LORD, and may he deliver me out of all tribulation.\"",
      "links": "<a href='/AIV/19/72/14'>Ps. 72:14</a>",
      "comment": "Phrase 'precious in the sight' rendered as in Hebrew."
    },
    {
      "pk": 2002625,
      "translation": "AIV",
      "book": 9,
      "chapter": 26,
      "verse": 25,
      "text": "Then Saul said to David, \"Blessed are you, my son David! You will certainly do great things and prevail.\" So David went his way, and Saul returned to his place.",
      "links": "<a href='/AIV/9/24/19'>1 Sam. 24:19</a>",
      "comment": "Blessing formula and ending rendered plainly as in Hebrew."
    }
  ],
  "translatedAt": "2025-12-22T08:37:09.693Z"
}