{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 12,
  "verses": [
    {
      "pk": 30701201,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 1,
      "text": "Samuel said to all Israel, \"Look, I have obeyed your voice in all that you have said to me, and have made a king over you.\"",
      "links": "<a href='/AIV/9/8/5-22'>1 Sam. 8:5–22</a>",
      "comment": "Samuel announces his compliance with the people's desire for a king."
    },
    {
      "pk": 30701202,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 2,
      "text": "Now, here is the king walking before you. As for me, I am old and gray. My sons are with you. I have walked before you from my youth until this day.",
      "links": "<a href='/AIV/9/8/1-3'>1 Sam. 8:1–3</a>",
      "comment": "Samuel refers to his age and his long public service."
    },
    {
      "pk": 30701203,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 3,
      "text": "Here I am. Witness against me before the LORD and before his anointed. Whose ox have I taken? Whose donkey have I taken? Whom have I cheated? Whom have I oppressed? Or from whose hand have I taken a bribe to blind my eyes with it? If I have done any of these, I will restore it to you.\"",
      "links": "<a href='/AIV/2/23/8'>Ex. 23:8</a>; <a href='/AIV/5/16/19'>Deut. 16:19</a>",
      "comment": "Samuel calls for accountability, invoking specific examples from the Law."
    },
    {
      "pk": 30701204,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 4,
      "text": "They said, \"You have not cheated us or oppressed us, nor have you taken anything from any man's hand.\"",
      "links": "<a href='/AIV/16/5/16'>Neh. 5:16</a>",
      "comment": "The people affirm Samuel's integrity."
    },
    {
      "pk": 30701205,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 5,
      "text": "He said to them, \"The LORD is witness against you, and His anointed is witness this day, that you have not found anything in my hand.\" They answered, \"He is witness.\"",
      "links": "<a href='/AIV/9/10/1'>1 Sam. 10:1</a>",
      "comment": "Samuel formally calls the LORD and the king to witness their verdict."
    },
    {
      "pk": 30701206,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 6,
      "text": "Samuel said to the people, \"It is the LORD who appointed Moses and Aaron, and who brought your fathers up out of the land of Egypt.",
      "links": "<a href='/AIV/2/3/10'>Ex. 3:10</a>; <a href='/AIV/2/6/26-27'>Ex. 6:26–27</a>",
      "comment": "Reference to Israel’s deliverance from Egypt by God’s appointment."
    },
    {
      "pk": 30701207,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 7,
      "text": "Now therefore stand still, that I may plead with you before the LORD concerning all the righteous deeds of the LORD that He did for you and for your fathers.",
      "links": "<a href='/AIV/5/32/4'>Deut. 32:4</a>; <a href='/AIV/9/10/18'>1 Sam. 10:18</a>",
      "comment": "'Plead' here connotes Samuel declaring or testifying of the LORD's deeds like a court case."
    },
    {
      "pk": 30701208,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 8,
      "text": "When Jacob went into Egypt, and your fathers cried out to the LORD, then the LORD sent Moses and Aaron, who brought your fathers out of Egypt and made them settle in this place.",
      "links": "<a href='/AIV/1/46/6-7'>Gen. 46:6–7</a>; <a href='/AIV/2/2/23-24'>Ex. 2:23–24</a>",
      "comment": "Condenses the patriarchs’ history and the Exodus."
    },
    {
      "pk": 30701209,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 9,
      "text": "But they forgot the LORD their God, and He sold them into the hand of Sisera, commander of the army of Hazor, and into the hand of the Philistines, and into the hand of the king of Moab, and they fought against them.",
      "links": "<a href='/AIV/7/4/2'>Judg. 4:2</a>; <a href='/AIV/7/3/12'>Judg. 3:12</a>",
      "comment": "References Israel’s cycles of apostasy and oppression in the book of Judges."
    },
    {
      "pk": 30701210,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 10,
      "text": "They cried out to the LORD and said, 'We have sinned, because we have forsaken the LORD and have served the Baals and the Ashtaroth. But now deliver us out of the hand of our enemies, and we will serve You.'",
      "links": "<a href='/AIV/7/2/13'>Judg. 2:13</a>; <a href='/AIV/9/7/3-4'>1 Sam. 7:3–4</a>",
      "comment": "Expresses the repentance and plea found in Israel’s history."
    },
    {
      "pk": 30701211,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 11,
      "text": "And the LORD sent Jerubbaal and Barak and Jephthah and Samuel, and delivered you out of the hand of your enemies on every side, so that you lived in safety.",
      "links": "<a href='/AIV/7/6/32'>Judg. 6:32</a>; <a href='/AIV/7/4/6'>Judg. 4:6</a>",
      "comment": "Mentions deliverers: 'Jerubbaal' (Gideon), Barak, Jephthah, and Samuel himself, reflecting the Judges era."
    },
    {
      "pk": 30701212,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 12,
      "text": "But when you saw that Nahash the king of the Ammonites came against you, you said to me, 'No, but a king will reign over us,' when the LORD your God was your king.",
      "links": "<a href='/AIV/9/8/5-7'>1 Sam. 8:5–7</a>; <a href='/AIV/9/11/1'>1 Sam. 11:1</a>",
      "comment": "Summarizes their demand for a human king during a crisis."
    },
    {
      "pk": 30701213,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 13,
      "text": "Now here is the king whom you have chosen, for whom you have asked; and the LORD has set a king over you.",
      "links": "<a href='/AIV/9/10/24'>1 Sam. 10:24</a>",
      "comment": "Samuel reiterates God's concession in giving them a king."
    },
    {
      "pk": 30701214,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 14,
      "text": "If you will fear the LORD and serve Him and obey His voice, and not rebel against the command of the LORD, both you and the king who reigns over you will follow the LORD your God.",
      "links": "<a href='/AIV/3/26/3'>Lev. 26:3</a>; <a href='/AIV/5/28/1-2'>Deut. 28:1–2</a>",
      "comment": "Conditional blessing is stated; both king and people must remain faithful."
    },
    {
      "pk": 30701215,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 15,
      "text": "But if you will not obey the voice of the LORD, but rebel against the command of the LORD, then the hand of the LORD will be against you and your king.",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "Warning is given that disobedience will bring God's judgment."
    },
    {
      "pk": 30701216,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 16,
      "text": "Now therefore stand and see this great thing that the LORD will do before your eyes.",
      "links": "<a href='/AIV/2/14/13'>Ex. 14:13</a>",
      "comment": "Samuel announces a sign to confirm his message."
    },
    {
      "pk": 30701217,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 17,
      "text": "Is it not wheat harvest today? I will call to the LORD, and He will send thunder and rain, so that you may know and see that your wickedness is great, which you have done in the sight of the LORD by asking for a king for yourselves.\"",
      "links": "<a href='/AIV/9/8/7'>1 Sam. 8:7</a>; <a href='/AIV/16/13/22'>Neh. 13:22</a>",
      "comment": "Wheat harvest (dry season) – rain was a rare miracle, showing God's displeasure."
    },
    {
      "pk": 30701218,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 18,
      "text": "So Samuel called to the LORD, and the LORD sent thunder and rain that day; and all the people greatly feared the LORD and Samuel.",
      "links": "<a href='/AIV/2/9/23'>Ex. 9:23</a>",
      "comment": "God responds immediately to Samuel’s prayer."
    },
    {
      "pk": 30701219,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 19,
      "text": "All the people said to Samuel, \"Pray for your servants to the LORD your God, so that we do not die; for we have added to all our sins this evil, to ask for a king for ourselves.\"",
      "links": "<a href='/AIV/2/9/28'>Ex. 9:28</a>; <a href='/AIV/9/7/8'>1 Sam. 7:8</a>",
      "comment": "The people confess their sin and fear the LORD's judgment."
    },
    {
      "pk": 30701220,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 20,
      "text": "Samuel said to the people, \"Do not be afraid. You have done all this evil, yet do not turn aside from following the LORD, but serve the LORD with all your heart.",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>",
      "comment": "Despite their sin, Samuel encourages repentance and whole-hearted service."
    },
    {
      "pk": 30701221,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 21,
      "text": "And do not turn aside after empty things that cannot profit or deliver, for they are empty.",
      "links": "<a href='/AIV/24/2/5'>Jer. 2:5</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "\"Empty things\"—idols and false hopes."
    },
    {
      "pk": 30701222,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 22,
      "text": "For the LORD will not forsake His people, for His great name's sake, because it has pleased the LORD to make you His people.",
      "links": "<a href='/AIV/5/7/8'>Deut. 7:8</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "God’s covenant faithfulness is based on His own character and purpose."
    },
    {
      "pk": 30701223,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 23,
      "text": "As for me, far be it from me that I should sin against the LORD by ceasing to pray for you; but I will instruct you in the good and right way.",
      "links": "<a href='/AIV/9/7/5'>1 Sam. 7:5</a>; <a href='/AIV/24/42/4'>Jer. 42:4</a>",
      "comment": "Samuel defines intercessory prayer and teaching as his ongoing duty."
    },
    {
      "pk": 30701224,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 24,
      "text": "Only fear the LORD and serve Him faithfully with all your heart; for consider what great things He has done for you.",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>; <a href='/AIV/9/11/13'>1 Sam. 11:13</a>",
      "comment": "The closing exhortation returns to the theme of whole-hearted service."
    },
    {
      "pk": 30701225,
      "translation": "AIV",
      "book": 9,
      "chapter": 12,
      "verse": 25,
      "text": "But if you still do wickedly, you will be swept away, both you and your king.\"",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>",
      "comment": "Final warning: consequences for persistent disobedience."
    }
  ],
  "translatedAt": "2025-12-22T08:30:04.295Z"
}