{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 15,
  "verses": [
    {
      "pk": 1501501,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 1,
      "text": "Samuel said to Saul, “The LORD sent me to anoint you king over his people Israel. Now listen to the words of the LORD.",
      "links": "<a href='/AIV/9/10/1'>1 Sam. 10:1</a>",
      "comment": "The phrase 'listen to the words of the LORD' is a direct call to obedience, as seen throughout the Torah."
    },
    {
      "pk": 1501502,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 2,
      "text": "This is what the LORD of Hosts says: ‘I remember what Amalek did to Israel, how he opposed them on the way when they came up out of Egypt.",
      "links": "<a href='/AIV/2/17/8-16'>Exod. 17:8–16</a>; <a href='/AIV/5/25/17-19'>Deut. 25:17–19</a>",
      "comment": "'LORD of Hosts' renders YHWH Tseva'ot, a title for God often referencing his command over armies."
    },
    {
      "pk": 1501503,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 3,
      "text": "Now go and strike Amalek and completely destroy all that they have. Do not spare them; put to death both man and woman, child and infant, ox and sheep, camel and donkey.’”",
      "links": "<a href='/AIV/5/13/15'>Deut. 13:15</a>",
      "comment": "‘Completely destroy’ translates the Hebrew 'herem', meaning to devote to destruction."
    },
    {
      "pk": 1501504,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 4,
      "text": "So Saul summoned the people and counted them at Telaim: two hundred thousand foot soldiers, and ten thousand men of Judah.",
      "links": "<a href='/AIV/7/20/2'>Judg. 20:2</a>",
      "comment": "Some manuscripts have 'Telaim'; a few read 'Telam'."
    },
    {
      "pk": 1501505,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 5,
      "text": "Saul came to the city of Amalek and lay in wait in the valley.",
      "links": "<a href='/AIV/9/27/8'>1 Sam. 27:8</a>",
      "comment": "‘City of Amalek’ could refer to a chief city of the Amalekites, precise location unknown."
    },
    {
      "pk": 1501506,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 6,
      "text": "Saul said to the Kenites, “Go, leave, get away from among the Amalekites, lest I destroy you with them. You showed kindness to all the Israelites when they came up out of Egypt.” So the Kenites departed from among the Amalekites.",
      "links": "<a href='/AIV/2/18/9-12'>Exod. 18:9–12</a>; <a href='/AIV/4/24/21'>Num. 24:21</a>; <a href='/AIV/7/1/16'>Judg. 1:16</a>",
      "comment": "The Kenites are spared because of their association with Moses’ father-in-law."
    },
    {
      "pk": 1501507,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 7,
      "text": "Saul struck the Amalekites, from Havilah as far as Shur, which is east of Egypt.",
      "links": "<a href='/AIV/1/25/18'>Gen. 25:18</a>",
      "comment": "'From Havilah as far as Shur' describes the extent of Saul's campaign."
    },
    {
      "pk": 1501508,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 8,
      "text": "He took Agag king of the Amalekites alive and completely destroyed all the people with the sword.",
      "links": "<a href='/AIV/9/27/8'>1 Sam. 27:8</a>",
      "comment": "'Completely destroyed' is the same Hebrew word as in verse 3."
    },
    {
      "pk": 1501509,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 9,
      "text": "But Saul and the people spared Agag, and the best of the sheep, the cattle, the fattened calves, the lambs, and all that was good. They were unwilling to completely destroy them. But everything that was despised and worthless, that they destroyed.",
      "links": "<a href='/AIV/9/15/3'>1 Sam. 15:3</a>",
      "comment": "Highlights Saul's selective obedience, sparing what he found valuable."
    },
    {
      "pk": 1501510,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 10,
      "text": "Then the word of the LORD came to Samuel:",
      "links": "<a href='/AIV/9/3/1'>1 Sam. 3:1</a>",
      "comment": "'The word of the LORD' indicates direct prophetic revelation."
    },
    {
      "pk": 1501511,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 11,
      "text": "“I regret that I have made Saul king, for he has turned away from following me and has not carried out my commands.” Samuel was angry, and he cried out to the LORD all night.",
      "links": "<a href='/AIV/1/6/6'>Gen. 6:6</a>; <a href='/AIV/9/13/13'>1 Sam. 13:13</a>",
      "comment": "'Regret' is the Hebrew 'nacham', which implies grief or sorrow, not a change of divine nature."
    },
    {
      "pk": 1501512,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 12,
      "text": "Early in the morning Samuel got up to meet Saul. Someone told Samuel, “Saul went to Carmel, and look, he has set up a monument for himself and has turned and passed on, and gone down to Gilgal.”",
      "links": "<a href='/AIV/6/15/7'>Josh. 15:55</a>; <a href='/AIV/9/11/14'>1 Sam. 11:14–15</a>",
      "comment": "Saul’s monument indicates pride; Gilgal was where he was first confirmed as king."
    },
    {
      "pk": 1501513,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 13,
      "text": "When Samuel came to Saul, Saul said to him, “Blessed are you by the LORD! I have carried out the command of the LORD.”",
      "links": "<a href='/AIV/7/17/2'>Judg. 17:2</a>",
      "comment": "Saul’s greeting assumes approval from Samuel and God."
    },
    {
      "pk": 1501514,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 14,
      "text": "But Samuel said, “Then what is this bleating of sheep in my ears and the lowing of the cattle that I hear?”",
      "links": "",
      "comment": "Samuel exposes Saul's disobedience by referring to the sounds of spared animals."
    },
    {
      "pk": 1501515,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 15,
      "text": "Saul said, “They have brought them from the Amalekites; for the people spared the best of the sheep and of the cattle, to sacrifice to the LORD your God, and the rest we have completely destroyed.”",
      "links": "<a href='/AIV/9/15/21'>1 Sam. 15:21</a>",
      "comment": "Saul shifts blame to the people and rationalizes disobedience as for worship."
    },
    {
      "pk": 1501516,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 16,
      "text": "Then Samuel said to Saul, “Stop! I will tell you what the LORD said to me last night.” Saul said to him, “Say it.”",
      "links": "",
      "comment": "Samuel interrupts Saul in order to deliver God’s pronouncement."
    },
    {
      "pk": 1501517,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 17,
      "text": "And Samuel said, “Though you are little in your own eyes, are you not the head of the tribes of Israel? The LORD anointed you king over Israel.",
      "links": "<a href='/AIV/9/9/21'>1 Sam. 9:21</a>; <a href='/AIV/9/10/1'>1 Sam. 10:1</a>",
      "comment": "Samuel recalls Saul’s earlier humility at his choosing."
    },
    {
      "pk": 1501518,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 18,
      "text": "And the LORD sent you on a mission and said, ‘Go, and completely destroy the sinners, the Amalekites, and fight against them until they are consumed.’",
      "links": "<a href='/AIV/9/15/3'>1 Sam. 15:3</a>",
      "comment": "The Amalekites are explicitly called ‘sinners’."
    },
    {
      "pk": 1501519,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 19,
      "text": "Why then did you not obey the voice of the LORD? Why did you pounce on the spoil and do what was evil in the sight of the LORD?”",
      "links": "",
      "comment": "Key: Not only did Saul disobey, but he actively desired the forbidden spoils."
    },
    {
      "pk": 1501520,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 20,
      "text": "Saul said to Samuel, “I have obeyed the voice of the LORD. I have gone on the mission the LORD sent me. I have brought Agag the king of Amalek, and I have completely destroyed the Amalekites.",
      "links": "",
      "comment": "Saul insists he obeyed, but his actions contradict his claim."
    },
    {
      "pk": 1501521,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 21,
      "text": "But the people took of the spoil, sheep and cattle, the best of the devoted things, to sacrifice to the LORD your God in Gilgal.”",
      "links": "<a href='/AIV/9/13/9'>1 Sam. 13:9</a>; <a href='/AIV/9/15/15'>1 Sam. 15:15</a>",
      "comment": "Saul again shifts blame to the people and appeals to religious motives."
    },
    {
      "pk": 1501522,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 22,
      "text": "And Samuel said, “Does the LORD delight in burnt offerings and sacrifices as much as in obeying the voice of the LORD? Look, to obey is better than sacrifice, and to listen than the fat of rams.",
      "links": "<a href='/AIV/19/51/16-17'>Ps. 51:16–17</a>; <a href='/AIV/23/1/11-17'>Isa. 1:11–17</a>; <a href='/AIV/28/6/6'>Hos. 6:6</a>; <a href='/AIV/33/6/6-8'>Mic. 6:6–8</a>",
      "comment": "Emphasizes that God values obedience over ritual."
    },
    {
      "pk": 1501523,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 23,
      "text": "For rebellion is as the sin of divination, and stubbornness is as iniquity and idolatry. Because you have rejected the word of the LORD, he has also rejected you from being king.”",
      "links": "<a href='/AIV/9/13/14'>1 Sam. 13:14</a>",
      "comment": "Stubbornness and rebellion equated with occult practices and false worship."
    },
    {
      "pk": 1501524,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 24,
      "text": "Saul said to Samuel, “I have sinned, for I have transgressed the command of the LORD and your words, because I feared the people and obeyed their voice.",
      "links": "",
      "comment": "Saul confesses and admits fear of men, but too late."
    },
    {
      "pk": 1501525,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 25,
      "text": "Now therefore, please pardon my sin and return with me, so that I may worship the LORD.”",
      "links": "",
      "comment": "Saul desires Samuel’s presence more than true repentance."
    },
    {
      "pk": 1501526,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 26,
      "text": "But Samuel said to Saul, “I will not return with you. For you have rejected the word of the LORD, and the LORD has rejected you from being king over Israel.”",
      "links": "<a href='/AIV/16/2/3'>Neh. 2:3</a>;",
      "comment": "Samuel refuses to endorse Saul’s kingship; God's rejection is final."
    },
    {
      "pk": 1501527,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 27,
      "text": "As Samuel turned to go away, Saul seized the edge of his robe, and it tore.",
      "links": "<a href='/AIV/11/11/30'>1 Kgs. 11:30</a>",
      "comment": "Tearing of garment symbolizes loss of kingdom—see also Solomon's kingdom division."
    },
    {
      "pk": 1501528,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 28,
      "text": "Samuel said to him, “The LORD has torn the kingdom of Israel from you today and has given it to a neighbor of yours, who is better than you.",
      "links": "<a href='/AIV/9/28/17'>1 Sam. 28:17</a>; <a href='/AIV/9/13/14'>1 Sam. 13:14</a>",
      "comment": "'Neighbor' in the Old Testament usually refers to someone in the same nation—here likely David."
    },
    {
      "pk": 1501529,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 29,
      "text": "The Glory of Israel will not lie or change his mind; for he is not a man, that he should change his mind.”",
      "links": "<a href='/AIV/4/23/19'>Num. 23:19</a>",
      "comment": "'Glory of Israel' is a unique reference to God's character."
    },
    {
      "pk": 1501530,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 30,
      "text": "Then he said, “I have sinned; yet honor me now before the elders of my people and before Israel, and return with me, so that I may worship the LORD your God.”",
      "links": "",
      "comment": "Saul is more concerned with public appearance than repentance."
    },
    {
      "pk": 1501531,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 31,
      "text": "So Samuel turned back after Saul, and Saul worshiped the LORD.",
      "links": "",
      "comment": "Samuel relents to Saul’s request for the sake of public order."
    },
    {
      "pk": 1501532,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 32,
      "text": "Then Samuel said, “Bring here to me Agag the king of the Amalekites.” And Agag came to him cheerfully. Agag said, “Surely the bitterness of death is past.”",
      "links": "",
      "comment": "'Cheerfully' renders the Hebrew word for self-assuredness or relief."
    },
    {
      "pk": 1501533,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 33,
      "text": "But Samuel said, “As your sword has made women childless, so shall your mother be childless among women.” And Samuel hacked Agag to pieces before the LORD in Gilgal.",
      "links": "",
      "comment": "Samuel personally executes justice that Saul failed to carry out."
    },
    {
      "pk": 1501534,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 34,
      "text": "Then Samuel went to Ramah, and Saul went up to his house at Gibeah of Saul.",
      "links": "<a href='/AIV/9/7/17'>1 Sam. 7:17</a>",
      "comment": "This marks the separation between Samuel and Saul."
    },
    {
      "pk": 1501535,
      "translation": "AIV",
      "book": 9,
      "chapter": 15,
      "verse": 35,
      "text": "Samuel did not see Saul again until the day of his death, but Samuel grieved over Saul. And the LORD regretted that he had made Saul king over Israel.",
      "links": "<a href='/AIV/9/15/11'>1 Sam. 15:11</a>",
      "comment": "'Regretted' again uses 'nacham'; see comments on verse 11. The separation is not only physical but also spiritual."
    }
  ],
  "translatedAt": "2025-12-22T08:31:49.249Z"
}