{
  "book": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 13,
  "verses": [
    {
      "pk": 130001,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 1,
      "text": "Saul was thirty years old when he became king, and he reigned over Israel for forty-two years.",
      "links": "<a href='/AIV/44/13/21'>Acts 13:21</a>",
      "comment": "The original Hebrew of this verse is uncertain and has missing numbers. Many translations supply numbers based on Acts 13:21. See also NIV, ESV footnotes."
    },
    {
      "pk": 130002,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 2,
      "text": "Saul chose three thousand men of Israel. Two thousand were with Saul in Michmash and in the hill country of Bethel, and a thousand were with Jonathan at Gibeah of Benjamin. The rest of the people he sent home, each to his tent.",
      "links": "<a href='/AIV/9/14/1'>1 Sam. 14:1</a>",
      "comment": "The division of troops is consistent with the Masoretic text."
    },
    {
      "pk": 130003,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 3,
      "text": "Jonathan attacked the garrison of the Philistines that was at Geba, and the Philistines heard about it. Saul blew the trumpet throughout all the land, saying, \"Let the Hebrews hear.\"",
      "links": "<a href='/AIV/9/14/5'>1 Sam. 14:5</a>",
      "comment": "Hebrew 'blew the trumpet' was a call to arms throughout Israel."
    },
    {
      "pk": 130004,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 4,
      "text": "All Israel heard it said that Saul had attacked the Philistines’ garrison, and also that Israel had become a stench to the Philistines. And the people were called together to Saul at Gilgal.",
      "links": "<a href='/AIV/9/14/52'>1 Sam. 14:52</a>",
      "comment": "‘A stench’ means to be highly offensive or odious."
    },
    {
      "pk": 130005,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 5,
      "text": "The Philistines gathered to fight against Israel, with thirty thousand chariots, six thousand horsemen, and troops like the sand on the seashore in number. They came up and encamped at Michmash, east of Beth-aven.",
      "links": "<a href='/AIV/7/7/12'>Judg. 7:12</a>",
      "comment": "The number 'thirty thousand chariots' is likely a scribal error. Ancient armies had far fewer chariots; see commentaries."
    },
    {
      "pk": 130006,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 6,
      "text": "When the men of Israel saw that they were in trouble, for the people were hard pressed, they hid themselves in caves, holes, rocks, tombs, and cisterns.",
      "links": "<a href='/AIV/9/14/11'>1 Sam. 14:11</a>",
      "comment": "Describes the desperate condition of the Israelites."
    },
    {
      "pk": 130007,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 7,
      "text": "Some of the Hebrews crossed the Jordan to the land of Gad and Gilead. Saul was still at Gilgal, and all the people followed him, trembling.",
      "links": "<a href='/AIV/9/10/8'>1 Sam. 10:8</a>",
      "comment": "Shows fear and dispersal among the Israelites."
    },
    {
      "pk": 130008,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 8,
      "text": "He waited seven days, according to the time set by Samuel, but Samuel did not come to Gilgal, and the people began to scatter from him.",
      "links": "<a href='/AIV/9/10/8'>1 Sam. 10:8</a>",
      "comment": "Refers back to the command given in 1 Sam 10:8."
    },
    {
      "pk": 130009,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 9,
      "text": "So Saul said, \"Bring the burnt offering and the peace offerings here to me.\" And he offered the burnt offering.",
      "links": "<a href='/AIV/9/15/9'>1 Sam. 15:9</a>",
      "comment": "Saul was not authorized to offer sacrifices as king; this was the role of the priest or prophet."
    },
    {
      "pk": 130010,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 10,
      "text": "Just as he finished offering the burnt offering, Samuel arrived. Saul went out to greet him.",
      "links": "<a href='/AIV/9/15/13'>1 Sam. 15:13</a>",
      "comment": "Samuel arrives immediately after Saul’s unlawful action."
    },
    {
      "pk": 130011,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 11,
      "text": "Samuel said, \"What have you done?\" Saul said, \"When I saw that the people were scattering from me, and you did not come within the appointed days, and that the Philistines were assembling at Michmash,",
      "links": "<a href='/AIV/9/15/14'>1 Sam. 15:14</a>",
      "comment": "Saul tries to justify his actions with the circumstances."
    },
    {
      "pk": 130012,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 12,
      "text": "\"I thought, 'Now the Philistines will come down against me at Gilgal, and I have not sought the favor of the LORD.' So I forced myself and offered the burnt offering.\"",
      "links": "<a href='/AIV/9/15/21'>1 Sam. 15:21</a>",
      "comment": "Saul says he 'forced himself,' indicating reluctance but self-justification."
    },
    {
      "pk": 130013,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 13,
      "text": "Samuel said to Saul, \"You have acted foolishly. You have not kept the command of the LORD your God that he gave you. For now the LORD would have established your kingdom over Israel forever;",
      "links": "<a href='/AIV/9/15/19'>1 Sam. 15:19</a>; <a href='/AIV/9/2/30'>1 Sam. 2:30</a>",
      "comment": "Indicates the loss of Saul's dynastic promise due to disobedience."
    },
    {
      "pk": 130014,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 14,
      "text": "but now your kingdom will not continue. The LORD has sought a man after his own heart, and the LORD has commanded him to be prince over his people, because you have not kept what the LORD commanded you.\"",
      "links": "<a href='/AIV/9/16/13'>1 Sam. 16:13</a>; <a href='/AIV/44/13/22'>Acts 13:22</a>",
      "comment": "The phrase 'a man after his own heart' is retained as in the Hebrew text."
    },
    {
      "pk": 130015,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 15,
      "text": "And Samuel rose up and went from Gilgal to Gibeah of Benjamin. Saul counted the people who were present with him, about six hundred men.",
      "links": "<a href='/AIV/9/14/2'>1 Sam. 14:2</a>",
      "comment": "The drop in numbers shows how few remained with Saul."
    },
    {
      "pk": 130016,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 16,
      "text": "Saul and Jonathan his son, and the people present with them, stayed in Gibeah of Benjamin, but the Philistines camped at Michmash.",
      "links": "<a href='/AIV/9/14/5'>1 Sam. 14:5</a>",
      "comment": "The camps are set for the coming battle."
    },
    {
      "pk": 130017,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 17,
      "text": "And raiding parties came out from the Philistine camp in three groups. One group turned toward Ophrah, to the land of Shual;",
      "links": "<a href='/AIV/9/14/15'>1 Sam. 14:15</a>",
      "comment": "Shows strategic movement of Philistine detachments."
    },
    {
      "pk": 130018,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 18,
      "text": "another group turned toward Beth-horon; and the third group turned toward the border that overlooks the Valley of Zeboim, facing the wilderness.",
      "links": "<a href='/AIV/9/6/9'>1 Sam. 6:9</a>",
      "comment": "These are geographical references to surrounding areas."
    },
    {
      "pk": 130019,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 19,
      "text": "Now there was no blacksmith to be found throughout all the land of Israel, for the Philistines said, \"Otherwise the Hebrews will make swords or spears.\"",
      "links": "<a href='/AIV/9/13/22'>1 Sam. 13:22</a>",
      "comment": "Philistines controlled weapon production to keep the Israelites weak."
    },
    {
      "pk": 130020,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 20,
      "text": "So all Israel had to go down to the Philistines to sharpen each one's plowshare, mattock, axe, or sickle.",
      "links": "<a href='/AIV/9/13/21'>1 Sam. 13:21</a>",
      "comment": "Israelites depended on Philistines for agricultural tools."
    },
    {
      "pk": 130021,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 21,
      "text": "And the charge was a third of a shekel for the plowshares and for the mattocks, and for the forks and axes, and to fix the goads.",
      "links": "<a href='/AIV/9/13/19'>1 Sam. 13:19</a>",
      "comment": "The text about pricing is obscure; some versions translate as sharpening fee."
    },
    {
      "pk": 130022,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 22,
      "text": "So on the day of battle, neither sword nor spear was found in the hand of any of the people who were with Saul and Jonathan, but only Saul and Jonathan his son had them.",
      "links": "<a href='/AIV/9/14/1'>1 Sam. 14:1</a>",
      "comment": "Shows the degree of Israel’s vulnerability and dependence."
    },
    {
      "pk": 130023,
      "translation": "AIV",
      "book": 9,
      "chapter": 13,
      "verse": 23,
      "text": "And a garrison of the Philistines went out to the pass of Michmash.",
      "links": "<a href='/AIV/9/14/4'>1 Sam. 14:4</a>",
      "comment": "Sets up the events of the next chapter's battle."
    }
  ],
  "translatedAt": "2025-12-22T08:30:26.998Z"
}