{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 8,
  "verses": [
    {
      "pk": 9008001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 1,
      "text": "When Samuel grew old, he appointed his sons as judges over Israel.",
      "links": "<a href='/AIV/9/12/2'>1Sam 12:2</a>",
      "comment": "Samuel's leadership transitions, with his sons taking roles of authority. This reveals the hereditary aspects of some leadership, but unlike later kings, judges did not have royal continuity."
    },
    {
      "pk": 9008002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 2,
      "text": "The name of his firstborn was Joel, and the name of his second was Abijah; they judged in Beersheba.",
      "links": "<a href='/AIV/9/1/1-3'>1Sam 1:1-3</a>; <a href='/AIV/13/6/28'>1Chr 6:28</a>",
      "comment": "Naming the sons and their seat of judgment shows the importance of family and location in biblical governance."
    },
    {
      "pk": 9008003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 3,
      "text": "But his sons did not walk in his ways. They turned aside after dishonest gain, took bribes, and perverted justice.",
      "links": "<a href='/AIV/2/18/21'>Ex. 18:21</a>; <a href='/AIV/5/16/19'>Deut. 16:19</a>",
      "comment": "The corruption of leaders is a recurring biblical warning, highlighting that righteousness is necessary for just rule (<a href='/AIV/19/82/2'>Ps. 82:2</a>). Spiritual leadership is best preserved when passed with care and discernment, echoing the call to apostolic succession."
    },
    {
      "pk": 9008004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 4,
      "text": "Then all the elders of Israel gathered together and came to Samuel at Ramah.",
      "links": "<a href='/AIV/9/7/17'>1Sam 7:17</a>",
      "comment": "The elders act in unison, signaling significant leadership and the importance of unified counsel in the community of faith."
    },
    {
      "pk": 9008005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 5,
      "text": "They said to him, 'You are old, and your sons do not walk in your ways. Now appoint for us a king to judge us, like all the nations.'",
      "links": "<a href='/AIV/5/17/14'>Deut. 17:14</a>; <a href='/AIV/9/12/12'>1Sam 12:12</a>",
      "comment": "Israel's desire for a king parallels the nations, reflecting a tension between divine kingship and human authority. This foreshadows the longing for a righteous and everlasting King, fulfilled in Christ."
    },
    {
      "pk": 9008006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 6,
      "text": "But the thing displeased Samuel when they said, 'Give us a king to judge us.' So Samuel prayed to the LORD.",
      "links": "<a href='/AIV/9/10/19'>1Sam 10:19</a>; <a href='/AIV/19/106/15'>Ps. 106:15</a>",
      "comment": "Samuel’s response of prayer models seeking God’s will in difficult situation. Consulting God remains the pattern for all faithful leadership."
    },
    {
      "pk": 9008007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 7,
      "text": "And the LORD said to Samuel, 'Listen to the voice of the people in all that they say to you, for they have not rejected you, but they have rejected Me from being king over them.'",
      "links": "<a href='/AIV/9/10/19'>1Sam 10:19</a>; <a href='/AIV/9/12/12'>1Sam 12:12</a>",
      "comment": "Here, God’s kingship is contrasted with human rule. The rejection of divine kingship has later spiritual echoes in Christ’s rejection by many (<a href='/AIV/43/19/15'>John 19:15</a>)."
    },
    {
      "pk": 9008008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 8,
      "text": "According to all the works which they have done since the day that I brought them up out of Egypt to this day, by forsaking Me and serving other gods, so they are doing to you also.",
      "links": "<a href='/AIV/2/32/1-8'>Ex. 32:1-8</a>; <a href='/AIV/7/2/12'>Judg. 2:12</a>",
      "comment": "The people’s unfaithfulness is an ongoing theme. This is a reminder of the need for continual renewal and steadfastness in the faith community."
    },
    {
      "pk": 9008009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 9,
      "text": "Now then, listen to their voice; but solemnly warn them and show them the kind of king who will reign over them.",
      "links": "<a href='/AIV/5/17/14-20'>Deut. 17:14-20</a>",
      "comment": "God allows human choice but provides guidance and warnings. Authority on earth is to serve God’s will, a truth that shapes later understanding of church leadership."
    },
    {
      "pk": 9008010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 10,
      "text": "So Samuel told all the words of the LORD to the people who were asking for a king.",
      "links": "<a href='/AIV/9/3/18'>1Sam 3:18</a>",
      "comment": "Samuel acts as faithful prophet, declaring God’s word, modeling obedience—a foreshadowing of the necessity of sacred guidance in the community."
    },
    {
      "pk": 9008011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 11,
      "text": "He said, 'This will be the manner of the king who will reign over you: He will take your sons and appoint them for himself as his chariots and horsemen, and they will run before his chariots.'",
      "links": "<a href='/AIV/5/17/16'>Deut. 17:16</a>",
      "comment": "Kingship brings demands, including militarization. These warnings illustrate the cost of worldly authority, stirring longing for the Perfect King who lays down His life for His people."
    },
    {
      "pk": 9008012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 12,
      "text": "He will appoint them as commanders over thousands and fifties, to plow his ground and reap his harvest, and to make his weapons of war and equipment for his chariots.",
      "links": "<a href='/AIV/9/14/52'>1Sam 14:52</a>",
      "comment": "Human kingship leads to conscription and labor. True kingship, modeled by Jesus, invites voluntary service and self-giving."
    },
    {
      "pk": 9008013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 13,
      "text": "He will take your daughters to be perfumers, cooks, and bakers.",
      "links": "",
      "comment": "Worldly rulers claim the gifts and talents of the people for their own purposes. The Church, by contrast, calls every talent into service for the good of the whole Body (cf. <a href='/AIV/46/12/12'>1Cor 12:12</a>)."
    },
    {
      "pk": 9008014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 14,
      "text": "He will take the best of your fields, your vineyards, and your olive groves, and give them to his servants.",
      "links": "<a href='/AIV/11/21/7-15'>1Ki 21:7-15</a>",
      "comment": "The king will redistribute wealth, not always justly. This warns of the dangers of unchecked power, showing the need for justice and righteousness in godly leadership."
    },
    {
      "pk": 9008015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 15,
      "text": "He will take a tenth of your grain and your vineyards and give it to his officials and servants.",
      "links": "<a href='/AIV/1/47/24'>Gen 47:24</a>",
      "comment": "The king demands a tithe, paralleling the offerings due to God (<a href='/AIV/3/27/30'>Lev 27:30</a>). This sets up a tension—do offerings go to God, or to earthly power?"
    },
    {
      "pk": 9008016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 16,
      "text": "He will take your male and female servants, the best of your young men, and your donkeys, and put them to his work.",
      "links": "",
      "comment": "Earthly authority claims service and resources. In contrast, true spiritual authority gathers the community to serve God and others, not merely a worldly leader."
    },
    {
      "pk": 9008017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 17,
      "text": "He will take a tenth of your flocks, and you will become his slaves.",
      "links": "",
      "comment": "The sum of these warnings is servitude under human kings rather than divine kingship. Jesus, as the Good Shepherd, leads not as a tyrant but as one who lays down His life (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 9008018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 18,
      "text": "In that day you will cry out because of your king whom you have chosen for yourselves, but the LORD will not answer you in that day.",
      "links": "<a href='/AIV/7/10/13-14'>Judg 10:13-14</a>",
      "comment": "Ignoring divine counsel leads to suffering. Yet God’s mercy is always available for those who repent and return to Him (<a href='/AIV/19/34/17'>Ps. 34:17</a>)."
    },
    {
      "pk": 9008019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 19,
      "text": "But the people refused to listen to the voice of Samuel. They said, 'No! But there shall be a king over us,'",
      "links": "<a href='/AIV/9/10/19'>1Sam 10:19</a>",
      "comment": "Despite warnings, Israel insists on a king. This human willfulness is an ongoing spiritual theme, underscoring obedience to God’s chosen order."
    },
    {
      "pk": 9008020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 20,
      "text": "'so that we also may be like all the nations, and that our king may judge us and go out before us and fight our battles.'",
      "links": "<a href='/AIV/9/12/12'>1Sam 12:12</a>",
      "comment": "Israel wanted to look like other nations, but God's people are called to be set apart. The request anticipates the desire for a messianic deliverer (<a href='/AIV/23/9/6-7'>Isa. 9:6-7</a>)."
    },
    {
      "pk": 9008021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 21,
      "text": "And when Samuel heard all the words of the people, he repeated them in the hearing of the LORD.",
      "links": "",
      "comment": "Samuel acts as true intercessor, bringing the people's words to God, echoing the prophetic and mediatorial ministry carried to completion by Christ."
    },
    {
      "pk": 9008022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 8,
      "verse": 22,
      "text": "And the LORD said to Samuel, 'Listen to their voice and appoint a king for them.' So Samuel said to the men of Israel, 'Every man go back to his city.'",
      "links": "<a href='/AIV/9/10/24'>1Sam 10:24</a>",
      "comment": "Ultimately, God allows Israel’s request, respecting human freedom but not abandoning His people. This passage reminds us that God's providence continues even when His people reject His immediate will, ultimately preparing for the true King, Jesus."
    }
  ],
  "translatedAt": "2025-12-24T02:52:46.464Z"
}