{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 17,
  "verses": [
    {
      "pk": 9017001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 1,
      "text": "Now the Philistines gathered their armies for battle, and they assembled at Socoh, which belongs to Judah, and they camped between Socoh and Azekah, in Ephes Dammim.",
      "links": "<a href='/AIV/13/11/13'>1 Chr. 11:13</a>; <a href='/AIV/9/7/12'>1Sam 7:12</a>",
      "comment": "The setting places the Philistines deep into Israelite territory, showing the severity of the threat. Socoh and Azekah are key locations in Judah, emphasizing the real historical context."
    },
    {
      "pk": 9017002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 2,
      "text": "And Saul and the men of Israel assembled and camped in the Valley of Elah; they prepared themselves for battle against the Philistines.",
      "links": "<a href='/AIV/9/13/4'>1Sam 13:4</a>",
      "comment": "Saul is leading Israel’s army, reminding readers of his kingly role. The Valley of Elah becomes the famous location for David’s victory."
    },
    {
      "pk": 9017003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 3,
      "text": "And the Philistines stood on the mountain on one side, and Israel stood on the mountain on the other side, with the valley between them.",
      "links": "<a href='/AIV/10/23/14'>2 Sam 23:14</a>",
      "comment": "This detail reflects the tension and separation between the opposing forces—classic setup for the coming duel."
    },
    {
      "pk": 9017004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 4,
      "text": "Then a champion came out from the camp of the Philistines, named Goliath, from Gath, whose height was six cubits and a span.",
      "links": "<a href='/AIV/13/20/6'>1 Chr. 20:6</a>; <a href='/AIV/9/21/9'>1Sam 21:9</a>",
      "comment": "Goliath’s intimidating physical stature sets up the story’s dramatic tension. 'Six cubits and a span' is approximately nine and a half feet tall—a literal giant."
    },
    {
      "pk": 9017005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 5,
      "text": "He wore a helmet of bronze on his head, and he was clothed with a coat of scale armor weighing five thousand shekels of bronze.",
      "links": "<a href='/AIV/14/26/14'>2 Chr. 26:14</a>",
      "comment": "The description of Goliath's armor emphasizes his readiness for battle and increases the sense of invincibility in the narrative."
    },
    {
      "pk": 9017006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 6,
      "text": "He had bronze armor on his legs, and a javelin of bronze slung between his shoulders.",
      "links": "<a href='/AIV/9/17/45'>1Sam 17:45</a>",
      "comment": "Every detail about Goliath contributes to the overwhelming challenge Israel faces. The focus on his weapons recalls the ancient power of physical strength and military might."
    },
    {
      "pk": 9017007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 7,
      "text": "The shaft of his spear was like a weaver’s beam, and the head of his spear weighed six hundred shekels of iron. And his shield bearer went before him.",
      "links": "<a href='/AIV/9/21/9'>1Sam 21:9</a>",
      "comment": "This detailed image adds weight to the physical might of Goliath and magnifies David’s faith and courage."
    },
    {
      "pk": 9017008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 8,
      "text": "He stood and called out to the army of Israel, saying to them, 'Why have you come to draw up for battle? Am I not a Philistine, and are you not servants of Saul? Choose a man for yourselves, and let him come down to me.'",
      "links": "<a href='/AIV/9/17/10'>1Sam 17:10</a>",
      "comment": "Goliath’s challenge sets the stage for the personal contest—one man as representative, which foreshadows themes of mediation and representation in salvation history."
    },
    {
      "pk": 9017009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 9,
      "text": "'If he is able to fight with me and kill me, then we will be your slaves. But if I prevail against him and kill him, then you will be our slaves and serve us.'",
      "links": "<a href='/AIV/2/14/9'>Ex 14:9</a>",
      "comment": "The winner-takes-all proposal is reminiscent of covenantal binding actions. The outcome will affect all Israel and Philistia—a sign of corporate mediation."
    },
    {
      "pk": 9017010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 10,
      "text": "And the Philistine said, 'Today I defy the armies of Israel! Give me a man, that we may fight each other.'",
      "links": "<a href='/AIV/9/17/25'>1Sam 17:25</a>",
      "comment": "Goliath’s defiance is a direct challenge to the authority of Israel—and ultimately to Israel’s God. The challenge goes beyond military power to spiritual loyalty."
    },
    {
      "pk": 9017011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 11,
      "text": "When Saul and all Israel heard these words of the Philistine, they were dismayed and greatly afraid.",
      "links": "<a href='/AIV/5/7/9'>Deut 7:9</a>",
      "comment": "Israel’s fear highlights the need for a deliverer—one who would trust in God rather than military power. This points forward to later themes of faith over fear."
    },
    {
      "pk": 9017012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 12,
      "text": "Now David was the son of that Ephrathite from Bethlehem in Judah, named Jesse, who had eight sons. Jesse was old in the days of Saul and advanced in years among men.",
      "links": "<a href='/AIV/8/4/17'>Ruth 4:17</a>; <a href='/AIV/40/1/6'>Mt 1:6</a>",
      "comment": "David is introduced, and his lineage established: he is from Bethlehem, foreshadowing Christ’s birth in the same city. This link is messianic and christological."
    },
    {
      "pk": 9017013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 13,
      "text": "The three oldest sons of Jesse had followed Saul to the battle. And the names of his three sons who went to the battle were Eliab the firstborn, the second Abinadab, and the third Shammah.",
      "links": "<a href='/AIV/9/16/6'>1Sam 16:6</a>",
      "comment": "Naming the three eldest sons ties to 1 Samuel 16 and highlights David’s youth—the unlikely hero."
    },
    {
      "pk": 9017014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 14,
      "text": "David was the youngest, and the three oldest had followed Saul.",
      "links": "<a href='/AIV/9/16/11'>1Sam 16:11</a>",
      "comment": "David’s status as the youngest reinforces the theme that God often chooses unlikely candidates for His purposes."
    },
    {
      "pk": 9017015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 15,
      "text": "But David went back and forth from Saul to feed his father’s sheep at Bethlehem.",
      "links": "<a href='/AIV/9/16/19'>1Sam 16:19</a>",
      "comment": "David’s humility and responsibility as a shepherd are highlighted, underscoring the spiritual image of a shepherd king—seen in both David’s later rule and Jesus’ ministry."
    },
    {
      "pk": 9017016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 16,
      "text": "For forty days the Philistine came forward every morning and evening and took his stand.",
      "links": "<a href='/AIV/4/14/33'>Num 14:33</a>",
      "comment": "Forty days signifies a period of testing and preparation throughout the Bible, as with Moses, Elijah, and Jesus' forty days in the wilderness."
    },
    {
      "pk": 9017017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 17,
      "text": "Then Jesse said to his son David, 'Take now an ephah of this roasted grain and these ten loaves and carry them quickly to your brothers in the camp.'",
      "links": "<a href='/AIV/9/16/20'>1Sam 16:20</a>",
      "comment": "David is given bread to take to his brothers. The provision echoes bread as a sustaining gift, anticipating the Eucharistic imagery developed in later contexts."
    },
    {
      "pk": 9017018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 18,
      "text": "'Also take these ten cheeses to the commander of their thousand, and see if your brothers are well, and bring back something sure from them.'",
      "links": "<a href='/AIV/9/17/22'>1Sam 17:22</a>",
      "comment": "David functions as a messenger and provider, serving those in authority and his family. The act of bringing food is linked to hospitality and care for others."
    },
    {
      "pk": 9017019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 19,
      "text": "Now Saul and they and all the men of Israel were in the Valley of Elah, fighting with the Philistines.",
      "links": "<a href='/AIV/9/17/2'>1Sam 17:2</a>",
      "comment": "The continued mention of Saul and the army in the valley frames the battle as still unresolved—pointing toward the need for a champion."
    },
    {
      "pk": 9017020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 20,
      "text": "Early in the morning, David rose, left the sheep with a keeper, took the provisions, and went as Jesse had commanded him. He came to the encampment as the army was going out to battle, shouting for the fight.",
      "links": "<a href='/AIV/9/17/15'>1Sam 17:15</a>",
      "comment": "David’s obedience and preparation show a life of discipline and service—a model of spiritual humility."
    },
    {
      "pk": 9017021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 21,
      "text": "Israel and the Philistines drew up their lines, army against army.",
      "links": "<a href='/AIV/9/17/2'>1Sam 17:2</a>",
      "comment": "The repetition of the battle formation builds suspense—both armies ready for confrontation, but the decisive act is yet to come."
    },
    {
      "pk": 9017022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 22,
      "text": "David left his supplies in the care of the keeper of the supplies, ran to the ranks, and greeted his brothers.",
      "links": "<a href='/AIV/9/17/18'>1Sam 17:18</a>",
      "comment": "David’s concern for his brothers highlights familial bonds within Israel and personal duty."
    },
    {
      "pk": 9017023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 23,
      "text": "As he was talking with them, the champion, the Philistine from Gath named Goliath, came up from the lines of the Philistines and spoke the same words as before, and David heard them.",
      "links": "<a href='/AIV/9/17/1'>1Sam 17:1</a>",
      "comment": "David personally witnesses Goliath’s challenge—key for the story’s turning point."
    },
    {
      "pk": 9017024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 24,
      "text": "All the men of Israel, when they saw the man, fled from him and were very much afraid.",
      "links": "<a href='/AIV/7/6/13'>Judg 6:13</a>",
      "comment": "Fear dominates Israel’s response, but David’s approach will soon contrast this pervasive anxiety."
    },
    {
      "pk": 9017025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 25,
      "text": "The men of Israel said, 'Have you seen this man who has come up? Surely he has come to defy Israel. Whoever kills him, the king will enrich him with great wealth, will give him his daughter, and make his father’s house free in Israel.'",
      "links": "<a href='/AIV/9/18/20'>1Sam 18:20</a>",
      "comment": "Saul's promise motivates the men materially, but spiritual victory and God’s deliverance are yet to be seen. David, however, is motivated by a higher calling."
    },
    {
      "pk": 9017026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 26,
      "text": "David spoke to the men standing by him, saying, 'What shall be done for the man who kills this Philistine and removes this disgrace from Israel? For who is this uncircumcised Philistine, that he should defy the armies of the living God?'",
      "links": "<a href='/AIV/9/14/6'>1Sam 14:6</a>; <a href='/AIV/9/17/36'>1Sam 17:36</a>",
      "comment": "David emphasizes spiritual honor rather than material gain. His invocation of 'the living God' echoes a high theology of divine presence and fidelity."
    },
    {
      "pk": 9017027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 27,
      "text": "The people answered him the same way, 'So shall it be done for the man who kills him.'",
      "links": "<a href='/AIV/9/17/25'>1Sam 17:25</a>",
      "comment": "The people's response repeats Saul’s promise—still reflecting earthly motivation while foreshadowing David’s unique faith."
    },
    {
      "pk": 9017028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 28,
      "text": "Eliab, his oldest brother, heard David speaking with the men; and Eliab’s anger was kindled against David, and he said, 'Why did you come down here? With whom have you left those few sheep in the wilderness? I know your pride and the evil intent of your heart, for you came here just to see the battle.'",
      "links": "<a href='/AIV/9/16/6-7'>1Sam 16:6-7</a>",
      "comment": "Eliab’s rebuke mirrors human misunderstanding of divine calling. David’s heart, contrasting Eliab’s accusation, is pure and aligned with God’s will."
    },
    {
      "pk": 9017029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 29,
      "text": "And David said, 'What have I done now? Wasn’t it just a question?'",
      "links": "<a href='/AIV/9/16/12'>1Sam 16:12</a>",
      "comment": "David’s response shows humility and innocence—recalling earlier misunderstandings by his family."
    },
    {
      "pk": 9017030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 30,
      "text": "He turned away from him toward another and spoke the same way, and the people answered him again as before.",
      "links": "<a href='/AIV/9/17/27'>1Sam 17:27</a>",
      "comment": "David persists in his inquiry, undeterred by criticism—a sign of his spiritual resilience."
    },
    {
      "pk": 9017031,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 31,
      "text": "When the words that David spoke were heard, they were reported before Saul, and he sent for him.",
      "links": "<a href='/AIV/9/17/55'>1Sam 17:55</a>",
      "comment": "David’s words reach the king—a hint that true leadership and deliverance come from a heart orientated to God."
    },
    {
      "pk": 9017032,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 32,
      "text": "David said to Saul, 'Let no one lose heart because of him; your servant will go and fight with this Philistine.'",
      "links": "<a href='/AIV/9/17/45'>1Sam 17:45</a>; <a href='/AIV/40/14/27'>Matt 14:27</a>",
      "comment": "David encourages faith and trust—echoing Christ who tells his disciples not to fear. David offers himself as servant, preacher, and warrior."
    },
    {
      "pk": 9017033,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 33,
      "text": "Saul said to David, 'You are not able to go against this Philistine to fight him; for you are just a youth, and he has been a warrior from his youth.'",
      "links": "<a href='/AIV/9/16/7'>1Sam 16:7</a>",
      "comment": "Saul doubts David; the world judges by appearances, but God looks at the heart (see 1Sam 16:7)."
    },
    {
      "pk": 9017034,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 34,
      "text": "But David said to Saul, 'Your servant kept his father’s sheep, and when a lion or a bear came and took a lamb from the flock,'",
      "links": "<a href='/AIV/9/16/11'>1Sam 16:11</a>",
      "comment": "David’s experience as a shepherd foreshadows Christ as the Good Shepherd and as protector."
    },
    {
      "pk": 9017035,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 35,
      "text": "'I went out after it and struck it and rescued the lamb from its mouth. When it rose against me, I took hold of its beard and struck and killed it.'",
      "links": "<a href='/AIV/19/23/4'>Ps 23:4</a>",
      "comment": "David’s boldness and care as a shepherd reflect trust in the Lord—mirroring Christ’s sacrificial love for his flock."
    },
    {
      "pk": 9017036,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 36,
      "text": "Your servant has killed both lion and bear; and this uncircumcised Philistine shall be like one of them, because he has defied the armies of the living God.'",
      "links": "<a href='/AIV/9/17/26'>1Sam 17:26</a>",
      "comment": "David draws confidence from God’s faithfulness—his victories affirm God defends His people, a theme that foreshadows salvation."
    },
    {
      "pk": 9017037,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 37,
      "text": "David said, 'The LORD who delivered me from the paw of the lion and from the paw of the bear, He will deliver me from the hand of this Philistine.' Saul said to David, 'Go, and the LORD be with you.'",
      "links": "<a href='/AIV/9/16/13'>1Sam 16:13</a>; <a href='/AIV/6/1/9'>Josh 1:9</a>",
      "comment": "Deliverance is always the Lord's work. Saul’s blessing is reminiscent of commissioning, similar to apostles sent forth."
    },
    {
      "pk": 9017038,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 38,
      "text": "So Saul clothed David with his own armor. He put a helmet of bronze on his head and clothed him with a coat of mail.",
      "links": "<a href='/AIV/9/17/5'>1Sam 17:5</a>",
      "comment": "Saul attempts to equip David with earthly weapons, but David will rely on spiritual strength."
    },
    {
      "pk": 9017039,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 39,
      "text": "David strapped his sword over his armor, and he tried to walk, for he had not tested them. And David said to Saul, 'I cannot go with these, for I have not tested them.' So David took them off.",
      "links": "<a href='/AIV/9/9/2'>1Sam 9:2</a>",
      "comment": "This symbolizes that true victory comes not through human means, but by faith and divine providence."
    },
    {
      "pk": 9017040,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 40,
      "text": "Then he took his staff in his hand, chose five smooth stones from the brook, and put them in the pouch, even in his shepherd’s bag. His sling was in his hand, and he approached the Philistine.",
      "links": "<a href='/AIV/19/23/4'>Ps 23:4</a>",
      "comment": "David’s chosen weapons—simple, humble—emphasize trust in God rather than anything man-made. Five stones have been seen by theologians as symbolizing grace."
    },
    {
      "pk": 9017041,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 41,
      "text": "The Philistine came on and drew near to David, and the man who bore his shield was in front of him.",
      "links": "<a href='/AIV/9/17/7'>1Sam 17:7</a>",
      "comment": "Goliath approaches with all his armor and support—contrasts David’s solitary reliance on God."
    },
    {
      "pk": 9017042,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 42,
      "text": "When the Philistine looked and saw David, he despised him; for he was only a youth, ruddy and handsome in appearance.",
      "links": "<a href='/AIV/9/16/12'>1Sam 16:12</a>",
      "comment": "Goliath’s contempt reflects how worldly power regards spiritual strength as weakness. David’s youthfulness and beauty recall the humble origins of Israel’s greatest kings."
    },
    {
      "pk": 9017043,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 43,
      "text": "The Philistine said to David, 'Am I a dog, that you come to me with sticks?' And the Philistine cursed David by his gods.",
      "links": "<a href='/AIV/9/14/12'>1Sam 14:12</a>",
      "comment": "Goliath invokes his own gods—again setting up the confrontation as not just between men, but between faiths."
    },
    {
      "pk": 9017044,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 44,
      "text": "The Philistine said to David, 'Come to me, and I will give your flesh to the birds of the air and to the beasts of the field!'",
      "links": "<a href='/AIV/6/8/24'>Josh 8:24</a>",
      "comment": "Goliath’s threat echoes ancient curses, setting the stage for reversal—life rather than death."
    },
    {
      "pk": 9017045,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 45,
      "text": "Then David said to the Philistine, 'You come to me with a sword, with a spear, and with a javelin. But I come to you in the name of the LORD of hosts, the God of the armies of Israel, whom you have defied.'",
      "links": "<a href='/AIV/19/118/6'>Ps 118:6</a>; <a href='/AIV/9/17/36'>1Sam 17:36</a>",
      "comment": "David declares his faith, invoking the Lord of hosts. This is a spiritual confrontation; the victory will be for God's glory, not for man’s."
    },
    {
      "pk": 9017046,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 46,
      "text": "'This day the LORD will deliver you into my hand, and I will strike you down and cut off your head. And I will give the dead bodies of the Philistine army this day to the birds of the air and to the beasts of the earth, so that all the earth may know that there is a God in Israel.'",
      "links": "<a href='/AIV/19/46/10'>Ps 46:10</a>; <a href='/AIV/9/17/44'>1Sam 17:44</a>",
      "comment": "David’s proclamation points toward divine power and universal recognition of God—a motif seen again in Christ’s declaration of salvation for all nations."
    },
    {
      "pk": 9017047,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 47,
      "text": "'And all this assembly shall know that the LORD does not save by sword and spear; for the battle is the LORD’s, and He will give you into our hand.'",
      "links": "<a href='/AIV/9/14/6'>1Sam 14:6</a>",
      "comment": "Victory does not come through human means. David’s words resonate with Christian teaching on divine providence."
    },
    {
      "pk": 9017048,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 48,
      "text": "When the Philistine arose and came and drew near to meet David, David ran quickly toward the battle line to meet the Philistine.",
      "links": "<a href='/AIV/9/17/40'>1Sam 17:40</a>",
      "comment": "David’s fearless advance is an image of courage drawn from supernatural conviction—a spiritual precursor to the apostles’ boldness."
    },
    {
      "pk": 9017049,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 49,
      "text": "David put his hand into the bag, took a stone, and slung it, striking the Philistine on his forehead. The stone sank into his forehead, and he fell face down to the ground.",
      "links": "<a href='/AIV/19/18/39'>Ps 18:39</a>; <a href='/AIV/9/17/40'>1Sam 17:40</a>",
      "comment": "The humble means, the stone, destroys the apparent invincible enemy. Spiritual interpretations see Christ as the stone whom the builders rejected—ultimately striking down sin and death (see Ps 118:22)."
    },
    {
      "pk": 9017050,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 50,
      "text": "So David prevailed over the Philistine with a sling and a stone; he struck down the Philistine and killed him. There was no sword in David’s hand.",
      "links": "<a href='/AIV/9/17/47'>1Sam 17:47</a>",
      "comment": "Victory is achieved through faith, symbolism that foreshadows Christ’s conquest of evil without violence."
    },
    {
      "pk": 9017051,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 51,
      "text": "Then David ran and stood over the Philistine, took his sword, drew it out of its sheath, and killed him, and cut off his head. When the Philistines saw their champion was dead, they fled.",
      "links": "<a href='/AIV/9/21/9'>1Sam 21:9</a>",
      "comment": "David’s complete victory brings deliverance to Israel—a pattern seen in the full defeat of evil through Christ."
    },
    {
      "pk": 9017052,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 52,
      "text": "The men of Israel and Judah arose and shouted, and pursued the Philistines as far as the entrance to Gath and to the gates of Ekron. The wounded Philistines fell along the way all the way from Shaaraim to Gath and Ekron.",
      "links": "<a href='/AIV/9/17/4'>1Sam 17:4</a>",
      "comment": "The enemy’s defeat is complete—bringing unity between Judah and Israel, which echoes the ultimate unity brought through the new covenant."
    },
    {
      "pk": 9017053,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 53,
      "text": "The children of Israel returned from chasing the Philistines, and they plundered their camp.",
      "links": "<a href='/AIV/9/14/48'>1Sam 14:48</a>",
      "comment": "Victory brings reward—but the real gain is deliverance and restoration, not just material spoils."
    },
    {
      "pk": 9017054,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 54,
      "text": "David took the head of the Philistine and brought it to Jerusalem; but he put his armor in his tent.",
      "links": "<a href='/AIV/9/21/9'>1Sam 21:9</a>; <a href='/AIV/13/11/4'>1Chr 11:4</a>",
      "comment": "David brings Goliath’s head to Jerusalem—a prophetic gesture, since Jerusalem becomes the spiritual center of worship and kingship."
    },
    {
      "pk": 9017055,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 55,
      "text": "When Saul saw David going out against the Philistine, he said to Abner, commander of the army, 'Abner, whose son is this youth?' Abner said, 'As your soul lives, O king, I do not know.'",
      "links": "<a href='/AIV/9/16/18'>1Sam 16:18</a>",
      "comment": "David’s identity is still mysterious to Saul and the army—pointing toward his rising prominence and the significance of lineage in leadership."
    },
    {
      "pk": 9017056,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 56,
      "text": "The king said, 'Inquire whose son this young man is.'",
      "links": "<a href='/AIV/9/16/11'>1Sam 16:11</a>",
      "comment": "Saul’s concern with David’s parentage mirrors messianic themes of ancestry tracing, significant for salvation history and apostolic succession."
    },
    {
      "pk": 9017057,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 57,
      "text": "So as David returned from killing the Philistine, Abner took him and brought him before Saul with the head of the Philistine in his hand.",
      "links": "<a href='/AIV/9/17/54'>1Sam 17:54</a>",
      "comment": "The scene presents David as victor and hero, reminiscent of Christ presented as conqueror of death."
    },
    {
      "pk": 9017058,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 17,
      "verse": 58,
      "text": "Saul said to him, 'Whose son are you, young man?' David answered, 'I am the son of your servant Jesse the Bethlehemite.'",
      "links": "<a href='/AIV/8/4/22'>Ruth 4:22</a>; <a href='/AIV/40/1/6'>Mt 1:6</a>",
      "comment": "David’s response solidifies the messianic lineage—Bethlehem stands as the birthplace of the future King who will save Israel and the world (see Matt 2:6; John 7:42)."
    }
  ],
  "translatedAt": "2025-12-24T02:58:49.358Z"
}