{
  "book": "1 Timothy",
  "bookAbbreviation": "1Tim",
  "chapter": 5,
  "verses": [
    {
      "pk": 40112500,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 1,
      "text": "Do not sharply rebuke an older man, but encourage him as you would a father. Treat younger men as brothers,",
      "links": "<a href='/AIV/19/119/9'>Ps. 119:9</a>; <a href='/AIV/20/3/11'>Prov. 3:11</a>",
      "comment": "Paul instructs Timothy to show honor toward elders, reflecting the biblical pattern of respecting authority and spiritual maturity (see Proverbs 3:11)."
    },
    {
      "pk": 40112501,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 2,
      "text": "older women as mothers, younger women as sisters, in all purity.",
      "links": "<a href='/AIV/20/31/27'>Prov. 31:27</a>; <a href='/AIV/51/3/12-13'>Col. 3:12–13</a>",
      "comment": "Timothy is to maintain purity and respect toward all in the community, which contributes to strengthening unity and holiness within the church."
    },
    {
      "pk": 40112502,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 3,
      "text": "Honor widows who are truly widows.",
      "links": "<a href='/AIV/59/1/27'>Jas. 1:27</a>; <a href='/AIV/02/22/22-24'>Exod. 22:22–24</a>",
      "comment": "Emphasizes ministering to those genuinely in need. This principle reflects God's care for the vulnerable (James 1:27; Exodus 22:22–24)."
    },
    {
      "pk": 40112503,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 4,
      "text": "But if a widow has children or grandchildren, let them first learn to show godliness to their own family and to repay their parents, for this is pleasing in God’s sight.",
      "links": "<a href='/AIV/02/20/12'>Exod. 20:12</a>; <a href='/AIV/40/15/4-6'>Matt. 15:4–6</a>",
      "comment": "Stresses the biblical expectation for families to care for their elders, echoing the fifth commandment's call to honor parents (Exodus 20:12)."
    },
    {
      "pk": 40112504,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 5,
      "text": "She who is truly a widow, left all alone, has set her hope on God and continues in supplications and prayers night and day.",
      "links": "<a href='/AIV/42/2/37'>Luke 2:37</a>; <a href='/AIV/19/86/3'>Ps. 86:3</a>",
      "comment": "True widows devote themselves to prayer, resembling Anna in Luke 2:37 and reflecting the church's call to pray continuously."
    },
    {
      "pk": 40112505,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 6,
      "text": "But the one who lives for pleasure is dead even while she lives.",
      "links": "<a href='/AIV/49/2/1'>Eph. 2:1</a>; <a href='/AIV/66/3/1'>Rev. 3:1</a>",
      "comment": "Spiritual death comes from turning away from God, paralleling Eph. 2:1 and Rev. 3:1 which speak of spiritual lifelessness despite physical life."
    },
    {
      "pk": 40112506,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 7,
      "text": "Command these things, so that they may be above reproach.",
      "links": "<a href='/AIV/54/4/12'>1 Tim. 4:12</a>; <a href='/AIV/56/2/7-8'>Titus 2:7–8</a>",
      "comment": "Paul wants church leaders and members to live blamelessly, maintaining witness and order in the faith community."
    },
    {
      "pk": 40112507,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 8,
      "text": "But if someone does not provide for his own, especially for those of his household, he has denied the faith and is worse than an unbeliever.",
      "links": "<a href='/AIV/20/13/22'>Prov. 13:22</a>; <a href='/AIV/59/2/14-17'>Jas. 2:14–17</a>",
      "comment": "Practical care is an essential demonstration of genuine faith. This strong warning affirms the connection between true belief and works (James 2:14–17)."
    },
    {
      "pk": 40112508,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 9,
      "text": "Let a widow be enrolled if she is not less than sixty years old, having been the wife of one husband,",
      "links": "<a href='/AIV/54/3/2'>1 Tim. 3:2</a>; <a href='/AIV/56/1/6'>Titus 1:6</a>",
      "comment": "Specific qualifications mirror those set for elders and serve to preserve the purity and trustworthiness of the church’s ministry roles."
    },
    {
      "pk": 40112509,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 10,
      "text": "and she must be well known for good works: if she has brought up children, shown hospitality, washed the feet of the saints, helped the afflicted, and devoted herself to every good work.",
      "links": "<a href='/AIV/40/25/35-40'>Matt. 25:35–40</a>; <a href='/AIV/43/13/14'>John 13:14</a>",
      "comment": "The acts listed resemble those expected of all believers and especially church servants—mirroring Christ’s example of humble service (John 13:14; Matthew 25:35–40)."
    },
    {
      "pk": 40112510,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 11,
      "text": "But refuse to enroll younger widows, for when their passions draw them away from Christ, they desire to marry",
      "links": "<a href='/AIV/54/6/11'>1 Tim. 6:11</a>",
      "comment": "Paul’s practical advice relates to spiritual discipline. Younger widows are encouraged to seek a new holy vocation through remarriage, maintaining spiritual and communal stability."
    },
    {
      "pk": 40112511,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 12,
      "text": "and so they incur condemnation for abandoning their former pledge.",
      "links": "<a href='/AIV/04/30/2'>Num. 30:2</a>; <a href='/AIV/21/5/4-5'>Eccl. 5:4–5</a>",
      "comment": "Vows made before God are serious and breaking them draws spiritual consequence—see Numbers 30:2 and Ecclesiastes 5:4–5."
    },
    {
      "pk": 40112512,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 13,
      "text": "Besides that, they learn to be idle, going from house to house. Not only are they idle, but also gossips and busybodies, saying things they should not.",
      "links": "<a href='/AIV/20/31/27'>Prov. 31:27</a>; <a href='/AIV/60/4/15'>1 Pet. 4:15</a>",
      "comment": "Avoiding idleness and gossip maintains peace and order, both central to Christian witness and discipline."
    },
    {
      "pk": 40112513,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 14,
      "text": "So I advise younger widows to marry, have children, manage their homes, and give the enemy no occasion for slander.",
      "links": "<a href='/AIV/56/2/4-5'>Titus 2:4–5</a>; <a href='/AIV/20/14/1'>Prov. 14:1</a>",
      "comment": "Paul underscores the importance of stable household life and upholding community reputation as a ministry to the world."
    },
    {
      "pk": 40112514,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 15,
      "text": "For some have already turned aside after Satan.",
      "links": "<a href='/AIV/54/1/20'>1 Tim. 1:20</a>; <a href='/AIV/43/13/27'>John 13:27</a>",
      "comment": "Warns that carelessness in spiritual discipline can lead to apostasy, illustrated elsewhere in Scripture (see 1 Tim. 1:20; John 13:27)."
    },
    {
      "pk": 40112515,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 16,
      "text": "If any believer has widows in his family, let him care for them, so that the church may not be burdened and may provide care for those who are truly widows.",
      "links": "<a href='/AIV/59/1/27'>Jas. 1:27</a>",
      "comment": "The church’s resources are to serve those without support, reinforcing both family responsibility and the special ministry to those in greatest need."
    },
    {
      "pk": 40112516,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 17,
      "text": "Let the elders who lead well be considered worthy of double honor, especially those who labor in teaching and preaching.",
      "links": "<a href='/AIV/54/3/1'>1 Tim. 3:1</a>; <a href='/AIV/58/13/17'>Heb. 13:17</a>",
      "comment": "The passage commends generous support of church leaders, especially teachers—affirming the apostolic structure and reverence for spiritual authority (Hebrews 13:17)."
    },
    {
      "pk": 40112517,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 18,
      "text": "For the Scripture says, 'You shall not muzzle an ox while it is treading out the grain,' and, 'The laborer deserves his wages.'",
      "links": "<a href='/AIV/05/25/4'>Deut. 25:4</a>; <a href='/AIV/42/10/7'>Luke 10:7</a>",
      "comment": "Supporting ministers is not merely human convention but a divinely ordained principle (Deuteronomy 25:4; Luke 10:7)."
    },
    {
      "pk": 40112518,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 19,
      "text": "Do not accept a charge against an elder unless it is confirmed by two or three witnesses.",
      "links": "<a href='/AIV/05/19/15'>Deut. 19:15</a>; <a href='/AIV/40/18/16'>Matt. 18:16</a>",
      "comment": "The procedure for accusations follows the biblical standard for justice, echoing Deuteronomy 19:15, protecting both truth and spiritual authority."
    },
    {
      "pk": 40112519,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 20,
      "text": "Those who continue in sin, rebuke before everyone, so that the rest may stand in fear.",
      "links": "<a href='/AIV/40/18/17'>Matt. 18:17</a>; <a href='/AIV/44/5/11'>Acts 5:11</a>",
      "comment": "Public correction of persistent sin serves both as discipline and a safeguard for the church, maintaining her holiness (Acts 5:11; Matthew 18:17)."
    },
    {
      "pk": 40112520,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 21,
      "text": "I charge you before God and Christ Jesus and the chosen angels, to maintain these rules without prejudice, doing nothing out of partiality.",
      "links": "<a href='/AIV/54/6/13'>1 Tim. 6:13</a>; <a href='/AIV/55/4/1'>2 Tim. 4:1</a>",
      "comment": "Paul’s solemn charge underscores the importance of impartiality and accountability in church governance, conducted before the heavenly court — a scriptural witness to the majesty of the Lord’s body."
    },
    {
      "pk": 40112521,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 22,
      "text": "Do not be hasty in the laying on of hands, nor participate in the sins of others; keep yourself pure.",
      "links": "<a href='/AIV/54/4/14'>1 Tim. 4:14</a>; <a href='/AIV/54/3/10'>1 Tim. 3:10</a>",
      "comment": "The laying on of hands refers to ordination—the passage urges discernment and the spiritual purity required of church leaders. The laying on of hands is an apostolic practice (see 1 Tim. 4:14), foundational for the church’s continuity."
    },
    {
      "pk": 40112522,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 23,
      "text": "No longer drink only water, but use a little wine for the sake of your stomach and your frequent illnesses.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/43/2/10'>John 2:10</a>",
      "comment": "Paul grants pastoral wisdom for health, reflecting a holistic view of Christian living—grace covers body and soul (John 2:10)."
    },
    {
      "pk": 40112523,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 24,
      "text": "The sins of some people are obvious, going before them to judgment, but the sins of others appear only later.",
      "links": "<a href='/AIV/42/8/17'>Luke 8:17</a>; <a href='/AIV/19/90/8'>Ps. 90:8</a>",
      "comment": "Nothing remains hidden from God’s judgment (Luke 8:17), affirming the need for self-examination and the church's discernment regarding her members."
    },
    {
      "pk": 40112524,
      "translation": "AIV",
      "book": 54,
      "chapter": 5,
      "verse": 25,
      "text": "So also good works are evident, and those that are not can never remain hidden.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/19/37/6'>Ps. 37:6</a>",
      "comment": "Just as hidden sins are revealed, so too are good works. The passage notes God’s ultimate vindication of those who persevere in doing good (Matthew 5:16; Psalm 37:6), a foundation for spiritual discipline and sacramental living."
    }
  ],
  "translatedAt": "2025-12-23T04:03:07.541Z"
}