{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 59,
  "verses": [
    {
      "pk": 29059001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 1,
      "text": "Look, the LORD’s hand is not too short to save, nor His ear too dull to hear.",
      "links": "<a href='/AIV/04/11/23'>Num. 11:23</a>; <a href='/AIV/23/50/2'>Isa. 50:2</a>",
      "comment": "Isaiah begins with a reassurance of God’s power and ability to deliver. The verse echoes previous assurances of God’s capacity, emphasizing that the problem is not with God, but with the people’s spiritual state."
    },
    {
      "pk": 29059002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 2,
      "text": "But your sins have separated you from your God; your wrongdoings have hidden His face from you, so that He does not hear.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Isaiah identifies sin as the root cause of separation from God. The spiritual implication here is the necessity of reconciliation with God through the confession of sins—a principle foundational to Christian life, where restoration flows from repentance and sacramental grace."
    },
    {
      "pk": 29059003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 3,
      "text": "For your hands are stained with blood and your fingers with iniquity; your lips speak lies and your tongue mutters wickedness.",
      "links": "<a href='/AIV/19/26/10'>Ps. 26:10</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Sin is shown to manifest both in action and speech. There's a holistic sense of guilt affecting the whole person, an idea that highlights the need for complete renewal, not just outward reform."
    },
    {
      "pk": 29059004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 4,
      "text": "No one calls for justice, no one pleads with integrity; they trust in empty words, they speak lies, they conceive harm and give birth to trouble.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/23/58/2-3'>Isa. 58:2-3</a>",
      "comment": "The lack of justice and truth among the people is symptomatic of deep societal disorder. Spiritual renewal must lead to social justice and truth, a recurring biblical theme."
    },
    {
      "pk": 29059005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 5,
      "text": "They hatch viper’s eggs and weave spider’s webs; whoever eats their eggs dies, and when one is broken, a serpent is hatched.",
      "links": "<a href='/AIV/19/140/3'>Ps. 140:3</a>; <a href='/AIV/40/23/33'>Matt. 23:33</a>",
      "comment": "Sinful actions produce deadly consequences, and evil brings forth more evil. This language foreshadows later depictions of spiritual death and echoes how evil can multiply when left unchecked."
    },
    {
      "pk": 29059006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 6,
      "text": "Their webs will not become clothing, and they cannot cover themselves with what they make; their deeds are deeds of evil, and acts of violence are in their hands.",
      "links": "<a href='/AIV/18/8/14'>Job 8:14</a>; <a href='/AIV/23/28/20'>Isa. 28:20</a>",
      "comment": "The image here illustrates the futility of sin—evil works cannot protect or justify. This echoes later New Testament teaching that only Christ can cover our shame (see Gal. 3:27)."
    },
    {
      "pk": 29059007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 7,
      "text": "Their feet run to evil; they are quick to shed innocent blood. Their thoughts are bent on injustice; ruin and destruction mark their paths.",
      "links": "<a href='/AIV/20/1/16'>Prov. 1:16</a>; <a href='/AIV/45/3/15'>Rom. 3:15</a>",
      "comment": "Paul cites this verse in Romans 3:15 to show the universality of human sinfulness. The inherent inclination to evil reveals why redemption must be supernatural, not merely moral improvement."
    },
    {
      "pk": 29059008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 8,
      "text": "They do not know the way of peace; there is no justice in their tracks. They make twisted paths; whoever walks in them does not know peace.",
      "links": "<a href='/AIV/45/3/17'>Rom. 3:17</a>; <a href='/AIV/23/48/22'>Isa. 48:22</a>",
      "comment": "Lack of peace is a result of departure from God’s law. In the New Testament, Christ is revealed as the Prince of Peace (Isa. 9:6; Luke 2:14), fulfilling this longing for true peace."
    },
    {
      "pk": 29059009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 9,
      "text": "So justice is far from us, and righteousness does not reach us. We look for light, but all is darkness; for brightness, yet we walk in deep shadows.",
      "links": "<a href='/AIV/23/58/8'>Isa. 58:8</a>; <a href='/AIV/43/12/35'>John 12:35'</a>",
      "comment": "Isaiah laments the absence of justice and righteousness. Spiritual darkness is a symbol for alienation from God; Christ is later proclaimed as the true Light (John 1:4-5), the answer to this need."
    },
    {
      "pk": 29059010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 10,
      "text": "We grope along the wall like the blind; we grope as those without eyes. We stumble at noon as in the twilight, among the strong we are like the dead.",
      "links": "<a href='/AIV/05/28/29'>Deut. 28:29</a>; <a href='/AIV/43/9/41'>John 9:41</a>",
      "comment": "Blindness represents spiritual ignorance. In the Gospel, Jesus heals the blind to signify spiritual awakening and new life (see John 9)."
    },
    {
      "pk": 29059011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 11,
      "text": "We all growl like bears, we moan mournfully like doves; we hope for justice, but there is none, for salvation, but it is far from us.",
      "links": "<a href='/AIV/19/74/9'>Ps. 74:9</a>; <a href='/AIV/23/38/14'>Isa. 38:14</a>",
      "comment": "Their cries and animal sounds show deep anguish and the universal longing for salvation. This anticipates God’s future intervention through the Messiah, the One who brings justice and salvation near."
    },
    {
      "pk": 29059012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 12,
      "text": "For our sins are piled up before You, and our transgressions testify against us. Our offenses are always with us, and we acknowledge our wrongdoings:",
      "links": "<a href='/AIV/19/90/8'>Ps. 90:8</a>; <a href='/AIV/23/64/6'>Isa. 64:6</a>",
      "comment": "Isaiah emphasizes corporate confession—the community acknowledges its sin. This communal, liturgical approach to forgiveness is repeatedly demonstrated in biblical worship."
    },
    {
      "pk": 29059013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 13,
      "text": "rebellion and treachery against the LORD, turning our backs on our God, speaking oppression and revolt, conceiving and uttering false words from the heart.",
      "links": "<a href='/AIV/19/106/7'>Ps. 106:7</a>; <a href='/AIV/23/1/4'>Isa. 1:4</a>",
      "comment": "The text lists specific sins against God and neighbor, pointing to the need not just for personal but for communal and sacramental repentance, as God’s covenant people."
    },
    {
      "pk": 29059014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 14,
      "text": "So justice is driven back, and righteousness stands far off; for truth has stumbled in the public square, and honesty cannot enter.",
      "links": "<a href='/AIV/23/5/7'>Isa. 5:7</a>; <a href='/AIV/19/85/10-11'>Ps. 85:10-11</a>",
      "comment": "Society suffers when spiritual truth is lost. The power of truth and justice in the public sphere is a theme that continually points toward the renewal that comes only through God’s intervention."
    },
    {
      "pk": 29059015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 15,
      "text": "Truth is nowhere to be found, and whoever shuns evil becomes a target. The LORD saw this, and it displeased Him that there was no justice.",
      "links": "<a href='/AIV/23/1/17'>Isa. 1:17</a>; <a href='/AIV/23/63/5'>Isa. 63:5</a>",
      "comment": "Standing for truth brings persecution—a reality later seen in the lives of Christ and His apostles. God’s concern for justice affirms the value of standing up for righteousness, even at personal cost."
    },
    {
      "pk": 29059016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 16,
      "text": "He saw that there was no one, no one to intercede; so His own arm brought salvation, and His righteousness upheld Him.",
      "links": "<a href='/AIV/23/53/12'>Isa. 53:12</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "No human mediator is found, so God Himself acts. This prefigures the role of Christ as the divine intercessor (see Heb. 7:25), who offers perfect mediation between God and humanity."
    },
    {
      "pk": 29059017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 17,
      "text": "He put on righteousness as His breastplate, and the helmet of salvation on His head; He clothed Himself with garments of vengeance and wrapped Himself in zeal as a cloak.",
      "links": "<a href='/AIV/49/6/14-17'>Eph. 6:14-17</a>; <a href='/AIV/23/11/5'>Isa. 11:5</a>",
      "comment": "The armor imagery is later echoed by Paul in Ephesians 6, showing God’s protection and active fight against evil—offering a model for spiritual warfare today."
    },
    {
      "pk": 29059018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 18,
      "text": "According to their deeds, so will He repay: wrath to His enemies, retribution to His foes; He will repay the islands their due.",
      "links": "<a href='/AIV/19/18/20'>Ps. 18:20</a>; <a href='/AIV/23/34/8'>Isa. 34:8</a>",
      "comment": "God is presented as Just Judge, rewarding righteousness and punishing evil. This motivates a sense of awe and the need for authentic reconciliation with God through grace."
    },
    {
      "pk": 29059019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 19,
      "text": "So people will fear the Name of the LORD from the west, and His glory from the rising of the sun; for He will come like a rushing stream, driven by the breath of the LORD.",
      "links": "<a href='/AIV/19/113/3'>Ps. 113:3</a>; <a href='/AIV/23/41/2'>Isa. 41:2</a>",
      "comment": "Universal recognition of God's majesty is promised, anticipating the worldwide proclamation of the Gospel and the spread of divine glory across all nations."
    },
    {
      "pk": 29059020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 20,
      "text": "And the Redeemer will come to Zion, to those in Jacob who turn from wrongdoing, declares the LORD.",
      "links": "<a href='/AIV/45/11/26'>Rom. 11:26</a>; <a href='/AIV/23/40/9'>Isa. 40:9</a>",
      "comment": "Paul quotes this verse in Romans 11:26, showing its messianic fulfillment in Christ. The Redeemer’s coming marks the restoration of God’s people and the promise of spiritual renewal."
    },
    {
      "pk": 29059021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 59,
      "verse": 21,
      "text": "As for Me, this is My covenant with them, says the LORD: My Spirit which is on you, and My words that I have placed in your mouth, will not depart from your mouth, or from the mouths of your descendants, or from the mouths of their children’s children, from now on and forever, says the LORD.",
      "links": "<a href='/AIV/24/31/33-34'>Jer. 31:33-34</a>; <a href='/AIV/44/2/39'>Acts 2:39</a>",
      "comment": "The enduring covenant and the promised Spirit foreshadow the new covenant made through Christ and the outpouring of the Spirit upon the Church, ensuring the perpetual transmission of God’s truth through apostolic succession and living tradition."
    }
  ],
  "translatedAt": "2025-12-24T08:17:44.121Z"
}