{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 49,
  "verses": [
    {
      "pk": 29049001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 1,
      "text": "Listen to me, O islands, pay attention, you distant peoples! The LORD called me from the womb; from my mother’s belly he spoke my name.",
      "links": "<a href='/AIV/24/1/5'>Jer. 1:5</a>; <a href='/AIV/42/1/31'>Luke 1:31</a>",
      "comment": "This Servant is set apart by God from before birth, echoing similar language used of Jeremiah and fulfilled in the calling of Christ, who is recognized from His conception (see Luke 1:31). The idea of divine calling from the womb also highlights the theme of God's initiative in salvation history."
    },
    {
      "pk": 29049002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 2,
      "text": "He made my mouth like a sharp sword; he hid me in the shadow of his hand. He made me a polished arrow; in his quiver he concealed me.",
      "links": "<a href='/AIV/58/4/12'>Heb. 4:12</a>; <a href='/AIV/66/1/16'>Rev. 1:16</a>",
      "comment": "The imagery of a sharp sword and polished arrow points to the powerful, effective word of God through His Servant. The concealment suggests preparation for a special mission, paralleled by Jesus’ hidden years before His public ministry."
    },
    {
      "pk": 29049003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 3,
      "text": "He said to me, 'You are my servant, Israel, in whom I will be glorified.'",
      "links": "<a href='/AIV/43/13/31-32'>John 13:31-32</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "Here, 'Israel' refers both to the nation and to the individual Servant, who perfectly embodies Israel’s mission. In a deeper sense, this is fulfilled by Christ, who is the faithful Servant who glorifies God perfectly."
    },
    {
      "pk": 29049004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 4,
      "text": "But I said, 'I have labored in vain; I have spent my strength for nothing and vanity. Yet surely my right is with the LORD, and my reward with my God.'",
      "links": "<a href='/AIV/40/26/39-42'>Matt. 26:39-42</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "The Servant experiences apparent failure and rejection, prefiguring the Passion of Christ. Despite seeming defeat, there's trust in God's ultimate justice—echoing Jesus' prayers in Gethsemane."
    },
    {
      "pk": 29049005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 5,
      "text": "And now the LORD says—he who formed me from the womb to be his servant, to bring Jacob back to him, that Israel might be gathered to him— for I am honored in the eyes of the LORD, and my God has become my strength—",
      "links": "<a href='/AIV/42/1/15-16'>Luke 1:15-16</a>; <a href='/AIV/40/15/24'>Matt. 15:24</a>",
      "comment": "This verse emphasizes the vocation to restore Israel, again alluding to the messianic purpose. Jesus would state His mission as being sent first to the lost sheep of Israel."
    },
    {
      "pk": 29049006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 6,
      "text": "he says: 'It is too small a thing that you should be my servant to raise up the tribes of Jacob and to bring back those of Israel who are preserved; I will also make you a light to the nations, that my salvation may reach to the ends of the earth.'",
      "links": "<a href='/AIV/44/13/47'>Acts 13:47</a>; <a href='/AIV/42/2/32'>Luke 2:32</a>",
      "comment": "God’s plan surpasses Israel alone—His Servant is meant to bring salvation to all nations. Jesus is described as the light to the Gentiles (see Luke 2:32), fulfilling this prophecy."
    },
    {
      "pk": 29049007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 7,
      "text": "Thus says the LORD, the Redeemer of Israel, his Holy One, to one deeply despised, abhorred by the nation, the servant of rulers: 'Kings will see and rise, princes, and they will bow down, because of the LORD, who is faithful, the Holy One of Israel, who has chosen you.'",
      "links": "<a href='/AIV/50/53/3'>Isa. 53:3</a>; <a href='/AIV/50/52/15'>Isa. 52:15</a>",
      "comment": "Though the Servant is initially despised, even royalty will honor Him. This anticipates Christ’s humiliation and later exaltation, a theme echoed in Philippians 2:9-11 implicitly."
    },
    {
      "pk": 29049008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 8,
      "text": "Thus says the LORD: 'In a time of favor I have answered you, and in a day of salvation I have helped you; I will keep you and make you to be a covenant for the people, to restore the land, to assign deserted inheritances,'",
      "links": "<a href='/AIV/47/6/2'>2 Cor. 6:2</a>; <a href='/AIV/50/42/6'>Isa. 42:6</a>",
      "comment": "The Servant Himself becomes the covenant—He personally embodies the new relationship between God and His people. This prefigures Christ’s institution of a new and everlasting covenant (see Luke 22:20, not directly referenced here for subtlety)."
    },
    {
      "pk": 29049009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 9,
      "text": "'to say to the prisoners, “Come out,” to those in darkness, “Show yourselves.” They will feed along the roads, and on all the bare heights shall be their pastures.'",
      "links": "<a href='/AIV/40/4/16'>Matt. 4:16</a>; <a href='/AIV/50/42/7'>Isa. 42:7</a>",
      "comment": "Liberation from captivity—both physical and spiritual—is a sign of the Messianic age. Jesus’ ministry to those in darkness fulfills these words (Matt. 4:16)."
    },
    {
      "pk": 29049010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 10,
      "text": "'They will not hunger or thirst, nor will scorching wind or sun beat upon them; he who has compassion on them will guide them, and lead them beside springs of water.'",
      "links": "<a href='/AIV/19/23/2'>Ps. 23:2</a>; <a href='/AIV/66/7/16-17'>Rev. 7:16-17</a>",
      "comment": "Echoes imagery of the Good Shepherd, who cares for His sheep and provides eternal satisfaction, further mirrored in Revelation and Psalm 23."
    },
    {
      "pk": 29049011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 11,
      "text": "'I will make all my mountains into a road, and my highways shall be raised up.'",
      "links": "<a href='/AIV/40/3/3'>Matt. 3:3</a>; <a href='/AIV/23/40/3'>Isa. 40:3</a>",
      "comment": "God’s work prepares a straight path for the coming of His Servant, as later echoed in John the Baptist’s call to prepare the way for the Lord."
    },
    {
      "pk": 29049012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 12,
      "text": "'Behold, these shall come from afar! Look! These from the north and from the west, and these from the land of Syene.'",
      "links": "<a href='/AIV/50/60/4'>Isa. 60:4</a>; <a href='/AIV/38/8/7'>Zech. 8:7</a>",
      "comment": "The worldwide gathering of God’s people is anticipated, suggesting the universality of the Church, which draws from all nations."
    },
    {
      "pk": 29049013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 13,
      "text": "Sing for joy, you heavens, and rejoice, O earth! Break out in song, O mountains! For the LORD has comforted his people and will have compassion on his afflicted ones.",
      "links": "<a href='/AIV/23/44/23'>Isa. 44:23</a>; <a href='/AIV/23/40/1'>Isa. 40:1</a>",
      "comment": "The cosmic praise underscores the magnitude of salvation. God’s comfort is the fulfillment of His promises confirmed in Christ."
    },
    {
      "pk": 29049014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 14,
      "text": "But Zion said, 'The LORD has forsaken me; my Lord has forgotten me.'",
      "links": "<a href='/AIV/19/137/1-4'>Ps. 137:1-4</a>",
      "comment": "Zion’s lament echoes the experience of exile and spiritual desolation. The following verses address this perceived abandonment directly."
    },
    {
      "pk": 29049015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 15,
      "text": "'Can a woman forget her nursing child, or show no compassion for the child of her womb? Even if these may forget, I will not forget you.'",
      "links": "<a href='/AIV/19/27/10'>Ps. 27:10</a>",
      "comment": "God’s love surpasses even that of a mother for her child, underlining His unfailing faithfulness—even when human love may falter."
    },
    {
      "pk": 29049016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 16,
      "text": "'Behold, I have engraved you on the palms of my hands; your walls are constantly before me.'",
      "links": "<a href='/AIV/50/44/5'>Isa. 44:5</a>",
      "comment": "The vivid metaphor of God inscribing His people on His hands suggests a permanent, unbreakable remembrance and care—a foreshadowing for Christians of the wounds in Christ’s hands which mark His love for His Church."
    },
    {
      "pk": 29049017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 17,
      "text": "'Your children will hasten back, and those who laid you waste will depart from you.'",
      "links": "<a href='/AIV/50/60/4-5'>Isa. 60:4-5</a>",
      "comment": "Restoration and reversal: exiles return, and oppressors vanish—an image of the Church's future gathering and the ultimate triumph over oppression."
    },
    {
      "pk": 29049018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 18,
      "text": "'Lift up your eyes around and see; all of them gather, they come to you. As I live,' declares the LORD, 'you shall put them all on as an ornament; you shall bind them on like a bride.'",
      "links": "<a href='/AIV/23/62/5'>Isa. 62:5</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "The gathering of people is likened to a bride adorning herself, symbol of intimacy and covenant—a recurring theme in both Old and New Testaments."
    },
    {
      "pk": 29049019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 19,
      "text": "'For your wasted and desolate places, and your devastated land—surely now you will be too crowded for your inhabitants, and those who swallowed you up will be far away.'",
      "links": "<a href='/AIV/50/54/1-3'>Isa. 54:1-3</a>",
      "comment": "An unexpected reversal—former desolation now overflows with restored life, pointing to the abundant growth of God’s people."
    },
    {
      "pk": 29049020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 20,
      "text": "The children of your loss will say again in your ears, 'This place is too cramped for me; make room for me to settle.'",
      "links": "<a href='/AIV/50/54/2'>Isa. 54:2</a>",
      "comment": "The promise of many spiritual descendants, again foreshadowing a worldwide spiritual family."
    },
    {
      "pk": 29049021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 21,
      "text": "Then you will say in your heart, 'Who has borne me these? I was bereaved and barren, exiled and rejected. Who has raised these? Behold, I was left alone; where then have these come from?'",
      "links": "<a href='/AIV/45/4/17-18'>Rom. 4:17-18</a>",
      "comment": "Surprise at the growth of God's people, attributed to His supernatural work—comparable to Paul's teaching on spiritual children of Abraham."
    },
    {
      "pk": 29049022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 22,
      "text": "Thus says the Lord GOD: 'Behold, I will lift up my hand to the nations, and raise my banner to the peoples; and they will bring your sons in their arms, and your daughters shall be carried on their shoulders.'",
      "links": "<a href='/AIV/23/11/10-12'>Isa. 11:10-12</a>",
      "comment": "God’s universal plan is seen here as nations participate in bringing His people home, imagery later used to show the Gentiles entering into the family of God."
    },
    {
      "pk": 29049023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 23,
      "text": "Kings shall be your foster fathers, and their queens your nursing mothers. They will bow down to you with their faces to the ground and lick the dust of your feet. Then you will know that I am the LORD; those who wait for me shall not be put to shame.'",
      "links": "<a href='/AIV/60/2/6'>1 Pet. 2:6</a>; <a href='/AIV/19/72/11'>Ps. 72:11</a>",
      "comment": "Leaders of the earth supporting God’s people points to the eventual vindication and exaltation of the faithful—an early hint of the unity and visibility of God’s people as a spiritual community."
    },
    {
      "pk": 29049024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 24,
      "text": "Can prey be taken from the mighty, or captives of a tyrant be rescued?",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "The rhetorical question sets up the declaration of God’s power to save even when all seems impossible."
    },
    {
      "pk": 29049025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 25,
      "text": "For thus says the LORD: 'Even the captives of the mighty will be taken, and the prey of the tyrant will be rescued, for I will contend with those who contend with you, and I will save your children.'",
      "links": "<a href='/AIV/2/14/14'>Ex. 14:14</a>",
      "comment": "God Himself fights for His people’s deliverance—a promise of His direct intervention to accomplish salvation."
    },
    {
      "pk": 29049026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 49,
      "verse": 26,
      "text": "'And I will make your oppressors eat their own flesh, and they shall be drunk with their own blood as with wine. Then all flesh will know that I, the LORD, am your Savior and your Redeemer, the Mighty One of Jacob.'",
      "links": "<a href='/AIV/50/63/6'>Isa. 63:6</a>; <a href='/AIV/2/6/7'>Ex. 6:7</a>",
      "comment": "The graphic judgment of the oppressors highlights God’s justice and ultimate triumph. God's identity as Redeemer is affirmed, concluding a passage that ultimately points to His dramatic intervention in history and the fulfillment of His promises in Christ—hinting at God's visible, embodied action."
    }
  ],
  "translatedAt": "2025-12-24T08:14:04.179Z"
}