{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 63,
  "verses": [
    {
      "pk": 29063001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 1,
      "text": "Who is this coming from Edom, from Bozrah, with garments stained crimson? Who is this, splendid in his clothing, striding in his great strength? 'It is I, speaking with righteousness, mighty to save.'",
      "links": "<a href='/AIV/23/34/6'>Isa. 34:6</a>; <a href='/AIV/66/19/13-15'>Rev. 19:13-15</a>",
      "comment": "The speaker is identified as the Lord, depicted returning from Edom, symbolic of judgment. The description of 'crimson garments' and 'mighty to save' prefigures Christ—Revelation applies this imagery to Jesus (Rev. 19:13-15), emphasizing his authority and redemptive work. The text emphasizes a singular figure who alone brings salvation, supporting the importance of a mediator."
    },
    {
      "pk": 29063002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 2,
      "text": "Why are your garments red, and your clothes like one who treads the winepress?",
      "links": "<a href='/AIV/25/1/15'>Lam. 1:15</a>; <a href='/AIV/66/14/19-20'>Rev. 14:19-20</a>",
      "comment": "The prophet questions the striking appearance, reminiscent of one who tramples grapes. Trampling the winepress is a common biblical image for executing judgment (Lam. 1:15; Rev. 14:19-20). The singular treader suggests the unity and solitary mission of the Redeemer."
    },
    {
      "pk": 29063003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 3,
      "text": "'I have trodden the winepress alone, and from the peoples no one was with me. I trampled them in my anger and crushed them in my wrath; their lifeblood spattered my garments, and I stained all my clothing.'",
      "links": "<a href='/AIV/23/59/16'>Isa. 59:16</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "The figure acts alone, emphasizing the unique mediatorial role in salvation and judgment. The vivid imagery foreshadows final judgment seen in Revelation. Spiritual interpretation sees Christ's passion and suffering for the sins of the world."
    },
    {
      "pk": 29063004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 4,
      "text": "'For the day of vengeance was in my heart, and the year of my redemption had come.'",
      "links": "<a href='/AIV/23/61/2'>Isa. 61:2</a>; <a href='/AIV/42/4/19'>Luke 4:19</a>",
      "comment": "A contrast between vengeance (judgment) and redemption (salvation). Jesus references this motif (Luke 4:19), inaugurating the 'year of favor.' The convergence of justice and salvation points to the fulfillment in Christ’s ministry."
    },
    {
      "pk": 29063005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 5,
      "text": "'I looked, but there was no one to help; I was appalled, and there was no one to uphold. So my own arm brought me salvation, and my wrath sustained me.'",
      "links": "<a href='/AIV/23/59/16'>Isa. 59:16</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "The Lord acts by himself—his 'own arm' brings salvation, indicating all-sufficiency and the necessity of divine intervention. This prepares for the understanding of Christ’s exclusive mediatorship (1 Tim. 2:5)."
    },
    {
      "pk": 29063006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 6,
      "text": "'I trampled down the peoples in my anger; I made them drunk with my wrath, and I poured out their lifeblood on the ground.'",
      "links": "<a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/66/16/6'>Rev. 16:6</a>",
      "comment": "This verse shows the seriousness of judgment against the nations. The imagery of a cup of wrath reappears in the passion narratives, where Jesus drinks the cup on behalf of humanity (Matt. 26:39)."
    },
    {
      "pk": 29063007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 7,
      "text": "I will recount the steadfast love of the Lord, the praises of the Lord, according to all that the Lord has granted us, and the great goodness to the house of Israel that he has given them according to his compassion, according to the abundance of his steadfast love.",
      "links": "<a href='/AIV/19/89/1'>Ps. 89:1</a>; <a href='/AIV/25/3/22'>Lam. 3:22</a>",
      "comment": "Following judgment, the narrative shifts to praise for the Lord’s ‘steadfast love.’ The emphasis on God’s mercy and faithfulness is continual in salvation history. This recalls the importance of collective memory and praise in worship, as marked in Israel’s liturgies and continued in Christian tradition."
    },
    {
      "pk": 29063008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 8,
      "text": "For he said, 'Surely, they are my people, children who will not deal falsely.' And he became their Savior.",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>; <a href='/AIV/40/2/15'>Matt. 2:15</a>",
      "comment": "The idea of Israel as God’s children (Hos. 11:1) is fulfilled in Christ (Matt. 2:15). God’s faithfulness to his promise, even when his people fail, points to a Savior given for all."
    },
    {
      "pk": 29063009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 9,
      "text": "In all their affliction he was afflicted, and the angel of his presence saved them; in his love and in his pity he redeemed them; he lifted them up and carried them all the days of old.",
      "links": "<a href='/AIV/02/23/20'>Ex. 23:20</a>; <a href='/AIV/28/11/3-4'>Hos. 11:3-4</a>",
      "comment": "God’s closeness to his people is shown as he suffers with them ('In all their affliction...'). The 'angel of his presence' may be understood as a manifestation of the Lord himself, prefiguring the incarnational ministry of Christ."
    },
    {
      "pk": 29063010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 10,
      "text": "But they rebelled and grieved his Holy Spirit; so he turned to become their enemy, and he himself fought against them.",
      "links": "<a href='/AIV/19/78/40'>Ps. 78:40</a>; <a href='/AIV/49/4/30'>Eph. 4:30</a>",
      "comment": "This is one of the Old Testament references to the Holy Spirit as a personal being (Eph. 4:30), affirming the Trinity’s work throughout salvation history. Rebellion leads to divine discipline."
    },
    {
      "pk": 29063011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 11,
      "text": "Then his people remembered the days of old, of Moses and his people. Where is he who brought them up out of the sea with the shepherds of his flock? Where is he who put in the midst of them his Holy Spirit?",
      "links": "<a href='/AIV/02/14/30'>Ex. 14:30</a>; <a href='/AIV/04/11/16-17'>Num. 11:16-17</a>",
      "comment": "Israel recalls God’s mighty acts in the Exodus, linking the Spirit’s presence among the leaders of God’s people from early times. This sets a foundation for leadership under divine guidance, anticipated to continue in God’s plan for his people."
    },
    {
      "pk": 29063012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 12,
      "text": "Who led them by the right hand of Moses with his glorious arm, dividing the waters before them to make for himself an everlasting name?",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/23/52/10'>Isa. 52:10</a>",
      "comment": "God’s direct intervention accentuates his power and the importance of visible signs accompanying his acts—the miracles confirm his chosen instruments and his Name (see Acts 4:12 on salvation only in his Name)."
    },
    {
      "pk": 29063013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 13,
      "text": "Who led them through the depths? Like a horse in the desert, they did not stumble.",
      "links": "<a href='/AIV/05/1/31-33'>Deut. 1:31-33</a>",
      "comment": "The passage highlights God's faithful guidance through trial, an image fulfilled in Christ's leading his followers, and echoing the church as the new pilgrim people on their journey."
    },
    {
      "pk": 29063014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 14,
      "text": "As livestock go down into the valley, the Spirit of the Lord gave them rest. So you led your people, to make for yourself a glorious name.",
      "links": "<a href='/AIV/19/23/2-3'>Ps. 23:2-3</a>; <a href='/AIV/40/11/28-29'>Matt. 11:28-29</a>",
      "comment": "The Spirit's care is likened to shepherding, a pattern that carries into Jesus' description as the Good Shepherd offering rest (Matt. 11:28-29), and stresses God’s continuing guidance through the visible community of faith."
    },
    {
      "pk": 29063015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 15,
      "text": "Look down from heaven and see, from your holy and glorious habitation. Where are your zeal and your might? The yearning of your heart and your compassion are held back from me.",
      "links": "<a href='/AIV/05/26/15'>Deut. 26:15</a>; <a href='/AIV/19/80/14'>Ps. 80:14</a>",
      "comment": "A plea for renewed mercy. The request is addressed to the Lord enthroned above, linking the heavenly-temple imagery to ongoing intercession for God’s people (Heb. 7:25 on perpetual intercession)."
    },
    {
      "pk": 29063016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 16,
      "text": "For you are our Father, though Abraham does not know us, and Israel does not acknowledge us; you, O Lord, are our Father, our Redeemer from everlasting is your Name.",
      "links": "<a href='/AIV/23/64/8'>Isa. 64:8</a>; <a href='/AIV/40/6/9'>Matt. 6:9</a>",
      "comment": "God’s fatherhood transcends ancestry—salvation comes from being incorporated into the family of God, a core Christian theme. Spiritual adoption expands beyond old ethnic boundaries, fulfilled in Christ."
    },
    {
      "pk": 29063017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 17,
      "text": "Why, O Lord, do you make us wander from your ways and harden our heart, so that we fear you not? Return for the sake of your servants, the tribes of your heritage.",
      "links": "<a href='/AIV/02/4/21'>Ex. 4:21</a>; <a href='/AIV/19/74/2'>Ps. 74:2</a>",
      "comment": "This contains a mystery: human sin and God’s sovereignty. The plea for God’s intervention and restoration underscores humanity’s dependence on grace, and the essential role of community and intercession in returning to the Lord."
    },
    {
      "pk": 29063018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 18,
      "text": "Your holy people possessed your sanctuary but for a little while; our adversaries have trampled down your holy place.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>; <a href='/AIV/23/64/11'>Isa. 64:11</a>",
      "comment": "Reference to the loss of the temple/sanctuary, anticipating the centrality of a physical and spiritual dwelling of God. The theme of sacred space continues to have significance in worship and divine presence."
    },
    {
      "pk": 29063019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 63,
      "verse": 19,
      "text": "We have become like those over whom you have never ruled, like those who are not called by your Name. Oh, that you would tear open the heavens and come down, that the mountains might quake at your presence!",
      "links": "<a href='/AIV/23/64/1'>Isa. 64:1</a>; <a href='/AIV/40/3/16'>Matt. 3:16</a>",
      "comment": "The longing for God's intervention becomes explicit, preparing for the New Testament fulfillment when the heavens are opened at Jesus' baptism (Matt. 3:16). The expectation is for God to appear in history, as ultimately fulfilled in Christ’s incarnation and ongoing presence among his people."
    }
  ],
  "translatedAt": "2025-12-24T08:19:25.375Z"
}