{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 58,
  "verses": [
    {
      "pk": 29058001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 1,
      "text": "Cry aloud; do not hold back. Lift up your voice like a trumpet; declare to my people their transgression, and to the house of Jacob their sins.",
      "links": "<a href='/AIV/23/40/9'>Isa. 40:9</a>; <a href='/AIV/28/5/1'>Hos. 5:1</a>; <a href='/AIV/19/81/3'>Ps. 81:3</a>",
      "comment": "God commands Isaiah to openly announce Israel’s sins, showing the seriousness of their spiritual condition. The motif of prophetic rebuke is common (see also Hosea 5:1)."
    },
    {
      "pk": 29058002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 2,
      "text": "Yet they seek me daily, and delight to know my ways, as if they were a nation that did righteousness and did not forsake the judgment of their God; they ask of me righteous judgments, they delight in drawing near to God.",
      "links": "<a href='/AIV/24/12/2'>Jer. 12:2</a>; <a href='/AIV/19/50/16-17'>Ps. 50:16-17</a>",
      "comment": "Despite outward religious actions, the people’s hearts are far from God. This echoes later warnings from Jesus about hypocrisy (<a href='/AIV/40/23/27'>Matt. 23:27</a>)."
    },
    {
      "pk": 29058003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 3,
      "text": "‘Why have we fasted, and you do not see? Why have we humbled ourselves, and you take no notice?’ Behold, in the day of your fast you seek your own pleasure, and oppress all your workers.",
      "links": "<a href='/AIV/24/14/12'>Jer. 14:12</a>; <a href='/AIV/40/6/16'>Matt. 6:16</a>",
      "comment": "The religious practices lacked sincerity and justice, as they failed to show mercy to others. True fasting involves justice and genuine humility (<a href='/AIV/28/6/6'>Hos. 6:6</a>)."
    },
    {
      "pk": 29058004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 4,
      "text": "Behold, you fast only to quarrel and to fight and to strike with a wicked fist. Fasting like yours this day will not make your voice heard on high.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Empty religious practices, especially those coupled with injustice, cannot please God or earn His favor. Spiritual discipline must be united to love and charity."
    },
    {
      "pk": 29058005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 5,
      "text": "Is this the fast that I choose, a day for a man to humble himself? Is it to bow his head like a reed, and to spread sackcloth and ashes under him? Will you call this a fast, and a day acceptable to the LORD?",
      "links": "<a href='/AIV/32/3/6'>Jonah 3:6</a>; <a href='/AIV/40/6/16-18'>Matt. 6:16-18</a>",
      "comment": "External signs of penance, such as sackcloth and ashes, are not enough without true conversion of heart. God desires inward transformation."
    },
    {
      "pk": 29058006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 6,
      "text": "Is not this the fast that I choose: to loosen the bonds of wickedness, to undo the straps of the yoke, to let the oppressed go free, and to break every yoke?",
      "links": "<a href='/AIV/24/34/8-11'>Jer. 34:8-11</a>; <a href='/AIV/42/4/18'>Luke 4:18</a>",
      "comment": "True fasting is shown by works of mercy and justice. Jesus fulfills this ideal in His ministry, emphasizing liberation and healing (<a href='/AIV/42/4/18'>Luke 4:18</a>). A spiritual interpretation points to liberation from sin."
    },
    {
      "pk": 29058007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 7,
      "text": "Is it not to share your bread with the hungry and bring the homeless poor into your house; when you see the naked, to cover him, and not to hide yourself from your own flesh?",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/40/25/35-36'>Matt. 25:35-36</a>",
      "comment": "This verse anticipates Christ’s teaching in Matthew 25 about the final judgment. Works of charity are an essential part of living out faith, not merely optional."
    },
    {
      "pk": 29058008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 8,
      "text": "Then your light will break forth like the dawn, and your healing will spring up quickly. Your righteousness will go before you; the glory of the LORD will be your rear guard.",
      "links": "<a href='/AIV/23/52/12'>Isa. 52:12</a>; <a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "God promises spiritual renewal and protection for those who engage in true acts of mercy. The metaphor of light breaking forth is echoed in Jesus’ Sermon on the Mount."
    },
    {
      "pk": 29058009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 9,
      "text": "Then you will call, and the LORD will answer; you will cry, and he will say, 'Here I am.' If you take away the yoke from your midst, the pointing of the finger, and speaking wickedness,",
      "links": "<a href='/AIV/23/65/24'>Isa. 65:24</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "Answered prayer is connected to a life of justice and reconciliation. Removing oppression and slander restores fellowship with God."
    },
    {
      "pk": 29058010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 10,
      "text": "if you pour yourself out for the hungry and satisfy the desire of the afflicted, then your light shall rise in the darkness and your gloom be as the noonday.",
      "links": "<a href='/AIV/19/112/4'>Ps. 112:4</a>; <a href='/AIV/40/5/14'>Matt. 5:14</a>",
      "comment": "Spiritual light shines in those who practice self-giving love. This prefigures the Christian call to be the ‘light of the world’."
    },
    {
      "pk": 29058011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 11,
      "text": "The LORD will guide you always and satisfy your desires in scorched places, and make your bones strong; you will be like a watered garden, like a spring of water whose waters do not fail.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/23/41/18'>Isa. 41:18</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "God’s care for the faithful is described in terms of abundance and satisfaction. Jesus’ promise of living water is foreshadowed here (<a href='/AIV/43/4/14'>John 4:14</a>)."
    },
    {
      "pk": 29058012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 12,
      "text": "Your people will rebuild the ancient ruins; you shall raise up the foundations of many generations; you will be called the repairer of the breach, the restorer of streets to dwell in.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>; <a href='/AIV/23/61/4'>Isa. 61:4</a>",
      "comment": "Restoring the community and repairing divisions is seen as central to God’s plan. This points spiritually to the unity of God’s people and the importance of apostolic tradition and succession."
    },
    {
      "pk": 29058013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 13,
      "text": "If you turn back your foot from the Sabbath, from doing your pleasure on my holy day, and call the Sabbath a delight and the holy day of the LORD honorable; if you honor it, not going your own ways, or seeking your own pleasure, or talking idly,",
      "links": "<a href='/AIV/2/20/8'>Exod. 20:8</a>; <a href='/AIV/24/17/21-22'>Jer. 17:21-22</a>",
      "comment": "Right worship includes both external observance and inner reverence. The sanctification of holy days takes precedence over personal pursuits, suggesting the priority of divine worship and liturgy."
    },
    {
      "pk": 29058014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 58,
      "verse": 14,
      "text": "then you shall take delight in the LORD, and I will make you ride on the heights of the earth; I will feed you with the heritage of Jacob your father, for the mouth of the LORD has spoken.",
      "links": "<a href='/AIV/5/32/13'>Deut. 32:13</a>; <a href='/AIV/23/1/19'>Isa. 1:19</a>",
      "comment": "God promises joy and inheritance to those who faithfully worship and obey. The idea of inheritance prefigures the heavenly reward for the faithful. This also underscores the role of divine authority binding through what God has spoken."
    }
  ],
  "translatedAt": "2025-12-24T08:17:21.053Z"
}