{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 53,
  "verses": [
    {
      "pk": 29053001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 1,
      "text": "Who has believed what we have heard? And to whom has the arm of the LORD been revealed?",
      "links": "<a href='/AIV/43/12/38'>John 12:38</a>; <a href='/AIV/45/10/16'>Rom. 10:16</a>",
      "comment": "This verse expresses amazement at the lack of faith despite God's mighty actions. 'The arm of the LORD' often symbolizes God's saving power, ultimately fulfilled in Jesus Christ (see John 12:38)."
    },
    {
      "pk": 29053002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 2,
      "text": "For he grew up before him like a young plant, and like a root out of dry ground. He had no form or majesty to attract us, no beauty that we should desire him.",
      "links": "<a href='/AIV/11/19/12'>1 Kings 19:12</a>; <a href='/AIV/40/13/54-58'>Matt. 13:54-58</a>",
      "comment": "This verse emphasizes the humble origins and unassuming appearance of the Messiah. The 'root out of dry ground' hints at the surprising and miraculous nature of his coming (cf. Isa. 11:1)."
    },
    {
      "pk": 29053003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 3,
      "text": "He was despised and rejected by men, a man of sorrows and familiar with suffering. Like one from whom people hide their faces, he was despised, and we did not value him.",
      "links": "<a href='/AIV/41/15/29-32'>Mark 15:29-32</a>; <a href='/AIV/42/23/18-21'>Luke 23:18-21</a>",
      "comment": "The Messiah is described as carrying sorrows and rejection. Early Christian interpretation sees this fulfilled in Jesus's passion and crucifixion, where he was abandoned and despised (cf. Mark 15:29-32)."
    },
    {
      "pk": 29053004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 4,
      "text": "Surely he has borne our griefs and carried our sorrows; yet we considered him stricken, smitten by God, and afflicted.",
      "links": "<a href='/AIV/40/8/17'>Matt. 8:17</a>; <a href='/AIV/60/2/24'>1 Pet. 2:24</a>",
      "comment": "The Messiah bears the burdens of the people, a prophetic foreshadowing of Christ's atonement. Early Christians saw in this verse Jesus taking on the effects of sin and suffering for our sake."
    },
    {
      "pk": 29053005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 5,
      "text": "But he was pierced for our transgressions, crushed for our iniquities; upon him was the punishment that brought us peace, and by his wounds we are healed.",
      "links": "<a href='/AIV/43/19/34-37'>John 19:34-37</a>; <a href='/AIV/60/2/24'>1 Pet. 2:24</a>; <a href='/AIV/45/4/25'>Rom. 4:25</a>",
      "comment": "This is a direct prophecy of redemptive suffering: Jesus is 'pierced' (see John 19:34-37) and his suffering results in spiritual healing for believers. Note the substitutionary aspect—he suffers for our sins."
    },
    {
      "pk": 29053006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 6,
      "text": "All we like sheep have gone astray; each of us has turned to his own way; and the LORD has laid on him the iniquity of us all.",
      "links": "<a href='/AIV/19/119/176'>Ps. 119:176</a>; <a href='/AIV/60/2/25'>1 Pet. 2:25</a>",
      "comment": "This verse highlights universal sinfulness and the idea of substitutionary atonement—core to Christian understanding. Jesus bears the penalty for the waywardness of all."
    },
    {
      "pk": 29053007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 7,
      "text": "He was oppressed, and he was afflicted, yet he did not open his mouth; like a lamb led to the slaughter, and like a sheep before its shearers is silent, so he did not open his mouth.",
      "links": "<a href='/AIV/44/8/32-35'>Acts 8:32-35</a>; <a href='/AIV/40/26/63'>Matt. 26:63</a>",
      "comment": "The silence in suffering is notable in the Passion narratives (see Matt. 26:63). The Christological significance is vivid: Jesus is the true 'Lamb of God' who is silent before his accusers."
    },
    {
      "pk": 29053008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 8,
      "text": "By oppression and judgment he was taken away; and as for his generation, who considered that he was cut off from the land of the living, stricken for the transgression of my people?",
      "links": "<a href='/AIV/44/8/33'>Acts 8:33</a>; <a href='/AIV/27/9/26'>Dan. 9:26</a>",
      "comment": "'Cut off from the land of the living' refers to death. Jesus's rejection and suffering was for 'my people,' showing both personal and communal dimensions to his atonement."
    },
    {
      "pk": 29053009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 9,
      "text": "And they made his grave with the wicked and with a rich man in his death, although he had done no violence, and there was no deceit in his mouth.",
      "links": "<a href='/AIV/40/27/57-60'>Matt. 27:57-60</a>; <a href='/AIV/60/2/22'>1 Pet. 2:22</a>",
      "comment": "Fulfilled in Jesus' burial in a rich man’s tomb (see Matt. 27:57-60). His innocence is also emphasized, aligning with New Testament affirmations of Christ's sinlessness."
    },
    {
      "pk": 29053010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 10,
      "text": "Yet it was the LORD’s will to crush him; he has put him to grief; when his soul makes an offering for sin, he shall see his offspring, he shall prolong his days; and the will of the LORD shall prosper in his hand.",
      "links": "<a href='/AIV/45/8/3'>Rom. 8:3</a>; <a href='/AIV/19/22/30'>Ps. 22:30</a>",
      "comment": "The Messiah offers himself as a sacrifice, a 'guilt offering.' Remarkably, his apparent defeat becomes victory: he will see his offspring—a mysterious reference to spiritual children—and God’s will advances through his work. This aligns with deep Christian reflection on Jesus's self-offering."
    },
    {
      "pk": 29053011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 11,
      "text": "After the suffering of his soul, he will see and be satisfied; by his knowledge my righteous servant will make many righteous, and he will bear their iniquities.",
      "links": "<a href='/AIV/45/5/19'>Rom. 5:19</a>; <a href='/AIV/50/2/6-11'>Phil. 2:6-11</a>",
      "comment": "Through his suffering, the servant brings justification ('makes many righteous'), which the New Testament links directly to salvation in Christ. There is a theme here of mediation and ongoing benefit to the faithful, suggesting the enduring fruits of Christ’s sacrifice."
    },
    {
      "pk": 29053012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 53,
      "verse": 12,
      "text": "Therefore I will give him a portion with the many, and he shall divide the spoil with the strong; because he poured out his soul to death and was numbered with the transgressors; yet he bore the sin of many, and makes intercession for the transgressors.",
      "links": "<a href='/AIV/42/22/37'>Luke 22:37</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "The themes of victory, sacrificial death, and intercession are wrapped together here. The Messiah is exalted after his death, and continues to make intercession—a strong foundation for belief in both the finished work of Jesus and his ongoing mediating ministry. The verse unifies suffering, priesthood, and triumph."
    }
  ],
  "translatedAt": "2025-12-24T08:15:30.276Z"
}