{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 23,
  "verses": [
    {
      "pk": 29023001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 1,
      "text": "A prophecy against Tyre: Wail, O ships of Tarshish! For Tyre is laid waste and without house or harbor. From the land of Cyprus it is revealed to them.",
      "links": "<a href='/AIV/26/27/25'>Ezek. 27:25</a>; <a href='/AIV/23/2/16'>Isa. 2:16</a>",
      "comment": "Tyre, the mighty trading city, faces destruction—a warning for all who rely on worldly wealth. Tarshish, a distant trading partner, will hear and mourn the devastation (Ezek. 27:35). Spiritually, the judgment of Tyre foreshadows the judgment of all prideful nations. Christ calls His followers to place security not in earthly treasures (Matt. 6:19-21)."
    },
    {
      "pk": 29023002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 2,
      "text": "Be silent, you inhabitants of the coast, you merchants of Sidon, whom the sea filled, whose messengers crossed over the great waters.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>",
      "comment": "The call to silence is both a literal and spiritual command: be in awe at God’s judgment. Sidon, Tyre’s sister city, is addressed as a fellow seafaring merchant community. The sea as a source of wealth calls to mind humanity’s dependence on God’s provision, not merely human achievement."
    },
    {
      "pk": 29023003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 3,
      "text": "On many waters came the grain of the Nile, the harvest of the River was her revenue, and she was the marketplace of nations.",
      "links": "<a href='/AIV/26/27/17'>Ezek. 27:17</a>; <a href='/AIV/66/18/11'>Rev. 18:11</a>",
      "comment": "Tyre’s economic power depended on global trade, particularly with Egypt. This anticipates the way Babylon the Great is described in Revelation as a global marketplace, ripe for judgment. Prosperity, disconnected from God, leads to ruin (see Rev. 18:17-19)."
    },
    {
      "pk": 29023004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 4,
      "text": "Be ashamed, O Sidon, for the sea has spoken, the stronghold of the sea, saying, 'I have not labored nor given birth; I have not raised young men nor brought up virgins.'",
      "links": "<a href='/AIV/26/27/32'>Ezek. 27:32</a>",
      "comment": "Tyre is called 'the stronghold of the sea.' The city’s pride is rebuked, and its fall means it can no longer 'give birth'—symbolic of the end of prosperity and future generations (cf. Hosea 9:14). God’s sovereignty over even the mightiest cities is declared."
    },
    {
      "pk": 29023005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 5,
      "text": "When the news comes to Egypt, they will be in anguish at the report about Tyre.",
      "links": "<a href='/AIV/26/30/4'>Ezek. 30:4</a>",
      "comment": "Egypt, a powerful neighbor, is shaken by Tyre’s downfall, showing the far-reaching effects of God’s judgments. As all nations are interconnected, disaster for one is a warning to all about misplaced trust in commerce and alliances."
    },
    {
      "pk": 29023006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 6,
      "text": "Pass over to Tarshish; wail, you inhabitants of the coast!",
      "links": "<a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "Those from Tyre are told to flee to Tarshish, representing the scattering of God’s judgment. The call to mourn illustrates the costliness of ignoring God’s will."
    },
    {
      "pk": 29023007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 7,
      "text": "Is this your joyous city, whose origin is from ancient days, whose feet carried her to settle far away?",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "Tyre, once full of joy and ancient pride, is humbled. The reference to 'ancient days' points to a historic hubris—a reminder that no empire is eternal. Humility before God, not pride in tradition, is what endures (James 4:6)."
    },
    {
      "pk": 29023008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 8,
      "text": "Who has planned this against Tyre, the bestower of crowns, whose merchants were princes, whose traders were the honored of the earth?",
      "links": "<a href='/AIV/23/14/26-27'>Isa. 14:26-27</a>",
      "comment": "This rhetorical question highlights God as the Master Planner. Human greatness, such as Tyre’s granting authority, is subject to divine will. All true authority, including that over nations and commerce, comes from God (John 19:11)."
    },
    {
      "pk": 29023009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 9,
      "text": "The LORD of armies has planned it, to bring down all pride in magnificence, to humble all the honored of the earth.",
      "links": "<a href='/AIV/23/2/11-17'>Isa. 2:11-17</a>; <a href='/AIV/42/1/52'>Luke 1:52</a>",
      "comment": "God actively opposes the proud and exalts the humble (see the Magnificat, Luke 1:52). His judgment on Tyre anticipates the final humbling of all powers before Christ. Spiritually, believers are called to ongoing humility and dependence upon the Lord."
    },
    {
      "pk": 29023010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 10,
      "text": "Cross your land like the Nile, O daughter of Tarshish; there is no more restraint.",
      "links": "<a href='/AIV/24/47/2'>Jer. 47:2</a>",
      "comment": "The image of the Nile flooding implies overwhelming judgment, and with 'no more restraint,' the security once enjoyed is gone. This points to the consequences of forsaking divine boundaries—reminiscent of the loss of original grace in Eden (Gen. 3)."
    },
    {
      "pk": 29023011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 11,
      "text": "He has stretched out his hand over the sea; he has shaken kingdoms. The LORD has commanded concerning Canaan to destroy its strongholds.",
      "links": "<a href='/AIV/26/26/15'>Ezek. 26:15</a>; <a href='/AIV/19/89/9'>Ps. 89:9</a>",
      "comment": "God’s sovereignty extends to the sea and nations. The reference to Canaan here signifies all the land where Tyre’s influence reached. God’s power over chaos and nations is fulfilled completely in Christ, who calms storms and reigns over kingdoms (Mark 4:39)."
    },
    {
      "pk": 29023012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 12,
      "text": "He said: 'You shall no longer rejoice, O oppressed virgin daughter of Sidon. Arise, pass over to Cyprus, but even there you will find no rest.'",
      "links": "<a href='/AIV/23/47/1'>Isa. 47:1</a>",
      "comment": "God’s justice is inescapable; even in exile, there is no lasting rest apart from Him. Christ later offers the true rest and restoration to the oppressed (Matt. 11:28-29)."
    },
    {
      "pk": 29023013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 13,
      "text": "Look! The land of the Chaldeans—this was not a people; Assyria established it for desert creatures, raised its siege towers, stripped its palaces, and made it a ruin.",
      "links": "<a href='/AIV/13/1/17'>Gen. 11:31</a>; <a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "The rise and fall of empires like Assyria and the Chaldeans is governed by God. Historical transitions remind us that lasting heritage and security are ultimately spiritual in nature (Phil. 3:20)."
    },
    {
      "pk": 29023014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 14,
      "text": "Wail, O ships of Tarshish! For your stronghold is laid waste.",
      "links": "<a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "A refrain from verse 1, emphasizing the collapse of the merchant fleet. Loss of security in earthly strength is a repeated biblical warning (Ps. 20:7)."
    },
    {
      "pk": 29023015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 15,
      "text": "In that day Tyre will be forgotten for seventy years, like the days of one king. After seventy years, it will happen to Tyre as in the song of the prostitute:",
      "links": "<a href='/AIV/24/25/11-12'>Jer. 25:11-12</a>",
      "comment": "Seventy years signifies a complete period of judgment (see Jer. 25:12). Tyre’s restoration, though incomplete, anticipates cycles of penance and renewal in salvation history. The fate of Tyre foreshadows the necessity of purgation and ultimate restoration (cf. 1 Cor. 3:15)."
    },
    {
      "pk": 29023016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 16,
      "text": "'Take a harp, go about the city, forgotten prostitute; play skillfully, sing many songs, so that you may be remembered.'",
      "links": "<a href='/AIV/25/1/2'>Lam. 1:2</a>",
      "comment": "Tyre, depicted as a prostitute, will try to regain former glory through worldly charm. This image of spiritual unfaithfulness is also picked up in Revelation (Rev. 17:1-5). The futility of seeking salvation apart from God’s covenant is stressed, while music points to both lament and the hope of eventual redemption."
    },
    {
      "pk": 29023017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 17,
      "text": "After seventy years, the LORD will visit Tyre, and she will return to her wages and play the prostitute with all the kingdoms of the world on the face of the earth.",
      "links": "<a href='/AIV/66/18/3'>Rev. 18:3</a>; <a href='/AIV/26/16/28-29'>Ezek. 16:28-29</a>",
      "comment": "Despite judgment, Tyre persists in worldly pursuits. This mirrors the recurring pattern of human sin and God’s patient mercy—a theme resolved in Christ, who redeems even the greatest failures for divine purposes."
    },
    {
      "pk": 29023018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 23,
      "verse": 18,
      "text": "Yet her gain and her wages will be set apart for the LORD. It will not be stored or hoarded, but her merchandise will belong to those who dwell before the LORD, to eat their fill and wear fine clothing.",
      "links": "<a href='/AIV/23/61/6'>Isa. 61:6</a>; <a href='/AIV/19/68/18'>Ps. 68:18</a>; <a href='/AIV/45/15/16'>Rom. 15:16</a>",
      "comment": "The final verse points to divine providence: even former sins can be transformed for holiness and service to God’s people. All good things are meant to be consecrated to the Lord, a foreshadowing of how Christ redeems and integrates all things into the worship and life of the Church (cf. Rom. 15:16)."
    }
  ],
  "translatedAt": "2025-12-24T08:01:05.036Z"
}