{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 41,
  "verses": [
    {
      "pk": 29041001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 1,
      "text": "Keep silent before Me, coastlands, and let the peoples renew their strength. Let them come near, then let them speak; let us meet together for judgment.",
      "links": "<a href='/AIV/29/40/31'>Isa. 40:31</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "God calls all nations to come before Him in reverence and silence, an image of a universal calling before divine judgment. The theme of renewed strength connects with the spiritual idea of grace sustaining the faithful."
    },
    {
      "pk": 29041002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 2,
      "text": "Who has stirred up one from the east, whom He calls in righteousness to His feet? He gives nations into his hand and makes him rule over kings; He makes them like dust before his sword, like blown chaff before his bow.",
      "links": "<a href='/AIV/01/15/6-7'>Gen. 15:6-7</a>; <a href='/AIV/29/45/1'>Isa. 45:1</a>",
      "comment": "Traditionally interpreted as referring to Cyrus of Persia, raised by God as an instrument of justice. The motif of God using kings for His purpose prefigures the sovereignty of Christ in salvation history."
    },
    {
      "pk": 29041003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 3,
      "text": "He pursues them, passing safely by a path his feet have not traveled.",
      "links": "<a href='/AIV/19/18/33'>Ps. 18:33</a>; <a href='/AIV/29/42/16'>Isa. 42:16</a>",
      "comment": "God’s chosen leader passes unhindered, an image of providential guidance and protection that resonates with the divine safeguarding of Christ. The 'new path' echoes the journey of the Gospel."
    },
    {
      "pk": 29041004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 4,
      "text": "Who has done and accomplished this, calling the generations from the beginning? I, the LORD, am the first; and with the last—I am He.",
      "links": "<a href='/AIV/66/01/8'>Rev. 1:8</a>; <a href='/AIV/29/44/6'>Isa. 44:6</a>",
      "comment": "God identifies Himself as the eternal One, the 'first and last,' which is echoed in Revelation referring to the divinity of Jesus. This foreshadows the unity of God and Christ’s role in salvation."
    },
    {
      "pk": 29041005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 5,
      "text": "The coastlands saw and feared, the ends of the earth trembled; they drew near and came.",
      "links": "<a href='/AIV/29/42/4'>Isa. 42:4</a>; <a href='/AIV/19/98/3'>Ps. 98:3</a>",
      "comment": "The reaction of distant nations reveals God’s global reach. This echoes the promise that salvation is for all peoples, a theme fulfilled in the New Covenant."
    },
    {
      "pk": 29041006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 6,
      "text": "Everyone helps his neighbor and says to his brother, 'Be strong!'",
      "links": "<a href='/AIV/02/17/12'>Ex. 17:12</a>; <a href='/AIV/47/13/11'>2 Cor. 13:11</a>",
      "comment": "Encouragement among men contrasts with the strength that comes from God alone. This foreshadows the spiritual fellowship in the Church, which is strengthened by unity."
    },
    {
      "pk": 29041007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 7,
      "text": "The craftsman encourages the goldsmith, and he who smooths with the hammer urges him who strikes the anvil, saying of the soldering, 'It is good.' And they secure it with nails so it will not totter.",
      "links": "<a href='/AIV/29/44/12-17'>Isa. 44:12–17</a>; <a href='/AIV/09/06/4'>1 Sam. 6:4</a>",
      "comment": "The making of idols is depicted ironically; despite human effort, these false gods are powerless. Spiritual strength comes not from created things but God’s presence."
    },
    {
      "pk": 29041008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 8,
      "text": "But you, Israel, My servant, Jacob whom I have chosen, descendant of Abraham My friend—",
      "links": "<a href='/AIV/01/12/1-3'>Gen. 12:1–3</a>; <a href='/AIV/02/32/13'>Ex. 32:13</a>",
      "comment": "The designation of Israel as 'servant' connects with Christ, the suffering servant. God’s intimate friendship with Abraham foreshadows a personal relationship realized in Christ."
    },
    {
      "pk": 29041009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 9,
      "text": "I took you from the ends of the earth, called you from its remotest parts, and said to you, 'You are My servant; I have chosen you and not rejected you.'",
      "links": "<a href='/AIV/05/07/6'>Deut. 7:6</a>; <a href='/AIV/29/42/1'>Isa. 42:1</a>",
      "comment": "Emphasizes divine election and calling. God’s choice points to the unmerited grace bestowed upon His people, a theme manifest in Christ’s universal call."
    },
    {
      "pk": 29041010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 10,
      "text": "Do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you, surely I will help you, I will uphold you with My righteous right hand.",
      "links": "<a href='/AIV/05/31/6'>Deut. 31:6</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "A promise of God’s abiding presence, fulfilled in Christ’s assurance to His disciples. The 'right hand' symbolizes mercy and power, assuring believers of spiritual perseverance."
    },
    {
      "pk": 29041011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 11,
      "text": "Behold, all who are angry at you will be ashamed and disgraced; those who oppose you will be as nothing and perish.",
      "links": "<a href='/AIV/19/25/2-3'>Ps. 25:2-3</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "God’s protection over His chosen foreshadows Christ’s promise to His Church that the gates of hell will not prevail against it."
    },
    {
      "pk": 29041012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 12,
      "text": "You shall seek your enemies, but you will not find them. Those who contend with you shall be nothing at all.",
      "links": "<a href='/AIV/29/54/17'>Isa. 54:17</a>; <a href='/AIV/19/37/10'>Ps. 37:10</a>",
      "comment": "An assurance that God will remove opponents, a principle that supports both physical and spiritual victory, realized fully in Christ defeating sin and death."
    },
    {
      "pk": 29041013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 13,
      "text": "For I, the LORD your God, hold your right hand, saying to you, 'Do not fear; I will help you.'",
      "links": "<a href='/AIV/19/73/23'>Ps. 73:23</a>; <a href='/AIV/43/14/18'>John 14:18</a>",
      "comment": "Personal care and guidance from God foreshadow Christ’s promise of the Holy Spirit's presence with believers."
    },
    {
      "pk": 29041014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 14,
      "text": "'Do not fear, you worm Jacob, you men of Israel; I will help you,' says the LORD, your Redeemer, the Holy One of Israel.",
      "links": "<a href='/AIV/29/43/14'>Isa. 43:14</a>; <a href='/AIV/45/11/26'>Rom. 11:26</a>",
      "comment": "The humility of Jacob stresses God’s power in weakness. The Redeemer motif is a direct prophecy of Christ, the Holy One who delivers Israel."
    },
    {
      "pk": 29041015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 15,
      "text": "Behold, I make you a new, sharp threshing sledge with double edges; you will thresh mountains and crush them, and reduce hills to chaff.",
      "links": "<a href='/AIV/29/2/2'>Isa. 2:2</a>; <a href='/AIV/29/17/13'>Isa. 17:13</a>",
      "comment": "The transformation to strength alludes to spiritual renewal and victory over obstacles. The imagery points to the spiritual mission of the faithful empowered by grace."
    },
    {
      "pk": 29041016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 16,
      "text": "You will winnow them, and the wind will carry them away, a storm will scatter them. But you will rejoice in the LORD and glory in the Holy One of Israel.",
      "links": "<a href='/AIV/19/35/9'>Ps. 35:9</a>; <a href='/AIV/29/12/6'>Isa. 12:6</a>",
      "comment": "Joy comes from victory in the Lord, reminding believers of the communal celebration of spiritual triumph."
    },
    {
      "pk": 29041017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 17,
      "text": "The poor and needy seek water, but there is none; their tongues are parched with thirst. I, the LORD, will answer them; I, the God of Israel, will not forsake them.",
      "links": "<a href='/AIV/19/107/9'>Ps. 107:9</a>; <a href='/AIV/40/5/6'>Matt. 5:6</a>",
      "comment": "A promise to the poor, recalling Jesus’ words about thirst for righteousness. God’s faithfulness is a recurring theme."
    },
    {
      "pk": 29041018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 18,
      "text": "I will open rivers on barren heights, and fountains in the midst of valleys; I will make the wilderness a pool of water, and the dry land springs of water.",
      "links": "<a href='/AIV/43/7/37-38'>John 7:37-38</a>; <a href='/AIV/29/35/7'>Isa. 35:7</a>",
      "comment": "Images of water in barren places hint at spiritual renewal and baptismal grace, fully realized in the New Testament imagery of living water."
    },
    {
      "pk": 29041019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 19,
      "text": "I will plant in the wilderness the cedar, the acacia, the myrtle, and the olive tree; I will set the cypress, the pine, and the box tree together in the desert.",
      "links": "<a href='/AIV/29/60/13'>Isa. 60:13</a>; <a href='/AIV/29/55/13'>Isa. 55:13</a>",
      "comment": "Trees symbolize abundance and God’s ordered creation, echoing spiritual fruitfulness brought by the Spirit."
    },
    {
      "pk": 29041020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 20,
      "text": "So that all may see and know, consider and understand together, that the hand of the LORD has done this, and the Holy One of Israel has created it.",
      "links": "<a href='/AIV/29/43/7'>Isa. 43:7</a>; <a href='/AIV/29/45/12'>Isa. 45:12</a>",
      "comment": "God’s power is manifest for all people to witness, showing unity in knowledge and faith, a spiritual foretaste of universal congregation."
    },
    {
      "pk": 29041021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 21,
      "text": "Present your case,' says the LORD. 'Bring forth your arguments,' says the King of Jacob.",
      "links": "<a href='/AIV/29/43/9'>Isa. 43:9</a>; <a href='/AIV/19/47/7'>Ps. 47:7</a>",
      "comment": "God challenges idols to stand trial, underscoring His role as just Judge, anticipating Christ’s authority to judge."
    },
    {
      "pk": 29041022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 22,
      "text": "Let them bring forth and show us what will happen; let them tell us former things, what they were, that we may consider them and know their outcome; or declare to us things to come.",
      "links": "<a href='/AIV/05/18/22'>Deut. 18:22</a>; <a href='/AIV/29/44/7'>Isa. 44:7</a>",
      "comment": "A test of false gods; only God reveals past, present, and future, foreshadowing the prophetic and teaching authority given to Christ."
    },
    {
      "pk": 29041023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 23,
      "text": "Declare what is yet to come, so that we may know you are gods. Indeed, do something good or bad, that we may be amazed and see it together.",
      "links": "<a href='/AIV/29/44/26'>Isa. 44:26</a>; <a href='/AIV/29/46/10'>Isa. 46:10</a>",
      "comment": "Ability to predict and ordain events is unique to God, confirming His sovereignty over history—a quality also essential to Christ’s divinity."
    },
    {
      "pk": 29041024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 24,
      "text": "See, you are nothing, and your work is nothing; he who chooses you is an abomination.",
      "links": "<a href='/AIV/29/44/9-20'>Isa. 44:9–20</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4–8</a>",
      "comment": "Harsh judgment on idolatry. This underscores the spiritual purity requisite in true worship and the importance of rejecting false doctrines."
    },
    {
      "pk": 29041025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 25,
      "text": "I have stirred up one from the north, and he comes; from the rising of the sun he will call upon My name. He will trample rulers as on mortar, as the potter treads clay.",
      "links": "<a href='/AIV/29/44/28'>Isa. 44:28</a>; <a href='/AIV/10/22/43'>2 Sam. 22:43</a>",
      "comment": "Cyrus is a type who foreshadows Christ’s universal dominion, as Christ alone truly fulfills calling upon God’s name and ruling with authority."
    },
    {
      "pk": 29041026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 26,
      "text": "Who declared it from the beginning, that we might know? Or beforehand, that we might say, ‘He is right’? Truly, there is none who declares, none who proclaims, none who hears your words.",
      "links": "<a href='/AIV/29/45/21'>Isa. 45:21</a>; <a href='/AIV/05/32/7'>Deut. 32:7</a>",
      "comment": "No idol speaks truth; only God reveals and proclaims, pointing to the revealed Word incarnate in Jesus."
    },
    {
      "pk": 29041027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 27,
      "text": "I was the first to say to Zion, ‘Look! Here they are!’ and I gave Jerusalem a messenger of good news.",
      "links": "<a href='/AIV/29/40/9'>Isa. 40:9</a>; <a href='/AIV/42/2/10'>Luke 2:10</a>",
      "comment": "The messenger of good news prefigures the Gospel itself, and this promise anticipates the role of apostolic and prophetic proclamation."
    },
    {
      "pk": 29041028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 28,
      "text": "When I looked, there was no one; there was no counselor among them, who, when I asked, could answer a word.",
      "links": "<a href='/AIV/29/59/16'>Isa. 59:16</a>; <a href='/AIV/18/33/23'>Job 33:23</a>",
      "comment": "No human counsel suffices; only God provides true wisdom, foreshadowing Christ as the ultimate Counselor."
    },
    {
      "pk": 29041029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 41,
      "verse": 29,
      "text": "See, they are all vanity, their works are nothing; their molded images are wind and confusion.",
      "links": "<a href='/AIV/19/135/17-18'>Ps. 135:17-18</a>; <a href='/AIV/19/115/5-8'>Ps. 115:5-8</a>",
      "comment": "The futility of idols is exposed. The call to renounce false images finds fulfillment in the embrace of true worship, which is spiritual and centered on God’s revelation."
    }
  ],
  "translatedAt": "2025-12-24T08:09:56.122Z"
}