{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 28,
  "verses": [
    {
      "pk": 29028001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 1,
      "text": "Woe to the proud crown of the drunkards of Ephraim, and to the fading flower of its glorious beauty, which sits at the head of the fertile valley, those overcome by wine!",
      "links": "<a href='/AIV/23/5/11'>Isa. 5:11</a>; <a href='/AIV/28/7/1'>Hos. 7:1-5</a>",
      "comment": "Isaiah denounces the leaders of Ephraim (the northern kingdom) for pride and drunkenness. The image of a fading flower suggests the temporary nature of earthly glory. This passage emphasizes the need for vigilance and sobriety in leadership, a perennial Christian teaching."
    },
    {
      "pk": 29028002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 2,
      "text": "Behold, the Lord has a mighty and strong one; like a storm of hail, a destroying tempest, like a flood of mighty waters overflowing, He will cast it down to the earth with His hand.",
      "links": "<a href='/AIV/23/30/30'>Isa. 30:30</a>; <a href='/AIV/23/8/7'>Isa. 8:7-8</a>",
      "comment": "God's judgment is compared to unstoppable natural disasters, signifying the certainty and severity of divine intervention against pride and sin."
    },
    {
      "pk": 29028003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 3,
      "text": "The proud crown of the drunkards of Ephraim will be trampled underfoot.",
      "links": "<a href='/AIV/23/28/1'>Isa. 28:1</a>",
      "comment": "Reiterates the impending fall of Ephraim’s leadership. This foreshadows the inevitable downfall of human pride before the sovereignty of God."
    },
    {
      "pk": 29028004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 4,
      "text": "And the fading flower of his glorious beauty, which is at the head of the fertile valley, will be like the first-ripe fig before the summer; when someone sees it, he swallows it as soon as it is in his hand.",
      "links": "<a href='/AIV/24/24/2'>Jer. 24:2</a>",
      "comment": "The fragile glory of Ephraim is compared to an early fig, quickly consumed and gone. Early Church interpretation sees this as a warning of attachment to fleeting things."
    },
    {
      "pk": 29028005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 5,
      "text": "In that day the Lord of hosts will be a crown of glory and a diadem of beauty to the remnant of His people,",
      "links": "<a href='/AIV/23/4/2'>Isa. 4:2</a>; <a href='/AIV/55/4/8'>2 Tim. 4:8</a>",
      "comment": "A shift occurs here from judgment to hope. God Himself replaces human pride as the true source of honor and beauty for the faithful remnant, prefiguring the call to find glory in God alone."
    },
    {
      "pk": 29028006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 6,
      "text": "a spirit of justice to him who sits in judgement, and strength to those who turn back the battle at the gate.",
      "links": "<a href='/AIV/11/3/9'>1 Kings 3:9</a>; <a href='/AIV/35/2/1'>Hab. 2:1</a>",
      "comment": "God provides justice and strength to faithful leaders, reinforcing the importance of righteous governance and spiritual fortitude."
    },
    {
      "pk": 29028007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 7,
      "text": "But these also reel with wine and stagger with strong drink; priest and prophet reel with strong drink, they are swallowed by wine, they stagger with strong drink; they err in vision, they stumble in judgment.",
      "links": "<a href='/AIV/23/56/10-12'>Isa. 56:10-12</a>; <a href='/AIV/28/4/11'>Hos. 4:11-12</a>",
      "comment": "Even spiritual leaders have become corrupt, highlighting the need for authority purified from within. This draws attention to the need for spiritual sobriety and authentic leadership."
    },
    {
      "pk": 29028008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 8,
      "text": "For all tables are full of filthy vomit, with no place left clean.",
      "links": "<a href='/AIV/19/69/22'>Ps. 69:22</a>",
      "comment": "Vivid language shows the extent of moral and ritual impurity. The call to purity is a thread from old to new covenant practice (see 1 Cor. 5:7-8)."
    },
    {
      "pk": 29028009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 9,
      "text": "Whom will He teach knowledge? Whom will He make to understand the message? Those weaned from milk? Those taken from the breast?",
      "links": "<a href='/AIV/58/5/12-14'>Heb. 5:12-14</a>; <a href='/AIV/28/4/6'>Hos. 4:6</a>",
      "comment": "The people are spiritually immature, unable to take deeper teaching. This theme is echoed in the call for mature doctrine elsewhere in Scripture."
    },
    {
      "pk": 29028010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 10,
      "text": "For it is: command upon command, command upon command, line upon line, line upon line, here a little, there a little.",
      "links": "<a href='/AIV/23/28/13'>Isa. 28:13</a>",
      "comment": "This phrase may mimic childish babble, highlighting how even the simplest teachings are not understood. Layers of instruction point to tradition and structure in interpretation."
    },
    {
      "pk": 29028011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 11,
      "text": "For by people of strange lips and a foreign tongue the Lord will speak to this people,",
      "links": "<a href='/AIV/46/14/21'>1 Cor. 14:21</a>; <a href='/AIV/05/28/49'>Deut. 28:49</a>",
      "comment": "Foretells judgment through foreign invaders, a sign of not listening to God. Paul cites this in reference to tongues as a sign (see 1 Cor. 14:21)."
    },
    {
      "pk": 29028012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 12,
      "text": "to whom He said, 'This is rest; give rest to the weary; and this is repose,' yet they would not hear.",
      "links": "<a href='/AIV/24/6/16'>Jer. 6:16</a>; <a href='/AIV/40/11/28'>Matt. 11:28</a>",
      "comment": "God offers true rest, but the people reject it. Spiritually, this foreshadows Christ's invitation to the weary (Matt. 11:28)."
    },
    {
      "pk": 29028013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 13,
      "text": "And so the word of the Lord will be to them: command upon command, command upon command, line upon line, line upon line, here a little, there a little, so that they may go, and fall backward, and be broken, and snared, and taken.",
      "links": "<a href='/AIV/19/69/22'>Ps. 69:22</a>; <a href='/AIV/23/8/15'>Isa. 8:15</a>",
      "comment": "When the Word is not received in faith, it becomes a stumbling block. This ties with the dual effect of God's Word — to build up or to judge (see Rom. 9:33)."
    },
    {
      "pk": 29028014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 14,
      "text": "Therefore, hear the word of the Lord, you scoffers, who rule this people in Jerusalem:",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "Judgment shifts from Ephraim to the rulers in Jerusalem, warning leaders who scorn God’s warnings."
    },
    {
      "pk": 29028015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 15,
      "text": "Because you have said, 'We have made a covenant with death, and with Sheol we have an agreement. When the overwhelming scourge passes through, it will not come to us, for we have made lies our refuge, and in falsehood we have taken shelter.'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>; <a href='/AIV/23/5/18'>Isa. 5:18-19</a>",
      "comment": "The rulers trust in false solutions rather than God, a timeless warning about spiritual compromise and reliance on human schemes."
    },
    {
      "pk": 29028016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 16,
      "text": "Therefore thus says the Lord God: 'Behold, I am laying in Zion a stone, a tested stone, a precious cornerstone, of a sure foundation; whoever believes will not panic.'",
      "links": "<a href='/AIV/60/2/6'>1 Pet. 2:6</a>; <a href='/AIV/45/9/33'>Rom. 9:33</a>; <a href='/AIV/19/118/22'>Ps. 118:22</a>",
      "comment": "This prophecy is fulfilled in Christ, the cornerstone and foundation of the Church (see 1 Pet. 2:6-7). Faith in Him brings security and peace."
    },
    {
      "pk": 29028017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 17,
      "text": "And I will make justice the measuring line and righteousness the plumb line; hail will sweep away the refuge of lies, and waters will overwhelm the shelter.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>; <a href='/AIV/26/13/13-14'>Ezek. 13:13-14</a>",
      "comment": "God’s standards are absolute; judgment exposes false security. Authentic faith is measured by God’s justice and righteousness — not by mere appearances."
    },
    {
      "pk": 29028018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 18,
      "text": "Then your covenant with death will be annulled, and your agreement with Sheol will not stand; when the overwhelming scourge passes through, you will be beaten down by it.",
      "links": "<a href='/AIV/23/28/15'>Isa. 28:15</a>",
      "comment": "Trust in anything but God will fail in the end. This verse teaches the insufficiency of any salvation apart from God."
    },
    {
      "pk": 29028019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 19,
      "text": "As often as it passes through it will take you; for morning by morning it will pass through, by day and by night; and it will be sheer terror to understand the message.",
      "links": "<a href='/AIV/19/55/5'>Ps. 55:5</a>; <a href='/AIV/23/8/12'>Isa. 8:12</a>",
      "comment": "The relentless nature of judgment underscores the seriousness of ignoring God's message."
    },
    {
      "pk": 29028020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 20,
      "text": "For the bed is too short to stretch oneself on, and the covering too narrow to wrap oneself in.",
      "links": "<a href='/AIV/18/18/14'>Job 18:14</a>",
      "comment": "This image describes the inadequacy of false security compared to what God offers. Only true faith provides sufficient rest and protection."
    },
    {
      "pk": 29028021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 21,
      "text": "For the Lord will rise up as on Mount Perazim, He will be stirred up as in the Valley of Gibeon, to do His work, His strange work, and to perform His task, His alien task.",
      "links": "<a href='/AIV/10/5/20'>2 Sam. 5:20</a>; <a href='/AIV/06/10/12'>Josh. 10:12</a>",
      "comment": "God’s judgment is extraordinary, reminding us that divine correction, though unusual, is sometimes necessary for salvation’s sake."
    },
    {
      "pk": 29028022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 22,
      "text": "Now therefore do not scoff, lest your bonds be made strong; for I have heard a decree of destruction from the Lord God of hosts against the whole land.",
      "links": "<a href='/AIV/23/10/23'>Isa. 10:23</a>; <a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>",
      "comment": "There is a call to repentance even in the face of coming judgment. God’s warning is an act of mercy, offering the opportunity to turn."
    },
    {
      "pk": 29028023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 23,
      "text": "Give ear and hear my voice; pay attention and hear my speech.",
      "links": "<a href='/AIV/19/81/8'>Ps. 81:8-13</a>",
      "comment": "A plea to listen — echoes throughout Scripture, showing God's desire for a people who truly hear and obey."
    },
    {
      "pk": 29028024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 24,
      "text": "Does the plowman plow all day to sow? Does he continually open and break up his ground?",
      "links": "<a href='/AIV/24/4/3'>Jer. 4:3</a>",
      "comment": "God’s discipline is purposeful, not endless punishment. The agricultural metaphor teaches that judgment is for fruitful preparation."
    },
    {
      "pk": 29028025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 25,
      "text": "When he has leveled its surface, does he not sow dill and scatter cumin, and put in wheat in rows and barley in its proper place, and spelt as the border?",
      "links": "<a href='/AIV/40/13/3-9'>Matt. 13:3-9</a>",
      "comment": "The seed is sown in the right place and at the right time, echoing the careful plan of God in salvation history."
    },
    {
      "pk": 29028026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 26,
      "text": "For his God instructs him and teaches him the right way.",
      "links": "<a href='/AIV/19/32/8'>Ps. 32:8</a>",
      "comment": "True wisdom comes from recognizing God's guidance in all things, including trials and discipline (Heb. 12:5-11)."
    },
    {
      "pk": 29028027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 27,
      "text": "For dill is not threshed with a threshing sledge, nor is a cart wheel rolled over cumin; but dill is beaten out with a stick, and cumin with a rod.",
      "links": "<a href='/AIV/19/103/13-14'>Ps. 103:13-14</a>",
      "comment": "God’s discipline is measured and appropriate. Different means for different people: the divine method is always just."
    },
    {
      "pk": 29028028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 28,
      "text": "Bread grain is crushed, but he does not thresh it forever. He drives his cart wheel over it, but does not pulverize it.",
      "links": "<a href='/AIV/19/94/12'>Ps. 94:12</a>",
      "comment": "God’s correction is precise — always directed toward the good of His people (see Rom. 8:28)."
    },
    {
      "pk": 29028029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 28,
      "verse": 29,
      "text": "This also comes from the Lord of hosts; He is wonderful in counsel and excellent in wisdom.",
      "links": "<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "All wisdom, including the wisdom of how and when to discipline, comes from God. Christ is often called 'Wonderful Counselor,' connecting this to the messianic hope."
    }
  ],
  "translatedAt": "2025-12-24T08:03:41.350Z"
}