{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 20,
  "verses": [
    {
      "pk": 29020001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 1,
      "text": "In the year that the commander came to Ashdod—when Sargon, king of Assyria, sent him and he attacked Ashdod and captured it—",
      "links": "<a href='/AIV/12/18/17'>2 Kgs 18:17</a>; <a href='/AIV/23/36/2'>Isa. 36:2</a>",
      "comment": "This sets the historical context during the reign of Sargon of Assyria, linking to the broader Assyrian campaigns in the region. Ashdod, an important Philistine city, becomes a symbol of judgment on nations resisting God’s purpose. The specific dating anchors the prophecy in Israel’s salvation history."
    },
    {
      "pk": 29020002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 2,
      "text": "At that time the Lord spoke through Isaiah son of Amoz, saying, “Go, remove the sackcloth from your body and take the sandals off your feet.” And he did so, walking naked and barefoot.",
      "links": "<a href='/AIV/1/3/7'>Gen. 3:7</a>; <a href='/AIV/20/12/6'>Ezek. 12:6</a>",
      "comment": "Isaiah’s act is a prophetic sign—his nakedness a symbol of shame, exile, and defeat. Public prophetic actions are a powerful, embodied means of revelation, prefiguring how God’s messengers may suffer for their witness (see Ezekiel’s sign acts; cf. 1 Cor 4:9-13)."
    },
    {
      "pk": 29020003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 3,
      "text": "Then the Lord said, “Just as my servant Isaiah has gone naked and barefoot for three years as a sign and warning against Egypt and Cush,",
      "links": "<a href='/AIV/23/8/18'>Isa. 8:18</a>; <a href='/AIV/23/18/1-7'>Isa. 18:1-7</a>",
      "comment": "The three years symbolize completeness and continuity of God’s message. The reference to Isaiah as ‘my servant’ foreshadows later servant passages, ultimately pointing toward Christ as the suffering Servant, whose life and actions would become the supreme sign to the nations (cf. Isa 42:1; 52:13-53:12; Matt 12:18)."
    },
    {
      "pk": 29020004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 4,
      "text": "so shall the king of Assyria lead away the captives of Egypt and the exiles of Cush, young and old, naked and barefoot, with buttocks uncovered, to the shame of Egypt.",
      "links": "<a href='/AIV/24/46/19'>Jer. 46:19</a>; <a href='/AIV/23/19/1'>Isa. 19:1</a>",
      "comment": "Assyria’s humiliation of Egypt and Cush demonstrates the futility of relying on foreign powers rather than on God alone. The public shame anticipates the depth of Israel’s own suffering in exile for covenant unfaithfulness, and hints at the spiritual dangers of worldly alliances (cf. Ps 146:3; Jer 17:5)."
    },
    {
      "pk": 29020005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 5,
      "text": "Then they will be afraid and ashamed because of Cush their hope and Egypt their boast.",
      "links": "<a href='/AIV/23/30/3-5'>Isa. 30:3-5</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "The people’s misplaced trust brings them public disgrace. This points to the spiritual principle of building one’s hope on firm foundation. In accordance with both Scriptural and apostolic teaching, only the foundation set by God remains unshaken (cf. Isa 28:16; Matt 7:24-27; 1 Cor 3:11)."
    },
    {
      "pk": 29020006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 20,
      "verse": 6,
      "text": "And those who dwell on this coastland will say in that day, ‘Look, this is what happened to those in whom we trusted, to whom we fled for help and deliverance from the king of Assyria! How then shall we escape?’”",
      "links": "<a href='/AIV/23/10/3'>Isa. 10:3</a>; <a href='/AIV/19/146/3'>Ps. 146:3</a>",
      "comment": "This concluding verse emphasizes the universal need for a lasting deliverer. As the prophet foreshadows here, true salvation does not come from earthly powers, but through divine intervention—a truth fulfilled in the coming of the Messiah (cf. John 14:6; Acts 4:12). The ongoing implication is that God's people are always called to unity and faithfulness in the one God-ordained way of salvation, visible and enduring through history."
    }
  ],
  "translatedAt": "2025-12-24T07:59:33.684Z"
}