{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 17,
  "verses": [
    {
      "pk": 29017001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 1,
      "text": "The burden concerning Damascus: Behold, Damascus will cease to be a city, and will become a heap of ruins.",
      "links": "<a href='/AIV/23/7/8'>Isa. 7:8</a>; <a href='/AIV/24/49/23-27'>Jer. 49:23-27</a>; <a href='/AIV/30/1/3-5'>Amos 1:3-5</a>",
      "comment": "The destruction of Damascus is a sign of God’s sovereignty over the nations. The term 'burden' introduces a prophetic declaration of judgment, as seen in other prophetic writings (see Isa. 13:1). This prophecy demonstrates how God works through both human history and divine intervention."
    },
    {
      "pk": 29017002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 2,
      "text": "The cities of Aroer are forsaken; they will be for flocks, which lie down, and none will make them afraid.",
      "links": "<a href='/AIV/24/49/23'>Jer. 49:23</a>; <a href='/AIV/26/25/5'>Ezek. 25:5</a>",
      "comment": "Aroer was a city east of the Jordan, associated with the realm of Damascus. The imagery of abandoned cities filled with flocks signals total desolation. This also echoes prophetic themes of reversal, where human pride is humbled (see Isa. 2:12)."
    },
    {
      "pk": 29017003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 3,
      "text": "The fortress will disappear from Ephraim, and sovereignty from Damascus. The remnant of Aram will be like the glory of the people of Israel, declares the LORD of Hosts.",
      "links": "<a href='/AIV/28/1/4'>Hos. 1:4</a>; <a href='/AIV/23/7/8-9'>Isa. 7:8-9</a>",
      "comment": "Ephraim, representing the northern kingdom of Israel, is paired with Damascus, foretelling the judgment coming upon both. God’s judgment falls upon both the covenant people and the nations around them, emphasizing His universal lordship. The theme of a ‘remnant’ anticipated by later prophetic and apostolic writings subtly foreshadows hope amidst judgment (see Rom. 11:5)."
    },
    {
      "pk": 29017004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 4,
      "text": "In that day the glory of Jacob will fade, and the fatness of his flesh will grow lean.",
      "links": "<a href='/AIV/23/10/16'>Isa. 10:16</a>; <a href='/AIV/28/10/8'>Hos. 10:8</a>",
      "comment": "The fading glory of Jacob (Israel) speaks of a time when former blessings wane due to unfaithfulness. In biblical language, ‘fatness’ often symbolizes prosperity; leanness, judgment. Spiritual decline is a common motif—God’s people must continually return to Him (see Deut. 8:11–20 for similar warnings)."
    },
    {
      "pk": 29017005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 5,
      "text": "It will be as when the harvester gathers standing grain, and his arm reaps the ears. It will be as when one gleans ears of grain in the Valley of Rephaim.",
      "links": "<a href='/AIV/03/19/9-10'>Lev. 19:9-10</a>; <a href='/AIV/24/6/9'>Jer. 6:9</a>",
      "comment": "The image of harvest and gleaning highlights the thoroughness of God’s judgment, yet a remnant remains. The concept of gleanings left for the poor and foreigner hints at God’s mercy, even amid judgment—a principle later central to Christian social teaching (see Ruth 2:2-3)."
    },
    {
      "pk": 29017006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 6,
      "text": "Only gleanings will be left in it, as when an olive tree is beaten—two or three berries at the very top, four or five on the branches of a fruitful tree, declares the Lord, the God of Israel.",
      "links": "<a href='/AIV/24/6/9'>Jer. 6:9</a>; <a href='/AIV/24/49/9'>Jer. 49:9</a>",
      "comment": "Just a few survivors remain after calamity—an image with spiritual meaning. God’s justice leaves a remnant, preserving a people through whom His promises endure (see Isa. 6:13). This preservation sets the stage for fulfillment in the Messiah, who gathers all nations to Himself."
    },
    {
      "pk": 29017007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 7,
      "text": "In that day, a man will look to his Maker, and his eyes will regard the Holy One of Israel.",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>; <a href='/AIV/23/10/20-21'>Isa. 10:20-21</a>",
      "comment": "Judgment leads to repentance—survivors turn back to God, the Holy One. The return to the Lord, 'their Maker,' indicates a theme of restoration through recognition and worship of the one true God. Christologically, Christ is revealed as the Holy One who calls all people back to the Father (cf. Acts 3:14)."
    },
    {
      "pk": 29017008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 8,
      "text": "They will not look to the altars, the work of their hands; they will not regard what their fingers have made, either the Asherim or the incense altars.",
      "links": "<a href='/AIV/14/31/1'>2 Chr. 31:1</a>; <a href='/AIV/23/2/8'>Isa. 2:8</a>",
      "comment": "Repentance involves abandoning idolatry—turning from man-made objects to true worship. This foreshadows New Testament calls to leave behind all forms of spiritual compromise (see 1 John 5:21). True worship, properly ordered, draws believers into the fullness of truth."
    },
    {
      "pk": 29017009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 9,
      "text": "In that day their strong cities will be like the deserted places of the forest and the hilltops, which were deserted before the children of Israel. It will become a desolation.",
      "links": "<a href='/AIV/07/6/2'>Judg. 6:2</a>; <a href='/AIV/23/13/9'>Isa. 13:9</a>",
      "comment": "The loss of cities points to the futility of trusting in earthly security. Only trust in God provides true protection and abiding peace (see Ps. 20:7). This verse subtly warns against relying on human strength or achievement."
    },
    {
      "pk": 29017010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 10,
      "text": "For you have forgotten the God of your salvation and have not remembered the Rock of your refuge; therefore you plant pleasant plants and set foreign vines,",
      "links": "<a href='/AIV/05/32/18'>Deut. 32:18</a>; <a href='/AIV/23/27/2'>Isa. 27:2</a>",
      "comment": "Forgetting God leads to spiritual ruin. The language recalls Israel’s temptation to follow foreign influences and syncretize their faith. The ‘Rock’ is a common Old Testament image for God’s faithfulness (see 1 Cor. 10:4 for Christ as the Rock)."
    },
    {
      "pk": 29017011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 11,
      "text": "In the day that you plant, you make it grow; in the morning you make your seed blossom—but the harvest will flee away in a day of grief and incurable pain.",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Human efforts apart from God, though initially successful, end in calamity. This reinforces the teaching that without the Lord, our labor is in vain (cf. Ps. 127:1). The ‘incurable pain’ emphasizes the seriousness of turning from God’s ways."
    },
    {
      "pk": 29017012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 12,
      "text": "Ah, the thunder of many peoples; they roar like the roaring of the seas! The rushing of nations—they rush like the rushing of mighty waters!",
      "links": "<a href='/AIV/23/8/7'>Isa. 8:7</a>; <a href='/AIV/23/17/13'>Isa. 17:13</a>",
      "comment": "The rising of nations is compared to chaotic waters, an image used elsewhere for evil and opposition to God’s order (see Dan. 7:2-3). The Lord remains sovereign, able to still all chaos and turmoil."
    },
    {
      "pk": 29017013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 13,
      "text": "The nations will rush like the rushing of many waters, but He will rebuke them, and they will flee far away, chased like chaff on the mountains before the wind and like whirling dust before the storm.",
      "links": "<a href='/AIV/23/41/15-16'>Isa. 41:15-16</a>; <a href='/AIV/19/1/4'>Ps. 1:4</a>",
      "comment": "God’s rebuke scatters the enemies of His people. The imagery of chaff and dust highlights the transience of human pride. This echoes Jesus’ authority over the storms of evil and chaos (Mark 4:39; John 16:33)."
    },
    {
      "pk": 29017014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 17,
      "verse": 14,
      "text": "At evening, terror; before morning, they are no more. This is the portion of those who plunder us, the lot of those who rob us.",
      "links": "<a href='/AIV/23/37/36'>Isa. 37:36</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "God’s deliverance can be swift—evil may terrorize by night, but by dawn, it is gone. The fate of oppressors is destruction, emphasizing divine justice. Trust in the Lord brings hope, even when surrounded by enemies."
    }
  ],
  "translatedAt": "2025-12-24T07:58:33.695Z"
}