{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 27,
  "verses": [
    {
      "pk": 29027001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 1,
      "text": "On that day, the LORD will punish with his fierce, great, and strong sword—Leviathan the twisting serpent, Leviathan the coiling serpent; and he will slay the monster that is in the sea.",
      "links": "<a href='/AIV/18/26/13'>Job 26:13</a>; <a href='/AIV/19/74/14'>Ps. 74:14</a>; <a href='/AIV/26/29/3'>Ezek. 29:3</a>; <a href='/AIV/66/20/2'>Rev. 20:2</a>",
      "comment": "Here 'Leviathan' symbolizes the forces of evil and chaos, possibly nations standing against God's people. This foreshadows God's final victory over evil, linking to the defeat of Satan in Revelation. The language also hints at the cosmic battle often echoed in both Old and New Testaments. A spiritual interpretation suggests God's ultimate triumph over sin and the reconciliation of creation."
    },
    {
      "pk": 29027002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 2,
      "text": "On that day, sing to her: 'A vineyard of wine!'",
      "links": "<a href='/AIV/19/80/8-16'>Ps. 80:8-16</a>; <a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>; <a href='/AIV/40/21/33-41'>Matt. 21:33-41</a>",
      "comment": "The vineyard represents God's people. Unlike in Isaiah 5, here the vineyard is fruitful under God's protection. This anticipates Christ as the true Vine (John 15:1), showing how God's people rely on divine nurture and community."
    },
    {
      "pk": 29027003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 3,
      "text": "I, the LORD, am its keeper; I water it every moment. Lest anyone harm it, I guard it night and day.",
      "links": "<a href='/AIV/19/121/4'>Ps. 121:4</a>; <a href='/AIV/23/31/5'>Isa. 31:5</a>",
      "comment": "God's constant care reflects his unfailing love for his people. The watchfulness here is reminiscent of the Good Shepherd (John 10:11-16). The image also points to how God sustains and maintains his Church through all adversities."
    },
    {
      "pk": 29027004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 4,
      "text": "I have no wrath. If only there were briers and thorns to battle, I would march against them; I would burn them up together.",
      "links": "<a href='/AIV/23/9/18'>Isa. 9:18</a>; <a href='/AIV/58/6/8'>Heb. 6:8</a>",
      "comment": "'No wrath' signifies reconciliation. Thorns and briers often represent sin and opposition to God. The readiness to eliminate these reflects God's commitment to purify his people, echoing sanctification by grace."
    },
    {
      "pk": 29027005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 5,
      "text": "Or let them take hold of my strength, that they may make peace with me; yes, let them make peace with me.",
      "links": "<a href='/AIV/23/25/4'>Isa. 25:4</a>; <a href='/AIV/45/5/1'>Rom. 5:1</a>",
      "comment": "God invites enemies to seek peace and reconciliation. This prefigures the New Testament call to be reconciled with God through Jesus Christ, our peace (Eph. 2:14)."
    },
    {
      "pk": 29027006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 6,
      "text": "In the days to come, Jacob will take root, Israel will blossom and sprout, and they will fill the whole world with fruit.",
      "links": "<a href='/AIV/01/28/14'>Gen. 28:14</a>; <a href='/AIV/23/37/31'>Isa. 37:31</a>; <a href='/AIV/65/1/6'>Jas. 1:18</a>",
      "comment": "Here the prophecy points to God's worldwide plan of salvation, fulfilled when the people of God bear fruit among all nations. Christ connects himself to this promise as the one in whom believers abide and bear fruit (John 15:5), and this hints at the universal mission of the church."
    },
    {
      "pk": 29027007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 7,
      "text": "Has he struck them as he struck those who struck them? Or have they been slain as their slayers were slain?",
      "links": "<a href='/AIV/24/30/11'>Jer. 30:11</a>; <a href='/AIV/23/10/24-25'>Isa. 10:24-25</a>",
      "comment": "The punishments God's people receive are corrective, not destructive. God's discipline is medicinal, intended for restoration rather than annihilation — a theme found throughout Scripture."
    },
    {
      "pk": 29027008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 8,
      "text": "By driving them away, by sending them out, you contended with them. He removed them with his fierce breath in the day of the east wind.",
      "links": "<a href='/AIV/28/13/15'>Hos. 13:15</a>; <a href='/AIV/23/40/7'>Isa. 40:7</a>",
      "comment": "This refers to Israel's exile as divine discipline. The emphasis remains on restoration—the separation is temporary and leads to ultimate reconciliation and purification."
    },
    {
      "pk": 29027009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 9,
      "text": "Therefore by this the guilt of Jacob will be atoned for, and this will be the full fruit of removing his sin: when he makes all the altar stones like crushed chalk, no Asherah poles or incense altars will stand.",
      "links": "<a href='/AIV/23/6/7'>Isa. 6:7</a>; <a href='/AIV/23/17/8'>Isa. 17:8</a>; <a href='/AIV/58/1/3'>Heb. 1:3</a>",
      "comment": "Atonement and true repentance result in the removal of idolatry. This points to the deeper work of God in fully cleansing and sanctifying his people, anticipating the total victory over sin achieved by Christ's sacrifice (Heb. 10:10)."
    },
    {
      "pk": 29027010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 10,
      "text": "For the fortified city is desolate, a deserted settlement, abandoned like the wilderness. Calves graze there, lie down, and strip its branches bare.",
      "links": "<a href='/AIV/23/17/2'>Isa. 17:2</a>; <a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "The contrast between the desolate city and the fruitful vineyard shows judgment on those opposed to God. The city's fall foreshadows the ultimate end of worldly powers set against God's ways."
    },
    {
      "pk": 29027011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 11,
      "text": "When its branches are dry, they are broken off; women come and burn them. For this is a people of no understanding. Therefore, their Maker will not have compassion on them, their Creator will show them no favor.",
      "links": "<a href='/AIV/19/80/16'>Ps. 80:16</a>; <a href='/AIV/23/5/5-6'>Isa. 5:5-6</a>",
      "comment": "Branches broken off invoke images of those cut off from the people of God due to unbelief (cf. Rom. 11:22). The lack of understanding leads to judgment; spiritual union with God is essential for remaining part of His people."
    },
    {
      "pk": 29027012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 12,
      "text": "In that day, the LORD will thresh from the flowing Euphrates to the Wadi of Egypt, and you, O children of Israel, will be gathered one by one.",
      "links": "<a href='/AIV/05/30/4'>Deut. 30:4</a>; <a href='/AIV/40/24/31'>Matt. 24:31</a>",
      "comment": "This gathering has prophetic significance, reflecting both the return from exile and a final, eschatological ingathering of God's people. This finds fulfillment in the Church's universality and the resurrection at the end of days."
    },
    {
      "pk": 29027013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 27,
      "verse": 13,
      "text": "And in that day a great trumpet will be blown, and those lost in the land of Assyria and scattered in Egypt will come and worship the LORD on the holy mountain at Jerusalem.",
      "links": "<a href='/AIV/03/25/9'>Lev. 25:9</a>; <a href='/AIV/40/24/31'>Matt. 24:31</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "The blowing of the trumpet signals a final restoration. Gathering scattered people on the 'holy mountain' hints at all nations joining in the true worship of God, pointing to the New Jerusalem. This prefigures the ultimate unity and communion of God's people in the worship of the one Lord."
    }
  ],
  "translatedAt": "2025-12-24T08:02:40.489Z"
}