{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 39,
  "verses": [
    {
      "pk": 29039001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 1,
      "text": "At that time Merodach-Baladan son of Baladan, king of Babylon, sent letters and a gift to Hezekiah, for he had heard that Hezekiah had been sick and had recovered.",
      "links": "<a href='/AIV/12/20/12'>2 Kgs 20:12</a>",
      "comment": "This visit from Babylon's king came after Hezekiah’s miraculous healing (cf. Isa 38). The gifts and letters symbolize foreign interest in Judah's wellbeing, but also foreshadow political intrigue. Scripture often warns against trusting foreign powers over divine providence (cf. Isa 30:1-3)."
    },
    {
      "pk": 29039002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 2,
      "text": "Hezekiah was delighted with them, and showed them everything in his treasure house—the silver, the gold, the spices, the precious oil, all his armory, and everything found among his treasures. There was nothing in his house or in all his kingdom that Hezekiah did not show them.",
      "links": "<a href='/AIV/12/20/13'>2 Kgs 20:13</a>",
      "comment": "Hezekiah’s openness demonstrates earthly pride and a lack of discernment. Such actions often precede warnings or discipline in salvation history. Compare to similar displays of wealth and power as pitfalls (cf. 2 Chr 32:25-26). The episode hints at the spiritual importance of humility and prudent stewardship."
    },
    {
      "pk": 29039003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 3,
      "text": "Then Isaiah the prophet came to King Hezekiah and asked him, 'What did these men say? Where did they come to you from?' Hezekiah answered, 'They have come to me from a distant land, from Babylon.'",
      "links": "<a href='/AIV/12/20/14'>2 Kgs 20:14</a>",
      "comment": "Isaiah’s inquiry serves as a prophetic challenge and an invitation to self-examination. Prophets in Israel often ask probing questions to reveal the heart (cf. Gen 3:9, 1 Kg 19:9)."
    },
    {
      "pk": 29039004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 4,
      "text": "He said, 'What have they seen in your house?' Hezekiah replied, 'They have seen everything in my house; there is nothing among my treasures that I did not show them.'",
      "links": "<a href='/AIV/12/20/15'>2 Kgs 20:15</a>",
      "comment": "The repetition underscores the totality of Hezekiah’s disclosure. Spiritually, this can be understood as a lack of reserve in matters that should have been discerned with wisdom. It reiterates the biblical principle that openness without discernment can lead to trouble (cf. Prov 4:23)."
    },
    {
      "pk": 29039005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 5,
      "text": "Then Isaiah said to Hezekiah, 'Hear the word of the LORD of hosts:",
      "links": "<a href='/AIV/23/22/14'>Isa 22:14</a>; <a href='/AIV/23/38/1'>Isa 38:1</a>",
      "comment": "Isaiah’s formulaic introduction to a prophetic word signals the gravity of the forthcoming pronouncement. The title 'the LORD of hosts' emphasizes God’s sovereignty and majesty as the true ruler above all earthly powers."
    },
    {
      "pk": 29039006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 6,
      "text": "'Behold, the days are coming when all that is in your house, and all that your ancestors have stored up until this day, will be carried off to Babylon. Nothing will be left,' says the LORD.",
      "links": "<a href='/AIV/24/20/5'>Jer 20:5</a>; <a href='/AIV/12/24/13'>2 Kgs 24:13</a>; <a href='/AIV/27/1/2'>Dan 1:2</a>",
      "comment": "This is a prophecy concerning the Babylonian exile, fulfilled in 2 Kings 24:13 and Daniel 1:2. Hezekiah's actions unwittingly set the stage for future judgment, a theme that echoes throughout salvation history. On a spiritual level, it cautions against overreliance on worldly possessions and highlights the transient nature of earthly power."
    },
    {
      "pk": 29039007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 7,
      "text": "'Some of your own sons, who will come from you, whom you will father, shall be taken away, and they will become eunuchs in the palace of the king of Babylon.'",
      "links": "<a href='/AIV/27/1/3-6'>Dan 1:3–6</a>",
      "comment": "This prophecy directly anticipates the fate of figures like Daniel and his friends (cf. Dan 1:3-7). The loss of royal heirs and their service in a foreign court reflects a profound reversal, symbolizing the consequences of faithlessness. Theologically, this passage foreshadows how suffering can purify God’s people and even prepare them for roles in God’s larger redemptive plan, which later finds fulfillment in the New Covenant established through Christ."
    },
    {
      "pk": 29039008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 39,
      "verse": 8,
      "text": "Then Hezekiah said to Isaiah, 'The word of the LORD that you have spoken is good.' For he thought, 'There will be peace and security in my days.'",
      "links": "<a href='/AIV/12/20/19'>2 Kgs 20:19</a>; <a href='/AIV/23/38/8'>Isa 38:8</a>",
      "comment": "Hezekiah’s reaction reveals a short-sighted acceptance of temporal peace, without concern for the future consequences to his descendants. This contrasts with the biblical ideal of seeking the good of future generations (cf. Deut 5:29). The passage calls believers to a selfless concern for the enduring faith of God’s people, and suggests that true faith looks beyond immediate comfort toward the fulfillment of God’s redemptive plan."
    }
  ],
  "translatedAt": "2025-12-24T08:08:47.648Z"
}