{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 66,
  "verses": [
    {
      "pk": 29066001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 1,
      "text": "The LORD says: 'Heaven is my throne, and the earth is my footstool. Where then is the house you could build for me, and where is the place of my rest?'",
      "links": "<a href='/AIV/11/8/27'>1 Kgs 8:27</a>; <a href='/AIV/44/7/49'>Acts 7:49</a>",
      "comment": "God reminds the people that He cannot be contained in any earthly temple. This anticipates the New Covenant understanding that true worship is not limited to a building, but is fulfilled in the gathering of true believers (see John 4:23-24)."
    },
    {
      "pk": 29066002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 2,
      "text": "My hand made all these things, and so all these things came into being,' declares the LORD. 'But this is the one to whom I will look: to the humble and contrite in spirit, who trembles at my word.'",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/23/57/15'>Isa. 57:15</a>",
      "comment": "God values humility and contrition more than ritual or external compliance. This points toward the New Testament emphasis on heart transformation (Matt 5:3)."
    },
    {
      "pk": 29066003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 3,
      "text": "He who slaughters an ox is like one who kills a man; he who sacrifices a lamb, like one who breaks a dog's neck; he who offers a grain offering, like one who offers pig's blood; he who burns incense, like one who blesses an idol. These have chosen their own ways and their souls delight in their abominations.",
      "links": "<a href='/AIV/23/1/11-15'>Isa. 1:11-15</a>; <a href='/AIV/28/6/6'>Hos. 6:6</a>",
      "comment": "Ritual without obedience or true faith is offensive to God. This relates to consistent biblical warnings against empty religion (Micah 6:6-8, Matthew 23:23)."
    },
    {
      "pk": 29066004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 4,
      "text": "So I will choose their punishments, and will bring upon them what they dread; because when I called, no one answered, when I spoke, they did not listen; but they did evil in my sight, and chose what I did not delight in.",
      "links": "<a href='/AIV/23/65/12'>Isa. 65:12</a>; <a href='/AIV/20/1/24'>Prov. 1:24</a>",
      "comment": "God's judgment comes when the people persistently reject His call. This theme is found throughout both Testaments (Romans 1:21-28)."
    },
    {
      "pk": 29066005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 5,
      "text": "Hear the word of the LORD, you who tremble at his word: 'Your brothers who hate you, and cast you out for my name's sake, have said, “Let the LORD be glorified, that we may see your joy!” But it is they who shall be put to shame.'",
      "links": "<a href='/AIV/40/5/10-12'>Matt 5:10-12</a>; <a href='/AIV/43/16/2'>John 16:2</a>",
      "comment": "Faithful believers face persecution even from within their own community, but God will vindicate them. This is reflected in New Testament passages that commend those who endure suffering for God's name."
    },
    {
      "pk": 29066006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 6,
      "text": "A sound of uproar from the city! A voice from the temple! The voice of the LORD, rendering recompense to his enemies.",
      "links": "<a href='/AIV/23/63/1-6'>Isa. 63:1-6</a>; <a href='/AIV/24/25/30'>Jer. 25:30</a>",
      "comment": "Judgment starts from the very heart of Jerusalem, even the temple, pointing towards the theme of the necessity of purity in worship (cf. 1 Pet 4:17)."
    },
    {
      "pk": 29066007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 7,
      "text": "Before she was in labor she gave birth; before her pain came upon her she delivered a son.",
      "links": "<a href='/AIV/23/49/20-21'>Isa. 49:20-21</a>; <a href='/AIV/42/2/7'>Luke 2:7</a>",
      "comment": "A miraculous birth—interpreted by Christians as foreshadowing both the restoration of Jerusalem and the virginal birth of the Messiah (see Rev 12:5; Gal 4:26-27)."
    },
    {
      "pk": 29066008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 8,
      "text": "Who has heard such a thing? Who has seen such things? Shall a land be born in one day? Shall a nation be delivered in an instant? Yet as soon as Zion travailed, she brought forth her children.",
      "links": "<a href='/AIV/23/54/1'>Isa. 54:1</a>; <a href='/AIV/48/4/26-27'>Gal. 4:26-27</a>",
      "comment": "God brings swift and surprising deliverance, showing His sovereignty. The spiritual meaning includes the birth of the renewed people of God."
    },
    {
      "pk": 29066009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 9,
      "text": "'Shall I bring to the point of birth and not cause to be delivered?' says the LORD. 'Shall I, who give birth, shut the womb?' says your God.",
      "links": "<a href='/AIV/18/42/2'>Job 42:2</a>; <a href='/AIV/23/43/13'>Isa. 43:13</a>",
      "comment": "God is faithful to complete what He has begun. The image of God as a nurturing one also provides spiritual richness, connecting creation, providence, and redemption."
    },
    {
      "pk": 29066010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 10,
      "text": "Rejoice with Jerusalem, and be glad for her, all you who love her; rejoice greatly with her, all you who mourn over her,",
      "links": "<a href='/AIV/23/35/10'>Isa. 35:10</a>; <a href='/AIV/19/122/6'>Ps. 122:6</a>",
      "comment": "Jerusalem is a place of future joy and restoration. Spiritually, this points to the heavenly Jerusalem and the unity of God’s people (see Heb. 12:22)."
    },
    {
      "pk": 29066011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 11,
      "text": "that you may nurse and be satisfied from her comforting breasts; that you may drink deeply and delight yourselves in her glorious abundance.",
      "links": "<a href='/AIV/23/60/16'>Isa. 60:16</a>; <a href='/AIV/60/2/2'>1 Pet. 2:2</a>",
      "comment": "Maternal imagery of Jerusalem reinforces the church as a mother who nourishes her children in faith and sacraments."
    },
    {
      "pk": 29066012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 12,
      "text": "For thus says the LORD: 'Behold, I will extend peace to her like a river, and the glory of the nations like an overflowing stream; and you shall nurse, you shall be carried upon her side, and dandled upon her knees.'",
      "links": "<a href='/AIV/23/48/18'>Isa. 48:18</a>; <a href='/AIV/23/60/3-5'>Isa. 60:3-5</a>",
      "comment": "Peace and abundance come to Jerusalem, attractive even to the ‘nations’ (Gentiles). The fulfillment of this prophecy is seen in the mission to all peoples (Acts 1:8)."
    },
    {
      "pk": 29066013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 13,
      "text": "As one whom his mother comforts, so will I comfort you; you shall be comforted in Jerusalem.",
      "links": "<a href='/AIV/23/49/15'>Isa. 49:15</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "God’s comfort, like that of a mother, points to the deep, personal care God has for His people, found fully in the new covenant community."
    },
    {
      "pk": 29066014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 14,
      "text": "You will see this, and your heart will rejoice; your bones shall flourish like the grass. The hand of the LORD shall be known to his servants, and his fury toward his enemies.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>; <a href='/AIV/23/65/13-14'>Isa. 65:13-14</a>",
      "comment": "The clear distinction between God’s blessing and His judgment encourages perseverance. In the end, God vindicates His faithful servants."
    },
    {
      "pk": 29066015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 15,
      "text": "For behold, the LORD will come with fire, and his chariots like a whirlwind, to render his anger with fury, and his rebuke with flames of fire.",
      "links": "<a href='/AIV/23/29/6'>Isa. 29:6</a>; <a href='/AIV/40/3/12'>Matt 3:12</a>; <a href='/AIV/66/19/11-21'>Rev. 19:11-21</a>",
      "comment": "God’s coming in fire foreshadows the final judgment. New Testament writers use these images for the return of Christ."
    },
    {
      "pk": 29066016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 16,
      "text": "For by fire and by his sword the LORD will execute judgment on all flesh; and those slain by the LORD shall be many.",
      "links": "<a href='/AIV/19/50/3-6'>Ps. 50:3-6</a>; <a href='/AIV/66/20/11-15'>Rev. 20:11-15</a>",
      "comment": "The universal scope of God’s judgment emphasizes accountability for all humanity. This finds fulfillment in the final judgment (see Matt 25:31-46)."
    },
    {
      "pk": 29066017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 17,
      "text": "Those who sanctify and purify themselves to go into the gardens, following one in the midst, eating pig’s flesh, abominable things, and mice, shall come to an end together,' declares the LORD.",
      "links": "<a href='/AIV/23/65/3-4'>Isa. 65:3-4</a>; <a href='/AIV/03/11/7'>Lev. 11:7</a>",
      "comment": "False worship and idolatry lead to condemnation. True worship involves faithfulness both inwardly and outwardly."
    },
    {
      "pk": 29066018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 18,
      "text": "'For I know their works and their thoughts, and the time is coming to gather all nations and tongues. They shall come and see my glory,'",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "The inclusion of all peoples foreshadows the gospel reaching the nations—the universal mission of the church."
    },
    {
      "pk": 29066019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 19,
      "text": "'And I will set a sign among them. And I will send survivors to the nations—to Tarshish, Pul, and Lud, who draw the bow, to Tubal and Javan, to the distant coastlands that have not heard my fame or seen my glory. And they will declare my glory among the nations.'",
      "links": "<a href='/AIV/23/11/12'>Isa. 11:12</a>; <a href='/AIV/44/13/47'>Acts 13:47</a>",
      "comment": "God’s people are sent out to proclaim His glory among every nation. This prefigures the worldwide mission, and some church fathers saw a prophecy of the apostles’ mission."
    },
    {
      "pk": 29066020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 20,
      "text": "And they shall bring all your brothers from all the nations as an offering to the LORD, on horses, in chariots, in litters, on mules, and on dromedaries, to my holy mountain Jerusalem,' says the LORD, 'just as the Israelites bring their grain offering in a clean vessel to the house of the LORD.'",
      "links": "<a href='/AIV/23/2/2'>Isa. 2:2</a>; <a href='/AIV/45/15/16'>Rom. 15:16</a>",
      "comment": "The nations are gathered and brought to worship as an offering, symbolizing the peoples’ entrance into the covenant community and the preciousness of liturgical worship."
    },
    {
      "pk": 29066021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 21,
      "text": "'And some of them I will take for priests and for Levites,' says the LORD.",
      "links": "<a href='/AIV/60/2/9'>1 Pet. 2:9</a>; <a href='/AIV/66/1/6'>Rev. 1:6</a>",
      "comment": "Gentiles are brought into service as priests—fulfilled spiritually in the New Testament’s vision of a royal priesthood, not by genealogy but by being joined to Christ and His church."
    },
    {
      "pk": 29066022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 22,
      "text": "'For as the new heavens and the new earth that I make shall remain before me,' declares the LORD, 'so shall your offspring and your name remain.'",
      "links": "<a href='/AIV/23/65/17'>Isa. 65:17</a>; <a href='/AIV/66/21/1'>Rev. 21:1</a>",
      "comment": "God’s promise of the new creation points to the eternal destiny of the redeemed, fully revealed in Christ."
    },
    {
      "pk": 29066023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 23,
      "text": "And from month to month, and from Sabbath to Sabbath, all flesh shall come to worship before me,' says the LORD.",
      "links": "<a href='/AIV/19/65/2'>Ps. 65:2</a>; <a href='/AIV/66/21/22-27'>Rev. 21:22-27</a>",
      "comment": "Universal worship points to unending, united praise in a restored community. Liturgical continuity is implied; all nations worship regularly."
    },
    {
      "pk": 29066024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 66,
      "verse": 24,
      "text": "And they shall go out and look on the dead bodies of the men who have rebelled against me. For their worm shall not die, and their fire shall not be quenched, and they shall be an abhorrence to all flesh.",
      "links": "<a href='/AIV/41/9/48'>Mark 9:48</a>; <a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "A sober warning about judgment: Jesus Himself quotes this verse in reference to the final judgment. God’s justice is as real as His mercy. This underlines the need to enter and remain in the visible community He has established for His people."
    }
  ],
  "translatedAt": "2025-12-24T08:20:54.858Z"
}