{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 15,
  "verses": [
    {
      "pk": 29015001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 1,
      "text": "An oracle concerning Moab: Because Ar of Moab is laid waste in a night, it is destroyed. Because Kir of Moab is laid waste in a night, it is destroyed.",
      "links": "<a href='/AIV/24/48/1'>Jer. 48:1</a>; <a href='/AIV/04/21/15'>Num. 21:15</a>",
      "comment": "This verse announces sudden devastation on the main cities of Moab, emphasizing the swift and totality of God's judgment. The phrase 'oracle concerning Moab' introduces a prophecy specifically against Moab's pride and opposition to Israel. Such judgments prefigure God's ultimate justice and remind us of the consequences of persistent sin."
    },
    {
      "pk": 29015002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 2,
      "text": "They have gone up to the temple and to Dibon, to the high places to weep. Moab wails over Nebo and over Medeba. On every head is baldness; every beard is shaven.",
      "links": "<a href='/AIV/24/48/18'>Jer. 48:18,22</a>; <a href='/AIV/04/21/20'>Num. 21:20</a>",
      "comment": "Shaving the head and beard were signs of great mourning in the ancient Near East (see <a href='/AIV/24/48/37'>Jer. 48:37</a>). The Moabites grieve at their destroyed shrines, highlighting the insufficiency of their gods to save. This calls attention to how humanity often turns to powerless rituals rather than the living God, foreshadowing the importance of true worship 'in spirit and truth' (<a href='/AIV/43/4/23'>John 4:23</a>)."
    },
    {
      "pk": 29015003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 3,
      "text": "In the streets they wear sackcloth; on the rooftops and in the squares everyone wails, melting with weeping.",
      "links": "<a href='/AIV/24/6/26'>Jer. 6:26</a>; <a href='/AIV/26/27/31'>Ezek. 27:31</a>",
      "comment": "Wearing sackcloth and public weeping are symbols of repentance and grief. The widespread mourning shows corporate, communal sorrow—a theme that echoes Israel’s own calls to repentance. The use of outward signs for inward grief would later become spiritualized as the people are called to repentance of the heart (<a href='/AIV/29/2/13'>Joel 2:13</a>)."
    },
    {
      "pk": 29015004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 4,
      "text": "Heshbon and Elealeh cry out; their voice is heard as far as Jahaz. Therefore the armed men of Moab cry out; their souls tremble within them.",
      "links": "<a href='/AIV/04/32/37'>Num. 32:37</a>; <a href='/AIV/24/48/34'>Jer. 48:34</a>",
      "comment": "The panic is so great that even soldiers are terrified. The deep distress spreading among the towns shows the completeness of God's judgment. Mourning that spreads from commoners to warriors illustrates the need for a Savior greater than human strength, pointing forward to Christ as the true deliverer of His people."
    },
    {
      "pk": 29015005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 5,
      "text": "My heart cries out for Moab; her fugitives flee as far as Zoar, to Eglath-shelishiyah. For at the ascent of Luhith they go up weeping; on the road to Horonaim they raise a cry of destruction.",
      "links": "<a href='/AIV/24/48/5'>Jer. 48:5</a>; <a href='/AIV/01/19/22'>Gen. 19:22</a>",
      "comment": "Though judgment comes, there is a tone of compassion: even the prophet weeps over Moab's fate. This foreshadows Christ’s own sorrow over human suffering and points to God’s desire for all to repent and come to salvation (<a href='/AIV/61/3/9'>2 Pet. 3:9</a>), indicating the harmony between divine justice and mercy."
    },
    {
      "pk": 29015006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 6,
      "text": "The waters of Nimrim are a wasteland; the grass is withered, new growth is gone, nothing green remains.",
      "links": "<a href='/AIV/24/48/34'>Jer. 48:34</a>; <a href='/AIV/05/28/23-24'>Deut. 28:23-24</a>",
      "comment": "The land’s devastation—even its waters and vegetation—reflects the full weight of divine curse. This links back to the covenant warnings in the Law (<a href='/AIV/05/28/23-24'>Deut. 28:23-24</a>) and prefigures spiritual barrenness when people turn from the life-giving God. Restoration is only possible by God’s grace."
    },
    {
      "pk": 29015007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 7,
      "text": "Therefore the wealth they have acquired and stored up, they carry away over the Brook of the Willows.",
      "links": "<a href='/AIV/24/48/36'>Jer. 48:36</a>; <a href='/AIV/18/20/21'>Job 20:21</a>",
      "comment": "All earthly treasures prove powerless to save, and are carried away in exile. This foreshadows Jesus’ teaching not to store up treasures on earth but in heaven (<a href='/AIV/40/6/19-20'>Matt. 6:19-20</a>), affirming the necessity of trusting in that which endures eternally."
    },
    {
      "pk": 29015008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 8,
      "text": "For a cry has gone around the borders of Moab; the wailing reaches Eglaim, the lamentation goes as far as Beer-elim.",
      "links": "<a href='/AIV/04/21/16'>Num. 21:16</a>; <a href='/AIV/24/48/20'>Jer. 48:20-24</a>",
      "comment": "The cry of Moab reaches even the farthest regions, symbolizing the all-encompassing effects of judgment. This reminds readers of the far-reaching consequences of sin, and the need for repentance and intercession—even for those outside the visible boundaries of the people of God."
    },
    {
      "pk": 29015009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 15,
      "verse": 9,
      "text": "For the waters of Dibon are full of blood; yet I will bring more upon Dibon—a lion upon those of Moab who escape, and upon the remnant of the land.",
      "links": "<a href='/AIV/24/48/45'>Jer. 48:45</a>; <a href='/AIV/07/14/5'>Judg. 14:5</a>",
      "comment": "Even after disaster, further judgment comes for the survivors. The lion represents the instruments of God's justice. This passage teaches God’s comprehensive justice, foreshadowing themes later fulfilled in the coming of the Messiah, who alone triumphs over sin, death, and judgment, providing hope for ultimate restoration."
    }
  ],
  "translatedAt": "2025-12-24T07:57:46.810Z"
}