{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 10,
  "verses": [
    {
      "pk": 29010001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 1,
      "text": "Woe to those who make unjust laws, and to those who write oppressive statutes,",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>; <a href='/AIV/33/6/11-12'>Mic. 6:11-12</a>",
      "comment": "Isaiah begins this section condemning leaders who enact laws that oppose justice. The prophetic tradition regularly rebukes corrupt human authority, prefiguring the just kingship of Christ. See Matthew 23:4 for a New Testament echo."
    },
    {
      "pk": 29010002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 2,
      "text": "to deny justice to the poor, to deprive the afflicted among my people of their rights, to make widows their prey, and to rob the fatherless.",
      "links": "<a href='/AIV/02/22/22-24'>Ex. 22:22-24</a>; <a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "God's concern for the poor, widows, and orphans is central in Scripture (see James 1:27). Acts of justice are expected of true worshippers and are a sign of authentic faith."
    },
    {
      "pk": 29010003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 3,
      "text": "What will you do on the day of visitation, when destruction comes from afar? To whom will you flee for help, and where will you leave your wealth?",
      "links": "<a href='/AIV/23/2/12'>Isa. 2:12</a>; <a href='/AIV/23/30/1-3'>Isa. 30:1-3</a>",
      "comment": "Isaiah points to the 'day of visitation,' a term often associated with divine judgment. It foreshadows later descriptions of the Day of the Lord (see Zephaniah 1:14-18; Acts 17:31)."
    },
    {
      "pk": 29010004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 4,
      "text": "Without me, they will bow down among the prisoners or fall among the slain. For all this, his anger is not turned away, his hand is still stretched out.",
      "links": "<a href='/AIV/23/9/12'>Isa. 9:12</a>; <a href='/AIV/23/9/17'>Isa. 9:17</a>",
      "comment": "God's persistent hand of judgment is seen throughout this section (repeated refrain: 'his hand is still stretched out'), signifying both justice and a call for repentance. The theme is echoed in the patience and warning of God in Romans 2:4-5."
    },
    {
      "pk": 29010005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 5,
      "text": "Woe to Assyria, the rod of my anger—the staff in their hand is my wrath!",
      "links": "<a href='/AIV/19/17/13'>Ps. 17:13</a>; <a href='/AIV/23/7/20'>Isa. 7:20</a>",
      "comment": "Assyria is depicted as an instrument in God's hand, even though it is a pagan nation. This hints at God's sovereign ability to use any nation for his purposes (compare Habakkuk 1:6). There is a parallel in how God allows even evil events to ultimately serve his divine plan for salvation."
    },
    {
      "pk": 29010006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 6,
      "text": "I send him against a godless nation; I command him against the people of my wrath, to take spoil, to seize plunder, and to trample them down like the mud in the streets.",
      "links": "<a href='/AIV/23/8/7'>Isa. 8:7</a>; <a href='/AIV/28/10/6'>Hos. 10:6</a>",
      "comment": "Even Israel, when disobedient, is called 'a godless nation.' There is an implicit warning here that God holds his own people to a high standard, as he will judge his chosen people more strictly (see Luke 12:48)."
    },
    {
      "pk": 29010007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 7,
      "text": "But he does not intend so, nor does his heart think so; rather in his heart, he means to destroy and to cut off many nations—not a few.",
      "links": "<a href='/AIV/36/3/8'>Zeph. 3:8</a>",
      "comment": "Assyria acts from pride and violence, not realizing they are serving God's greater purpose. Divine providence often works through people and events without their knowledge, a mystery echoed in Acts 4:27-28 concerning Christ's Passion."
    },
    {
      "pk": 29010008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 8,
      "text": "For he says, 'Are not my commanders all kings?'",
      "links": "<a href='/AIV/23/36/8-9'>Isa. 36:8-9</a>",
      "comment": "Assyria boasts of its mighty leaders and conquests, reflecting human pride in worldly power. True authority, however, comes from God alone (see John 19:11)."
    },
    {
      "pk": 29010009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 9,
      "text": "'Is not Calno like Carchemish? Is not Hamath like Arpad? Is not Samaria like Damascus?'",
      "links": "<a href='/AIV/12/18/34'>2 Kings 18:34</a>; <a href='/AIV/23/36/19'>Isa. 36:19</a>",
      "comment": "A list of cities conquered by Assyria; the taunt illustrates Assyria's arrogance, treating Israel's capital as if it were just another pagan city. Yet God will show his special concern for his chosen people, despite their faults."
    },
    {
      "pk": 29010010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 10,
      "text": "As my hand has reached to the kingdoms of idols, whose carved images were greater than those of Jerusalem and Samaria,",
      "links": "<a href='/AIV/23/36/18-20'>Isa. 36:18-20</a>",
      "comment": "The prideful king of Assyria trusts in his conquests of idolatrous nations, vainly equating God's people with these others. This foreshadows the contrast between empty idols and God's living presence (see 1 Corinthians 8:4-6)."
    },
    {
      "pk": 29010011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 11,
      "text": "shall I not do to Jerusalem and her images just as I have done to Samaria and her idols?'",
      "links": "<a href='/AIV/12/17/6-18'>2 Kings 17:6-18</a>",
      "comment": "The arrogance of Assyria extends to God's city, wrongly assuming it is no different from other idolatrous cities. But God has a unique plan for Jerusalem—the spiritual heart of salvation history."
    },
    {
      "pk": 29010012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 12,
      "text": "But when the Lord has finished all his work on Mount Zion and on Jerusalem, he will punish the fruit of the king of Assyria’s arrogant heart and the boastful pride of his eyes.",
      "links": "<a href='/AIV/23/24/21-22'>Isa. 24:21-22</a>; <a href='/AIV/23/14/13-15'>Isa. 14:13-15</a>",
      "comment": "God's sovereignty ensures that even those he uses as instruments will be judged for their pride. This anticipates the humbling of all who oppose God's will (see Luke 1:52) and shows a glimpse of final restoration after discipline."
    },
    {
      "pk": 29010013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 13,
      "text": "For he has said, 'By the strength of my hand I have done this, and by my wisdom because I have understanding; I have removed the boundaries of nations, I have plundered their treasures, and I have thrown down as one who sits on a throne the inhabitants.'",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "The king of Assyria boasts of his power, a sign of sinful pride. Recognizing that all authority is from God is essential for true humility and service (see Daniel 4:37; John 19:10-11)."
    },
    {
      "pk": 29010014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 14,
      "text": "My hand has found like a nest the wealth of the peoples; as one gathers eggs that are left, I have gathered all the earth. No one moved a wing, or opened the mouth, or chirped.'",
      "links": "<a href='/AIV/23/37/18-20'>Isa. 37:18-20</a>",
      "comment": "The image of gathering eggs shows Assyria's view of conquest as easy and inevitable, but this is a false illusion of power. In contrast, Christ calls for humble service over dominion (see Matthew 20:25-28)."
    },
    {
      "pk": 29010015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 15,
      "text": "Shall an axe boast over the one who uses it, or a saw magnify itself over the one who wields it? As if a rod should lift the one who raises it, as if a staff should lift someone who is not wood!",
      "links": "<a href='/AIV/23/29/16'>Isa. 29:16</a>; <a href='/AIV/45/9/20-21'>Rom. 9:20-21</a>",
      "comment": "Isaiah emphasizes that human instruments cannot exalt themselves over the divine Craftsman. This is echoed by Paul in Romans, who speaks of the potter and the clay—a call to humility and submission before God."
    },
    {
      "pk": 29010016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 16,
      "text": "Therefore the Lord, the LORD of Hosts, will send wasting disease among his stout warriors, and under his splendor a fire will be kindled like a burning flame.",
      "links": "<a href='/AIV/23/30/30'>Isa. 30:30</a>; <a href='/AIV/23/33/11-12'>Isa. 33:11-12</a>",
      "comment": "A vivid picture of God's judgment—internal decay and destruction—awaits the proud. The 'fire' reminds readers of the refining fire God uses for both judgment and purification (see Malachi 3:2-3; 1 Cor. 3:13)."
    },
    {
      "pk": 29010017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 17,
      "text": "The light of Israel will become a fire, and his Holy One a flame, and it will burn and devour his thorns and briers in one day.",
      "links": "<a href='/AIV/23/4/4'>Isa. 4:4</a>; <a href='/AIV/23/9/18'>Isa. 9:18</a>",
      "comment": "God himself is described as both light and fire—a double symbol of judgment and purification. The 'Holy One' points to God's presence dwelling among his people, a reality fulfilled in Christ, the true Light (see John 1:9; John 8:12)."
    },
    {
      "pk": 29010018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 18,
      "text": "He will consume the glory of his forest and of his fruitful field, both soul and body; it will be as when a sick man wastes away.",
      "links": "<a href='/AIV/23/9/14-17'>Isa. 9:14-17</a>",
      "comment": "All strength and splendor apart from God will fade. This is a warning not to trust in material prosperity or outward might. The spiritual dimension is key—holiness surpasses external glory."
    },
    {
      "pk": 29010019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 19,
      "text": "The remnant of the trees of his forest will be so few that a child could count them.",
      "links": "<a href='/AIV/23/6/13'>Isa. 6:13</a>; <a href='/AIV/23/37/31-32'>Isa. 37:31-32</a>",
      "comment": "This points to the idea of a faithful remnant, a theme explored throughout Isaiah, from which God's new work emerges. The 'remnant' is an important motif for God's continuing plan through a purified people (see Romans 11:5)."
    },
    {
      "pk": 29010020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 20,
      "text": "In that day, the remnant of Israel and those who have escaped from the house of Jacob will never again lean on the one who struck them, but will truly lean on the LORD, the Holy One of Israel.",
      "links": "<a href='/AIV/23/17/7'>Isa. 17:7</a>; <a href='/AIV/28/14/3-4'>Hos. 14:3-4</a>",
      "comment": "A moment of hope: the remnant will return to exclusive reliance on the LORD. This points forward to the fullness of redemption accomplished through Christ—the Holy One in their midst (compare Hebrews 8:10-12)."
    },
    {
      "pk": 29010021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 21,
      "text": "A remnant will return, even the remnant of Jacob, to the mighty God.",
      "links": "<a href='/AIV/23/7/3'>Isa. 7:3</a>; <a href='/AIV/45/9/27-28'>Rom. 9:27-28</a>",
      "comment": "'A remnant will return'—the name Shear-jashub—is a prophecy fulfilled as God preserves a people for himself. Paul cites this to show the continued existence of true Israel by faith."
    },
    {
      "pk": 29010022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 22,
      "text": "For though your people Israel are as the sand of the sea, only a remnant of them will return. Destruction is decreed, overflowing with righteousness.",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>; <a href='/AIV/45/9/27-28'>Rom. 9:27-28</a>",
      "comment": "Despite the great numbers of Israel, true faithfulness is found in a remnant. God's judgment aims at correction and the preservation of righteousness. This foreshadows the refining power of God's discipline."
    },
    {
      "pk": 29010023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 23,
      "text": "For the Lord GOD of Hosts will make a full end, as decreed, in the midst of all the earth.",
      "links": "<a href='/AIV/23/28/22'>Isa. 28:22</a>; <a href='/AIV/45/9/28'>Rom. 9:28</a>",
      "comment": "God’s sovereign word stands: judgment will be executed, but it is always directed toward the goal of creating a purified people. Paul applies this in his teaching on divine election and mercy (Rom. 9:28)."
    },
    {
      "pk": 29010024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 24,
      "text": "Therefore thus says the Lord GOD of Hosts: 'O my people who dwell in Zion, do not be afraid of Assyria, though they strike you with the rod and lift up their staff against you as Egypt did.'",
      "links": "<a href='/AIV/23/37/6'>Isa. 37:6</a>; <a href='/AIV/02/1/13-14'>Ex. 1:13-14</a>",
      "comment": "Assyria's oppression is compared to that of Egypt, drawing a parallel with the Exodus. God’s people are reassured that, as before, deliverance will come. Christ is later shown as the new Moses, fulfilling ultimate liberation (see Matthew 2:15)."
    },
    {
      "pk": 29010025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 25,
      "text": "For in just a very little while my indignation will come to an end, and my anger will be directed to their destruction.",
      "links": "<a href='/AIV/23/26/20'>Isa. 26:20</a>",
      "comment": "God’s anger is not endless—his primary intent is restoration rather than destruction. This is a recurring theme: judgment is always ultimately in service of mercy (Lamentations 3:31-33; James 2:13)."
    },
    {
      "pk": 29010026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 26,
      "text": "The LORD of Hosts will stir up a scourge against him, as when he struck Midian at the rock of Oreb, and as his staff was over the sea, so will he lift it up as he did in Egypt.",
      "links": "<a href='/AIV/07/7/25'>Judg. 7:25</a>; <a href='/AIV/02/14/16'>Ex. 14:16</a>",
      "comment": "Isaiah recalls past deliverances—Midian (Gideon’s victory) and the Exodus from Egypt. History is interpreted as moving according to God’s saving plan, with past events foreshadowing ultimate salvation in Christ."
    },
    {
      "pk": 29010027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 27,
      "text": "And in that day his burden will depart from your shoulder, and his yoke from your neck; the yoke will be broken because of the anointing.",
      "links": "<a href='/AIV/23/9/4'>Isa. 9:4</a>; <a href='/AIV/40/11/29-30'>Matt. 11:29-30</a>",
      "comment": "'Anointing' here can also be translated as 'fatness' (prosperity)—but in Christian tradition, it becomes a symbol for the work of the Anointed One (the Messiah). Christ removes the ultimate yoke of sin and oppression (see Matthew 11:30)."
    },
    {
      "pk": 29010028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 28,
      "text": "He has come to Aiath; he has passed through Migron; at Michmash he stores his supplies.",
      "links": "<a href='/AIV/09/13/2'>1 Sam. 13:2</a>",
      "comment": "A poetic description of the Assyrian army's advance towards Jerusalem. These real locations highlight the gravity of the threat, yet God’s sovereign plan assures deliverance."
    },
    {
      "pk": 29010029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 29,
      "text": "They go through the pass, saying, 'Geba is our lodging for the night.' Ramah trembles, Gibeah of Saul has fled.",
      "links": "<a href='/AIV/09/10/26'>1 Sam. 10:26</a>",
      "comment": "This verse dramatizes the fear spreading in Israel as the enemy approaches. Even places famed for previous leadership and strength are shaken."
    },
    {
      "pk": 29010030,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 30,
      "text": "Cry out, O daughter of Gallim! Listen, O Laishah! Poor Anathoth!",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "Even small and otherwise unremarkable villages are swept up in the peril. The detailed geography enhances the sense of immediacy and impending disaster."
    },
    {
      "pk": 29010031,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 31,
      "text": "Madmenah is in flight; the inhabitants of Gebim seek shelter.",
      "links": "<a href='/AIV/23/37/33-36'>Isa. 37:33-36</a>",
      "comment": "The fleeing towns reinforce the depth of despair, yet God is preparing for a dramatic reversal, as seen later in the miraculous deliverance of Jerusalem."
    },
    {
      "pk": 29010032,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 32,
      "text": "This very day he will halt at Nob, shaking his fist at the mountain of the daughter of Zion, the hill of Jerusalem.",
      "links": "<a href='/AIV/23/37/22-24'>Isa. 37:22-24</a>",
      "comment": "The enemy appears to stand at the gates of Jerusalem—desperation at its peak. But the city, called 'daughter of Zion,' is the focal point of God’s promise, which the following verses show will prevail."
    },
    {
      "pk": 29010033,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 33,
      "text": "Behold, the Lord, the LORD of Hosts, will lop off the boughs with terrifying power; the tallest trees will be cut down and the lofty will be brought low.",
      "links": "<a href='/AIV/23/2/12-13'>Isa. 2:12-13</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "God humbles all the proud and mighty—Assyria and any who exalt themselves. This sets up the prophecy of the 'shoot from the stump of Jesse' in the next chapter, which points to Christ, the lowly Messiah who is exalted."
    },
    {
      "pk": 29010034,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 10,
      "verse": 34,
      "text": "He will cut down the thickets of the forest with an axe, and Lebanon will fall by the Mighty One.",
      "links": "<a href='/AIV/23/37/36-38'>Isa. 37:36-38</a>",
      "comment": "Lebanon—symbolic for arrogance and false glory—will fall by God's own hand. The 'Mighty One' in Hebrew here is El, a title suggestive of divine strength, later revealed perfectly in Christ. This paves the way for redemption: out of the felled forest, the Messiah arises (see Isa. 11:1)."
    }
  ],
  "translatedAt": "2025-12-24T07:55:59.658Z"
}