{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 31,
  "verses": [
    {
      "pk": 29031001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 1,
      "text": "Woe to those who go down to Egypt for help, who rely on horses, who trust in chariots because they are many and in horsemen because they are very strong, but do not look to the Holy One of Israel or seek the LORD.",
      "links": "<a href='/AIV/23/30/1-3'>Isa. 30:1-3</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "The warning against trusting in worldly powers instead of seeking the LORD reminds us that faith must be rooted in God, not merely human strength or alliances. This theme is echoed throughout Scripture and fulfilled spiritually in Christ's invitation to find our ultimate help in Him."
    },
    {
      "pk": 29031002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 2,
      "text": "Yet He is wise and brings disaster; He does not retract His words, but rises against the house of evildoers and against the help of those who do wrong.",
      "links": "<a href='/AIV/04/23/19'>Num. 23:19</a>; <a href='/AIV/19/94/8-10'>Ps. 94:8-10</a>",
      "comment": "God's wisdom and faithfulness mean that His judgments are just and His promises sure. The LORD cannot overlook evil, and all help apart from Him ultimately falls. God's action here anticipates the final judgment and the fulfillment of all things in Christ."
    },
    {
      "pk": 29031003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 3,
      "text": "Now the Egyptians are men, and not God, and their horses are flesh, and not spirit. When the LORD stretches out His hand, both he who helps will stumble, and he who is helped will fall; they will all perish together.",
      "links": "<a href='/AIV/23/30/7'>Isa. 30:7</a>; <a href='/AIV/19/33/16-17'>Ps. 33:16-17</a>",
      "comment": "This verse contrasts human power with God's divine power. It points out the futility of trusting mere mortals for salvation, alluding to man's need for grace that only comes from God, which Christians receive through Christ's saving work."
    },
    {
      "pk": 29031004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 4,
      "text": "For thus says the LORD to me: 'As a lion or a young lion growls over his prey, when a band of shepherds is called out against him, he is not frightened by their shouting or disturbed at their noise; so the LORD of armies will come down to fight on Mount Zion and on its hill.'",
      "links": "<a href='/AIV/23/42/13'>Isa. 42:13</a>; <a href='/AIV/28/11/10'>Hos. 11:10</a>",
      "comment": "The image of the lion portrays God's fearless determination to protect His people. The LORD fights for Zion—a reference both to Jerusalem and later symbolically to the Church itself, showing God's unique protection of His chosen assembly through history."
    },
    {
      "pk": 29031005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 5,
      "text": "Like flying birds, so will the LORD of armies shield Jerusalem; He will shield and deliver, He will pass over and rescue it.",
      "links": "<a href='/AIV/02/12/13'>Ex. 12:13</a>; <a href='/AIV/19/91/4'>Ps. 91:4</a>",
      "comment": "The phrase 'pass over' recalls the Passover, underlining God's continued deliverance. The image connects directly to how the Lord's protection is provided through sacrificial means, pointing ahead to Christ's sacrifice. God's intention has always been to save His people through special acts of grace."
    },
    {
      "pk": 29031006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 6,
      "text": "Return to Him from whom you have deeply turned away, O children of Israel.",
      "links": "<a href='/AIV/23/55/7'>Isa. 55:7</a>; <a href='/AIV/36/3/19'>Zeph. 3:19</a>",
      "comment": "Here is a call to repentance—a theme echoed throughout the Old and New Testament. Repentance is repeatedly emphasized as the means to restoration with God, just as Christ began His ministry inviting all to repent and believe in the Gospel."
    },
    {
      "pk": 29031007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 7,
      "text": "For in that day everyone shall cast away his idols of silver and his idols of gold, which your hands have made for yourselves as a sin.",
      "links": "<a href='/AIV/23/2/20'>Isa. 2:20</a>; <a href='/AIV/02/20/23'>Ex. 20:23</a>",
      "comment": "True repentance results in abandoning all false worship. The casting aside of idols is seen as an essential part of spiritual renewal. This verse also prefigures the purification and reform God intends for His people, fulfilled perfectly in the call to true worship in spirit and truth <a href='/AIV/43/4/23'>John 4:23</a>."
    },
    {
      "pk": 29031008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 8,
      "text": "Then Assyria shall fall by a sword not of man; and a sword not of man shall devour him, and he shall flee from the sword, and his young men shall be made slaves.",
      "links": "<a href='/AIV/23/37/36'>Isa. 37:36</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Assyria's fall by no mere human means refers to the miraculous deliverance described later in Isaiah. This victory by God's own power foreshadows the ultimate victory of Christ, achieved not by human strength but by the power of God working through divine intervention."
    },
    {
      "pk": 29031009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 31,
      "verse": 9,
      "text": "His rock shall pass away in terror, and his officials in panic, declares the LORD—whose fire is in Zion and whose furnace is in Jerusalem.",
      "links": "<a href='/AIV/23/29/6'>Isa. 29:6</a>; <a href='/AIV/05/4/24'>Deut. 4:24</a>",
      "comment": "The image of God's fire in Zion hints at God's abiding presence with His people and the purifying power exercised from Jerusalem. Throughout salvation history, God's dwelling among His people and purifying fire both protect and sanctify—an image later seen in Pentecost (<a href='/AIV/44/2/3-4'>Acts 2:3-4</a>)."
    }
  ],
  "translatedAt": "2025-12-24T08:05:09.764Z"
}