{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 55,
  "verses": [
    {
      "pk": 29055001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 1,
      "text": "Come, everyone who thirsts, come to the waters; and you who have no money, come, buy and eat! Come, buy wine and milk without money and without cost.",
      "links": "<a href='/AIV/43/4/13-14'>John 4:13-14</a>; <a href='/AIV/40/5/6'>Matt. 5:6</a>; <a href='/AIV/26/47/9'>Ezek. 47:9</a>",
      "comment": "Isaiah invites all to receive God's grace freely, a foreshadowing of the universal invitation of the Gospel. The reference to 'waters' recalls Jesus’ promise of living water (John 4:14). The abundance of wine and milk suggests a spiritual feast, often interpreted as the richness of life in Christ and the nourishment found in the sacraments."
    },
    {
      "pk": 29055002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 2,
      "text": "Why spend money for what is not bread, and your labor for what does not satisfy? Listen carefully to me and eat what is good, and you will delight yourself in rich food.",
      "links": "<a href='/AIV/40/6/25'>Matt. 6:25</a>; <a href='/AIV/19/36/8'>Ps. 36:8</a>",
      "comment": "This verse contrasts earthly striving with the sustenance offered by God. Rich food represents spiritual nourishment. Jesus echoes this in teaching not to worry about material needs but to seek God's kingdom (Matt. 6:25-33). The deeper meaning points toward finding true satisfaction in communion with God."
    },
    {
      "pk": 29055003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 3,
      "text": "Incline your ear and come to me; listen, so your soul may live. I will make with you an everlasting covenant, my faithful love promised to David.",
      "links": "<a href='/AIV/44/13/34'>Acts 13:34</a>; <a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>; <a href='/AIV/19/89/28-29'>Ps. 89:28-29</a>",
      "comment": "The everlasting covenant refers to the promise made to David, ultimately fulfilled in Christ (Acts 13:34). The invitation to 'come to me' echoes Christ's own calls in the New Testament, emphasizing both personal relationship and participation in the covenant."
    },
    {
      "pk": 29055004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 4,
      "text": "See, I have made him a witness to the peoples, a leader and commander for the peoples.",
      "links": "<a href='/AIV/19/18/43'>Ps. 18:43</a>; <a href='/AIV/40/28/18-19'>Matt. 28:18-19</a>",
      "comment": "Though initially about David, the ‘witness to the peoples’ points to the Messiah who brings salvation to all nations. This is later fulfilled as Christ sends out his disciples to all the earth (Matt. 28:19)."
    },
    {
      "pk": 29055005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 5,
      "text": "Surely you will call a nation you do not know, and a nation that does not know you will run to you, because of the LORD your God, and of the Holy One of Israel, for he has glorified you.",
      "links": "<a href='/AIV/19/72/11'>Ps. 72:11</a>; <a href='/AIV/23/60/3'>Isa. 60:3</a>; <a href='/AIV/20/8/17'>Prov. 8:17</a>",
      "comment": "This verse anticipates the gathering of Gentiles into the promise, fulfilling the universal scope of salvation. Spiritual interpretation sees the Church as drawing all peoples through the glorification of the Messiah."
    },
    {
      "pk": 29055006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 6,
      "text": "Seek the LORD while he may be found; call upon him while he is near.",
      "links": "<a href='/AIV/24/29/13'>Jer. 29:13</a>; <a href='/AIV/58/4/7'>Heb. 4:7</a>",
      "comment": "There is an urgency to respond to God's invitation. The possibility of grace is not limitless; conversion and repentance have a proper time. Hebrews 4:7 underscores this call to respond 'today.'"
    },
    {
      "pk": 29055007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 7,
      "text": "Let the wicked forsake his way, and the unrighteous his thoughts; let him return to the LORD, who will have mercy on him, and to our God, for he will abundantly pardon.",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/42/15/20-24'>Luke 15:20-24</a>",
      "comment": "God’s mercy is emphasized, inviting repentance as a return to true life. This abundant pardon prefigures the New Testament parables like the prodigal son (Luke 15:20-24), showing the transformation possible through repentance, a key part of spiritual renewal."
    },
    {
      "pk": 29055008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 8,
      "text": "For my thoughts are not your thoughts, neither are your ways my ways, declares the LORD.",
      "links": "<a href='/AIV/19/92/5'>Ps. 92:5</a>; <a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "God’s wisdom and plan far surpass human understanding. Paul echoes this in Romans 11:33, highlighting the mystery and depth of divine providence—a call to humility before the supernatural realities of faith."
    },
    {
      "pk": 29055009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 9,
      "text": "For as the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts.",
      "links": "<a href='/AIV/19/103/11'>Ps. 103:11</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "God’s transcendence is affirmed. This radical difference assures believers that divine guidance is more reliable than human plans—encouraging trust in God’s unseen work, especially in spiritual matters."
    },
    {
      "pk": 29055010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 10,
      "text": "For just as rain and snow come down from heaven and do not return there without watering the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater,",
      "links": "<a href='/AIV/28/2/21-23'>Hos. 2:21-23</a>; <a href='/AIV/40/13/3-9'>Matt. 13:3-9</a>",
      "comment": "God’s word is likened to rain: effectual and fruitful. The sower and bread imagery connects with Jesus’ parable of the sower, and the idea that participation in God’s word and sacramental life brings growth."
    },
    {
      "pk": 29055011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 11,
      "text": "so shall my word be that goes out from my mouth; it will not return to me empty, but will accomplish what I desire and succeed in the purpose for which I sent it.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/43/17/17'>John 17:17</a>",
      "comment": "God’s word is both creative and effective; it brings about what He intends. This has been associated with the sacramental reality of God's word and the power of spiritual promises being fulfilled—a unity of word and action in salvation history."
    },
    {
      "pk": 29055012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 12,
      "text": "You will go out in joy and be led forth in peace; the mountains and hills will burst into song before you, and all the trees of the field will clap their hands.",
      "links": "<a href='/AIV/19/98/8'>Ps. 98:8</a>; <a href='/AIV/23/35/10'>Isa. 35:10</a>",
      "comment": "Creation is depicted celebrating redemption. The restoration of joy and peace connects to themes of spiritual fulfillment and the harmony of God's family. The spiritual interpretation points toward the new creation inaugurated in Christ."
    },
    {
      "pk": 29055013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 55,
      "verse": 13,
      "text": "Instead of the thorn will come up the cypress, instead of the brier the myrtle will grow; these will be for the LORD’s renown, for an everlasting sign that will not be cut off.",
      "links": "<a href='/AIV/23/41/19-20'>Isa. 41:19-20</a>; <a href='/AIV/66/22/2-3'>Rev. 22:2-3</a>",
      "comment": "Thorns and briers—symbols of sin and curse—are replaced by life and beauty, showing spiritual transformation. Everlasting sign references the permanence of God’s work, connected to the new creation and eternal communion with God (Rev. 22:2-3)."
    }
  ],
  "translatedAt": "2025-12-24T08:16:09.954Z"
}