{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 22,
  "verses": [
    {
      "pk": 29022001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 1,
      "text": "The oracle concerning the Valley of Vision: What is happening to you now, that all of you have gone up to the rooftops?",
      "links": "<a href='/AIV/23/21/1'>Isa. 21:1</a>; <a href='/AIV/24/26/18'>Jer. 26:18</a>",
      "comment": "The 'Valley of Vision' is Jerusalem. Rooftops were often used as lookout points. This prophecy begins with a question about unexpected excitement or alarm in Jerusalem."
    },
    {
      "pk": 29022002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 2,
      "text": "You are a city full of noise, a town full of commotion, a city of revelry, not of slain lying dead by the sword; your dead were not killed in battle.",
      "links": "<a href='/AIV/19/55/2'>Ps. 55:2</a>",
      "comment": "The people are celebrating while under threat. The passage implies impending judgment. Jerusalem’s citizens perish not in battle but from other causes—suggesting divine judgment."
    },
    {
      "pk": 29022003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 3,
      "text": "All your leaders have fled together; they were captured without using the bow. All who were found in you were taken prisoner together, though they had fled far away.",
      "links": "<a href='/AIV/24/39/4'>Jer. 39:4</a>",
      "comment": "Rather than defending their people, Jerusalem’s leaders abandon their posts and are easily captured—an image of failed human leadership contrasted with true spiritual leadership."
    },
    {
      "pk": 29022004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 4,
      "text": "Therefore I said, 'Turn away from me; let me weep bitterly. Do not try to comfort me concerning the destruction of the daughter of my people.'",
      "links": "<a href='/AIV/25/1/16'>Lam. 1:16</a>",
      "comment": "Isaiah’s sorrow as a prophet is profound, echoing the sorrow Christ expresses over Jerusalem (<a href='/AIV/40/23/37'>Matt. 23:37</a>). True leaders share the suffering of their people."
    },
    {
      "pk": 29022005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 5,
      "text": "For the Lord GOD of Armies has a day of tumult, trampling, and confusion in the Valley of Vision, a day of battering down walls and crying to the mountains.",
      "links": "<a href='/AIV/23/2/12'>Isa. 2:12</a>; <a href='/AIV/28/10/7'>Hos. 10:7</a>",
      "comment": "God’s judgment is depicted as inescapable and divinely appointed. The prophetic warning is also a call to repentance before disaster. The motif of walls being breached looks forward to later judgments and, typically, the need for divine protection."
    },
    {
      "pk": 29022006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 6,
      "text": "Elam took up the quiver with chariots and horsemen, and Kir uncovered the shield.",
      "links": "<a href='/AIV/23/21/2'>Isa. 21:2</a>; <a href='/AIV/12/16/9'>2 Kings 16:9</a>",
      "comment": "Elam and Kir symbolize the foreign invaders God uses to judge His people. Their assembling signals that threats come from unexpected directions, reinforcing God's sovereign control over nations."
    },
    {
      "pk": 29022007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 7,
      "text": "Your choicest valleys were filled with chariots, and the horsemen took up positions at the gates.",
      "links": "<a href='/AIV/07/5/8'>Judg. 5:8</a>",
      "comment": "Jerusalem’s best defenses are overwhelmed; worldly might cannot substitute for reliance on God. This foreshadows the ultimate need for spiritual defense."
    },
    {
      "pk": 29022008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 8,
      "text": "He removed the covering of Judah. In that day you looked to the weapons in the House of the Forest.",
      "links": "<a href='/AIV/11/7/2'>1 Kings 7:2</a>",
      "comment": "God allowing the 'covering' to be removed means divine protection is lifted. The 'House of the Forest' was an armory in Jerusalem—notice the people’s misplaced trust in arms, not in God."
    },
    {
      "pk": 29022009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 9,
      "text": "You saw that the breaches in the city of David were many. You collected the water of the lower pool.",
      "links": "<a href='/AIV/14/32/30'>2 Chr. 32:30</a>",
      "comment": "Jerusalem tries to prepare defenses by reinforcing walls and stockpiling water, but without spiritual renewal, physical works are not enough."
    },
    {
      "pk": 29022010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 10,
      "text": "You counted the houses of Jerusalem and broke down houses to strengthen the wall.",
      "links": "<a href='/AIV/16/3/13'>Neh. 3:13</a>",
      "comment": "Practical measures are taken to defend the city, but again the central problem is spiritual forgetfulness. Human efforts apart from God’s grace are insufficient."
    },
    {
      "pk": 29022011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 11,
      "text": "You made a reservoir between the two walls for the water of the old pool, but you did not look to Him who did it, nor consider the One who planned it long ago.",
      "links": "<a href='/AIV/12/20/20'>2 Kings 20:20</a>",
      "comment": "Physical preparations ignore the ultimate source of safety: God. True renewal must always be rooted in faith and obedience to God—not just external works."
    },
    {
      "pk": 29022012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 12,
      "text": "On that day the Lord GOD of Armies called you to weeping and to mourning, to shave your head and to put on sackcloth.",
      "links": "<a href='/AIV/29/2/12'>Joel 2:12</a>; <a href='/AIV/33/1/8'>Mic. 1:8</a>",
      "comment": "God’s call is to true repentance—an inward and outward expression of sorrow. The practice of sackcloth and shaving heads signifies humility before God."
    },
    {
      "pk": 29022013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 13,
      "text": "But instead, there is joy and celebration, killing of cattle and slaughtering sheep, eating meat and drinking wine: 'Let us eat and drink, for tomorrow we die!'",
      "links": "<a href='/AIV/46/15/32'>1 Cor. 15:32</a>; <a href='/AIV/23/56/12'>Isa. 56:12</a>",
      "comment": "The people respond to crisis with indulgence, ignoring God’s call. Paul later quotes this verse, warning against worldly hedonism and advocating resurrection faith."
    },
    {
      "pk": 29022014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 14,
      "text": "The LORD of Armies revealed Himself in my ears: 'Surely this iniquity will not be forgiven you till you die,' says the Lord GOD of Armies.",
      "links": "<a href='/AIV/40/12/31'>Matt. 12:31</a>",
      "comment": "Persistent refusal to repent leads to hard judgment. There is a warning here of the gravity of unrepented sin—a theme echoed in the New Testament regarding 'sins against the Holy Spirit.'"
    },
    {
      "pk": 29022015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 15,
      "text": "Thus says the Lord GOD of Armies: 'Go, approach this steward, to Shebna, who is over the house, and say to him:'",
      "links": "<a href='/AIV/12/18/18'>2 Kings 18:18</a>",
      "comment": "Shebna is the palace administrator—a key leadership role. The authority over the 'house' or royal household prefigures later New Testament offices in the Church, with their roles and responsibilities."
    },
    {
      "pk": 29022016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 16,
      "text": "'What are you doing here, and whom do you have here, that you have cut out a tomb here for yourself, you who hew out a tomb on the height and carve a dwelling for yourself in the rock?'",
      "links": "<a href='/AIV/40/27/60'>Matt. 27:60</a>",
      "comment": "Shebna’s pride in preparing an ornate tomb is condemned. Prideful self-exaltation opposes the humility godly leaders are called to."
    },
    {
      "pk": 29022017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 17,
      "text": "Behold, the LORD is about to hurl you away, O mighty man, He will seize you firmly,",
      "links": "<a href='/AIV/09/2/7'>1 Sam. 2:7</a>",
      "comment": "God will depose the proud and exalt the humble, echoing the song of Hannah and Mary (the Magnificat, <a href='/AIV/42/1/52'>Luke 1:52</a>), anticipating Christ’s teaching on humility and authority."
    },
    {
      "pk": 29022018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 18,
      "text": "He will roll you up tightly like a ball and throw you into a wide country; there you shall die, and there the chariots of your glory shall be the shame of your master’s house.",
      "links": "<a href='/AIV/23/8/22'>Isa. 8:22</a>",
      "comment": "A poetic image of Shebna’s removal and exile. Human achievements are ultimately empty apart from obedience to God’s will."
    },
    {
      "pk": 29022019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 19,
      "text": "I will drive you from your office, and you will be pulled down from your station.",
      "links": "<a href='/AIV/13/26/10'>1 Chr. 26:10</a>",
      "comment": "God is sovereign over appointments to leadership. This removal anticipates the divine authority given in the New Testament for binding and loosing, and for apostolic succession."
    },
    {
      "pk": 29022020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 20,
      "text": "In that day I will call my servant Eliakim the son of Hilkiah,",
      "links": "<a href='/AIV/12/18/18'>2 Kings 18:18</a>",
      "comment": "A new, faithful steward is appointed. Eliakim is presented as God's servant, establishing a pattern for chosen leadership through whom God’s authority is exercised."
    },
    {
      "pk": 29022021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 21,
      "text": "I will clothe him with your robe and bind your sash around him, and give your authority into his hand. He shall be a father to the inhabitants of Jerusalem and to the house of Judah.",
      "links": "<a href='/AIV/01/45/8'>Gen. 45:8</a>; <a href='/AIV/66/3/7'>Rev. 3:7</a>",
      "comment": "The steward receives symbols of authority—robe, sash, and office. Being a 'father' prefigures spiritual fatherhood and authority in the New Testament (see <a href='/AIV/40/16/19'>Matt. 16:19</a>; <a href='/AIV/66/3/7'>Rev. 3:7</a>)."
    },
    {
      "pk": 29022022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 22,
      "text": "I will place the key of the house of David on his shoulder. What he opens, no one can shut; what he shuts, no one can open.",
      "links": "<a href='/AIV/40/16/19'>Matt. 16:19</a>; <a href='/AIV/66/3/7'>Rev. 3:7</a>",
      "comment": "This 'key of the house of David' is a symbol of supreme spiritual authority. Jesus applies this image to Himself and gives it to Peter (see <a href='/AIV/40/16/19'>Matt. 16:19</a>), signaling leadership and stewardship over God’s people."
    },
    {
      "pk": 29022023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 23,
      "text": "I will drive him like a peg into a secure place, and he will become a throne of honor for his father’s house.",
      "links": "<a href='/AIV/38/10/4'>Zech. 10:4</a>",
      "comment": "The 'peg in a secure place' is a foundation for the people. Spiritual authority provides stability. This points forward to the enduring foundation Christ gives to the apostolic office (<a href='/AIV/49/2/20'>Eph. 2:20</a>)."
    },
    {
      "pk": 29022024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 24,
      "text": "They will hang on him the whole weight of his father’s house: the offspring and descendants, all the small vessels, from bowls to all the jars.",
      "links": "<a href='/AIV/19/75/3'>Ps. 75:3</a>",
      "comment": "The steward bears responsibility for all the household. This prefigures the burden of pastoral office in the New Testament; servant leadership is sacrificial and comprehensive."
    },
    {
      "pk": 29022025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 22,
      "verse": 25,
      "text": "'In that day,' declares the LORD of Armies, 'the peg driven into a secure place will give way; it will be cut down and fall, and the load that was on it will be destroyed.' For the LORD has spoken.",
      "links": "<a href='/AIV/38/10/4'>Zech. 10:4</a>",
      "comment": "Even the most secure positions can fail if not continually upheld by God. This brings attention to the danger of depending on human office alone, and calls for humble reliance on divine grace as the source of enduring authority."
    }
  ],
  "translatedAt": "2025-12-24T08:00:37.372Z"
}