{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 9,
  "verses": [
    {
      "pk": 29009001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 1,
      "text": "But there will be no more gloom for her who was in distress. In the former time he humbled the land of Zebulun and the land of Naphtali, but in the latter time he will honor the way of the sea, beyond the Jordan, Galilee of the nations.",
      "links": "<a href='/AIV/40/4/15-16'>Matt. 4:15-16</a>",
      "comment": "The regions mentioned here—Zebulun, Naphtali, and Galilee—were among the first to suffer during invasions, but Isaiah prophesies that these places will be exalted. Matthew references this as being fulfilled in Jesus' ministry in Galilee, showing God's restoration begins in unexpected places."
    },
    {
      "pk": 29009002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 2,
      "text": "The people walking in darkness have seen a great light; those dwelling in the land of deep shadow, on them light has shined.",
      "links": "<a href='/AIV/40/4/16'>Matt. 4:16</a>; <a href='/AIV/43/1/4-9'>John 1:4-9</a>",
      "comment": "This verse foretells the coming of a Redeemer who will be the light to those in spiritual darkness. Christians see this as a clear prophecy of Christ, the true Light, spreading hope to all nations."
    },
    {
      "pk": 29009003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 3,
      "text": "You have multiplied the nation; you have increased its joy. They rejoice before you as with joy at harvest, as people exult when dividing the spoils.",
      "links": "<a href='/AIV/19/126/5-6'>Ps. 126:5-6</a>; <a href='/AIV/19/4/7'>Ps. 4:7</a>",
      "comment": "The joy described here is communal and celebratory, suggesting the blessings God gives to His covenant people are meant for all, not just a select few."
    },
    {
      "pk": 29009004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 4,
      "text": "For as in the day of Midian’s defeat, you have broken the yoke of their burden and the staff on their shoulders, the rod of their oppressor.",
      "links": "<a href='/AIV/07/7/22'>Judg. 7:22</a>; <a href='/AIV/23/10/27'>Isa. 10:27</a>",
      "comment": "Referencing Gideon's victory over Midian, Isaiah assures liberation from oppression is God's work. This points to divine deliverance, both physically and spiritually, echoing Christ's victory over sin."
    },
    {
      "pk": 29009005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 5,
      "text": "For every boot of the warrior tramping in battle and every garment rolled in blood will be burned as fuel for the fire.",
      "links": "<a href='/AIV/19/46/9'>Ps. 46:9</a>; <a href='/AIV/23/2/4'>Isa. 2:4</a>",
      "comment": "The end of war imagery here signifies not just peace, but a thorough purging of violence—pointing toward the messianic age of true peace."
    },
    {
      "pk": 29009006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 6,
      "text": "For unto us a child is born, unto us a son is given; and the government will be upon his shoulders. And his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.",
      "links": "<a href='/AIV/40/1/23'>Matt. 1:23</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>; <a href='/AIV/43/14/27'>John 14:27</a>",
      "comment": "This verse is a major messianic prophecy, recognized as fulfilled in Jesus. The divine titles given to the child show both His divinity and His eternal rule, emphasizing that God comes truly among us in the person of Christ."
    },
    {
      "pk": 29009007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 7,
      "text": "Of the increase of his government and of peace there will be no end. On the throne of David and over his kingdom, to establish it and to uphold it with justice and righteousness from this time forth and forevermore. The zeal of the LORD of hosts will accomplish this.",
      "links": "<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>; <a href='/AIV/10/7/12-13'>2 Sam. 7:12-13</a>; <a href='/AIV/23/16/5'>Isa. 16:5</a>",
      "comment": "This points to the everlasting rule of the Messiah, who fulfills God's covenant to David. This is understood as Christ's eternal kingship, shown in the New Testament."
    },
    {
      "pk": 29009008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 8,
      "text": "The Lord sent a word against Jacob, and it has fallen upon Israel.",
      "links": "<a href='/AIV/23/7/8'>Isa. 7:8</a>; <a href='/AIV/23/10/22'>Isa. 10:22-23</a>",
      "comment": "This signals God's judgment—His prophetic word is active and brings consequences. The unity of Jacob and Israel shows continuity in God's dealing with His people."
    },
    {
      "pk": 29009009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 9,
      "text": "And all the people will know, Ephraim and the inhabitants of Samaria, who say in pride and in arrogance of heart:",
      "links": "<a href='/AIV/23/28/1-3'>Isa. 28:1-3</a>",
      "comment": "Ephraim and Samaria represent the northern tribes, and their pride is the root of their downfall, a frequent theme in prophetic literature, warning about self-reliance in contrast to trusting God."
    },
    {
      "pk": 29009010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 10,
      "text": "The bricks have fallen, but we will build with hewn stones; the sycamores have been cut down, but we will put cedars in their place.",
      "links": "<a href='/AIV/39/1/4'>Mal. 1:4</a>; <a href='/AIV/23/28/26-29'>Isa. 28:26-29</a>",
      "comment": "The verse shows human pride seeking to rebuild without repentance, relying on their own strength rather than God’s mercy."
    },
    {
      "pk": 29009011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 11,
      "text": "Therefore the LORD will raise up adversaries against them from Rezin and will stir up their enemies.",
      "links": "<a href='/AIV/23/7/1'>Isa. 7:1</a>; <a href='/AIV/12/16/7-9'>2 Kgs. 16:7-9</a>",
      "comment": "God’s response to pride is to bring chastisement via foreign powers, an act that, while disciplinary, is ultimately meant to lead the people to repentance and restoration."
    },
    {
      "pk": 29009012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 12,
      "text": "The Syrians from the east and Philistines from the west have devoured Israel with open mouth. Yet still, His anger is not turned away, and His hand is still stretched out.",
      "links": "<a href='/AIV/23/5/25'>Isa. 5:25</a>; <a href='/AIV/23/10/4'>Isa. 10:4</a>",
      "comment": "Repeated phrase 'His hand is still stretched out' emphasizes the persistence of divine judgment while also suggesting God's continual openness to repentance."
    },
    {
      "pk": 29009013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 13,
      "text": "For the people did not turn to Him who struck them, nor seek the LORD of hosts.",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "Isaiah points out the true problem: lack of repentance and seeking God. This spiritual lesson applies to every generation—worldly suffering is meant to draw hearts back to their Creator."
    },
    {
      "pk": 29009014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 14,
      "text": "So the LORD cut off from Israel head and tail, palm branch and reed in one day.",
      "links": "<a href='/AIV/23/19/15'>Isa. 19:15</a>",
      "comment": "The 'head and tail' image refers to all ranks and classes—the completeness of God's judgment upon the whole nation, not just a few."
    },
    {
      "pk": 29009015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 15,
      "text": "The elder and the honored man are the head; the prophet who teaches lies is the tail.",
      "links": "<a href='/AIV/23/3/2'>Isa. 3:2</a>; <a href='/AIV/24/23/16'>Jer. 23:16</a>",
      "comment": "Spiritual authority and truthful teaching are essential. The verse cautions against false prophecy, highlighting the need for faithful, authoritative interpretation."
    },
    {
      "pk": 29009016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 16,
      "text": "For those who lead this people cause them to err, and those who are led by them are destroyed.",
      "links": "<a href='/AIV/40/15/14'>Matt. 15:14</a>; <a href='/AIV/23/3/12'>Isa. 3:12</a>",
      "comment": "Isaiah warns that leadership matters for right worship and faithfulness to God’s covenant. Faithful guidance safeguards the people from spiritual destruction."
    },
    {
      "pk": 29009017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 17,
      "text": "Therefore the Lord does not rejoice over their young men, nor have mercy on their fatherless and widows; for everyone is ungodly and an evildoer, and every mouth speaks folly. Yet still, His anger is not turned away, and His hand is still stretched out.",
      "links": "<a href='/AIV/23/10/4'>Isa. 10:4</a>; <a href='/AIV/23/5/25'>Isa. 5:25</a>",
      "comment": "The passage underscores the seriousness of unchecked sin, even among society’s most vulnerable. The repeated phrase about God’s outstretched hand signals both judgment and merciful opportunity for repentance."
    },
    {
      "pk": 29009018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 18,
      "text": "For wickedness burns like a fire; it consumes briers and thorns and sets the thickets of the forest ablaze, so that it rolls upward in a column of smoke.",
      "links": "<a href='/AIV/19/83/14'>Ps. 83:14</a>; <a href='/AIV/23/10/17'>Isa. 10:17</a>",
      "comment": "Sin is portrayed as destructive wildfire, consuming not only the guilty but even the innocent surroundings. This allegorical fire of unrighteousness foreshadows both temporal and spiritual consequences."
    },
    {
      "pk": 29009019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 19,
      "text": "By the wrath of the LORD of hosts the land is scorched, and the people are like fuel for the fire; no one spares his brother.",
      "links": "<a href='/AIV/23/1/7'>Isa. 1:7</a>; <a href='/AIV/23/42/25'>Isa. 42:25</a>",
      "comment": "Total devastation is the result of God’s righteous anger. Breakdown of brotherhood illustrates that, apart from God's grace, even the closest bonds are shattered."
    },
    {
      "pk": 29009020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 20,
      "text": "They snatch on the right hand but are still hungry, and they eat on the left but are not satisfied; each devours the flesh of his own arm.",
      "links": "<a href='/AIV/23/49/26'>Isa. 49:26</a>",
      "comment": "The image of insatiable hunger and self-destruction reflects the futility of seeking fulfillment apart from God—spiritually, this is true for all who refuse the grace offered through the Messiah."
    },
    {
      "pk": 29009021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 9,
      "verse": 21,
      "text": "Manasseh devours Ephraim, and Ephraim devours Manasseh; together they are against Judah. Yet still, His anger is not turned away, and His hand is still stretched out.",
      "links": "<a href='/AIV/23/10/4'>Isa. 10:4</a>; <a href='/AIV/19/106/13'>Ps. 106:13</a>",
      "comment": "Division among the tribes reflects the consequences of sin and rejection of God’s unity. The hope for lasting peace must come through God’s intervention, which the earlier verses tie to the coming King—this implicitly points us toward Christ as the only source of true reconciliation."
    }
  ],
  "translatedAt": "2025-12-24T07:55:13.653Z"
}