{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 1,
  "verses": [
    {
      "pk": 29001001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 1,
      "text": "The vision of Isaiah son of Amoz, which he saw concerning Judah and Jerusalem, in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah.",
      "links": "<a href='/AIV/12/15/27'>2 Kings 15:27</a>; <a href='/AIV/14/26/22'>2 Chr. 26:22</a>",
      "comment": "Isaiah was a prophet whose ministry spanned the reigns of several kings. The vision refers to prophetic revelation, showing God's concern for His people over generations. This historical context highlights God’s unchanging faithfulness and the continuity of His covenantal guidance for both the nation and the promise of the Messiah."
    },
    {
      "pk": 29001002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 2,
      "text": "Hear, O heavens, and give ear, O earth! For the LORD has spoken: 'I have raised children and brought them up, but they have rebelled against Me.'",
      "links": "<a href='/AIV/05/32/1'>Deut. 32:1</a>; <a href='/AIV/24/6/19'>Jer. 6:19</a>",
      "comment": "Isaiah calls creation itself to witness Israel’s rebellion against God, reminiscent of Deuteronomy 32:1. The language emphasizes God's role as Father, prefiguring New Testament understandings of spiritual sonship. The motif of rebellion implies a need for reconciliation and deeper communion with God."
    },
    {
      "pk": 29001003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 3,
      "text": "The ox knows its owner, and the donkey its master's feeding trough, but Israel does not know; My people do not understand.",
      "links": "<a href='/AIV/24/8/7'>Jer. 8:7</a>",
      "comment": "God contrasts Israel's spiritual blindness to the innate knowledge of animals, showing how far Israel has wandered. The reference to 'My people' signals God's enduring affection and points toward the future invitation to a restored relationship, fulfilled more fully in Christ."
    },
    {
      "pk": 29001004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 4,
      "text": "Ah, sinful nation, a people loaded with guilt, offspring of evildoers, children who deal corruptly! They have abandoned the LORD, they have despised the Holy One of Israel, and have turned their backs on Him.",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>; <a href='/AIV/23/5/24'>Isa. 5:24</a>",
      "comment": "The phrase 'Holy One of Israel' is unique to Isaiah, expressing God's absolute holiness. Israel's guilt echoes collective sin, which later finds its remedy in the sacrificial offering of Christ. The sense of family ('offspring') underlines both judgment and hope for eventual redemption."
    },
    {
      "pk": 29001005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 5,
      "text": "Why will you keep being struck down? Why do you keep rebelling? Your whole head is sick, and your whole heart is faint.",
      "links": "<a href='/AIV/23/9/13'>Isa. 9:13</a>; <a href='/AIV/24/5/3'>Jer. 5:3</a>",
      "comment": "Persistent rebellion leads to deeper spiritual and physical affliction. This imagery foreshadows the New Testament's emphasis on healing through Christ, both spiritually and bodily. The sickness here is a consequence of disconnection from God's life-giving grace."
    },
    {
      "pk": 29001006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 6,
      "text": "From the sole of the foot to the head there is no soundness; only wounds and bruises and open sores, not pressed out or bound up or softened with oil.",
      "links": "<a href='/AIV/18/2/7'>Job 2:7</a>; <a href='/AIV/42/10/34'>Luke 10:34</a>",
      "comment": "Total depravity is shown; sin affects the whole person, reminiscent of the parable of the Good Samaritan (Luke 10:34), where mercy and healing come through sacramental means, symbolized by oil. The need for spiritual healing is a foreshadowing of the restoration offered in Christ."
    },
    {
      "pk": 29001007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 7,
      "text": "Your land is desolate, your cities are burned with fire; foreigners devour your fields in your presence—it is desolate, as overthrown by strangers.",
      "links": "<a href='/AIV/23/6/11'>Isa. 6:11</a>; <a href='/AIV/03/26/33'>Lev. 26:33</a>",
      "comment": "Desolation is a consequence of covenantal unfaithfulness, recalling the curses in Leviticus. The devastation marks a call to repentance, setting up the later prophetic hope for restoration and spiritual renewal."
    },
    {
      "pk": 29001008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 8,
      "text": "The daughter of Zion is left like a shelter in a vineyard, like a hut in a cucumber field, like a besieged city.",
      "links": "<a href='/AIV/25/2/6'>Lam. 2:6</a>",
      "comment": "'Daughter of Zion' is a poetic title for Jerusalem, suggesting vulnerability but also intimacy with God. This sets up further prophetic references to a future renewal of Zion, fulfilled in New Testament imagery of the Church as the new Jerusalem (Rev. 21:2)."
    },
    {
      "pk": 29001009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 9,
      "text": "If the LORD of hosts had not left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/45/9/29'>Rom. 9:29</a>",
      "comment": "A faithful remnant is preserved by God's mercy, prefiguring the concept of the elect. Paul picks up this verse in Romans 9:29, connecting it to the salvation and perseverance of God’s people. The idea of a remnant foreshadows the future community united in Christ."
    },
    {
      "pk": 29001010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 10,
      "text": "Hear the word of the LORD, you rulers of Sodom! Listen to the law of our God, you people of Gomorrah!",
      "links": "<a href='/AIV/19/50/7'>Ps. 50:7</a>; <a href='/AIV/01/19/13'>Gen. 19:13</a>",
      "comment": "By calling Israel ‘Sodom’ and ‘Gomorrah,’ Isaiah equates their sinfulness with infamous cities, stressing the gravity of their situation. Yet God’s call to hear signals ongoing invitation to repentance, echoing the theme of covenant invitation."
    },
    {
      "pk": 29001011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 11,
      "text": "'What are your many sacrifices to Me?' says the LORD. 'I have had enough of burnt offerings of rams and the fat of well-fed cattle; I do not delight in the blood of bulls, lambs, or goats.'",
      "links": "<a href='/AIV/19/50/9-13'>Ps. 50:9-13</a>; <a href='/AIV/40/9/13'>Matt. 9:13</a>",
      "comment": "God desires not mere ritual, but interior conversion. Jesus would later re-emphasize mercy over sacrificial ritual (Matt. 9:13). This prepares the way for worship centered on right relationship with God, as later fulfilled in the new covenant."
    },
    {
      "pk": 29001012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 12,
      "text": "When you come before Me, who has required this from your hands—to trample My courts?",
      "links": "<a href='/AIV/24/7/10'>Jer. 7:10</a>; <a href='/AIV/19/95/8'>Ps. 95:8</a>",
      "comment": "God criticizes empty ritual attendance. The heart, not mere presence, is what He seeks. This supports the importance of internal disposition in worship, a theme prominent in the teachings of Jesus and the apostolic tradition."
    },
    {
      "pk": 29001013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 13,
      "text": "Do not keep bringing empty offerings; incense is detestable to Me. New moons and Sabbaths, and the calling of assemblies—I cannot endure iniquity with solemn meeting.",
      "links": "<a href='/AIV/30/5/21'>Amos 5:21</a>; <a href='/AIV/39/1/10'>Mal. 1:10</a>",
      "comment": "God rejects ceremonies divorced from righteousness. This anticipates later teaching on authentic worship ‘in spirit and truth’ (John 4:24). Community worship remains central, but must arise from a life reconciled to God."
    },
    {
      "pk": 29001014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 14,
      "text": "Your new moons and appointed feasts My soul hates; they have become a burden to Me; I am weary of bearing them.",
      "links": "<a href='/AIV/28/2/11'>Hos. 2:11</a>",
      "comment": "Lawful celebrations, when separated from sincere devotion, weary God. Liturgical practice requires an inner conversion as its foundation, hinting at the necessity of sacramental life grounded in authentic faith."
    },
    {
      "pk": 29001015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 15,
      "text": "When you spread out your hands in prayer, I will hide My eyes from you. Even though you make many prayers, I will not listen; your hands are full of blood.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/20/28/9'>Prov. 28:9</a>",
      "comment": "Prayer unaccompanied by repentance and justice is rejected. This sets the stage for the New Testament’s stress on worship inseparable from a transformed life (James 5:16). The image of raised hands parallels priestly intercession, an important motif for mediators between God and man."
    },
    {
      "pk": 29001016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 16,
      "text": "Wash yourselves; make yourselves clean; remove the evil of your deeds from My sight. Stop doing evil.",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>; <a href='/AIV/60/1/22'>1 Pet 1:22</a>",
      "comment": "The call to cleansing symbolizes spiritual renewal, prefiguring the sacramental significance of water in baptism and ongoing repentance. God’s invitation remains open for restoration and holiness."
    },
    {
      "pk": 29001017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 17,
      "text": "Learn to do good; seek justice; rebuke the oppressor; defend the orphan, plead for the widow.",
      "links": "<a href='/AIV/19/82/3'>Ps. 82:3</a>; <a href='/AIV/59/1/27'>Jas. 1:27</a>",
      "comment": "Social justice, especially for the vulnerable, is a non-negotiable aspect of true religion. James echoes these words (Jas. 1:27), showing a seamless continuity between prophetic and apostolic mandates for charity."
    },
    {
      "pk": 29001018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 18,
      "text": "'Come now, and let us reason together,' says the LORD. 'Though your sins are like scarlet, they shall be as white as snow; though they are red like crimson, they shall be as wool.'",
      "links": "<a href='/AIV/19/51/7'>Ps. 51:7</a>; <a href='/AIV/62/1/7'>1 John 1:7</a>",
      "comment": "God’s invitation to dialogue and forgiveness prefigures the reconciling work of Christ. Sin, vividly pictured in scarlet, can only be removed through divine intervention, laying the groundwork for sacramental cleansing and full restoration (see 1 John 1:7)."
    },
    {
      "pk": 29001019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 19,
      "text": "If you are willing and obedient, you shall eat the good of the land.",
      "links": "<a href='/AIV/05/28/1-4'>Deut. 28:1-4</a>",
      "comment": "Obedience to God’s word brings blessing and fruitfulness. This promise is connected to the biblical motif of covenant blessings and echoes parallels between material and spiritual benefit for God’s faithful people."
    },
    {
      "pk": 29001020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 20,
      "text": "But if you refuse and rebel, you shall be devoured by the sword; for the mouth of the LORD has spoken.",
      "links": "<a href='/AIV/05/28/15-22'>Deut. 28:15-22</a>",
      "comment": "Rebellion leads to destruction, as God’s word brings both blessings and curses. The certainty of judgment underlines the seriousness of being in covenant with God and points to future warnings found throughout the prophetic and apostolic writings."
    },
    {
      "pk": 29001021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 21,
      "text": "How the faithful city has become a prostitute! Once full of justice; righteousness resided in her—but now, murderers.",
      "links": "<a href='/AIV/25/1/1'>Lam. 1:1</a>; <a href='/AIV/66/17/1-2'>Rev. 17:1-2</a>",
      "comment": "Jerusalem's spiritual adultery represents apostasy, linking the city’s fate to later biblical depictions of spiritual unfaithfulness. The contrast between past righteousness and present corruption is a call back to authentic justice and purity."
    },
    {
      "pk": 29001022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 22,
      "text": "Your silver has become dross, your wine diluted with water.",
      "links": "<a href='/AIV/26/22/18'>Ezek. 22:18</a>",
      "comment": "Loss of purity in both economy and worship signals deep spiritual crisis. Dross and diluted wine are images for corruption, contrasting with later prophecies of restoration and perfect offerings."
    },
    {
      "pk": 29001023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 23,
      "text": "Your princes are rebels and companions of thieves; everyone loves a bribe and chases after gifts. They do not defend the orphan, and the widow’s cause does not come before them.",
      "links": "<a href='/AIV/19/82/2'>Ps. 82:2</a>; <a href='/AIV/20/17/23'>Prov. 17:23</a>",
      "comment": "Failure of leadership to defend the weak is harshly condemned. True authority should safeguard justice, a theme Christ embodies in His teaching and actions."
    },
    {
      "pk": 29001024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 24,
      "text": "Therefore, declares the Lord, the LORD of hosts, the Mighty One of Israel: 'Ah! I will take vengeance on My adversaries, and I will turn My hand against My enemies.'",
      "links": "<a href='/AIV/19/132/2'>Ps. 132:2</a>; <a href='/AIV/23/63/1'>Isa. 63:1</a>",
      "comment": "'Mighty One of Israel' heightens God’s power in vindication. Judgment points beyond mere punishment, toward necessary purification and later restoration."
    },
    {
      "pk": 29001025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 25,
      "text": "I will turn My hand against you; I will thoroughly purge away your dross, and remove all your impurities.",
      "links": "<a href='/AIV/23/48/10'>Isa. 48:10</a>; <a href='/AIV/38/13/9'>Zech. 13:9</a>",
      "comment": "Divine discipline is aimed at purification, not mere destruction. The theme echoes later apostolic teaching on sanctification and the refining of God’s people."
    },
    {
      "pk": 29001026,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 26,
      "text": "Then I will restore your judges as at the first, and your counselors as at the beginning. Afterward you shall be called 'The City of Righteousness, the Faithful Town.'",
      "links": "<a href='/AIV/30/9/11'>Amos 9:11</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "God promises restoration and a return to genuine justice, prefiguring the New Testament vision of the Church as the ‘city of righteousness.’ Fulfillment is seen both locally and in the eternal city promised in Revelation."
    },
    {
      "pk": 29001027,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 27,
      "text": "Zion will be redeemed by justice, and those of her who repent, by righteousness.",
      "links": "<a href='/AIV/23/35/10'>Isa. 35:10</a>; <a href='/AIV/44/3/19'>Acts 3:19</a>",
      "comment": "Redemption comes through justice and repentance, pointing to the messianic age and the reconciliation accomplished by Christ. Spiritual renewal is central, integrating both moral and sacramental aspects."
    },
    {
      "pk": 29001028,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 28,
      "text": "Rebels and sinners will be broken together, and those who forsake the LORD shall be consumed.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/65/1/7'>Jude 1:7</a>",
      "comment": "Judgment falls on those who intentionally remain in rebellion, reinforcing the seriousness of enduring separation from God. This theme is echoed in Jesus’ teachings on judgment and restoration (Matt. 25:41)."
    },
    {
      "pk": 29001029,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 29,
      "text": "For you shall be ashamed of the sacred oaks which you desired, and embarrassed because of the gardens that you chose.",
      "links": "<a href='/AIV/23/57/5'>Isa. 57:5</a>",
      "comment": "Idolatry is described as spiritual adultery. The shame experienced points to the futility of worship not centered on the true God, reinforcing the call to exclusive devotion and repentance."
    },
    {
      "pk": 29001030,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 30,
      "text": "For you shall be like an oak whose leaf withers, and like a garden without water.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/40/21/19'>Matt. 21:19</a>",
      "comment": "A life apart from God loses vitality, illustrated by withered oak and dry gardens. Jesus uses similar imagery in His parables regarding fruitlessness and spiritual death."
    },
    {
      "pk": 29001031,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 1,
      "verse": 31,
      "text": "The strong shall become tinder, and his work a spark; both will burn together, and no one will quench them.",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>; <a href='/AIV/41/9/48'>Mark 9:48</a>",
      "comment": "Final judgment is depicted in terms borrowed for descriptions of hell, stressing the urgency of repentance. The unquenchable fire motif anticipates New Testament warnings and the promise of eternal life for the righteous."
    }
  ],
  "translatedAt": "2025-12-24T07:51:29.896Z"
}