{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 7,
  "verses": [
    {
      "pk": 29007001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 1,
      "text": "During the days of Ahaz son of Jotham, son of Uzziah, king of Judah, Rezin the king of Syria and Pekah son of Remaliah, king of Israel, went up to Jerusalem to wage war against it, but they could not prevail against it.",
      "links": "<a href='/AIV/12/16/5'>2 Kings 16:5</a>",
      "comment": "Isaiah begins with a historical note about the coalition against Judah. It shows God's protection over Jerusalem despite hostile forces. This verse sets the stage for God's promise."
    },
    {
      "pk": 29007002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 2,
      "text": "It was reported to the house of David, saying, 'Syria is allied with Ephraim.' So the heart of Ahaz and the heart of his people shook as the trees of the forest shake before the wind.",
      "links": "<a href='/AIV/23/37/7'>Isa. 37:7</a>",
      "comment": "The fear of the dynasty of David is emphasized here. The mention of 'house of David' reminds us of the special promises God gave to David’s line (see 2 Samuel 7:12-16)."
    },
    {
      "pk": 29007003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 3,
      "text": "Then the LORD said to Isaiah, 'Go out to meet Ahaz, you and Shear-jashub your son, at the end of the aqueduct of the Upper Pool, on the road to the Launderer's Field.'",
      "links": "<a href='/AIV/23/8/18'>Isa. 8:18</a>",
      "comment": "'Shear-jashub' means 'A remnant shall return,' foreshadowing that even in judgment, God’s mercy remains. The location underscores the real historical setting."
    },
    {
      "pk": 29007004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 4,
      "text": "Say to him, 'Take care, be quiet, do not fear, and do not let your heart be faint because of these two stumps of smoldering firebrands, because of the fierce anger of Rezin and Syria and the son of Remaliah.'",
      "links": "<a href='/AIV/23/30/15'>Isa. 30:15</a>",
      "comment": "The Lord instructs faith over fear. The 'smoldering firebrands' image shows the temporary, weakened state of Judah’s enemies."
    },
    {
      "pk": 29007005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 5,
      "text": "Because Syria, Ephraim, and the son of Remaliah have intended evil against you, saying,",
      "links": "<a href='/AIV/19/21/11'>Ps. 21:11</a>",
      "comment": "God reveals the secret plots of the nations, showing His omniscience and sovereignty."
    },
    {
      "pk": 29007006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 6,
      "text": "'Let us go up against Judah, terrify it, divide it among ourselves, and set up the son of Tabeel as king in its midst,'",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "The plan seeks to replace David’s rightful king. Compare with Psalm 2, where nations plot in vain against the Lord’s Anointed—here a type fulfilled ultimately in Christ (Acts 4:25-28)."
    },
    {
      "pk": 29007007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 7,
      "text": "Thus says the Lord GOD: 'It shall not stand, nor shall it happen.'",
      "links": "<a href='/AIV/23/8/10'>Isa. 8:10</a>",
      "comment": "God’s absolute sovereignty is seen here. Humans may plot, but God’s purpose prevails."
    },
    {
      "pk": 29007008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 8,
      "text": "'For the head of Syria is Damascus, and the head of Damascus is Rezin, and within sixty-five years Ephraim will be shattered from being a people.'",
      "links": "<a href='/AIV/12/17/1-6'>2 Kings 17:1-6</a>",
      "comment": "'Sixty-five years’ likely refers to the final depopulation of Israel (Ephraim) by Assyria. Judah is called to trust God’s plan for history."
    },
    {
      "pk": 29007009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 9,
      "text": "'And the head of Ephraim is Samaria, and the head of Samaria is the son of Remaliah. If you do not stand firm in faith, you will not stand at all.'",
      "links": "<a href='/AIV/41/11/22-24'>Mark 11:22-24</a>",
      "comment": "Faith is vital—only those who trust God endure. Jesus later echoes this principle (see Mark 11)."
    },
    {
      "pk": 29007010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 10,
      "text": "Again, the LORD spoke to Ahaz:",
      "links": "<a href='/AIV/23/1/1'>Isa. 1:1</a>",
      "comment": "God, in mercy, continues to address the king. Divine initiative is seen throughout Scripture."
    },
    {
      "pk": 29007011,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 11,
      "text": "'Ask a sign for yourself from the LORD your God; let it be as deep as Sheol or as high as heaven.'",
      "links": "<a href='/AIV/07/6/17'>Judg. 6:17</a>",
      "comment": "God invites Ahaz to ask for a miraculous sign. God's readiness to give proof of His promises points to His patience and willingness to strengthen faith."
    },
    {
      "pk": 29007012,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 12,
      "text": "But Ahaz said, 'I will not ask, I will not test the LORD.'",
      "links": "<a href='/AIV/05/6/16'>Deut. 6:16</a>; <a href='/AIV/40/4/7'>Matt. 4:7</a>",
      "comment": "Ahaz's refusal sounds pious, citing Deut. 6:16, but actually signals unbelief. Sometimes, false humility covers a lack of faith."
    },
    {
      "pk": 29007013,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 13,
      "text": "Then Isaiah said, 'Hear now, O house of David! Is it too little for you to weary men, that you also weary my God?'",
      "links": "<a href='/AIV/23/43/24'>Isa. 43:24</a>",
      "comment": "Isaiah addresses the house of David, not just Ahaz—pointing to the entire royal dynasty. The rebuke is strong; faithlessness offends God."
    },
    {
      "pk": 29007014,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 14,
      "text": "Therefore the Lord Himself will give you a sign: Behold, the virgin shall conceive and bear a son, and shall call his name Immanuel.",
      "links": "<a href='/AIV/40/1/23'>Matt. 1:23</a>; <a href='/AIV/09/7/12'>1 Sam. 7:12</a>",
      "comment": "This prophetic sign is pivotal. Ultimately, it finds its complete fulfillment in the birth of Jesus (see Matt. 1:23). 'Immanuel' means 'God with us,' affirming the incarnation—God’s physical presence among His people. The mention of a virgin points to a miraculous birth, a core Christian belief. The phrase hints at the special identity of the coming child, both for the immediate and future contexts."
    },
    {
      "pk": 29007015,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 15,
      "text": "He shall eat curds and honey when he knows how to refuse the evil and choose the good.",
      "links": "<a href='/AIV/23/8/8'>Isa. 8:8</a>",
      "comment": "Curds and honey signify a time of hardship mixed with natural abundance, fitting both the near and ultimate fulfillment. Christ, in His humanity, chose good and refused evil perfectly (see Heb. 4:15)."
    },
    {
      "pk": 29007016,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 16,
      "text": "For before the boy knows how to refuse the evil and choose the good, the land whose two kings you dread will be deserted.",
      "links": "<a href='/AIV/23/8/4'>Isa. 8:4</a>",
      "comment": "In the near term, this speaks to swift judgment on Judah’s enemies. Theologically, it points to how God’s plans unfold even before people fully grasp them."
    },
    {
      "pk": 29007017,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 17,
      "text": "The LORD will bring on you and your people and your father's house such days as have not come since the day that Ephraim departed from Judah—the king of Assyria.'",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>; <a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>",
      "comment": "Assyria’s coming is both judgment and chastening. God uses even foreign nations as instruments for His purpose."
    },
    {
      "pk": 29007018,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 18,
      "text": "On that day the LORD will whistle for the fly that is at the end of the streams of Egypt, and for the bee that is in the land of Assyria.",
      "links": "<a href='/AIV/05/28/49'>Deut. 28:49</a>",
      "comment": "Egypt and Assyria represent foreign powers summoned by God. The imagery of fly and bee shows the variety and reach of His instruments."
    },
    {
      "pk": 29007019,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 19,
      "text": "They will come and all rest in the steep ravines, in the clefts of the rocks, on all thornbushes, and at all watering places.",
      "links": "<a href='/AIV/23/2/19'>Isa. 2:19</a>",
      "comment": "There will be no place in the land untouched—the invaders fill every corner, a sign of total conquest."
    },
    {
      "pk": 29007020,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 20,
      "text": "On that day the Lord will shave with a razor hired from beyond the River—with the king of Assyria—the head and the hair of the legs, and it will also remove the beard.",
      "links": "<a href='/AIV/23/10/5'>Isa. 10:5</a>",
      "comment": "Shaving is a symbol of disgrace (compare 2 Sam. 10:4-5). The king of Assyria is an agent of divine discipline."
    },
    {
      "pk": 29007021,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 21,
      "text": "In that day a man will keep alive a young cow and two sheep,",
      "links": "<a href='/AIV/23/5/17'>Isa. 5:17</a>",
      "comment": "Desolation will reduce the land to subsistence living—few animals, a drastic change from prosperity to scarcity."
    },
    {
      "pk": 29007022,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 22,
      "text": "And because of the abundance of milk they give he will eat curds, for everyone who is left in the land will eat curds and honey.",
      "links": "<a href='/AIV/23/7/15'>Isa. 7:15</a>",
      "comment": "The diet of curds and honey is a sign both of judgment and of God preserving a remnant, a theme continued throughout Scripture (see Rom. 11:5)."
    },
    {
      "pk": 29007023,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 23,
      "text": "In that day every place where there were a thousand vines, valued at a thousand shekels of silver, will become briars and thorns.",
      "links": "<a href='/AIV/23/5/6'>Isa. 5:6</a>",
      "comment": "The land that once signified wealth will become desolate, a result of rejection of God’s ways."
    },
    {
      "pk": 29007024,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 24,
      "text": "With arrows and bows a man will come there, because all the land will be briars and thorns.",
      "links": "<a href='/AIV/23/32/13'>Isa. 32:13</a>",
      "comment": "Former vineyards now become wild, dangerous places. Sin’s consequence is spiritual as well as physical desolation."
    },
    {
      "pk": 29007025,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 7,
      "verse": 25,
      "text": "And as for all the hills that were once cultivated with the hoe, you will not go there for fear of briars and thorns; but they shall become places for cattle to be let loose and for sheep to trample.",
      "links": "<a href='/AIV/23/5/17'>Isa. 5:17</a>",
      "comment": "The once fruitful land will be for pasturing, not crops—even the terrain reflects God’s judgment and the need for renewal. Christ brings restoration where there was devastation, a reality fulfilled spiritually in the New Covenant."
    }
  ],
  "translatedAt": "2025-12-24T07:54:13.323Z"
}