{
  "book": 29,
  "bookName": "Isaiah",
  "bookAbbreviation": "Isa",
  "chapter": 35,
  "verses": [
    {
      "pk": 29035001,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 1,
      "text": "The wilderness and the dry land will be glad; the desert will rejoice and blossom like the crocus.",
      "links": "<a href='/AIV/23/32/15'>Isa. 32:15</a>; <a href='/AIV/19/96/12'>Ps. 96:12</a>",
      "comment": "This verse uses imagery of the desert coming to life as a symbol of renewal and redemption. The blossoming wilderness represents spiritual transformation and connects to the hope of restoration promised by God."
    },
    {
      "pk": 29035002,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 2,
      "text": "It will blossom abundantly, and rejoice with joy and singing. The glory of Lebanon will be given to it, the majesty of Carmel and Sharon. They will see the glory of the LORD, the splendor of our God.",
      "links": "<a href='/AIV/23/40/5'>Isa. 40:5</a>; <a href='/AIV/19/104/31'>Ps. 104:31</a>",
      "comment": "The reference to Lebanon, Carmel, and Sharon highlights areas known for their beauty and fertility. The renewed land points towards the manifestation of God's glory, foreshadowing the visible revelation of God in salvation history. Spiritual interpretations often see this as hinting toward the church as the locus of God’s ongoing glory and presence."
    },
    {
      "pk": 29035003,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 3,
      "text": "Strengthen the weak hands, and make firm the feeble knees.",
      "links": "<a href='/AIV/58/12/12'>Heb. 12:12</a>; <a href='/AIV/23/40/29'>Isa. 40:29</a>",
      "comment": "This verse is quoted in Hebrews 12:12, linking the hope of renewal to perseverance on the Christian journey. It calls believers to encourage and build up the weak, a theme carried out by the church through tangible acts of mercy and communal support."
    },
    {
      "pk": 29035004,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 4,
      "text": "Say to those with an anxious heart, 'Be strong; do not fear! Behold, your God will come with vengeance, with recompense from God. He will come and save you.'",
      "links": "<a href='/AIV/41/1/15'>Mark 1:15</a>; <a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "This promise of salvation anticipates the coming of the Lord to deliver his people. This finds deeper fulfillment in Christ, who brings God's salvation and judgement. The encouragement given here reflects the ongoing ministry of encouragement and hope found in the community of believers."
    },
    {
      "pk": 29035005,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 5,
      "text": "Then the eyes of the blind will be opened, and the ears of the deaf unstopped.",
      "links": "<a href='/AIV/40/11/5'>Matt. 11:5</a>; <a href='/AIV/42/7/22'>Luke 7:22</a>",
      "comment": "This verse is referenced by Jesus as a sign of the Messiah's ministry (see Matthew 11:5; Luke 7:22). These miraculous healings signal the breaking in of the Kingdom of God, both as physical deeds and as spiritual realities—with the opening of the eyes and ears of the heart."
    },
    {
      "pk": 29035006,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 6,
      "text": "Then the lame will leap like a deer, and the tongue of the mute will shout for joy. For waters will break forth in the wilderness, and streams in the desert.",
      "links": "<a href='/AIV/43/5/8-9'>John 5:8-9</a>; <a href='/AIV/19/107/35'>Ps. 107:35</a>",
      "comment": "Jesus fulfills these signs literally through miraculous healings (compare John 5:8-9). The image of streams in the desert suggests the life-giving grace that flows from God—interpreted spiritually as the sacraments that bring divine life and healing to the soul. These miraculous events show God at work through material means."
    },
    {
      "pk": 29035007,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 7,
      "text": "The burning sand will become a pool, and the thirsty ground springs of water; in the haunt where jackals once lay, grass and reeds and papyrus will grow.",
      "links": "<a href='/AIV/23/41/18'>Isa. 41:18</a>; <a href='/AIV/19/84/6'>Ps. 84:6</a>",
      "comment": "The transformation of desert into fertile land continues to symbolize both Israel's restoration and the spiritual renewal of God's people. This foreshadows the life offered through participation in God's promises and the sanctification that comes from union with Him."
    },
    {
      "pk": 29035008,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 8,
      "text": "A highway will be there, and it will be called the Way of Holiness. The unclean shall not pass over it. It shall belong to those who walk on the way; even if fools, they shall not go astray.",
      "links": "<a href='/AIV/23/40/3'>Isa. 40:3</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "The 'Way of Holiness' is understood both as a literal promise of a safe road for the return from exile and as a spiritual path to sanctification. In John 14:6, Jesus calls himself 'the Way,' linking the fulfillment of this prophecy to the life and teaching of Christ. The exclusivity and purity of this way underscores the necessity of grace and right doctrine in remaining on this path."
    },
    {
      "pk": 29035009,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 9,
      "text": "No lion will be there, nor will any ravenous beast go up on it; they shall not be found there. But the redeemed will walk there.",
      "links": "<a href='/AIV/35/3/13'>Nah. 3:13</a>; <a href='/AIV/23/11/6-9'>Isa. 11:6-9</a>",
      "comment": "The absence of danger along the holy way assures the protection of those who are redeemed, relating to the peace promised with God's kingdom (cf. Isa. 11:6-9). There is a clear distinction between the sanctified community and those outside it—a theme that relates to the spiritual safety in remaining within the true faith."
    },
    {
      "pk": 29035010,
      "translation": "AIV",
      "book": 29,
      "bookName": "Isaiah",
      "bookAbbreviation": "Isa",
      "chapter": 35,
      "verse": 10,
      "text": "And the ransomed of the LORD will return and come to Zion with singing; everlasting joy will crown their heads. Gladness and joy will overtake them, and sorrow and sighing will flee away.",
      "links": "<a href='/AIV/23/51/11'>Isa. 51:11</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "The return to Zion is fulfilled both historically (Israel’s return from exile) and spiritually, as the gathering of all the redeemed in the heavenly Jerusalem (cf. Rev. 21:4). The text points toward ultimate joy and union with God—interpreted as a promise for all who remain faithful and persevere to the end."
    }
  ],
  "translatedAt": "2025-12-24T08:06:49.822Z"
}