{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 12,
  "verses": [
    {
      "pk": 21001201,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 1,
      "text": "And he began to speak to them in parables: \"A man planted a vineyard, put a fence around it, dug a pit for a winepress, and built a tower. Then he leased it to tenant farmers and went away to another country.\"",
      "links": "<a href='/AIV/23/5/1-2'>Isaiah 5:1–2</a>;<a href='/AIV/40/21/33'>Matthew 21:33</a>",
      "comment": "Jesus’ parable draws directly from Isaiah 5, a picture of Israel as God’s vineyard. The audience, familiar with this imagery, would have recognized themselves in the story. The vineyard owner represents God, and Israel the vineyard."
    },
    {
      "pk": 21001202,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 2,
      "text": "When the season came, he sent a servant to the tenants to collect some of the fruit of the vineyard from them.",
      "links": "<a href='/AIV/19/80/8-16'>Psalm 80:8-16</a>",
      "comment": "The servants symbolize the prophets sent by God to call His people to faithfulness. The concept of bearing fruit is used throughout Scripture for faithful works or lives (see John 15:1-8)."
    },
    {
      "pk": 21001203,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 3,
      "text": "But they seized him, beat him, and sent him away empty-handed.",
      "links": "<a href='/AIV/14/36/15-16'>2 Chronicles 36:15–16</a>",
      "comment": "Israel’s rejection and mistreatment of God’s messengers is reaffirmed here. The pattern of the people rejecting the prophets highlights the history of resistance to God’s will."
    },
    {
      "pk": 21001204,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 4,
      "text": "Again he sent another servant to them, and they struck him on the head and treated him shamefully.",
      "links": "<a href='/AIV/24/20/2'>Jeremiah 20:2</a>",
      "comment": "The increasing violence reflects the escalating rejection of God’s covenant representatives."
    },
    {
      "pk": 21001205,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 5,
      "text": "And he sent another, and him they killed. And so with many others: some they beat, and some they killed.",
      "links": "<a href='/AIV/11/18/13'>1 Kings 18:13</a>; <a href='/AIV/40/23/37'>Matthew 23:37</a>",
      "comment": "Jesus summarizes Israel’s history of persecuting and even killing the prophets, preparing to unveil the ultimate rejection to come."
    },
    {
      "pk": 21001206,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 6,
      "text": "He had still one other, a beloved son. Finally he sent him to them, saying, ‘They will respect my son.’",
      "links": "<a href='/AIV/40/3/17'>Matthew 3:17</a>",
      "comment": "Here Jesus openly speaks of Himself as the Son, distinct from the prophets—implying a unique, divine relationship with the Father. ‘Beloved Son’ echoes the baptismal proclamation, signifying both messianic and divine identity."
    },
    {
      "pk": 21001207,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 7,
      "text": "But those tenants said to one another, ‘This is the heir. Come, let us kill him, and the inheritance will be ours.’",
      "links": "<a href='/AIV/40/21/38'>Matthew 21:38</a>",
      "comment": "The tenants’ plot foreshadows the religious leaders’ plan to eliminate Jesus, unwittingly fulfilling prophecy (Psalm 2:2)."
    },
    {
      "pk": 21001208,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 8,
      "text": "So they took him and killed him and threw him out of the vineyard.",
      "links": "<a href='/AIV/58/13/12'>Hebrews 13:12</a>",
      "comment": "Jesus predicts His own death outside of Jerusalem, aligning with the fate of sacrifices and martyrs cast outside the camp (cf. Heb 13:12)."
    },
    {
      "pk": 21001209,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 9,
      "text": "\"What then will the owner of the vineyard do? He will come and destroy the tenants and give the vineyard to others.\"",
      "links": "<a href='/AIV/19/118/22'>Psalm 118:22</a>",
      "comment": "The consequence foretells judgment upon unbelieving Israel and the vineyard’s transfer to new stewards (see Romans 11:17-21)."
    },
    {
      "pk": 21001210,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 10,
      "text": "Have you not read this Scripture: ‘The stone that the builders rejected has become the cornerstone’?",
      "links": "<a href='/AIV/19/118/22'>Psalm 118:22</a>;<a href='/AIV/60/2/7'>1 Peter 2:7</a>",
      "comment": "Jesus refers to Himself as the fulfillment of Psalm 118:22, identifying Himself as the essential foundation of God’s new work."
    },
    {
      "pk": 21001211,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 11,
      "text": "‘This was the Lord’s doing, and it is marvelous in our eyes.’”",
      "links": "<a href='/AIV/19/118/23'>Psalm 118:23</a>",
      "comment": "God’s providence is at work, even through rejection. The paradox of the rejected Messiah becoming the chief foundation is a central Christian mystery."
    },
    {
      "pk": 21001212,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 12,
      "text": "And they were seeking to arrest him, but feared the crowd, for they understood that he had told the parable against them. So they left him and went away.",
      "links": "<a href='/AIV/40/21/45-46'>Matthew 21:45–46</a>",
      "comment": "The religious leaders recognize the parable alludes to their coming judgment. Their response illustrates the human heart’s resistance against the truth Christ proclaims."
    },
    {
      "pk": 21001213,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 13,
      "text": "And they sent to him some of the Pharisees and of the Herodians to trap him in his words.",
      "links": "<a href='/AIV/40/22/15-16'>Matthew 22:15-16</a>",
      "comment": "Pharisees and Herodians, usually rivals, unite in opposition to Jesus—a sign of the threat He represents to entrenched powers."
    },
    {
      "pk": 21001214,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 14,
      "text": "They came and said to him, \"Teacher, we know that you are true and do not care about anyone’s opinion. For you do not regard the position of people, but truly teach the way of God. Is it lawful to pay taxes to Caesar or not? Should we pay them, or should we not?\"",
      "links": "<a href='/AIV/45/13/7'>Romans 13:7</a>",
      "comment": "Their approach disguises ulterior motives with flattery, raising a complex issue designed to snare Jesus between political and religious tensions."
    },
    {
      "pk": 21001215,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 15,
      "text": "But, knowing their hypocrisy, he said to them, \"Why are you testing me? Bring me a denarius to look at.\"",
      "links": "<a href='/AIV/42/20/23'>Luke 20:23</a>",
      "comment": "Jesus reveals their duplicity and prepares to teach a principle regarding political and divine authority."
    },
    {
      "pk": 21001216,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 16,
      "text": "And they brought one. And he said to them, \"Whose image and inscription is this?\" They said to him, \"Caesar's.\"",
      "links": "<a href='/AIV/40/22/20-21'>Matthew 22:20-21</a>",
      "comment": "By pointing to Caesar’s image, Jesus frames the debate around rightful ownership and authority."
    },
    {
      "pk": 21001217,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 17,
      "text": "Then Jesus said to them, \"Render to Caesar the things that are Caesar’s, and to God the things that are God’s.\" And they marveled at him.",
      "links": "<a href='/AIV/45/13/1-7'>Romans 13:1-7</a>",
      "comment": "Jesus acknowledges legitimate civil authority but asserts the higher claim of God. The statement invites reflection on the proper relationship between earthly and divine obligations."
    },
    {
      "pk": 21001218,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 18,
      "text": "And Sadducees, who say there is no resurrection, came to him, and they questioned him, saying,",
      "links": "<a href='/AIV/44/23/8'>Acts 23:8</a>",
      "comment": "The Sadducees denied the resurrection and only accepted the Pentateuch. Their question is aimed to ridicule the idea of bodily resurrection."
    },
    {
      "pk": 21001219,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 19,
      "text": "\"Teacher, Moses wrote for us that if a man’s brother dies and leaves a wife but leaves no child, the brother must marry the widow and raise up offspring for his brother.\"",
      "links": "<a href='/AIV/05/25/5'>Deuteronomy 25:5</a>",
      "comment": "They refer to the law of levirate marriage from the Torah. This regulation ensured family lineage and inheritance."
    },
    {
      "pk": 21001220,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 20,
      "text": "Now there were seven brothers. The first took a wife, and when he died left no offspring.",
      "links": "",
      "comment": "This sets up a hypothetical scenario to challenge the logic of resurrection."
    },
    {
      "pk": 21001221,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 21,
      "text": "The second married her and died, leaving no offspring. The third likewise,",
      "links": "",
      "comment": "The repetition adds force to their attempt to show the supposed absurdity of the resurrection."
    },
    {
      "pk": 21001222,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 22,
      "text": "And the seven left no offspring. Last of all, the woman also died.",
      "links": "",
      "comment": "A complete succession, to make their point stronger."
    },
    {
      "pk": 21001223,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 23,
      "text": "In the resurrection, when they rise again, whose wife will she be? For the seven had her as wife.\"",
      "links": "",
      "comment": "They intend this as a reductio ad absurdum, exposing their inability to grasp the true nature of resurrection life."
    },
    {
      "pk": 21001224,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 24,
      "text": "Jesus said to them, \"Is this not the reason you are wrong, because you know neither the Scriptures nor the power of God?\"",
      "links": "<a href='/AIV/24/32/17'>Jeremiah 32:17</a>",
      "comment": "Jesus corrects their misunderstanding, emphasizing both the authority of Scripture and God’s power to bring about new realities."
    },
    {
      "pk": 21001225,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 25,
      "text": "For when they rise from the dead, they neither marry nor are given in marriage, but are like angels in heaven.",
      "links": "<a href='/AIV/42/20/36'>Luke 20:36</a>",
      "comment": "Jesus teaches that resurrected life transcends earthly institutions. The spiritual transformation after resurrection creates realities beyond current human customs."
    },
    {
      "pk": 21001226,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 26,
      "text": "And as for the dead being raised, have you not read in the book of Moses, in the passage about the bush, how God spoke to him, saying, ‘I am the God of Abraham and the God of Isaac and the God of Jacob’?",
      "links": "<a href='/AIV/02/3/6'>Exodus 3:6</a>",
      "comment": "By citing Torah (Exodus), Jesus asserts the resurrection from the very texts the Sadducees accepted—Abraham, Isaac, Jacob still having relationship with God means they live on."
    },
    {
      "pk": 21001227,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 27,
      "text": "He is not the God of the dead, but of the living. You are greatly mistaken.\"",
      "links": "<a href='/AIV/45/4/17'>Romans 4:17</a>",
      "comment": "Jesus reveals God’s ongoing, living relationship with those who have died, affirming the doctrine of resurrection and the communion of saints."
    },
    {
      "pk": 21001228,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 28,
      "text": "And one of the scribes came up and heard them disputing with one another. Seeing that he answered them well, he asked him, \"Which commandment is the most important of all?\"",
      "links": "<a href='/AIV/05/6/5'>Deuteronomy 6:5</a>",
      "comment": "The scribe seeks the heart of the law—a theme central to faithful tradition. Jesus’ answer will show the unity of love and law."
    },
    {
      "pk": 21001229,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 29,
      "text": "Jesus answered, \"The most important is, ‘Hear, O Israel: The Lord our God, the Lord is one.’",
      "links": "<a href='/AIV/05/6/4'>Deuteronomy 6:4</a>",
      "comment": "This Shema, recited daily by Jews, is the foundation of monotheistic faith—affirming the one God whom the law orders us to love."
    },
    {
      "pk": 21001230,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 30,
      "text": "And you shall love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’",
      "links": "<a href='/AIV/05/6/5'>Deuteronomy 6:5</a>",
      "comment": "Love of God is total and undivided—integrating every part of the person. This holistic love is the primary commandment."
    },
    {
      "pk": 21001231,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 31,
      "text": "The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.\"",
      "links": "<a href='/AIV/03/19/18'>Leviticus 19:18</a>; <a href='/AIV/40/22/39-40'>Matthew 22:39–40</a>",
      "comment": "Love of neighbor flows from and is inseparable from love of God—Jesus unites both into the core of true faith."
    },
    {
      "pk": 21001232,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 32,
      "text": "And the scribe said to him, \"Well said, Teacher. You have truly stated that he is one, and there is no other besides him,",
      "links": "<a href='/AIV/05/4/35'>Deuteronomy 4:35</a>",
      "comment": "The scribe affirms Jesus’ teaching, recognizing the primacy of the worship of God above all."
    },
    {
      "pk": 21001233,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 33,
      "text": "and to love him with all the heart and with all the understanding and with all the strength, and to love one’s neighbor as oneself, is much more than all whole burnt offerings and sacrifices.\"",
      "links": "<a href='/AIV/28/6/6'>Hosea 6:6</a>; <a href='/AIV/09/15/22'>1 Samuel 15:22</a>",
      "comment": "The scribe grasps the priority of inner devotion over ritual, echoing prophetic calls for mercy and justice over sacrifice."
    },
    {
      "pk": 21001234,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 34,
      "text": "When Jesus saw that he answered thoughtfully, he said to him, \"You are not far from the kingdom of God.\" And after that, no one dared to ask him any more questions.",
      "links": "<a href='/AIV/40/22/46'>Matthew 22:46</a>",
      "comment": "Recognizing the truth draws one close to God’s reign, yet entry requires more—a theme of order, fullness, and authority handed down and received."
    },
    {
      "pk": 21001235,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 35,
      "text": "As Jesus taught in the temple, he said, \"How can the scribes say that the Messiah is the son of David?",
      "links": "<a href='/AIV/10/7/12'>2 Samuel 7:12</a>",
      "comment": "Jesus raises the question of the Messiah’s greater-than-David status, hinting at His divinity and heavenly origin."
    },
    {
      "pk": 21001236,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 36,
      "text": "David himself, in the Holy Spirit, declared, ‘The Lord said to my Lord, Sit at my right hand, until I put your enemies under your feet.’",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "Psalm 110 is one of the Old Testament’s clearest high-christology texts—David calls the Messiah ‘Lord,’ affirming the Messiah’s divinity and heavenly authority."
    },
    {
      "pk": 21001237,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 37,
      "text": "David himself calls him Lord. So how is he his son?\" And the great crowd heard him gladly.",
      "links": "<a href='/AIV/40/22/45'>Matthew 22:45</a>",
      "comment": "Jesus’ argument reveals the Messiah must be more than a human descendant; divine sonship points to the mystery of Christ’s two natures."
    },
    {
      "pk": 21001238,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 38,
      "text": "And in his teaching he said, \"Beware of the scribes, who like to walk around in long robes, and greetings in the marketplaces,",
      "links": "<a href='/AIV/40/23/5-7'>Matthew 23:5-7</a>",
      "comment": "Jesus warns against outward show and pride in spiritual leadership; true leadership is humble and self-giving."
    },
    {
      "pk": 21001239,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 39,
      "text": "and the best seats in the synagogues and places of honor at feasts,",
      "links": "<a href='/AIV/42/14/7-10'>Luke 14:7-10</a>",
      "comment": "Craving recognition and status undermines the servant-leadership Jesus models."
    },
    {
      "pk": 21001240,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 40,
      "text": "who devour widows’ houses and for a pretense make long prayers. They will receive greater condemnation.\"",
      "links": "<a href='/AIV/23/10/2'>Isaiah 10:2</a>",
      "comment": "Spiritual abuse is severely condemned. Prayer and goodness must be sincere, joined to mercy."
    },
    {
      "pk": 21001241,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 41,
      "text": "And he sat down opposite the treasury and watched the people putting money into the offering box. Many rich people put in large amounts.",
      "links": "<a href='/AIV/40/6/2'>Matthew 6:2</a>",
      "comment": "Jesus observes both outward acts and inward motives at the heart of worship and piety."
    },
    {
      "pk": 21001242,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 42,
      "text": "And a poor widow came and put in two small copper coins, which make a penny.",
      "links": "<a href='/AIV/42/21/2'>Luke 21:2</a>",
      "comment": "The widow’s offering is small in value, yet enormous in sacrifice. Her faith is exemplary."
    },
    {
      "pk": 21001243,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 43,
      "text": "And he called his disciples to him and said to them, \"Truly, I say to you, this poor widow has put in more than all those who are contributing to the offering box.",
      "links": "<a href='/AIV/40/19/21'>Matthew 19:21</a>",
      "comment": "Jesus measures giving not by amount but by sacrifice and trust—an implicit call to radical generosity and abandonment to God."
    },
    {
      "pk": 21001244,
      "translation": "AIV",
      "book": 2,
      "chapter": 12,
      "verse": 44,
      "text": "For they all contributed out of their abundance, but she out of her poverty put in all she had, her whole living.\"",
      "links": "<a href='/AIV/19/34/18'>Psalm 34:18</a>",
      "comment": "Her complete self-gift anticipates the total self-offering of Christ. The Church holds up such sacrifice as a model of true faith—giving all, trusting all to God’s providence."
    }
  ],
  "translatedAt": "2025-12-23T02:34:03.093Z"
}