{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 13,
  "verses": [
    {
      "pk": 43013001,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 1,
      "text": "As Jesus was going out of the temple, one of his disciples said to him, “Teacher, look! What massive stones and what wonderful buildings!”",
      "links": "<a href='/AIV/11/7/10'>1 Kgs. 7:10</a>; <a href='/AIV/42/21/5'>Luke 21:5</a>",
      "comment": "This passage sets the scene for Jesus’ discourse about the temple’s destruction—a major prophetic teaching, foreshadowed in the Old Testament (1 Kgs. 7:10)."
    },
    {
      "pk": 43013002,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 2,
      "text": "Jesus said to him, “Do you see these great buildings? Not one stone will be left upon another; every one will be thrown down.”",
      "links": "<a href='/AIV/33/3/12'>Mic. 3:12</a>; <a href='/AIV/42/19/44'>Luke 19:44</a>; <a href='/AIV/40/24/2'>Matt. 24:2</a>",
      "comment": "Jesus prophesies the temple’s destruction, fulfilled in 70 AD. His authority to predict future events displays his divine knowledge. (cf. Mic. 3:12 for OT prophecy of Jerusalem’s destruction)."
    },
    {
      "pk": 43013003,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 3,
      "text": "While he was sitting on the Mount of Olives facing the temple, Peter, James, John, and Andrew asked him privately,",
      "links": "<a href='/AIV/40/24/3'>Matt. 24:3</a>",
      "comment": "The private setting underscores the importance and intimacy of Jesus’ teaching to his closest disciples, a sign of spiritual leadership and apostolic authority."
    },
    {
      "pk": 43013004,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 4,
      "text": "“Tell us, when will these things happen, and what will be the sign that all these are about to be fulfilled?”",
      "links": "<a href='/AIV/27/12/6'>Dan. 12:6</a>; <a href='/AIV/42/21/7'>Luke 21:7</a>",
      "comment": "Their question about signs connects to Daniel’s apocalyptic prophecy and the desire to understand God’s plan in the world (Daniel 12:6)."
    },
    {
      "pk": 43013005,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 5,
      "text": "Jesus began to say to them, “Watch out that no one leads you astray.",
      "links": "<a href='/AIV/62/4/1'>1 John 4:1</a>",
      "comment": "Jesus warns of false teachers—a continual theme. The need for vigilance underscores the importance of sound teaching and tradition (cf. 1 John 4:1)."
    },
    {
      "pk": 43013006,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 6,
      "text": "Many will come in my name, saying, ‘I am he,’ and will lead many astray.",
      "links": "<a href='/AIV/40/24/5'>Matt. 24:5</a>",
      "comment": "Claims of messiahship will come; Jesus’ warning highlights his true identity as the promised one. His foreknowledge reveals divine authority."
    },
    {
      "pk": 43013007,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 7,
      "text": "When you hear of wars and rumors of wars, do not be troubled. Such things must happen, but the end is not yet.",
      "links": "<a href='/AIV/40/24/6'>Matt. 24:6</a>; <a href='/AIV/66/6/4'>Rev. 6:4</a>",
      "comment": "Global turmoil precedes the end, but these are not the ultimate sign. Believers are called to trust God’s providence during instability."
    },
    {
      "pk": 43013008,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 8,
      "text": "Nation will rise against nation, and kingdom against kingdom. There will be earthquakes in various places, and famines. These are but the beginning of birth pains.",
      "links": "<a href='/AIV/23/19/2'>Isa. 19:2</a>; <a href='/AIV/28/13/13'>Hosea 13:13</a>",
      "comment": "‘Birth pains’ is OT imagery (Hosea 13:13), suggesting that suffering precedes God’s new actions. Christ points to both literal and spiritual struggles for the Church."
    },
    {
      "pk": 43013009,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 9,
      "text": "But watch yourselves. They will deliver you up to councils, and you will be beaten in synagogues. You will stand before governors and kings for my sake, to bear witness before them.",
      "links": "<a href='/AIV/44/5/40'>Acts 5:40</a>; <a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Proclaiming Christ includes suffering. The promise of bearing witness before rulers recalls later examples in Acts."
    },
    {
      "pk": 43013010,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 10,
      "text": "And the gospel must first be proclaimed to all nations.",
      "links": "<a href='/AIV/40/24/14'>Matt. 24:14</a>; <a href='/AIV/19/22/27'>Psalm 22:27</a>",
      "comment": "Universal mission—the foundation for worldwide unity of the faith. (cf. Ps. 22:27; foreshadows the apostolic mandate.)"
    },
    {
      "pk": 43013011,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 11,
      "text": "When they bring you to trial and deliver you up, do not worry beforehand about what you are to say. But say whatever is given you in that hour, for it is not you who speak, but the Holy Spirit.",
      "links": "<a href='/AIV/42/12/11'>Luke 12:11–12</a>; <a href='/AIV/44/4/8'>Acts 4:8</a>",
      "comment": "Direct promise of the Spirit’s inspiration, ensuring the Church’s witness remains true even under persecution. See also Acts 4:8."
    },
    {
      "pk": 43013012,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 12,
      "text": "Brother will deliver brother to death, and a father his child. Children will rise up against parents and cause them to be put to death.",
      "links": "<a href='/AIV/33/7/6'>Mic. 7:6</a>; <a href='/AIV/40/10/21'>Matt. 10:21</a>",
      "comment": "Divisions in families fulfill prophecy (Mic. 7:6), signifying the radical demands of loyalty to Christ."
    },
    {
      "pk": 43013013,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 13,
      "text": "You will be hated by all because of my name, but the one who endures to the end will be saved.",
      "links": "<a href='/AIV/40/10/22'>Matt. 10:22</a>; <a href='/AIV/66/2/10'>Rev. 2:10</a>",
      "comment": "Perseverance is required of every believer—a theme regularly affirmed in New Testament calls to endurance (see Rev. 2:10)."
    },
    {
      "pk": 43013014,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 14,
      "text": "But when you see the abomination of desolation standing where it should not be (let the reader understand), then let those in Judea flee to the mountains.",
      "links": "<a href='/AIV/27/9/27'>Dan. 9:27</a>; <a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "Reference to Daniel’s prophecy of abomination (Dan. 9:27). Fulfillment in the desecration of the temple, but also a type of spiritual defilement to avoid."
    },
    {
      "pk": 43013015,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 15,
      "text": "Let the one who is on the housetop not go down, nor enter to take anything out of his house.",
      "links": "<a href='/AIV/40/24/17'>Matt. 24:17</a>",
      "comment": "This call for radical detachment and urgency is echoed in other Gospels. The disciple must seek first spiritual safety."
    },
    {
      "pk": 43013016,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 16,
      "text": "Let the one who is in the field not turn back to get his cloak.",
      "links": "<a href='/AIV/40/24/18'>Matt. 24:18</a>",
      "comment": "Immediate action is required when God’s warning comes, signifying the need to forsake all for the kingdom."
    },
    {
      "pk": 43013017,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 17,
      "text": "Woe to those who are pregnant and to those nursing infants in those days!",
      "links": "<a href='/AIV/40/24/19'>Matt. 24:19</a>",
      "comment": "Suffering during tribulation especially affects the vulnerable—a reminder of compassion and the cost of discipleship."
    },
    {
      "pk": 43013018,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 18,
      "text": "Pray that it may not happen in winter.",
      "links": "<a href='/AIV/40/24/20'>Matt. 24:20</a>",
      "comment": "Jesus calls for prayer, relying on divine providence even amid tribulation, a model for steadfast trust."
    },
    {
      "pk": 43013019,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 19,
      "text": "For those days will be a time of tribulation such as has not been from the beginning of the creation, which God created, until now, and never will be.",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/29/2/2'>Joel 2:2</a>",
      "comment": "Greater tribulation is foretold, as in Daniel and Joel. Christ’s words echo OT apocalyptic imagery and affirm God as Creator."
    },
    {
      "pk": 43013020,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 20,
      "text": "If the Lord had not cut short those days, no one would survive. But for the sake of the chosen, whom he chose, he has shortened the days.",
      "links": "<a href='/AIV/23/65/9'>Isa. 65:9</a>",
      "comment": "God’s mercy preserves the elect. The theme of divine election calls believers to assurance of God’s sovereign love."
    },
    {
      "pk": 43013021,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 21,
      "text": "And if anyone says to you, ‘Look, here is the Christ!’ or, ‘Look, there!’ do not believe it.",
      "links": "<a href='/AIV/40/24/23'>Matt. 24:23</a>",
      "comment": "Warning against false messiahs; discernment is necessary within the Church to remain faithful to the true Christ."
    },
    {
      "pk": 43013022,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 22,
      "text": "For false christs and false prophets will arise and perform signs and wonders, to lead astray, if possible, even the chosen.",
      "links": "<a href='/AIV/05/13/1'>Deut. 13:1-3</a>",
      "comment": "False spiritual leaders can perform miracles. Only by God's true authority do the faithful remain secure."
    },
    {
      "pk": 43013023,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 23,
      "text": "But be on guard; I have told you all things ahead of time.",
      "links": "<a href='/AIV/40/24/25'>Matt. 24:25</a>",
      "comment": "Jesus acts as the ultimate prophet, revealing God’s plan to his people in advance."
    },
    {
      "pk": 43013024,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 24,
      "text": "But in those days, after that tribulation, the sun will be darkened, and the moon will not give its light,",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/29/2/31'>Joel 2:31</a>",
      "comment": "Apocalyptic signs from the prophets; day of the Lord imagery (Isa. 13:10; Joel 2:31) points to God’s intervention in history."
    },
    {
      "pk": 43013025,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 25,
      "text": "and the stars will be falling from heaven, and the powers in the heavens will be shaken.",
      "links": "<a href='/AIV/23/34/4'>Isa. 34:4</a>; <a href='/AIV/66/6/13'>Rev. 6:13</a>",
      "comment": "Cosmic upheaval is symbolic of final judgment and the breaking in of God’s kingdom."
    },
    {
      "pk": 43013026,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 26,
      "text": "Then they will see the Son of Man coming in clouds with great power and glory.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13-14</a>; <a href='/AIV/66/1/7'>Rev. 1:7</a>",
      "comment": "Jesus identifies himself with Daniel’s ‘Son of Man’—a divine title. His coming in glory is a claim to God’s authority and judgment (Dan. 7:13–14)."
    },
    {
      "pk": 43013027,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 27,
      "text": "And he will send out the angels and gather his chosen from the four winds, from the ends of the earth to the ends of the sky.",
      "links": "<a href='/AIV/05/30/4'>Deut. 30:4</a>; <a href='/AIV/19/50/5'>Psalm 50:5</a>",
      "comment": "The final gathering of the faithful fulfills prophecies of God’s people united from all nations (Deut. 30:4). The image supports a visible, universal Church."
    },
    {
      "pk": 43013028,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 28,
      "text": "Now learn the parable from the fig tree: As soon as its branch becomes tender and puts out its leaves, you know that summer is near.",
      "links": "<a href='/AIV/42/21/29'>Luke 21:29</a>",
      "comment": "Jesus uses this simple image to teach readiness and discernment—recognizing spiritual seasons."
    },
    {
      "pk": 43013029,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 29,
      "text": "So also, when you see these things happening, recognize that he is near, at the very doors.",
      "links": "<a href='/AIV/66/3/20'>Rev. 3:20</a>",
      "comment": "Christ’s nearness is both a comfort and call to repentance. This hints at the abiding presence of Christ with the Church."
    },
    {
      "pk": 43013030,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 30,
      "text": "Truly, I say to you, this generation will not pass away until all these things have taken place.",
      "links": "<a href='/AIV/40/23/36'>Matt. 23:36</a>",
      "comment": "Interpreted as either a reference to those alive at the temple’s destruction or to the ‘generation’ of the faithful in salvation history."
    },
    {
      "pk": 43013031,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 31,
      "text": "Heaven and earth will pass away, but my words will never pass away.",
      "links": "<a href='/AIV/23/40/8'>Isa. 40:8</a>; <a href='/AIV/19/119/89'>Psalm 119:89</a>",
      "comment": "Christ equates his words with God’s enduring Word—a high claim of divinity, echoing Isa. 40:8."
    },
    {
      "pk": 43013032,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 32,
      "text": "But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father.",
      "links": "<a href='/AIV/44/1/7'>Acts 1:7</a>",
      "comment": "Shows Christ’s humility in his earthly mission and the mystery of God’s final plan; supports the Church’s tradition of humility before divine mysteries."
    },
    {
      "pk": 43013033,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 33,
      "text": "Be on guard, keep awake, for you do not know when the time will come.",
      "links": "<a href='/AIV/42/21/34'>Luke 21:34-36</a>",
      "comment": "Repeated call for spiritual vigilance, readiness in every generation—spiritual watchfulness as a hallmark of true disciples."
    },
    {
      "pk": 43013034,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 34,
      "text": "It is like a man going on a journey who leaves his house, gives authority to his servants, each his assigned work, and commands the doorkeeper to keep watch.",
      "links": "<a href='/AIV/40/25/14'>Matt. 25:14</a>",
      "comment": "The ‘house’ is often interpreted as the community of believers. The master (Christ) entrusts stewardship to his servants, a picture of ministerial roles and apostolic authority within the Church."
    },
    {
      "pk": 43013035,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 35,
      "text": "Therefore stay awake—for you do not know when the master of the house will come, whether in the evening, or at midnight, or when the rooster crows, or in the morning—",
      "links": "<a href='/AIV/66/16/15'>Rev. 16:15</a>",
      "comment": "Vigilance is necessary at all hours; a parallel with readiness for Christ’s return."
    },
    {
      "pk": 43013036,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 36,
      "text": "lest he come suddenly and find you asleep.",
      "links": "<a href='/AIV/40/25/13'>Matt. 25:13</a>",
      "comment": "Warning against spiritual negligence—Christ’s return will be unexpected for many."
    },
    {
      "pk": 43013037,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 37,
      "text": "And what I say to you, I say to all: Stay awake!”",
      "links": "<a href='/AIV/42/12/40'>Luke 12:40</a>",
      "comment": "Final universal call to readiness. The consistent emphasis on vigilance and faithfulness reflects both the literal readiness for Christ’s coming and ongoing spiritual watchfulness in the Church."
    }
  ],
  "translatedAt": "2025-12-23T02:34:49.582Z"
}