{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 11,
  "verses": [
    {
      "pk": 110011,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 1,
      "text": "When they came near to Jerusalem, at Bethphage and Bethany, at the Mount of Olives, Jesus sent two of his disciples,",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>",
      "comment": "The setting is prophetic; Mark highlights Jesus’ fulfillment of prophecy from Zechariah 9:9 about the King coming to Jerusalem."
    },
    {
      "pk": 110012,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 2,
      "text": "and said to them, 'Go into the village ahead of you. Immediately as you enter it, you will find a colt tied, which no one has ever ridden. Untie it and bring it here.'",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>",
      "comment": "The colt symbolizes humility and messianic kingship. See Genesis 49:11 and Zechariah again—the Messiah enters humbly, yet as King."
    },
    {
      "pk": 110013,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 3,
      "text": "If anyone asks you, ‘Why are you doing this?’ say, ‘The Lord needs it and will send it back here soon.’",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "'The Lord'—Jesus refers to himself with divine authority. Early communities saw this ('the Lord') as a title for God."
    },
    {
      "pk": 110014,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 4,
      "text": "They went and found a colt tied at a door, outside on the street, and they untied it.",
      "links": "",
      "comment": "The disciples’ obedience is immediate, demonstrating faith in Jesus’ instruction—even when not understanding fully."
    },
    {
      "pk": 110015,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 5,
      "text": "Some of those standing there said to them, 'What are you doing, untying the colt?'",
      "links": "",
      "comment": "The reaction of bystanders shows the proprietorial relationships common to village life in first-century Judea."
    },
    {
      "pk": 110016,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 6,
      "text": "And they told them what Jesus had said, and they let them go.",
      "links": "",
      "comment": "Jesus’ authority is sufficient; his word moves others—even strangers to his immediate circle."
    },
    {
      "pk": 110017,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 7,
      "text": "Then they brought the colt to Jesus and threw their cloaks on it, and he sat on it.",
      "links": "<a href='/AIV/12/9/13'>2 Kgs. 9:13</a>",
      "comment": "Laying cloaks signified honor and submission, often for royalty; Jesus accepts kingly homage as the Messiah."
    },
    {
      "pk": 110018,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 8,
      "text": "Many spread their cloaks on the road, and others spread branches they had cut from the fields.",
      "links": "<a href='/AIV/19/118/25-26'>Ps. 118:25-26</a>",
      "comment": "This act echoes Psalm 118’s messianic hope and royal procession. Palms or branches celebrated national victory, inviting greater deliverance."
    },
    {
      "pk": 110019,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 9,
      "text": "And those who went before and those who followed were shouting, 'Hosanna! Blessed is he who comes in the name of the Lord!'",
      "links": "<a href='/AIV/19/118/25-26'>Ps. 118:25-26</a>",
      "comment": "'Hosanna' means 'Save us now!'—a plea addressed to the Messiah, later used liturgically in Christian worship."
    },
    {
      "pk": 1100110,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 10,
      "text": "Blessed is the coming kingdom of our father David! Hosanna in the highest!",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "Reference to David’s kingdom underlines Jesus as the fulfillment of God’s covenant promise to David. See 2 Samuel 7."
    },
    {
      "pk": 1100111,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 11,
      "text": "Jesus entered Jerusalem and went into the temple. After looking around at everything, since it was already late, he went out to Bethany with the Twelve.",
      "links": "<a href='/AIV/19/69/9'>Ps. 69:9</a>",
      "comment": "Jesus’ inspection of the temple recalls psalms of zeal for God’s house and anticipates his later actions."
    },
    {
      "pk": 1100112,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 12,
      "text": "The next day, as they were leaving Bethany, he was hungry.",
      "links": "",
      "comment": "Jesus experiences genuine human hunger, affirming the fullness of his incarnation."
    },
    {
      "pk": 1100113,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 13,
      "text": "Seeing in the distance a fig tree in leaf, he went to see if he might find anything on it. But when he came to it, he found nothing but leaves, for it was not the season for figs.",
      "links": "<a href='/AIV/24/8/13'>Jer. 8:13</a>",
      "comment": "The fig tree often symbolized Israel; this event foreshadows judgment for unfruitfulness."
    },
    {
      "pk": 1100114,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 14,
      "text": "He said to it, 'May no one ever eat fruit from you again.' And his disciples heard it.",
      "links": "<a href='/AIV/24/8/13'>Jer. 8:13</a>",
      "comment": "A prophetic sign, not petulance. Jesus is pronouncing judgment on unfaithfulness, indicating his authority over Israel as God’s anointed."
    },
    {
      "pk": 1100115,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 15,
      "text": "They came to Jerusalem. He entered the temple and began to drive out those selling and those buying in the temple; he overturned the tables of the money changers and the seats of those selling pigeons.",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>; <a href='/AIV/24/7/11'>Jer. 7:11</a>",
      "comment": "Jesus cleanses the temple not just for reform, but as a sign he has authority over its worship—hinting at a new center of worship (see John 2:19)."
    },
    {
      "pk": 1100116,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 16,
      "text": "He would not allow anyone to carry merchandise through the temple courts.",
      "links": "",
      "comment": "Jesus acts as the guardian of sacred space. His zeal for proper worship is a call to honour God’s holiness in worship."
    },
    {
      "pk": 1100117,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 17,
      "text": "He taught, saying to them, 'Is it not written: “My house shall be called a house of prayer for all nations”? But you have made it a den of robbers.'",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>; <a href='/AIV/24/7/11'>Jer. 7:11</a>",
      "comment": "Jesus quotes Scripture—Isaiah and Jeremiah—declaring himself the rightful interpreter and enforcer of God’s law. The universality (‘all nations’) hints at God’s plan of inclusion in one, united Church."
    },
    {
      "pk": 1100118,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 18,
      "text": "The chief priests and the scribes heard this and began seeking a way to destroy him, for they were afraid of him, because all the people were astonished at his teaching.",
      "links": "<a href='/AIV/19/2/1-2'>Ps. 2:1-2</a>",
      "comment": "Their opposition fulfills Psalm 2’s prophecy about God’s anointed facing the rulers’ rage."
    },
    {
      "pk": 1100119,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 19,
      "text": "And when evening came, they went out of the city.",
      "links": "",
      "comment": "Jesus often withdraws from the city at night for prayer, teaching the importance of regular devotion and withdrawal for prayer."
    },
    {
      "pk": 1100120,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 20,
      "text": "As they passed by in the morning, they saw the fig tree withered from the roots up.",
      "links": "<a href='/AIV/24/8/13'>Jer. 8:13</a>",
      "comment": "This emphasizes the effectiveness of Jesus’ word; judgment is complete and irreversible."
    },
    {
      "pk": 1100121,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 21,
      "text": "Peter remembered and said to him, 'Rabbi, look! The fig tree you cursed has withered.'",
      "links": "",
      "comment": "Peter addresses Jesus as 'Rabbi,' but his amazement shows the disciples are still learning the fullness of Jesus’ authority."
    },
    {
      "pk": 1100122,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 22,
      "text": "Jesus answered them, 'Have faith in God.'",
      "links": "",
      "comment": "Trust, not merely in power, but in God—Jesus directs disciples to radical faith, which enables participation in miracles."
    },
    {
      "pk": 1100123,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 23,
      "text": "Truly I say to you, whoever says to this mountain, ‘Be taken up and thrown into the sea,’ and does not doubt in his heart but believes that what he says will happen, it will be done for him.",
      "links": "<a href='/AIV/19/46/2'>Ps. 46:2</a>; <a href='/AIV/40/17/20'>Matt. 17:20</a>",
      "comment": "'Mountain' is likely metaphorical for great obstacles, including spiritual ones. The participatory power of faith operates through communion with Christ and God’s will."
    },
    {
      "pk": 1100124,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 24,
      "text": "Therefore I tell you, whatever you ask in prayer, believe that you have received it, and it will be yours.",
      "links": "<a href='/AIV/43/14/13-14'>John 14:13-14</a>",
      "comment": "Faith-filled prayer is effective—so long as it aligns with God’s purposes. This verse points toward a life culminating in sacramental faith and intercessory prayer."
    },
    {
      "pk": 1100125,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 25,
      "text": "And whenever you stand praying, forgive, if you have anything against anyone, so that your Father in heaven may also forgive your trespasses.",
      "links": "<a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>",
      "comment": "Jesus emphasizes the necessary connection between our forgiveness of others and receiving forgiveness. See the Lord’s Prayer—he teaches a communal, ongoing forgiveness in the life of disciples."
    },
    {
      "pk": 1100126,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 26,
      "text": "[But if you do not forgive, neither will your Father in heaven forgive your trespasses.]",
      "links": "<a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>",
      "comment": "Some manuscripts omit this verse (see footnote). Nonetheless, its inclusion stresses the gravity of forgiveness in Christian life and prayer."
    },
    {
      "pk": 1100127,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 27,
      "text": "They came again to Jerusalem. As he was walking in the temple, the chief priests, the scribes, and the elders came to him,",
      "links": "",
      "comment": "Jesus faces the official religious authorities—chief priests, scribes, and elders—representing the full religious leadership."
    },
    {
      "pk": 1100128,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 28,
      "text": "and they said to him, 'By what authority are you doing these things, or who gave you this authority to do them?'",
      "links": "<a href='/AIV/24/23/21-22'>Jer. 23:21-22</a>",
      "comment": "The challenge to Jesus’ authority connects to the Old Testament disputes over true and false prophets, see Jeremiah."
    },
    {
      "pk": 1100129,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 29,
      "text": "Jesus said to them, 'I will ask you one question. Answer me, and I will tell you by what authority I do these things.'",
      "links": "",
      "comment": "Jesus claims the right to interrogate the leaders—he holds the upper hand in the debate."
    },
    {
      "pk": 1100130,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 30,
      "text": "Was the baptism of John from heaven or from men? Answer me.'",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>",
      "comment": "John’s ministry was a forerunner to Jesus, prophesied as preparing the way; acknowledging John’s divine mandate points to Jesus’ own."
    },
    {
      "pk": 1100131,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 31,
      "text": "They discussed it among themselves, saying, 'If we say, “From heaven,” he will say, “Why then did you not believe him?”'",
      "links": "",
      "comment": "The religious leaders know their answer is a trap either way—demonstrating their evasiveness rather than sincerity of faith."
    },
    {
      "pk": 1100132,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 32,
      "text": "But if we say, “From men”—they feared the crowd, for all held that John was truly a prophet.",
      "links": "<a href='/AIV/40/21/26'>Matt. 21:26</a>",
      "comment": "Their concern for popularity, not truth, displays their lack of spiritual insight and authentic authority."
    },
    {
      "pk": 1100133,
      "translation": "AIV",
      "book": 2,
      "chapter": 11,
      "verse": 33,
      "text": "So they answered Jesus, 'We do not know.' And Jesus said to them, 'Neither will I tell you by what authority I do these things.'",
      "links": "<a href='/AIV/41/8/12'>Mark 8:12</a>; <a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>",
      "comment": "By refusing to answer, Jesus refuses to acknowledge their flawed and insincere spiritual leadership. True authority, for Jesus, is self-evident by divine signs and the fulfillment of prophecy—prefiguring a new, apostolic leadership and authority structure for God’s people."
    }
  ],
  "translatedAt": "2025-12-23T02:33:09.309Z"
}