{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 5,
  "verses": [
    {
      "pk": 5010431,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 1,
      "text": "They came to the other side of the sea, to the region of the Gerasenes.",
      "links": "<a href='/AIV/40/8/28'>Matt. 8:28</a>; <a href='/AIV/42/8/26'>Luke 8:26</a>",
      "comment": "The region's name varies in manuscripts: Gerasenes/Gadarenes/Gergesenes. The location is across the Sea of Galilee, relevant for understanding the Gentile context of the miracle."
    },
    {
      "pk": 5010432,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 2,
      "text": "When Jesus stepped out of the boat, immediately a man with an unclean spirit came out from the tombs to meet him.",
      "links": "<a href='/AIV/40/8/28'>Matt. 8:28</a>; <a href='/AIV/42/8/27'>Luke 8:27</a>",
      "comment": "The reference to 'unclean spirit' shows the reality of demonic powers, and Jesus’ authority over them."
    },
    {
      "pk": 5010433,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 3,
      "text": "He lived among the tombs; and no one could bind him anymore, not even with a chain.",
      "links": "",
      "comment": "'Lived among the tombs' suggests ritual uncleanness according to Mosaic Law (see <a href='/AIV/3/21/1'>Lev. 21:1</a>)."
    },
    {
      "pk": 5010434,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 4,
      "text": "For he had often been bound with shackles and chains, but he tore the chains apart and broke the shackles to pieces. No one had the strength to subdue him.",
      "links": "",
      "comment": "This shows the destructive power of evil and the total inability of human efforts to overcome demonic forces apart from divine intervention."
    },
    {
      "pk": 5010435,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 5,
      "text": "Night and day among the tombs and on the mountains, he was always crying out and cutting himself with stones.",
      "links": "",
      "comment": "The man's self-destruction is a sign of the harm caused by sin and evil in human life. Compare Old Testament references about affliction (see <a href='/AIV/19/88/5-6'>Ps. 88:5-6</a>)."
    },
    {
      "pk": 5010436,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 6,
      "text": "When he saw Jesus from a distance, he ran and bowed down before him.",
      "links": "",
      "comment": "The gesture of bowing proclaims Jesus’ authority, even from spiritual enemies. The Greek verb here (προσεκύνησεν) also means 'worshipped'."
    },
    {
      "pk": 5010437,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 7,
      "text": "Crying out with a loud voice, he said, 'What have I to do with you, Jesus, Son of the Most High God? I beg you by God, do not torment me!'",
      "links": "<a href='/AIV/1/14/18'>Gen. 14:18–20</a>; <a href='/AIV/19/82/6'>Ps. 82:6</a>",
      "comment": "'Son of the Most High God' is an explicit recognition of Jesus’ divine identity, even by demonic forces. See also parallel in <a href='/AIV/42/1/32'>Luke 1:32</a> where 'Son of the Most High' connects to messianic prophecy."
    },
    {
      "pk": 5010438,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 8,
      "text": "For Jesus had been saying to him, 'Come out of the man, you unclean spirit!'",
      "links": "",
      "comment": "Jesus' authority over unclean spirits fulfills the messianic expectation of liberating captives (see <a href='/AIV/23/61/1'>Isa. 61:1</a>)."
    },
    {
      "pk": 5010439,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 9,
      "text": "Then Jesus asked him, 'What is your name?' And he answered, 'My name is Legion, for we are many.'",
      "links": "",
      "comment": "'Legion' refers to a large number (Roman legion: 4,000–6,000 soldiers), highlighting the severity of possession and Christ’s power over many demons."
    },
    {
      "pk": 5010440,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 10,
      "text": "And he begged him earnestly not to send them out of the region.",
      "links": "",
      "comment": "Demons had a certain attachment to locations—reflecting ancient beliefs about territorial spirits."
    },
    {
      "pk": 5010441,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 11,
      "text": "Now a large herd of pigs was feeding there on the hillside.",
      "links": "",
      "comment": "Pigs were unclean to Jews (<a href='/AIV/3/11/7'>Lev. 11:7</a>), underscoring the Gentile context."
    },
    {
      "pk": 5010442,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 12,
      "text": "They begged him, saying, 'Send us into the pigs; let us enter them.'",
      "links": "",
      "comment": "The demons' plea acknowledges Jesus’ authority to command their fate."
    },
    {
      "pk": 5010443,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 13,
      "text": "He gave them permission. Then the unclean spirits came out and entered the pigs; and the herd, numbering about two thousand, rushed down the steep bank into the sea and drowned in the water.",
      "links": "<a href='/AIV/2/14/28'>Ex. 14:28</a>",
      "comment": "The destruction of the pigs is a sign of the ultimate aim of evil—to destroy. It also shows Jesus’ authority even over the animal world."
    },
    {
      "pk": 5010444,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 14,
      "text": "The herdsmen fled and told it in the city and in the countryside. And people came to see what had happened.",
      "links": "",
      "comment": "The widespread report shows the miracle’s public character; miracles often have a role in testifying to God's power within the community."
    },
    {
      "pk": 5010445,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 15,
      "text": "They came to Jesus and saw the man who had been possessed by the legion, sitting there, clothed and in his right mind; and they became afraid.",
      "links": "",
      "comment": "Complete transformation is one sign of Jesus’ redemptive work. Notice that the 'clothed' condition implies restoration and dignity, a theme seen in various biblical healings."
    },
    {
      "pk": 5010446,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 16,
      "text": "Those who had seen it described to them what had happened to the demon-possessed man and to the pigs.",
      "links": "",
      "comment": "Eyewitness testimony repeats the reality of the event."
    },
    {
      "pk": 5010447,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 17,
      "text": "Then they began to beg Jesus to leave their region.",
      "links": "",
      "comment": "The people's plea highlights the fear and disruption caused by the supernatural, even when it brings liberation. Often divine intervention challenges our comfort zones."
    },
    {
      "pk": 5010448,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 18,
      "text": "As he was getting into the boat, the man who had been possessed begged that he might be with him.",
      "links": "",
      "comment": "Desire to remain with Jesus points to the new life of discipleship following deliverance."
    },
    {
      "pk": 5010449,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 19,
      "text": "But Jesus did not permit him, but said to him, 'Go home to your own people and tell them all that the Lord has done for you and how he has had mercy on you.'",
      "links": "<a href='/AIV/19/66/16'>Ps. 66:16</a>",
      "comment": "Personal witness is emphasized. Notice the reference to 'the Lord'—Jesus refers to himself in divine terms, linking to Old Testament theophanies."
    },
    {
      "pk": 5010450,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 20,
      "text": "So he went and began to proclaim in the Decapolis how much Jesus had done for him, and everyone marveled.",
      "links": "<a href='/AIV/40/4/25'>Matt. 4:25</a>",
      "comment": "Decapolis refers to a group of ten cities. The witness spreads beyond Israel, illustrating the universality of Christ’s saving work."
    },
    {
      "pk": 5010451,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 21,
      "text": "When Jesus had crossed again in the boat to the other side, a large crowd gathered around him, and he was beside the sea.",
      "links": "",
      "comment": "The return to the western shore sets the stage for more miracles. 'Crowd' emphasizes public ministry."
    },
    {
      "pk": 5010452,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 22,
      "text": "Then one of the rulers of the synagogue, Jairus by name, came. And seeing him, fell at his feet.",
      "links": "",
      "comment": "Synagogue rulers were important community figures, showing that Jesus’ ministry affects both high and low in society."
    },
    {
      "pk": 5010453,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 23,
      "text": "And he pleaded with him greatly, saying, 'My little daughter is at the point of death. Please come and lay your hands on her, so that she may be healed and live.'",
      "links": "<a href='/AIV/12/4/34'>2 Kgs. 4:34</a>",
      "comment": "Faith in laying on of hands links to Old Testament patterns of blessing and healing."
    },
    {
      "pk": 5010454,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 24,
      "text": "So Jesus went with him. And a large crowd followed him and pressed in on him.",
      "links": "",
      "comment": "Crowds pressing shows eagerness for healing—an image of the spiritual hunger found throughout the Gospels."
    },
    {
      "pk": 5010455,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 25,
      "text": "There was a woman who had had a discharge of blood for twelve years,",
      "links": "<a href='/AIV/3/15/25'>Lev. 15:25</a>",
      "comment": "The woman’s condition made her ritually unclean under the Mosaic Law, socially isolated, and unable to worship fully."
    },
    {
      "pk": 5010456,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 26,
      "text": "Who had suffered much under many physicians, and had spent all she had, and was no better but only grew worse.",
      "links": "<a href='/AIV/14/16/12'>2 Chr. 16:12</a>",
      "comment": "Despite human effort, only Christ brings ultimate healing—echoing the need for divine grace beyond human remedies."
    },
    {
      "pk": 5010457,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 27,
      "text": "Having heard about Jesus, she came up behind him in the crowd and touched his cloak.",
      "links": "",
      "comment": "Boldness in seeking healing, even as an unclean person, illustrates faith overcoming legal obstacles."
    },
    {
      "pk": 5010458,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 28,
      "text": "For she said, 'If I just touch his clothes, I will be healed.'",
      "links": "",
      "comment": "Faith, not magic, is the means here. Her trust is in the person of Jesus, not merely in physical contact."
    },
    {
      "pk": 5010459,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 29,
      "text": "Immediately her bleeding stopped, and she felt in her body that she was healed of her disease.",
      "links": "",
      "comment": "Physical healing as an outward sign of deeper spiritual healing."
    },
    {
      "pk": 5010460,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 30,
      "text": "At once, Jesus, knowing in himself that power had gone out from him, turned around in the crowd and said, 'Who touched my clothes?'",
      "links": "",
      "comment": "'Power' (Greek dunamis) underscores the reality of Christ’s healing ministry—he is the source of grace flowing through physical means."
    },
    {
      "pk": 5010461,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 31,
      "text": "His disciples said to him, 'You see the crowd pressing around you, and yet you say, "
    },
    {
      "pk": 5010462,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 32,
      "text": "And he looked around to see who had done it.",
      "links": "",
      "comment": "Jesus seeks personal encounter; faith is not just impersonal but involves relationship."
    },
    {
      "pk": 5010463,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 33,
      "text": "But the woman, knowing what had happened to her, came in fear and trembling, and fell down before him and told him the whole truth.",
      "links": "",
      "comment": "Her fear reflects awe before divine power, also humility and confession—a model for honest encounter with God."
    },
    {
      "pk": 5010464,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 34,
      "text": "He said to her, 'Daughter, your faith has healed you. Go in peace, and be healed of your disease.'",
      "links": "<a href='/AIV/9/42/49-52'>Isa. 42:49-52</a>",
      "comment": "'Go in peace' is a phrase of blessing, signaling restoration to full community life. Jesus calls her 'Daughter,' affirming newfound spiritual kinship."
    },
    {
      "pk": 5010465,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 35,
      "text": "While he was still speaking, messengers came from the house of the synagogue ruler, saying, 'Your daughter is dead. Why trouble the Teacher any longer?'",
      "links": "",
      "comment": "The term 'Teacher' (Greek: didaskalos) suggests reverence but not yet full recognition of Jesus’ divinity."
    },
    {
      "pk": 5010466,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 36,
      "text": "But overhearing what they said, Jesus said to the synagogue ruler, 'Do not be afraid, only believe.'",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>",
      "comment": "Faith is presented as the means of participating in God’s power—echoes of Abraham’s faith being counted as righteousness."
    },
    {
      "pk": 5010467,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 37,
      "text": "He allowed no one to follow him except Peter, James, and John the brother of James.",
      "links": "<a href='/AIV/40/17/1'>Matt. 17:1</a>",
      "comment": "The inner circle present for major revelations, prefiguring apostolic succession and leadership structure."
    },
    {
      "pk": 5010468,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 38,
      "text": "They came to the house of the synagogue ruler, and Jesus saw a commotion—people weeping and wailing loudly.",
      "links": "",
      "comment": "Public mourning reflects Jewish custom. Preparation for miracle."
    },
    {
      "pk": 5010469,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 39,
      "text": "He entered and said to them, 'Why are you making a commotion and weeping? The child is not dead but sleeping.'",
      "links": "<a href='/AIV/43/11/11-14'>John 11:11–14</a>",
      "comment": "Jesus refers to death as sleep, aligning with Old Testament language about hope in resurrection."
    },
    {
      "pk": 5010470,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 40,
      "text": "They laughed at him. But he put them all outside, took the child's father and mother, and those who were with him, and went in where the child was.",
      "links": "",
      "comment": "Jesus acts with authority and prepares for the miracle with only a few witnesses, teaching about faith and reverence."
    },
    {
      "pk": 5010471,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 41,
      "text": "Taking her by the hand, he said to her, 'Talitha koum,' which means, 'Little girl, I say to you, arise.'",
      "links": "<a href='/AIV/12/4/35'>2 Kgs. 4:35</a>",
      "comment": "Jesus speaks in Aramaic, original language of early Christians. The action recalls prophetic miracles of old but surpasses them—Jesus acts by his own authority."
    },
    {
      "pk": 5010472,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 42,
      "text": "Immediately the girl got up and began to walk around, for she was twelve years old. And they were completely amazed.",
      "links": "",
      "comment": "The immediate response highlights Jesus' absolute authority over life and death—an implicit claim to divinity. 'Twelve years' draws symbolic connection with the tribes of Israel."
    },
    {
      "pk": 5010473,
      "translation": "AIV",
      "book": 2,
      "chapter": 5,
      "verse": 43,
      "text": "He strictly ordered them that no one should know about this, and told them to give her something to eat.",
      "links": "<a href='/AIV/40/8/4'>Matt. 8:4</a>",
      "comment": "The command for secrecy fits the 'messianic secret' theme in Mark. The concern for food reflects practical love and the restoration of life to full normalcy; feeding after restoration echoes spiritual sustenance given through Christ."
    }
  ],
  "translatedAt": "2025-12-23T02:28:39.645Z"
}