{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 2,
  "verses": [
    {
      "pk": 1020001,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 1,
      "text": "And when He returned to Capernaum after some days, it was reported that He was at home.",
      "links": "<a href='/AIV/40/4/13'>Matt. 4:13</a>; <a href='/AIV/42/4/31'>Luke 4:31'</a>",
      "comment": "Capernaum served as a central location for Jesus' ministry in Galilee, fulfilling the prophecy in Isaiah 9:1-2 regarding the light shining on those living in darkness."
    },
    {
      "pk": 1020002,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 2,
      "text": "So many gathered, that there was no more room, not even at the door. And He was speaking the word to them.",
      "links": "<a href='/AIV/40/7/28'>Matt. 7:28</a>; <a href='/AIV/42/5/1'>Luke 5:1</a>",
      "comment": "The crowd's eagerness shows the authority of Jesus' teaching. 'The word' refers to His proclamation of the kingdom, a theme linking His work to the fulfillment of Old Testament prophecy (see Isa. 55:10–11)."
    },
    {
      "pk": 1020003,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 3,
      "text": "And they came, bringing to Him a paralytic, carried by four men.",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/42/5/18'>Luke 5:18</a>",
      "comment": "The paralytic's friends display faith in action. The tradition of communal prayer and intercessory acts is foreshadowed here, a foundation practice from the earliest Christian communities."
    },
    {
      "pk": 1020004,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 4,
      "text": "Unable to approach Him because of the crowd, they removed the roof where He was. Having made an opening, they lowered the mat on which the paralytic lay.",
      "links": "<a href='/AIV/42/5/19'>Luke 5:19</a>",
      "comment": "The effort to bring the paralytic to Jesus highlights faith persevering through obstacles. This act illustrates both literal trust and a model for spiritual persistence in coming to Christ."
    },
    {
      "pk": 1020005,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 5,
      "text": "And when Jesus saw their faith, He said to the paralytic, 'Son, your sins are forgiven.'",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "Jesus declares forgiveness of sins—a prerogative reserved for God alone (see Ps. 103:3), demonstrating His divine authority. Notice how Jesus responds to the faith of the group, reflecting the significance of communal faith in receiving God’s grace."
    },
    {
      "pk": 1020006,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 6,
      "text": "Now some of the scribes were sitting there, questioning in their hearts,",
      "links": "<a href='/AIV/40/9/3'>Matt. 9:3</a>; <a href='/AIV/42/5/21'>Luke 5:21</a>",
      "comment": "The scribes, experts in the Law, represent the religious leadership. Their doubts set the stage for Jesus to clarify His authority and divine identity."
    },
    {
      "pk": 1020007,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 7,
      "text": "‘Why does this man speak like this? He is blaspheming! Who can forgive sins but God alone?’",
      "links": "<a href='/AIV/19/130/4'>Ps. 130:4</a>",
      "comment": "The scribes rightly recognize that only God can forgive sins (cf. Ex. 34:6-7; Ps. 130:4), making Jesus’ statement a claim to divinity. This is one of the clearest claims in the Gospels of Jesus’ participation in the prerogatives of God."
    },
    {
      "pk": 1020008,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 8,
      "text": "And immediately Jesus, perceiving in His spirit that they were questioning within themselves, said to them, 'Why do you think these things in your hearts?'",
      "links": "<a href='/AIV/43/2/24'>John 2:24-25</a>",
      "comment": "Jesus' ability to know inner thoughts reveals His divine knowledge. Compare with 1 Sam. 16:7—the Lord looks at the heart."
    },
    {
      "pk": 1020009,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 9,
      "text": "'Which is easier, to say to the paralytic, Your sins are forgiven,' or to say, 'Rise, take up your mat, and walk?'",
      "links": "<a href='/AIV/42/5/23'>Luke 5:23</a>",
      "comment": "Jesus asks which is easier to say, drawing attention to the hidden (forgiveness) and the visible (healing). Both require divine authority, but healing serves as visible proof of the invisible grace given."
    },
    {
      "pk": 1020010,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 10,
      "text": "'But so that you may know that the Son of Man has authority on earth to forgive sins...' He said to the paralytic,",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13-14</a>; <a href='/AIV/40/9/6'>Matt. 9:6</a>",
      "comment": "'Son of Man' is a term from Daniel 7:13–14, signifying both the Messiah and one who shares in God's authority. Jesus explicitly identifies Himself with this figure, evidencing His divine mission."
    },
    {
      "pk": 1020011,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 11,
      "text": "'I say to you, rise, pick up your mat, and go home.'",
      "links": "<a href='/AIV/43/5/8'>John 5:8</a>",
      "comment": "The command to 'rise' demonstrates the effective power of Jesus' word, reminiscent of God’s creative word in Genesis 1."
    },
    {
      "pk": 1020012,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 12,
      "text": "And  immediately he rose, picked up his mat, and went out before them all. So they were all amazed and glorified God, saying, 'We have never seen anything like this!'",
      "links": "<a href='/AIV/40/9/8'>Matt. 9:8</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "The crowd’s amazement at the miracle leads them to praise God, showing that the miraculous works serve as a sign pointing back to the glory and authority of God working through Jesus."
    },
    {
      "pk": 1020013,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 13,
      "text": "He went out again beside the sea, and all the crowd came to Him, and He taught them.",
      "links": "<a href='/AIV/40/5/1-2'>Matt. 5:1-2</a>",
      "comment": "Jesus regularly teaches by the sea, symbolizing the openness of His message to all nations, and fulfilling the role of the awaited teacher foretold in the prophets."
    },
    {
      "pk": 1020014,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 14,
      "text": "And as He passed by, He saw Levi the son of Alphaeus sitting at the tax collector’s booth. And He said to him, 'Follow Me.' And he rose and followed Him.",
      "links": "<a href='/AIV/40/9/9'>Matt. 9:9</a>; <a href='/AIV/42/5/27'>Luke 5:27-28</a>",
      "comment": "Levi is commonly identified as Matthew. Jesus’ call to a tax collector shows God’s desire to bring even those considered outsiders into His new covenant people."
    },
    {
      "pk": 1020015,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 15,
      "text": "And as He reclined at table in his house, many tax collectors and sinners were also reclining with Jesus and His disciples, for there were many who followed Him.",
      "links": "<a href='/AIV/40/9/10'>Matt. 9:10</a>",
      "comment": "Jesus’ willingness to share a meal with sinners reveals the depth of His mercy. Sharing a meal in the biblical world implies fellowship and acceptance, pointing to the table fellowship that is a key sign of the kingdom."
    },
    {
      "pk": 1020016,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 16,
      "text": "And the scribes of the Pharisees, when they saw that He was eating with sinners and tax collectors, said to His disciples, 'Why does He eat with tax collectors and sinners?'",
      "links": "<a href='/AIV/42/15/2'>Luke 15:2</a>",
      "comment": "Table fellowship was central to community identity in Judaism. Jesus’ association with sinners foreshadows His establishing a new, inclusive community, united not by ritual separation but by shared faith in Him."
    },
    {
      "pk": 1020017,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 17,
      "text": "And, when Jesus heard it, He said to them, 'Those who are well have no need of a physician, but those who are sick. I have not come to call the righteous, but sinners.'",
      "links": "<a href='/AIV/40/9/13'>Matt. 9:13</a>; <a href='/AIV/26/34/16'>Ezek. 34:16</a>",
      "comment": "Jesus applies the imagery of a physician, echoing the prophetic mission of God to seek the lost (Ezek. 34:16). Salvation is offered not to the self-righteous, but to those who know their need."
    },
    {
      "pk": 1020018,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 18,
      "text": "Now John’s disciples and the Pharisees were fasting. And people came and said to Him, 'Why do John’s disciples and the disciples of the Pharisees fast, but Your disciples do not fast?'",
      "links": "<a href='/AIV/40/9/14'>Matt. 9:14</a>; <a href='/AIV/42/5/33'>Luke 5:33</a>",
      "comment": "Fasting was a common religious practice. The question suggests puzzlement at Jesus’ new approach, signaling a significant shift in religious customs."
    },
    {
      "pk": 1020019,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 19,
      "text": "And Jesus said to them, 'Can the wedding guests fast while the bridegroom is with them? As long as they have the bridegroom with them, they cannot fast.'",
      "links": "<a href='/AIV/40/9/15'>Matt. 9:15</a>; <a href='/AIV/23/54/5'>Isa. 54:5</a>",
      "comment": "Jesus calls Himself the Bridegroom, drawing on Old Testament imagery where God is the Bridegroom to Israel (Isa. 54:5; Hos. 2:19-20). This is a veiled claim to divinity and signals a new era of joy."
    },
    {
      "pk": 1020020,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 20,
      "text": "'But the days will come when the bridegroom is taken away from them, and then they will fast in that day.'",
      "links": "<a href='/AIV/43/16/20'>John 16:20</a>",
      "comment": "Jesus refers to His coming death and departure—the first prophecy of His passion in Mark. Fasting will take on new meaning for His disciples, connected with longing for Christ's return and union with Him."
    },
    {
      "pk": 1020021,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 21,
      "text": "'No one sews a patch of unshrunk cloth on an old garment. If he does, the patch pulls away from it, the new from the old, and a worse tear is made.'",
      "links": "<a href='/AIV/40/9/16'>Matt. 9:16</a>",
      "comment": "Jesus uses a metaphor to illustrate the incompatibility of the new covenant with the old forms. The renewal He brings cannot simply be added to old religious structures."
    },
    {
      "pk": 1020022,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 22,
      "text": "'And no one puts new wine into old wineskins. If he does, the wine will burst the skins, and both the wine and the skins are destroyed. But new wine is for fresh wineskins.'",
      "links": "<a href='/AIV/42/5/37'>Luke 5:37-38</a>",
      "comment": "The new wine represents the new teaching and spiritual life Jesus brings. It must be received in a new way—a sign that the kingdom forms a new, living community, guided by the Spirit and faithful leadership."
    },
    {
      "pk": 1020023,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 23,
      "text": "One Sabbath He was going through the grain fields, and as they made their way, His disciples began to pluck heads of grain.",
      "links": "<a href='/AIV/40/12/1'>Matt. 12:1</a>; <a href='/AIV/5/23/25'>Deut. 23:25</a>",
      "comment": "The disciples’ actions are permitted in Deuteronomic law (Deut. 23:25), but seen by the Pharisees as a violation of Sabbath rules, introducing a discussion about true Sabbath observance."
    },
    {
      "pk": 1020024,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 24,
      "text": "And the Pharisees said to Him, 'Look, why are they doing what is not lawful on the Sabbath?'",
      "links": "<a href='/AIV/2/20/10'>Exod. 20:10</a>",
      "comment": "The Pharisees appeal to their traditions regarding the Sabbath. This confrontation reveals the tension between human tradition and the authority of Jesus."
    },
    {
      "pk": 1020025,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 25,
      "text": "And He said to them, 'Have you never read what David did, when he was in need and was hungry, he and those who were with him?'",
      "links": "<a href='/AIV/9/21/1-6'>1 Sam. 21:1-6</a>",
      "comment": "Jesus refers to the story of David (1 Sam. 21:1-6), illustrating that mercy can take precedence over ritual. David, God's anointed king, acts with authority in an exceptional circumstance—prefiguring Jesus’ royal mission."
    },
    {
      "pk": 1020026,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 26,
      "text": "'How he entered the house of God, in the time of Abiathar the high priest, and ate the bread of the Presence, which is not lawful for any but the priests to eat, and also gave it to those who were with him?'",
      "links": "<a href='/AIV/3/24/5-9'>Lev. 24:5-9</a>; <a href='/AIV/9/21/1-6'>1 Sam. 21:1-6</a>",
      "comment": "Only priests were permitted to eat this bread (Lev. 24:5-9), yet David was not condemned. This underlines the primacy of God's compassion and the principle that worship is subordinate to human need and mercy."
    },
    {
      "pk": 1020027,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 27,
      "text": "And He said to them, 'The Sabbath was made for man, not man for the Sabbath.'",
      "links": "<a href='/AIV/5/5/12-14'>Deut. 5:12-14</a>",
      "comment": "The Sabbath is a divine gift for human well-being, not a burden. Jesus’ interpretation restores the intended purpose behind the commandment."
    },
    {
      "pk": 1020028,
      "translation": "AIV",
      "book": 2,
      "chapter": 2,
      "verse": 28,
      "text": "Therefore the Son of Man is Lord even of the Sabbath.",
      "links": "<a href='/AIV/40/12/8'>Matt. 12:8</a>; <a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>",
      "comment": "Jesus claims sovereign authority over the Sabbath, which only God possesses (see Gen. 2:3; Dan. 7:13–14). This affirms His divine status and points to the establishment of a new, authoritative community under His lordship."
    }
  ],
  "translatedAt": "2025-12-23T02:23:53.128Z"
}