{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 6,
  "verses": [
    {
      "pk": 3006001,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 1,
      "text": "He went out from there and came to his hometown, and his disciples followed him.",
      "links": "<a href='/AIV/40/13/53-58'>Matt. 13:53-58</a>; <a href='/AIV/42/4/16-30'>Luke 4:16-30</a>",
      "comment": "Jesus returns to Nazareth, signaling the importance of his ongoing relationship with his earthly family and roots. This event highlights the humanity of Jesus, who does not disconnect himself from his origins."
    },
    {
      "pk": 3006002,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 2,
      "text": "When the Sabbath came, he began to teach in the synagogue. Many who heard him were astonished, saying, 'Where did this man get these things?' and 'What is this wisdom given to him? How are such mighty works done by his hands?'",
      "links": "<a href='/AIV/40/7/28-29'>Matt. 7:28-29</a>; <a href='/AIV/42/4/22'>Luke 4:22</a>",
      "comment": "Jesus’ teaching and miracles are sources of amazement. The wisdom and power he displays indicate his divine origin (see Isaiah 11:2), though his townspeople have trouble accepting it."
    },
    {
      "pk": 3006003,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 3,
      "text": "Isn't this the carpenter, the son of Mary and brother of James, Joses, Judas, and Simon? Aren't his sisters here with us?' And they took offense at him.",
      "links": "<a href='/AIV/40/13/55-57'>Matt. 13:55-57</a>; <a href='/AIV/42/4/22'>Luke 4:22</a>",
      "comment": "Referring to Jesus as 'the son of Mary' rather than Joseph may indicate recognition of his unique birth, and the mention of 'brothers and sisters' uses terms that, in the Jewish context, often included extended family or close kin (see Gen. 13:8; Gen. 29:15)."
    },
    {
      "pk": 3006004,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 4,
      "text": "But Jesus said to them, 'A prophet is not without honor except in his hometown, among his relatives, and in his own household.'",
      "links": "<a href='/AIV/40/13/57'>Matt. 13:57</a>; <a href='/AIV/43/4/44'>John 4:44</a>",
      "comment": "A recurring biblical theme: prophets are often rejected by those closest to them (Jer. 11:21, Luke 4:24). Jesus'"
    },
    {
      "pk": 3006005,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 5,
      "text": "He could do no mighty work there, except that he laid his hands on a few sick people and healed them.",
      "links": "<a href='/AIV/40/13/58'>Matt. 13:58</a>",
      "comment": "The rejection by his own people limited the wonders Jesus performed, which implies that openness to faith is connected to the reception of grace (see Mark 5:34, Heb. 11:6)."
    },
    {
      "pk": 3006006,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 6,
      "text": "And he marveled because of their unbelief. Then he went around to the surrounding villages teaching.",
      "links": "<a href='/AIV/42/9/6'>Luke 9:6</a>",
      "comment": "Jesus' amazement reflects his humanity and divine sorrow at their lack of faith. He responds by continuing his teaching mission, a recurring sign of perseverance in ministry despite rejection."
    },
    {
      "pk": 3006007,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 7,
      "text": "He called the twelve and began to send them out two by two, and gave them authority over unclean spirits.",
      "links": "<a href='/AIV/40/10/1'>Matt. 10:1</a>; <a href='/AIV/42/9/1-2'>Luke 9:1-2</a>",
      "comment": "Sending the apostles in pairs points to the importance of unity and collaboration in ministry. Their commission and authority comes directly from Christ, a model for apostolic authority and succession."
    },
    {
      "pk": 3006008,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 8,
      "text": "He charged them to take nothing for their journey except a staff—no bread, no bag, no money in their belts—",
      "links": "<a href='/AIV/40/10/9-10'>Matt. 10:9-10</a>; <a href='/AIV/42/9/3'>Luke 9:3</a>",
      "comment": "Jesus directs the apostles to rely on God’s providence, emphasizing trust in God rather than material resources for the mission (see Exodus 12:11–foot travel)."
    },
    {
      "pk": 3006009,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 9,
      "text": "but to wear sandals, and not to put on two tunics.",
      "links": "<a href='/AIV/40/10/10'>Matt. 10:10</a>",
      "comment": "Simplicity and detachment are marks of those sent to proclaim the kingdom. The instructions reinforce setting aside earthly concerns for spiritual labor (cf. Matt. 6:25-34)."
    },
    {
      "pk": 3006010,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 10,
      "text": "And he said to them, 'Whenever you enter a house, stay there until you leave that place.'",
      "links": "<a href='/AIV/40/10/11'>Matt. 10:11</a>; <a href='/AIV/42/9/4'>Luke 9:4</a>",
      "comment": "Apostles are to accept hospitality without seeking better accommodations: a call to humility and constancy, trusting the Spirit’s guidance."
    },
    {
      "pk": 3006011,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 11,
      "text": "And if any place will not receive you and they will not listen to you, when you leave, shake off the dust that is on your feet as a testimony against them.'",
      "links": "<a href='/AIV/40/10/14'>Matt. 10:14</a>; <a href='/AIV/42/9/5'>Luke 9:5</a>",
      "comment": "The act of shaking off dust signifies releasing responsibility for those who reject the message, echoing the separation between the people of God and the world (cf. Neh. 5:13; Acts 13:51)."
    },
    {
      "pk": 3006012,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 12,
      "text": "So they went out and proclaimed that people should repent.",
      "links": "<a href='/AIV/40/3/2'>Matt. 3:2</a>; <a href='/AIV/42/24/47'>Luke 24:47</a>",
      "comment": "Repentance is central to the kingdom message, in continuity with the preaching of John the Baptist and Jesus himself (see Mark 1:4, Mark 1:15)."
    },
    {
      "pk": 3006013,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 13,
      "text": "They cast out many demons, anointed many sick people with oil, and healed them.",
      "links": "<a href='/AIV/59/5/14'>James 5:14</a>; <a href='/AIV/40/10/8'>Matt. 10:8</a>",
      "comment": "Anointing with oil anticipates the use of material signs in sacraments for healing and blessing, pointing to the apostolic practice continued in James 5:14."
    },
    {
      "pk": 3006014,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 14,
      "text": "King Herod heard of it, for Jesus’ name had become well known. People were saying, 'John the Baptist has been raised from the dead; that is why these powerful works are at work in him.'",
      "links": "<a href='/AIV/40/14/1-2'>Matt. 14:1-2</a>; <a href='/AIV/42/9/7-9'>Luke 9:7-9</a>",
      "comment": "Rumors about Jesus show both the spread of his fame and the confusion about his identity—a preview of later declarations about his resurrection."
    },
    {
      "pk": 3006015,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 15,
      "text": "Others said, 'He is Elijah.' Others said, 'He is a prophet, like one of the prophets of old.'",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>; <a href='/AIV/05/18/15'>Deut. 18:15</a>",
      "comment": "Some linked Jesus’ ministry to Elijah or another prophet due to messianic expectations rooted in Old Testament prophecy (Malachi 4:5; Deut. 18:15)."
    },
    {
      "pk": 3006016,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 16,
      "text": "But when Herod heard it, he said, 'John, whom I beheaded, has been raised.'",
      "links": "<a href='/AIV/40/14/2'>Matt. 14:2</a>",
      "comment": "Herod, plagued by guilt, superstitiously believes John the Baptist has returned. His fear shows the power of conscience and the lasting effects of sin."
    },
    {
      "pk": 3006017,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 17,
      "text": "For Herod himself had sent and seized John, and bound him in prison for the sake of Herodias, his brother Philip’s wife, because he had married her.",
      "links": "<a href='/AIV/40/14/3-5'>Matt. 14:3-5</a>",
      "comment": "John’s imprisonment was for boldly proclaiming God's law regarding marriage, showing prophetic courage."
    },
    {
      "pk": 3006018,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 18,
      "text": "For John had been saying to Herod, 'It is not lawful for you to have your brother’s wife.'",
      "links": "<a href='/AIV/03/18/16'>Lev. 18:16</a>; <a href='/AIV/03/20/21'>Lev. 20:21</a>",
      "comment": "John upholds the divine law (Lev. 18:16; 20:21), showing steadfast witness to the truth even to rulers."
    },
    {
      "pk": 3006019,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 19,
      "text": "And Herodias had a grudge against him and wanted to put him to death, but she could not,",
      "links": "<a href='/AIV/40/14/5'>Matt. 14:5</a>",
      "comment": "Herodias' resentment toward John demonstrates the threat truth poses to those attached to sinful power."
    },
    {
      "pk": 3006020,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 20,
      "text": "for Herod feared John, knowing he was a righteous and holy man, and he kept him safe. When he heard him, he was greatly perplexed, yet he heard him gladly.",
      "links": "<a href='/AIV/40/14/5'>Matt. 14:5</a>",
      "comment": "Herod's recognition of John's holiness shows how even secular authority can perceive true sanctity, but fear and indecisiveness hinder true repentance."
    },
    {
      "pk": 3006021,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 21,
      "text": "But an opportunity came when Herod on his birthday gave a banquet for his nobles, military leaders, and the leading men of Galilee.",
      "links": "<a href='/AIV/40/14/6'>Matt. 14:6</a>",
      "comment": "The banquet is a setting where worldliness and indulgence lead to grave sin."
    },
    {
      "pk": 3006022,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 22,
      "text": "When the daughter of Herodias came in and danced, she pleased Herod and those who sat with him. The king said to the girl, 'Ask me for whatever you wish, and I will give it to you.'",
      "links": "<a href='/AIV/40/14/6-7'>Matt. 14:6-7</a>",
      "comment": "Herod's reckless oath, made in a moment of passion and pride, sets up John's unjust fate."
    },
    {
      "pk": 3006023,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 23,
      "text": "And he vowed to her, 'Whatever you ask me, I will give you, up to half of my kingdom.'",
      "links": "<a href='/AIV/07/11/30-31'>Judg. 11:30-31</a>; <a href='/AIV/17/5/3,6'>Esther 5:3,6</a>",
      "comment": "The extravagant promise echoes rash vows in the Old Testament, often leading to disaster when human pride disregards divine law."
    },
    {
      "pk": 3006024,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 24,
      "text": "So she went out and said to her mother, 'What should I ask for?' She replied, 'The head of John the Baptist.'",
      "links": "<a href='/AIV/40/14/8'>Matt. 14:8</a>",
      "comment": "Herodias’ malice manipulates the daughter and king, underscoring how sin spreads through human relationships."
    },
    {
      "pk": 3006025,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 25,
      "text": "Immediately she hurried to the king and asked, saying, 'I want you to give me at once the head of John the Baptist on a platter.'",
      "links": "<a href='/AIV/40/14/8'>Matt. 14:8</a>",
      "comment": "The urgency intensifies the sin and the tragedy of John's death."
    },
    {
      "pk": 3006026,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 26,
      "text": "The king was deeply grieved, but because of his oaths and his guests, he did not want to refuse her.",
      "links": "<a href='/AIV/40/14/9'>Matt. 14:9</a>",
      "comment": "Herod’s fear of public opinion outweighs his conscience, leading to the martyrdom of a righteous man."
    },
    {
      "pk": 3006027,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 27,
      "text": "And immediately the king sent a soldier of the guard and ordered him to bring John’s head. He went and beheaded him in the prison,",
      "links": "<a href='/AIV/40/14/10'>Matt. 14:10</a>",
      "comment": "John's martyrdom foreshadows the sacrifices of those who bear witness to the truth."
    },
    {
      "pk": 3006028,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 28,
      "text": "and brought his head on a platter and gave it to the girl, and the girl gave it to her mother.",
      "links": "<a href='/AIV/40/14/11'>Matt. 14:11</a>",
      "comment": "The grisly detail marks the fate of prophets and foreshadows persecution of disciples. The morality tale here cautions against sin’s power to corrupt."
    },
    {
      "pk": 3006029,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 29,
      "text": "When his disciples heard of it, they came and took away his body and laid it in a tomb.",
      "links": "<a href='/AIV/40/14/12'>Matt. 14:12</a>",
      "comment": "Honoring the dead affirms the dignity of the human body; further, it prefigures the care shown to Jesus after his own death (see Matt. 27:57-61)."
    },
    {
      "pk": 3006030,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 30,
      "text": "The apostles gathered themselves together with Jesus and told him everything they had done and taught.",
      "links": "<a href='/AIV/42/9/10'>Luke 9:10</a>",
      "comment": "The apostles report back—a model for unity and accountability within the apostolic mission."
    },
    {
      "pk": 3006031,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 31,
      "text": "And he said to them, 'Come away by yourselves to a secluded place and rest a while.' For many were coming and going, and they did not even have time to eat.",
      "links": "<a href='/AIV/40/14/13'>Matt. 14:13</a>; <a href='/AIV/42/9/10'>Luke 9:10</a>",
      "comment": "Jesus invites the apostles into rest, affirming the importance of spiritual retreat and reflection even amid active ministry."
    },
    {
      "pk": 3006032,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 32,
      "text": "So they went away in the boat by themselves to a desolate place.",
      "links": "<a href='/AIV/40/14/13'>Matt. 14:13</a>",
      "comment": "Time apart for prayer and renewal is necessary for spiritual strength."
    },
    {
      "pk": 3006033,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 33,
      "text": "But many saw them going and recognized them, and they ran there on foot from all the towns and arrived ahead of them.",
      "links": "<a href='/AIV/40/14/13'>Matt. 14:13</a>",
      "comment": "The crowds' eagerness shows the hunger for Jesus’ teaching and healing."
    },
    {
      "pk": 3006034,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 34,
      "text": "When he landed, he saw a great crowd, and he had compassion on them, because they were like sheep without a shepherd. So he began to teach them many things.",
      "links": "<a href='/AIV/04/27/17'>Num. 27:17</a>; <a href='/AIV/26/34/5'>Ezek. 34:5</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "Jesus as the true shepherd fulfills prophecies about the Messiah’s compassion (Num. 27:17; Ezek. 34:5)."
    },
    {
      "pk": 3006035,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 35,
      "text": "When it was already late, his disciples came to him and said, 'This is a desolate place, and the hour is already late.'",
      "links": "<a href='/AIV/40/14/15'>Matt. 14:15</a>",
      "comment": "The disciples express concern, setting the stage for the feeding miracle."
    },
    {
      "pk": 3006036,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 36,
      "text": "'Send them away to go into the surrounding countryside and villages to buy themselves something to eat.'",
      "links": "<a href='/AIV/40/14/15'>Matt. 14:15</a>",
      "comment": "The disciples' solution relies on human means, lacking awareness of Jesus’ forthcoming miracle."
    },
    {
      "pk": 3006037,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 37,
      "text": "But he answered them, 'You give them something to eat.' They said to him, 'Should we go and buy two hundred denarii worth of bread and give it to them to eat?'",
      "links": "<a href='/AIV/40/14/16-17'>Matt. 14:16-17</a>; <a href='/AIV/42/9/13'>Luke 9:13</a>",
      "comment": "Jesus challenges the apostles, prompting faith and deeper understanding of his power."
    },
    {
      "pk": 3006038,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 38,
      "text": "And he said to them, 'How many loaves do you have? Go and see.' When they found out, they said, 'Five, and two fish.'",
      "links": "<a href='/AIV/40/14/17'>Matt. 14:17</a>; <a href='/AIV/42/9/13'>Luke 9:13</a>",
      "comment": "The insufficiency of the food sets up the miraculous multiplication to come."
    },
    {
      "pk": 3006039,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 39,
      "text": "Then he commanded them all to sit down in groups on the green grass.",
      "links": "<a href='/AIV/40/14/19'>Matt. 14:19</a>; <a href='/AIV/19/23/2'>Ps. 23:2</a>",
      "comment": "Green grass echoes Psalm 23, with Jesus as the shepherd nurturing his flock."
    },
    {
      "pk": 3006040,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 40,
      "text": "So they sat down in groups of hundreds and of fifties.",
      "links": "<a href='/AIV/02/18/21,25'>Exod. 18:21,25</a>",
      "comment": "The structured grouping parallels earlier organization of God’s people (Exod. 18:21)."
    },
    {
      "pk": 3006041,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 41,
      "text": "Taking the five loaves and the two fish, he looked up to heaven, blessed and broke the loaves and gave them to the disciples to set before the people. He also divided the two fish among them all.",
      "links": "<a href='/AIV/40/14/19'>Matt. 14:19</a>; <a href='/AIV/42/9/16'>Luke 9:16</a>",
      "comment": "This action foreshadows the Eucharist: Jesus blesses, breaks, and gives bread through his apostles, a sign both literal and symbolic of spiritual food."
    },
    {
      "pk": 3006042,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 42,
      "text": "And they all ate and were satisfied.",
      "links": "<a href='/AIV/02/16/8-12'>Exod. 16:8-12</a>",
      "comment": "The miracle recalls manna in the wilderness (Exod. 16:8-12), but with Jesus as the giver. He perfectly satisfies his people, a fulfillment of deeper spiritual needs."
    },
    {
      "pk": 3006043,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 43,
      "text": "They took up twelve baskets full of broken pieces and of the fish.",
      "links": "<a href='/AIV/40/14/20'>Matt. 14:20</a>; <a href='/AIV/42/9/17'>Luke 9:17</a>",
      "comment": "The twelve baskets symbolize the abundance and perfection of the new Israel, led by the apostles."
    },
    {
      "pk": 3006044,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 44,
      "text": "Those who ate the loaves were five thousand men.",
      "links": "<a href='/AIV/40/14/21'>Matt. 14:21</a>",
      "comment": "The mention of men alone suggests an even larger miracle when accounting for women and children. This underscores Jesus’ complete provision."
    },
    {
      "pk": 3006045,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 45,
      "text": "Immediately he made his disciples get into the boat and go ahead of him to the other side, to Bethsaida, while he dismissed the crowd.",
      "links": "<a href='/AIV/40/14/22'>Matt. 14:22</a>; <a href='/AIV/43/6/15-17'>John 6:15-17</a>",
      "comment": "Jesus sends his disciples on, showing his authority and the necessity of their obedience."
    },
    {
      "pk": 3006046,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 46,
      "text": "After he said goodbye to them, he went up on the mountain to pray.",
      "links": "<a href='/AIV/40/14/23'>Matt. 14:23</a>; <a href='/AIV/42/6/12'>Luke 6:12</a>",
      "comment": "Jesus’ retreat for prayer shows his intimate communion with the Father and serves as a model for disciples."
    },
    {
      "pk": 3006047,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 47,
      "text": "When evening came, the boat was in the middle of the sea, and he was alone on the land.",
      "links": "<a href='/AIV/40/14/23'>Matt. 14:23</a>",
      "comment": "The separation sets the stage for the next demonstration of Jesus’ divine power."
    },
    {
      "pk": 3006048,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 48,
      "text": "He saw them straining at rowing, because the wind was against them. At about the fourth watch of the night he came to them, walking on the sea. He intended to pass by them,",
      "links": "<a href='/AIV/40/14/25'>Matt. 14:25</a>; <a href='/AIV/06/3/7-17'>Josh. 3:7-17</a>; <a href='/AIV/18/9/8'>Job 9:8</a>",
      "comment": "Walking on the sea echoes Old Testament descriptions of God’s power (Job 9:8). Passing by recalls God’s theophany to Moses (Exod. 33:19, 22), indicating Jesus' divine identity."
    },
    {
      "pk": 3006049,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 49,
      "text": "but when they saw him walking on the sea, they thought it was a ghost, and cried out,",
      "links": "<a href='/AIV/40/14/26'>Matt. 14:26</a>",
      "comment": "The disciples’ fear reveals human frailty and the mysteriousness of Christ's actions."
    },
    {
      "pk": 3006050,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 50,
      "text": "for they all saw him and were terrified. But immediately he spoke to them and said, 'Take courage! It is I. Do not be afraid.'",
      "links": "<a href='/AIV/02/3/14'>Exod. 3:14</a>; <a href='/AIV/40/14/27'>Matt. 14:27</a>",
      "comment": "Jesus’ words 'It is I' ('Ego eimi' in Greek) echo the divine name revealed to Moses (Exod. 3:14), a subtle but powerful claim to divinity."
    },
    {
      "pk": 3006051,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 51,
      "text": "Then he got into the boat with them, and the wind ceased. They were completely astounded,",
      "links": "<a href='/AIV/40/14/32'>Matt. 14:32</a>",
      "comment": "The calming of the wind by Jesus again demonstrates his authority over nature—a divine prerogative."
    },
    {
      "pk": 3006052,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 52,
      "text": "for they had not understood about the loaves, but their hearts were hardened.",
      "links": "<a href='/AIV/41/8/17-21'>Mark 8:17-21</a>",
      "comment": "A lack of understanding among the apostles shows the necessity of grace and divine revelation for faith (Luke 24:45)."
    },
    {
      "pk": 3006053,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 53,
      "text": "When they had crossed over, they came to land at Gennesaret and moored the boat.",
      "links": "<a href='/AIV/40/14/34'>Matt. 14:34</a>",
      "comment": "The geographical detail grounds the narrative in history, showing the real movement of Jesus and his followers."
    },
    {
      "pk": 3006054,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 54,
      "text": "When they got out of the boat, people immediately recognized him,",
      "links": "<a href='/AIV/40/14/35'>Matt. 14:35</a>",
      "comment": "The crowd’s recognition demonstrates the growing fame of Jesus’ ministry."
    },
    {
      "pk": 3006055,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 55,
      "text": "and they ran throughout that whole region and began to carry the sick on mats to wherever they heard he was.",
      "links": "<a href='/AIV/40/14/35'>Matt. 14:35</a>",
      "comment": "The eagerness for healing underscores the compassion and power of Jesus."
    },
    {
      "pk": 3006056,
      "translation": "AIV",
      "book": 2,
      "chapter": 6,
      "verse": 56,
      "text": "Wherever he went, in villages, towns, or countryside, they laid the sick in the marketplaces and begged him to let them touch even the fringe of his cloak. And all who touched him were healed.",
      "links": "<a href='/AIV/04/15/38-39'>Num. 15:38-39</a>; <a href='/AIV/40/9/20-21'>Matt. 9:20-21</a>",
      "comment": "The healing power even in touching his garment shows the holiness of Christ’s person and the faith of the people (see Num. 15:38-39 reference to the fringes of a garment). This hints at the power of tangible signs in mediating divine grace."
    }
  ],
  "translatedAt": "2025-12-23T02:29:35.534Z"
}