{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 1,
  "verses": [
    {
      "pk": 4100101,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 1,
      "text": "The beginning of the good news of Jesus Christ, the Son of God.",
      "links": "<a href='/AIV/23/40/9'>Isaiah 40:9</a>; <a href='/AIV/45/1/1-4'>Romans 1:1-4</a>",
      "comment": "Mark introduces his account as 'good news' (Gospel), immediately identifying Jesus as the 'Son of God.' This is a high christological claim, asserting Jesus's divine identity from the outset. The phrase echoes messianic expectations in the Old Testament."
    },
    {
      "pk": 4100102,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 2,
      "text": "As it is written in Isaiah the prophet: 'Behold, I send my messenger ahead of you, who will prepare your way.'",
      "links": "<a href='/AIV/39/3/1'>Malachi 3:1</a>; <a href='/AIV/23/40/3'>Isaiah 40:3</a>",
      "comment": "Mark cites Isaiah and Malachi, combining their words to show that John the Baptist is the promised forerunner to the Messiah. Fulfillment of prophecy is stressed, tying Old Testament expectations to Jesus."
    },
    {
      "pk": 4100103,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 3,
      "text": "'The voice of one crying in the wilderness: Prepare the way of the Lord, make his paths straight.'",
      "links": "<a href='/AIV/23/40/3'>Isaiah 40:3</a>",
      "comment": "‘The Lord’ in Isaiah refers to God Himself; Mark applies this title to Jesus, which is an implicit claim of Christ's divinity. The wilderness recalls the Exodus, hinting at a new spiritual journey and deliverance."
    },
    {
      "pk": 4100104,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 4,
      "text": "John appeared, baptizing in the wilderness and proclaiming a baptism of repentance for the forgiveness of sins.",
      "links": "<a href='/AIV/42/3/3'>Luke 3:3</a>",
      "comment": "John’s baptism signifies repentance and forgiveness, but fuller forgiveness will be found in Christ's later ministry. The link between repentance, confession, and forgiveness lays groundwork for sacramental theology."
    },
    {
      "pk": 4100105,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 5,
      "text": "And all the country of Judea and all Jerusalem were going out to him and were being baptized by him in the river Jordan, confessing their sins.",
      "links": "<a href='/AIV/40/3/5-6'>Matthew 3:5-6</a>",
      "comment": "Public confession of sins was a key element of John's ministry, foreshadowing the practice of open confession as part of spiritual life."
    },
    {
      "pk": 4100106,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 6,
      "text": "Now John was clothed with camel's hair and wore a leather belt around his waist and ate locusts and wild honey.",
      "links": "<a href='/AIV/12/1/8'>2 Kings 1:8</a>; <a href='/AIV/40/3/4'>Matthew 3:4</a>",
      "comment": "John’s appearance recalls Elijah (2 Kings 1:8), linking him to the promised return of Elijah before the day of the Lord (Malachi 4:5)."
    },
    {
      "pk": 4100107,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 7,
      "text": "And he preached, saying, 'After me comes one who is mightier than I, the strap of whose sandals I am not worthy to stoop down and untie.'",
      "links": "<a href='/AIV/40/3/11'>Matthew 3:11</a>; <a href='/AIV/43/1/27'>John 1:27</a>",
      "comment": "John emphasizes the greatness of Jesus, demonstrating deep humility. The one who follows him far surpasses any prophet."
    },
    {
      "pk": 4100108,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 8,
      "text": "'I have baptized you with water, but he will baptize you with the Holy Spirit.'",
      "links": "<a href='/AIV/44/1/5'>Acts 1:5</a>; <a href='/AIV/23/44/3'>Isaiah 44:3</a>",
      "comment": "This anticipates the coming of the Holy Spirit through Jesus. John's baptism (with water) is preparatory, but the full reality arrives with Christ, hinting at the new birth through the Spirit in Christian baptism."
    },
    {
      "pk": 4100109,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 9,
      "text": "In those days Jesus came from Nazareth of Galilee and was baptized by John in the Jordan.",
      "links": "<a href='/AIV/40/3/13'>Matthew 3:13</a>; <a href='/AIV/42/3/21'>Luke 3:21</a>",
      "comment": "Jesus's baptism inaugurates his public ministry. Though sinless, he submits to baptism to identify with sinful humanity—prefiguring his later sacrificial role."
    },
    {
      "pk": 4100110,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 10,
      "text": "And just as he came up out of the water, he saw the heavens being torn open and the Spirit descending on him like a dove.",
      "links": "<a href='/AIV/23/64/1'>Isaiah 64:1</a>; <a href='/AIV/01/8/8-12'>Genesis 8:8-12</a>",
      "comment": "The Spirit's descent upon Jesus reveals his messianic anointing. The torn heavens signify the breaking in of God’s presence. The Trinity is subtly referenced here (Father, Son, Spirit)."
    },
    {
      "pk": 4100111,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 11,
      "text": "And a voice came from heaven: 'You are my beloved Son; with you I am well pleased.'",
      "links": "<a href='/AIV/19/2/7'>Psalm 2:7</a>; <a href='/AIV/23/42/1'>Isaiah 42:1</a>",
      "comment": "God the Father's declaration affirms Jesus's unique sonship and divine mission, directly referencing messianic prophecy. This pronouncement establishes Jesus’s divine authority."
    },
    {
      "pk": 4100112,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 12,
      "text": "Immediately the Spirit drove him out into the wilderness.",
      "links": "<a href='/AIV/40/4/1'>Matthew 4:1</a>",
      "comment": "The Spirit sends Jesus into the wilderness, signaling the beginning of his testing. This recapitulates Israel’s own time in the wilderness."
    },
    {
      "pk": 4100113,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 13,
      "text": "And he was in the wilderness forty days, being tempted by Satan. He was with the wild animals, and the angels were ministering to him.",
      "links": "<a href='/AIV/02/34/28'>Exodus 34:28</a>; <a href='/AIV/43/1/51'>John 1:51</a>",
      "comment": "Forty days recalls periods of testing (Moses, Elijah, Israel). Jesus stands victorious where Israel failed. The ministering angels highlight his unique authority and identity."
    },
    {
      "pk": 4100114,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 14,
      "text": "Now after John was arrested, Jesus came into Galilee, proclaiming the gospel of God,",
      "links": "<a href='/AIV/40/4/12'>Matthew 4:12</a>",
      "comment": "Jesus takes up the central message of salvation after John’s arrest, indicating a divinely guided succession in ministry."
    },
    {
      "pk": 4100115,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 15,
      "text": "and saying, 'The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.'",
      "links": "<a href='/AIV/27/7/13-14'>Daniel 7:13-14</a>; <a href='/AIV/42/4/43'>Luke 4:43</a>",
      "comment": "The 'kingdom of God' summarizes Jesus’s whole public mission. Repentance and faith are both necessary responses, implying ongoing conversion as a continual mode of life."
    },
    {
      "pk": 4100116,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 16,
      "text": "As he was passing along beside the Sea of Galilee, he saw Simon and Andrew the brother of Simon casting a net into the sea, for they were fishermen.",
      "links": "<a href='/AIV/40/4/18'>Matthew 4:18</a>",
      "comment": "Jesus calls ordinary people to extraordinary missions and leadership. Their vocation (fishers) is symbolic of their later spiritual calling."
    },
    {
      "pk": 4100117,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 17,
      "text": "And Jesus said to them, 'Follow me, and I will make you become fishers of men.'",
      "links": "<a href='/AIV/24/16/16'>Jeremiah 16:16</a>",
      "comment": "Jesus’s authoritative call initiates discipleship. This promise establishes their special role in gathering people into the new covenant community."
    },
    {
      "pk": 4100118,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 18,
      "text": "And immediately they left their nets and followed him.",
      "links": "<a href='/AIV/40/19/27'>Matthew 19:27</a>",
      "comment": "Their total response models radical obedience and the abandonment of worldly attachments for the sake of Christ."
    },
    {
      "pk": 4100119,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 19,
      "text": "And going a little further, he saw James the son of Zebedee and John his brother, who were in their boat mending the nets.",
      "links": "<a href='/AIV/40/4/21'>Matthew 4:21</a>",
      "comment": "Jesus personally calls each disciple, reinforcing the idea of a divinely chosen leadership foundation for his Church."
    },
    {
      "pk": 4100120,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 20,
      "text": "And immediately he called them, and they left their father Zebedee in the boat with the hired servants and followed him.",
      "links": "<a href='/AIV/09/19/20-21'>1 Samuel 19:20-21</a>",
      "comment": "The willingness to leave family and security for Jesus is highlighted, echoing the demands of authentic discipleship."
    },
    {
      "pk": 4100121,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 21,
      "text": "And they went into Capernaum, and immediately on the Sabbath he entered the synagogue and was teaching.",
      "links": "<a href='/AIV/40/4/13'>Matthew 4:13</a>",
      "comment": "Capernaum becomes Jesus's base of ministry. His teaching in the synagogue displays his authority."
    },
    {
      "pk": 4100122,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 22,
      "text": "And they were astonished at his teaching, for he taught them as one who had authority, and not as the scribes.",
      "links": "<a href='/AIV/40/7/28-29'>Matthew 7:28-29</a>",
      "comment": "Unlike the scribes who cite others, Jesus speaks with his own divine authority, uniquely instructing the people."
    },
    {
      "pk": 4100123,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 23,
      "text": "And immediately there was in their synagogue a man with an unclean spirit, and he cried out,",
      "links": "<a href='/AIV/03/19/31'>Leviticus 19:31</a>; <a href='/AIV/42/4/33'>Luke 4:33</a>",
      "comment": "Confrontation with evil happens within the place of worship, underlining Jesus’s role as the bringer of true spiritual liberation."
    },
    {
      "pk": 4100124,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 24,
      "text": "'What have you to do with us, Jesus of Nazareth? Have you come to destroy us? I know who you are—the Holy One of God.'",
      "links": "<a href='/AIV/19/16/10'>Psalm 16:10</a>; <a href='/AIV/43/6/69'>John 6:69</a>",
      "comment": "The demonic spirit recognizes who Jesus truly is. 'Holy One of God' is a significant messianic and divine title (see John 6:69)."
    },
    {
      "pk": 4100125,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 25,
      "text": "But Jesus rebuked him, saying, 'Be silent, and come out of him!'",
      "links": "<a href='/AIV/42/4/35'>Luke 4:35</a>",
      "comment": "Jesus commands with effortless authority. His word alone expels evil, foreshadowing the greater spiritual deliverance he will accomplish."
    },
    {
      "pk": 4100126,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 26,
      "text": "And the unclean spirit, convulsing him and crying out with a loud voice, came out of him.",
      "links": "<a href='/AIV/40/8/29'>Matthew 8:29</a>",
      "comment": "The dramatic exorcism demonstrates the superior power and mission of Christ to conquer evil."
    },
    {
      "pk": 4100127,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 27,
      "text": "And they were all amazed, so that they questioned among themselves, saying, 'What is this? A new teaching with authority! He commands even the unclean spirits, and they obey him.'",
      "links": "<a href='/AIV/42/4/36'>Luke 4:36</a>",
      "comment": "The people are amazed at both Jesus’s teaching and his command over demons. The phrase 'new teaching with authority' emphasizes a new spiritual order."
    },
    {
      "pk": 4100128,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 28,
      "text": "And at once his fame spread everywhere throughout all the surrounding region of Galilee.",
      "links": "<a href='/AIV/40/4/24'>Matthew 4:24</a>",
      "comment": "Jesus's power rapidly draws public attention, laying the groundwork for the worldwide spread of his message."
    },
    {
      "pk": 4100129,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 29,
      "text": "And immediately he left the synagogue and entered the house of Simon and Andrew, with James and John.",
      "links": "<a href='/AIV/40/8/14'>Matthew 8:14</a>",
      "comment": "This marks the beginning of close fellowship between Jesus and his disciples in both public and private contexts."
    },
    {
      "pk": 4100130,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 30,
      "text": "Now Simon's mother-in-law lay sick with a fever, and immediately they told him about her.",
      "links": "<a href='/AIV/42/4/38'>Luke 4:38</a>",
      "comment": "Peter's mother-in-law’s illness presents an opportunity for Jesus to show his compassion and divine power in the home setting."
    },
    {
      "pk": 4100131,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 31,
      "text": "And he came and took her by the hand and raised her up, and the fever left her, and she began to serve them.",
      "links": "<a href='/AIV/11/17/17-24'>1 Kings 17:17-24</a>; <a href='/AIV/44/9/41'>Acts 9:41</a>",
      "comment": "Jesus’s touch brings immediate healing. Her response in service prefigures the vocation of serving Christ and his people once transformed by grace."
    },
    {
      "pk": 4100132,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 32,
      "text": "That evening at sundown they brought to him all who were sick or possessed by demons.",
      "links": "<a href='/AIV/40/8/16'>Matthew 8:16</a>",
      "comment": "At sunset, when the Sabbath ended, people flock to Jesus, showing how, through him, true rest and healing are found."
    },
    {
      "pk": 4100133,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 33,
      "text": "And the whole city was gathered together at the door.",
      "links": "<a href='/AIV/42/4/40'>Luke 4:40</a>",
      "comment": "Jesus's impact is communal. The gathering of the multitude at the door foreshadows the Church as a gathering place for those seeking Christ."
    },
    {
      "pk": 4100134,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 34,
      "text": "And he healed many who were sick with various diseases, and cast out many demons. And he would not allow the demons to speak, because they knew him.",
      "links": "<a href='/AIV/40/12/16'>Matthew 12:16</a>; <a href='/AIV/43/6/15'>John 6:15</a>",
      "comment": "Jesus’s authority extends both to healing physical sickness and defeating spiritual evil. His identity is not to be proclaimed by demons—true revelation must come in due time and by right witness."
    },
    {
      "pk": 4100135,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 35,
      "text": "And rising very early in the morning, while it was still dark, he departed and went out to a desolate place, and there he prayed.",
      "links": "<a href='/AIV/42/5/16'>Luke 5:16</a>; <a href='/AIV/19/5/3'>Psalm 5:3</a>",
      "comment": "Jesus’s commitment to prayer shows dependence on the Father, modeling deep communion for his disciples. His example underlines the centrality of prayer, especially in solitude."
    },
    {
      "pk": 4100136,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 36,
      "text": "And Simon and those who were with him searched for him,",
      "links": "<a href='/AIV/42/4/42'>Luke 4:42</a>",
      "comment": "The disciples’ search for Jesus highlights their need for his constant spiritual leadership and guidance."
    },
    {
      "pk": 4100137,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 37,
      "text": "and they found him and said to him, 'Everyone is looking for you.'",
      "links": "<a href='/AIV/40/14/13'>Matthew 14:13</a>",
      "comment": "Jesus is the source of hope for the crowds, illustrating the longing of people for wholeness and truth found in him."
    },
    {
      "pk": 4100138,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 38,
      "text": "And he said to them, 'Let us go on to the nearby towns, so that I may preach there also, for that is why I came.'",
      "links": "<a href='/AIV/42/4/43'>Luke 4:43</a>",
      "comment": "Jesus’s mission is universal, to reach all towns and peoples, not limited to one place or group."
    },
    {
      "pk": 4100139,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 39,
      "text": "And he went throughout all Galilee, preaching in their synagogues and casting out demons.",
      "links": "<a href='/AIV/40/4/23'>Matthew 4:23</a>",
      "comment": "Jesus’s teaching and acts of power together establish his public ministry, demonstrating the union of word and deed in his work."
    },
    {
      "pk": 4100140,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 40,
      "text": "And a leper came to him, imploring him and kneeling, and said to him, 'If you are willing, you can make me clean.'",
      "links": "<a href='/AIV/03/13/45-46'>Leviticus 13:45-46</a>; <a href='/AIV/40/8/2'>Matthew 8:2</a>",
      "comment": "Leprosy made one ritually unclean; only God could restore full purity. The leper's kneeling and his words show faith in Jesus’s power."
    },
    {
      "pk": 4100141,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 41,
      "text": "Moved with compassion, he stretched out his hand and touched him, and said to him, 'I am willing; be made clean.'",
      "links": "<a href='/AIV/40/8/3'>Matthew 8:3</a>",
      "comment": "Jesus’s touch and words transmit both compassion and divine healing. His willingness to touch the unclean demonstrates the outward movement of grace."
    },
    {
      "pk": 4100142,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 42,
      "text": "And immediately the leprosy left him, and he was made clean.",
      "links": "<a href='/AIV/42/3/13'>Luke 5:13</a>",
      "comment": "Immediate healing points to Jesus’s unique authority and divine power—paralleling God’s creative and cleansing acts."
    },
    {
      "pk": 4100143,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 43,
      "text": "And Jesus sternly charged him and immediately sent him away,",
      "links": "<a href='/AIV/40/8/4'>Matthew 8:4</a>",
      "comment": "Jesus instructs the healed man with urgency, reflecting a care for proper order and the fulfillment of the law."
    },
    {
      "pk": 4100144,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 44,
      "text": "and said to him, 'See that you say nothing to anyone, but go, show yourself to the priest and offer for your cleansing what Moses commanded, as a testimony to them.'",
      "links": "<a href='/AIV/03/14/2-32'>Leviticus 14:2-32</a>; <a href='/AIV/40/5/17'>Matthew 5:17</a>",
      "comment": "Jesus upholds Mosaic law: he instructs the man to follow the ritual prescribed for cleansing. This points toward the continuing importance of authority and the visible structure in the community of believers."
    },
    {
      "pk": 4100145,
      "translation": "AIV",
      "book": 2,
      "chapter": 1,
      "verse": 45,
      "text": "But he went out and began to proclaim it freely, and to spread the news, so that Jesus could no longer openly enter a town but remained outside in desolate places. Yet people came to him from every quarter.",
      "links": "<a href='/AIV/40/9/31'>Matthew 9:31</a>; <a href='/AIV/42/5/15-16'>Luke 5:15-16</a>",
      "comment": "The miraculous healings attract greater crowds, but also greater opposition, fulfilling Isaiah’s prophecy that the Servant would be rejected and yet draw all nations to himself."
    }
  ],
  "translatedAt": "2025-12-23T02:23:21.220Z"
}