{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 3,
  "verses": [
    {
      "pk": 420301,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 1,
      "text": "Again, he entered the synagogue, and a man was there who had a withered hand.",
      "links": "<a href='/AIV/40/12/9-10'>Matt. 12:9-10</a>; <a href='/AIV/42/6/6'>Luke 6:6</a>",
      "comment": "Jesus’ return to the synagogue for healing demonstrates His commitment to restoring people not only physically, but spiritually, especially in the context of sacred worship."
    },
    {
      "pk": 420302,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 2,
      "text": "And they watched him closely, to see if he would heal him on the Sabbath, so that they might accuse him.",
      "links": "<a href='/AIV/40/12/10'>Matt. 12:10</a>; <a href='/AIV/43/9/16'>John 9:16</a>",
      "comment": "The religious leaders' focus on legal technicalities over compassion shows a hardening of heart and a misunderstanding of the true purpose of the Sabbath."
    },
    {
      "pk": 420303,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 3,
      "text": "And he said to the man with the withered hand, 'Stand up in the middle.'",
      "links": "<a href='/AIV/40/12/11-13'>Matt. 12:11-13</a>",
      "comment": "Jesus calls the man to stand publicly, making it clear that His work is done openly and in truth, not in secret."
    },
    {
      "pk": 420304,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 4,
      "text": "Then he said to them, 'Is it lawful on the Sabbath to do good or to do harm, to save life or to kill?' But they were silent.",
      "links": "<a href='/AIV/42/6/9'>Luke 6:9</a>; <a href='/AIV/28/6/6'>Hos. 6:6</a>",
      "comment": "Jesus reframes the law, pointing to mercy as the foundation of true righteousness (see Hosea 6:6)."
    },
    {
      "pk": 420305,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 5,
      "text": "And looking around at them with anger, grieved at their hardness of heart, he said to the man, 'Stretch out your hand.' He stretched it out, and his hand was restored.",
      "links": "<a href='/AIV/41/16/14'>Mark 16:14</a>; <a href='/AIV/19/69/20'>Ps. 69:20</a>",
      "comment": "This shows Jesus expressing righteous anger at spiritual blindness and completing the miracle by His command alone—a sign of divine authority."
    },
    {
      "pk": 420306,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 6,
      "text": "The Pharisees went out and immediately plotted with the Herodians against him, how they might destroy him.",
      "links": "<a href='/AIV/40/12/14'>Matt. 12:14</a>; <a href='/AIV/43/11/53'>John 11:53</a>",
      "comment": "Opposition to Jesus forms an alliance between different factions, revealing the deep threat His message posed to the existing religious order."
    },
    {
      "pk": 420307,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 7,
      "text": "Jesus withdrew with his disciples to the sea, and a large crowd followed from Galilee, Judea,",
      "links": "<a href='/AIV/40/12/15'>Matt. 12:15</a>",
      "comment": "Jesus often withdrew for prayer and to teach His disciples privately, showing the importance of spiritual formation apart from public ministry."
    },
    {
      "pk": 420308,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 8,
      "text": "as well as from Jerusalem, Idumea, beyond the Jordan, and those from around Tyre and Sidon. A great multitude heard about all he was doing and came to him.",
      "links": "<a href='/AIV/40/4/24-25'>Matt. 4:24-25</a>",
      "comment": "People from all surrounding regions flocked to Jesus, foreshadowing the universal scope of His mission."
    },
    {
      "pk": 420309,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 9,
      "text": "And he told his disciples to have a small boat ready for him, because of the crowd, so that they would not crush him.",
      "links": "<a href='/AIV/42/5/3'>Luke 5:3</a>",
      "comment": "Jesus uses practical wisdom to ensure the safety of His ministry, demonstrating God’s care for both His mission and those receiving it."
    },
    {
      "pk": 420310,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 10,
      "text": "For he had healed many, and so all who had diseases pressed toward him to touch him.",
      "links": "<a href='/AIV/41/6/56'>Mark 6:56</a>",
      "comment": "The people sought healing just by touching Jesus. This physical contact prefigures how grace is often conveyed through tangible means."
    },
    {
      "pk": 420311,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 11,
      "text": "And whenever unclean spirits saw him, they fell down before him and cried out, 'You are the Son of God.'",
      "links": "<a href='/AIV/40/8/29'>Matt. 8:29</a>; <a href='/AIV/42/4/41'>Luke 4:41</a>",
      "comment": "Even the demons instantly recognize Jesus’ true divine identity—a testimony to His absolute authority."
    },
    {
      "pk": 420312,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 12,
      "text": "But he strictly ordered them not to make him known.",
      "links": "<a href='/AIV/41/1/25'>Mark 1:25,34</a>",
      "comment": "Jesus controlled the revelation of His identity, emphasizing His mission would only be fully grasped in God’s timing, especially through the cross."
    },
    {
      "pk": 420313,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 13,
      "text": "Then he went up on the mountain and called to him those whom he wanted, and they came to him.",
      "links": "<a href='/AIV/42/6/12-13'>Luke 6:12-13</a>",
      "comment": "The mountain is a setting for important spiritual events. Jesus personally chooses His apostles, indicating a personal call and commissioning for sacred leadership."
    },
    {
      "pk": 420314,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 14,
      "text": "And he appointed twelve, so that they might be with him and that he might send them out to preach",
      "links": "<a href='/AIV/40/10/1'>Matt. 10:1</a>; <a href='/AIV/42/9/1-2'>Luke 9:1-2</a>",
      "comment": "The number twelve echoes the twelve tribes of Israel, suggesting Jesus is forming a new, unified people of God under apostolic authority."
    },
    {
      "pk": 420315,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 15,
      "text": "and to have authority to cast out demons.",
      "links": "<a href='/AIV/41/6/7'>Mark 6:7</a>; <a href='/AIV/40/10/8'>Matt. 10:8</a>",
      "comment": "Jesus delegates real spiritual authority to His apostles, establishing a foundation for apostolic ministry and the continuing mission of the Church."
    },
    {
      "pk": 420316,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 16,
      "text": "He appointed the twelve: Simon (to whom he gave the name Peter),",
      "links": "<a href='/AIV/40/10/2'>Matt. 10:2</a>",
      "comment": "Simon is distinguished and named 'Peter' (which means 'rock'), prefiguring his special leadership role among the apostles."
    },
    {
      "pk": 420317,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 17,
      "text": "James the son of Zebedee and John the brother of James, to whom he gave the name Boanerges, that is, Sons of Thunder;",
      "links": "<a href='/AIV/42/9/54'>Luke 9:54</a>",
      "comment": "The nickname 'Sons of Thunder' points to their passionate character, which Jesus transforms for His work."
    },
    {
      "pk": 420318,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 18,
      "text": "Andrew; Philip; Bartholomew; Matthew; Thomas; James the son of Alphaeus; Thaddaeus; Simon the Zealot;",
      "links": "<a href='/AIV/40/10/3-4'>Matt. 10:3-4</a>",
      "comment": "This detailed listing of the apostles confirms the personal, chosen foundation of the Church’s leadership."
    },
    {
      "pk": 420319,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 19,
      "text": "and Judas Iscariot, who also betrayed him.",
      "links": "<a href='/AIV/41/14/10'>Mark 14:10</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Including Judas Iscariot fulfills Old Testament prophecy that even a close friend would betray the Messiah (Psalm 41:9)."
    },
    {
      "pk": 420320,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 20,
      "text": "Then he went home, and the crowd gathered again, so that they could not even eat.",
      "links": "",
      "comment": "The overwhelming crowds emphasize the powerful draw of Jesus’ ministry and His total self-giving."
    },
    {
      "pk": 420321,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 21,
      "text": "When his family heard of this, they went out to restrain him, for they were saying, 'He is out of his mind.'",
      "links": "<a href='/AIV/43/7/5'>John 7:5</a>",
      "comment": "Even Jesus’ own relatives did not fully understand His mission initially, demonstrating how divine revelation unfolds gradually."
    },
    {
      "pk": 420322,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 22,
      "text": "And the scribes who came down from Jerusalem said, 'He has Beelzebul,' and, 'By the ruler of the demons he casts out demons.'",
      "links": "<a href='/AIV/40/12/24'>Matt. 12:24</a>",
      "comment": "The accusation of using demonic power reveals how hard hearts resist the truth, even in the face of miracles."
    },
    {
      "pk": 420323,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 23,
      "text": "And calling them to himself, he spoke to them in parables, 'How can Satan cast out Satan?'",
      "links": "<a href='/AIV/40/12/25'>Matt. 12:25</a>",
      "comment": "Jesus exposes the illogical nature of their accusation, using parables to teach deep spiritual realities."
    },
    {
      "pk": 420324,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 24,
      "text": "'If a kingdom is divided against itself, that kingdom cannot stand.'",
      "links": "<a href='/AIV/42/11/17'>Luke 11:17</a>",
      "comment": "Jesus teaches that division brings downfall—this also issues a warning about the importance of unity in the people of God."
    },
    {
      "pk": 420325,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 25,
      "text": "'If a house is divided against itself, that house cannot stand.'",
      "links": "",
      "comment": "The principle of unity is foundational for the endurance of God’s household. This has both ecclesial and family implications."
    },
    {
      "pk": 420326,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 26,
      "text": "'And if Satan has risen up against himself and is divided, he cannot stand, but is finished.'",
      "links": "",
      "comment": "Jesus asserts His exorcisms are proof that He comes as the stronger one to conquer evil, not to collaborate with it."
    },
    {
      "pk": 420327,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 27,
      "text": "'But no one can enter a strong man's house and plunder his goods, unless he first binds the strong man. Then indeed he may plunder his house.'",
      "links": "<a href='/AIV/23/49/24-25'>Isa. 49:24-25</a>",
      "comment": "By casting out demons, Jesus demonstrates He is the one sent to bind the enemy and free those oppressed (Isaiah 49:24-25)."
    },
    {
      "pk": 420328,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 28,
      "text": "'Truly, I say to you, all sins will be forgiven the children of men, and whatever blasphemies they utter;'",
      "links": "<a href='/AIV/40/12/31'>Matt. 12:31</a>",
      "comment": "Jesus promises forgiveness for all sins, emphasizing the boundless mercy God offers through Christ."
    },
    {
      "pk": 420329,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 29,
      "text": "'but whoever blasphemes against the Holy Spirit never has forgiveness, but is guilty of an eternal sin.'",
      "links": "<a href='/AIV/42/12/10'>Luke 12:10</a>",
      "comment": "The eternal sin is a persistent, willful rejection of the Holy Spirit’s testimony—closing oneself off from God’s forgiveness."
    },
    {
      "pk": 420330,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 30,
      "text": "For they had said, 'He has an unclean spirit.'",
      "links": "",
      "comment": "Accusing Jesus, the Holy One, of uncleanliness is the ultimate rejection of God's work and self-revelation."
    },
    {
      "pk": 420331,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 31,
      "text": "Then his mother and his brothers arrived, and standing outside, they sent to him and called him.",
      "links": "<a href='/AIV/40/12/46'>Matt. 12:46</a>; <a href='/AIV/42/8/19'>Luke 8:19</a>",
      "comment": "Jesus’ family plays a significant role in the Gospel narratives, highlighting the intimacy and challenge between natural kinship and spiritual mission."
    },
    {
      "pk": 420332,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 32,
      "text": "And a crowd was sitting around him, and they said to him, 'Look, your mother and your brothers are outside, seeking you.'",
      "links": "",
      "comment": "This moment frames the distinction between biological and spiritual family for those who follow Jesus."
    },
    {
      "pk": 420333,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 33,
      "text": "And he answered them, 'Who are my mother and my brothers?'",
      "links": "",
      "comment": "Jesus’ question draws attention to the broader family He is creating through obedience and faith."
    },
    {
      "pk": 420334,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 34,
      "text": "And looking around at those who sat around him, he said, 'Here are my mother and my brothers!'",
      "links": "",
      "comment": "Jesus points to the community of believers present with Him, revealing the reality of spiritual communion that transcends blood relationship."
    },
    {
      "pk": 420335,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 35,
      "text": "Whoever does the will of God, he is my brother and sister and mother.'",
      "links": "<a href='/AIV/40/12/50'>Matt. 12:50</a>",
      "comment": "Doing the will of God becomes the mark of inclusion in Jesus' true family, creating God’s household knit together in faith and obedience."
    }
  ],
  "translatedAt": "2025-12-23T02:24:32.536Z"
}