{
  "book": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 9,
  "verses": [
    {
      "pk": 1935001,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 1,
      "text": "And Jesus said to them, \"Truly I say to you, some who are standing here will not taste death until they see the kingdom of God come with power.\"",
      "links": "<a href='/AIV/40/16/28'>Matthew 16:28</a>; <a href='/AIV/42/9/27'>Luke 9:27</a>",
      "comment": "Jesus here foretells a glimpse of His glory to some disciples, fulfilled at the Transfiguration. 'Taste death' is a Hebrew idiom for dying. The 'kingdom of God coming with power' foreshadows His Resurrection and the birth of the Church."
    },
    {
      "pk": 1935002,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 2,
      "text": "After six days, Jesus took Peter, James, and John, and led them up a high mountain by themselves. And He was transfigured before them.",
      "links": "<a href='/AIV/40/17/1'>Matthew 17:1</a>; <a href='/AIV/42/9/28'>Luke 9:28</a>",
      "comment": "The 'Transfiguration' reveals Jesus’ divine nature, affirming His identity as the Son of God. Peter, James, and John were chosen as key witnesses, paralleling Moses receiving the law on the mountain."
    },
    {
      "pk": 1935003,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 3,
      "text": "His clothes became radiant, exceedingly white, as no one on earth could bleach them.",
      "links": "<a href='/AIV/27/7/9'>Daniel 7:9</a>; <a href='/AIV/66/1/14'>Revelation 1:14</a>",
      "comment": "The dazzling whiteness signifies divine glory and purity—echoes Old Testament descriptions of God's holiness and presence."
    },
    {
      "pk": 1935004,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 4,
      "text": "And there appeared to them Elijah with Moses, and they were talking with Jesus.",
      "links": "<a href='/AIV/11/2/11'>2 Kings 2:11</a>; <a href='/AIV/5/34/5'>Deut. 34:5-6</a>",
      "comment": "Elijah and Moses represent the Law and the Prophets, testifying to Jesus as their fulfillment. This encounter also emphasizes continuity with Israel's history."
    },
    {
      "pk": 1935005,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 5,
      "text": "Peter said to Jesus, \"Rabbi, it is good for us to be here. Let us make three tents: one for You, one for Moses, and one for Elijah.\"",
      "links": "<a href='/AIV/7/5/21'>Judges 5:21</a>; <a href='/AIV/40/17/4'>Matthew 17:4</a>",
      "comment": "Peter’s offer may reflect Jewish traditions about tabernacles, but elevates Jesus alongside Moses and Elijah, revealing early disciples' awe and confusion about His uniqueness."
    },
    {
      "pk": 1935006,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 6,
      "text": "For he did not know what to say, because they were terrified.",
      "links": "",
      "comment": "Human response to divine manifestation is often fear and awe, suggesting the incomprehensible greatness of Jesus’ divinity."
    },
    {
      "pk": 1935007,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 7,
      "text": "Then a cloud overshadowed them, and a voice came from the cloud: \"This is my beloved Son. Listen to Him!\"",
      "links": "<a href='/AIV/2/19/9'>Exodus 19:9</a>; <a href='/AIV/40/3/17'>Matthew 3:17</a>; <a href='/AIV/19/2/7'>Psalm 2:7</a>",
      "comment": "The Father's declaration echoes Psalm 2:7, confirming Jesus’ divine sonship. The cloud is a theophany—God’s manifest presence as in Exodus. The command 'Listen to Him' elevates Jesus above the Law and Prophets."
    },
    {
      "pk": 1935008,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 8,
      "text": "Suddenly, when they looked around, they saw no one anymore except Jesus alone with them.",
      "links": "",
      "comment": "The disappearance of Moses and Elijah emphasizes that Jesus alone is the mediator and fulfillment of God's revelation."
    },
    {
      "pk": 1935009,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 9,
      "text": "As they came down the mountain, He commanded them not to tell anyone what they had seen, until the Son of Man had risen from the dead.",
      "links": "<a href='/AIV/41/8/30'>Mark 8:30</a>; <a href='/AIV/41/9/31'>Mark 9:31</a>",
      "comment": "Jesus refers to Himself as 'Son of Man,' echoing Daniel 7:13, with divine overtones. The secrecy reflects the mystery of His mission until the Resurrection unveils His full glory."
    },
    {
      "pk": 1935010,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 10,
      "text": "So they kept the matter to themselves, questioning what 'rising from the dead' meant.",
      "links": "<a href='/AIV/41/8/31'>Mark 8:31</a>",
      "comment": "The disciples do not yet comprehend resurrection, showing progressive revelation of Christ's triumph over death."
    },
    {
      "pk": 1935011,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 11,
      "text": "They asked Him, \"Why do the scribes say that Elijah must come first?\"",
      "links": "<a href='/AIV/39/4/5'>Malachi 4:5</a>",
      "comment": "Jewish expectation based on Malachi. The coming of Elijah heralds Messiah; Jesus interprets this in spiritual terms."
    },
    {
      "pk": 1935012,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 12,
      "text": "He said to them, \"Elijah does come first to restore all things. And how is it written of the Son of Man that He must suffer many things and be rejected?\"",
      "links": "<a href='/AIV/23/53/3'>Isaiah 53:3</a>; <a href='/AIV/27/7/13'>Daniel 7:13-14</a>",
      "comment": "Jesus aligns His messianic mission with prophetic suffering. Spiritual restoration precedes His passion."
    },
    {
      "pk": 1935013,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 13,
      "text": "But I tell you, Elijah has come, and they did to him whatever they wished, just as it is written of him.\"",
      "links": "<a href='/AIV/40/17/12-13'>Matt. 17:12-13</a>; <a href='/AIV/41/6/14'>Mark 6:14-28</a>",
      "comment": "John the Baptist fulfilled Elijah's role, persecuted and martyred—another foreshadowing of Messiah’s suffering."
    },
    {
      "pk": 1935014,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 14,
      "text": "When they came to the disciples, they saw a large crowd around them, and scribes disputing with them.",
      "links": "",
      "comment": "Contrasts heavenly revelation with earthly conflict, setting the stage for a demonstration of Jesus’ authority."
    },
    {
      "pk": 1935015,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 15,
      "text": "Immediately, when all the crowd saw Him, they were amazed, and ran to greet Him.",
      "links": "",
      "comment": "The awe of the crowd reflects Jesus’ visible presence and growing reputation, possibly remnants of His transfiguration."
    },
    {
      "pk": 1935016,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 16,
      "text": "And He asked them, \"What are you discussing with them?\"",
      "links": "",
      "comment": "Jesus as Teacher enters into the disputes, inviting explanation and deeper truth."
    },
    {
      "pk": 1935017,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 17,
      "text": "One from the crowd answered Him, \"Teacher, I brought my son to You, who has a spirit that makes him unable to speak.\"",
      "links": "",
      "comment": "Demonic affliction is recognized and brought before Jesus, showing faith in His authority."
    },
    {
      "pk": 1935018,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 18,
      "text": "\"Whenever it seizes him, it throws him down, and he foams at the mouth, grinds his teeth, and becomes rigid. I asked Your disciples to cast it out, but they could not.\"",
      "links": "<a href='/AIV/41/6/7'>Mark 6:7</a>",
      "comment": "Explicit description of possession. Disciples’ inability points to need for greater faith and reliance on Jesus’ unique power."
    },
    {
      "pk": 1935019,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 19,
      "text": "He answered them, \"O unbelieving generation, how long shall I be with you? How long shall I bear with you? Bring him to Me.\"",
      "links": "<a href='/AIV/40/17/17'>Matthew 17:17</a>",
      "comment": "Echoes Old Testament lament over unbelief. Jesus’ authority and patience contrast with the disciples’ limitations."
    },
    {
      "pk": 1935020,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 20,
      "text": "So they brought the boy to Him. When the spirit saw Him, immediately it threw the boy into convulsions. He fell on the ground and rolled about, foaming at the mouth.",
      "links": "",
      "comment": "Manifestation intensifies before Jesus; evil recoils at His divine presence."
    },
    {
      "pk": 1935021,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 21,
      "text": "Jesus asked his father, \"How long has this been happening to him?\" He replied, \"From childhood.\"",
      "links": "",
      "comment": "Jesus’ compassion seeks personal details, showing pastoral concern and healing through relationship."
    },
    {
      "pk": 1935022,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 22,
      "text": "\"It has often thrown him into fire and water to destroy him. But if You can do anything, have compassion on us and help us.\"",
      "links": "",
      "comment": "The plea for mercy and help reflects recognition of Jesus’ power and readiness to receive grace."
    },
    {
      "pk": 1935023,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 23,
      "text": "Jesus said to him, \"If you can! All things are possible for one who believes.\"",
      "links": "<a href='/AIV/40/17/20'>Matt. 17:20</a>; <a href='/AIV/41/10/27'>Mark 10:27</a>",
      "comment": "Jesus calls for faith, highlighting trust as the means for participating in divine action."
    },
    {
      "pk": 1935024,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 24,
      "text": "Immediately the father of the child cried out, \"I believe; help my unbelief!\"",
      "links": "",
      "comment": "Honest prayer—the tension between faith and doubt. Indicates the importance of grace alongside personal effort."
    },
    {
      "pk": 1935025,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 25,
      "text": "When Jesus saw that the crowd was coming together, He rebuked the unclean spirit, saying to it, \"You mute and deaf spirit, I command you, come out of him and never enter him again.\"",
      "links": "",
      "comment": "Direct command in His own authority, indicating Jesus’ singular divine power over evil."
    },
    {
      "pk": 1935026,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 26,
      "text": "And after crying out and throwing him into terrible convulsions, it came out. The boy was like a corpse, so that many said, \"He is dead.\"",
      "links": "",
      "comment": "The child's apparent death echoes resurrection motifs, showing Jesus can restore even from death."
    },
    {
      "pk": 1935027,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 27,
      "text": "But Jesus took him by the hand and lifted him up, and he stood.",
      "links": "",
      "comment": "Jesus physically raises the boy: a foreshadowing of resurrection and the healing ministry extended through His Church."
    },
    {
      "pk": 1935028,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 28,
      "text": "When He had gone indoors, His disciples asked Him privately, \"Why could we not cast it out?\"",
      "links": "",
      "comment": "Private instruction—Jesus’ disciples require formation and spiritual preparation to access divine grace."
    },
    {
      "pk": 1935029,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 29,
      "text": "He said to them, \"This kind cannot be driven out by anything except prayer.\"",
      "links": "<a href='/AIV/49/6/18'>Eph 6:18</a>",
      "comment": "Prayer is vital for spiritual power—points toward necessity of sacramental life and deep dependence on God."
    },
    {
      "pk": 1935030,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 30,
      "text": "They went on from there and passed through Galilee, and He did not want anyone to know it.",
      "links": "",
      "comment": "Jesus sometimes keeps His movements private to avoid premature acclaim and so He can teach His disciples more deeply."
    },
    {
      "pk": 1935031,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 31,
      "text": "For He was teaching His disciples, saying, \"The Son of Man will be delivered into the hands of men, and they will kill Him. And when He is killed, after three days He will rise.\"",
      "links": "<a href='/AIV/41/8/31'>Mark 8:31</a>; <a href='/AIV/23/53/10'>Isaiah 53:10</a>",
      "comment": "Repetition of passion prophecy. 'Three days' refers to resurrection, echoing Jonah’s sign. High christological claim: Jesus fulfills Isaiah’s suffering servant."
    },
    {
      "pk": 1935032,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 32,
      "text": "But they did not understand the saying and were afraid to ask Him.",
      "links": "",
      "comment": "Disciples' confusion reveals the depth of the mystery surrounding Christ’s mission and human limitations in grasping divine salvation."
    },
    {
      "pk": 1935033,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 33,
      "text": "They came to Capernaum. And when He was in the house, He asked them, \"What were you discussing on the way?\"",
      "links": "",
      "comment": "Jesus probes their hearts, seeking to purify their motives and to instruct about true greatness."
    },
    {
      "pk": 1935034,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 34,
      "text": "But they kept silent, for on the way they had argued with one another about who was the greatest.",
      "links": "",
      "comment": "Earthly ambition contrasts with Jesus’ teachings about humility and service."
    },
    {
      "pk": 1935035,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 35,
      "text": "He sat down, called the Twelve, and said to them, \"If anyone wants to be first, he must be last of all and servant of all.\"",
      "links": "<a href='/AIV/40/20/26-27'>Matt. 20:26-27</a>; <a href='/AIV/41/10/43-44'>Mark 10:43-44</a>",
      "comment": "Jesus redefines greatness as humble service. 'The Twelve' foreshadow apostolic leadership and servant authority."
    },
    {
      "pk": 1935036,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 36,
      "text": "He took a child and put him in the midst of them. And taking him in His arms, He said to them,",
      "links": "",
      "comment": "The child symbolizes innocence, humility, and receptivity. Jesus embraces the lowly, demonstrating the kingdom’s values."
    },
    {
      "pk": 1935037,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 37,
      "text": "\"Whoever receives one such child in My name receives Me. And whoever receives Me, receives not Me but Him who sent Me.\"",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>",
      "comment": "Identifies Himself with the child—a teaching on Christ’s presence in the least. Jesus mediates communion with the Father."
    },
    {
      "pk": 1935038,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 38,
      "text": "John said to Him, \"Teacher, we saw someone driving out demons in Your name, and we tried to stop him because he was not following us.\"",
      "links": "",
      "comment": "Early community boundaries. The power of Jesus’ name extends beyond visible membership, previewing broader Church mission."
    },
    {
      "pk": 1935039,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 39,
      "text": "But Jesus said, \"Do not stop him, for no one who does a mighty work in My name will soon speak evil of Me.\"",
      "links": "<a href='/AIV/40/12/30'>Matt. 12:30</a>",
      "comment": "Jesus welcomes all who genuinely work in His name, revealing the inclusiveness of His mission while retaining unity."
    },
    {
      "pk": 1935040,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 40,
      "text": "\"For whoever is not against us is for us.\"",
      "links": "<a href='/AIV/40/12/30'>Matt. 12:30</a>; <a href='/AIV/42/9/50'>Luke 9:50</a>",
      "comment": "Encourages generosity of spirit within the boundaries of faith. Suggests that unity with Christ is central."
    },
    {
      "pk": 1935041,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 41,
      "text": "\"For truly I say to you, whoever gives you a cup of water because you belong to Christ will certainly not lose his reward.\"",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>",
      "comment": "Shows the value of even the smallest acts of charity for Christ’s sake—a spiritual work that builds up the body of believers."
    },
    {
      "pk": 1935042,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 42,
      "text": "\"Whoever causes one of these little ones who believe in Me to stumble, it would be better for him if a great millstone were hung around his neck and he were thrown into the sea.\"",
      "links": "<a href='/AIV/40/18/6'>Matt. 18:6</a>",
      "comment": "Severe warning against scandal—protection of the vulnerable is part of the witness and mission of the Church."
    },
    {
      "pk": 1935043,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 43,
      "text": "\"If your hand causes you to sin, cut it off. It is better for you to enter life crippled than with two hands to go into hell, to the fire that never goes out.\"",
      "links": "<a href='/AIV/40/5/30'>Matt. 5:30</a>; <a href='/AIV/40/18/8'>Matt. 18:8</a>",
      "comment": "Radical call to holiness. Hell is depicted as real and eternal. Note: Some manuscripts omit verses 44 and 46; see comments below."
    },
    {
      "pk": 1935044,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 44,
      "text": "[where their worm does not die, and the fire is not quenched.]",
      "links": "<a href='/AIV/23/66/24'>Isaiah 66:24</a>",
      "comment": "Text in brackets—appears in some manuscripts, echoing Isaiah 66:24, imagery of unending punishment. Modern critical texts often omit but traditionally included."
    },
    {
      "pk": 1935045,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 45,
      "text": "\"And if your foot causes you to sin, cut it off. It is better for you to enter life lame than with two feet to be thrown into hell.\"",
      "links": "<a href='/AIV/40/18/8'>Matt. 18:8</a>",
      "comment": "Another hyperbolic instruction—real spiritual danger warrants drastic spiritual response."
    },
    {
      "pk": 1935046,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 46,
      "text": "[where their worm does not die, and the fire is not quenched.]",
      "links": "<a href='/AIV/23/66/24'>Isaiah 66:24</a>",
      "comment": "See verse 44 for note about manuscript inclusion."
    },
    {
      "pk": 1935047,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 47,
      "text": "\"And if your eye causes you to sin, pluck it out. It is better for you to enter the kingdom of God with one eye than with two eyes to be thrown into hell,\"",
      "links": "<a href='/AIV/40/5/29'>Matt. 5:29</a>",
      "comment": "The kingdom of God is contrasted with eternal separation (hell); radical call to purity and sanctification."
    },
    {
      "pk": 1935048,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 48,
      "text": "\"where their worm does not die, and the fire is not quenched.\"",
      "links": "<a href='/AIV/23/66/24'>Isaiah 66:24</a>",
      "comment": "Direct quotation from Isaiah—the perpetual consequences of rejection of God."
    },
    {
      "pk": 1935049,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 49,
      "text": "\"For everyone will be salted with fire.\"",
      "links": "<a href='/AIV/3/2/13'>Lev. 2:13</a>; <a href='/AIV/40/5/13'>Matt. 5:13</a>",
      "comment": "Purification through trial—salt as a symbol of perpetuity and covenant (Leviticus). Fire represents purgation and preparation for holiness."
    },
    {
      "pk": 1935050,
      "translation": "AIV",
      "book": 2,
      "chapter": 9,
      "verse": 50,
      "text": "\"Salt is good, but if the salt loses its flavor, with what will you restore it? Have salt in yourselves, and be at peace with one another.\"",
      "links": "<a href='/AIV/40/5/13'>Matt. 5:13</a>; <a href='/AIV/51/4/6'>Col. 4:6</a>",
      "comment": "Salt as a symbol of spiritual life and integrity—Christians are called to maintain faithfulness and peace. Inner transformation leads to communal harmony, hinting at sacramental and communal realities in Christian life."
    }
  ],
  "translatedAt": "2025-12-23T02:31:30.611Z"
}