{
  "book": 48,
  "bookName": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 9,
  "verses": [
    {
      "pk": 48009001,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 1,
      "text": "And he said to them, \"Truly I tell you, there are some standing here who will not taste death until they see the kingdom of God come with power.\"",
      "links": "<a href='/AIV/40/16/28'>Matt. 16:28</a>; <a href='/AIV/42/9/27'>Luke 9:27</a>",
      "comment": "Jesus here foretells a manifestation of the kingdom in power within the lifetime of some present. Traditionally interpreted as fulfilled in events such as the Transfiguration, Pentecost, or the Resurrection. Implies an established visible kingdom—hinting at the ongoing visible nature of Christ’s Church."
    },
    {
      "pk": 48009002,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 2,
      "text": "After six days, Jesus took Peter, James, and John, and led them up a high mountain by themselves. And he was transfigured before them.",
      "links": "<a href='/AIV/40/17/1'>Matt. 17:1</a>; <a href='/AIV/42/9/28'>Luke 9:28</a>",
      "comment": "The Transfiguration reveals Jesus’ divine glory, affirming his identity as more than a prophet. The presence of Peter, James, and John underscores apostolic witness."
    },
    {
      "pk": 48009003,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 3,
      "text": "His clothes became dazzling, intensely white, as no one on earth could bleach them.",
      "links": "<a href='/AIV/66/1/14'>Rev. 1:14</a>; <a href='/AIV/66/7/14'>Rev. 7:14</a>",
      "comment": "The supernatural whiteness signifies divine purity and glory. This matches Old Testament theophanies, emphasizing the divinity of Jesus."
    },
    {
      "pk": 48009004,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 4,
      "text": "And Elijah appeared to them with Moses, and they were talking with Jesus.",
      "links": "<a href='/AIV/11/2/11'>2 Kings 2:11</a>; <a href='/AIV/5/34/5'>Deut. 34:5</a>",
      "comment": "Moses and Elijah represent the Law and the Prophets, testifying to Jesus as their fulfillment (<a href='/AIV/40/5/17'>Matt. 5:17</a>). Their appearance confirms Jesus’ authority and continuity with the Old Testament."
    },
    {
      "pk": 48009005,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 5,
      "text": "Peter said to Jesus, \"Rabbi, it is good for us to be here. Let us make three tents—one for you, one for Moses, and one for Elijah.\"",
      "links": "<a href='/AIV/40/17/4'>Matt. 17:4</a>; <a href='/AIV/42/9/33'>Luke 9:33</a>",
      "comment": "Peter’s suggestion shows reverence, but he places Jesus on the same level as Moses and Elijah, misunderstanding Jesus’ unique status."
    },
    {
      "pk": 48009006,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 6,
      "text": "He did not know what to say, for they were greatly afraid.",
      "links": "",
      "comment": "The apostles’ fear demonstrates a common biblical reaction to divine manifestations—see <a href='/AIV/02/3/6'>Ex. 3:6</a>; <a href='/AIV/07/6/22'>Judg. 6:22</a>."
    },
    {
      "pk": 48009007,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 7,
      "text": "Then a cloud overshadowed them, and a voice came from the cloud: \"This is my beloved Son; listen to him!\"",
      "links": "<a href='/AIV/02/40/34'>Ex. 40:34</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "The Father affirms Jesus’ divine Sonship. The command to ‘listen to him’ reorients authority from the Law and Prophets to Jesus. This foreshadows the role of ongoing magisterial teaching in the Church."
    },
    {
      "pk": 48009008,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 8,
      "text": "Suddenly, when they looked around, they no longer saw anyone except Jesus alone with them.",
      "links": "",
      "comment": "Moses and Elijah disappear, emphasizing Jesus as the sole mediator and fulfillment of both Law and Prophets (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 48009009,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 9,
      "text": "As they were coming down the mountain, Jesus ordered them not to tell anyone what they had seen until the Son of Man had risen from the dead.",
      "links": "<a href='/AIV/40/8/4'>Matt. 8:4</a>; <a href='/AIV/66/1/18'>Rev. 1:18</a>",
      "comment": "Jesus controls the revelation of his identity, and his Resurrection is presented as a key validation of his claims."
    },
    {
      "pk": 48009010,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 10,
      "text": "So they kept the matter to themselves, discussing what 'rising from the dead' might mean.",
      "links": "",
      "comment": "Despite Jesus’ clear predictions, the disciples do not yet understand the nature of the Resurrection—a central mystery later clarified by apostolic teaching."
    },
    {
      "pk": 48009011,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 11,
      "text": "Then they asked him, \"Why do the scribes say that Elijah must come first?\"",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>",
      "comment": "The disciples reference prophecy concerning Elijah's return, showing expectation of scriptural fulfillment."
    },
    {
      "pk": 48009012,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 12,
      "text": "And he said to them, \"Elijah truly does come first to restore all things. Yet how is it written of the Son of Man that he should suffer many things and be treated with contempt?\"",
      "links": "<a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "Jesus connects the expectation of Elijah with the suffering Messiah. The Son of Man’s suffering fulfills prophecy, highlighting the redemptive plan."
    },
    {
      "pk": 48009013,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 13,
      "text": "But I tell you that Elijah has come, and they did to him whatever they pleased, just as it is written of him.\"",
      "links": "<a href='/AIV/40/11/14'>Matt. 11:14</a>; <a href='/AIV/40/17/12'>Matt. 17:12-13</a>",
      "comment": "Elijah refers to John the Baptist. His suffering foreshadows Jesus’ own rejection, showing prophetic typology."
    },
    {
      "pk": 48009014,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 14,
      "text": "When they came to the other disciples, they saw a large crowd around them, and scribes arguing with them.",
      "links": "",
      "comment": "The scene shifts to the public ministry and opposition from religious leaders."
    },
    {
      "pk": 48009015,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 15,
      "text": "As soon as the crowd saw him, they were greatly amazed and ran up to greet him.",
      "links": "",
      "comment": "Jesus' mere presence inspires awe, indicating his sanctity and authority."
    },
    {
      "pk": 48009016,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 16,
      "text": "And he asked them, \"What are you arguing about with them?\"",
      "links": "",
      "comment": "Jesus promptly intervenes in disputes, establishing order and revealing truth."
    },
    {
      "pk": 48009017,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 17,
      "text": "Someone from the crowd answered him, \"Teacher, I brought you my son, who has a spirit that makes him mute.",
      "links": "",
      "comment": "A display of faith by coming to Jesus with a suffering son, recognizing Jesus as the healer."
    },
    {
      "pk": 48009018,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 18,
      "text": "Whenever it seizes him, it throws him down, and he foams at the mouth, grinds his teeth, and becomes rigid. I asked your disciples to cast it out, but they were not able.\"",
      "links": "",
      "comment": "The disciples’ inability highlights the need for deeper faith and reliance on Christ’s authority."
    },
    {
      "pk": 48009019,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 19,
      "text": "He answered them, \"O faithless generation, how long am I to be with you? How long am I to bear with you? Bring him to me.\"",
      "links": "<a href='/AIV/40/17/17'>Matt. 17:17</a>",
      "comment": "Jesus’ rebuke emphasizes the essential role of faith and trust in his presence among his followers."
    },
    {
      "pk": 48009020,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 20,
      "text": "And they brought the boy to him. When the spirit saw Jesus, it immediately convulsed the boy, and he fell on the ground, rolling about and foaming at the mouth.",
      "links": "",
      "comment": "The evil spirit reacts in fear at the presence of Christ, recognizing divine authority."
    },
    {
      "pk": 48009021,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 21,
      "text": "Jesus asked his father, \"How long has this been happening to him?\" He said, \"From childhood.",
      "links": "",
      "comment": "Jesus’ question shows compassion and personal concern, establishing a relationship before acting."
    },
    {
      "pk": 48009022,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 22,
      "text": "And it has often cast him into fire and into water, to destroy him. But if you can do anything, have compassion on us and help us.\"",
      "links": "",
      "comment": "The plea, ‘if you can,’ reflects imperfect faith seeking mercy and compassion."
    },
    {
      "pk": 48009023,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 23,
      "text": "Then Jesus said to him, \"If you can! All things are possible for one who believes.\"",
      "links": "<a href='/AIV/40/17/20'>Matt. 17:20</a>; <a href='/AIV/50/4/13'>Phil. 4:13</a>",
      "comment": "Faith is presented as the means by which God’s power operates. Jesus encourages full trust in his divine ability."
    },
    {
      "pk": 48009024,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 24,
      "text": "Immediately the boy’s father cried out and said, \"I believe; help my unbelief!\"",
      "links": "",
      "comment": "This honest prayer expresses the ongoing journey of faith, combining both belief and a plea for grace to strengthen it. Highlights the need for God’s help in growth in faith."
    },
    {
      "pk": 48009025,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 25,
      "text": "When Jesus saw that the crowd was gathering quickly, he rebuked the unclean spirit, saying, \"You mute and deaf spirit, I command you—come out of him and never enter him again!\"",
      "links": "",
      "comment": "Jesus directly commands the demon with divine authority. Such exorcisms underscore Jesus’ unique power over evil—something later perpetuated through apostolic ministry."
    },
    {
      "pk": 48009026,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 26,
      "text": "After crying out and convulsing him terribly, it came out, and the boy was like a corpse, so that most of them said, \"He is dead.\"",
      "links": "",
      "comment": "The healing is so dramatic that onlookers believe the boy died—prefiguring death and resurrection themes."
    },
    {
      "pk": 48009027,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 27,
      "text": "But Jesus took him by the hand and raised him up, and he arose.",
      "links": "<a href='/AIV/40/9/25'>Matt. 9:25</a>",
      "comment": "Physical resurrection imagery; Jesus gives life, foreshadowing his own Resurrection and the power of the sacraments."
    },
    {
      "pk": 48009028,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 28,
      "text": "And when he had entered the house, his disciples asked him privately, \"Why could we not cast it out?\"",
      "links": "",
      "comment": "The disciples seek understanding—pointing to an ongoing journey of learning and the necessity of spiritual formation."
    },
    {
      "pk": 48009029,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 29,
      "text": "He said to them, \"This kind cannot be driven out by anything except prayer.\"",
      "links": "<a href='/AIV/40/17/21'>Matt. 17:21</a>",
      "comment": "Some manuscripts add 'and fasting.' Discipline in prayer is essential for spiritual authority—a tradition seen throughout Church history and sacramental living."
    },
    {
      "pk": 48009030,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 30,
      "text": "They went on from there and passed through Galilee. He did not want anyone to know,",
      "links": "",
      "comment": "Jesus moves discreetly to allow more direct teaching for his disciples, emphasizing the importance of private instruction."
    },
    {
      "pk": 48009031,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 31,
      "text": "for he was teaching his disciples, saying to them, \"The Son of Man is going to be delivered into the hands of men, and they will kill him. And when he is killed, after three days he will rise.\"",
      "links": "<a href='/AIV/40/16/21'>Matt. 16:21</a>; <a href='/AIV/28/6/2'>Hos. 6:2</a>",
      "comment": "Jesus’ explicit prophecy connects suffering, death, and resurrection. The repeated prediction stresses the necessity and centrality of these truths to apostolic teaching."
    },
    {
      "pk": 48009032,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 32,
      "text": "But they did not understand this saying, and were afraid to ask him.",
      "links": "",
      "comment": "Apostles’ lack of understanding illustrates a developing faith—pointing to the need for guidance and ongoing revelation through the teaching office."
    },
    {
      "pk": 48009033,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 33,
      "text": "They came to Capernaum. And when he was in the house, he asked them, \"What were you discussing on the way?\"",
      "links": "",
      "comment": "Jesus discerns and teaches about the thoughts of his disciples—a pattern that continues in apostolic ministry."
    },
    {
      "pk": 48009034,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 34,
      "text": "But they kept silent, for on the way they had argued with one another about who was the greatest.",
      "links": "",
      "comment": "Even among the apostles, ambition existed. Their silence demonstrates the need for humility and correction from Christ."
    },
    {
      "pk": 48009035,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 35,
      "text": "And he sat down and called the twelve. He said to them, \"If anyone would be first, he must be last of all and servant of all.\"",
      "links": "<a href='/AIV/40/20/26'>Matt. 20:26</a>",
      "comment": "Jesus proposes a new ordering for leadership—service, not domination, is the hallmark of those who lead in his Church. This is foundational for apostolic succession."
    },
    {
      "pk": 48009036,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 36,
      "text": "He took a child and set him in the midst of them. Taking him in his arms, he said to them,",
      "links": "<a href='/AIV/40/18/2'>Matt. 18:2</a>",
      "comment": "The child becomes a living parable of the humble, teachable disciple."
    },
    {
      "pk": 48009037,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 37,
      "text": "\"Whoever receives one such child in my name receives me, and whoever receives me, receives not just me but him who sent me.\"",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>; <a href='/AIV/43/13/20'>John 13:20</a>",
      "comment": "Receiving the humble is equivalent to receiving Jesus and the Father, showing a real unity with Christ and his messengers."
    },
    {
      "pk": 48009038,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 38,
      "text": "John said to him, \"Teacher, we saw someone casting out demons in your name, and we tried to stop him because he was not following us.\"",
      "links": "",
      "comment": "The disciples’ concern with authority reflects questions of legitimate ministry and unity."
    },
    {
      "pk": 48009039,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 39,
      "text": "But Jesus said, \"Do not stop him. For no one who does a mighty work in my name will be able soon afterward to speak evil of me.",
      "links": "",
      "comment": "Jesus broadens the scope of his work, indicating that legitimate ministry can exist outside direct apostolic company, but unity with him remains essential."
    },
    {
      "pk": 48009040,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 40,
      "text": "For the one who is not against us is for us.",
      "links": "<a href='/AIV/42/9/50'>Luke 9:50</a>",
      "comment": "This principle underlines the importance of unity in faith under Christ, a hallmark of the visible Church throughout history."
    },
    {
      "pk": 48009041,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 41,
      "text": "For truly I tell you, whoever gives you a cup of water to drink because you belong to Christ will by no means lose his reward.",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>",
      "comment": "Even small acts done for Christ’s disciples have eternal value—showing the reward tied to serving those commissioned by Christ."
    },
    {
      "pk": 48009042,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 42,
      "text": "\"Whoever causes one of these little ones who believe in me to stumble, it would be better for him if a great millstone were hung around his neck and he were thrown into the sea.",
      "links": "<a href='/AIV/40/18/6'>Matt. 18:6</a>",
      "comment": "Severe warning against leading believers into sin, underscoring the sanctity and seriousness of membership in Christ’s community."
    },
    {
      "pk": 48009043,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 43,
      "text": "If your hand causes you to sin, cut it off. It is better for you to enter life maimed than with two hands to go into hell, into the unquenchable fire.",
      "links": "<a href='/AIV/40/5/29'>Matt. 5:29-30</a>",
      "comment": "Jesus teaches the seriousness of sin and reality of hell, calling for radical choices to avoid sin."
    },
    {
      "pk": 48009044,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 44,
      "text": "[Where their worm does not die and the fire is not quenched.]",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>",
      "comment": "This verse is absent in some manuscripts but traditionally included as a reference to unending punishment."
    },
    {
      "pk": 48009045,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 45,
      "text": "And if your foot causes you to sin, cut it off. It is better for you to enter life lame than with two feet to be thrown into hell.",
      "links": "<a href='/AIV/40/18/8'>Matt. 18:8</a>",
      "comment": "Repetition underscores the need for personal holiness and sacrificial separation from sin."
    },
    {
      "pk": 48009046,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 46,
      "text": "[Where their worm does not die and the fire is not quenched.]",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>",
      "comment": "Also not found in some early manuscripts but parallels the warning of verse 44."
    },
    {
      "pk": 48009047,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 47,
      "text": "And if your eye causes you to sin, tear it out. It is better for you to enter the kingdom of God with one eye than with two eyes to be thrown into hell,",
      "links": "",
      "comment": "Jesus again calls for radical transformation of life over the comforts of worldly attachment and sin."
    },
    {
      "pk": 48009048,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 48,
      "text": "where their worm does not die and the fire is not quenched.",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>",
      "comment": "An explicit reference to eternal judgment, reminding us of the real consequences of spiritual choices."
    },
    {
      "pk": 48009049,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 49,
      "text": "For everyone will be salted with fire.",
      "links": "<a href='/AIV/03/2/13'>Lev. 2:13</a>; <a href='/AIV/40/5/13'>Matt. 5:13</a>",
      "comment": "Fire symbolizes purification and judgment. 'Salt' was used in sacrifices—pointing to the sanctifying trials and spiritual sacrifices offered by believers."
    },
    {
      "pk": 48009050,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 50,
      "text": "Salt is good, but if salt has lost its flavor, how will you make it salty again? Have salt in yourselves, and be at peace with one another.\"",
      "links": "<a href='/AIV/40/5/13'>Matt. 5:13</a>; <a href='/AIV/51/4/6'>Col. 4:6</a>",
      "comment": "True disciples preserve spiritual integrity (“saltiness”) and foster unity and peace—key marks of Christ’s one visible Church."
    }
  ],
  "translatedAt": "2025-12-24T10:28:47.075Z"
}