{
  "book": "Habakkuk",
  "bookAbbreviation": "Hab",
  "chapter": 2,
  "verses": [
    {
      "pk": 2001001,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 1,
      "text": "I will stand at my watchpost and station myself on the tower, and I will keep watch to see what He will say to me and what answer I will give to my complaint.",
      "links": "<a href='/AIV/34/1/1'>Nah. 1:1</a>; <a href='/AIV/26/3/17'>Ezek. 3:17</a>",
      "comment": "The prophet adopts a posture of expectant waiting for God's reply. This verse sets the tone for a humble, listening faith, contrasted with presumption (see also Ezekiel 3:17)."
    },
    {
      "pk": 2001002,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 2,
      "text": "And the LORD answered me: 'Write the vision; make it plain on tablets, so he may run who reads it.'",
      "links": "<a href='/AIV/23/30/8'>Isa. 30:8</a>; <a href='/AIV/66/1/11'>Rev. 1:11</a>",
      "comment": "God commands Habakkuk to make the message clear and enduring. Emphasis on preserving revelation for others anticipates the importance of authoritative teaching and tradition (cf. Isa. 30:8, Rev. 1:11)."
    },
    {
      "pk": 2001003,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 3,
      "text": "For the vision is yet for the appointed time; it speaks of the end and will not lie. Even if it delays, wait for it; for it will surely come—it will not be late.",
      "links": "<a href='/AIV/58/10/37'>Heb. 10:37</a>; <a href='/AIV/23/46/13'>Isa. 46:13</a>",
      "comment": "References to patience and the certainty of God's promise echo Hebrews 10:37. This foreshadows New Testament teachings about waiting for the fulfillment of God's plan."
    },
    {
      "pk": 2001004,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 4,
      "text": "Behold, his soul is proud and not upright within him, but the righteous will live by his faith.",
      "links": "<a href='/AIV/45/1/17'>Rom. 1:17</a>; <a href='/AIV/48/3/11'>Gal. 3:11</a>; <a href='/AIV/58/10/38'>Heb. 10:38</a>",
      "comment": "This verse is foundational for faith and justification, cited throughout the New Testament. 'The righteous will live by his faith' points to the spiritual life rooted in trusting God, deepened further in the life of Christ (see Rom. 1:17, Heb. 10:38)."
    },
    {
      "pk": 2001005,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 5,
      "text": "Indeed, wine betrays him; he is arrogant and never at rest. He enlarges his desire like Sheol and is as death and cannot be satisfied. He gathers for himself all nations and collects all peoples as his own.",
      "links": "<a href='/AIV/20/27/20'>Prov. 27:20</a>; <a href='/AIV/23/5/14'>Isa. 5:14</a>",
      "comment": "The insatiable pride of the oppressor is likened to death’s appetite. The spiritual warning is against never-ending pride and covetousness, setting up the contrasts explored in the coming 'woes.'"
    },
    {
      "pk": 2001006,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 6,
      "text": "Will not all these take up a taunt against him, with mocking riddles, and say: 'Woe to him who heaps up what is not his—for how long?—and loads himself with pledges!'",
      "links": "<a href='/AIV/20/20/16'>Prov. 20:16</a>; <a href='/AIV/28/2/6'>Hos. 2:6</a>",
      "comment": "The oppressor will ultimately be mocked and judged. Riddles and taunts foresee the reversal of fortunes reminiscent of the wisdom literature."
    },
    {
      "pk": 2001007,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 7,
      "text": "Will not your debtors suddenly arise, and those awake who will make you tremble? Then you will become their prey.",
      "links": "<a href='/AIV/23/47/11'>Isa. 47:11</a>",
      "comment": "Divine justice is now reversed upon the proud. The punishment is fitting: those oppressed turn on the oppressor."
    },
    {
      "pk": 2001008,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 8,
      "text": "Because you have plundered many nations, all the remnant of the peoples shall plunder you, for the blood of man and violence to the land, to the city and all who dwell in it.",
      "links": "<a href='/AIV/01/9/6'>Gen. 9:6</a>; <a href='/AIV/23/33/1'>Isa. 33:1</a>",
      "comment": "The moral order demands justice for bloodshed and violence. This supports the theme that those who destroy others will themselves be destroyed."
    },
    {
      "pk": 2001009,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 9,
      "text": "Woe to him who gets evil gain for his house, to set his nest on high, to be safe from the reach of harm!",
      "links": "<a href='/AIV/24/22/13'>Jer. 22:13</a>",
      "comment": "Evil gain brings no lasting security. This verse hints at the illusion of self-sufficiency apart from God, a theme seen from Babel onward."
    },
    {
      "pk": 2001010,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 10,
      "text": "You have plotted shame for your house by cutting off many peoples; you have sinned against your soul.",
      "links": "<a href='/AIV/11/8/31'>1 Kgs. 8:31</a>; <a href='/AIV/24/7/6'>Jer. 7:6</a>",
      "comment": "Personal sin affects even entire households; communal responsibility is suggested here, underlining the importance of integral righteousness."
    },
    {
      "pk": 2001011,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 11,
      "text": "For the stone will cry out from the wall, and the beam from the woodwork will answer it.",
      "links": "<a href='/AIV/24/51/58'>Jer. 51:58</a>; <a href='/AIV/42/19/40'>Luke 19:40</a>",
      "comment": "Even inanimate objects bear witness against evil. Spiritual reality undergirds visible reality, foreshadowing Christ’s saying in Luke 19:40."
    },
    {
      "pk": 2001012,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 12,
      "text": "Woe to him who builds a city with blood and founds a town on injustice!",
      "links": "<a href='/AIV/33/3/10'>Mic. 3:10</a>",
      "comment": "Condemnation of oppressive societies. Emphasizes the need for justice as a foundational principle, which is taken up by Jesus in his teachings."
    },
    {
      "pk": 2001013,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 13,
      "text": "Behold, is it not from the LORD of Armies that peoples labor only for fire, and nations weary themselves for nothing?",
      "links": "<a href='/AIV/23/49/4'>Isa. 49:4</a>; <a href='/AIV/24/51/58'>Jer. 51:58</a>",
      "comment": "Human achievement apart from God is ultimately futile—anticipates the theme of eternal purpose, as realized in Christ."
    },
    {
      "pk": 2001014,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 14,
      "text": "For the earth will be filled with the knowledge of the glory of the LORD, as the waters cover the sea.",
      "links": "<a href='/AIV/23/11/9'>Isa. 11:9</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Prophetic hope for a universal knowledge of God. Seen as a promise fulfilled in Christ and the spread of the faith to all nations."
    },
    {
      "pk": 2001015,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 15,
      "text": "Woe to him who makes his neighbors drink, mixing your wrath and even making them drunk, in order to gaze on their nakedness!",
      "links": "<a href='/AIV/01/9/21'>Gen. 9:21</a>; <a href='/AIV/25/4/21'>Lam. 4:21</a>",
      "comment": "The exploitation pipeline: coercing others into shame. Alludes symbolically to spiritual deception and personal sin affecting others."
    },
    {
      "pk": 2001016,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 16,
      "text": "You will have your fill of shame instead of glory. Drink, yes, and expose yourself! The cup in the LORD's right hand will come around to you, and disgrace will cover your glory.",
      "links": "<a href='/AIV/24/25/15-16'>Jer. 25:15-16</a>",
      "comment": "The 'cup' symbolizes judgment—a theme deepened by Christ, who refers to his suffering as drinking the cup (see Matthew 26:39)."
    },
    {
      "pk": 2001017,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 17,
      "text": "For the violence done to Lebanon will overwhelm you, and the destruction of beasts will terrify you, because of the blood of man and violence to the land, to the city and all who dwell in it.",
      "links": "<a href='/AIV/23/14/8'>Isa. 14:8</a>; <a href='/AIV/28/4/3'>Hos. 4:3</a>",
      "comment": "Judgment is total, including ecological harm. Implies all creation is under God’s concern, echoing New Testament teaching on cosmic redemption (see Romans 8:20–22)."
    },
    {
      "pk": 2001018,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 18,
      "text": "What profit is an idol, when its maker has shaped it—a carved image, a teacher of lies? For its maker trusts in his own creation when he makes speechless idols.",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Idolatry is folly. The truth of God stands against all the works of men’s hands."
    },
    {
      "pk": 2001019,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 19,
      "text": "Woe to him who says to a piece of wood, 'Awake!' To a silent stone, 'Arise!' Can this teach? Behold, it is overlaid with gold and silver, but there is no breath in it at all.",
      "links": "<a href='/AIV/23/46/6-7'>Isa. 46:6-7</a>",
      "comment": "Only God is living and worthy of worship. True worship is spiritual and not to be mixed with emptiness."
    },
    {
      "pk": 2001020,
      "translation": "AIV",
      "book": 35,
      "chapter": 2,
      "verse": 20,
      "text": "But the LORD is in His holy temple; let all the earth be silent before Him.",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>; <a href='/AIV/66/8/1'>Rev. 8:1</a>",
      "comment": "A call to contemplative silence before God’s majesty. This attitude of awe and reverence anticipates the posture of worship in the presence of the divine."
    }
  ],
  "translatedAt": "2025-12-23T07:34:31.774Z"
}