{
  "book": "Habakkuk",
  "bookAbbreviation": "Hab",
  "chapter": 1,
  "verses": [
    {
      "pk": 1933001,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 1,
      "text": "The oracle which Habakkuk the prophet saw.",
      "links": "<a href='/AIV/23/1/1'>Isa. 1:1</a>; <a href='/AIV/24/23/16'>Jer. 23:16</a>",
      "comment": "An 'oracle' or 'burden' refers to a divine revelation given to a prophet. Note how the prophets often receive visions or messages to be delivered to God's people, emphasizing the unbroken tradition of prophetic guidance."
    },
    {
      "pk": 1933002,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 2,
      "text": "O LORD, how long shall I cry for help, and you do not hear? I cry out to you, 'Violence!' but you do not save.",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1-2</a>; <a href='/AIV/24/14/9'>Jer. 14:9</a>; <a href='/AIV/19/22/2'>Ps. 22:2</a>",
      "comment": "Habakkuk's lament expresses frustration that God seems silent in the face of injustice, echoing the heartfelt prayers of the faithful throughout scripture. It reflects a deep sense of trust in God's justice, even in times of apparent delay."
    },
    {
      "pk": 1933003,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 3,
      "text": "Why do you make me look upon wrongdoing and trouble? Destruction and violence are before me; strife and contention arise.",
      "links": "<a href='/AIV/19/55/9'>Ps. 55:9-11</a>; <a href='/AIV/23/59/7'>Isa. 59:7-8</a>",
      "comment": "The prophet addresses God's sovereignty, questioning why evil persists. The language mirrors the Psalms, reminding us of the spiritual importance of perseverance in prayer."
    },
    {
      "pk": 1933004,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 4,
      "text": "Therefore the law is paralyzed, and justice never goes forth. For the wicked hem in the righteous; so justice goes out perverted.",
      "links": "<a href='/AIV/19/82/2'>Ps. 82:2-4</a>; <a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "Describes a time when moral order collapses and God's law is ignored, which sets the stage for the prophet's call for divine intervention—much like the prophetic tradition enduring through trials."
    },
    {
      "pk": 1933005,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 5,
      "text": "Look among the nations and see, be amazed and astounded. For I am doing a work in your days that you would not believe, even if told.",
      "links": "<a href='/AIV/44/13/41'>Acts 13:41</a>; <a href='/AIV/23/29/14'>Isa. 29:14</a>",
      "comment": "God promises a surprising intervention, which is later quoted in the New Testament (Acts 13:41) with a messianic application, signifying the power of divine providence working beyond human understanding."
    },
    {
      "pk": 1933006,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 6,
      "text": "For behold, I am raising up the Chaldeans, that bitter and hasty nation, who march through the earth to seize dwellings not their own.",
      "links": "<a href='/AIV/24/5/15'>Jer. 5:15</a>; <a href='/AIV/23/39/3'>Isa. 39:3-6</a>",
      "comment": "God’s sovereignty is shown in using even foreign powers to accomplish His purposes. This demonstrates how all history is subject to divine governance, with implications for both punishment and restoration."
    },
    {
      "pk": 1933007,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 7,
      "text": "They are dreadful and terrifying; their justice and dignity proceed from themselves.",
      "links": "<a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "The Chaldeans are described as self-sufficient and arrogant, highlighting the clash between human pride and divine justice—an ever-present theme in scripture, pointing to the need for humility and true justice."
    },
    {
      "pk": 1933008,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 8,
      "text": "Their horses are swifter than leopards, fiercer than wolves at night. Their horsemen press on; their horsemen come from afar. They fly like an eagle swooping to devour.",
      "links": "<a href='/AIV/24/4/13'>Jer. 4:13</a>; <a href='/AIV/05/28/49'>Deut. 28:49</a>",
      "comment": "Descriptive imagery underscores the overwhelming power of the invaders; notably, eagles often symbolize swiftness and judgment throughout both Old and New Testament."
    },
    {
      "pk": 1933009,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 9,
      "text": "They all come for violence; all their faces move forward. They gather captives like sand.",
      "links": "<a href='/AIV/07/7/12'>Judg. 7:12</a>; <a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "The Chaldeans are relentless, like the sands of the sea—an image used elsewhere for vast multitudes, also echoing God’s promise to Abraham of his descendants (Gen. 22:17), but here used in the context of judgment."
    },
    {
      "pk": 1933010,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 10,
      "text": "They scoff at kings, and rulers are a joke to them. They laugh at every fortress, for they pile up earth and take it.",
      "links": "<a href='/AIV/23/37/23'>Isa. 37:23-24</a>; <a href='/AIV/24/32/24'>Jer. 32:24'>",
      "comment": "Their scorn for earthly authority points to the limits of human rule compared to God’s ultimate sovereignty; fortresses fall easily before divine will applied through human agents."
    },
    {
      "pk": 1933011,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 11,
      "text": "Then they sweep by like wind and pass on; they are guilty—those whose power is their god.",
      "links": "<a href='/AIV/20/21/30'>Prov. 21:30</a>; <a href='/AIV/19/52/7'>Ps. 52:7</a>",
      "comment": "Divine judgment falls on those who substitute worldly power for true worship. The subtle parallel with later New Testament warnings about idolatry and misplaced trust stands out (Col. 3:5)."
    },
    {
      "pk": 1933012,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 12,
      "text": "Are you not from everlasting, O LORD, my God, my Holy One? We shall not die. O LORD, you have appointed them to execute judgment; O Rock, you have established them for correction.",
      "links": "<a href='/AIV/05/32/4'>Deut. 32:4</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Habakkuk affirms God's eternality and the belief that His people will not be utterly destroyed. Notice the title ‘Rock’—a reference to God as both protector and judge. The language also points forward to Christ as the awaited Redeemer (see 1 Cor. 10:4)."
    },
    {
      "pk": 1933013,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 13,
      "text": "Your eyes are too pure to look on evil, and you cannot tolerate wrong. Why do you look on those who deal treacherously and stay silent when the wicked swallow up those more righteous than themselves?",
      "links": "<a href='/AIV/19/5/4'>Ps. 5:4-6</a>; <a href='/AIV/19/11/4'>Ps. 11:4'</a>",
      "comment": "Habakkuk highlights God’s holiness and seeming silence amid injustice. This tension runs through biblical history, leading to ultimate vindication in Christ’s atoning sacrifice (Rom. 3:25-26)."
    },
    {
      "pk": 1933014,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 14,
      "text": "You make mankind like the fish of the sea, like crawling things that have no ruler.",
      "links": "<a href='/AIV/01/1/26'>Gen. 1:26</a>; <a href='/AIV/19/8/4'>Ps. 8:4-8</a>",
      "comment": "Here, people are pictured as helpless and easily caught, yet God remains their ultimate ruler, linking mankind’s plight to the larger story of humanity’s need for rescue and order."
    },
    {
      "pk": 1933015,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 15,
      "text": "He brings all of them up with a hook, he drags them out with his net, he gathers them in his dragnet. So he rejoices and is glad.",
      "links": "<a href='/AIV/26/32/3'>Ezek. 32:3</a>; <a href='/AIV/23/19/8'>Isa. 19:8</a>",
      "comment": "The oppressor’s joy at capturing others contrasts with God’s own joy in redemption and salvation. These metaphors reappear in Jesus’ call to become ‘fishers of men’ (see Matt. 4:19), transforming the imagery to speak of grace."
    },
    {
      "pk": 1933016,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 16,
      "text": "Therefore he sacrifices to his net and makes offerings to his dragnet; for by them he lives in luxury, and his food is rich.",
      "links": "<a href='/AIV/19/106/37'>Ps. 106:37-38</a>; <a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "Idolatry is subtly critiqued here—the oppressors worship the means of their success. This challenge to false worship foreshadows the fullness of true worship spoken of by Jesus in John 4:23-24."
    },
    {
      "pk": 1933017,
      "translation": "AIV",
      "book": 35,
      "chapter": 1,
      "verse": 17,
      "text": "Is he then to keep emptying his net, and mercilessly killing nations forever?",
      "links": "<a href='/AIV/19/74/10'>Ps. 74:10-11</a>; <a href='/AIV/19/94/3'>Ps. 94:3-7</a>",
      "comment": "The prophet concludes with concern for unending injustice. The answer unfolds in the continuing story of divine justice, with true mercy and judgment finally revealed, especially in the person and work of Christ (see Matt. 25:31-46)."
    }
  ],
  "translatedAt": "2025-12-23T07:34:06.302Z"
}