{
  "book": "Habakkuk",
  "bookAbbreviation": "Hab",
  "chapter": 3,
  "verses": [
    {
      "pk": 2703001,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 1,
      "text": "A prayer of Habakkuk the prophet, according to Shigionoth.",
      "links": "<a href='/AIV/19/7/1'>Ps. 7:1</a>",
      "comment": "The term 'Shigionoth' refers to a musical or poetic style, echoing psalms written with intense emotion (see Psalm 7). This sets the tone for a prayerful, worshipful lament."
    },
    {
      "pk": 2703002,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 2,
      "text": "LORD, I have heard of Your fame; I stand in awe of Your deeds. LORD, revive Your work in the midst of these years; make it known—in wrath remember mercy.",
      "links": "<a href='/AIV/19/77/11'>Ps. 77:11</a>; <a href='/AIV/19/89/8'>Ps. 89:8</a>",
      "comment": "Habakkuk calls on God to act as He did in the past, asking for mercy amid judgment. The phrase 'in wrath remember mercy' foreshadows the interplay of justice and mercy fulfilled in Christ (see Titus 3:4–7)."
    },
    {
      "pk": 2703003,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 3,
      "text": "God came from Teman, the Holy One from Mount Paran. Selah. His glory covered the heavens, and the earth was full of His praise.",
      "links": "<a href='/AIV/05/33/2'>Deut. 33:2</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Teman and Paran recall God's mighty appearance at Sinai, linking Habakkuk's vision to the Exodus and giving this prayer a liturgical character."
    },
    {
      "pk": 2703004,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 4,
      "text": "His brightness was like the light; rays flashed from His hand, and there He hid His power.",
      "links": "<a href='/AIV/02/19/16'>Ex. 19:16–19</a>; <a href='/AIV/19/104/2'>Ps. 104:2</a>",
      "comment": "The radiant imagery recalls the theophany at Sinai and possibly alludes to the transfiguration of Christ, where divine glory is revealed (see Matt. 17:2)."
    },
    {
      "pk": 2703005,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 5,
      "text": "Before Him went pestilence, and plague followed at His feet.",
      "links": "<a href='/AIV/02/12/29'>Ex. 12:29</a>; <a href='/AIV/04/16/49'>Num. 16:49</a>",
      "comment": "Images of judgment reminiscent of the plagues in Egypt demonstrate God's authority over history and nature, stressing both His justice and His sovereignty."
    },
    {
      "pk": 2703006,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 6,
      "text": "He stood and measured the earth; He looked and shook the nations. The ancient mountains were shattered; the everlasting hills sank low. His ways are everlasting.",
      "links": "<a href='/AIV/19/114/4'>Ps. 114:4</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>",
      "comment": "God's everlasting ways recall His eternal nature. The shattering of mountains is often symbolic of God's direct intervention, later echoed in apocalyptic and New Testament imagery (Matt. 27:51; Rev. 6:14)."
    },
    {
      "pk": 2703007,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 7,
      "text": "I saw the tents of Cushan in affliction; the curtains of the land of Midian trembled.",
      "links": "<a href='/AIV/07/6/1'>Judg. 6:1–5</a>",
      "comment": "Refers to distant nations trembling before God's power, illustrating that God's authority transcends Israel and extends universally."
    },
    {
      "pk": 2703008,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 8,
      "text": "Was Your wrath against the rivers, LORD? Was Your anger against the rivers, or Your rage against the sea, that You rode on horses, upon Your chariots of salvation?",
      "links": "<a href='/AIV/19/68/4'>Ps. 68:4</a>; <a href='/AIV/02/14/21'>Ex. 14:21</a>",
      "comment": "The rhetorical questions emphasize that God's miraculous acts, such as the dividing of the sea, were for the salvation of His people. Salvation history builds towards the ultimate deliverance in Christ."
    },
    {
      "pk": 2703009,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 9,
      "text": "You uncovered Your bow, calling for many arrows. Selah. You split the earth with rivers.",
      "links": "<a href='/AIV/19/74/15'>Ps. 74:15</a>; <a href='/AIV/19/18/14'>Ps. 18:14</a>",
      "comment": "God's weapons are His own creation, signifying divine omnipotence. The splitting of rivers possibly echoes creation and the crossing of the Jordan (Josh. 3:16)."
    },
    {
      "pk": 2703010,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 10,
      "text": "The mountains saw You and writhed; the overflowing water passed by; the deep lifted its voice and raised its hands on high.",
      "links": "<a href='/AIV/19/77/16'>Ps. 77:16–19</a>",
      "comment": "Elements of nature respond to God's presence, a sign of His majesty. Such cosmic imagery deepens spiritual understanding and points to how creation itself testifies to the Creator."
    },
    {
      "pk": 2703011,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 11,
      "text": "The sun and moon stood still in their places at the light of Your arrows as they went, at the flash of Your glittering spear.",
      "links": "<a href='/AIV/06/10/12'>Josh. 10:12–13</a>",
      "comment": "Echoes Joshua's miracle, showing God’s control over time and space in accomplishing salvation. Such passages hint at the supernatural interventions that prefigure future revelations."
    },
    {
      "pk": 2703012,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 12,
      "text": "You marched through the earth in fury; You threshed the nations in anger.",
      "links": "<a href='/AIV/23/63/1'>Isa. 63:1–6</a>; <a href='/AIV/19/2/9'>Ps. 2:9</a>",
      "comment": "Threshing the nations connects with the imagery of judgement, later developed in the New Testament where Christ is both Judge and Redeemer (see Matt. 25:31–46)."
    },
    {
      "pk": 2703013,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 13,
      "text": "You went out for the salvation of Your people, for the salvation of Your anointed. You crushed the head of the house of the wicked, laying him bare from neck to foot. Selah.",
      "links": "<a href='/AIV/19/132/17'>Ps. 132:17</a>; <a href='/AIV/01/3/15'>Gen. 3:15</a>",
      "comment": "Here, 'crushed the head' recalls the protoevangelium of Genesis 3:15, foreshadowing Christ's victory over evil. 'Your anointed' prefigures both Israel's kings and Christ Himself."
    },
    {
      "pk": 2703014,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 14,
      "text": "With his own spear You pierced the heads of his warriors, who stormed out to scatter us, rejoicing as if devouring the poor in secret.",
      "links": "<a href='/AIV/19/10/9'>Ps. 10:9</a>; <a href='/AIV/19/57/6'>Ps. 57:6</a>",
      "comment": "God turns the weapons of the wicked against them, a theme often repeated in the Psalms and Proverbs, highlighting divine justice and protection over the oppressed."
    },
    {
      "pk": 2703015,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 15,
      "text": "You marched through the sea with Your horses, through the surging mighty waters.",
      "links": "<a href='/AIV/02/14/24'>Ex. 14:24–25</a>; <a href='/AIV/19/106/9'>Ps. 106:9</a>",
      "comment": "A direct reference to the Exodus and crossing of the Red Sea, central to the story of deliverance—a motif that points toward redemption in salvation history."
    },
    {
      "pk": 2703016,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 16,
      "text": "I heard and my body trembled; my lips quivered at the sound; decay entered my bones, and in my place I trembled. Yet I will wait quietly for the day of distress to come upon the people invading us.",
      "links": "<a href='/AIV/19/119/120'>Ps. 119:120</a>; <a href='/AIV/23/26/20'>Isa. 26:20</a>",
      "comment": "Habakkuk’s fear reveals human frailty before judgment, yet his resolve to wait quietly models a deep trust before God—a virtue praised throughout the spiritual tradition."
    },
    {
      "pk": 2703017,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 17,
      "text": "Though the fig tree does not blossom, nor fruit be on the vines, though the yield of the olive fails and the fields produce no food, though the flock be cut off from the fold and there be no herd in the stalls—",
      "links": "<a href='/AIV/29/2/22'>Joel 2:22</a>",
      "comment": "Describes utter material deprivation, yet sets up a contrast for deep spiritual trust regardless of external circumstances, a theme Christ reinforces (see Matt. 6:25–34)."
    },
    {
      "pk": 2703018,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 18,
      "text": "Yet I will rejoice in the LORD; I will be joyful in the God of my salvation.",
      "links": "<a href='/AIV/19/13/5'>Ps. 13:5</a>; <a href='/AIV/19/35/9'>Ps. 35:9</a>",
      "comment": "Even in loss, joy in God remains possible through faith. Spiritual joy in salvation transcends outward hardship and is foundational to the Christian life."
    },
    {
      "pk": 2703019,
      "translation": "AIV",
      "book": 35,
      "chapter": 3,
      "verse": 19,
      "text": "The LORD God is my strength; He makes my feet like those of a deer, and makes me tread on my high places. To the choirmaster: with stringed instruments.",
      "links": "<a href='/AIV/19/18/33'>Ps. 18:33'>Ps. 18:33</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Closes with assurance of God’s strength and triumph. The mention of 'stringed instruments' shows liturgical worship and communal prayer, which has continually shaped the Christian practice of faith."
    }
  ],
  "translatedAt": "2025-12-23T07:34:51.834Z"
}