{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 6,
  "verses": [
    {
      "pk": 600601,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 1,
      "text": "After this, Jesus went away across the Sea of Galilee, which is also called the Sea of Tiberias.",
      "links": "<a href='/AIV/40/14/13'>Matt. 14:13</a>; <a href='/AIV/41/6/32'>Mark 6:32</a>; <a href='/AIV/42/9/10'>Luke 9:10</a>",
      "comment": "The Sea of Galilee was also known as the Sea of Tiberias. John regularly notes names for the sake of his broader audience."
    },
    {
      "pk": 600602,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 2,
      "text": "A large crowd was following him, because they saw the miraculous signs that he was doing for the sick.",
      "links": "<a href='/AIV/43/2/23'>John 2:23</a>; <a href='/AIV/43/4/45'>John 4:45</a>",
      "comment": "Jesus' reputation for miraculous healings drew crowds, pointing to his divine authority and fulfillment of Old Testament messianic prophecies (Isa. 35:5-6)."
    },
    {
      "pk": 600603,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 3,
      "text": "Jesus went up on the mountain and sat down there with his disciples.",
      "links": "<a href='/AIV/40/5/1'>Matt. 5:1</a>",
      "comment": "Ascending a mountain often echoes Old Testament figures like Moses. Jesus sitting echoes rabbinical teaching authority."
    },
    {
      "pk": 600604,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 4,
      "text": "Now the Passover, the feast of the Jews, was near.",
      "links": "<a href='/AIV/43/2/13'>John 2:13</a>; <a href='/AIV/43/13/1'>John 13:1</a>",
      "comment": "John frames events around Jewish festivals. Passover especially points to Jesus as the true Passover Lamb (Exod. 12:21-27; 1 Cor. 5:7)."
    },
    {
      "pk": 600605,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 5,
      "text": "So when Jesus looked up and saw a large crowd coming toward him, he said to Philip, \"Where can we buy bread so that these people may eat?\"",
      "links": "<a href='/AIV/40/14/15'>Matt. 14:15</a>",
      "comment": "Jesus tests his disciples, often teaching them through practical needs, echoing God’s provision of manna."
    },
    {
      "pk": 600606,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 6,
      "text": "He said this to test him, for he himself knew what he was about to do.",
      "links": "<a href='/AIV/43/2/24-25'>John 2:24–25</a>",
      "comment": "Jesus' divine foreknowledge is demonstrated; his miracles are purposeful signs to reveal his identity."
    },
    {
      "pk": 600607,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 7,
      "text": "Philip answered him, \"Two hundred denarii worth of bread would not be enough for each one of them to get even a little.\"",
      "links": "<a href='/AIV/04/11/21-22'>Num. 11:21–22</a>",
      "comment": "A denarius was a day’s wage. The scale of need reflects God’s ability to provide abundantly beyond human resources."
    },
    {
      "pk": 600608,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 8,
      "text": "One of his disciples, Andrew, Simon Peter's brother, said to him,",
      "links": "<a href='/AIV/43/1/40-41'>John 1:40–41</a>",
      "comment": "Andrew plays an important role in bringing individuals to Jesus (see John 1:41-42)."
    },
    {
      "pk": 600609,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 9,
      "text": "\"There is a boy here with five barley loaves and two small fish, but what are they for so many?\"",
      "links": "<a href='/AIV/04/11/13'>Num. 11:13</a>",
      "comment": "Barley was the bread of the poor. The insufficient offering is chosen for a great miracle."
    },
    {
      "pk": 600610,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 10,
      "text": "Jesus said, \"Have the people sit down.\" Now there was much grass in that place. So the men sat down, about five thousand in number.",
      "links": "<a href='/AIV/40/14/19-21'>Matt. 14:19–21</a>",
      "comment": "A detail confirming eyewitness accuracy. Five thousand men, not counting women and children, underscores the size of the miracle."
    },
    {
      "pk": 600611,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 11,
      "text": "Then Jesus took the loaves, and after giving thanks, he distributed them to those who were seated. He did the same with the fish, as much as they wanted.",
      "links": "<a href='/AIV/19/145/15-16'>Ps. 145:15–16</a>",
      "comment": "Jesus ‘gave thanks’ – an early pattern repeated in the Last Supper (cf. Lk 22:19), alluding to a deeper Eucharistic theme."
    },
    {
      "pk": 600612,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 12,
      "text": "When they were filled, he said to his disciples, \"Gather up the leftover pieces, so that nothing is lost.\"",
      "links": "<a href='/AIV/43/18/9'>John 18:9</a>",
      "comment": "Jesus' concern that nothing be lost foreshadows the spiritual truth that He will not lose anyone given to Him (cf. v39)."
    },
    {
      "pk": 600613,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 13,
      "text": "So they gathered them up and filled twelve baskets with pieces from the five barley loaves left by those who had eaten.",
      "links": "<a href='/AIV/02/16/4'>Exod. 16:4</a>",
      "comment": "Twelve baskets likely symbolize the twelve tribes of Israel, indicating Jesus' abundance is enough for all of God's people."
    },
    {
      "pk": 600614,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 14,
      "text": "When the people saw the sign that he had done, they said, \"This is truly the Prophet who is to come into the world.\"",
      "links": "<a href='/AIV/05/18/15'>Deut. 18:15</a>",
      "comment": "People recognized a fulfillment of prophecy from Deuteronomy, where Moses promised a greater prophet. Jesus is this promised figure."
    },
    {
      "pk": 600615,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 15,
      "text": "So Jesus, knowing that they were about to come and take him by force to make him king, withdrew again to the mountain by himself.",
      "links": "<a href='/AIV/40/12/15-19'>Matt. 12:15–19</a>",
      "comment": "Jesus refused to be made a political king, showing his kingdom is not of this world (cf. John 18:36)."
    },
    {
      "pk": 600616,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 16,
      "text": "When evening came, his disciples went down to the sea,",
      "links": "<a href='/AIV/41/6/45'>Mark 6:45</a>",
      "comment": "Transition to another miracle, setting the context for divine revelation."
    },
    {
      "pk": 600617,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 17,
      "text": "got into a boat, and started across the sea to Capernaum. It was now dark, and Jesus had not yet come to them.",
      "links": "<a href='/AIV/43/6/24'>John 6:24</a>",
      "comment": "John frequently notes the symbolism of darkness, anticipation of a revelation."
    },
    {
      "pk": 600618,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 18,
      "text": "The sea was stirred up because a strong wind was blowing.",
      "links": "<a href='/AIV/19/107/25'>Ps. 107:25</a>",
      "comment": "The sea, often an image of chaos in Scripture, is about to be calmed by the Lord."
    },
    {
      "pk": 600619,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 19,
      "text": "When they had rowed about three or four miles, they saw Jesus walking on the sea and coming near the boat, and they were afraid.",
      "links": "<a href='/AIV/18/9/8'>Job 9:8</a>; <a href='/AIV/40/14/25'>Matt. 14:25</a>",
      "comment": "Walking on water is a sign of divinity (cf. Job 9:8); Jesus demonstrates authority over creation."
    },
    {
      "pk": 600620,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 20,
      "text": "But he said to them, \"It is I; do not be afraid.\"",
      "links": "<a href='/AIV/02/3/14'>Exod. 3:14</a>",
      "comment": "Jesus’ words ‘It is I’ (Greek: egō eimi) echo God’s name from Exodus, indicating Jesus’ divine identity."
    },
    {
      "pk": 600621,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 21,
      "text": "Then they were glad to take him into the boat, and immediately the boat reached the land where they were going.",
      "links": "",
      "comment": "A miraculous arrival hints at Jesus’ sovereign power; the purpose of the sign is His identity."
    },
    {
      "pk": 600622,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 22,
      "text": "On the next day the crowd that stood on the other side of the sea saw that there had only been one boat there, and that Jesus had not entered the boat with his disciples, but that his disciples had gone away alone.",
      "links": "",
      "comment": "Eyewitness details prepare the setting for the 'Bread of Life' discourse."
    },
    {
      "pk": 600623,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 23,
      "text": "However, other boats from Tiberias came near the place where they had eaten the bread after the Lord had given thanks.",
      "links": "",
      "comment": "A reference again to Jesus giving thanks (Eucharistic undertone), setting the audience for spiritual teaching."
    },
    {
      "pk": 600624,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 24,
      "text": "So when the crowd saw that Jesus was not there, nor his disciples, they themselves got into the boats and came to Capernaum, seeking Jesus.",
      "links": "",
      "comment": "The people seek Jesus for physical needs, setting up the transition to spiritual nourishment."
    },
    {
      "pk": 600625,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 25,
      "text": "When they found him on the other side of the sea, they said to him, \"Rabbi, when did you get here?\"",
      "links": "<a href='/AIV/43/1/38'>John 1:38</a>",
      "comment": "Jesus' arrival is unexplained, contributing to the mystery of his miracles for those who follow him."
    },
    {
      "pk": 600626,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 26,
      "text": "Jesus answered them, \"Truly, truly, I say to you, you are seeking me, not because you saw the signs, but because you ate the bread and were filled.",
      "links": "<a href='/AIV/43/3/3'>John 3:3</a>",
      "comment": "Jesus distinguishes between seeking physical and spiritual fulfillment. True faith goes beyond miracles."
    },
    {
      "pk": 600627,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 27,
      "text": "Do not work for food that perishes, but for the food that endures into eternal life, which the Son of Man will give you. For on him God the Father has set his seal.\"",
      "links": "<a href='/AIV/23/55/2'>Isa. 55:2</a>",
      "comment": "Jesus reveals himself as the giver of eternal sustenance; the language of 'seal' refers to divine authority (cf. Eph. 1:13)."
    },
    {
      "pk": 600628,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 28,
      "text": "Then they said to him, \"What must we do, to be doing the works of God?\"",
      "links": "<a href='/AIV/19/143/10'>Ps. 143:10</a>",
      "comment": "A typical question of religious effort—Jesus will redirect them from works-based thinking to trust in God’s provision."
    },
    {
      "pk": 600629,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 29,
      "text": "Jesus answered them, \"This is the work of God, that you believe in the one whom he has sent.\"",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>",
      "comment": "Emphasis on faith over works, but believing in the one 'sent' includes obedience and relationship, not just intellectual assent."
    },
    {
      "pk": 600630,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 30,
      "text": "So they said to him, \"What sign do you do, that we may see and believe you? What work do you perform?",
      "links": "<a href='/AIV/02/16/15'>Exod. 16:15</a>",
      "comment": "Israel repeatedly asked for signs; the emphasis shifts from signs to the ultimate spiritual sign Jesus will give."
    },
    {
      "pk": 600631,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 31,
      "text": "Our fathers ate the manna in the wilderness; as it is written, 'He gave them bread from heaven to eat.'\"",
      "links": "<a href='/AIV/02/16/4'>Exod. 16:4</a>",
      "comment": "Quote from Exod. 16:4; foreshadows Jesus as the true Bread from Heaven."
    },
    {
      "pk": 600632,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 32,
      "text": "Jesus then said to them, \"Truly, truly, I say to you, it was not Moses who gave you the bread from heaven, but my Father gives you the true bread from heaven.",
      "links": "<a href='/AIV/43/1/17'>John 1:17</a>",
      "comment": "Jesus distinguishes himself as the gift of the Father, not just a new Moses but the divine Son offering true sustenance."
    },
    {
      "pk": 600633,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 33,
      "text": "For the bread of God is he who comes down from heaven and gives life to the world.\"",
      "links": "<a href='/AIV/43/3/13'>John 3:13</a>",
      "comment": "Jesus presents himself as the true, living bread, indicating his pre-existence and mission for the world."
    },
    {
      "pk": 600634,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 34,
      "text": "They said to him, \"Sir, give us this bread always.\"",
      "links": "<a href='/AIV/04/11/4-6'>Num. 11:4–6</a>",
      "comment": "Like the woman at the well (John 4:15), they misunderstand, thinking only of earthly bread."
    },
    {
      "pk": 600635,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 35,
      "text": "Jesus said to them, \"I am the bread of life; whoever comes to me shall never hunger, and whoever believes in me shall never thirst.",
      "links": "<a href='/AIV/02/16/35'>Exod. 16:35</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "First of the 'I am' statements. Jesus identifies himself directly with life-giving nourishment, a clear claim to divinity (cf. Exod. 3:14)."
    },
    {
      "pk": 600636,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 36,
      "text": "But I said to you that you have seen me and yet do not believe.",
      "links": "<a href='/AIV/43/1/11'>John 1:11</a>",
      "comment": "Miracles alone do not create faith—faith requires openness to the truth Jesus reveals."
    },
    {
      "pk": 600637,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 37,
      "text": "All that the Father gives me will come to me, and the one who comes to me I will never cast out.",
      "links": "<a href='/AIV/43/17/6,12'>John 17:6,12</a>",
      "comment": "Security for all who come; the role of grace is highlighted—cooperation is needed but ultimately, security is in Christ."
    },
    {
      "pk": 600638,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 38,
      "text": "For I have come down from heaven, not to do my own will, but the will of him who sent me.",
      "links": "<a href='/AIV/19/40/7-8'>Ps. 40:7–8</a>",
      "comment": "Jesus asserts his origin and mission are from heaven, fulfilling scriptural prophecy about the obedient servant."
    },
    {
      "pk": 600639,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 39,
      "text": "And this is the will of him who sent me, that I should lose nothing of all that he has given me, but raise it up on the last day.",
      "links": "<a href='/AIV/43/17/12'>John 17:12</a>",
      "comment": "A strong assurance of resurrection and security for those who belong to Christ, with a strong eschatological focus."
    },
    {
      "pk": 600640,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 40,
      "text": "For this is the will of my Father, that everyone who sees the Son and believes in him should have eternal life, and I will raise him up on the last day.\"",
      "links": "<a href='/AIV/12/4/17'>2 Kings 4:17</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "Eternal life is intimately connected to believing in the Son; resurrection is physical and spiritual."
    },
    {
      "pk": 600641,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 41,
      "text": "So the Jews grumbled about him, because he said, \"I am the bread that came down from heaven.\"",
      "links": "<a href='/AIV/02/16/2'>Exod. 16:2</a>",
      "comment": "The people’s grumbling echoes the Israelites' response to manna in Exodus, repeating the pattern of unbelief."
    },
    {
      "pk": 600642,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 42,
      "text": "They said, \"Is not this Jesus, the son of Joseph, whose father and mother we know? How can he now say, 'I have come down from heaven'?\"",
      "links": "<a href='/AIV/42/4/22'>Luke 4:22</a>",
      "comment": "Human reasoning cannot fully grasp the incarnation—the mystery at the heart of Christology."
    },
    {
      "pk": 600643,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 43,
      "text": "Jesus answered them, \"Do not grumble among yourselves.",
      "links": "<a href='/AIV/02/16/7'>Exod. 16:7</a>",
      "comment": "Jesus responds directly, as God did to Israel."
    },
    {
      "pk": 600644,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 44,
      "text": "No one can come to me unless the Father who sent me draws him. And I will raise him up on the last day.",
      "links": "<a href='/AIV/43/12/32'>John 12:32</a>",
      "comment": "Grace initiates salvation; Jesus alone offers resurrection—a divine prerogative."
    },
    {
      "pk": 600645,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 45,
      "text": "It is written in the prophets, 'And they will all be taught by God.' Everyone who has heard and learned from the Father comes to me.",
      "links": "<a href='/AIV/23/54/13'>Isa. 54:13</a>; <a href='/AIV/24/31/34'>Jer. 31:34</a>",
      "comment": "Jesus fulfills prophecy that God himself would teach his people—another implicit claim to divinity."
    },
    {
      "pk": 600646,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 46,
      "text": "Not that anyone has seen the Father except the one who is from God; he has seen the Father.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>",
      "comment": "Only Jesus has seen the Father, establishing his unique status as the divine Son."
    },
    {
      "pk": 600647,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 47,
      "text": "Truly, truly, I say to you, whoever believes has eternal life.",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>",
      "comment": "Faith brings present, ongoing eternal life, not just in the future."
    },
    {
      "pk": 600648,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 48,
      "text": "I am the bread of life.",
      "links": "<a href='/AIV/43/6/35'>John 6:35</a>",
      "comment": "Repetition emphasizes this central, literal and spiritual claim."
    },
    {
      "pk": 600649,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 49,
      "text": "Your fathers ate the manna in the wilderness, and they died.",
      "links": "<a href='/AIV/02/16/35'>Exod. 16:35</a>",
      "comment": "Earthly bread cannot give eternal life—Jesus prepares his listeners for a new kind of bread."
    },
    {
      "pk": 600650,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 50,
      "text": "This is the bread that comes down from heaven, so that anyone may eat it and not die.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "This implies a universal offer—God's salvation is for all who participate in the heavenly bread."
    },
    {
      "pk": 600651,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 51,
      "text": "I am the living bread that came down from heaven. If anyone eats of this bread, he will live forever. And the bread that I will give is my flesh, for the life of the world.\"",
      "links": "<a href='/AIV/43/6/33'>John 6:33</a>; <a href='/AIV/40/26/26'>Matt. 26:26</a>",
      "comment": "Jesus promises eternal life through eating his flesh—a literal statement later shown at the Last Supper. Early Christians have universally interpreted this sacramentally."
    },
    {
      "pk": 600652,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 52,
      "text": "Then the Jews disputed among themselves, saying, \"How can this man give us his flesh to eat?\"",
      "links": "",
      "comment": "Taking Jesus’ words literally, the people are confronted with a mystery that only makes sense in sacramental understanding."
    },
    {
      "pk": 600653,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 53,
      "text": "So Jesus said to them, \"Truly, truly, I say to you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you.",
      "links": "<a href='/AIV/40/26/27-28'>Matt. 26:27–28</a>",
      "comment": "Explicit language linking eternal life to eating and drinking—key for high Eucharistic theology. Jesus makes no attempt to clarify metaphorically."
    },
    {
      "pk": 600654,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 54,
      "text": "Whoever eats my flesh and drinks my blood has eternal life, and I will raise him up on the last day.",
      "links": "<a href='/AIV/43/6/40'>John 6:40</a>",
      "comment": "A literal and repeated promise: partaking in the flesh and blood gives eternal life. Historically this leads to sacramental practice."
    },
    {
      "pk": 600655,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 55,
      "text": "For my flesh is true food, and my blood is true drink.",
      "links": "",
      "comment": "Jesus affirms the real, substantial nature of the bread and wine at the new Passover. The realism is emphasized."
    },
    {
      "pk": 600656,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 56,
      "text": "Whoever eats my flesh and drinks my blood remains in me, and I in him.",
      "links": "<a href='/AIV/43/15/4'>John 15:4</a>",
      "comment": "A mutual indwelling—union with Christ is effected by this eating and drinking. Strong sacramental language leads to deep personal relationship."
    },
    {
      "pk": 600657,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 57,
      "text": "Just as the living Father sent me, and I live because of the Father, so whoever feeds on me will also live because of me.",
      "links": "<a href='/AIV/43/5/26'>John 5:26</a>",
      "comment": "The relationship between the Father and Son is extended to believers through participation in Christ. Deep communal and sacramental vision."
    },
    {
      "pk": 600658,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 58,
      "text": "This is the bread that came down from heaven, not like the bread the fathers ate, and died. Whoever eats this bread will live forever.\"",
      "links": "<a href='/AIV/43/6/31,49-51'>John 6:31,49-51</a>",
      "comment": "A contrast is drawn between old covenant manna and the new, true bread. Life is eternal only through the bread Jesus gives."
    },
    {
      "pk": 600659,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 59,
      "text": "Jesus said these things while teaching in the synagogue at Capernaum.",
      "links": "<a href='/AIV/43/6/24'>John 6:24</a>",
      "comment": "Historical and geographical context—Jesus taught with authority in the heart of community worship."
    },
    {
      "pk": 600660,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 60,
      "text": "When many of his disciples heard it, they said, \"This is a hard saying; who can listen to it?\"",
      "links": "<a href='/AIV/40/19/25'>Matt. 19:25</a>",
      "comment": "Acceptance of this teaching is difficult—many turn away, as happens whenever Jesus is taken at his literal word."
    },
    {
      "pk": 600661,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 61,
      "text": "But Jesus, knowing in himself that his disciples were grumbling about this, said to them, \"Does this offend you?",
      "links": "<a href='/AIV/43/2/24-25'>John 2:24–25</a>",
      "comment": "Jesus is aware of their inner thoughts. The offense comes from the realistic demands of discipleship."
    },
    {
      "pk": 600662,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 62,
      "text": "Then what if you were to see the Son of Man ascending to where he was before?",
      "links": "<a href='/AIV/43/3/13'>John 3:13</a>; <a href='/AIV/44/1/9'>Acts 1:9</a>",
      "comment": "Jesus refers to his pre-existence and forthcoming ascension, demonstrating his divinity and heavenly origin."
    },
    {
      "pk": 600663,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 63,
      "text": "It is the Spirit who gives life; the flesh is no help at all. The words that I have spoken to you are spirit and life.",
      "links": "<a href='/AIV/47/3/6'>2 Cor. 3:6</a>",
      "comment": "The Spirit animates, but Jesus does not deny the reality of his flesh; instead, only by the Spirit can the mystery be understood and received."
    },
    {
      "pk": 600664,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 64,
      "text": "But there are some of you who do not believe.\" (For Jesus knew from the beginning who those were who did not believe, and who would betray him.)",
      "links": "<a href='/AIV/43/2/24-25'>John 2:24–25</a>; <a href='/AIV/43/13/11'>John 13:11</a>",
      "comment": "Jesus’ divine knowledge is emphasized; belief is crucial to participate in the life offered."
    },
    {
      "pk": 600665,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 65,
      "text": "And he said, \"This is why I told you that no one can come to me unless it is granted him by the Father.\"",
      "links": "<a href='/AIV/43/6/44'>John 6:44</a>",
      "comment": "Again, divine initiative is required—salvation is a gift enabled by grace and must be received."
    },
    {
      "pk": 600666,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 66,
      "text": "After this, many of his disciples turned back and no longer walked with him.",
      "links": "<a href='/AIV/43/6/60'>John 6:60</a>",
      "comment": "The teaching of the Real Presence proved too radical for many. This has remained a point of division throughout church history."
    },
    {
      "pk": 600667,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 67,
      "text": "So Jesus said to the twelve, \"Do you also want to go away?\"",
      "links": "<a href='/AIV/43/1/35'>John 1:35</a>",
      "comment": "The twelve apostles, chosen by Jesus, are presented as the nucleus of the new covenant community."
    },
    {
      "pk": 600668,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 68,
      "text": "Simon Peter answered him, \"Lord, to whom shall we go? You have the words of eternal life,",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>",
      "comment": "Peter speaks for all, showing the primacy of his leadership among the apostles—an early indication of the head bishop's role."
    },
    {
      "pk": 600669,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 69,
      "text": "and we have believed, and have come to know that you are the Holy One of God.\"",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/43/11/27'>John 11:27</a>",
      "comment": "Recognition of Jesus’ unique and divine mission. The title 'Holy One' is a clear messianic affirmation."
    },
    {
      "pk": 600670,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 70,
      "text": "Jesus answered them, \"Did I not choose you, the twelve? And yet one of you is a devil.\"",
      "links": "<a href='/AIV/43/13/2'>John 13:2</a>",
      "comment": "Divine election of the twelve apostles is reiterated—a pattern for continued apostolic succession and preservation of true doctrine."
    },
    {
      "pk": 600671,
      "translation": "AIV",
      "book": 43,
      "chapter": 6,
      "verse": 71,
      "text": "He was speaking about Judas, the son of Simon Iscariot, for he, one of the twelve, was going to betray him.",
      "links": "<a href='/AIV/40/26/14-16'>Matt. 26:14–16</a>",
      "comment": "Judas’s betrayal is anticipated, showing Jesus’ foreknowledge. The continuity of faithful leadership despite unfaithfulness is upheld."
    }
  ],
  "translatedAt": "2025-12-23T03:00:08.251Z"
}