{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 17,
  "verses": [
    {
      "pk": 17017001,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 1,
      "text": "When Jesus had spoken these things, he lifted up his eyes to heaven and said, 'Father, the hour has come; glorify your Son, that your Son may glorify you.'",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>; <a href='/AIV/43/13/31-32'>John 13:31-32</a>",
      "comment": "Jesus, knowing his crucifixion approaches, petitions the Father. The theme of mutual glorification between Father and Son is emphasized. Jesus' use of 'the hour has come' consistently refers to his impending passion and death, central to salvation (see John 12:23). High Christology: Jesus intimately addresses God as Father, and asks to be glorified, implying divinity. See also Phil. 2:9-11."
    },
    {
      "pk": 17017002,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 2,
      "text": "You have given him authority over all flesh, to give eternal life to all whom you have given him.",
      "links": "<a href='/AIV/40/28/18'>Matt. 28:18</a>; <a href='/AIV/43/5/21'>John 5:21</a>",
      "comment": "The Father gives the Son universal authority—an assertion of Jesus' sovereignty. The gift of eternal life is linked directly to those given by the Father—a mystery echoing divine initiative and grace. See also John 6:37, 39."
    },
    {
      "pk": 17017003,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 3,
      "text": "Now this is eternal life, that they know you, the only true God, and Jesus Christ whom you have sent.",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "Knowledge of God is not merely intellectual but a relationship of communion and faith. Jesus calls himself 'Christ' and as 'sent', indicating the unique mission from the Father, affirming his divinity alongside the Father. The Trinity is subtly presupposed here—see 1 John 5:20."
    },
    {
      "pk": 17017004,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 4,
      "text": "I glorified you on earth, having accomplished the work that you gave me to do.",
      "links": "<a href='/AIV/43/4/34'>John 4:34</a>; <a href='/AIV/43/19/30'>John 19:30</a>",
      "comment": "Jesus' life fulfills the Father's will completely. His obedience is perfect, connecting to the 'servant songs' of Isaiah (see Isa. 52:13)."
    },
    {
      "pk": 17017005,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 5,
      "text": "And now, Father, glorify me in your own presence with the glory that I had with you before the world existed.",
      "links": "<a href='/AIV/43/1/1-2'>John 1:1-2</a>; <a href='/AIV/20/8/23'>Prov. 8:23</a>",
      "comment": "Jesus speaks of his pre-existence and divine glory, showing a claim to divinity—he existed with the Father before creation. This verse is central for a high Christology and the doctrine of the Trinity."
    },
    {
      "pk": 17017006,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 6,
      "text": "I have revealed your name to the people you gave me out of the world. They were yours, and you gave them to me, and they have kept your word.",
      "links": "<a href='/AIV/2/33/19'>Ex. 33:19</a>; <a href='/AIV/43/6/37'>John 6:37</a>",
      "comment": "To reveal the name of God means making God known in his fullness. Jesus acts as the mediator and teacher, leading us to intimate knowledge of God."
    },
    {
      "pk": 17017007,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 7,
      "text": "Now they know that everything you have given me is from you,",
      "links": "<a href='/AIV/43/5/19'>John 5:19</a>",
      "comment": "The disciples recognize Jesus’ authority and divine mission. Faith is a gift and is the fruit of divine revelation."
    },
    {
      "pk": 17017008,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 8,
      "text": "For I have given them the words that you gave me, and they have received them and truly understood that I came from you; and they have believed that you sent me.",
      "links": "<a href='/AIV/43/8/28'>John 8:28</a>",
      "comment": "Receiving God’s words is necessary for true faith. Belief in the divine origin and mission of Jesus is central to Christian faith."
    },
    {
      "pk": 17017009,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 9,
      "text": "I pray for them; I am not praying for the world but for those you have given me, for they are yours.",
      "links": "<a href='/AIV/43/6/44'>John 6:44</a>; <a href='/AIV/46/1/2'>1 Cor. 1:2</a>",
      "comment": "Jesus intercedes specifically for his followers, distinguishing them from ‘the world.’ This highlights the special status of his disciples."
    },
    {
      "pk": 17017010,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 10,
      "text": "All that is mine is yours, and all that is yours is mine, and I am glorified in them.",
      "links": "<a href='/AIV/43/16/15'>John 16:15</a>",
      "comment": "A mutual sharing between the Father and Son, emphasizing unity of essence (see John 10:30). Glorification is brought to Jesus by his followers’ faithfulness."
    },
    {
      "pk": 17017011,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 11,
      "text": "And I am no longer in the world, but they are in the world, and I am coming to you. Holy Father, keep them in your name, which you have given me, that they may be one, even as we are one.",
      "links": "<a href='/AIV/43/10/30'>John 10:30</a>; <a href='/AIV/49/4/3-6'>Eph. 4:3-6</a>",
      "comment": "Jesus prays for unity—a visible and spiritual unity among believers, modeled after the unity of the Father and Son. This has major implications for understanding the continuity and unity of the visible church."
    },
    {
      "pk": 17017012,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 12,
      "text": "While I was with them, I kept them in your name, which you have given me. I have guarded them, and not one of them has perished except the son of destruction, so that the Scripture might be fulfilled.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/43/6/70'>John 6:70</a>",
      "comment": "Jesus kept his followers safe except for Judas, whose betrayal was foretold, fulfilling Scripture (Ps. 41:9). The sovereignty of God’s plan is highlighted."
    },
    {
      "pk": 17017013,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 13,
      "text": "But now I am coming to you, and these things I speak in the world, that they may have my joy made full in themselves.",
      "links": "<a href='/AIV/43/15/11'>John 15:11</a>",
      "comment": "Jesus desires that his followers experience divine, full joy—a joy found in union with God and faithfulness to Christ."
    },
    {
      "pk": 17017014,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 14,
      "text": "I have given them your word, and the world has hated them, because they are not of the world, just as I am not of the world.",
      "links": "<a href='/AIV/43/15/19'>John 15:19</a>",
      "comment": "Believers, consecrated by God’s word, face opposition from the world just as Jesus did. Christians are called to be different from the world."
    },
    {
      "pk": 17017015,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 15,
      "text": "I do not ask that you take them out of the world, but that you keep them from the evil one.",
      "links": "<a href='/AIV/40/6/13'>Matt. 6:13</a>; <a href='/AIV/47/4/4'>2 Cor. 4:4</a>",
      "comment": "Jesus prays not for removal from the world, but for protection from the evil one, implying spiritual struggle and perseverance."
    },
    {
      "pk": 17017016,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 16,
      "text": "They are not of the world, just as I am not of the world.",
      "links": "<a href='/AIV/50/3/20'>Phil. 3:20</a>",
      "comment": "Christian identity and holiness set believers apart from the world. This echoes the theme of new birth and citizenship in Heaven (see Phil. 3:20)."
    },
    {
      "pk": 17017017,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 17,
      "text": "Sanctify them in the truth; your word is truth.",
      "links": "<a href='/AIV/19/119/142'>Ps. 119:142</a>; <a href='/AIV/43/15/3'>John 15:3</a>",
      "comment": "Sanctification is by the truth, which is God’s word—this has implications for ongoing transformation and holiness through remaining in the teachings of Christ."
    },
    {
      "pk": 17017018,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 18,
      "text": "As you sent me into the world, so I have sent them into the world.",
      "links": "<a href='/AIV/20/13/17'>Prov. 13:17</a>; <a href='/AIV/43/20/21'>John 20:21</a>",
      "comment": "The mission of the apostles is a continuation of Christ’s own mission. This anticipates apostolic authority and succession in the leadership of the Church."
    },
    {
      "pk": 17017019,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 19,
      "text": "And for their sake I sanctify myself, that they also may be sanctified in truth.",
      "links": "<a href='/AIV/58/2/11'>Heb. 2:11</a>",
      "comment": "Jesus consecrates himself for the sake of the disciples, pointing to his sacrificial death. Through this, believers are set apart in truth."
    },
    {
      "pk": 17017020,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 20,
      "text": "I do not ask for these only, but also for those who will believe in me through their word,",
      "links": "<a href='/AIV/23/59/21'>Isa. 59:21</a>",
      "comment": "Jesus here prays for all future believers—a unifying prayer for the universal body of Christ. The foundation of faith is based on the apostolic testimony."
    },
    {
      "pk": 17017021,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 21,
      "text": "that they may all be one, just as you, Father, are in me and I in you, that they also may be in us, so that the world may believe that you sent me.",
      "links": "<a href='/AIV/43/10/16'>John 10:16</a>; <a href='/AIV/45/12/5'>Rom. 12:5</a>",
      "comment": "Jesus prays for all believers to be one, as the Father and Son are one—spiritual and visible unity. This unity is intended to be a sign to the world, pointing to the divine mission of Jesus."
    },
    {
      "pk": 17017022,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 22,
      "text": "The glory that you have given me I have given to them, that they may be one even as we are one:",
      "links": "<a href='/AIV/43/14/20'>John 14:20</a>",
      "comment": "Unity among believers is a participation in the divine glory and love. The Church is called to reflect the unity of the Trinity."
    },
    {
      "pk": 17017023,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 23,
      "text": "I in them and you in me, that they may be perfectly one, so that the world may know that you sent me and loved them even as you loved me.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "Jesus’ mystical indwelling is the cause of perfect unity. The love of the Father for believers is as strong as for the Son—a profound mystery displaying the divine plan."
    },
    {
      "pk": 17017024,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 24,
      "text": "Father, I desire that those whom you have given me may also be with me where I am, to see my glory that you have given me because you loved me before the world’s foundation.",
      "links": "<a href='/AIV/43/14/3'>John 14:3</a>; <a href='/AIV/19/110/3'>Ps. 110:3</a>",
      "comment": "Jesus wishes for believers to be with him in eternal glory, sharing in his divine life. His pre-existence is again emphasized (cf. John 1:1)."
    },
    {
      "pk": 17017025,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 25,
      "text": "Righteous Father, though the world has not known you, I have known you, and these know that you have sent me.",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>",
      "comment": "Knowing the Father is only possible through the revelation of the Son. The Father-Son relationship is unique and the only way to true knowledge of God."
    },
    {
      "pk": 17017026,
      "translation": "AIV",
      "book": 43,
      "chapter": 17,
      "verse": 26,
      "text": "I made your name known to them, and will continue to make it known, so that the love with which you have loved me may be in them, and I in them.",
      "links": "<a href='/AIV/43/15/9'>John 15:9</a>; <a href='/AIV/43/1/18'>John 1:18</a>",
      "comment": "Jesus’ work is ongoing, making God known through revelation and the indwelling presence of Christ in believers. Divine love thus dwells in the believer, uniting them in Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:10:13.712Z"
}