{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 18,
  "verses": [
    {
      "pk": 1181801,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 1,
      "text": "When Jesus had spoken these words, he went out with his disciples across the Kidron Valley, where there was a garden. He and his disciples entered into it.",
      "links": "<a href='/AIV/10/15/23'>2 Sam. 15:23</a>; <a href='/AIV/42/22/39'>Luke 22:39</a>",
      "comment": "The mention of the Kidron Valley evokes Old Testament scenes involving David’s betrayal, highlighting Christ as the true anointed King. The garden context is meant to connect Jesus with Adam, as a new Adam entering into obedience to God (Genesis 2–3; Romans 5:12–19)."
    },
    {
      "pk": 1181802,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 2,
      "text": "Now Judas, who betrayed him, also knew the place, because Jesus often met there with his disciples.",
      "links": "<a href='/AIV/40/26/47-56'>Matt. 26:47-56</a>; <a href='/AIV/41/14/43-50'>Mark 14:43-50</a>",
      "comment": "Judas’ betrayal is emphasized, fulfilling prophecies of the righteous one being betrayed by a close companion (<a href='/AIV/19/41/9'>Psalm 41:9</a>). The garden is symbolic of fellowship with God and the beginning of suffering for redemption."
    },
    {
      "pk": 1181803,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 3,
      "text": "So Judas, having taken a cohort of soldiers and some officers from the chief priests and the Pharisees, came there with lanterns, torches, and weapons.",
      "links": "<a href='/AIV/19/27/2'>Ps. 27:2</a>",
      "comment": "The presence of both Roman soldiers and Jewish officers shows the alliance against Jesus. The use of weapons against the Prince of Peace fulfills prophetic themes (<a href='/AIV/23/53/7'>Isa. 53:7</a>)."
    },
    {
      "pk": 1181804,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 4,
      "text": "Then Jesus, knowing all that was going to happen to him, came forward and said to them, 'Whom do you seek?'",
      "links": "<a href='/AIV/40/20/18-19'>Matt. 20:18-19</a>",
      "comment": "Jesus steps forward willingly—his knowledge and control of the situation affirm his divinity and his fulfillment of the Father's will (<a href='/AIV/10/53/10'>Isa. 53:10</a>)."
    },
    {
      "pk": 1181805,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 5,
      "text": "They answered him, 'Jesus of Nazareth.' Jesus said to them, 'I am he.' Judas, who betrayed him, was standing with them.",
      "links": "<a href='/AIV/2/3/14'>Ex. 3:14</a>; <a href='/AIV/43/8/24'>John 8:24</a>",
      "comment": "'I am he' echoes the divine name 'I AM' from Exodus 3:14. This is a bold claim to divinity, central to John’s portrait of Christ as God incarnate."
    },
    {
      "pk": 1181806,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 6,
      "text": "When Jesus said to them, 'I am he,' they drew back and fell to the ground.",
      "links": "<a href='/AIV/19/27/2'>Ps. 27:2</a>; <a href='/AIV/43/7/46'>John 7:46</a>",
      "comment": "Their falling shows the power and authority inherent in Jesus’ divine self-disclosure. Even his enemies are overcome by his presence."
    },
    {
      "pk": 1181807,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 7,
      "text": "Again he asked them, 'Whom do you seek?' They said, 'Jesus of Nazareth.'",
      "links": "<a href='/AIV/43/18/4'>John 18:4</a>",
      "comment": "Jesus asks again, highlighting their accountability, and that he is surrendering intentionally as the Good Shepherd offering himself for his sheep (<a href='/AIV/43/10/14-18'>John 10:14-18</a>)."
    },
    {
      "pk": 1181808,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 8,
      "text": "Jesus answered, 'I told you that I am he. So if you are looking for me, let these men go.'",
      "links": "<a href='/AIV/43/17/12'>John 17:12</a>",
      "comment": "Jesus’ care for his disciples is underscored. He protects them, embodying the Shepherd motif and fulfilling his prayer that none be lost except the son of destruction."
    },
    {
      "pk": 1181809,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 9,
      "text": "This was to fulfill the word he had spoken: 'Of those you gave me, I have lost not one.'",
      "links": "<a href='/AIV/43/6/39'>John 6:39</a>; <a href='/AIV/43/17/12'>John 17:12</a>",
      "comment": "A direct fulfillment of Jesus’ words and of God’s faithfulness. Here, the idea that Christ preserves his own is reinforced, rooting assurance in God’s sovereign will."
    },
    {
      "pk": 1181810,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 10,
      "text": "Then Simon Peter, who had a sword, drew it and struck the high priest’s servant, cutting off his right ear. The servant’s name was Malchus.",
      "links": "<a href='/AIV/40/26/51'>Matt. 26:51</a>; <a href='/AIV/41/14/47'>Mark 14:47</a>",
      "comment": "Peter’s impulsive defense contrasts with Jesus’ acceptance of the Father’s plan. Malchus’ name is unique to John’s account, highlighting eyewitness testimony."
    },
    {
      "pk": 1181811,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 11,
      "text": "So Jesus said to Peter, 'Put your sword into its sheath; shall I not drink the cup the Father has given me?'",
      "links": "<a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "The 'cup' is Scriptural language for suffering, wrath, and God’s will (see Psalm 75:8; Isaiah 51:17). Jesus’ obedience is central to the redemption of mankind."
    },
    {
      "pk": 1181812,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 12,
      "text": "Then the cohort and their commander and the officers of the Jews arrested Jesus and bound him.",
      "links": "",
      "comment": "The binding of Jesus fulfills prophecies of the suffering servant who would be led away for the people's sake (<a href='/AIV/23/53/7'>Isa. 53:7</a>)."
    },
    {
      "pk": 1181813,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 13,
      "text": "First they led him to Annas, for he was the father-in-law of Caiaphas, who was high priest that year.",
      "links": "<a href='/AIV/43/11/49-51'>John 11:49-51</a>",
      "comment": "Annas’ influence points to the political corruption of the high priesthood at this time—an institution Jesus will purify and fulfill as the true High Priest (<a href='/AIV/58/7/26-28'>Heb. 7:26-28</a>)."
    },
    {
      "pk": 1181814,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 14,
      "text": "Caiaphas was the one who had advised the Jews that it would be better for one man to die for the people.",
      "links": "<a href='/AIV/43/11/50'>John 11:50</a>",
      "comment": "Caiaphas’ words become an unintentional prophecy of the substitutionary atonement—Christ would indeed die for the people and gather all God’s children into one (see John 11:51-52)."
    },
    {
      "pk": 1181815,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 15,
      "text": "Simon Peter followed Jesus, and so did another disciple. Since this disciple was known to the high priest, he entered with Jesus into the courtyard of the high priest.",
      "links": "<a href='/AIV/40/26/58'>Matt. 26:58</a>",
      "comment": "Tradition often understands this unnamed disciple as John himself. This eyewitness perspective strengthens the reliability of the account."
    },
    {
      "pk": 1181816,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 16,
      "text": "But Peter stood outside at the door. So the other disciple, who was known to the high priest, went out and spoke to the servant girl who guarded the door, and brought Peter in.",
      "links": "",
      "comment": "Peter’s hesitation and fear contrast with his earlier bravado, reminding readers that human weakness can be restored through grace."
    },
    {
      "pk": 1181817,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 17,
      "text": "The servant girl at the door said to Peter, 'You are not also one of this man’s disciples, are you?' He said, 'I am not.'",
      "links": "<a href='/AIV/40/26/69-70'>Matt. 26:69-70</a>",
      "comment": "Peter’s denial begins, fulfilling Jesus’ foreknowledge and prediction (<a href='/AIV/43/13/38'>John 13:38</a>)."
    },
    {
      "pk": 1181818,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 18,
      "text": "Now the servants and officers stood around a charcoal fire they had made, because it was cold. They were warming themselves, and Peter also was with them, standing and warming himself.",
      "links": "",
      "comment": "The detail of the charcoal fire recalls Peter’s subsequent restoration by Jesus around another charcoal fire in John 21:9, highlighting forgiveness and apostolic leadership."
    },
    {
      "pk": 1181819,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 19,
      "text": "The high priest questioned Jesus about his disciples and his teaching.",
      "links": "",
      "comment": "Jesus’ public ministry aligns with his claim that all he did was in the open, reinforcing the transparency and truthfulness of his mission."
    },
    {
      "pk": 1181820,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 20,
      "text": "Jesus answered him, 'I have spoken openly to the world. I always taught in synagogues and in the temple, where all the Jews come together. I have said nothing in secret.'",
      "links": "<a href='/AIV/43/7/26'>John 7:26</a>",
      "comment": "Jesus emphasizes the public nature of his message, signifying that the gospel is for all and the truth is not hidden."
    },
    {
      "pk": 1181821,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 21,
      "text": "Why do you question me? Question those who have heard what I said to them; they know what I said.'",
      "links": "",
      "comment": "Jesus points to his testimony being supported by witnesses—affirming the principle that the truth is verifiable, and all are called to attest to him."
    },
    {
      "pk": 1181822,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 22,
      "text": "When he had said these things, one of the officers standing nearby struck Jesus with his hand, saying, 'Is that how you answer the high priest?'",
      "links": "",
      "comment": "Jesus’ dignity in the face of abuse fulfills Isaiah’s prophecy that the Messiah would not retaliate but submit in humility (<a href='/AIV/23/50/6'>Isa. 50:6</a>)."
    },
    {
      "pk": 1181823,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 23,
      "text": "Jesus answered him, 'If I have spoken wrongly, testify to the wrong; but if I spoke what is right, why do you strike me?'",
      "links": "",
      "comment": "Christ’s answer highlights his innocence and reflects perfect justice. The call for just testimony relates to Mosaic Law (<a href='/AIV/5/19/15'>Deut. 19:15</a>)."
    },
    {
      "pk": 1181824,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 24,
      "text": "Then Annas sent him, still bound, to Caiaphas the high priest.",
      "links": "<a href='/AIV/40/26/57'>Matt. 26:57</a>",
      "comment": "The transfer between priestly authorities shows political maneuvering. The high priesthood's involvement highlights Jesus’ fulfillment as the true and eternal High Priest (<a href='/AIV/58/7/26-28'>Heb. 7:26-28</a>)."
    },
    {
      "pk": 1181825,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 25,
      "text": "Now Simon Peter stood and warmed himself. So they said to him, 'You are not also one of his disciples, are you?' He denied it and said, 'I am not.'",
      "links": "<a href='/AIV/40/26/71-72'>Matt. 26:71-72</a>",
      "comment": "This is Peter’s second denial. The pattern of three denials fulfills Jesus’ prior prophecy and sets the stage for Peter’s future repentance and important leadership."
    },
    {
      "pk": 1181826,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 26,
      "text": "One of the servants of the high priest, a relative of the man whose ear Peter had cut off, said, 'Did I not see you in the garden with him?'",
      "links": "",
      "comment": "A further opportunity for Peter to be a witness to Christ, which he again fails. His weakness is a reminder of human frailty and the need for mercy and restoration."
    },
    {
      "pk": 1181827,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 27,
      "text": "Peter then denied it again, and immediately the rooster crowed.",
      "links": "<a href='/AIV/43/13/38'>John 13:38</a>",
      "comment": "The crowing rooster confirms Jesus’ prophecy. Peter’s remorse will lead to grace and renewal, modeling repentance for all who stumble."
    },
    {
      "pk": 1181828,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 28,
      "text": "Then they led Jesus from the house of Caiaphas to the governor’s headquarters. It was early morning. They themselves did not enter the headquarters, so that they would not be defiled but could eat the Passover.",
      "links": "<a href='/AIV/2/12/11'>Ex. 12:11</a>; <a href='/AIV/43/11/55'>John 11:55</a>",
      "comment": "The leaders’ scrupulousness about ritual purity while plotting Jesus’ death reveals the contrast between external observance and internal corruption. The Passover context ties Jesus' sacrifice directly to the new Exodus and redemption."
    },
    {
      "pk": 1181829,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 29,
      "text": "So Pilate went outside to them and said, 'What accusation do you bring against this man?'",
      "links": "",
      "comment": "Pilate’s questioning initiates Jesus’ Roman trial, affirming his innocence before worldly powers even while fulfilling God’s greater plan."
    },
    {
      "pk": 1181830,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 30,
      "text": "They answered him, 'If this man were not a criminal, we would not have handed him over to you.'",
      "links": "",
      "comment": "The vague accusation against Jesus fulfills the suffering servant prophecies, where the righteous one is condemned unjustly."
    },
    {
      "pk": 1181831,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 31,
      "text": "Pilate said to them, 'Take him yourselves and judge him by your own law.' The Jews said to him, 'It is not lawful for us to put anyone to death.'",
      "links": "<a href='/AIV/43/19/6-7'>John 19:6-7</a>",
      "comment": "This highlights Roman authority over executions. It fulfills the prophecy that the Messiah would be 'lifted up' (crucifixion), not stoned according to Jewish law (<a href='/AIV/43/3/14'>John 3:14</a>)."
    },
    {
      "pk": 1181832,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 32,
      "text": "This was to fulfill the word that Jesus had spoken to show by what kind of death he was going to die.",
      "links": "<a href='/AIV/43/12/32-33'>John 12:32-33</a>",
      "comment": "Jesus’ predictions about being 'lifted up' refer to the manner of death—crucifixion—which indicated both suffering and redemption, connecting to Old Testament types (Num. 21:9)."
    },
    {
      "pk": 1181833,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 33,
      "text": "So Pilate entered his headquarters again and called Jesus and said to him, 'Are you the King of the Jews?'",
      "links": "<a href='/AIV/40/27/11'>Matt. 27:11</a>",
      "comment": "Pilate’s question focuses on Jesus’ kingship—a central theme in messianic prophecy (<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>)."
    },
    {
      "pk": 1181834,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 34,
      "text": "Jesus answered, 'Do you say this of yourself, or did others tell you about me?'",
      "links": "",
      "comment": "Jesus challenges Pilate’s understanding, distinguishing between political and spiritual kingship. Christ’s kingdom is not of this world."
    },
    {
      "pk": 1181835,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 35,
      "text": "Pilate answered, 'Am I a Jew? Your own nation and the chief priests have handed you over to me. What have you done?'",
      "links": "",
      "comment": "Pilate expresses confusion about intra-Jewish matters; Jesus’ trial is being pushed by his own people, fulfilling the prophecies of the rejected stone (see Psalm 118:22)."
    },
    {
      "pk": 1181836,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 36,
      "text": "Jesus replied, 'My kingdom is not of this world. If my kingdom were of this world, my servants would have been fighting, so that I might not be delivered over to the Jews. But now my kingdom is not from here.'",
      "links": "<a href='/AIV/42/17/20-21'>Luke 17:20-21</a>",
      "comment": "Jesus reveals his reign as spiritual and transcendent, not based on worldly power—a fulfillment of Daniel’s vision (<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>). This kingship is the foundation of Christ's one, holy, apostolic church."
    },
    {
      "pk": 1181837,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 37,
      "text": "Then Pilate said to him, 'So you are a king?' Jesus answered, 'You say that I am a king. For this reason I was born, and for this reason I have come into the world—to bear witness to the truth. Everyone who is of the truth listens to my voice.'",
      "links": "<a href='/AIV/43/10/27'>John 10:27</a>; <a href='/AIV/18/19/25'>Job 19:25</a>",
      "comment": "Jesus affirms his kingship yet links it to truth. Echoes of God’s kingship and the prophetic expectation of the Messiah as a truth-bearer abound. His voice gathering his flock foreshadows apostolic leadership."
    },
    {
      "pk": 1181838,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 38,
      "text": "Pilate said to him, 'What is truth?' After he had said this, he went out to the Jews again and said to them, 'I find no guilt in him.'",
      "links": "<a href='/AIV/23/53/9'>Isa. 53:9</a>",
      "comment": "Pilate is unable to grasp the truth—a reflection on humanity’s need for revelation. Jesus is declared innocent, fulfilling the prophecy of the righteous sufferer (<a href='/AIV/23/53/11'>Isa. 53:11</a>)."
    },
    {
      "pk": 1181839,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 39,
      "text": "But you have a custom that I should release one man for you at the Passover. So do you want me to release to you the King of the Jews?'",
      "links": "",
      "comment": "Pilate attempts to release Jesus as an act of mercy, showing passover themes of release and redemption."
    },
    {
      "pk": 1181840,
      "translation": "AIV",
      "book": 43,
      "chapter": 18,
      "verse": 40,
      "text": "They cried out again, 'Not this man, but Barabbas!' Now Barabbas was a robber.",
      "links": "<a href='/AIV/40/27/15-21'>Matt. 27:15-21</a>",
      "comment": "Barabbas, meaning 'son of the father', is chosen over the true Son of the Father. This substitution powerfully illustrates the meaning of Christ’s atonement: the guilty is released and the innocent takes his place."
    }
  ],
  "translatedAt": "2025-12-23T03:10:55.536Z"
}