{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 13,
  "verses": [
    {
      "pk": 4313001,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 1,
      "text": "Now before the Feast of the Passover, Jesus knew that his hour had come to leave this world and go to the Father. Having loved his own who were in the world, he loved them to the end.",
      "links": "<a href='/AIV/42/9/51'>Luke 9:51</a>; <a href='/AIV/43/12/23'>John 12:23</a>",
      "comment": "Jesus' knowledge of 'his hour' is a reference to his divine mission and the fulfillment of prophecy. Notice his enduring love is highlighted, showing his complete self-giving."
    },
    {
      "pk": 4313002,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 2,
      "text": "During supper, when the devil had already put it into the heart of Judas Iscariot, Simon's son, to betray him,",
      "links": "<a href='/AIV/40/26/14-16'>Matt. 26:14–16</a>; <a href='/AIV/42/22/3-6'>Luke 22:3–6</a>",
      "comment": "The mention of the devil emphasizes the spiritual dimension of betrayal and foreshadows the passion of Christ."
    },
    {
      "pk": 4313003,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 3,
      "text": "Jesus, knowing that the Father had given all things into his hands, and that he had come from God and was going back to God,",
      "links": "<a href='/AIV/40/11/27'>Matt. 11:27</a>; <a href='/AIV/43/16/28'>John 16:28</a>",
      "comment": "This asserts Jesus' divine authority and identity. He acts with full knowledge of his origin and destiny, reinforcing his divinity."
    },
    {
      "pk": 4313004,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 4,
      "text": "rose from supper. He laid aside his outer garments, and taking a towel, tied it around himself.",
      "links": "<a href='/AIV/50/2/7'>Phil. 2:7</a>",
      "comment": "Jesus' humility in action shows the true leadership style he presents—servant leadership. Taking a towel is symbolic of taking the role of a servant."
    },
    {
      "pk": 4313005,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 5,
      "text": "Then he poured water into a basin and began to wash the disciples' feet and to wipe them with the towel that was wrapped around him.",
      "links": "<a href='/AIV/40/20/28'>Matt. 20:28</a>",
      "comment": "Washing feet was the work of the lowliest servant. Jesus teaching by example sets up the importance of humility and loving service in the Christian life."
    },
    {
      "pk": 4313006,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 6,
      "text": "He came to Simon Peter, who said to him, 'Lord, do you wash my feet?'",
      "links": "<a href='/AIV/40/3/14'>Matt. 3:14</a>",
      "comment": "Peter’s initial refusal shows his respect but also his misunderstanding of Jesus’ redemptive mission."
    },
    {
      "pk": 4313007,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 7,
      "text": "Jesus answered him, 'What I am doing you do not understand now, but afterward you will understand.'",
      "links": "<a href='/AIV/43/12/16'>John 12:16</a>",
      "comment": "The deeper meaning of Jesus’ actions would only be clear after his Passion and Resurrection, indicating a future revelation and spiritual understanding."
    },
    {
      "pk": 4313008,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 8,
      "text": "Peter said to him, 'You shall never wash my feet.' Jesus answered him, 'If I do not wash you, you have no part with me.'",
      "links": "<a href='/AIV/40/16/23'>Matt. 16:23</a>; <a href='/AIV/43/15/3'>John 15:3</a>",
      "comment": "The necessity of cleansing is spiritually linked to participation in Christ. This foreshadows the sacramental reality of being united to Christ through an act instituted by him."
    },
    {
      "pk": 4313009,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 9,
      "text": "Simon Peter said to him, 'Lord, not my feet only but also my hands and my head!'",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>",
      "comment": "Peter’s response shows his desire for complete communion with Jesus, despite not yet understanding the symbolism of Jesus’ action."
    },
    {
      "pk": 4313010,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 10,
      "text": "Jesus said to him, 'The one who has bathed does not need to wash, except for his feet, but is completely clean. And you are clean, but not all of you.'",
      "links": "<a href='/AIV/43/6/70'>John 6:70</a>",
      "comment": "This verse has a dual meaning: physical cleanliness and spiritual purity, pointing to the distinction between those truly belonging to Jesus and those among them who are not spiritually clean."
    },
    {
      "pk": 4313011,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 11,
      "text": "For he knew who was going to betray him; that was why he said, 'Not all of you are clean.'",
      "links": "<a href='/AIV/43/6/64'>John 6:64</a>",
      "comment": "Allusion to Judas, showing Christ’s foreknowledge and reinforcing his divine awareness."
    },
    {
      "pk": 4313012,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 12,
      "text": "When he had washed their feet and put on his outer garments, he resumed his place and said to them, 'Do you understand what I have done to you?'",
      "links": "",
      "comment": "Jesus moves from symbolic action to interpretation, which is a didactic method used throughout his ministry."
    },
    {
      "pk": 4313013,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 13,
      "text": "'You call me Teacher and Lord, and you are right, for so I am.'",
      "links": "<a href='/AIV/40/23/8'>Matt. 23:8</a>",
      "comment": "Jesus affirms his titles, strengthening his identity and authority."
    },
    {
      "pk": 4313014,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 14,
      "text": "If I then, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet.",
      "links": "<a href='/AIV/50/2/5'>Phil. 2:5</a>",
      "comment": "He commands imitation of his humility—not just physically, but spiritually in serving one another."
    },
    {
      "pk": 4313015,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 15,
      "text": "For I have given you an example, that you should do just as I have done to you.",
      "links": "<a href='/AIV/40/20/26-28'>Matt. 20:26–28</a>",
      "comment": "Establishes his action as a model for the community and its leaders. This provides a precedent for seeking holiness through imitation of Christ."
    },
    {
      "pk": 4313016,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 16,
      "text": "Truly, truly, I say to you, a servant is not greater than his master, nor is a messenger greater than the one who sent him.",
      "links": "<a href='/AIV/40/10/24'>Matt. 10:24</a>",
      "comment": "Christians are to imitate Christ’s humility. This also relates to later structures of leadership in the apostolic community."
    },
    {
      "pk": 4313017,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 17,
      "text": "If you know these things, blessed are you if you do them.",
      "links": "<a href='/AIV/40/7/24-27'>Matt. 7:24–27</a>",
      "comment": "Knowledge alone is not sufficient; active obedience brings blessing—reinforcing the value of works."
    },
    {
      "pk": 4313018,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 18,
      "text": "I am not speaking about all of you; I know those whom I have chosen. But that the Scripture may be fulfilled, 'He who eats my bread has lifted up his heel against me.'",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Jesus points to prophetic fulfillment, quoting the Psalms. This underscores the unity of Old and New Testaments."
    },
    {
      "pk": 4313019,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 19,
      "text": "I am telling you this now, before it takes place, so that when it does happen you may believe that I am he.",
      "links": "<a href='/AIV/43/8/24'>John 8:24</a>",
      "comment": "'I am he' echoes God's self-identification in Exodus 3:14 (I AM), signaling divinity."
    },
    {
      "pk": 4313020,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 20,
      "text": "Truly, truly, I say to you, whoever receives the one I send receives me, and whoever receives me receives the one who sent me.'",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>",
      "comment": "This reveals the authority given to Christ’s representatives. Spiritual unity is emphasized between the Lord, his messengers, and the Father."
    },
    {
      "pk": 4313021,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 21,
      "text": "After saying these things, Jesus was troubled in spirit, and testified, 'Truly, truly, I say to you, one of you will betray me.'",
      "links": "<a href='/AIV/41/14/18'>Mark 14:18</a>",
      "comment": "Jesus’ emotional turmoil shows his humanity, while his foreknowledge again signals divinity."
    },
    {
      "pk": 4313022,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 22,
      "text": "The disciples looked at one another, uncertain of whom he spoke.",
      "links": "",
      "comment": "The disciples’ confusion demonstrates the mystery of Judas’ betrayal and Christ’s wisdom in not revealing everything immediately."
    },
    {
      "pk": 4313023,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 23,
      "text": "One of his disciples, whom Jesus loved, was reclining at the table at Jesus' side.",
      "links": "<a href='/AIV/43/19/26'>John 19:26</a>",
      "comment": "Traditionally, this beloved disciple is identified with John. His closeness to Jesus is often seen as representing intimate spiritual friendship with the Lord."
    },
    {
      "pk": 4313024,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 24,
      "text": "So Simon Peter motioned to him to ask Jesus of whom he was speaking.",
      "links": "",
      "comment": "Peter takes the initiative, showing his role as a leader among the apostles."
    },
    {
      "pk": 4313025,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 25,
      "text": "So that disciple, leaning back against Jesus, said to him, 'Lord, who is it?'",
      "links": "",
      "comment": "This act of leaning on Jesus shows a special relationship of trust and love—a model for disciples’ intimacy with Christ."
    },
    {
      "pk": 4313026,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 26,
      "text": "Jesus answered, 'It is he to whom I will give this piece of bread when I have dipped it.' So when he had dipped the bread, he gave it to Judas, the son of Simon Iscariot.",
      "links": "<a href='/AIV/40/26/23'>Matt. 26:23</a>",
      "comment": "Sharing bread at the table points to intimacy, making the betrayal even more egregious. This act also prefigures the betrayal at the Eucharistic table."
    },
    {
      "pk": 4313027,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 27,
      "text": "After he received the piece of bread, Satan entered into him. Jesus said to him, 'What you are going to do, do quickly.'",
      "links": "<a href='/AIV/43/6/70-71'>John 6:70–71</a>",
      "comment": "Judas’s decision is allowed in God’s providence. The phrase 'do quickly' shows Jesus’ control over the unfolding events."
    },
    {
      "pk": 4313028,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 28,
      "text": "Now none of those reclining at the table knew why he said this to him.",
      "links": "",
      "comment": "The disciples remain unaware, highlighting the mystery behind God’s salvific plan."
    },
    {
      "pk": 4313029,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 29,
      "text": "Some thought, because Judas had the money bag, that Jesus was telling him, 'Buy what we need for the feast,' or that he should give something to the poor.",
      "links": "",
      "comment": "Judas’ responsibility for the money bag shows there was structure and a treasurer among the apostles—foreshadowing administrative roles in the growing church."
    },
    {
      "pk": 4313030,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 30,
      "text": "So, after receiving the piece of bread, Judas immediately went out. And it was night.",
      "links": "<a href='/AIV/41/14/17'>Mark 14:17</a>",
      "comment": "The mention of 'night' is both literal and symbolic, referring to spiritual darkness enveloping Judas and the world."
    },
    {
      "pk": 4313031,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 31,
      "text": "When he had gone out, Jesus said, 'Now is the Son of Man glorified, and God is glorified in him.'",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13–14</a>, <a href='/AIV/43/12/23'>John 12:23</a>",
      "comment": "The use of 'Son of Man' invokes Daniel 7 and implies Jesus’ divine messiahship. His imminent death will reveal the true glory of God."
    },
    {
      "pk": 4313032,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 32,
      "text": "If God is glorified in him, God will also glorify him in himself, and will glorify him at once.",
      "links": "<a href='/AIV/43/17/1-5'>John 17:1–5</a>",
      "comment": "The interplay of glorification points to the unity of Jesus with the Father. The work of redemption is immediate and complete in Christ."
    },
    {
      "pk": 4313033,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 33,
      "text": "'Little children, I am with you only a little while longer. You will seek me, and just as I said to the Jews, so now I say to you, Where I am going, you cannot come.'",
      "links": "<a href='/AIV/43/7/34'>John 7:34</a>",
      "comment": "'Little children' expresses pastoral affection, reinforcing Jesus’ role as both Teacher and Shepherd."
    },
    {
      "pk": 4313034,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 34,
      "text": "A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another.",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/43/15/12'>John 15:12</a>",
      "comment": "The command to love with the measure of Christ’s own love marks the newness. This becomes the central ethic for Christian community."
    },
    {
      "pk": 4313035,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 35,
      "text": "By this all people will know that you are my disciples, if you have love for one another.'",
      "links": "<a href='/AIV/62/3/14'>1 John 3:14</a>",
      "comment": "Brotherly love is the defining mark of authentic discipleship and the true community established by Christ."
    },
    {
      "pk": 4313036,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 36,
      "text": "Simon Peter said to him, 'Lord, where are you going?' Jesus answered, 'Where I am going you cannot follow now, but you will follow afterward.'",
      "links": "<a href='/AIV/43/21/18-19'>John 21:18–19</a>",
      "comment": "Foreshadowing Peter’s future martyrdom and ultimate union with Christ. It highlights the journey of discipleship."
    },
    {
      "pk": 4313037,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 37,
      "text": "Peter said to him, 'Lord, why can I not follow you now? I will lay down my life for you.'",
      "links": "<a href='/AIV/40/26/33-35'>Matt. 26:33–35</a>",
      "comment": "Peter’s zeal is sincere, though he is yet unaware of his own weakness. The text subtly points to the necessity of grace to persevere."
    },
    {
      "pk": 4313038,
      "translation": "AIV",
      "book": 43,
      "chapter": 13,
      "verse": 38,
      "text": "Jesus answered, 'Will you lay down your life for me? Truly, truly, I say to you, before the rooster crows, you will deny me three times.'",
      "links": "<a href='/AIV/40/26/75'>Matt. 26:75</a>",
      "comment": "Jesus’ prophecy of Peter’s denial underscores Christ’s foreknowledge and Peter’s need for repentance and restoration—a pattern for the repentance and forgiveness cycles in Christian discipleship."
    }
  ],
  "translatedAt": "2025-12-23T03:08:16.729Z"
}