{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 10,
  "verses": [
    {
      "pk": 4010001,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 1,
      "text": "Truly, truly, I say to you, whoever does not enter the sheepfold by the gate but climbs in by some other way is a thief and a robber.",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>",
      "comment": "Jesus uses the image of a sheepfold, a common motif for Israel. He sets up a clear distinction between true shepherds and false leaders, alluding to Old Testament warnings against unfaithful shepherds of Israel (Ezekiel 34:2)."
    },
    {
      "pk": 4010002,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 2,
      "text": "But the one who enters by the gate is the shepherd of the sheep.",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "The shepherd is permitted entry, contrasting with the thief and pointing to a legitimate spiritual leader. Psalm 23:1 is echoed here, emphasizing God's care."
    },
    {
      "pk": 4010003,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 3,
      "text": "The gatekeeper opens the gate for him, and the sheep hear his voice; he calls his own sheep by name and leads them out.",
      "links": "<a href='/AIV/23/40/11'>Isa. 40:11</a>",
      "comment": "Jesus describes intimate leadership, where the sheep recognize and respond to the shepherd's voice. Isaiah 40:11 points to the messianic Shepherd's care, fulfilled in Christ's personal call."
    },
    {
      "pk": 4010004,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 4,
      "text": "When he has brought out all his own, he goes ahead of them, and the sheep follow him because they know his voice.",
      "links": "<a href='/AIV/43/21/17'>John 21:17</a>",
      "comment": "The shepherd leads personally, implying guidance and protection. The relationship here anticipates the unique authority and recognition given to Christ’s appointed shepherds (see John 21:17)."
    },
    {
      "pk": 4010005,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 5,
      "text": "They will not follow a stranger, but will flee from him, because they do not recognize the voice of strangers.",
      "links": "<a href='/AIV/24/23/1-2'>Jer. 23:1-2</a>",
      "comment": "Sheep naturally avoid imposters. This underscores the importance of true, authentic leadership that can only come from one called and recognized by God (see Jeremiah 23:1–2)."
    },
    {
      "pk": 4010006,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 6,
      "text": "Jesus used this figure of speech with them, but they did not understand what he was telling them.",
      "links": "<a href='/AIV/40/13/13'>Matt. 13:13</a>",
      "comment": "Jesus often spoke in metaphors that required spiritual discernment, much like his use of parables (see Matthew 13:13)."
    },
    {
      "pk": 4010007,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 7,
      "text": "So Jesus said again, \"Truly, truly, I say to you, I am the gate for the sheep.\"",
      "links": "<a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "This ‘I am’ statement is a claim to divinity, echoing God’s self-identification in the Old Testament (Exodus 3:14). Jesus reveals himself as the exclusive way to salvation (John 14:6)."
    },
    {
      "pk": 4010008,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 8,
      "text": "All who came before me are thieves and robbers, but the sheep did not listen to them.",
      "links": "<a href='/AIV/26/34/4'>Ezek. 34:4</a>",
      "comment": "All previous false leaders are condemned, as in Ezekiel 34:4. The true sheep are those who respond only to the authentic voice of the Shepherd."
    },
    {
      "pk": 4010009,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 9,
      "text": "I am the gate. If anyone enters through me, he will be saved, and will come in and go out and find pasture.",
      "links": "<a href='/AIV/19/23/2'>Ps. 23:2</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "Jesus offers safety and spiritual sustenance. This also points to Jesus as the exclusive path for salvation, an echo of John 14:6 and Psalm 23:2."
    },
    {
      "pk": 4010010,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 10,
      "text": "The thief comes only to steal, kill, and destroy. I came that they may have life and have it abundantly.",
      "links": "<a href='/AIV/26/34/3'>Ezek. 34:3</a>",
      "comment": "Contrast between false and true leadership. Christ gives life, fulfilling messianic hope for fullness and flourishing, distinct from destruction brought by imposters (Ezekiel 34:3)."
    },
    {
      "pk": 4010011,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 11,
      "text": "I am the good shepherd. The good shepherd lays down his life for the sheep.",
      "links": "<a href='/AIV/26/34/23'>Ezek. 34:23</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "Another divine ‘I am’ claim, identifying Jesus as the prophesied Shepherd-Messiah who sacrifices himself for his flock (see Ezekiel 34:23; fulfillment in the cross)."
    },
    {
      "pk": 4010012,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 12,
      "text": "The hired hand, not being the shepherd, and not owning the sheep, sees the wolf coming and abandons the sheep and flees. Then the wolf snatches and scatters them.",
      "links": "<a href='/AIV/26/34/5'>Ezek. 34:5</a>",
      "comment": "Hired hands lack commitment; wolves represent dangers from without. Only the true Shepherd protects fully (Ezekiel 34:5)."
    },
    {
      "pk": 4010013,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 13,
      "text": "He flees because he is a hired hand and cares nothing for the sheep.",
      "links": "",
      "comment": "Emphasizes the self-sacrificial nature of Christ’s leadership over mere functionaries, a theme central to the understanding of true spiritual authority and pastoral care."
    },
    {
      "pk": 4010014,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 14,
      "text": "\"I am the good shepherd. I know my own, and my own know me,",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "This mutual intimate knowledge points not only to personal relationship, but to a deeper spiritual union and the abiding authority within the flock (Psalm 100:3)."
    },
    {
      "pk": 4010015,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 15,
      "text": "just as the Father knows me, and I know the Father; and I lay down my life for the sheep.",
      "links": "<a href='/AIV/43/17/21'>John 17:21</a>",
      "comment": "Christ’s knowledge of the Father symbolizes the Trinitarian relationship, anticipating his sacrifice and demonstrating true obedience and unity in mission (John 17:21)."
    },
    {
      "pk": 4010016,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 16,
      "text": "I have other sheep that are not of this fold. I must bring them also, and they will listen to my voice. Then there will be one flock, one shepherd.",
      "links": "<a href='/AIV/23/56/8'>Isa. 56:8</a>; <a href='/AIV/49/2/14'>Eph. 2:14</a>",
      "comment": "The 'other sheep' point to gentiles brought into unity, foreshadowing a single, visible, unified Church, with Christ as singular authority (Isaiah 56:8; Eph. 2:14)."
    },
    {
      "pk": 4010017,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 17,
      "text": "For this reason the Father loves me, because I lay down my life so that I may take it up again.",
      "links": "<a href='/AIV/43/2/19'>John 2:19</a>",
      "comment": "Christ’s willing sacrifice fulfills the Father's plan and points toward the Resurrection, highlighting the necessity of obedience and voluntary self-giving (John 2:19)."
    },
    {
      "pk": 4010018,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 18,
      "text": "No one takes it from me, but I lay it down of my own accord. I have authority to lay it down, and I have authority to take it up again. This charge I have received from my Father.\"",
      "links": "<a href='/AIV/40/26/53'>Matt. 26:53</a>",
      "comment": "Authority over life and death is a divine prerogative, furthering the claim to divinity. The voluntary nature of Christ’s sacrifice is reiterated as an act of obedience (Matt. 26:53)."
    },
    {
      "pk": 4010019,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 19,
      "text": "Again there was a division among the Jews because of these words.",
      "links": "<a href='/AIV/43/9/16'>John 9:16</a>",
      "comment": "Jesus’ words provoked controversy, as claims of divine prerogatives challenged existing religious leadership and traditions (John 9:16)."
    },
    {
      "pk": 4010020,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 20,
      "text": "Many of them said, \"He has a demon and is insane; why listen to him?\"",
      "links": "<a href='/AIV/43/8/48'>John 8:48</a>",
      "comment": "Opposition to Jesus is strong, with accusations of madness and demonic possession echoing previous confrontations (John 8:48)."
    },
    {
      "pk": 4010021,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 21,
      "text": "Others said, \"These are not the words of one possessed by a demon. Can a demon open the eyes of the blind?\"",
      "links": "<a href='/AIV/43/9/32'>John 9:32</a>",
      "comment": "Supporters highlight Jesus' miraculous works as evidence of divine activity, referencing his healing miracles (John 9:32)."
    },
    {
      "pk": 4010022,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 22,
      "text": "At that time the Feast of Dedication took place in Jerusalem. It was winter,",
      "links": "",
      "comment": "The Feast of Dedication (Hanukkah) commemorates the rededication of the temple, a fitting context for Jesus’ claims about himself as the true dwelling of God among his people."
    },
    {
      "pk": 4010023,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 23,
      "text": "and Jesus was walking in the temple, in Solomon’s porch.",
      "links": "<a href='/AIV/44/3/11'>Acts 3:11</a>",
      "comment": "Solomon’s porch is a significant place of teaching and gathering, later featured in the early church’s ministry (Acts 3:11)."
    },
    {
      "pk": 4010024,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 24,
      "text": "So the Jews gathered around him and said, \"How long will you keep us in suspense? If you are the Christ, tell us plainly.\"",
      "links": "<a href='/AIV/43/8/25'>John 8:25</a>",
      "comment": "The question reveals a desire for explicit messianic claims, which Jesus both reveals and veils throughout his ministry (John 8:25)."
    },
    {
      "pk": 4010025,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 25,
      "text": "Jesus answered them, \"I told you, and you do not believe. The works I do in my Father’s name bear witness about me,",
      "links": "<a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Jesus points to his miracles as evidence of his identity and authority, echoing testimony by works as in John 5:36."
    },
    {
      "pk": 4010026,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 26,
      "text": "but you do not believe because you are not part of my sheep.",
      "links": "<a href='/AIV/43/8/47'>John 8:47</a>",
      "comment": "Faith and belonging to Christ’s flock are intimately connected. Not all hear or respond to his voice (John 8:47)."
    },
    {
      "pk": 4010027,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 27,
      "text": "My sheep hear my voice, and I know them, and they follow me.",
      "links": "<a href='/AIV/43/10/3'>John 10:3</a>",
      "comment": "Emphasizes recognition and obedience, repeating the earlier theme of the personal relationship between Christ and believers."
    },
    {
      "pk": 4010028,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 28,
      "text": "I give them eternal life, and they will never perish, and no one will snatch them out of my hand.",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>; <a href='/AIV/43/6/39'>John 6:39</a>",
      "comment": "Jesus' gift of eternal life shows divine authority. The security of salvation underlines the lasting protection within the true fold (John 6:39)."
    },
    {
      "pk": 4010029,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 29,
      "text": "My Father, who has given them to me, is greater than all; and no one can snatch them out of the Father’s hand.",
      "links": "<a href='/AIV/43/17/2'>John 17:2</a>",
      "comment": "Indicates divine sovereignty in the salvation of believers. Those given by the Father to Christ are eternally secure (John 17:2)."
    },
    {
      "pk": 4010030,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 30,
      "text": "I and the Father are one.\"",
      "links": "<a href='/AIV/43/1/1'>John 1:1</a>; <a href='/AIV/05/6/4'>Deut. 6:4</a>",
      "comment": "This is a direct claim to divinity and unity with the Father, echoing the Shema of Deuteronomy 6:4 and the Logos theology in John 1:1."
    },
    {
      "pk": 4010031,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 31,
      "text": "The Jews picked up stones again to stone him.",
      "links": "<a href='/AIV/03/24/16'>Lev. 24:16</a>",
      "comment": "The response is blasphemy charges, showing they understood the claim to divinity as worthy of death under the Law (Leviticus 24:16)."
    },
    {
      "pk": 4010032,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 32,
      "text": "Jesus answered them, \"I have shown you many good works from the Father; for which of them are you going to stone me?\"",
      "links": "<a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Jesus appeals to his miracles as proof that his mission is from God, seeking to clarify the reason for rejection involves deeper spiritual blindness."
    },
    {
      "pk": 4010033,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 33,
      "text": "The Jews answered him, \"We do not stone you for a good work but for blasphemy, because you, though a man, make yourself God.\"",
      "links": "<a href='/AIV/43/5/18'>John 5:18</a>",
      "comment": "The crowd directly affirms Jesus' claim to divinity, recognizing his words as a declaration of unity with God (John 5:18)."
    },
    {
      "pk": 4010034,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 34,
      "text": "Jesus replied, \"Is it not written in your Law, 'I said, you are gods'?\"",
      "links": "<a href='/AIV/19/82/6'>Ps. 82:6</a>",
      "comment": "Jesus cites Psalm 82:6, affirming that Scripture refers to human judges as 'gods,' thus exposing the irony in their accusations."
    },
    {
      "pk": 4010035,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 35,
      "text": "If he called them gods to whom the word of God came— and Scripture cannot be broken—",
      "links": "<a href='/AIV/40/5/18'>Matt. 5:18</a>",
      "comment": "Jesus affirms the inviolability of Scripture (Matt. 5:18), showing the enduring authority and unity of God’s revelation."
    },
    {
      "pk": 4010036,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 36,
      "text": "do you say of him whom the Father consecrated and sent into the world, 'You are blaspheming,' because I said, 'I am the Son of God'?",
      "links": "<a href='/AIV/43/6/69'>John 6:69</a>",
      "comment": "Jesus sets apart his consecration and mission, claiming unique sonship and divine authority, which is a high Christology assertion (John 6:69)."
    },
    {
      "pk": 4010037,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 37,
      "text": "If I am not doing the works of my Father, then do not believe me;",
      "links": "<a href='/AIV/43/15/24'>John 15:24</a>",
      "comment": "Jesus appeals to his miraculous works as evidence; without them, his claims would lack credibility (John 15:24)."
    },
    {
      "pk": 4010038,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 38,
      "text": "but if I do them, even though you do not believe me, believe the works, so that you may know and understand that the Father is in me and I am in the Father.\"",
      "links": "<a href='/AIV/43/14/11'>John 14:11</a>",
      "comment": "Christ expresses his intimate unity with the Father, a central mystery. The works validate that divine life and presence dwell in him (John 14:11)."
    },
    {
      "pk": 4010039,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 39,
      "text": "Again they tried to arrest him, but he escaped from their hands.",
      "links": "<a href='/AIV/43/7/30'>John 7:30</a>",
      "comment": "Repeated attempts to seize Jesus emphasize his sovereign control over his mission and timing (John 7:30)."
    },
    {
      "pk": 4010040,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 40,
      "text": "He went away again across the Jordan to the place where John had been baptizing at first, and he remained there.",
      "links": "<a href='/AIV/43/1/28'>John 1:28</a>",
      "comment": "Jesus retreats to the site of John’s ministry, suggesting a continuity with earlier revelation and fulfilling the expectation of John’s preparatory work."
    },
    {
      "pk": 4010041,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 41,
      "text": "Many came to him and said, \"John did no sign, but everything John said about this man was true.\"",
      "links": "<a href='/AIV/43/1/34'>John 1:34</a>",
      "comment": "John’s testimony is confirmed, highlighting prophetic witness pointing to Jesus’ divine origin (John 1:34)."
    },
    {
      "pk": 4010042,
      "translation": "AIV",
      "book": 43,
      "chapter": 10,
      "verse": 42,
      "text": "And many believed in him there.",
      "links": "<a href='/AIV/43/2/11'>John 2:11</a>",
      "comment": "The chapter closes with faith being produced by witness and works. Jesus gathers his flock in unity, consistent with the promise of one shepherd and one flock—a spiritual unity that reflects the visible unity of the Church."
    }
  ],
  "translatedAt": "2025-12-23T03:05:47.896Z"
}