{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 4,
  "verses": [
    {
      "pk": 1940001,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 1,
      "text": "When Jesus learned that the Pharisees had heard that he was making and baptizing more disciples than John—",
      "links": "<a href='/AIV/40/3/6'>Matt. 3:6</a>; <a href='/AIV/41/1/5'>Mark 1:5</a>",
      "comment": "Notice the spread of Jesus’ ministry and the comparison to John the Baptist. Baptism here remains a central sacramental action."
    },
    {
      "pk": 1940002,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 2,
      "text": "although Jesus himself was not baptizing, but his disciples were—",
      "links": "<a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "Jesus delegates baptism to his followers, highlighting the importance of apostolic ministry for sacramental acts."
    },
    {
      "pk": 1940003,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 3,
      "text": "he left Judea and went again into Galilee.",
      "links": "<a href='/AIV/40/4/12'>Matt. 4:12</a>",
      "comment": "Jesus’ itinerant ministry moves north, fulfilling prophecy about the regions he would visit."
    },
    {
      "pk": 1940004,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 4,
      "text": "He had to pass through Samaria.",
      "links": "<a href='/AIV/42/9/52-53'>Luke 9:52-53</a>",
      "comment": "Jews and Samaritans had significant religious differences. Jesus' journey through Samaria shows his mission extends beyond traditional boundaries."
    },
    {
      "pk": 1940005,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 5,
      "text": "So he came to a town of Samaria called Sychar, near the field that Jacob had given to his son Joseph.",
      "links": "<a href='/AIV/01/33/19'>Gen. 33:19</a>; <a href='/AIV/06/24/32'>Josh. 24:32</a>",
      "comment": "The reference connects Jesus’ ministry to the patriarchs, showing fulfillment of the Old Testament promise."
    },
    {
      "pk": 1940006,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 6,
      "text": "Jacob’s well was there. So Jesus, wearied as he was from the journey, sat down by the well. It was about the sixth hour.",
      "links": "<a href='/AIV/01/29/10'>Gen. 29:10</a>",
      "comment": "Jesus’ humanity is highlighted—he experiences fatigue. The noon hour sets the scene for a significant encounter."
    },
    {
      "pk": 1940007,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 7,
      "text": "A woman from Samaria came to draw water. Jesus said to her, \"Give me a drink.\"",
      "links": "<a href='/AIV/42/7/36-50'>Luke 7:36-50</a>",
      "comment": "Jesus initiates a conversation across deep societal and religious divides, showing the universal reach of his mission."
    },
    {
      "pk": 1940008,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 8,
      "text": "For his disciples had gone into the town to buy food.",
      "links": "<a href='/AIV/43/4/27'>John 4:27</a>",
      "comment": "The setting isolates Jesus and the woman, enabling a profound personal dialogue."
    },
    {
      "pk": 1940009,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 9,
      "text": "The Samaritan woman said to him, \"How is it that you, a Jew, ask for a drink from me, a Samaritan woman?\" (For Jews have no dealings with Samaritans.)",
      "links": "<a href='/AIV/42/10/33'>Luke 10:33</a>",
      "comment": "Hostility between Jews and Samaritans makes Jesus’ request surprising. He seeks to break barriers of hostility."
    },
    {
      "pk": 1940010,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 10,
      "text": "Jesus answered her, \"If you knew the gift of God, and who it is who is saying to you, ‘Give me a drink,’ you would have asked him, and he would have given you living water.\"",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/43/7/38'>John 7:38</a>",
      "comment": "Living water points to spiritual life and the Holy Spirit. Jesus hints at his divine ability to provide eternal life (cf. John 7:38)."
    },
    {
      "pk": 1940011,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 11,
      "text": "The woman said to him, \"Sir, you have nothing to draw with, and the well is deep. Where do you get that living water?\"",
      "links": "<a href='/AIV/43/3/4'>John 3:4</a>",
      "comment": "She misunderstands Jesus’ spiritual message, focusing on physical needs. This motif recurs in John (cf. Nicodemus)."
    },
    {
      "pk": 1940012,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 12,
      "text": "Are you greater than our father Jacob? He gave us the well and drank from it himself, with his sons and his livestock.\"",
      "links": "<a href='/AIV/01/33/19'>Gen. 33:19</a>",
      "comment": "She appeals to tradition and lineage, unaware she is speaking to one greater than Jacob."
    },
    {
      "pk": 1940013,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 13,
      "text": "Jesus answered her, \"Everyone who drinks this water will be thirsty again,",
      "links": "<a href='/AIV/43/6/35'>John 6:35</a>",
      "comment": "Earthly things cannot satisfy eternal needs; Jesus contrasts the temporary with the eternal."
    },
    {
      "pk": 1940014,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 14,
      "text": "but whoever drinks of the water that I will give him will never thirst again. The water I will give will become in him a spring of water welling up to eternal life.\"",
      "links": "<a href='/AIV/43/7/38'>John 7:38</a>; <a href='/AIV/66/21/6'>Rev. 21:6</a>",
      "comment": "Jesus promises a new, divine source of life. This ties to the sacramental life provided through Him (see John 7:38)."
    },
    {
      "pk": 1940015,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 15,
      "text": "The woman said to him, \"Sir, give me this water, so I will not be thirsty or have to come here to draw water.\"",
      "links": "<a href='/AIV/43/6/34'>John 6:34</a>",
      "comment": "She desires what Jesus offers, though still thinking in earthy terms about her daily needs."
    },
    {
      "pk": 1940016,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 16,
      "text": "Jesus said to her, \"Go, call your husband, and come here.\"",
      "links": "",
      "comment": "Jesus gently reveals the truth of her life, inviting her to honesty and full encounter."
    },
    {
      "pk": 1940017,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 17,
      "text": "The woman answered, \"I have no husband.\" Jesus said to her, \"You are right in saying, ‘I have no husband’;",
      "links": "",
      "comment": "Jesus displays supernatural knowledge, pointing to his divine nature and mission."
    },
    {
      "pk": 1940018,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 18,
      "text": "for you have had five husbands, and the one you now have is not your husband. What you have said is true.\"",
      "links": "",
      "comment": "He knows her past, showing his divine insight and compassion—He reveals sin that it might be healed."
    },
    {
      "pk": 1940019,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 19,
      "text": "The woman said to him, \"Sir, I perceive that you are a prophet.",
      "links": "<a href='/AIV/05/18/15'>Deut. 18:15</a>",
      "comment": "She recognizes something special in Jesus, much like Israel awaited a prophet."
    },
    {
      "pk": 1940020,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 20,
      "text": "Our fathers worshiped on this mountain, but you say that in Jerusalem is the place where people must worship.\"",
      "links": "<a href='/AIV/05/12/5'>Deut. 12:5</a>; <a href='/AIV/14/6/6'>2 Chron. 6:6</a>",
      "comment": "Refers to long-standing debate between Samaritans (Mount Gerizim) and Jews (Jerusalem) regarding the true center of worship."
    },
    {
      "pk": 1940021,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 21,
      "text": "Jesus said to her, \"Woman, believe me, the hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.",
      "links": "<a href='/AIV/43/2/4'>John 2:4</a>; <a href='/AIV/43/12/23'>John 12:23</a>",
      "comment": "Jesus predicts a new age where worship will not be tied to a specific place—hinting at a universal Church."
    },
    {
      "pk": 1940022,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 22,
      "text": "You worship what you do not know; we worship what we know, for salvation is from the Jews.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/45/9/4-5'>Rom. 9:4-5</a>",
      "comment": "Affirms special revelation entrusted to Israel, the promises fulfilled in Jesus."
    },
    {
      "pk": 1940023,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 23,
      "text": "But the hour is coming, and is now here, when the true worshipers will worship the Father in spirit and in truth, for the Father seeks such people to worship him.",
      "links": "<a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "\"In spirit and in truth\" implies authentic internal worship, fully realized after Pentecost when the Holy Spirit is sent into believers. Worship in spirit does not mean worship without form, but in right relationship to God through Jesus."
    },
    {
      "pk": 1940024,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 24,
      "text": "God is spirit, and those who worship him must worship in spirit and in truth.\"",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>",
      "comment": "God's essence is spiritual and not confined to place. Nevertheless, worship remains rooted in truth, not mere sincerity."
    },
    {
      "pk": 1940025,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 25,
      "text": "The woman said to him, \"I know that Messiah is coming (he who is called Christ). When he comes, he will tell us all things.\"",
      "links": "<a href='/AIV/43/1/41'>John 1:41</a>; <a href='/AIV/09/2/35'>1 Sam. 2:35</a>",
      "comment": "The expectation of Messiah points to prophetic fulfilment from the Old Testament."
    },
    {
      "pk": 1940026,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 26,
      "text": "Jesus said to her, \"I, who am speaking to you, am he.\"",
      "links": "<a href='/AIV/02/3/14'>Exod. 3:14</a>; <a href='/AIV/43/8/58'>John 8:58</a>",
      "comment": "This is a direct revelation of Jesus' identity as Messiah. In Greek, Jesus uses the phrase “I am” (ego eimi), an echo of God’s divine name (cf. Exod. 3:14), a high claim to divinity."
    },
    {
      "pk": 1940027,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 27,
      "text": "At this point his disciples came, and they were amazed that he was talking with a woman. Yet nobody said, \"What do you seek?\" or, \"Why are you talking with her?\"",
      "links": "",
      "comment": "The counter-cultural example of Jesus is highlighted; he speaks openly to a woman even though it was unusual for a teacher to do so."
    },
    {
      "pk": 1940028,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 28,
      "text": "So the woman left her water jar and went away into the town and said to the people,",
      "links": "",
      "comment": "Her abandonment of the water jar symbolizes leaving behind old priorities after encountering Christ."
    },
    {
      "pk": 1940029,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 29,
      "text": "\"Come, see a man who told me everything I ever did! Could this be the Christ?\"",
      "links": "<a href='/AIV/43/1/45-46'>John 1:45-46</a>",
      "comment": "Her testimony draws others to seek Jesus, modeling early Christian evangelization."
    },
    {
      "pk": 1940030,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 30,
      "text": "They went out of the town and were coming to him.",
      "links": "",
      "comment": "The townspeople respond, showing the fruit of authentic witness."
    },
    {
      "pk": 1940031,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 31,
      "text": "Meanwhile the disciples were urging him, saying, \"Rabbi, eat.\"",
      "links": "",
      "comment": "Physical needs are contrasted with spiritual mission."
    },
    {
      "pk": 1940032,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 32,
      "text": "But he said to them, \"I have food to eat that you do not know about.\"",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>",
      "comment": "Jesus' nourishment comes from obedience to the Father, foreshadowing teaching on deeper spiritual sustenance."
    },
    {
      "pk": 1940033,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 33,
      "text": "So the disciples said to one another, \"Has someone brought him something to eat?\"",
      "links": "",
      "comment": "They again misunderstand Jesus, focusing on the physical instead of the spiritual."
    },
    {
      "pk": 1940034,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 34,
      "text": "Jesus said to them, \"My food is to do the will of him who sent me, and to finish his work.",
      "links": "<a href='/AIV/43/17/4'>John 17:4</a>",
      "comment": "Jesus is entirely devoted to the Father's mission, highlighting union between the Son and the Father."
    },
    {
      "pk": 1940035,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 35,
      "text": "Do not say, 'There are yet four months, and then comes the harvest.' Look, I tell you, lift up your eyes and see that the fields are white for harvest already.",
      "links": "<a href='/AIV/40/9/37'>Matt. 9:37</a>",
      "comment": "Jesus declares the urgent readiness for spiritual harvest—the Samaritan people responding points to the universality of his mission."
    },
    {
      "pk": 1940036,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 36,
      "text": "Already the one who reaps is receiving wages and gathering fruit for eternal life, so that sower and reaper may rejoice together.",
      "links": "<a href='/AIV/43/15/16'>John 15:16</a>",
      "comment": "All workers in the mission of God share the joy of eternal fruit."
    },
    {
      "pk": 1940037,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 37,
      "text": "For in this the saying is true, 'One sows, and another reaps.'",
      "links": "<a href='/AIV/30/9/13'>Amos 9:13</a>; <a href='/AIV/46/3/6-9'>1 Cor. 3:6-9</a>",
      "comment": "Spiritual work is collaborative; one may sow, another may reap, but all contribute to God’s plan."
    },
    {
      "pk": 1940038,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 38,
      "text": "I sent you to reap that for which you have not labored. Others have labored, and you have entered into their labor.\"",
      "links": "<a href='/AIV/05/6/10-11'>Deut. 6:10-11</a>",
      "comment": "The apostles continue in the work started by others—pointing to the Church’s tradition handed down."
    },
    {
      "pk": 1940039,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 39,
      "text": "Many Samaritans from that town believed in him because of the woman's testimony, \"He told me everything I ever did.\"",
      "links": "",
      "comment": "Faith spreads through personal witness, the foundation of apostolic testimony."
    },
    {
      "pk": 1940040,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 40,
      "text": "So when the Samaritans came to him, they asked him to stay with them. And he stayed there two days.",
      "links": "",
      "comment": "Jesus dwells with the Samaritans, symbolizing the breaking down of barriers between nations."
    },
    {
      "pk": 1940041,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 41,
      "text": "And many more believed because of his word.",
      "links": "<a href='/AIV/43/8/30'>John 8:30</a>",
      "comment": "Hearing Jesus’ teaching moves people to deeper faith—emphasizing the power of proclamation."
    },
    {
      "pk": 1940042,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 42,
      "text": "They said to the woman, \"It is no longer because of what you said that we believe, for we have heard for ourselves, and we know that this is truly the Savior of the world.\"",
      "links": "<a href='/AIV/23/45/22'>Isa. 45:22</a>; <a href='/AIV/62/4/14'>1 John 4:14</a>",
      "comment": "\"Savior of the world\" is a high Christological confession, echoing Old Testament declarations that salvation comes from God alone."
    },
    {
      "pk": 1940043,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 43,
      "text": "After the two days he departed from there and went into Galilee.",
      "links": "",
      "comment": "Jesus continues his public mission, now based in Galilee."
    },
    {
      "pk": 1940044,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 44,
      "text": "For Jesus himself testified that a prophet has no honor in his own country.",
      "links": "<a href='/AIV/40/13/57'>Matt. 13:57</a>",
      "comment": "This proverb points to the rejection Jesus would face from his own people, foreshadowing later opposition."
    },
    {
      "pk": 1940045,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 45,
      "text": "So when he came to Galilee, the Galileans welcomed him, having seen all that he had done in Jerusalem at the feast. For they had also gone to the feast.",
      "links": "<a href='/AIV/43/2/23'>John 2:23</a>",
      "comment": "Jesus’ miracles make a deep impression, opening the hearts of some Galileans."
    },
    {
      "pk": 1940046,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 46,
      "text": "So he came again to Cana in Galilee, where he had made the water wine. And at Capernaum there was a certain official whose son was sick.",
      "links": "<a href='/AIV/43/2/1-11'>John 2:1-11</a>",
      "comment": "Cana is significant for Jesus' signs (miracles), which point to his divine authority."
    },
    {
      "pk": 1940047,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 47,
      "text": "When he heard that Jesus had come from Judea into Galilee, he went to him and begged him to come down and heal his son, for he was at the point of death.",
      "links": "",
      "comment": "The official’s faith is moving, as he seeks Jesus' physical presence—a sign of deep faith in the incarnate Christ."
    },
    {
      "pk": 1940048,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 48,
      "text": "So Jesus said to him, \"Unless you see signs and wonders, you will not believe.\"",
      "links": "<a href='/AIV/43/2/18'>John 2:18</a>; <a href='/AIV/43/20/29'>John 20:29</a>",
      "comment": "Jesus contrasts faith dependent on miracles with mature faith based on his word."
    },
    {
      "pk": 1940049,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 49,
      "text": "The official said, \"Sir, come down before my child dies.\"",
      "links": "",
      "comment": "This plea shows humility and desperation, foreshadowing the power of faith and intercession."
    },
    {
      "pk": 1940050,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 50,
      "text": "Jesus said to him, \"Go, your son lives.\" The man believed the word that Jesus spoke to him and went on his way.",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>",
      "comment": "Faith in Jesus' word brings life; this act demonstrates the efficacious power of Christ’s words."
    },
    {
      "pk": 1940051,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 51,
      "text": "As he was going down, his servants met him and told him, \"Your child lives.\"",
      "links": "",
      "comment": "The miracle is confirmed apart from Jesus’ physical presence, demonstrating his divine authority."
    },
    {
      "pk": 1940052,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 52,
      "text": "So he asked them the hour when he began to get better, and they said to him, \"Yesterday at the seventh hour the fever left him.\"",
      "links": "",
      "comment": "The timing matches exactly with Jesus’ pronouncement, showing the connection of faith and divine action."
    },
    {
      "pk": 1940053,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 53,
      "text": "Then the father knew that it was the very hour when Jesus had said to him, \"Your son lives.\" And he himself believed, and all his household.",
      "links": "<a href='/AIV/44/16/31'>Acts 16:31</a>",
      "comment": "Faith spreads from the individual to the whole household, prefiguring the spread of faith through families and communal life."
    },
    {
      "pk": 1940054,
      "translation": "AIV",
      "book": 43,
      "chapter": 4,
      "verse": 54,
      "text": "This was again a second sign that Jesus did after coming from Judea into Galilee.",
      "links": "<a href='/AIV/43/2/11'>John 2:11</a>",
      "comment": "The signs in John’s Gospel reveal Jesus’ glory and lead people to faith; they are not merely miracles but have deeper sacramental and spiritual meaning."
    }
  ],
  "translatedAt": "2025-12-23T02:57:48.438Z"
}