{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 1,
  "verses": [
    {
      "pk": 1001001,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 1,
      "text": "In the beginning was the Word, and the Word was with God, and the Word was God.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/62/5/7'>1 John 5:7</a>",
      "comment": "John opens with clear language indicating the divine, uncreated nature of the Word (Logos), echoing Genesis 1:1. The 'Word was God' is a powerful, unambiguous claim of divinity—one of the highest Christological statements in Scripture."
    },
    {
      "pk": 1001002,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 2,
      "text": "He was in the beginning with God.",
      "links": "<a href='/AIV/62/1/2'>1 John 1:2</a>",
      "comment": "Here, 'He' refers back to the Word, affirming the personhood of the Logos, existing eternally alongside God the Father."
    },
    {
      "pk": 1001003,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 3,
      "text": "All things were made through Him, and without Him nothing was made that has been made.",
      "links": "<a href='/AIV/51/1/16'>Col. 1:16</a>; <a href='/AIV/58/1/2'>Heb. 1:2</a>",
      "comment": "The Word is the instrument of all creation; nothing exists apart from His creative power. This underlines the pre-existence and prerogatives of Christ, with implications for the higher Christology of the early Church."
    },
    {
      "pk": 1001004,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 4,
      "text": "In Him was life, and the life was the light of men.",
      "links": "<a href='/AIV/43/8/12'>John 8:12</a>; <a href='/AIV/46/15/45'>1 Cor. 15:45</a>",
      "comment": "The Word is not only creator, but source of all true life and enlightenment for humanity. This points to divine life mediated through Christ—a theme that will develop in the sacraments and apostolic tradition."
    },
    {
      "pk": 1001005,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 5,
      "text": "The light shines in the darkness, and the darkness has not overcome it.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/43/12/35'>John 12:35</a>",
      "comment": "Light symbolizes the revelation and goodness of Christ contrasted with the darkness of sin. Despite opposition, the true Light remains victorious—a theme foundational to an optimistic, sacramental Christian worldview."
    },
    {
      "pk": 1001006,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 6,
      "text": "There was a man sent from God, whose name was John.",
      "links": "<a href='/AIV/42/7/27'>Luke 7:27</a>",
      "comment": "John the Baptist appears as a prophetic forerunner, emphasizing special divine mission and preparation for Christ, connecting old and new covenants."
    },
    {
      "pk": 1001007,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 7,
      "text": "He came as a witness, to bear witness about the light, that all might believe through him.",
      "links": "<a href='/AIV/43/5/33'>John 5:33</a>",
      "comment": "John's purpose is to bear witness, not to be the light. Faith in Christ often comes through the testimony of authoritative witnesses aligned with Old Testament prophecy."
    },
    {
      "pk": 1001008,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 8,
      "text": "He was not the light, but came to bear witness about the light.",
      "links": "<a href='/AIV/43/3/28'>John 3:28</a>",
      "comment": "This clarifies that John the Baptist, despite his prominence, is not the messiah but points to another."
    },
    {
      "pk": 1001009,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 9,
      "text": "The true light, which gives light to everyone, was coming into the world.",
      "links": "<a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Jesus is presented as the fulfillment of Isaiah’s prophecy—He is the universal light for all people, not just one nation."
    },
    {
      "pk": 1001010,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 10,
      "text": "He was in the world, and the world was made through Him, yet the world did not know Him.",
      "links": "<a href='/AIV/43/16/3'>John 16:3</a>",
      "comment": "The world's ignorance of its Creator is a sobering judgment, laying the groundwork for understanding sin, revelation, and God's plan for redemption."
    },
    {
      "pk": 1001011,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 11,
      "text": "He came to His own, and His own people did not receive Him.",
      "links": "<a href='/AIV/23/53/3'>Isa. 53:3</a>; <a href='/AIV/45/9/4'>Rom. 9:4</a>",
      "comment": "The Messiah’s rejection by Israel fulfills prophecy and foreshadows the wider inclusion of the Gentiles in God’s plan of salvation."
    },
    {
      "pk": 1001012,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 12,
      "text": "But to all who received Him, who believed in His name, He gave the right to become children of God.",
      "links": "<a href='/AIV/62/3/1'>1 John 3:1</a>; <a href='/AIV/48/3/26'>Gal. 3:26</a>",
      "comment": "Receiving Christ and believing in His name grants divine adoption—a concept that will be expressed in baptismal regeneration, the means by which believers are incorporated into God’s family."
    },
    {
      "pk": 1001013,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 13,
      "text": "who were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.",
      "links": "<a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Spiritual rebirth is distinguished from natural birth; it is a gift of God, not human effort. This is developed further in Christ’s conversation with Nicodemus about being born of water and the Spirit."
    },
    {
      "pk": 1001014,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 14,
      "text": "And the Word became flesh and made His dwelling among us, and we have seen His glory, the glory as of the one and only from the Father, full of grace and truth.",
      "links": "<a href='/AIV/03/26/11'>Lev. 26:11-12</a>; <a href='/AIV/43/17/5'>John 17:5</a>",
      "comment": "The incarnation—God taking on human flesh—is central to Christianity. The glory witnessed here is both perceptible and transformative, an idea echoed in Christian sacramental life."
    },
    {
      "pk": 1001015,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 15,
      "text": "John bore witness about Him, and cried out, 'This was He of whom I said, “He who comes after me ranks before me, because He was before me.”'",
      "links": "<a href='/AIV/43/1/30'>John 1:30</a>",
      "comment": "John the Baptist here testifies to Jesus' pre-existence and superiority, reinforcing the doctrine that Christ is more than a prophet—He is eternal."
    },
    {
      "pk": 1001016,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 16,
      "text": "For from His fullness we have all received, grace upon grace.",
      "links": "<a href='/AIV/51/1/19'>Col. 1:19</a>",
      "comment": "The superabundance of grace shared with believers comes from Christ’s divine nature. The phrase suggests an ongoing gift, reflected later in the Church's means of distributing grace."
    },
    {
      "pk": 1001017,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 17,
      "text": "For the law was given through Moses; grace and truth came through Jesus Christ.",
      "links": "<a href='/AIV/02/34/29'>Ex. 34:29</a>; <a href='/AIV/45/5/20'>Rom. 5:20-21</a>",
      "comment": "This sets up a contrast: Moses brings the Law, but Jesus brings the fulfillment—grace and truth. This links the old and new covenants and foreshadows the authority of Christ to establish a new order."
    },
    {
      "pk": 1001018,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 18,
      "text": "No one has ever seen God; the one and only God, who is at the Father’s side, He has made Him known.",
      "links": "<a href='/AIV/02/33/20'>Ex. 33:20</a>; <a href='/AIV/43/6/46'>John 6:46</a>",
      "comment": "Christ, 'at the Father’s side,' is uniquely able to reveal God. The language emphasizes both Christ’s intimacy with the Father and His singular role as revealer—divine attributes with implications for apostolic teaching authority."
    },
    {
      "pk": 1001019,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 19,
      "text": "And this is the testimony of John, when the Jews sent priests and Levites from Jerusalem to ask him, 'Who are you?'",
      "links": "<a href='/AIV/42/3/15'>Luke 3:15</a>",
      "comment": "Priests and Levites, representing religious authority, question John. This signals the transition from Old Testament priesthood to a new order centered on Christ."
    },
    {
      "pk": 1001020,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 20,
      "text": "He confessed, and did not deny, but confessed, 'I am not the Christ.'",
      "links": "<a href='/AIV/43/3/28'>John 3:28</a>",
      "comment": "John openly denies being the Messiah, making way for the true Christ."
    },
    {
      "pk": 1001021,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 21,
      "text": "And they asked him, 'What then? Are you Elijah?' He said, 'I am not.' 'Are you the Prophet?' He answered, 'No.'",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>; <a href='/AIV/05/18/15'>Deut. 18:15</a>",
      "comment": "The expected return of Elijah (cf. Malachi 4:5) and 'the Prophet' (Deuteronomy 18:15) is denied, showing John's humility and adherence to his distinct prophetic role."
    },
    {
      "pk": 1001022,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 22,
      "text": "So they said to him, 'Who are you? We need to give an answer to those who sent us. What do you say about yourself?'",
      "links": "",
      "comment": "The religious leaders press John for his identity, reflecting the tension and expectation surrounding the coming Messiah."
    },
    {
      "pk": 1001023,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 23,
      "text": "He said, 'I am the voice of one crying out in the wilderness, “Make straight the way of the Lord,” as the prophet Isaiah said.'",
      "links": "<a href='/AIV/23/40/3'>Isa. 40:3</a>",
      "comment": "John identifies with Isaiah 40:3, positioning himself as forerunner. His role was to prepare the way for the full manifestation of God's kingdom through Christ."
    },
    {
      "pk": 1001024,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 24,
      "text": "Now those who had been sent were from the Pharisees.",
      "links": "",
      "comment": "The Pharisees, as teachers of the Law, express particular concern about John’s baptismal practice, signaling disputes between old and new authority."
    },
    {
      "pk": 1001025,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 25,
      "text": "And they asked him, 'Why then are you baptizing, if you are neither the Christ, nor Elijah, nor the Prophet?'",
      "links": "",
      "comment": "The leaders were perplexed that someone without recognized prophetic identity would administer baptism—a rite signifying repentance and cleansing pointing to the true Messiah’s coming means of sanctification."
    },
    {
      "pk": 1001026,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 26,
      "text": "John answered them, 'I baptize with water, but among you stands one you do not know,",
      "links": "<a href='/AIV/43/1/33'>John 1:33</a>",
      "comment": "John distinguishes his water baptism—a preparatory sacrament—from the superior revelation Christ brings. True spiritual cleansing will come through Christ."
    },
    {
      "pk": 1001027,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 27,
      "text": "He, who comes after me, the strap of whose sandal I am not worthy to untie.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>",
      "comment": "John’s humility underscores the majesty of the one to come—language hinting at both divinity and supreme authority."
    },
    {
      "pk": 1001028,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 28,
      "text": "These things took place in Bethany beyond the Jordan, where John was baptizing.",
      "links": "<a href='/AIV/43/10/40'>John 10:40</a>",
      "comment": "The geographical detail links the events with Israel’s history and the traditional place of prophetic activity."
    },
    {
      "pk": 1001029,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 29,
      "text": "The next day he saw Jesus coming toward him, and said, 'Behold, the Lamb of God, who takes away the sin of the world!'",
      "links": "<a href='/AIV/02/12/3'>Ex. 12:3,7</a>; <a href='/AIV/23/53/7'>Isa. 53:7</a>; <a href='/AIV/46/5/7'>1 Cor. 5:7</a>",
      "comment": "Calling Jesus 'the Lamb of God' evokes sacrificial imagery of Passover and Isaiah 53. This points to Christ’s role in redemption and underscores both His priestly and sacrificial offices."
    },
    {
      "pk": 1001030,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 30,
      "text": "This is He of whom I said, ‘After me comes a man who ranks before me, because He was before me.’",
      "links": "<a href='/AIV/43/1/15'>John 1:15</a>",
      "comment": "Again, John's testimony affirms both the eternal pre-existence and the superiority of Christ."
    },
    {
      "pk": 1001031,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 31,
      "text": "I myself did not know Him, but for this purpose I came baptizing with water, that He might be revealed to Israel.",
      "links": "<a href='/AIV/43/1/7'>John 1:7</a>",
      "comment": "John’s mission is to reveal the Christ to Israel, preparing the people for a new covenant."
    },
    {
      "pk": 1001032,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 32,
      "text": "And John bore witness: 'I saw the Spirit descend from heaven like a dove, and it remained on Him.'",
      "links": "<a href='/AIV/40/3/16'>Matt. 3:16</a>; <a href='/AIV/23/42/1'>Isa. 42:1</a>",
      "comment": "The Spirit's visible descent affirms Christ’s unique anointing and mission—a key moment confirming His divine Sonship and the Spirit’s continuing presence with Him and later through the sacraments."
    },
    {
      "pk": 1001033,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 33,
      "text": "I myself did not know Him, but He who sent me to baptize with water said to me, 'He on whom you see the Spirit descend and remain, this is He who baptizes with the Holy Spirit.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>",
      "comment": "Jesus will establish baptism in the Holy Spirit—a fulfillment and perfection beyond John's preparatory rite, forming the foundation for Christian sacramental identity."
    },
    {
      "pk": 1001034,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 34,
      "text": "And I have seen and have borne witness that this is the Son of God.",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "John proclaims Jesus as the unique Son of God. This term has rich Old Testament roots tied to divine kingship and fulfillment of messianic expectation."
    },
    {
      "pk": 1001035,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 35,
      "text": "The next day again John was standing with two of his disciples,",
      "links": "",
      "comment": "John’s followers form a bridge, demonstrating the transition from the old to the new community of faith."
    },
    {
      "pk": 1001036,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 36,
      "text": "and he looked at Jesus as He walked by and said, 'Behold, the Lamb of God!'",
      "links": "<a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/46/5/7'>1 Cor. 5:7</a>",
      "comment": "Repetition of the 'Lamb of God' title stresses the sacrificial character of Christ’s mission, foundational for Christian worship and Eucharistic theology."
    },
    {
      "pk": 1001037,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 37,
      "text": "The two disciples heard him say this, and they followed Jesus.",
      "links": "<a href='/AIV/43/6/66-69'>John 6:66-69</a>",
      "comment": "Following Jesus marks the beginning of true discipleship—the passing of authority from the forerunner to the Lord Himself."
    },
    {
      "pk": 1001038,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 38,
      "text": "Jesus turned and saw them following and said to them, 'What are you seeking?' They said to Him, 'Rabbi' (which means Teacher), 'where are you staying?'",
      "links": "<a href='/AIV/40/8/19-20'>Matt. 8:19-20</a>",
      "comment": "'Rabbi' acknowledges Jesus’ authority as teacher, but the conversation also alludes to the deeper spiritual search of discipleship."
    },
    {
      "pk": 1001039,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 39,
      "text": "He said to them, 'Come and you will see.' So they came and saw where He was staying, and they stayed with Him that day, for it was about the tenth hour.",
      "links": "",
      "comment": "Jesus’ invitation indicates that knowledge of Him comes through personal encounter and abiding presence—a key motif in the Christian life."
    },
    {
      "pk": 1001040,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 40,
      "text": "One of the two who heard John speak and followed Him was Andrew, Simon Peter’s brother.",
      "links": "<a href='/AIV/43/6/8'>John 6:8</a>",
      "comment": "Andrew’s call introduces Peter, a future key leader in the apostolic church."
    },
    {
      "pk": 1001041,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 41,
      "text": "He first found his own brother Simon and said to him, 'We have found the Messiah' (which means Christ).",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>",
      "comment": "'Messiah' and 'Christ' both mean 'Anointed One,' echoing the fulfillment of Old Testament expectation and Peter’s special recognition later in the gospel."
    },
    {
      "pk": 1001042,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 42,
      "text": "He brought him to Jesus. Jesus looked at him and said, 'You are Simon the son of John. You shall be called Cephas' (which means Peter).",
      "links": "<a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "The renaming as 'Cephas' (Peter, meaning 'rock') is significant for understanding the foundational role Peter will play in leading Christ’s Church."
    },
    {
      "pk": 1001043,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 43,
      "text": "The next day Jesus decided to go to Galilee. He found Philip and said to him, 'Follow Me.'",
      "links": "<a href='/AIV/43/15/16'>John 15:16</a>",
      "comment": "Jesus takes the initiative in calling His disciples, echoing His ongoing authoritative role in leading the community."
    },
    {
      "pk": 1001044,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 44,
      "text": "Now Philip was from Bethsaida, the city of Andrew and Peter.",
      "links": "<a href='/AIV/43/12/21'>John 12:21</a>",
      "comment": "Shared hometown emphasizes the communal, interconnected nature of the disciples’ call."
    },
    {
      "pk": 1001045,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 45,
      "text": "Philip found Nathanael and said to him, 'We have found Him of whom Moses in the Law and also the prophets wrote, Jesus of Nazareth, the son of Joseph.'",
      "links": "<a href='/AIV/05/18/18'>Deut. 18:18</a>; <a href='/AIV/23/9/6'>Isa. 9:6</a>",
      "comment": "Philip explicitly connects Jesus to Old Testament prophecy, affirming the scriptural foundation for Christian faith and authority."
    },
    {
      "pk": 1001046,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 46,
      "text": "Nathanael said to him, 'Can anything good come out of Nazareth?' Philip said to him, 'Come and see.'",
      "links": "<a href='/AIV/43/7/41-42'>John 7:41-42</a>",
      "comment": "Nazareth’s lack of reputation becomes a sign of Christ’s humility and the paradox of God’s choice—a principle echoed in God using the humble and weak for His purposes."
    },
    {
      "pk": 1001047,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 47,
      "text": "Jesus saw Nathanael coming toward Him and said of him, 'Here is truly an Israelite in whom there is no deceit!'",
      "links": "<a href='/AIV/19/32/2'>Ps. 32:2</a>",
      "comment": "Jesus, with supernatural knowledge, reveals Nathanael’s character, indicating divine insight."
    },
    {
      "pk": 1001048,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 48,
      "text": "Nathanael said to Him, 'How do you know me?' Jesus answered, 'Before Philip called you, when you were under the fig tree, I saw you.'",
      "links": "",
      "comment": "Jesus demonstrates supernatural knowledge, confirming His divine nature and the mystery of predestination and divine calling."
    },
    {
      "pk": 1001049,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 49,
      "text": "Nathanael answered Him, 'Rabbi, You are the Son of God! You are the King of Israel!'",
      "links": "<a href='/AIV/19/2/7'>Ps. 2:7</a>; <a href='/AIV/43/6/69'>John 6:69</a>",
      "comment": "Nathanael recognizes both Jesus’ divine sonship and messianic kingship, foreshadowing later confessions of faith."
    },
    {
      "pk": 1001050,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 50,
      "text": "Jesus answered him, 'Because I said to you, “I saw you under the fig tree,” do you believe? You will see greater things than these.'",
      "links": "",
      "comment": "Jesus prepares His disciples for deeper revelation and signs, teaching them that faith will be deepened and strengthened over time."
    },
    {
      "pk": 1001051,
      "translation": "AIV",
      "book": 43,
      "chapter": 1,
      "verse": 51,
      "text": "And He said to him, 'Truly, truly, I say to you, you will see heaven opened, and the angels of God ascending and descending upon the Son of Man.'",
      "links": "<a href='/AIV/01/28/12'>Gen. 28:12</a>; <a href='/AIV/27/7/13'>Dan. 7:13</a>",
      "comment": "Jesus refers to Jacob’s ladder, interpreting Himself as the new connection between heaven and earth—the mediator through whom God’s grace and revelation continually descend to humanity through the Son of Man. This language anticipates a church that remains united to Christ, the source of all grace and truth."
    }
  ],
  "translatedAt": "2025-12-23T02:55:50.754Z"
}