{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 2,
  "verses": [
    {
      "pk": 2002001,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 1,
      "text": "On the third day, there was a wedding in Cana of Galilee, and the mother of Jesus was there.",
      "links": "<a href='/AIV/43/19/25'>John 19:25</a>",
      "comment": "This is the beginning of Jesus’ public ministry, marked by His presence at a wedding. The mention of His mother is significant and anticipates her intercession."
    },
    {
      "pk": 2002002,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 2,
      "text": "Jesus was also invited to the wedding, along with His disciples.",
      "links": "<a href='/AIV/40/9/10'>Matt. 9:10</a>",
      "comment": "Jesus’ presence at this wedding shows His affirmation of marriage and family life."
    },
    {
      "pk": 2002003,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 3,
      "text": "When the wine ran out, the mother of Jesus said to Him, 'They have no wine.'",
      "links": "<a href='/AIV/40/15/25'>Matt. 15:25</a>",
      "comment": "Mary’s request demonstrates her role in noticing and bringing needs to Jesus, highlighting her intercessory influence."
    },
    {
      "pk": 2002004,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 4,
      "text": "And Jesus said to her, 'Woman, what does this have to do with Me? My hour has not yet come.'",
      "links": "<a href='/AIV/43/7/6'>John 7:6</a>; <a href='/AIV/43/19/26-27'>John 19:26-27</a>",
      "comment": "The term 'Woman' sounds formal in English but in context was a respectful term. 'My hour' refers to the time of His passion (see John 12:23)."
    },
    {
      "pk": 2002005,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 5,
      "text": "His mother said to the servants, 'Do whatever He tells you.'",
      "links": "<a href='/AIV/41/3/35'>Mark 3:35</a>",
      "comment": "Mary’s statement encourages obedience to Jesus’ commands, reflecting her faith in His power and prompting trust and submission, which is echoed throughout the Christian life."
    },
    {
      "pk": 2002006,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 6,
      "text": "Now there were six stone water jars there, for Jewish purification, each holding twenty to thirty gallons.",
      "links": "<a href='/AIV/41/7/3'>Mark 7:3</a>",
      "comment": "The jars’ purpose for ritual purification points to Jesus transforming old religious practices with new meaning."
    },
    {
      "pk": 2002007,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 7,
      "text": "Jesus said to them, 'Fill the jars with water.' And they filled them up to the brim.",
      "links": "",
      "comment": "Jesus’ command initiates the miracle, showing the servants’ obedience in faith."
    },
    {
      "pk": 2002008,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 8,
      "text": "Then He said to them, 'Now draw some out and take it to the master of the feast.' So they took it.",
      "links": "",
      "comment": "The transformation of water to wine occurs quietly but with profound significance, symbolizing abundance and joy."
    },
    {
      "pk": 2002009,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 9,
      "text": "When the master of the feast tasted the water that had become wine, and did not know where it came from (though the servants who had drawn the water knew), the master of the feast called the bridegroom",
      "links": "",
      "comment": "Only the servants witness the miracle, mirroring how God's works are often recognized by the humble and obedient."
    },
    {
      "pk": 2002010,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 10,
      "text": "and said to him, 'Everyone serves the good wine first, and when people have had their fill, then the inferior wine. But you have kept the good wine until now.'",
      "links": "",
      "comment": "The best wine is served last; this symbolizes the new covenant, which surpasses the old (cf. <a href='/AIV/58/8/6'>Heb. 8:6</a>)."
    },
    {
      "pk": 2002011,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 11,
      "text": "This, the first of His signs, Jesus did at Cana in Galilee, and manifested His glory. And His disciples believed in Him.",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/43/20/30-31'>John 20:30-31</a>",
      "comment": "‘Signs’ in John’s Gospel point to Jesus’ divine identity. Manifesting His glory here foreshadows greater revelations, especially at the Cross and Resurrection."
    },
    {
      "pk": 2002012,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 12,
      "text": "After this, He went down to Capernaum, with His mother, His brothers, and His disciples. And they stayed there for a few days.",
      "links": "<a href='/AIV/40/12/46'>Matt. 12:46</a>",
      "comment": "The mention of ‘His brothers’ is understood as a common Semitic way of describing close relatives or kin, not necessarily biological siblings (see Gen. 13:8)."
    },
    {
      "pk": 2002013,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 13,
      "text": "The Passover of the Jews was near, and Jesus went up to Jerusalem.",
      "links": "<a href='/AIV/40/26/17'>Matt. 26:17</a>",
      "comment": "Jesus’ attendance at Passover connects Him to the central redemption event in Jewish history, which He will fulfill in Himself."
    },
    {
      "pk": 2002014,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 14,
      "text": "In the temple He found those selling oxen, sheep, and doves, and money changers sitting there.",
      "links": "<a href='/AIV/40/21/12'>Matt. 21:12</a>",
      "comment": "The presence of commerce in the temple courts reveals how true worship had become corrupted."
    },
    {
      "pk": 2002015,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 15,
      "text": "And making a whip of cords, He drove them all out of the temple, both sheep and oxen, and He poured out the coins of the money changers and overturned their tables.",
      "links": "",
      "comment": "Jesus’ actions demonstrate righteous anger and His authority over God’s house (see <a href='/AIV/19/69/9'>Ps. 69:9</a>)."
    },
    {
      "pk": 2002016,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 16,
      "text": "And He told those who sold doves, 'Take these things away; do not make My Father’s house a house of trade.'",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>",
      "comment": "Jesus claims the temple as His Father’s house, implicitly asserting His unique relationship to God, a declaration of His divine Sonship."
    },
    {
      "pk": 2002017,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 17,
      "text": "His disciples remembered that it was written, 'Zeal for Your house will consume Me.'",
      "links": "<a href='/AIV/19/69/9'>Ps. 69:9</a>",
      "comment": "This Old Testament prophecy from Psalm 69 finds its fulfillment in Jesus’ passion for pure worship."
    },
    {
      "pk": 2002018,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 18,
      "text": "So the Jews said to Him, 'What sign do You show us, since You do these things?'",
      "links": "",
      "comment": "The leaders demand a sign of authority, not realizing the true sign will be His resurrection."
    },
    {
      "pk": 2002019,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 19,
      "text": "Jesus answered them, 'Destroy this temple, and in three days I will raise it up.'",
      "links": "<a href='/AIV/40/26/61'>Matt. 26:61</a>; <a href='/AIV/43/10/17-18'>John 10:17-18</a>",
      "comment": "'This temple' refers to His body (see v.21). Jesus is foretelling His death and resurrection—the ultimate sign of His divinity."
    },
    {
      "pk": 2002020,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 20,
      "text": "Then the Jews said, 'It has taken forty-six years to build this temple, and will You raise it up in three days?'",
      "links": "<a href='/AIV/37/2/18'>Haggai 2:18</a>",
      "comment": "The leaders misunderstand Jesus’ spiritual meaning by interpreting His words only literally."
    },
    {
      "pk": 2002021,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 21,
      "text": "But He was speaking about the temple of His body.",
      "links": "<a href='/AIV/46/6/19'>1 Cor. 6:19</a>",
      "comment": "Jesus identifies His own body as the new, true temple—the dwelling place of God among men."
    },
    {
      "pk": 2002022,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 22,
      "text": "So when He was raised from the dead, His disciples remembered that He had said this, and they believed the Scripture and the word that Jesus had spoken.",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/42/24/8'>Luke 24:8</a>",
      "comment": "The Resurrection confirmed Jesus’ words and deepened the disciples’ faith in both the Scriptures and His authority."
    },
    {
      "pk": 2002023,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 23,
      "text": "Now when He was in Jerusalem at the Passover Feast, many believed in His name when they saw the signs that He was doing.",
      "links": "",
      "comment": "Faith based merely on miracles is present, but not yet mature—it grows deeper through personal encounter and understanding (see <a href='/AIV/43/20/29'>John 20:29</a>)."
    },
    {
      "pk": 2002024,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 24,
      "text": "But Jesus did not entrust Himself to them, because He knew all people",
      "links": "<a href='/AIV/43/6/64'>John 6:64</a>",
      "comment": "Jesus’ divine knowledge of hearts shows His union with God and His ability to judge truly (1 Sam. 16:7)."
    },
    {
      "pk": 2002025,
      "translation": "AIV",
      "book": 43,
      "chapter": 2,
      "verse": 25,
      "text": "and needed no one to testify about man, for He Himself knew what was in man.",
      "links": "<a href='/AIV/40/9/4'>Matt. 9:4</a>",
      "comment": "This highlights Jesus’ divine omniscience and authority, affirming His divinity (cf. Jer. 17:10)."
    }
  ],
  "translatedAt": "2025-12-23T02:56:18.518Z"
}