{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 21,
  "verses": [
    {
      "pk": 50021001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 1,
      "text": "After these things, Jesus revealed Himself again to the disciples by the Sea of Tiberias. He revealed Himself in this way:",
      "links": "<a href='/AIV/41/16/7'>Mark 16:7</a>; <a href='/AIV/43/6/1'>John 6:1</a>",
      "comment": "Jesus' post-resurrection appearances underscore His bodily resurrection. The Sea of Tiberias is another name for the Sea of Galilee. The deliberate appearance to His disciples highlights Christ’s continued guidance of the Church (see John 20:19-29; Acts 1:3)."
    },
    {
      "pk": 50021002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 2,
      "text": "Simon Peter, Thomas called the Twin, Nathanael from Cana in Galilee, the sons of Zebedee, and two others of His disciples were together.",
      "links": "<a href='/AIV/43/1/40-45'>John 1:40-45</a>; <a href='/AIV/40/10/2-4'>Matt 10:2-4</a>",
      "comment": "The specific mention of the disciples present gives historical credibility and reinforces the apostolic witness, which becomes foundational for the unity and teaching of the early Church (see Acts 1:21-22)."
    },
    {
      "pk": 50021003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 3,
      "text": "Simon Peter said to them, \"I am going fishing.\" They said to him, \"We will go with you.\" They went out and got into the boat, but that night they caught nothing.",
      "links": "<a href='/AIV/42/5/5'>Luke 5:5</a>",
      "comment": "The disciples returning to fishing indicates a period of transition—the passing from their old life to their new apostolic mission. Their fruitless labor apart from Christ is symbolic of human effort without divine guidance."
    },
    {
      "pk": 50021004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 4,
      "text": "When the morning had come, Jesus stood on the shore, but the disciples did not know that it was Jesus.",
      "links": "<a href='/AIV/43/20/14'>John 20:14</a>; <a href='/AIV/42/24/16'>Luke 24:16</a>",
      "comment": "The post-resurrection body of Jesus is sometimes veiled from recognition (see Luke 24:16). The dawn signifies a new era inaugurated by Christ’s resurrection."
    },
    {
      "pk": 50021005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 5,
      "text": "Then Jesus said to them, \"Children, do you have any fish?\" They answered Him, \"No.\"",
      "links": "<a href='/AIV/43/13/33'>John 13:33</a>",
      "comment": "Calling them 'Children' expresses affection and indicates Jesus’ continuing role as the spiritual guide and teacher."
    },
    {
      "pk": 50021006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 6,
      "text": "He said to them, \"Cast the net on the right side of the boat, and you will find some.\" So they cast it, and now they were not able to draw it in because of the large number of fish.",
      "links": "<a href='/AIV/42/5/6'>Luke 5:6</a>",
      "comment": "This miraculous catch echoes the first calling of the disciples in Luke 5:6, emphasizing Jesus’ authority over creation and the effectiveness of obedience to His command—symbolic of fruitful ministry through divine guidance."
    },
    {
      "pk": 50021007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 7,
      "text": "Then that disciple whom Jesus loved said to Peter, \"It is the Lord!\" When Simon Peter heard that it was the Lord, he put on his outer garment (for he was stripped for work), and threw himself into the sea.",
      "links": "<a href='/AIV/43/13/23'>John 13:23</a>; <a href='/AIV/43/20/2'>John 20:2</a>",
      "comment": "John’s recognition of Jesus anticipates the theme of spiritual insight, while Peter’s zeal foreshadows his leadership among the disciples (see Matthew 16:18-19)."
    },
    {
      "pk": 50021008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 8,
      "text": "The other disciples came in the little boat, dragging the net full of fish, because they were not far from the land, about a hundred yards away.",
      "links": "",
      "comment": "Their struggle to bring in the net implies that the work of bringing others into God’s kingdom is a communal apostolic effort, guided by Christ."
    },
    {
      "pk": 50021009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 9,
      "text": "When they got out on the land, they saw a charcoal fire there, with fish on it, and bread.",
      "links": "<a href='/AIV/43/18/18'>John 18:18</a>",
      "comment": "The charcoal fire connects this scene to Peter’s earlier denial (John 18:18). The meal prepared by Jesus hints at Eucharistic symbolism (see John 6:11, Luke 24:30) and Christ’s provision."
    },
    {
      "pk": 50021010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 10,
      "text": "Jesus said to them, \"Bring some of the fish that you have just caught.\"",
      "links": "",
      "comment": "Jesus involves the apostles in the meal, signifying their cooperation with Him in the work of salvation—a spiritual as well as literal participation."
    },
    {
      "pk": 50021011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 11,
      "text": "So Simon Peter went aboard and hauled the net ashore, full of large fish, 153 of them; and although there were so many, the net was not torn.",
      "links": "<a href='/AIV/40/13/47-48'>Matt 13:47-48</a>",
      "comment": "The number 153 has been interpreted by many as symbolic of the universality of the Church’s mission—the net not tearing prefigures unity despite the multitude. (see Matthew 13:47-50)"
    },
    {
      "pk": 50021012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 12,
      "text": "Jesus said to them, \"Come and have breakfast.\" None of the disciples dared to ask Him, \"Who are You?\" for they knew it was the Lord.",
      "links": "<a href='/AIV/43/20/16'>John 20:16</a>",
      "comment": "The meal shared with the risen Christ shows fellowship and confirms the physical reality of His resurrection (Luke 24:41-43)."
    },
    {
      "pk": 50021013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 13,
      "text": "Jesus came and took the bread and gave it to them, and the fish likewise.",
      "links": "<a href='/AIV/43/6/11'>John 6:11</a>; <a href='/AIV/42/24/30'>Luke 24:30</a>",
      "comment": "This echoes the feeding of the multitude and the breaking of bread in Emmaus (Luke 24:30), actions that foreshadow the ongoing sacramental life of the Church."
    },
    {
      "pk": 50021014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 14,
      "text": "This was now the third time Jesus was revealed to the disciples after he was raised from the dead.",
      "links": "<a href='/AIV/43/20/19'>John 20:19</a>; <a href='/AIV/43/20/26'>John 20:26</a>",
      "comment": "The triple revelation authenticates the resurrection and the disciples' apostolic authority. Threefold occurrences often indicate completeness in Scripture."
    },
    {
      "pk": 50021015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 15,
      "text": "When they had finished breakfast, Jesus said to Simon Peter, \"Simon, son of John, do you love Me more than these?\" He said to Him, \"Yes, Lord; You know that I love You.\" He said to him, \"Feed My lambs.\"",
      "links": "<a href='/AIV/40/16/18-19'>Matt 16:18-19</a>; <a href='/AIV/42/22/32'>Luke 22:32</a>",
      "comment": "Peter is commissioned as the chief shepherd under Jesus. The threefold questioning parallels Peter's earlier denial, restoring and elevating his apostolic leadership (see Matthew 16:18-19)."
    },
    {
      "pk": 50021016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 16,
      "text": "He said to him a second time, \"Simon, son of John, do you love Me?\" He said to Him, \"Yes, Lord; You know that I love You.\" He said to him, \"Tend My sheep.\"",
      "links": "<a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The repeated command strengthens Peter’s unique pastoral and teaching role among the apostles, which is foundational for the unity of the one apostolic Church."
    },
    {
      "pk": 50021017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 17,
      "text": "He said to him the third time, \"Simon, son of John, do you love Me?\" Peter was grieved because He said to him the third time, \"Do you love Me?\" He said to Him, \"Lord, You know everything; You know that I love You.\" Jesus said to him, \"Feed My sheep.\"",
      "links": "<a href='/AIV/43/2/25'>John 2:25</a>; <a href='/AIV/43/6/68'>John 6:68</a>",
      "comment": "Jesus’ three questions mirror Peter’s three denials, bringing healing and reinstatement. Jesus’ omniscience (“You know everything”) affirms His divine authority, and Peter’s commission highlights succession and authority in leading the flock."
    },
    {
      "pk": 50021018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 18,
      "text": "Truly, truly, I say to you, when you were young, you used to dress yourself and walk wherever you wanted. But when you are old, you will stretch out your hands, and another will dress you and bring you where you do not want to go.\"",
      "links": "<a href='/AIV/43/13/36'>John 13:36</a>",
      "comment": "This prophecy refers to Peter’s future martyrdom (see 2 Peter 1:14), which foreshadows the apostolic witness through suffering for Christ."
    },
    {
      "pk": 50021019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 19,
      "text": "He said this to show by what kind of death he would glorify God. And after saying this, He said to him, \"Follow Me.\"",
      "links": "<a href='/AIV/43/13/36'>John 13:36</a>; <a href='/AIV/40/16/24'>Matt 16:24</a>",
      "comment": "Peter is called to discipleship even unto martyrdom, echoing the call to take up one’s cross. Obedience and faithful witness are core apostolic virtues."
    },
    {
      "pk": 50021020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 20,
      "text": "Peter turned and saw the disciple whom Jesus loved following them, the one who also had leaned back against Him during the supper and had said, \"Lord, who is it that is going to betray You?\"",
      "links": "<a href='/AIV/43/13/23-25'>John 13:23-25</a>",
      "comment": "The beloved disciple’s intimacy with Christ and his presence at key moments represents a model of faithful receptivity and spiritual insight."
    },
    {
      "pk": 50021021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 21,
      "text": "When Peter saw him, he said to Jesus, \"Lord, what about this man?\"",
      "links": "",
      "comment": "Peter’s question shows his concern for the other disciple’s destiny and highlights the individuality of each person's discipleship."
    },
    {
      "pk": 50021022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 22,
      "text": "Jesus said to him, \"If it is My will that he remains until I come, what is that to you? You follow Me!\"",
      "links": "",
      "comment": "Jesus emphasizes personal vocation and faithfulness. Divine providence determines each disciple’s path, while obedience remains central."
    },
    {
      "pk": 50021023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 23,
      "text": "So a rumor spread among the brothers that this disciple would not die. Yet Jesus did not say to him that he would not die, but, 'If it is My will that he remains until I come, what is that to you?'",
      "links": "",
      "comment": "The evangelist clarifies Jesus’ words to prevent misunderstanding, pointing toward the authority of authentic apostolic teaching."
    },
    {
      "pk": 50021024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 24,
      "text": "This is the disciple who testifies about these things and who wrote these things, and we know that his testimony is true.",
      "links": "<a href='/AIV/43/19/35'>John 19:35</a>; <a href='/AIV/62/1/1-4'>1 John 1:1-4</a>",
      "comment": "The author self-identifies as an eyewitness, underscoring the importance of apostolic testimony. The reference to 'we know' points to a community that safeguards authentic tradition."
    },
    {
      "pk": 50021025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 21,
      "verse": 25,
      "text": "There are also many other things that Jesus did. If every one of them were written, I suppose that even the world itself would not contain the books that would be written.",
      "links": "<a href='/AIV/43/20/30-31'>John 20:30-31</a>",
      "comment": "Not everything Jesus did was recorded, indicating the richness of the tradition passed on through the apostles. This affirms the value of both the written and living teaching passed down in the community."
    }
  ],
  "translatedAt": "2025-12-24T11:17:05.979Z"
}