{
  "book": 50,
  "bookName": "John",
  "bookAbbreviation": "John",
  "chapter": 6,
  "verses": [
    {
      "pk": 50006001,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 1,
      "text": "After this, Jesus went away to the other side of the Sea of Galilee, which is also called the Sea of Tiberias.",
      "links": "<a href='/AIV/41/6/53'>Mark 6:53</a>",
      "comment": "The Sea of Galilee was known by different names; Tiberias was a city on its shore. The movement of Jesus shows His outreach beyond a single town, indicating His ministry’s expansion."
    },
    {
      "pk": 50006002,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 2,
      "text": "A large crowd followed Him because they saw the signs He was doing for the sick.",
      "links": "<a href='/AIV/40/14/14'>Matt. 14:14</a>",
      "comment": "Jesus’ miracles—especially healings—fuel public curiosity and faith, fulfilling prophecies about the Messiah (see Isa. 35:5-6)."
    },
    {
      "pk": 50006003,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 3,
      "text": "Jesus went up on the mountain, and He sat down there with His disciples.",
      "links": "<a href='/AIV/40/5/1'>Matt. 5:1</a>",
      "comment": "Mountaintops in Scripture are often places of teaching and revelation. Jesus sitting reflects the posture of a teacher or rabbi, preparing for significant instructions to His followers."
    },
    {
      "pk": 50006004,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 4,
      "text": "Now the Passover, the feast of the Jews, was near.",
      "links": "<a href='/AIV/02/12/1'>Exod. 12:1-14</a>",
      "comment": "Passover commemorates Israel’s deliverance from Egypt (see Exodus 12). Its mention prepares for deeper themes of deliverance and sacrifice in this chapter, linking Jesus to the Passover lamb typologically."
    },
    {
      "pk": 50006005,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 5,
      "text": "When Jesus looked up and saw a large crowd coming toward Him, He said to Philip, \"Where are we to buy bread, so that these people may eat?\"",
      "links": "<a href='/AIV/41/6/35'>Mark 6:35-37</a>",
      "comment": "Jesus questions Philip, testing the disciples' reliance on Him rather than their resources, foreshadowing how He, as the true Provider, will care for His people."
    },
    {
      "pk": 50006006,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 6,
      "text": "He said this to test him, for He Himself knew what He was going to do.",
      "links": "<a href='/AIV/19/78/19'>Psalm 78:19-20</a>",
      "comment": "Jesus’ question recalls God testing Israel in the wilderness; God provides miraculously to reveal dependence on Him. Anticipates Jesus’ supernatural care."
    },
    {
      "pk": 50006007,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 7,
      "text": "Philip answered Him, \"Two hundred denarii worth of bread would not be enough for each of them to get a little.\"",
      "links": "<a href='/AIV/40/14/17'>Matt. 14:17</a>",
      "comment": "A denarius was about a day's wage. The disciples' response underlines the impossibility by human means, opening the way for divine intervention."
    },
    {
      "pk": 50006008,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 8,
      "text": "One of His disciples, Andrew, Simon Peter’s brother, said to Him:",
      "links": "<a href='/AIV/40/14/18'>Matt. 14:18</a>",
      "comment": "Andrew is often the disciple who brings others to Jesus. Here, he brings forward a small offering, showing faith even in limited means."
    },
    {
      "pk": 50006009,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 9,
      "text": "\"There is a boy here who has five barley loaves and two fish, but what are they for so many?\"",
      "links": "<a href='/AIV/41/6/38'>Mark 6:38</a>",
      "comment": "Barley was the food of the poor; the humble offering mirrors God’s preference for using the simple and weak for profound purposes (cf. 1 Cor. 1:27)."
    },
    {
      "pk": 50006010,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 10,
      "text": "Jesus said, \"Make the people sit down.\" There was much grass in the place; so the men sat down, about five thousand in number.",
      "links": "<a href='/AIV/19/23/2'>Psalm 23:2</a>; <a href='/AIV/40/14/21'>Matt. 14:21</a>",
      "comment": "Sitting on green grass evokes the shepherd imagery of Psalm 23, with Jesus as the Good Shepherd providing for His flock."
    },
    {
      "pk": 50006011,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 11,
      "text": "Then Jesus took the loaves, and after giving thanks, He distributed them to those who were seated; He did the same with the fish, as much as they wanted.",
      "links": "<a href='/AIV/40/14/19'>Matt. 14:19</a>; <a href='/AIV/26/34/29'>Ezek. 34:29</a>",
      "comment": "Jesus’ action of giving thanks reflects the traditional blessing before meals and anticipates deeper eucharistic themes. The abundance foreshadows spiritual nourishment."
    },
    {
      "pk": 50006012,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 12,
      "text": "When they had eaten their fill, He told His disciples, \"Gather up the leftover pieces, so that nothing may be lost.\"",
      "links": "<a href='/AIV/40/14/20'>Matt. 14:20</a>",
      "comment": "Jesus’ concern to collect the leftovers highlights God’s generosity and care not to waste the gifts He provides—also subtly mirroring the careful stewardship of spiritual graces."
    },
    {
      "pk": 50006013,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 13,
      "text": "So they gathered them up and filled twelve baskets with the pieces left over from the five barley loaves which were more than enough after everyone had eaten.",
      "links": "<a href='/AIV/40/14/20'>Matt. 14:20</a>; <a href='/AIV/02/16/4'>Exod. 16:4'</a>",
      "comment": "The twelve baskets may symbolize completeness or the twelve tribes of Israel; Jesus’ provision is superabundant, hinting at fullness for all God’s people."
    },
    {
      "pk": 50006014,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 14,
      "text": "When the people saw the sign that He had done, they said, \"This is truly the Prophet who is to come into the world.\"",
      "links": "<a href='/AIV/05/18/15'>Deut. 18:15</a>; <a href='/AIV/40/21/11'>Matt. 21:11</a>",
      "comment": "‘The Prophet’ refers to the promised one like Moses (Deuteronomy 18:15). People see Jesus fulfilling roles both miraculous and Messianic."
    },
    {
      "pk": 50006015,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 15,
      "text": "Therefore, when Jesus perceived that they intended to come and make Him king by force, He withdrew again to the mountain by Himself.",
      "links": "<a href='/AIV/40/14/23'>Matt. 14:23</a>",
      "comment": "The people misunderstand His mission—they want an earthly king. Jesus’ retreat emphasizes that His kingdom is spiritual, not political."
    },
    {
      "pk": 50006016,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 16,
      "text": "When evening came, His disciples went down to the sea,",
      "links": "<a href='/AIV/40/14/24'>Matt. 14:24</a>",
      "comment": "The setting shifts to the lake, preparing for another miracle—emphasizing the disciples’ dependence on Jesus even in places of uncertainty."
    },
    {
      "pk": 50006017,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 17,
      "text": "got into a boat, and started across the sea to Capernaum. It was now dark, and Jesus had not yet come to them.",
      "links": "<a href='/AIV/40/14/24'>Matt. 14:24</a>",
      "comment": "Darkness in John’s gospel often conveys uncertainty or difficulty, setting up the miraculous appearance of Jesus."
    },
    {
      "pk": 50006018,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 18,
      "text": "A strong wind was blowing, and the sea grew rough.",
      "links": "<a href='/AIV/41/6/48'>Mark 6:48</a>",
      "comment": "The natural elements are beyond the disciples’ control, symbolizing humanity’s vulnerability and need for divine intervention."
    },
    {
      "pk": 50006019,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 19,
      "text": "When they had rowed about three or four miles, they saw Jesus walking on the sea and coming near the boat, and they were frightened.",
      "links": "<a href='/AIV/18/9/8'>Job 9:8</a>; <a href='/AIV/40/14/25'>Matt. 14:25</a>",
      "comment": "Walking on the water is a sign of divinity (see Job 9:8), revealing Jesus’ authority over creation and confirming His divine nature."
    },
    {
      "pk": 50006020,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 20,
      "text": "But He said to them, \"It is I; do not be afraid.\"",
      "links": "<a href='/AIV/02/3/14'>Exod. 3:14</a>",
      "comment": "‘It is I’ (literally ‘I am’) echoes the divine name revealed to Moses ('I AM'). Jesus reveals Himself with divine authority and comfort."
    },
    {
      "pk": 50006021,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 21,
      "text": "Then they were willing to take Him into the boat, and immediately the boat reached the shore where they were heading.",
      "links": "<a href='/AIV/40/14/32'>Matt. 14:32</a>",
      "comment": "The sudden arrival recalls God’s sovereign intervention. Jesus’ presence transforms the journey, highlighting assurance in His nearness."
    },
    {
      "pk": 50006022,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 22,
      "text": "On the next day the crowd that had stayed on the other side of the sea saw that only one boat was there, and that Jesus had not entered the boat with His disciples, but that His disciples had gone away alone.",
      "links": "<a href='/AIV/41/6/45'>Mark 6:45</a>",
      "comment": "This sets the stage for the crowd’s pursuit and their questioning, underscoring the mysterious and miraculous aspects of Jesus’ movements."
    },
    {
      "pk": 50006023,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 23,
      "text": "However, other boats from Tiberias came near the place where they had eaten the bread after the Lord had given thanks.",
      "links": "<a href='/AIV/40/14/34'>Matt. 14:34</a>",
      "comment": "The mention of Jesus giving thanks reiterates the idea of blessing over provision, hinting at deeper spiritual nourishment yet to be revealed."
    },
    {
      "pk": 50006024,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 24,
      "text": "When the crowd saw that Jesus was not there, nor His disciples, they got into the boats and went to Capernaum, seeking Jesus.",
      "links": "<a href='/AIV/41/6/53'>Mark 6:53</a>",
      "comment": "Their search demonstrates spiritual hunger, though it is focused initially on physical needs. This sets up Jesus' teaching on the true bread from heaven."
    },
    {
      "pk": 50006025,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 25,
      "text": "When they found Him on the other side of the sea, they said to Him, \"Rabbi, when did You get here?\"",
      "links": "<a href='/AIV/41/6/54'>Mark 6:54</a>",
      "comment": "Calling Him ‘Rabbi’ shows respect but also incomplete understanding of His identity; the question exposes their curiosity about His mysterious arrival."
    },
    {
      "pk": 50006026,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 26,
      "text": "Jesus answered them, \"Truly, truly, I say to you, you seek Me not because you saw signs, but because you ate the loaves and were filled.\"",
      "links": "<a href='/AIV/41/8/19'>Mark 8:19</a>",
      "comment": "Jesus notes the crowd’s focus on material provision rather than perceiving the spiritual meaning behind His signs, prompting a call to deeper faith."
    },
    {
      "pk": 50006027,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 27,
      "text": "\"Do not work for food that perishes, but for the food that remains to eternal life, which the Son of Man will give to you. For on Him God the Father has set His seal.\"",
      "links": "<a href='/AIV/23/55/2'>Isa. 55:2</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "Jesus contrasts temporary physical sustenance with eternal spiritual nourishment. ‘Seal’ implies authority and divine approval, emphasizing the special role of the Son."
    },
    {
      "pk": 50006028,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 28,
      "text": "Then they said to Him, \"What must we do, to be doing the works of God?\"",
      "links": "<a href='/AIV/03/18/4'>Lev. 18:4-5</a>",
      "comment": "The crowd asks about works, rooted in traditional Jewish understanding of law and obedience—preparing for Jesus’ clarification on belief as the fundamental work."
    },
    {
      "pk": 50006029,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 29,
      "text": "Jesus answered them, \"This is the work of God, that you believe in the One He has sent.\"",
      "links": "<a href='/AIV/40/17/5'>Matt. 17:5</a>",
      "comment": "Faith in Christ is central—belief is described not as mere assent but as trusting the One sent by God, affirming the primacy of faith in salvation."
    },
    {
      "pk": 50006030,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 30,
      "text": "So they said to Him, \"Then what sign do You do, that we may see and believe You? What work will You perform?",
      "links": "<a href='/AIV/02/16/15'>Exod. 16:15</a>",
      "comment": "The crowd demands further proof, referencing the provision of manna as a Messianic sign. This leads into Jesus’ teaching on the true bread."
    },
    {
      "pk": 50006031,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 31,
      "text": "\"Our fathers ate the manna in the wilderness; as it is written, 'He gave them bread from heaven to eat.'\"",
      "links": "<a href='/AIV/02/16/4'>Exod. 16:4</a>; <a href='/AIV/19/78/24'>Psalm 78:24</a>",
      "comment": "References to manna link Jesus’ miracle to Old Testament provision, setting up His claim as the true bread from heaven."
    },
    {
      "pk": 50006032,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 32,
      "text": "Then Jesus said to them, \"Truly, truly, I say to you, it was not Moses who gave you the bread from heaven, but My Father gives you the true bread from heaven.",
      "links": "<a href='/AIV/02/16/15'>Exod. 16:15</a>; <a href='/AIV/19/105/40'>Psalm 105:40</a>",
      "comment": "Jesus distinguishes between past provision (manna through Moses) and present spiritual gift (true bread through Himself), elevating His role above Moses."
    },
    {
      "pk": 50006033,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 33,
      "text": "For the bread of God is He who comes down from heaven and gives life to the world.\"",
      "links": "<a href='/AIV/19/78/24'>Psalm 78:24</a>; <a href='/AIV/40/26/26'>Matt. 26:26</a>",
      "comment": "Bread is identified with Jesus Himself, who gives eternal life. This is a profoundly high Christology, pointing to His divine origin and unique mission."
    },
    {
      "pk": 50006034,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 34,
      "text": "They said to Him, \"Sir, give us this bread always.\"",
      "links": "<a href='/AIV/43/4/15'>John 4:15</a>",
      "comment": "Similar to the request for living water (John 4:15), the crowd’s desire for continual bread intends physical, but Jesus leads them to a deeper meaning."
    },
    {
      "pk": 50006035,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 35,
      "text": "Jesus said to them, \"I am the bread of life; whoever comes to Me shall not hunger, and whoever believes in Me shall never thirst.\"",
      "links": "<a href='/AIV/23/49/10'>Isa. 49:10</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "Jesus’ ‘I am’ statement is another claim to divinity. Bread of life introduces the theme of spiritual sustenance, foundational for understanding later teachings about communion."
    },
    {
      "pk": 50006036,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 36,
      "text": "But I told you that you have seen Me and yet do not believe.",
      "links": "<a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Despite witnessing miracles, the crowd struggles with faith—underscoring the need for God’s grace to truly recognize Jesus’ identity."
    },
    {
      "pk": 50006037,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 37,
      "text": "All that the Father gives Me will come to Me, and whoever comes to Me I will never cast out.",
      "links": "<a href='/AIV/43/17/2'>John 17:2</a>",
      "comment": "Emphasizes the security and assurance in Jesus for those who respond to God’s calling, introducing themes of predestination and perseverance."
    },
    {
      "pk": 50006038,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 38,
      "text": "For I have come down from heaven, not to do My own will but the will of Him who sent Me.",
      "links": "<a href='/AIV/50/2/7'>Phil. 2:7-8</a>; <a href='/AIV/43/5/30'>John 5:30</a>",
      "comment": "Highlights Jesus’ heavenly origin and submission to the Father, again establishing His unique divine mission and obedience."
    },
    {
      "pk": 50006039,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 39,
      "text": "And this is the will of Him who sent Me, that I should lose nothing of all that He has given Me, but raise it up at the last day.",
      "links": "<a href='/AIV/43/11/24'>John 11:24</a>",
      "comment": "Jesus promises final resurrection for all given to Him, anticipating future hope and the ultimate gathering of the faithful."
    },
    {
      "pk": 50006040,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 40,
      "text": "For this is the will of My Father, that everyone who looks to the Son and believes in Him will have eternal life, and I will raise him up at the last day.\"",
      "links": "<a href='/AIV/04/21/9'>Num. 21:9</a>; <a href='/AIV/43/3/14'>John 3:14-16</a>",
      "comment": "Echoes the bronze serpent story (Numbers 21). Life and resurrection are direct results of faith in the Son—a key Christological and soteriological teaching."
    },
    {
      "pk": 50006041,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 41,
      "text": "So the Jews grumbled about Him, because He said, \"I am the bread that came down from heaven.\"",
      "links": "<a href='/AIV/02/16/2'>Exod. 16:2'>Exod. 16:2-3</a>",
      "comment": "Their murmuring recalls Israel’s grumbling in Exodus (16:2-3), showing resistance to the radical nature of Jesus’ claim—identifying Himself with heavenly provision."
    },
    {
      "pk": 50006042,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 42,
      "text": "They said, \"Is not this Jesus, the son of Joseph, whose father and mother we know? How can He now say, 'I have come down from heaven'?\"",
      "links": "<a href='/AIV/40/13/55'>Matt. 13:55</a>",
      "comment": "People struggle to accept Jesus’ divine origin because of His familiar humanity, demonstrating the mystery of the Incarnation—fully God and fully man."
    },
    {
      "pk": 50006043,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 43,
      "text": "Jesus replied, \"Stop grumbling among yourselves.",
      "links": "<a href='/AIV/02/16/7'>Exod. 16:7</a>",
      "comment": "Jesus addresses their internal resistance, seeking receptivity and faith over skepticism—another parallel to Israel’s experience with divine provision."
    },
    {
      "pk": 50006044,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 44,
      "text": "No one can come to Me unless the Father who sent Me draws him, and I will raise him up at the last day.",
      "links": "<a href='/AIV/19/65/4'>Psalm 65:4</a>; <a href='/AIV/43/12/32'>John 12:32</a>",
      "comment": "Salvation is initiated by God’s grace; human response is enabled by the Father’s drawing. Ultimately, the gift of faith is divine, not just personal effort."
    },
    {
      "pk": 50006045,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 45,
      "text": "It is written in the prophets, 'And they shall all be taught by God.' Everyone who has heard and learned from the Father comes to Me.",
      "links": "<a href='/AIV/23/54/13'>Isa. 54:13</a>; <a href='/AIV/24/31/34'>Jer. 31:34</a>",
      "comment": "Prophetic fulfillment: God Himself teaches people, now most fully in the person of Jesus. Supernatural revelation leads to true knowledge and faith."
    },
    {
      "pk": 50006046,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 46,
      "text": "Not that anyone has seen the Father except He who is from God; He has seen the Father.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>",
      "comment": "Jesus’ unique relationship: only He truly beholds the Father, presenting Himself as the revealer—a high Christology exclusive to the Son."
    },
    {
      "pk": 50006047,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 47,
      "text": "Truly, truly, I say to you, whoever believes has eternal life.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/43/5/24'>John 5:24</a>",
      "comment": "Offers assurance: belief leads to eternal life, not by merit but by faith. Immediate possession of life is a key theme in John’s gospel."
    },
    {
      "pk": 50006048,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 48,
      "text": "I am the bread of life.",
      "links": "<a href='/AIV/43/6/35'>John 6:35</a>",
      "comment": "\"I am\" echoes the divine name; Jesus identifies Himself directly as the source of spiritual renewal and sustenance, preparing for teaching about communion."
    },
    {
      "pk": 50006049,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 49,
      "text": "Your fathers ate the manna in the wilderness, and they died.",
      "links": "<a href='/AIV/02/16/35'>Exod. 16:35</a>",
      "comment": "Contrasts temporary provision (manna) with enduring spiritual life, shifting focus to the greater gift found in Christ."
    },
    {
      "pk": 50006050,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 50,
      "text": "This is the bread that comes down from heaven, so that one may eat of it and not die.",
      "links": "<a href='/AIV/41/14/22'>Mark 14:22</a>",
      "comment": "Jesus presents Himself as a new, heavenly manna—one that leads to eternal life. This begins to introduce sacramental language metaphorically and literally."
    },
    {
      "pk": 50006051,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 51,
      "text": "I am the living bread that came down from heaven. If anyone eats of this bread, he will live forever; and the bread that I will give for the life of the world is My flesh.\"",
      "links": "<a href='/AIV/40/26/26'>Matt. 26:26</a>; <a href='/AIV/41/14/22'>Mark 14:22</a>",
      "comment": "Here, Jesus connects eternal life not just with faith but with sacramental eating—His flesh as real food for the world. Literal and spiritual interpretations both are supported; historically seen as teaching about the Lord’s Supper, and high participation in His divine life."
    },
    {
      "pk": 50006052,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 52,
      "text": "Then the Jews disputed among themselves, saying, \"How can this Man give us His flesh to eat?\"",
      "links": "<a href='/AIV/03/17/14'>Lev. 17:14</a>",
      "comment": "The dispute reflects both theological scandal (taboo of eating flesh/blood) and misunderstanding, highlighting the radical nature of Jesus’ teaching about real spiritual eating."
    },
    {
      "pk": 50006053,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 53,
      "text": "So Jesus said to them, \"Truly, truly, I say to you, unless you eat the flesh of the Son of Man and drink His blood, you have no life in yourselves.",
      "links": "<a href='/AIV/40/26/27'>Matt. 26:27-28</a>",
      "comment": "Jesus responds plainly: without receiving Him in this profound way (distinct from mere belief), spiritual life is impossible. This directly anticipates later sacramental practice."
    },
    {
      "pk": 50006054,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 54,
      "text": "Whoever feeds on My flesh and drinks My blood has eternal life, and I will raise him up on the last day.",
      "links": "<a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Feeding on Jesus—receiving Him sacramentally and spiritually—guarantees resurrection. A clear promise with profound implications for the practice of worship and faith."
    },
    {
      "pk": 50006055,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 55,
      "text": "For My flesh is true food, and My blood is true drink.",
      "links": "<a href='/AIV/40/26/26'>Matt. 26:26-28</a>",
      "comment": "Jesus asserts the reality of His offer; not symbolic only but a true participation in His person. Historically interpreted as real presence in the Lord’s Supper."
    },
    {
      "pk": 50006056,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 56,
      "text": "Whoever feeds on My flesh and drinks My blood remains in Me, and I in him.",
      "links": "<a href='/AIV/43/15/4'>John 15:4-5</a>",
      "comment": "This mutual indwelling deepens themes of spiritual union. Connection to vine imagery (John 15) shows how sacramental participation strengthens and preserves spiritual life."
    },
    {
      "pk": 50006057,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 57,
      "text": "As the living Father sent Me, and I live because of the Father, so whoever feeds on Me, he also will live because of Me.",
      "links": "<a href='/AIV/43/5/26'>John 5:26</a>",
      "comment": "Jesus models perfect dependence on the Father; believers participate in His life through communion, both literal and spiritual."
    },
    {
      "pk": 50006058,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 58,
      "text": "This is the bread that came down from heaven, not like the bread the fathers ate and died. Whoever eats this bread will live forever.\"",
      "links": "<a href='/AIV/43/6/49'>John 6:49</a>",
      "comment": "Jesus contrasts His gift with the old provision—eternal life vs. physical sustenance. Affirms enduring life through continued participation."
    },
    {
      "pk": 50006059,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 59,
      "text": "Jesus said these things while teaching in the synagogue in Capernaum.",
      "links": "",
      "comment": "Publicly teaching in the synagogue adds to the weight of His statements, placing them in a context of worship and communal gathering, subtly alluding to the centrality of worship in the faith."
    },
    {
      "pk": 50006060,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 60,
      "text": "Many of His disciples, when they heard this, said, \"This is a hard saying; who can accept it?\"",
      "links": "<a href='/AIV/43/3/4'>John 3:4</a>",
      "comment": "Shows that even followers struggle with accepting literal participation—highlighting the depth and mystery of Jesus’ teachings."
    },
    {
      "pk": 50006061,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 61,
      "text": "But Jesus, aware that His disciples were grumbling about this, said to them, \"Does this offend you?",
      "links": "<a href='/AIV/23/8/14'>Isa. 8:14</a>",
      "comment": "Jesus anticipates offense, referencing that His words will be a stumbling block, fulfilling prophecy about Himself as a stone of stumbling to some."
    },
    {
      "pk": 50006062,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 62,
      "text": "Then what if you were to see the Son of Man ascending to where He was before?",
      "links": "<a href='/AIV/43/3/13'>John 3:13</a>; <a href='/AIV/19/68/18'>Psalm 68:18</a>",
      "comment": "Jesus points toward the Ascension, signifying His divine origin and return—further validating the divine nature of His life and sacrifice."
    },
    {
      "pk": 50006063,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 63,
      "text": "The Spirit gives life; the flesh is no help at all. The words I have spoken to you are spirit and life.",
      "links": "<a href='/AIV/26/37/14'>Ezek. 37:14</a>; <a href='/AIV/43/4/24'>John 4:24</a>",
      "comment": "Jesus makes clear that understanding and participation require spiritual openness; still, the established sacramental language suggests literal reception is also instrumental."
    },
    {
      "pk": 50006064,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 64,
      "text": "But there are some of you who do not believe.\" (For Jesus knew from the beginning who those were who did not believe, and who would betray Him.)",
      "links": "<a href='/AIV/43/13/11'>John 13:11</a>",
      "comment": "Jesus’ foreknowledge of unbelief and betrayal highlights His divine insight and the tension between external following and internal acceptance."
    },
    {
      "pk": 50006065,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 65,
      "text": "He said, \"This is why I told you that no one can come to Me unless it is granted him by the Father.\"",
      "links": "<a href='/AIV/43/6/44'>John 6:44</a>",
      "comment": "Reiterates the necessity of divine initiative, emphasizing the role of grace in salvation."
    },
    {
      "pk": 50006066,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 66,
      "text": "After this, many of His disciples turned back and no longer walked with Him.",
      "links": "<a href='/AIV/43/6/60'>John 6:60</a>",
      "comment": "Some followers also abandon Jesus over difficult teachings, illustrating the challenge of full fidelity and the cost of discipleship."
    },
    {
      "pk": 50006067,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 67,
      "text": "So Jesus said to the Twelve, \"Do you also want to go away?\"",
      "links": "<a href='/AIV/41/8/29'>Mark 8:29</a>",
      "comment": "The Twelve represent the foundational leaders of the future church, and their fidelity against the crowd contrasts true faith’s perseverance."
    },
    {
      "pk": 50006068,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 68,
      "text": "Simon Peter answered Him, \"Lord, to whom shall we go? You have the words of eternal life;",
      "links": "<a href='/AIV/43/6/63'>John 6:63</a>",
      "comment": "Peter’s response expresses faith and trust, recognizing Jesus alone provides eternal truth and grace—early echo of leader’s special role among the apostles."
    },
    {
      "pk": 50006069,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 69,
      "text": "and we have believed and have come to know that You are the Holy One of God.\"",
      "links": "<a href='/AIV/19/16/10'>Psalm 16:10</a>; <a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "The Holy One of God is a title of divinity and Messianic fulfillment. Recognizing Jesus’ holiness and uniqueness is key to following Him fully."
    },
    {
      "pk": 50006070,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 70,
      "text": "Jesus answered them, \"Did I not choose you, the Twelve? And yet one of you is a devil.\"",
      "links": "<a href='/AIV/43/13/2'>John 13:2</a>",
      "comment": "Jesus chooses the apostles, but not all are faithful—pointing to the mystery of betrayal (foreshadowing Judas) and the reality of disorder within the community."
    },
    {
      "pk": 50006071,
      "translation": "AIV",
      "book": 50,
      "bookName": "John",
      "bookAbbreviation": "John",
      "chapter": 6,
      "verse": 71,
      "text": "He spoke of Judas, the son of Simon Iscariot, for he, one of the Twelve, was about to betray Him.",
      "links": "<a href='/AIV/40/26/14'>Matt. 26:14</a>; <a href='/AIV/43/13/26'>John 13:26</a>",
      "comment": "Judas’ betrayal serves as a warning and prelude to the Passion. It also underscores the reality that even among close followers, true allegiance cannot be assumed."
    }
  ],
  "translatedAt": "2025-12-24T11:05:52.500Z"
}