{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 8,
  "verses": [
    {
      "pk": 4308001,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 1,
      "text": "But Jesus went to the Mount of Olives.",
      "links": "<a href='/AIV/42/21/37'>Luke 21:37</a>",
      "comment": "The Mount of Olives is often a place of prayer for Jesus. The separation from the crowd highlights Jesus’ consistent practice of solitude with the Father before conducting important works."
    },
    {
      "pk": 4308002,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 2,
      "text": "Early in the morning, he came again to the temple. All the people came to him, and he sat down and began to teach them.",
      "links": "<a href='/AIV/40/5/1-2'>Matt. 5:1-2</a>",
      "comment": "Rabbis usually sat to teach, signifying authority. The crowds’ eagerness to gather underscores his recognition as a teacher from God."
    },
    {
      "pk": 4308003,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 3,
      "text": "The scribes and the Pharisees brought a woman caught in adultery, and, making her stand in the midst,",
      "links": "<a href='/AIV/5/22/22'>Deut. 22:22</a>",
      "comment": "The woman represents those condemned under the Law; scribes and Pharisees are testing Jesus' stance concerning Mosaic authority."
    },
    {
      "pk": 4308004,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 4,
      "text": "they said to him, 'Teacher, this woman has been caught in the act of adultery.'",
      "links": "<a href='/AIV/3/20/10'>Lev. 20:10</a>",
      "comment": "This accusation is meant to trap Jesus between divine Law and Roman jurisdiction, as only Rome could issue capital punishment."
    },
    {
      "pk": 4308005,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 5,
      "text": "Now in the Law, Moses commanded us to stone such women. So what do you say?",
      "links": "<a href='/AIV/5/22/24'>Deut. 22:24</a>",
      "comment": "The Law required death for adultery but left open method. The accusers are seeking Jesus' judgment, choosing between mercy and justice."
    },
    {
      "pk": 4308006,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 6,
      "text": "They said this to test him, so that they might have some charge to bring against him. Jesus bent down and wrote with his finger on the ground.",
      "links": "<a href='/AIV/24/17/13'>Jer. 17:13</a>",
      "comment": "Jesus writing on the ground may symbolize divine authority, echoing God writing the Law with his finger. He shows both wisdom and mercy in not being quick to judge."
    },
    {
      "pk": 4308007,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 7,
      "text": "And as they continued to ask him, he stood up and said to them, 'Let him who is without sin among you be the first to throw a stone at her.'",
      "links": "<a href='/AIV/5/17/7'>Deut. 17:7</a>",
      "comment": "Jesus upholds the law but demands personal righteousness from accusers, exposing hypocrisy."
    },
    {
      "pk": 4308008,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 8,
      "text": "And again he stooped down and wrote on the ground.",
      "links": "",
      "comment": "The parallel to divine inscription continues, possibly recalling the giving of Law—here offering a new perspective focused on mercy."
    },
    {
      "pk": 4308009,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 9,
      "text": "But when they heard it, they went away one by one, beginning with the oldest, and Jesus was left alone with the woman standing in the midst.",
      "links": "",
      "comment": "The accusers’ conscience convicts them; Jesus’ wisdom causes self-examination before judgment."
    },
    {
      "pk": 4308010,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 10,
      "text": "Jesus stood up and said to her, 'Woman, where are they? Has no one condemned you?'",
      "links": "<a href='/AIV/45/8/1'>Rom. 8:1</a>",
      "comment": "Jesus' question points toward the possibility of mercy when the accusers are gone."
    },
    {
      "pk": 4308011,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 11,
      "text": "She said, 'No one, Lord.' And Jesus said, 'Neither do I condemn you. Go, and from now on sin no more.'",
      "links": "<a href='/AIV/3/34/6-7'>Ex. 34:6-7</a>",
      "comment": "Jesus embodies both forgiveness and a call to repentance, balancing justice and mercy. This anticipates later teachings on reconciliation and helps to explain the basis for forgiveness and sanctification."
    },
    {
      "pk": 4308012,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 12,
      "text": "Again Jesus spoke to them, saying, 'I am the light of the world. Whoever follows me will not walk in darkness but will have the light of life.'",
      "links": "<a href='/AIV/23/42/6'>Isa. 42:6</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Jesus’ 'I am' statement recalls God’s name in Exodus 3:14, indicating divinity. Jesus is the true light, fulfilling prophecy and guiding all who follow him toward life."
    },
    {
      "pk": 4308013,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 13,
      "text": "The Pharisees said to him, 'You are bearing witness about yourself; your testimony is not true.'",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "Jewish law required multiple witnesses for a valid testimony; Jesus’ claim is challenged legally."
    },
    {
      "pk": 4308014,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 14,
      "text": "Jesus answered, 'Even if I bear witness about myself, my testimony is true, for I know where I came from and where I am going. But you do not know where I come from or where I am going.'",
      "links": "<a href='/AIV/8/16/13-14'>John 16:13-14</a>",
      "comment": "Jesus affirms his divine origin and destiny. Only he fully knows the truth about his mission."
    },
    {
      "pk": 4308015,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 15,
      "text": "You judge according to the flesh; I judge no one.",
      "links": "",
      "comment": "Human judgment is limited by appearances. Jesus’ judgment is spiritual and just."
    },
    {
      "pk": 4308016,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 16,
      "text": "Yet even if I do judge, my judgment is true, for it is not I alone who judge, but I and the Father who sent me.",
      "links": "<a href='/AIV/5/32/39'>Deut. 32:39</a>",
      "comment": "Jesus unites his authority with the Father’s—a claim to divine equality, reinforcing high Christology."
    },
    {
      "pk": 4308017,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 17,
      "text": "In your Law it is written that the testimony of two men is true.",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "Jesus applies the Law to himself and the Father, referring to a heavenly witness."
    },
    {
      "pk": 4308018,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 18,
      "text": "I am the one who bears witness about myself, and the Father who sent me bears witness about me.",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "The divine witness at Jesus’ baptism confirms his relationship with the Father."
    },
    {
      "pk": 4308019,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 19,
      "text": "They said to him, 'Where is your Father?' Jesus answered, 'You know neither me nor my Father. If you knew me, you would know my Father also.'",
      "links": "<a href='/AIV/43/14/7'>John 14:7</a>",
      "comment": "Knowing Jesus is intimately connected to knowing God. This anticipates the unity of Christ with the Father expressed more fully later."
    },
    {
      "pk": 4308020,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 20,
      "text": "These words Jesus spoke in the treasury, as he taught in the temple; and no one arrested him, because his hour had not yet come.",
      "links": "<a href='/AIV/43/2/4'>John 2:4</a>",
      "comment": "Jesus’ authority over his life is highlighted. 'His hour' refers to the appointed time for his passion."
    },
    {
      "pk": 4308021,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 21,
      "text": "So he said to them again, 'I am going away, and you will seek me, and you will die in your sin. Where I am going, you cannot come.'",
      "links": "<a href='/AIV/43/7/34'>John 7:34</a>",
      "comment": "Jesus anticipates his ascension and glorification; human sin remains without his atoning work."
    },
    {
      "pk": 4308022,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 22,
      "text": "So the Jews said, 'Will he kill himself, since he says, ",
      "Where I am going, you cannot come?": "?'",
      "links": "",
      "comment": "They misunderstand Jesus’ meaning, thinking physically rather than spiritually. This theme recurs in John’s Gospel."
    },
    {
      "pk": 4308023,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 23,
      "text": "He said to them, 'You are from below; I am from above. You are of this world; I am not of this world.'",
      "links": "<a href='/AIV/43/17/14'>John 17:14</a>",
      "comment": "Jesus distinguishes his divine origin, again affirming his deity."
    },
    {
      "pk": 4308024,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 24,
      "text": "I told you that you would die in your sins, for unless you believe that I am he, you will die in your sins.'",
      "links": "<a href='/AIV/2/3/14'>Ex. 3:14</a>",
      "comment": "'I am' is an allusion to God's divine name, making a profound claim about Jesus' identity."
    },
    {
      "pk": 4308025,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 25,
      "text": "So they said to him, 'Who are you?' Jesus said to them, 'Just what I have been telling you from the beginning.'",
      "links": "<a href='/AIV/43/4/26'>John 4:26</a>",
      "comment": "Jesus’ identity has been consistently revealed throughout his ministry, highlighting the continuity of his mission."
    },
    {
      "pk": 4308026,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 26,
      "text": "I have much to say about you and much to judge, but he who sent me is true, and I declare to the world what I have heard from him.'",
      "links": "<a href='/AIV/43/12/49'>John 12:49</a>",
      "comment": "Jesus' message and judgment come directly from the Father, emphasizing divine revelation."
    },
    {
      "pk": 4308027,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 27,
      "text": "They did not understand that he was speaking to them about the Father.",
      "links": "",
      "comment": "The consistent misunderstanding by the crowd demonstrates spiritual blindness, a repeated theme in John’s Gospel."
    },
    {
      "pk": 4308028,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 28,
      "text": "So Jesus said to them, 'When you have lifted up the Son of Man, then you will know that I am he, and that I do nothing on my own authority, but speak just as the Father taught me.'",
      "links": "<a href='/AIV/4/21/8-9'>Num. 21:8-9</a>; <a href='/AIV/43/3/14'>John 3:14</a>",
      "comment": "Being 'lifted up' refers to the crucifixion, echoing Numbers 21:8–9 and foreshadowing the cross as the source of salvation."
    },
    {
      "pk": 4308029,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 29,
      "text": "And he who sent me is with me; he has not left me alone, for I always do the things that are pleasing to him.'",
      "links": "<a href='/AIV/23/42/1'>Isa. 42:1</a>",
      "comment": "Jesus' obedience fulfills prophecy of the servant who always does what is pleasing to God."
    },
    {
      "pk": 4308030,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 30,
      "text": "As he was saying these things, many believed in him.",
      "links": "",
      "comment": "Faith in Jesus arises from revelation and the power of his words."
    },
    {
      "pk": 4308031,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 31,
      "text": "So Jesus said to the Jews who had believed in him, 'If you abide in my word, you are truly my disciples,",
      "links": "<a href='/AIV/43/15/7'>John 15:7</a>",
      "comment": "Abiding in Jesus’ word points toward ongoing faithfulness and perseverance—a call to both faith and obedience."
    },
    {
      "pk": 4308032,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 32,
      "text": "and you will know the truth, and the truth will set you free.'",
      "links": "<a href='/AIV/19/119/45'>Ps. 119:45</a>",
      "comment": "Spiritual freedom is found in knowing Christ’s truth, foreshadowing the deeper liberation brought in the new covenant."
    },
    {
      "pk": 4308033,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 33,
      "text": "They answered him, 'We are offspring of Abraham and have never been enslaved to anyone. How is it that you say, ",
      "You will become free?": "?'",
      "links": "<a href='/AIV/40/3/9'>Matt. 3:9</a>",
      "comment": "The crowd appeals to their heritage. Jesus redirects the discussion to spiritual slavery."
    },
    {
      "pk": 4308034,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 34,
      "text": "Jesus answered them, 'Truly, truly, I say to you, everyone who commits sin is a slave to sin.",
      "links": "<a href='/AIV/45/6/16'>Rom. 6:16</a>",
      "comment": "Sin brings spiritual bondage, highlighting the need for a redeemer."
    },
    {
      "pk": 4308035,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 35,
      "text": "The slave does not remain in the house forever; the son remains forever.",
      "links": "<a href='/AIV/48/4/7'>Gal. 4:7</a>",
      "comment": "Only through the Son is true membership and inheritance given to God’s people."
    },
    {
      "pk": 4308036,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 36,
      "text": "So if the Son sets you free, you will be free indeed.",
      "links": "<a href='/AIV/45/8/2'>Rom. 8:2</a>",
      "comment": "True spiritual freedom comes only through Christ, not by heritage or works."
    },
    {
      "pk": 4308037,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 37,
      "text": "I know that you are offspring of Abraham; yet you seek to kill me, because my word finds no place in you.",
      "links": "",
      "comment": "Physical descent is not sufficient; receptivity to God’s word distinguishes true children of Abraham."
    },
    {
      "pk": 4308038,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 38,
      "text": "I speak of what I have seen with my Father, and you do what you have heard from your father.'",
      "links": "",
      "comment": "Jesus draws a spiritual contrast between those aligned with God and those opposed to Him."
    },
    {
      "pk": 4308039,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 39,
      "text": "They answered him, 'Abraham is our father.' Jesus said to them, 'If you were Abraham’s children, you would be doing the works Abraham did,",
      "links": "<a href='/AIV/1/18/19'>Gen. 18:19</a>",
      "comment": "Actions reveal true spiritual lineage, echoing Genesis teaching about Abraham’s faith."
    },
    {
      "pk": 4308040,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 40,
      "text": "but now you seek to kill me, a man who has told you the truth that I heard from God. Abraham did not do this.",
      "links": "<a href='/AIV/1/26/5'>Gen. 26:5</a>",
      "comment": "Jesus points out the difference between Abraham’s attitude toward revelation and theirs."
    },
    {
      "pk": 4308041,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 41,
      "text": "You are doing the works your father did.' They said to him, 'We were not born of sexual immorality. We have one Father—even God.'",
      "links": "<a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "Their claim reflects spiritual pride, mistakenly believing mere heritage ensures relationship with God."
    },
    {
      "pk": 4308042,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 42,
      "text": "Jesus said to them, 'If God were your Father, you would love me, for I came from God and I am here. I came not of my own accord, but he sent me.'",
      "links": "<a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Love for Jesus is the test of true relationship with God."
    },
    {
      "pk": 4308043,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 43,
      "text": "Why do you not understand what I say? It is because you cannot bear to hear my word.",
      "links": "",
      "comment": "Spiritual resistance prevents acceptance of Jesus’ message, tying reception of truth to openness of heart."
    },
    {
      "pk": 4308044,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 44,
      "text": "You are of your father the devil, and your will is to do your father’s desires. He was a murderer from the beginning, and does not stand in the truth, because there is no truth in him. When he lies, he speaks from his own nature, for he is a liar and the father of lies.",
      "links": "<a href='/AIV/1/3/4'>Gen. 3:4</a>",
      "comment": "Jesus unmasks the source of spiritual blindness, referencing Satan’s actions from Genesis onward."
    },
    {
      "pk": 4308045,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 45,
      "text": "But because I tell the truth, you do not believe me.",
      "links": "",
      "comment": "Rejection of truth is evidence of spiritual opposition to God."
    },
    {
      "pk": 4308046,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 46,
      "text": "Which of you convicts me of sin? If I tell the truth, why do you not believe me?",
      "links": "<a href='/AIV/60/2/22'>1 Pet. 2:22</a>",
      "comment": "Jesus’ sinlessness is presented—a foundation for his authority and the Christian doctrine of the sinless Christ."
    },
    {
      "pk": 4308047,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 47,
      "text": "Whoever is of God hears the words of God. The reason why you do not hear them is that you are not of God.",
      "links": "<a href='/AIV/62/4/6'>1 John 4:6</a>",
      "comment": "Spiritual origin determines one's ability to hear the truth. This underlines the importance of spiritual rebirth and a receptive heart."
    },
    {
      "pk": 4308048,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 48,
      "text": "The Jews answered him, 'Are we not right in saying that you are a Samaritan and have a demon?'",
      "links": "",
      "comment": "Such accusations reflect desperation and hostility, further evidence of misunderstanding Jesus’ mission."
    },
    {
      "pk": 4308049,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 49,
      "text": "Jesus answered, 'I do not have a demon, but I honor my Father, and you dishonor me.",
      "links": "",
      "comment": "Jesus calmly asserts his innocence and affirms his divine mission despite insults."
    },
    {
      "pk": 4308050,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 50,
      "text": "Yet I do not seek my own glory; there is one who seeks it, and he is the judge.",
      "links": "<a href='/AIV/43/5/22'>John 5:22</a>",
      "comment": "Jesus entrusts justice and glory to the Father, showing humility and submission."
    },
    {
      "pk": 4308051,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 51,
      "text": "Truly, truly, I say to you, if anyone keeps my word, he will never see death.",
      "links": "<a href='/AIV/43/11/26'>John 11:26</a>",
      "comment": "This promise refers to eternal life, connecting obedience to Jesus with spiritual hope."
    },
    {
      "pk": 4308052,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 52,
      "text": "The Jews said to him, 'Now we know that you have a demon! Abraham died, as did the prophets, yet you say, ",
      "If anyone keeps my word, he will never taste death.": "'",
      "links": "<a href='/AIV/1/25/8'>Gen. 25:8</a>",
      "comment": "Physical death of the patriarchs is contrasted with Jesus’ promise of spiritual life."
    },
    {
      "pk": 4308053,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 53,
      "text": "Are you greater than our father Abraham, who died? And the prophets died! Who do you make yourself out to be?'",
      "links": "<a href='/AIV/40/12/42'>Matt. 12:42</a>",
      "comment": "Jesus’ claims invoke questions about his unique authority and identity."
    },
    {
      "pk": 4308054,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 54,
      "text": "Jesus answered, 'If I glorify myself, my glory is nothing. It is my Father who glorifies me, of whom you say, ",
      "He is our God.": "'",
      "links": "",
      "comment": "True honor comes from God, not self-exaltation."
    },
    {
      "pk": 4308055,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 55,
      "text": "But you have not known him. I know him. If I were to say that I do not know him, I would be a liar like you, but I do know him and I keep his word.",
      "links": "",
      "comment": "Perfect obedience and knowledge of the Father mark Jesus as unique."
    },
    {
      "pk": 4308056,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 56,
      "text": "Your father Abraham rejoiced that he would see my day. He saw it and was glad.'",
      "links": "<a href='/AIV/1/22/18'>Gen. 22:18</a>",
      "comment": "Jesus claims that Abraham anticipated the Messiah, referencing Old Testament fulfillment and linking his identity to the promise."
    },
    {
      "pk": 4308057,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 57,
      "text": "So the Jews said to him, 'You are not yet fifty years old, and have you seen Abraham?'",
      "links": "",
      "comment": "Literal misunderstanding continues—the leaders are limited to physical chronology."
    },
    {
      "pk": 4308058,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 58,
      "text": "Jesus said to them, 'Truly, truly, I say to you, before Abraham was, I am.'",
      "links": "<a href='/AIV/2/3/14'>Ex. 3:14</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>",
      "comment": "This is a direct self-identification with the divine name from Exodus. A clear and dramatic claim to divinity, recognized by his hearers as blasphemy if not true."
    },
    {
      "pk": 4308059,
      "translation": "AIV",
      "book": 43,
      "chapter": 8,
      "verse": 59,
      "text": "So they picked up stones to throw at him, but Jesus hid himself and went out of the temple.",
      "links": "<a href='/AIV/3/24/16'>Lev. 24:16</a>",
      "comment": "Attempting to stone Jesus for blasphemy confirms they understood his claim to divinity. Yet he escapes, as it is not yet his appointed hour. Note the foreshadowing of divine protection and the inevitable fulfillment of his mission."
    }
  ],
  "translatedAt": "2025-12-23T03:04:40.223Z"
}