{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 21,
  "verses": [
    {
      "pk": 1992101,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 1,
      "text": "After this, Jesus revealed Himself again to the disciples by the Sea of Tiberias. And He revealed Himself in this way:",
      "links": "<a href='/AIV/43/20/19'>John 20:19</a>",
      "comment": "The Sea of Tiberias is the Sea of Galilee (see John 6:1). The word 'revealed' (φανερόω) stresses Christ’s post-Resurrection initiative—He makes Himself present to His followers."
    },
    {
      "pk": 1992102,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 2,
      "text": "Simon Peter, Thomas called the Twin, Nathanael from Cana in Galilee, the sons of Zebedee, and two others of His disciples were together.",
      "links": "<a href='/AIV/43/1/45-46'>John 1:45-46</a>; <a href='/AIV/40/4/21'>Matt. 4:21</a>",
      "comment": "This detailed list identifies key disciples, underscoring their witness to Jesus’ resurrection."
    },
    {
      "pk": 1992103,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 3,
      "text": "Simon Peter said to them, 'I am going fishing.' They said to him, 'We will go with you.' They went out, got into the boat, but that night they caught nothing.",
      "links": "<a href='/AIV/42/5/5'>Luke 5:5</a>",
      "comment": "The disciples return to fishing, paralleling their first call (see Luke 5:1–11), emphasizing their total dependence on Jesus for success in their mission."
    },
    {
      "pk": 1992104,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 4,
      "text": "Just as day was breaking, Jesus stood on the shore; yet the disciples did not know that it was Jesus.",
      "links": "<a href='/AIV/43/20/14'>John 20:14</a>; <a href='/AIV/42/24/16'>Luke 24:16</a>",
      "comment": "Resurrected Jesus sometimes veils His identity, showing the mystery of His glorified body (see Luke 24:16)."
    },
    {
      "pk": 1992105,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 5,
      "text": "Then Jesus said to them, 'Children, do you have any fish?' They answered Him, 'No.'",
      "links": "<a href='/AIV/21/11/9'>Eccl. 11:9</a>",
      "comment": "The affectionate address 'Children' suggests spiritual fatherhood and leadership. Jesus addresses them as those under His tutelage."
    },
    {
      "pk": 1992106,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 6,
      "text": "He said to them, 'Cast the net on the right side of the boat and you will find some.' So they cast it, and now they were not able to haul it in because of the large number of fish.",
      "links": "<a href='/AIV/42/5/6'>Luke 5:6</a>",
      "comment": "Similar miracle as at the beginning of their ministry (Luke 5:6), signifying abundance only accomplished by obedience to Christ."
    },
    {
      "pk": 1992107,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 7,
      "text": "Then that disciple whom Jesus loved said to Peter, 'It is the Lord!' When Simon Peter heard that it was the Lord, he put on his outer garment, for he had removed it, and threw himself into the sea.",
      "links": "<a href='/AIV/43/13/23'>John 13:23</a>; <a href='/AIV/40/14/29'>Matt. 14:29</a>",
      "comment": "'It is the Lord!': Recognition of Jesus ties to His unique authority. Note Peter’s eagerness as leader—he acts first, setting an example."
    },
    {
      "pk": 1992108,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 8,
      "text": "The other disciples came in the little boat, dragging the net full of fish, for they were not far from land, only about a hundred yards off.",
      "links": "",
      "comment": "The teamwork of the disciples in bringing the net full of fish illustrates Christian cooperation—a sign of many being brought into the Church."
    },
    {
      "pk": 1992109,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 9,
      "text": "When they got out on the land, they saw a charcoal fire in place, with fish laid out on it, and bread.",
      "links": "<a href='/AIV/43/18/18'>John 18:18</a>; <a href='/AIV/40/14/19'>Matt. 14:19</a>",
      "comment": "The charcoal fire recalls Peter’s denial (John 18:18) and hints at restoration. Bread and fish echo earlier miracles of Jesus feeding multitudes."
    },
    {
      "pk": 1992110,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 10,
      "text": "Jesus said to them, 'Bring some of the fish that you have just caught.'",
      "links": "",
      "comment": "Jesus calls the disciples to contribute to the meal, symbolizing participation in the divine mission—the Church's call to share in Christ's work."
    },
    {
      "pk": 1992111,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 11,
      "text": "So Simon Peter went aboard and hauled the net ashore, full of large fish, one hundred fifty-three of them. And although there were so many, the net was not torn.",
      "links": "<a href='/AIV/40/13/47-48'>Matt. 13:47-48</a>",
      "comment": "Peter’s initiative again shows his leadership. The unbroken net is often seen as a symbol of the unity and resilience of the Church."
    },
    {
      "pk": 1992112,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 12,
      "text": "Jesus said to them, 'Come and have breakfast.' None of the disciples dared to ask Him, 'Who are You?' They knew it was the Lord.",
      "links": "",
      "comment": "Jesus' invitation shows both His humility and real, resurrected body. The meal has Eucharistic overtones—a foretaste of the heavenly banquet."
    },
    {
      "pk": 1992113,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 13,
      "text": "Jesus came and took the bread and gave it to them, and so with the fish.",
      "links": "<a href='/AIV/43/6/11'>John 6:11</a>; <a href='/AIV/40/15/36'>Matt. 15:36</a>",
      "comment": "This recalls Jesus’ feeding miracles and alludes to the breaking of bread, which in Christian tradition is often seen as a sacramental act."
    },
    {
      "pk": 1992114,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 14,
      "text": "This was now the third time Jesus was revealed to the disciples after He was raised from the dead.",
      "links": "<a href='/AIV/43/20/19-26'>John 20:19-26</a>",
      "comment": "The third appearance confirms the reality of the Resurrection, a central Christian doctrine (see 1 Cor. 15:4)."
    },
    {
      "pk": 1992115,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 15,
      "text": "When they had finished breakfast, Jesus said to Simon Peter, 'Simon, son of John, do you love Me more than these?' He said to Him, 'Yes, Lord, You know that I love You.' He said to him, 'Feed My lambs.'",
      "links": "<a href='/AIV/40/16/18-19'>Matt. 16:18-19</a>; <a href='/AIV/42/22/32'>Luke 22:32</a>",
      "comment": "Jesus asks Peter three times, paralleling Peter’s three denials. 'Feed My lambs' is Christ’s commissioning of Peter as shepherd—a key moment for apostolic succession and leadership."
    },
    {
      "pk": 1992116,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 16,
      "text": "He said to him again a second time, 'Simon, son of John, do you love Me?' He said to Him, 'Yes, Lord; You know that I love You.' He said to him, 'Shepherd My sheep.'",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The language of shepherd in the Old Testament is used for God Himself (Ezek. 34:2; Ps. 23). Jesus entrusts His flock—His Church—to Peter."
    },
    {
      "pk": 1992117,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 17,
      "text": "He said to him the third time, 'Simon, son of John, do you love Me?' Peter was grieved because He said to him the third time, 'Do you love Me?' and he said to Him, 'Lord, You know everything; You know that I love You.' Jesus said to him, 'Feed My sheep.'",
      "links": "<a href='/AIV/43/13/38'>John 13:38</a>; <a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>",
      "comment": "'You know everything' is an acknowledgement of Jesus’ divine omniscience. The repeated commission confirms Peter’s primacy among the apostles."
    },
    {
      "pk": 1992118,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 18,
      "text": "Truly, truly, I say to you, when you were young, you used to dress yourself and walk wherever you wanted, but when you are old, you will stretch out your hands, and another will dress you and carry you where you do not want to go.",
      "links": "<a href='/AIV/43/13/36'>John 13:36</a>",
      "comment": "'Stretch out your hands' likely refers to Peter’s martyrdom by crucifixion, a prophecy of leadership through suffering, echoing Jesus’ own path."
    },
    {
      "pk": 1992119,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 19,
      "text": "He said this to show by what kind of death he was to glorify God. And after saying this He said to him, 'Follow Me.'",
      "links": "<a href='/AIV/43/13/37'>John 13:37</a>",
      "comment": "Peter’s death would glorify God, mirroring Christ’s. The call to follow Jesus is a call to discipleship, even to martyrdom."
    },
    {
      "pk": 1992120,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 20,
      "text": "Peter turned and saw the disciple whom Jesus loved following them, the one who also had leaned back against Him at the supper and had said, 'Lord, who is it that is going to betray You?'",
      "links": "<a href='/AIV/43/13/25'>John 13:25</a>",
      "comment": "The beloved disciple is traditionally understood as John, a unique eyewitness to Jesus’ ministry and Passion."
    },
    {
      "pk": 1992121,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 21,
      "text": "When Peter saw him, he said to Jesus, 'Lord, what about this man?'",
      "links": "",
      "comment": "Peter’s curiosity about John’s future contrasts with Christ's individual call to discipleship and vocation."
    },
    {
      "pk": 1992122,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 22,
      "text": "Jesus said to him, 'If it is My will that he remain until I come, what is that to you? You follow Me!'",
      "links": "<a href='/AIV/43/14/3'>John 14:3</a>",
      "comment": "Jesus places trust in His sovereign will. Disciples are called to fidelity in their own path, not jealousy or comparison."
    },
    {
      "pk": 1992123,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 23,
      "text": "So the saying spread among the brothers that this disciple was not to die; yet Jesus did not say to him that he was not to die, but, 'If it is My will that he remain until I come, what is that to you?'",
      "links": "",
      "comment": "John clarifies a misunderstanding among early Christians about his own death, showing the importance of careful listening to Christ’s actual words."
    },
    {
      "pk": 1992124,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 24,
      "text": "This is the disciple who is bearing witness about these things, and who has written these things, and we know that his testimony is true.",
      "links": "<a href='/AIV/43/19/35'>John 19:35</a>; <a href='/AIV/62/1/1-3'>1 John 1:1-3</a>",
      "comment": "John stresses his authority as an eyewitness. Apostolic witness lays the foundation for the Church’s doctrine and practice."
    },
    {
      "pk": 1992125,
      "translation": "AIV",
      "book": 43,
      "chapter": 21,
      "verse": 25,
      "text": "Now there are also many other things that Jesus did. If every one of them were written, I suppose that not even the world itself could contain the books that would be written.",
      "links": "<a href='/AIV/43/20/30-31'>John 20:30-31</a>",
      "comment": "The Gospel ends by stressing Jesus’ acts exceed what is written, suggesting the fullness of revelation is not exhausted by Scripture alone, but is lived out in the ongoing life of the Church."
    }
  ],
  "translatedAt": "2025-12-23T03:12:35.113Z"
}