{
  "book": "John",
  "bookAbbreviation": "John",
  "chapter": 16,
  "verses": [
    {
      "pk": 4671601,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 1,
      "text": "I have spoken these things to you so that you will not fall away.",
      "links": "<a href='/AIV/43/15/18'>John 15:18</a>; <a href='/AIV/40/24/10'>Matt. 24:10</a>",
      "comment": "Jesus is warning his disciples to prepare them for coming persecution. The phrase 'fall away' (Greek: skandalizo) means to stumble in faith."
    },
    {
      "pk": 4671602,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 2,
      "text": "They will put you out of the synagogues. In fact, a time is coming when anyone who kills you will think he is offering service to God.",
      "links": "<a href='/AIV/44/26/9-11'>Acts 26:9-11</a>; <a href='/AIV/43/9/22'>John 9:22</a>",
      "comment": "Jesus foretells both excommunication and martyrdom, showing the cost of discipleship. This was fulfilled in early Church history."
    },
    {
      "pk": 4671603,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 3,
      "text": "They will do these things because they have not known the Father or Me.",
      "links": "<a href='/AIV/43/8/19'>John 8:19</a>; <a href='/AIV/44/3/17'>Acts 3:17</a>",
      "comment": "Ignorance of God leads to persecution of His people, highlighting the unity between the Father and the Son."
    },
    {
      "pk": 4671604,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 4,
      "text": "But I have told you these things so that when their hour comes, you may remember that I told you. I did not say these things to you from the beginning, because I was with you.",
      "links": "<a href='/AIV/43/13/19'>John 13:19</a>; <a href='/AIV/43/14/29'>John 14:29</a>",
      "comment": "Jesus's foreknowledge affirms His divinity and strengthens the apostles for coming trials."
    },
    {
      "pk": 4671605,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 5,
      "text": "But now I am going to Him who sent Me, and none of you asks Me, 'Where are You going?'",
      "links": "<a href='/AIV/43/7/33'>John 7:33</a>; <a href='/AIV/43/13/36'>John 13:36</a>",
      "comment": "Jesus references His return to the Father, indicating His heavenly origin and mission."
    },
    {
      "pk": 4671606,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 6,
      "text": "But because I have said these things to you, sorrow has filled your hearts.",
      "links": "<a href='/AIV/43/14/1'>John 14:1</a>",
      "comment": "The disciples' sorrow foreshadows the pain and confusion at Jesus' Passion."
    },
    {
      "pk": 4671607,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 7,
      "text": "Nevertheless, I tell you the truth: it is to your advantage that I go away. For if I do not go away, the Advocate will not come to you; but if I go, I will send Him to you.",
      "links": "<a href='/AIV/43/14/16'>John 14:16</a>; <a href='/AIV/43/15/26'>John 15:26</a>",
      "comment": "The Advocate (Greek: Parakletos) is the Holy Spirit. Jesus links His departure with the sending of the Spirit, underlining the Spirit’s dependence on His authority."
    },
    {
      "pk": 4671608,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 8,
      "text": "And when He comes, He will convict the world concerning sin, and righteousness, and judgment:",
      "links": "<a href='/AIV/44/2/36-37'>Acts 2:36-37</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "The Spirit brings about conviction and understanding—preparing the world for repentance and faith."
    },
    {
      "pk": 4671609,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 9,
      "text": "concerning sin, because they do not believe in Me;",
      "links": "<a href='/AIV/43/3/18-19'>John 3:18-19</a>",
      "comment": "Sins ultimate form is unbelief in Jesus, underscoring His redemptive role."
    },
    {
      "pk": 4671610,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 10,
      "text": "concerning righteousness, because I am going to the Father and you will see Me no more;",
      "links": "<a href='/AIV/45/4/25'>Rom. 4:25</a>",
      "comment": "Jesus’s ascension proves His righteousness and vindication by the Father."
    },
    {
      "pk": 4671611,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 11,
      "text": "concerning judgment, because the ruler of this world is judged.",
      "links": "<a href='/AIV/43/12/31'>John 12:31</a>; <a href='/AIV/51/2/15'>Col. 2:15</a>",
      "comment": "Jesus declares victory over Satan, linking to His divine mission of defeating evil."
    },
    {
      "pk": 4671612,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 12,
      "text": "I still have many things to say to you, but you are not able to bear them now.",
      "links": "<a href='/AIV/43/14/26'>John 14:26</a>",
      "comment": "Jesus acknowledges progressive revelation—the fullness of truth is made known as the disciples are able to receive it."
    },
    {
      "pk": 4671613,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 13,
      "text": "But when He, the Spirit of truth, comes, He will guide you into all truth. For He will not speak on His own authority, but whatever He hears He will speak, and He will declare to you the things that are to come.",
      "links": "<a href='/AIV/43/14/26'>John 14:26</a>; <a href='/AIV/62/2/27'>1 John 2:27</a>",
      "comment": "The Spirit’s ongoing guidance supports both apostolic teaching and the continuity of truth in the Church."
    },
    {
      "pk": 4671614,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 14,
      "text": "He will glorify Me, for He will take what is Mine and declare it to you.",
      "links": "<a href='/AIV/43/17/10'>John 17:10</a>",
      "comment": "The Spirit’s work is entirely united to Christ—reflecting deep unity within the Trinity."
    },
    {
      "pk": 4671615,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 15,
      "text": "All that the Father has is Mine. Therefore I said that He will take what is Mine and declare it to you.",
      "links": "<a href='/AIV/43/3/35'>John 3:35</a>; <a href='/AIV/43/17/10'>John 17:10</a>",
      "comment": "Jesus states His total unity and equality with the Father—a high Christological claim."
    },
    {
      "pk": 4671616,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 16,
      "text": "A little while, and you will not see Me; and again a little while, and you will see Me.",
      "links": "<a href='/AIV/43/14/19'>John 14:19</a>; <a href='/AIV/42/24/15-16'>Luke 24:15-16</a>",
      "comment": "Jesus hints at His death and resurrection, where His presence is temporarily hidden, then restored."
    },
    {
      "pk": 4671617,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 17,
      "text": "Then some of His disciples said to one another, 'What is this He is telling us, ",
      "links": "<a href='/AIV/43/7/35-36'>John 7:35-36</a>",
      "comment": "The disciples struggle to understand Jesus’s statements, foreshadowing their gradual growth in wisdom."
    },
    {
      "pk": 4671618,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 18,
      "text": "So they were saying, 'What does He mean by ",
      "links": "",
      "comment": "Confusion among the disciples shows Jesus’s teachings often contained layers of meaning, accessible only by the Spirit’s light."
    },
    {
      "pk": 4671619,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 19,
      "text": "Jesus knew that they wanted to ask Him, so He said to them, 'Are you asking each other what I meant when I said, ",
      "links": "<a href='/AIV/41/9/32'>Mark 9:32</a>",
      "comment": "Jesus’ divine knowledge anticipates His disciples’ questions, underscoring His intimate care and full understanding."
    },
    {
      "pk": 4671620,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 20,
      "text": "Truly, truly, I say to you, you will weep and lament, but the world will rejoice. You will be sorrowful, but your sorrow will turn into joy.",
      "links": "<a href='/AIV/43/20/20'>John 20:20</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "A promise of transformation through suffering. The resurrection fulfills this prophecy."
    },
    {
      "pk": 4671621,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 21,
      "text": "When a woman is giving birth, she has sorrow because her hour has come. But when she has delivered the child, she no longer remembers the anguish, for joy that a human being has been born into the world.",
      "links": "<a href='/AIV/23/26/17'>Isa. 26:17</a>; <a href='/AIV/48/4/19'>Gal. 4:19</a>",
      "comment": "Jesus uses childbirth to illustrate suffering that gives way to new life—a theme relevant to redemption, sacraments, and hope."
    },
    {
      "pk": 4671622,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 22,
      "text": "So also you have sorrow now, but I will see you again and your hearts will rejoice, and no one will take your joy from you.",
      "links": "<a href='/AIV/43/20/20'>John 20:20</a>",
      "comment": "Points forward to the resurrected Christ—a lasting source of joy for believers."
    },
    {
      "pk": 4671623,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 23,
      "text": "In that day you will ask nothing of Me. Truly, truly, I say to you, whatever you ask of the Father in My name, He will give it to you.",
      "links": "<a href='/AIV/43/14/13-14'>John 14:13-14</a>",
      "comment": "Christ’s mediation offers direct access to the Father—fulfilled in the life of prayer and intercession."
    },
    {
      "pk": 4671624,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 24,
      "text": "Until now you have asked nothing in My name. Ask, and you will receive, so that your joy may be full.",
      "links": "<a href='/AIV/43/15/7'>John 15:7</a>",
      "comment": "Prayer in Jesus’s name is directly effective—the source of joy for the faithful."
    },
    {
      "pk": 4671625,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 25,
      "text": "I have spoken these things to you in figures of speech; but the hour is coming when I will no longer speak to you in figures, but will tell you plainly about the Father.",
      "links": "<a href='/AIV/41/4/34'>Mark 4:34</a>",
      "comment": "The transition from figurative to plain teaching comes with the Spirit’s outpouring, showing God’s gradual pedagogy."
    },
    {
      "pk": 4671626,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 26,
      "text": "In that day you will ask in My name, and I do not say to you that I will ask the Father on your behalf;",
      "links": "<a href='/AIV/54/2/5'>1 Tim. 2:5</a>",
      "comment": "The mediation of Christ enables believers to approach the Father with confidence."
    },
    {
      "pk": 4671627,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 27,
      "text": "for the Father Himself loves you, because you have loved Me and have believed that I came from God.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "Faith in Christ creates a unique relationship with God the Father."
    },
    {
      "pk": 4671628,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 28,
      "text": "I came from the Father and have come into the world; now I am leaving the world and going to the Father.",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/43/13/3'>John 13:3</a>",
      "comment": "Jesus affirms His incarnation and pre-existence, then His return—clear Christological doctrine."
    },
    {
      "pk": 4671629,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 29,
      "text": "His disciples said, 'See, now You are speaking plainly, and not using figurative speech!",
      "links": "",
      "comment": "The disciples begin to see the plain meaning, but full understanding will only come later."
    },
    {
      "pk": 4671630,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 30,
      "text": "Now we know that You know all things and do not need anyone to question You; by this we believe that You came from God.",
      "links": "<a href='/AIV/43/21/17'>John 21:17</a>; <a href='/AIV/43/6/69'>John 6:69</a>",
      "comment": "The disciples bear witness to Christ’s divine knowledge and origin."
    },
    {
      "pk": 4671631,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 31,
      "text": "Jesus answered them, 'Do you now believe?",
      "links": "<a href='/AIV/43/13/38'>John 13:38</a>",
      "comment": "Jesus questions the firmness of their faith, knowing it will be tested."
    },
    {
      "pk": 4671632,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 32,
      "text": "Behold, an hour is coming, and has come, when you will be scattered, each of you to his own home, and will leave Me alone. Yet I am not alone, for the Father is with Me.",
      "links": "<a href='/AIV/38/13/7'>Zech. 13:7</a>; <a href='/AIV/40/26/31'>Matt. 26:31</a>",
      "comment": "This fulfills Zechariah’s prophecy and shows Jesus’ union with the Father in His suffering."
    },
    {
      "pk": 4671633,
      "translation": "AIV",
      "book": 43,
      "chapter": 16,
      "verse": 33,
      "text": "I have told you these things, so that in Me you may have peace. In the world you will have trouble. But take heart; I have overcome the world.",
      "links": "<a href='/AIV/45/8/37'>Rom. 8:37</a>; <a href='/AIV/62/5/4-5'>1 John 5:4-5</a>",
      "comment": "Jesus completes this discourse declaring His victory over worldly evil, offering enduring peace to believers—a key promise for the Church throughout the centuries."
    }
  ],
  "translatedAt": "2025-12-23T03:09:45.373Z"
}