{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 13,
  "verses": [
    {
      "pk": 28013001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 1,
      "text": "Whoever touches pitch will be defiled, and whoever associates with the arrogant will become like them.",
      "links": "<a href='/AIV/20/6/27'>Prov. 6:27</a>; <a href='/AIV/46/15/33'>1 Cor. 15:33</a>",
      "comment": "The text uses the image of pitch (tar) to warn that contact with the proud and sinful leads easily to corruption. This serves as a reminder to remain vigilant about the company we keep, echoing similar wisdom in Proverbs and Paul’s warning to the Corinthians."
    },
    {
      "pk": 28013002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 2,
      "text": "Do not lift a burden too heavy for you, and do not associate with one who is mightier and richer than you.",
      "links": "<a href='/AIV/19/62/10'>Ps. 62:10</a>; <a href='/AIV/20/23/4'>Prov. 23:4</a>",
      "comment": "This practical advice can be spiritually applied – bearing burdens too great is analogous to taking on spiritual challenges outside one’s state of grace. The language promotes humility and discernment in relationships with those of wealth and power."
    },
    {
      "pk": 28013003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 3,
      "text": "How can the clay pot share with the iron pot? The clay pot will always be shattered.",
      "links": "<a href='/AIV/24/19/11'>Jer. 19:11</a>; <a href='/AIV/45/9/21'>Rom. 9:21</a>",
      "comment": "A metaphor showing the danger of unequal associations. The fragile is destroyed by the strong. Spiritually, this warns about influences that could destabilize faith or community harmony."
    },
    {
      "pk": 28013004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 4,
      "text": "If the rich man wrongs him, his friend will join in blaming him; he will heap abuse on him.",
      "links": "<a href='/AIV/20/14/20'>Prov. 14:20</a>; <a href='/AIV/59/2/6'>James 2:6</a>",
      "comment": "This verse demonstrates how power and wealth influence relationships, often at the expense of justice for the poor. James gives similar warnings in the New Testament, highlighting the perennial relevance of economic justice within the faith."
    },
    {
      "pk": 28013005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 5,
      "text": "If the rich man is kind, his friends are many; if he speaks, they justify his words.",
      "links": "<a href='/AIV/20/19/6'>Prov. 19:6</a>; <a href='/AIV/19/12/2'>Ps. 12:2</a>",
      "comment": "People often flatter the wealthy, regardless of the truth. As disciples of Christ, we are reminded to seek sincerity and integrity, avoiding partiality and hypocrisy."
    },
    {
      "pk": 28013006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 6,
      "text": "If he gives you anything, it is with strings attached; he will humble you with his banquets until he has drained you twice or three times.",
      "links": "<a href='/AIV/20/23/6-8'>Prov. 23:6-8</a>",
      "comment": "A warning to be cautious about accepting gifts from those with more power. This anticipates Christ’s teaching in Luke 14:12-14, which calls us to generosity without expecting repayment."
    },
    {
      "pk": 28013007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 7,
      "text": "While he says, 'Eat and drink,' his heart is not with you, and his words are false.",
      "links": "<a href='/AIV/20/23/7'>Prov. 23:7</a>; <a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "The duplicity described here recalls Jesus’ criticism of outward shows of righteousness that mask inner corruption (cf. Matt. 23:27). True Christian fellowship is marked by authentic charity."
    },
    {
      "pk": 28013008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 8,
      "text": "You will be the last to know his thoughts, and when he sees you, he will smile and test you.",
      "links": "",
      "comment": "The verse emphasizes prudence and discernment in relationships, a constant theme in biblical wisdom literature."
    },
    {
      "pk": 28013009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 9,
      "text": "He will humiliate you with his food, until he has stripped you completely dry two or three times. Then in the end he will laugh at you. Afterward, when he sees you, he will leave you.",
      "links": "",
      "comment": "A continuation of the warning: acceptance of lavish favors from the wealthy may lead to humiliation and abandonment. Jesus’ counsel on inviting the poor rather than the rich resonates here (Luke 14:13-14)."
    },
    {
      "pk": 28013010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 10,
      "text": "Guard yourself and be very careful, for you walk with your own downfall. If you hear these things, pay attention!",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "A call to vigilance in daily choices, reminiscent of Paul’s exhortation to ‘take heed’ lest one fall (1 Cor. 10:12)."
    },
    {
      "pk": 28013011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 11,
      "text": "When you hear these things, wake up from your sleep, and choose what is right for your life.",
      "links": "<a href='/AIV/49/5/14'>Eph. 5:14</a>",
      "comment": "An urgent appeal to spiritual wakefulness, much like Paul’s urging the Ephesians to rise from sleep, seeking the light of Christ."
    },
    {
      "pk": 28013012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 12,
      "text": "Give your love to the Lord with all your soul, and be content with those who are humble and wise.",
      "links": "<a href='/AIV/05/6/5'>Deut. 6:5</a>; <a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "This combines the greatest commandment and counsel to seek the company of the humble. True wisdom is rooted in love for God and humility—a spiritual path shared by the great saints."
    },
    {
      "pk": 28013013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 13,
      "text": "Be willing to listen when you are with the wise; all the talk of the arrogant is like thunder in a storm.",
      "links": "<a href='/AIV/20/9/9'>Prov. 9:9</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Humble listening to wisdom marks the path of salvation, while the arrogant’s speech is empty noise. Recall Christ’s teaching on the meek inheriting the earth (Matt. 5:5)."
    },
    {
      "pk": 28013014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 14,
      "text": "Their arguments are like burning fire; they can destroy, but the wise are careful and avoid their company.",
      "links": "<a href='/AIV/20/22/24-25'>Prov. 22:24-25</a>",
      "comment": "Associating with the quarrelsome can have destructive spiritual effects. The wise keep holy company and guard their hearts. This is a theme found throughout scriptural wisdom."
    },
    {
      "pk": 28013015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 15,
      "text": "Whoever fears the Lord will stay on the straight path, and those who love him will be faithful to his commandments.",
      "links": "<a href='/AIV/19/119/1'>Ps. 119:1</a>; <a href='/AIV/43/14/15'>John 14:15</a>",
      "comment": "This verse connects fearing God with obedience to His commands. Jesus echoes this, equating love with keeping His commandments (John 14:15), highlighting moral responsibility and fidelity."
    },
    {
      "pk": 28013016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 16,
      "text": "Every creature loves its own kind, and every man associates with those like himself.",
      "links": "<a href='/AIV/01/2/18'>Gen. 2:18</a>; <a href='/AIV/19/119/63'>Ps. 119:63</a>",
      "comment": "This introduces the theme of natural affinity between like persons. In spiritual matters, shared faith and practice unite the faithful as one body in Christ (cf. 1 Cor. 12:12)."
    },
    {
      "pk": 28013017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 17,
      "text": "What fellowship can a wolf have with a lamb? So too does the sinner with the godly.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/40/7/6'>Matt. 7:6</a>",
      "comment": "Using the imagery of a wolf and a lamb, the verse underscores the radical difference between the righteous and the sinner. Matthew 7:6 contains similar warnings about discernment."
    },
    {
      "pk": 28013018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 18,
      "text": "What peace can there be between the rich and the poor? Wild donkeys are prey for lions in the wilderness.",
      "links": "",
      "comment": "A recognition of the social realities that divide humanity, encouraging the faithful to look beyond worldly status and practice true charity and unity."
    },
    {
      "pk": 28013019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 19,
      "text": "Just as wild animals prey upon each other, so the wicked prey upon the righteous.",
      "links": "<a href='/AIV/19/37/12'>Ps. 37:12</a>",
      "comment": "This realistic description draws a line between two ways—good and evil. Psalm 37 uses similar language concerning the opposition faced by the righteous."
    },
    {
      "pk": 28013020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 20,
      "text": "The proud despise humility, and the rich hate being ruled by the poor.",
      "links": "<a href='/AIV/20/29/27'>Prov. 29:27</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "This highlights the clash between worldly pride and spiritual humility. The wisdom tradition praises humility (James 4:6), which is needed for true discipleship."
    },
    {
      "pk": 28013021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 21,
      "text": "When a rich man stumbles, many help him up; but if a humble person falls, others push him away.",
      "links": "<a href='/AIV/20/14/20'>Prov. 14:20</a>",
      "comment": "A cynical but truthful observation about human nature. The Church calls us to a higher standard: genuine love and concern for all, especially the lowly and poor."
    },
    {
      "pk": 28013022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 22,
      "text": "When the rich speak, all are silent, and their words are praised to the clouds; but if the poor speak, people say, 'Who is this?' And if the poor stumble, they will be tripped up even more.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>; <a href='/AIV/21/4/13'>Eccl. 4:13</a>",
      "comment": "The tendency to honor wealth and despise poverty is challenged in Christ's teachings, which upend social norms and elevate the value of every person (cf. Luke 6:20)."
    },
    {
      "pk": 28013023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 23,
      "text": "Riches are good if they are without sin, and poverty is evil in the opinion of the arrogant.",
      "links": "<a href='/AIV/20/10/22'>Prov. 10:22</a>; <a href='/AIV/20/30/8-9'>Prov. 30:8-9</a>",
      "comment": "Surface wealth is not condemned; its use matters. When riches are used virtuously, they are good. The love of money—not money itself—is the root of evil (1 Tim. 6:10)."
    },
    {
      "pk": 28013024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 24,
      "text": "The heart of a person changes their face, whether for good or for evil.",
      "links": "<a href='/AIV/40/6/22-23'>Matt. 6:22-23</a>",
      "comment": "Jesus teaches ‘the lamp of the body is the eye’—our hearts shape our countenance. Our inner disposition manifests outwardly, a core teaching for spiritual transformation."
    },
    {
      "pk": 28013025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 25,
      "text": "For one's heart reflects deep thought. A cheerful face is a sign of a good heart, but seeking advice is laborious to the wicked.",
      "links": "<a href='/AIV/20/15/13'>Prov. 15:13</a>",
      "comment": "The countenance reveals the heart—joy and wisdom shine outwardly. The wise seek counsel humbly, a virtue especially valued in the apostolic tradition."
    },
    {
      "pk": 28013026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 13,
      "verse": 26,
      "text": "A joyful heart brings health and life, but a gloomy spirit withers the bones.",
      "links": "<a href='/AIV/20/17/22'>Prov. 17:22</a>",
      "comment": "Inner joy, arising from trust in God, gives vitality—the theology of the body and soul united. The wise tradition and apostolic faith teach the importance of interior renewal and peace."
    }
  ],
  "translatedAt": "2025-12-24T07:29:52.030Z"
}