{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 47,
  "verses": [
    {
      "pk": 28047001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 1,
      "text": "After Nathan had spoken to David, the prophet arose in the days of David.",
      "links": "<a href='/AIV/27/12/1-15'>2 Samuel 12:1-15</a>; <a href='/AIV/19/51/1'>Psalm 51:1</a>",
      "comment": "Nathan’s role as a prophet in David’s life highlights the importance of spiritual guidance and correction, a theme central throughout Scripture. This points to the authority of leaders and prophets guiding kings, which continues as a pattern in the New Testament for apostolic leadership."
    },
    {
      "pk": 28047002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 2,
      "text": "As the fat is separated from the peace offering, so was David chosen from among the sons of Israel.",
      "links": "<a href='/AIV/9/16/1-13'>1 Samuel 16:1-13</a>; <a href='/AIV/9/13/14'>1 Samuel 13:14</a>",
      "comment": "David is set apart just as the sacred offering is chosen for God. This selection by divine appointment reflects the biblical principle of God choosing leaders for his people, which is echoed in the selection of the twelve apostles (see <a href='/AIV/41/3/13-19'>Mark 3:13-19</a>)."
    },
    {
      "pk": 28047003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 3,
      "text": "He played with lions as with young goats, and with bears as with lambs.",
      "links": "<a href='/AIV/9/17/34-36'>1 Samuel 17:34-36</a>",
      "comment": "David’s strength and courage are supernatural gifts, indicating divine providence at work. These actions foreshadow the spiritual strength believers receive to overcome evil (see <a href='/AIV/60/5/8-9'>1 Peter 5:8-9</a>)."
    },
    {
      "pk": 28047004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 4,
      "text": "Did he not kill a giant and take away the disgrace from the people, when he lifted his hand with a stone in the sling and knocked down the boasting Goliath?",
      "links": "<a href='/AIV/9/17/49-51'>1 Samuel 17:49-51</a>; <a href='/AIV/19/44/5-7'>Psalm 44:5-7</a>",
      "comment": "David’s defeat of Goliath is both a literal triumph and a symbol of faith overcoming pride and evil. This points forward to Christ’s victory over sin and death (see <a href='/AIV/46/15/54-57'>1 Corinthians 15:54-57</a>)."
    },
    {
      "pk": 28047005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 5,
      "text": "He called upon the Lord Most High, who gave strength to his right hand to slay the mighty warrior and lift up the power of his people.",
      "links": "<a href='/AIV/9/17/45-47'>1 Samuel 17:45-47</a>; <a href='/AIV/19/18/32-36'>Psalm 18:32-36</a>",
      "comment": "David’s reliance on prayer and God’s strength is emphasized. This highlights the necessity of dependence on divine grace for victory, a recurrent message in both Testaments."
    },
    {
      "pk": 28047006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 6,
      "text": "So they praised him for the ten thousands, and glorified him for the blessings of the Lord, by giving him a crown of glory.",
      "links": "<a href='/AIV/9/18/7'>1 Samuel 18:7</a>; <a href='/AIV/19/21/3'>Psalm 21:3</a>",
      "comment": "The praise David receives points to honor bestowed through divine favor. The imagery of the ‘crown’ has messianic undertones, suggesting the future kingship of the Messiah (see <a href='/AIV/40/27/29'>Matthew 27:29</a>—Jesus' crown of thorns prefigured in David's kingship)."
    },
    {
      "pk": 28047007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 7,
      "text": "For he destroyed the enemies on every side, and cut down the Philistines, his adversaries, and broke the horn of their power until this day.",
      "links": "<a href='/AIV/10/8/1'>2 Samuel 8:1</a>; <a href='/AIV/19/18/47'>Psalm 18:47</a>",
      "comment": "David’s victories over Israel’s enemies prefigure Christ’s conquest of spiritual foes. The ‘breaking of the horn’ echoes the messianic prophecy of God’s anointed overcoming all opposition (<a href='/AIV/19/132/17'>Psalm 132:17</a>)."
    },
    {
      "pk": 28047008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 8,
      "text": "In all his works he gave thanks to the Holy One, to the Most High, with songs of praise.",
      "links": "<a href='/AIV/19/34/1'>Psalm 34:1</a>; <a href='/AIV/19/103/1'>Psalm 103:1</a>",
      "comment": "David’s devotion is rooted in worship and thanksgiving, which manifests most fully in the tradition of singing hymns, psalms, and spiritual songs—the basis for the liturgical worship of the Church."
    },
    {
      "pk": 28047009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 9,
      "text": "With all his heart he loved and sang praises to his Maker, showing his affection every day.",
      "links": "<a href='/AIV/19/63/4'>Psalm 63:4</a>; <a href='/AIV/19/145/2'>Psalm 145:2</a>",
      "comment": "The daily praise signifies a spirituality grounded in constancy and love for God, hinting at the spiritual discipline seen in the prayer traditions observed by the earliest Christians."
    },
    {
      "pk": 28047010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 10,
      "text": "He established singers before the altar, and composed sweet melodies to be sung.",
      "links": "<a href='/AIV/13/16/4-7'>1 Chronicles 16:4-7</a>; <a href='/AIV/19/96/1'>Psalm 96:1</a>",
      "comment": "David established ordered liturgical worship with music and singing, foreshadowing Christian liturgical practices. The connection to the altar points to the importance of sacrifice and worship through appointed ministers."
    },
    {
      "pk": 28047011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 11,
      "text": "He gave beauty to the feasts and arranged the seasons for the celebration of solemn festivals, that praise might ring out from the sanctuary and resound as a sweet fragrance before the Most High.",
      "links": "<a href='/AIV/3/23/1-44'>Leviticus 23:1-44</a>; <a href='/AIV/19/141/2'>Psalm 141:2</a>",
      "comment": "David’s liturgical reforms and celebrations foreshadow the rhythm of feasts in Christian liturgy, emphasizing the sanctity of worship space and times, and the offering of spiritual sacrifices (‘sweet fragrance’)."
    },
    {
      "pk": 28047012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 12,
      "text": "The Lord took away his sins and exalted his strength forever; He gave him the covenant of kingship and a glorious throne in Israel.",
      "links": "<a href='/AIV/19/32/5'>Psalm 32:5</a>; <a href='/AIV/10/7/16'>2 Samuel 7:16</a>",
      "comment": "The forgiveness of David’s sins and establishment of his eternal kingship are a foretaste of Christ's royal priesthood and messianic covenant. Note the importance of repentance, confession, and restoration to grace (cf. <a href='/AIV/62/1/8-9'>1 John 1:8-9</a>)."
    },
    {
      "pk": 28047013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 13,
      "text": "A wise son succeeded him, who dwelt in security because of him;",
      "links": "<a href='/AIV/11/2/12'>1 Kings 2:12</a>",
      "comment": "Solomon’s succession follows from David’s righteousness. The dynastic line and its security are signs of fidelity and continuity in God's promises, mirrored in the unbroken transmission of spiritual authority in the early Church."
    },
    {
      "pk": 28047014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 14,
      "text": "Solomon reigned in days of peace, and God gave him rest on every side, that he might build a house for His Name and prepare an everlasting sanctuary.",
      "links": "<a href='/AIV/11/5/4'>1 Kings 5:4</a>; <a href='/AIV/19/132/13-14'>Psalm 132:13-14</a>",
      "comment": "The building of a temple by Solomon prefigures the establishment of Christ’s Church—a house for God's presence. The everlasting sanctuary points to the spiritual reality of the heavenly temple and the perpetual worship of God."
    },
    {
      "pk": 28047015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 15,
      "text": "How wise you became in your youth, and filled with understanding like a river!",
      "links": "<a href='/AIV/11/4/29-34'>1 Kings 4:29-34</a>",
      "comment": "The wisdom given to Solomon is a supernatural gift, reminiscent of the gifts of the Spirit, and calls to mind Christ as the true wisdom of God (<a href='/AIV/46/1/24'>1 Corinthians 1:24</a>)."
    },
    {
      "pk": 28047016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 16,
      "text": "Your soul covered the earth, and you filled it with parables and sayings.",
      "links": "<a href='/AIV/11/10/24'>1 Kings 10:24</a>; <a href='/AIV/40/13/34'>Matthew 13:34</a>",
      "comment": "Solomon’s universal wisdom points forward to Christ, whose parables and teachings spread to all nations. This connection highlights both the literal and spiritual sense of divine wisdom being made accessible to humanity."
    },
    {
      "pk": 28047017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 17,
      "text": "Your name reached to far-off islands, and you were loved for your peace.",
      "links": "<a href='/AIV/19/72/10'>Psalm 72:10</a>; <a href='/AIV/11/10/1'>1 Kings 10:1</a>",
      "comment": "Solomon’s far-reaching fame and peaceful reign point to the spread of the Gospel and the call for peace among all nations, a vision fulfilled in Christ's kingship and the world-wide mission of the Church."
    },
    {
      "pk": 28047018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 18,
      "text": "Because of your songs, proverbs, and parables, nations marveled at you.",
      "links": "<a href='/AIV/11/10/24'>1 Kings 10:24</a>; <a href='/AIV/19/45/1'>Psalm 45:1</a>",
      "comment": "Solomon's wisdom gathering the amazement of nations foreshadows the attraction of all peoples to the wisdom and truth offered by Christ through his teachings."
    },
    {
      "pk": 28047019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 19,
      "text": "You were led into error by women, and enslaved by your own body;",
      "links": "<a href='/AIV/11/11/1-4'>1 Kings 11:1-4</a>; <a href='/AIV/20/7/26-27'>Proverbs 7:26-27</a>",
      "comment": "Solomon's fall due to desire warns of the dangers of allowing passions and temptations to overcome wisdom, a call echoed in New Testament teachings of self-mastery and purity (<a href='/AIV/48/5/16-21'>Galatians 5:16-21</a>)."
    },
    {
      "pk": 28047020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 20,
      "text": "You stained your honor and defiled your offspring, so that wrath came upon your family, and your children suffered because of your folly.",
      "links": "<a href='/AIV/11/11/9-13'>1 Kings 11:9-13</a>; <a href='/AIV/19/106/35-40'>Psalm 106:35-40</a>",
      "comment": "This verse underscores the principle that sin has communal consequences. The judgment on Solomon’s line reflects biblical teachings on how leadership affects the spiritual welfare of the community."
    },
    {
      "pk": 28047021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 21,
      "text": "Thus the kingdom was divided, and a rebel nation arose from Ephraim.",
      "links": "<a href='/AIV/11/12/20'>1 Kings 12:20</a>; <a href='/AIV/13/10/14'>1 Chronicles 10:14</a>",
      "comment": "The division of the kingdom is a direct result of unfaithfulness, serving as a historical lesson of the need for unity within God’s people, a theme Jesus prayed for in John 17:21."
    },
    {
      "pk": 28047022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 22,
      "text": "But God will not forsake his mercy, nor abort any of his works; he will not wipe out the descendants of his chosen one, nor uproot the offspring of him who loved him.",
      "links": "<a href='/AIV/19/89/33-37'>Psalm 89:33-37</a>; <a href='/AIV/45/11/29'>Romans 11:29</a>",
      "comment": "God’s fidelity and mercy to David’s line are emphasized, pointing to the unbreakable promises that find their ultimate fulfillment in Christ. This foreshadows the Church’s indefectibility and God’s faithfulness despite human failure."
    },
    {
      "pk": 28047023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 23,
      "text": "So he gave a remnant to Jacob, and a root to David from that lineage.",
      "links": "<a href='/AIV/23/11/1'>Isaiah 11:1</a>; <a href='/AIV/40/1/1'>Matthew 1:1</a>",
      "comment": "The preservation of a ‘remnant’ and a ‘root’ from David’s family is directly fulfilled in Jesus, the descendant of David and true Shepherd of God’s people."
    },
    {
      "pk": 28047024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 24,
      "text": "So Solomon rested with his ancestors, leaving behind another from his own lineage, greatest among his people.",
      "links": "<a href='/AIV/11/11/43'>1 Kings 11:43</a>; <a href='/AIV/11/12/1'>1 Kings 12:1</a>",
      "comment": "The continuity of the Davidic line, even through imperfect successors, points to the sovereign plan of God ensuring spiritual leadership remains through apostolic succession."
    },
    {
      "pk": 28047025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 47,
      "verse": 25,
      "text": "He did not abandon the mercy promised; nor let any part of his word fail; he preserved a remnant and blessed it, so that his glory might be made known.",
      "links": "<a href='/AIV/19/105/8'>Psalm 105:8</a>; <a href='/AIV/45/9/27'>Romans 9:27</a>",
      "comment": "God’s promises are perpetually fulfilled despite human weakness, so that his glory may be seen. This emphasizes the reliability of God’s covenant, ultimately manifested in the eternal inheritance of the faithful."
    }
  ],
  "translatedAt": "2025-12-24T07:48:55.481Z"
}