{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 31,
  "verses": [
    {
      "pk": 28031001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 1,
      "text": "Worry about wealth makes a man lose sleep; anxiety about it deprives him of rest.",
      "links": "<a href='/AIV/20/23/4'>Prov. 23:4</a>; <a href='/AIV/19/127/2'>Ps. 127:2</a>",
      "comment": "This verse emphasizes the heavy burden that the pursuit of wealth can bring. Solomon often warns against the anxiety of riches (see Proverbs), reminding us to trust God for our daily needs."
    },
    {
      "pk": 28031002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 2,
      "text": "Wakeful distress interrupts one's sleep; serious illness chases away rest.",
      "links": "<a href='/AIV/21/5/12'>Eccl. 5:12</a>",
      "comment": "The text draws a parallel between physical worries over wealth and physical suffering, both of which spoil true peace. Christ offers inner rest (Matthew 11:28-29)."
    },
    {
      "pk": 28031003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 3,
      "text": "A rich man works to gather a fortune, and if he rests, he is filled with luxuries.",
      "links": "<a href='/AIV/20/10/15'>Prov. 10:15</a>",
      "comment": "Material wealth brings earthly comforts, but also spiritual challenges (Luke 16:19-31, the rich man and Lazarus). The text subtly invites readers to consider what is truly lasting."
    },
    {
      "pk": 28031004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 4,
      "text": "A poor man works for a meager living, and if he rests, he falls deeper into poverty.",
      "links": "<a href='/AIV/20/13/23'>Prov. 13:23</a>",
      "comment": "Poverty, like wealth, has its dangers. While riches can draw us away from God, poverty can tempt to despair. Scripture upholds both diligence and trust in God's providence."
    },
    {
      "pk": 28031005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 5,
      "text": "Whoever loves gold will not be justified, and he who pursues profit will be led astray by it.",
      "links": "<a href='/AIV/54/6/10'>1 Tim. 6:10</a>",
      "comment": "The love of money leads away from righteousness (see 1 Timothy 6). Notice the connection here between ‘justification’ and one’s attachment to worldly possessions."
    },
    {
      "pk": 28031006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 6,
      "text": "Many have been ruined because of gold, and misfortune has come to those who desired it.",
      "links": "<a href='/AIV/20/11/28'>Prov. 11:28</a>",
      "comment": "A reminder from wisdom literature: riches are fleeting and often lead to ruin (compare Judas in Matthew 27:3-5, who chose money over Christ)."
    },
    {
      "pk": 28031007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 7,
      "text": "It is a stumbling block to those who sacrifice to it and to all who are possessed by it.",
      "links": "<a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "Idolatry is not only about carved images but can be about anything we serve above God—especially money. Idolatry was always condemned in Israel as spiritual adultery (cf. Hosea)."
    },
    {
      "pk": 28031008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 8,
      "text": "Blessed is the rich person who is found without fault, who does not pursue gold with greed.",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "True blessedness is possible even for the wealthy, if they resist greed and remain upright. Recall Jesus’ teaching about the ‘poor in spirit’ finding the kingdom of heaven."
    },
    {
      "pk": 28031009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 9,
      "text": "Who is he? We will praise him, for he has done wonderful things among his people.",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>",
      "comment": "When a wealthy person is also generous and upright, he is worthy of praise. Scriptural wisdom holds up these rare examples as models (see Job; see Acts 4:36-37, where Barnabas gives much)."
    },
    {
      "pk": 28031010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 10,
      "text": "Who has been tried by it and found perfect? He shall have glory forever. He could have taken advantage, but did not, and could have seized, but did not.",
      "links": "<a href='/AIV/59/1/12'>Jas. 1:12</a>",
      "comment": "Endurance in resisting temptation leads to lasting glory. Compare the reward promised to those who endure in James 1:12. This has deeper echoes of ‘perfection’ as the end of Christian life (cf. Matt. 5:48)."
    },
    {
      "pk": 28031011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 11,
      "text": "So his possessions will be established, and the assembly will declare his good deeds.",
      "links": "<a href='/AIV/20/22/1'>Prov. 22:1</a>",
      "comment": "A good reputation in the community (or assembly—an early term for the people of God) endures longer than material wealth. Note the importance of public witness and testimony (cf. Matthew 5:16)."
    },
    {
      "pk": 28031012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 12,
      "text": "Are you seated at a lavish table? Do not reach out first, nor be greedy with what is placed before you.",
      "links": "<a href='/AIV/20/23/1-2'>Prov. 23:1-2</a>",
      "comment": "This verse offers practical wisdom about moderation, guarding against gluttony and greed. Such virtue is echoed in Paul’s teachings on self-control (Gal. 5:23)."
    },
    {
      "pk": 28031013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 13,
      "text": "Think of your neighbor’s needs and be considerate of them, just as you would want yourself to be thought of.",
      "links": "<a href='/AIV/40/7/12'>Matt. 7:12</a>",
      "comment": "A command to charity and empathy, the Golden Rule in action. Acts of charity anticipate Christ’s teachings on love of neighbor (Luke 10:27)."
    },
    {
      "pk": 28031014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 14,
      "text": "Be disciplined at the table, and do not be greedy with food, so that you may not be despised.",
      "links": "<a href='/AIV/50/4/5'>Phil. 4:5</a>",
      "comment": "Moderation is honored in all aspects of life—a theme that Paul picks up in his encouragement to let reasonableness be known to all. Discipline in small things builds spiritual strength for greater things."
    },
    {
      "pk": 28031015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 15,
      "text": "If you are among many guests, do not stretch out your hand before them.",
      "links": "<a href='/AIV/42/14/10'>Luke 14:10</a>",
      "comment": "Humility when in company prepares the heart for exaltation by God himself. (See Jesus’ teaching on seeking the lowest place, Luke 14)."
    },
    {
      "pk": 28031016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 16,
      "text": "How little is enough for a disciplined man! He does not breathe heavily over his bed.",
      "links": "<a href='/AIV/20/15/16'>Prov. 15:16</a>",
      "comment": "A self-controlled person is content and avoids gluttony and its discomforts. Elsewhere in Scripture, discipline is praised as a fruit of the Spirit (Gal. 5:23)."
    },
    {
      "pk": 28031017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 17,
      "text": "Healthy sleep depends on moderate eating; he who rises early feels refreshed.",
      "links": "<a href='/AIV/19/127/2'>Ps. 127:2</a>",
      "comment": "Another practical wisdom note: Temperance even has physical rewards. God’s design brings peace when we live according to virtue."
    },
    {
      "pk": 28031018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 18,
      "text": "The pain of gluttony, bitterness and sleeplessness, comes from too much eating.",
      "links": "<a href='/AIV/20/23/20-21'>Prov. 23:20-21</a>",
      "comment": "Indulgence always has consequences. Even in the Old Testament, overindulgence is closely linked to spiritual and physical ruin."
    },
    {
      "pk": 28031019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 19,
      "text": "If you are compelled to eat, get up, go off, and you will have relief.",
      "links": "<a href='/AIV/20/25/16'>Prov. 25:16</a>",
      "comment": "Moderation is a safeguard, even when it comes to the necessities of life. This has echoes in ascetic advice in the later Christian tradition."
    },
    {
      "pk": 28031020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 20,
      "text": "Listen to me, my child, and do not ignore me, for in the end you will see my words are true. Through restraint you will have a long life.",
      "links": "<a href='/AIV/20/3/1-2'>Prov. 3:1-2</a>",
      "comment": "Obedience to wise teaching brings life and health (a common theme in Proverbs). Also, the parental address (‘my child’) foreshadows the relationship between spiritual fathers and children in the Church."
    },
    {
      "pk": 28031021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 21,
      "text": "As for the reckless, their life is shortened by constant anger and impatience.",
      "links": "<a href='/AIV/20/14/29'>Prov. 14:29</a>",
      "comment": "A connecting thread: uncontrolled passions erode earthly life and spiritual well-being. This calls believers not only to moral, but ascetic self-mastery."
    },
    {
      "pk": 28031022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 22,
      "text": "Distress and trouble bring death; envy and anger shorten life.",
      "links": "<a href='/AIV/20/14/30'>Prov. 14:30</a>",
      "comment": "Spiritual health impacts the body. The ancient tradition always saw deep unity between soul and body—a reality highlighted in the incarnation (see John 1:14)."
    },
    {
      "pk": 28031023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 23,
      "text": "A cheerful person enjoys life, while one who hoards wealth cannot even enjoy their food.",
      "links": "<a href='/AIV/21/2/24'>Eccl. 2:24</a>",
      "comment": "Joy is tied not to possessions, but to uprightness and generosity of spirit. This wisdom anticipates Jesus’ words, ‘It is more blessed to give than to receive’ (Acts 20:35)."
    },
    {
      "pk": 28031024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 24,
      "text": "If you maintain self-control at the table, you will not fall into sin.",
      "links": "<a href='/AIV/46/9/27'>1 Cor. 9:27</a>",
      "comment": "Self-mastery over one’s appetites extends to all areas of spiritual life. Disciplined living helps avoid occasions of sin (see Paul’s own practice in 1 Corinthians 9:27)."
    },
    {
      "pk": 28031025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 25,
      "text": "It is by moderation in eating that one increases in wisdom; thus even in sleep you will be at ease.",
      "links": "<a href='/AIV/20/3/21-24'>Prov. 3:21-24</a>",
      "comment": "Moderation is foundational for wisdom and peace—a truth that shows deep links between daily habits and spiritual growth."
    },
    {
      "pk": 28031026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 26,
      "text": "A healthy stomach can consume anything, but if it eats too much, it gets sick.",
      "links": "<a href='/AIV/20/25/27'>Prov. 25:27</a>",
      "comment": "A light-hearted yet wise reminder: even good things should be used rightly. The Fathers often saw in this moderation a path toward spiritual discipline."
    },
    {
      "pk": 28031027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 27,
      "text": "Wine is like life to a person, if it is drunk moderately; what is life to one without wine?",
      "links": "<a href='/AIV/19/104/14-15'>Ps. 104:14-15</a>; <a href='/AIV/54/5/23'>1 Tim. 5:23</a>",
      "comment": "Wine is praised, not condemned, but only if used with moderation. The celebration of wine in Psalm 104 is balanced by warnings elsewhere (e.g., Proverbs 20:1). Wine also foreshadows the New Covenant in Christ’s blood (Matt. 26:27-28)."
    },
    {
      "pk": 28031028,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 28,
      "text": "Wine, drunk in moderation, brings gladness and pleasure of heart.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>",
      "comment": "God gives creation for joy, not for abuse. Spiritually, joy is also a fruit of the Spirit (Gal. 5:22), and this earthly joy points to the ultimate joy of the Kingdom."
    },
    {
      "pk": 28031029,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 29,
      "text": "If drunk to excess, wine brings bitterness of spirit, conflict, and loss of self-control.",
      "links": "<a href='/AIV/20/23/29-30'>Prov. 23:29-30</a>",
      "comment": "Excess of any kind becomes destructive. Biblical wisdom never promotes asceticism for its own sake, but always for the goal of holier life."
    },
    {
      "pk": 28031030,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 30,
      "text": "Drunkenness leads to strife, anger, and many slips; it diminishes strength and causes wounds.",
      "links": "<a href='/AIV/20/23/31-32'>Prov. 23:31-32</a>",
      "comment": "Here drunkenness is depicted as not only foolish but physically and relationally harmful—a moral, not just practical warning."
    },
    {
      "pk": 28031031,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 31,
      "verse": 31,
      "text": "Do not rebuke your neighbor at a feast of wine, nor despise him in his merriment. Do not speak a word of insult to him, and do not distress him by demanding repayment of a debt.",
      "links": "<a href='/AIV/40/5/23-24'>Matt. 5:23-24</a>",
      "comment": "Peace and goodwill, especially at times of celebration, are always preferable to conflict. This wisdom harmonizes with Jesus’ teaching to seek reconciliation before bringing an offering to God (see Matthew 5)."
    }
  ],
  "translatedAt": "2025-12-24T07:39:44.417Z"
}