{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 46,
  "verses": [
    {
      "pk": 28046001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 1,
      "text": "Joshua son of Nun was a mighty warrior, the successor of Moses in prophecy, who became, as his name suggests, a great savior for God's chosen people, striking down the enemies who attacked Israel, so that Israel might receive its inheritance.",
      "links": "<a href='/AIV/6/1/1-9'>Josh. 1:1-9</a>; <a href='/AIV/4/27/18-23'>Num. 27:18-23</a>",
      "comment": "Joshua 'Savior' reflects the Hebrew name Yeshua, sharing roots with the name of Jesus. Joshua's leadership foreshadows Jesus, who leads God's people into the true inheritance. (See Hebrews 4:8-9.)"
    },
    {
      "pk": 28046002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 2,
      "text": "How glorious he was when he lifted his hands and stretched out his sword against cities!",
      "links": "<a href='/AIV/6/6/2-5'>Josh. 6:2-5</a>",
      "comment": "Joshua’s victory at Jericho is a sign of God’s power working through human cooperation—symbolizing the need for faith and obedience in spiritual warfare."
    },
    {
      "pk": 28046003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 3,
      "text": "Who before him ever stood so firm? For the Lord himself brought forth mighty deeds by his hand.",
      "links": "<a href='/AIV/6/10/12-14'>Josh. 10:12-14</a>",
      "comment": "God gives victory through chosen leaders, demonstrating the importance of divinely established authority in guiding His people."
    },
    {
      "pk": 28046004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 4,
      "text": "Was not the sun held back by him, and one day made like two?",
      "links": "<a href='/AIV/6/10/12-14'>Josh. 10:12-14</a>",
      "comment": "God performs miracles in response to faith and prayer through His appointed leaders. Joshua’s command of nature prefigures Christ’s authority over creation (see Mark 4:39)."
    },
    {
      "pk": 28046005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 5,
      "text": "He called upon the Most High, the Mighty One, when enemies pressed around; the Lord listened to him in hailstones of mighty power.",
      "links": "<a href='/AIV/6/10/11'>Josh. 10:11</a>; <a href='/AIV/19/18/13-14'>Ps. 18:13-14</a>",
      "comment": "God’s active response to the prayers of His faithful ones encourages confidence in intercessory prayer."
    },
    {
      "pk": 28046006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 6,
      "text": "He rushed down on the hostile nation and destroyed the adversaries at the slope, so that the nations would know his weapons and his valor: that he fought in the sight of the Lord.",
      "links": "<a href='/AIV/6/10/10-11'>Josh. 10:10-11</a>",
      "comment": "Joshua’s bold leadership demonstrates human cooperation with divine grace—a theme echoed in the call to fight the good fight in Christ (1 Tim. 6:12)."
    },
    {
      "pk": 28046007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 7,
      "text": "For he remained loyal to the Mighty One in the time of Moses, he and Caleb son of Jephunneh: they opposed the assembly, calmed the people, and stopped the murmuring, and prevented sin.",
      "links": "<a href='/AIV/4/14/6-10'>Num. 14:6-10</a>",
      "comment": "Faithfulness amid popular opposition is praiseworthy; Caleb’s and Joshua’s obedience leads to blessing, showing the importance of standing with divinely appointed leaders."
    },
    {
      "pk": 28046008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 8,
      "text": "Out of six hundred thousand soldiers, only they, along with two others, were preserved to lead the people into their inheritance, into a land flowing with milk and honey.",
      "links": "<a href='/AIV/4/26/65'>Num. 26:65</a>; <a href='/AIV/2/3/8'>Exod. 3:8</a>",
      "comment": "God’s promise is fulfilled through those who persevere in faith, echoing Christ’s words on the narrow way leading to life (Matt. 7:14)."
    },
    {
      "pk": 28046009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 9,
      "text": "And the Lord gave Caleb strength, which remained even in his old age, that he went up to the highlands and the land was given to him and to his descendants as a heritage:",
      "links": "<a href='/AIV/6/14/6-14'>Josh. 14:6-14</a>",
      "comment": "Perseverance in faith, even into old age, is rewarded by God. Caleb serves as an example of steadfastness and the importance of lasting inheritance."
    },
    {
      "pk": 28046010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 10,
      "text": "so that all the children of Israel might see that it is good to be faithful to the Lord.",
      "links": "<a href='/AIV/6/14/14'>Josh. 14:14</a>",
      "comment": "This verse sums up the previous point, stressing the visible rewards and witness of unwavering faithfulness to God over generations."
    },
    {
      "pk": 28046011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 11,
      "text": "The judges, each one of them by name, whose hearts did not go astray and who did not turn away from the Lord—may their memory be blessed!",
      "links": "<a href='/AIV/7/2/16-19'>Judg. 2:16-19</a>",
      "comment": "This verse praises the leaders who remained true, highlighting the importance of leaders faithful to divine revelation and tradition."
    },
    {
      "pk": 28046012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 12,
      "text": "Their bones flourish again from their resting places, and their names will live on for all generations.",
      "links": "<a href='/AIV/19/112/6'>Ps. 112:6</a>; <a href='/AIV/19/34/16'>Ps. 34:16</a>",
      "comment": "An allusion to the hope of resurrection and enduring honor, this verse subtly points to the reward of the righteous even after death."
    },
    {
      "pk": 28046013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 13,
      "text": "Samuel, beloved of his Lord, prophet of the Lord, established the Kingdom and anointed rulers over his people.",
      "links": "<a href='/AIV/9/3/19-21'>1 Sam. 3:19-21</a>; <a href='/AIV/9/10/1'>1 Sam. 10:1</a>",
      "comment": "Here, Samuel’s role as a prophet and intermediary parallels the ongoing need for authoritative spiritual leadership rooted in prayer and divine calling."
    },
    {
      "pk": 28046014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 14,
      "text": "By the law of the Lord he judged the congregation, and the Lord watched over Jacob.",
      "links": "<a href='/AIV/9/7/15-17'>1 Sam. 7:15-17</a>",
      "comment": "Samuel’s judgment was rooted in God’s law, underscoring both the centrality of divine law and the need for a visible, faithful leadership in God’s people."
    },
    {
      "pk": 28046015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 15,
      "text": "He was proven trustworthy by his faithfulness, and was known as a prophet because of his words:",
      "links": "<a href='/AIV/9/3/19-20'>1 Sam. 3:19-20</a>",
      "comment": "Samuel’s integrity and fulfillment of prophecy establish his reputation, highlighting the close relationship between faithfulness and true prophecy."
    },
    {
      "pk": 28046016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 16,
      "text": "He called upon the Mighty Lord when enemies pressed him on every side, and he offered a young lamb, which was accepted as a whole burnt offering.",
      "links": "<a href='/AIV/9/7/7-10'>1 Sam. 7:7-10</a>",
      "comment": "Samuel’s priestly offering foreshadows Christ’s perfect sacrifice, the ‘Lamb of God.’ This is both a literal event and a spiritual type pointing to the New Covenant."
    },
    {
      "pk": 28046017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 17,
      "text": "Then the Lord thundered from heaven and made his voice heard with a great sound, and he utterly destroyed the leaders of the Philistines.",
      "links": "<a href='/AIV/9/7/10'>1 Sam. 7:10</a>; <a href='/AIV/19/18/13'>Ps. 18:13</a>",
      "comment": "God’s direct intervention through His priest-prophet stresses the importance of worship, sacrifice, and divine mediation for victory."
    },
    {
      "pk": 28046018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 18,
      "text": "He remembered his people in intercession, held back disaster, and silenced the storm by presenting the testimony of his innocence.",
      "links": "<a href='/AIV/9/12/17-25'>1 Sam. 12:17-25</a>",
      "comment": "Samuel’s intercession averts disaster, highlighting the effectiveness of the prayers of the righteous—anticipating the continuing role of intercessory prayer in the saints."
    },
    {
      "pk": 28046019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 19,
      "text": "He was declared faithful before all, for he was found trustworthy in vision and was heard in his prayers.",
      "links": "<a href='/AIV/9/3/19-21'>1 Sam. 3:19-21</a>",
      "comment": "Divinely chosen leaders are recognizable by their faithfulness and the fruitfulness of their prayers—a key sign of spiritual authority and mediation."
    },
    {
      "pk": 28046020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 46,
      "verse": 20,
      "text": "After he fell asleep, he prophesied and revealed to the king his death, raised up his voice out of the earth in prophecy, to blot out the wickedness of the people.",
      "links": "<a href='/AIV/9/28/11-19'>1 Sam. 28:11-19</a>",
      "comment": "Samuel’s prophetic authority continues even after his death, foreshadowing the ongoing spiritual influence of holy men and the communion of saints, as the prayers of the righteous endure even beyond the grave (see Rev. 6:9-10)."
    }
  ],
  "translatedAt": "2025-12-24T07:48:28.179Z"
}