{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 23,
  "verses": [
    {
      "pk": 28023001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 1,
      "text": "O Lord, Father and Master of my life, do not leave me to the plans of my tongue, nor let me fall because of it.",
      "links": "<a href='/AIV/19/39/1'>Ps. 39:1</a>; <a href='/AIV/59/3/2-10'>Jas. 3:2-10</a>",
      "comment": "Sirach’s prayer directly acknowledges God’s authority over one’s life and speech, echoing the emphasis in James 3 on the dangers of the tongue. The invocation of ‘Father’ already points toward the relationship emphasized in Jesus’ teaching (cf. Matt. 6:9)."
    },
    {
      "pk": 28023002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 2,
      "text": "Who will place discipline upon my thoughts, and wisdom upon my heart, so that my faults may not be multiplied, and my sins may not abound?",
      "links": "<a href='/AIV/19/51/6'>Ps. 51:6</a>; <a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "The prayer for inner discipline and wisdom draws on the Old Testament wisdom tradition, emphasizing our need for Divine help to guard both thoughts and heart. This anticipates the deeper internal sanctification taught in the New Testament (cf. Rom. 12:2)."
    },
    {
      "pk": 28023003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 3,
      "text": "Lest my enemies delight over me, and my faults become exposed before them, and I am brought to shame because of my failings.",
      "links": "<a href='/AIV/19/25/2'>Ps. 25:2</a>",
      "comment": "Shame before enemies is a recurring theme; Sirach recognizes the social and spiritual consequences of sin. In Christ, shame is transformed by redemption and restoration (cf. Heb. 12:2)."
    },
    {
      "pk": 28023004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 4,
      "text": "O Lord, Father and God of my life, do not give me arrogant eyes,",
      "links": "<a href='/AIV/20/6/16-17'>Prov. 6:16-17</a>; <a href='/AIV/19/131/1'>Ps. 131:1</a>",
      "comment": "Humility is presented as a virtue, with the prayer asking for protection from pride, similar to what is found throughout Proverbs and the Psalms (see especially Luke 18:13-14 for Christ’s teaching on humility)."
    },
    {
      "pk": 28023005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 5,
      "text": "and turn away desire from me.",
      "links": "<a href='/AIV/40/5/28'>Matt. 5:28</a>; <a href='/AIV/19/119/37'>Ps. 119:37</a>",
      "comment": "The struggle against unhealthy desires is echoed by Christ’s deeper interpretation of the law in Matthew 5. Sirach foreshadows the New Testament understanding of purity not merely as external but of the heart."
    },
    {
      "pk": 28023006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 6,
      "text": "Do not let gluttony or lust grip me, and do not deliver me up to shameful passion.",
      "links": "<a href='/AIV/45/1/24-27'>Rom. 1:24-27</a>; <a href='/AIV/48/5/24'>Gal. 5:24</a>",
      "comment": "Sirach’s condemnation of gluttony and lust points to a holistic moral ethic. Paul reiterates this by asserting the need to crucify sinful passions. Such discipline aligns with spiritual growth."
    },
    {
      "pk": 28023007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 7,
      "text": "Listen, my children, to instruction regarding speech; those who keep it will never be caught in their words.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>; <a href='/AIV/59/1/26'>Jas. 1:26</a>",
      "comment": "The connection between wisdom and careful speech recurs in the wisdom writings and is strongly affirmed by James. This emphasizes the need for practical holiness."
    },
    {
      "pk": 28023008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 8,
      "text": "The sinner is caught by his own lips; both the abusive and arrogant are condemned by them.",
      "links": "<a href='/AIV/20/13/3'>Prov. 13:3</a>",
      "comment": "Words reveal the heart; sinful speech ultimately ensnares the one who speaks it. In line with Jesus, who teaches that what comes out of the mouth proceeds from the heart (cf. Matt. 12:34)."
    },
    {
      "pk": 28023009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 9,
      "text": "Do not become accustomed to swearing oaths, nor use the Name of the Most High casually.",
      "links": "<a href='/AIV/40/5/34-37'>Matt. 5:34-37</a>; <a href='/AIV/2/20/7'>Ex. 20:7</a>",
      "comment": "The caution against frequent oaths connects with the commandment against misusing God’s Name and Christ’s instruction to let your ‘yes’ be ‘yes.’ The sacredness of God’s Name is universally emphasized."
    },
    {
      "pk": 28023010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 10,
      "text": "For just as a servant questioned repeatedly will not be without bruises, so the one who swears and names continually will not avoid sin.",
      "links": "<a href='/AIV/20/29/19'>Prov. 29:19</a>; <a href='/AIV/40/12/36'>Matt. 12:36</a>",
      "comment": "The repetition of careless speech leads to inevitable fault; Christ’s teaching about giving an account for every idle word finds its basis in this wisdom tradition."
    },
    {
      "pk": 28023011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 11,
      "text": "If he swears in vain, his house will be filled with disaster; his family will suffer, and he will not find rest.",
      "links": "<a href='/AIV/20/3/33'>Prov. 3:33</a>",
      "comment": "The impact of sin ripples outward, affecting the sinner’s household; wisdom literature consistently links personal virtue or its neglect with family blessing or curse."
    },
    {
      "pk": 28023012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 12,
      "text": "If he stumbles, his fault is upon him, and if he disregards it, he sins doubly; if he swears needlessly, he will not be justified, and his house will be filled with calamities.",
      "links": "<a href='/AIV/20/11/5'>Prov. 11:5</a>; <a href='/AIV/59/2/10'>Jas. 2:10</a>",
      "comment": "Neglecting the seriousness of sin amplifies its consequences; justification is linked to careful observance of moral law. The phrase ‘will not be justified’ resonates with both Old and New Testament teaching."
    },
    {
      "pk": 28023013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 13,
      "text": "There is an utterance compared to death; may it never be found among the inheritance of Jacob.",
      "links": "<a href='/AIV/20/18/21'>Prov. 18:21</a>; <a href='/AIV/19/34/12-13'>Ps. 34:12-13</a>",
      "comment": "Destructive speech equated with death indicates the power of words over life itself, anticipating Jesus’ warning about inner murder by hatred (Matt. 5:21-22)."
    },
    {
      "pk": 28023014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 14,
      "text": "The devout avoid all such things and are not entangled in sinful speech.",
      "links": "<a href='/AIV/19/141/3'>Ps. 141:3</a>; <a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Devout living is marked by careful speech; silence can be holy. A discipline cultivated among those desiring closer union with God."
    },
    {
      "pk": 28023015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 15,
      "text": "Do not accustom your mouth to low and vulgar talk, for in it lies the word of sin.",
      "links": "<a href='/AIV/49/5/4'>Eph. 5:4</a>; <a href='/AIV/51/3/8'>Col. 3:8</a>",
      "comment": "Sirach connects the purity of speech with purity of heart, a teaching Christ develops further, and is mirrored in apostolic exhortations to abstain from corrupt speech."
    },
    {
      "pk": 28023016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 16,
      "text": "Remember your father and mother, for you sit in their presence.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/49/6/2'>Eph. 6:2</a>",
      "comment": "Honoring parents is rooted in the Decalogue and reinforced in the New Testament. There is an implicit call to honor tradition and those who have gone before us."
    },
    {
      "pk": 28023017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 17,
      "text": "Guard yourself from thoughts about them, lest you bring shame and curse on yourself.",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>; <a href='/AIV/19/119/9'>Ps. 119:9</a>",
      "comment": "Purity of mind is essential, as it not only guards against personal sin but also maintains the integrity of family blessing."
    },
    {
      "pk": 28023018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 18,
      "text": "For if you act shamefully, you dishonor your parents, and wish yourself to be rid of them.",
      "links": "<a href='/AIV/20/10/1'>Prov. 10:1</a>; <a href='/AIV/19/78/58'>Ps. 78:58</a>",
      "comment": "Actions done in secret are ultimately revealed; dishonoring parents is seen as rebellion against one's own heritage and legacy—an issue of great concern across Scriptural tradition."
    },
    {
      "pk": 28023019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 19,
      "text": "A man with a wandering eye is like one who gazes at unfamiliar things and cannot be satisfied.",
      "links": "<a href='/AIV/20/27/20'>Prov. 27:20</a>; <a href='/AIV/40/5/28'>Matt. 5:28</a>",
      "comment": "The restless eyes point to inward disorder; Jesus applies this directly to the heart’s lust in the Sermon on the Mount."
    },
    {
      "pk": 28023020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 20,
      "text": "His soul burns like fire, it will never be satisfied till it is consumed.",
      "links": "<a href='/AIV/20/30/16'>Prov. 30:16</a>; <a href='/AIV/41/9/48'>Mark 9:48</a>",
      "comment": "The insatiable nature of sinful desire anticipates Christ’s teaching about hell as a consuming fire—warning against unchecked appetites and passions."
    },
    {
      "pk": 28023021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 21,
      "text": "Every eye is able to see, but the eyes of the Lord are ten thousand times brighter than the sun, watching over all the ways of men, and even the secret places.",
      "links": "<a href='/AIV/19/139/7-12'>Ps. 139:7-12</a>; <a href='/AIV/20/15/3'>Prov. 15:3</a>",
      "comment": "Divine omniscience is stressed, with all actions and thoughts done in secret exposed before God. This concept is developed further in Hebrews 4:13."
    },
    {
      "pk": 28023022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 22,
      "text": "He reveals everything about man before all creation and nothing can be hidden from Him.",
      "links": "<a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "God’s absolute knowledge undergirds the call to holiness. The transparency before God is an invitation to true repentance and conversion."
    },
    {
      "pk": 28023023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 23,
      "text": "A man who breaks his marriage vows says to himself, ‘Who sees me? Darkness surrounds me, the walls hide me, and no one sees me. Why should I fear?’",
      "links": "<a href='/AIV/20/7/18-19'>Prov. 7:18-19</a>; <a href='/AIV/19/10/11'>Ps. 10:11</a>",
      "comment": "The rationalization and self-deception of secret sin is addressed here, warning that God sees through all darkness—a theme expanded by Jesus in Mark 4:22."
    },
    {
      "pk": 28023024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 24,
      "text": "The Most High is not to be feared because His eyes are hidden—I will not be noticed among the crowd.",
      "links": "<a href='/AIV/20/14/9'>Prov. 14:9</a>; <a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "Sirach notes the error of thinking God’s judgment can be escaped. This anticipation of the Last Judgment underscores accountability (see Matt. 25:31-46)."
    },
    {
      "pk": 28023025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 25,
      "text": "He does not realize that the eyes of the Lord are far brighter than the sun, observing all his ways, and seeing even the most secret corners.",
      "links": "<a href='/AIV/20/5/21'>Prov. 5:21</a>; <a href='/AIV/19/33/13-15'>Ps. 33:13-15</a>",
      "comment": "Ignorance of God’s omnipresence is the root of much sin; the vivid imagery recalls the certainty of Divine knowledge."
    },
    {
      "pk": 28023026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 26,
      "text": "He knew all things even before they were created, so He sees all things to the end.",
      "links": "<a href='/AIV/19/139/16'>Ps. 139:16</a>; <a href='/AIV/23/46/10'>Isa. 46:10</a>",
      "comment": "God’s foreknowledge highlights the eternal nature of His wisdom. This realization invites deeper trust in Divine providence, as also seen in Romans 8:28."
    },
    {
      "pk": 28023027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 27,
      "text": "Thus such men will be punished in the streets of the city; where they thought they were unseen, they will be brought down. They will be caught where they least expected.",
      "links": "<a href='/AIV/20/5/22-23'>Prov. 5:22-23</a>; <a href='/AIV/42/12/2-3'>Luke 12:2-3</a>",
      "comment": "Final justice is inevitable; sins committed in secret are revealed and punished openly. Jesus’ teaching in Luke parallels this—‘Nothing is hidden that will not be known.’ The passage affirms repentance and conversion as central to spiritual transformation and sharing in Christ’s promise of mercy."
    }
  ],
  "translatedAt": "2025-12-24T07:35:15.352Z"
}