{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 49,
  "verses": [
    {
      "pk": 28049001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 1,
      "text": "The memory of Josiah is like a blend of incense prepared by the work of a perfumer; it is sweet as honey in every mouth, and as music at a banquet of wine.",
      "links": "<a href='/AIV/12/23/25'>2 Kings 23:25</a>; <a href='/AIV/21/7/1'>Eccl. 7:1</a>",
      "comment": "Josiah is praised for his faithfulness, evoking fragrant worship offerings (see 2 Kings 23:25). This also points to the importance of proper worship and reverence in the faith."
    },
    {
      "pk": 28049002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 2,
      "text": "His remembrance is like a mixture of sweet incense made by the art of a perfumer; it is pleasant in all mouths and is held in the heart forever.",
      "links": "<a href='/AIV/02/30/34-35'>Exodus 30:34-35</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "The repeated fragrance illustrates the enduring legacy of the righteous through corporate memory, paralleling the continual prayers of the faithful."
    },
    {
      "pk": 28049003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 3,
      "text": "He led the people back from sin, and directed their hearts toward the Lord, and strengthened the foundation of righteousness.",
      "links": "<a href='/AIV/12/23/21-23'>2 Kings 23:21-23</a>; <a href='/AIV/19/51/13'>Ps. 51:13</a>",
      "comment": "Josiah's reforms prefigure leaders in the New Covenant who call people to repentance and conversion (see Acts 2:38)."
    },
    {
      "pk": 28049004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 4,
      "text": "All but a few kings—those who ruled—sinned; they abandoned the Law of the Most High, bringing the people to destruction.",
      "links": "<a href='/AIV/12/17/7-18/12'>2 Kings 17:7–18:12</a>; <a href='/AIV/19/106/43'>Ps. 106:43</a>",
      "comment": "This recalls the consistent pattern in Israel's history that falling away from true worship leads to disaster. Proper leadership and obedience are interconnected."
    },
    {
      "pk": 28049005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 5,
      "text": "They gave up their power to others, and their glory to a foreign nation.",
      "links": "<a href='/AIV/25/1/6'>Lam. 1:6</a>; <a href='/AIV/24/52/27-30'>Jer 52:27-30</a>",
      "comment": "Faithless rulers caused Israel to be subjugated, illustrating the loss of spiritual and national blessings when the covenant is broken (cf. Deut 28:36-37)."
    },
    {
      "pk": 28049006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 6,
      "text": "They burned the chosen city of the sanctuary, and left its streets desolate, as Jeremiah had foretold.",
      "links": "<a href='/AIV/24/7/14'>Jer. 7:14</a>; <a href='/AIV/25/2/9'>Lam. 2:9</a>",
      "comment": "The destruction of Jerusalem fulfills prophetic warnings, highlighting the authority of God’s appointed prophets and the consequences of disobedience."
    },
    {
      "pk": 28049007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 7,
      "text": "For they treated Jeremiah badly, who was even designated a prophet before his mother's womb, to uproot and to destroy, but also to build up and to plant.",
      "links": "<a href='/AIV/24/1/5,10'>Jer. 1:5, 1:10</a>",
      "comment": "Jeremiah’s prophetic calling (pre-birth) highlights God’s sovereignty. His negative and positive mission echoes God's long-term redemptive plan, including the promise of restoration (Jer. 31:31)."
    },
    {
      "pk": 28049008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 8,
      "text": "Ezekiel saw a glorious vision, which was shown to him upon the chariot of cherubim.",
      "links": "<a href='/AIV/26/1/4-28'>Ezek. 1:4-28</a>",
      "comment": "The vision of Ezekiel (theophany of God's glory on the cherubim) demonstrates God's transcendence and the reality of divine mysteries, anticipated more profoundly in Christ (cf. Rev 4:6-9)."
    },
    {
      "pk": 28049009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 9,
      "text": "For indeed, he made mention of Job, who always kept to the way of righteousness.",
      "links": "<a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "Job is held as a model for the just, demonstrating perseverance and trust under suffering – a theme echoed by James (Jas 5:11) and exemplified by Christ."
    },
    {
      "pk": 28049010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 10,
      "text": "The twelve prophets—may their bones flourish again from their resting places!—they comforted Jacob and delivered him with confident hope.",
      "links": "<a href='/AIV/28/1/1'>Hosea 1:1</a>; <a href='/AIV/39/4/4'>Mal. 4:4</a>",
      "comment": "A blessing upon the minor prophets, indicating a belief in future resurrection. The power of prophetic Word comforts and brings hope, ultimately fulfilled in Christ (cf. Luke 24:27)."
    },
    {
      "pk": 28049011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 11,
      "text": "How shall we magnify Zerubbabel? He too was like a signet ring on the right hand, and so was Jeshua son of Jozadak; in their days they rebuilt the house and raised up a holy temple to the Lord, destined for everlasting glory.",
      "links": "<a href='/AIV/37/2/21-23'>Haggai 2:21-23</a>; <a href='/AIV/15/5/2'>Ezra 5:2</a>",
      "comment": "Zerubbabel and Jeshua led the restoration of worship and the temple, foreshadowing the enduring house of God established in the New Covenant (cf. 1 Pet 2:5)."
    },
    {
      "pk": 28049012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 12,
      "text": "And lasting renown belongs to Nehemiah, who rebuilt our ruined walls, established gates and bars, and restored our city.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>; <a href='/AIV/16/6/15-16'>Neh. 6:15-16</a>",
      "comment": "Nehemiah’s leadership in rebuilding Jerusalem’s defenses underscores the necessity of visible unity and order in the community of faith."
    },
    {
      "pk": 28049013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 13,
      "text": "No one on earth was created to rival Enoch, for he was taken up from the earth.",
      "links": "<a href='/AIV/01/5/24'>Gen. 5:24</a>; <a href='/AIV/58/11/5'>Heb. 11:5</a>",
      "comment": "Enoch is a model of intimacy with God, taken directly to His presence. This prefigures both the Assumption theme and resurrection hope for all the faithful."
    },
    {
      "pk": 28049014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 14,
      "text": "No one has ever been born like Joseph, the leader of his brothers, the support of his people. His bones were cared for.",
      "links": "<a href='/AIV/01/41/41'>Gen. 41:41</a>; <a href='/AIV/01/50/25'>Gen. 50:25</a>",
      "comment": "Joseph as a type of Christ: rejected, then exalted and a savior to his family. The reverence for Joseph's bones points to a belief in bodily resurrection and the lasting significance of the covenant."
    },
    {
      "pk": 28049015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 15,
      "text": "Shem and Seth were honored among humankind, but above every living soul is Adam in whom humanity originated.",
      "links": "<a href='/AIV/01/5/3-8'>Gen. 5:3-8</a>; <a href='/AIV/45/5/14'>Rom. 5:14</a>",
      "comment": "Shem and Seth link to the faithful remnant line, yet Adam’s role as first man points forward to the 'New Adam' (Rom 5:14) in Christ who restores humanity."
    },
    {
      "pk": 28049016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 49,
      "verse": 16,
      "text": "He above all others was created in abundance and strength; but when he fell, he became subject to those who came after him.",
      "links": "<a href='/AIV/01/1/26-31'>Gen. 1:26-31</a>; <a href='/AIV/45/5/12'>Rom. 5:12</a>",
      "comment": "Adam's fall brought subjection to death and sin, but this sets up the restoration in Christ ('the last Adam'), who brings redemption through obedience and sacrificial love (see 1 Cor. 15:21-22, 45)."
    }
  ],
  "translatedAt": "2025-12-24T07:49:42.942Z"
}