{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 44,
  "verses": [
    {
      "pk": 28044001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 1,
      "text": "Let us now praise outstanding men, our ancestors in their generations.",
      "links": "<a href='/AIV/19/78/2-8'>Ps. 78:2-8</a>; <a href='/AIV/58/11/32'>Heb. 11:32</a>",
      "comment": "Sirach begins a section honoring the forefathers, establishing the biblical tradition of remembrance of the righteous. This lays groundwork for thinking about communion with those who have gone before, which is also seen in Hebrews 11."
    },
    {
      "pk": 28044002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 2,
      "text": "The Lord created great glory through them, His majesty from the beginning.",
      "links": "<a href='/AIV/19/8/5'>Ps. 8:5</a>; <a href='/AIV/23/43/7'>Isa. 43:7</a>",
      "comment": "This verse recognizes that the glory of faithful men is ultimately God's glory working through them. All human praise reflects God’s providence, aligning with the idea that grace perfects nature."
    },
    {
      "pk": 28044003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 3,
      "text": "They ruled in their kingdoms and were renowned for their power, giving counsel according to their wisdom.",
      "links": "<a href='/AIV/11/4/29-34'>1 Kgs. 4:29-34</a>",
      "comment": "The text subtly honors those endowed with authority and wisdom—echoes of Solomon and other biblical kings. This sets a precedent for spiritual governance and wisdom being respected in the community."
    },
    {
      "pk": 28044004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 4,
      "text": "They guided the people by their knowledge and wise words; they taught with understanding.",
      "links": "<a href='/AIV/20/1/2-7'>Prov. 1:2-7</a>",
      "comment": "Education and teaching are shown as essential virtues. The respect afforded to teachers in Israel mirrors the position of spiritual instructors and tradition-bearers in the Church."
    },
    {
      "pk": 28044005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 5,
      "text": "Composers of musical verses, writers of poetry, and skilled in art.",
      "links": "<a href='/AIV/19/150/2'>Ps. 150:2</a>",
      "comment": "The honoring of artistic gifts highlights the biblical affirmation of beauty and creativity as part of God’s plan—a foundation for the appreciation of sacred music and liturgy."
    },
    {
      "pk": 28044006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 6,
      "text": "Rich men furnished with resources, living in peace in their dwellings.",
      "links": "<a href='/AIV/20/10/22'>Prov. 10:22</a>",
      "comment": "Material provision is acknowledged as a blessing, connected to peace—the biblical concept of shalom—which anticipates spiritual peace found in the faithful."
    },
    {
      "pk": 28044007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 7,
      "text": "All these were honored in their time and were a glory in their generations.",
      "links": "<a href='/AIV/19/149/1'>Ps. 149:1</a>",
      "comment": "Generational honor illustrates the biblical principle of tradition—a spiritual inheritance passed down, which parallels apostolic succession in the life of the church."
    },
    {
      "pk": 28044008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 8,
      "text": "Some of them left a name behind, so that people declare their praises.",
      "links": "<a href='/AIV/19/112/6'>Ps. 112:6</a>",
      "comment": "Remembrance of the righteous aligns with the biblical teaching that the memory of the just is blessed, and supports the spiritual practice of venerating the saints."
    },
    {
      "pk": 28044009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 9,
      "text": "But there are others of whom no memory remains; they perished as though they had never been, and their children the same.",
      "links": "<a href='/AIV/20/10/7'>Prov. 10:7</a>",
      "comment": "A sobering reminder of human frailty and the importance of living a life worthy of remembrance in God’s sight."
    },
    {
      "pk": 28044010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 10,
      "text": "Yet these men were compassionate, whose righteous deeds have not been forgotten.",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>",
      "comment": "The deeds of the righteous have eternal significance. This underlines the scriptural theme of merit and reward for charity and goodness."
    },
    {
      "pk": 28044011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 11,
      "text": "Their offspring will remain forever, and their glory will not be blotted out.",
      "links": "<a href='/AIV/01/12/2-3'>Gen. 12:2-3</a>; <a href='/AIV/19/102/28'>Ps. 102:28</a>",
      "comment": "This verse affirms the biblical promise of legacy and family—a theme which prefigures spiritual adoption and inheritance in Christ."
    },
    {
      "pk": 28044012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 12,
      "text": "Their bodies are buried in peace, but their name lives on generation after generation.",
      "links": "<a href='/AIV/23/57/2'>Isa. 57:2</a>",
      "comment": "Burial in peace points to hope beyond death. The continuing name reflects a spiritual principle: the communion of the faithful, living and departed."
    },
    {
      "pk": 28044013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 13,
      "text": "People will declare their wisdom, and the assembly will proclaim their praise.",
      "links": "<a href='/AIV/19/22/22'>Ps. 22:22</a>",
      "comment": "The assembly’s praise points to the worshipping community’s role in honoring the righteous—an early vision of what later develops into liturgical commemoration."
    },
    {
      "pk": 28044014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 14,
      "text": "Enoch pleased the Lord and was taken up, an example of repentance to all generations.",
      "links": "<a href='/AIV/01/5/24'>Gen. 5:24</a>; <a href='/AIV/58/11/5'>Heb. 11:5</a>",
      "comment": "Enoch’s taken up prefigures bodily assumption and demonstrates both the value of repentance and the extraordinary favor God bestows on the righteous. His example anticipates participation in heavenly glory, a theme developed in Christian theology."
    },
    {
      "pk": 28044015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 15,
      "text": "Noah was found perfect and righteous; in the time of wrath, he was taken as a remnant; through him, a covenant was established for generations.",
      "links": "<a href='/AIV/01/6/9'>Gen. 6:9</a>; <a href='/AIV/01/9/9-17'>Gen. 9:9-17</a>",
      "comment": "The covenant with Noah as a sign of God’s faithfulness and mercy anticipates later, greater covenants that come to fullness in Christ."
    },
    {
      "pk": 28044016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 16,
      "text": "Abraham was the great father of a multitude of nations, honored in the abundance of his glory.",
      "links": "<a href='/AIV/01/17/4-5'>Gen. 17:4-5</a>; <a href='/AIV/48/3/7-9'>Gal. 3:7-9</a>",
      "comment": "Abraham’s fatherhood is both physical and spiritual (cf. Gal. 3), which points to the inclusion of all believers into the people of God."
    },
    {
      "pk": 28044017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 17,
      "text": "He was the one in whom the covenant was established; God made a covenant with him that he would be blessed among all nations.",
      "links": "<a href='/AIV/01/12/2-3'>Gen. 12:2-3</a>",
      "comment": "The covenant with Abraham is a foundational pillar for salvation history. His faith and obedience prefigure faith in Christ and the blessings extended to all nations."
    },
    {
      "pk": 28044018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 18,
      "text": "He was told that his descendants would multiply like the dust of the earth, and his offspring would be as numerous as the stars.",
      "links": "<a href='/AIV/01/13/16'>Gen. 13:16</a>; <a href='/AIV/01/15/5'>Gen. 15:5</a>",
      "comment": "The promise of numerous descendants is fulfilled both physically in Israel and spiritually in the universal Church inherited through faith."
    },
    {
      "pk": 28044019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 19,
      "text": "Isaac also stood firm through Abraham, his father; for his sake, the blessing of all humanity and the covenant was confirmed.",
      "links": "<a href='/AIV/01/26/3-5'>Gen. 26:3-5</a>",
      "comment": "Isaac’s blessing flows from Abraham’s faith, showing God’s plan to work through family lines and spiritual inheritance—a sign of the unity of the faithful through spiritual lineage."
    },
    {
      "pk": 28044020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 20,
      "text": "To Jacob, He gave the promise of peace, and assigned him a portion from the land, establishing the inheritance.",
      "links": "<a href='/AIV/01/28/13-14'>Gen. 28:13-14</a>",
      "comment": "The promise to Jacob points to the fulfillment of the inheritance of the people of God, foreshadowing the spiritual inheritance enjoyed by the baptized."
    },
    {
      "pk": 28044021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 21,
      "text": "He preserved him and blessed him, granting him the inheritance of the twelve tribes.",
      "links": "<a href='/AIV/01/35/10-12'>Gen. 35:10-12</a>; <a href='/AIV/02/1/1-7'>Exod. 1:1-7</a>",
      "comment": "The division into twelve tribes foreshadows the twelve apostles, both showing the pattern of God’s chosen assembly."
    },
    {
      "pk": 28044022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 22,
      "text": "Out of him came a man of mercy who found favor in the sight of all living—Moses, beloved of God and men.",
      "links": "<a href='/AIV/02/2/2'>Exod. 2:2</a>; <a href='/AIV/58/3/1-6'>Heb. 3:1-6</a>",
      "comment": "Moses as a mediator between God and His people is a type of Christ, who is the ultimate mediator and priest (cf. Heb. 3)."
    },
    {
      "pk": 28044023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 44,
      "verse": 23,
      "text": "He made a covenant with him, granting commandments, and showed Him His glory upon the mountain, and exalted him with great honor.",
      "links": "<a href='/AIV/02/24/12-18'>Exod. 24:12-18</a>; <a href='/AIV/02/34/29-35'>Exod. 34:29-35</a>; <a href='/AIV/40/17/1-5'>Matt. 17:1-5</a>",
      "comment": "The giving of the Law and Moses’ vision of God’s glory prefigure Christ’s Transfiguration, where the full glory of God is revealed in Christ. Moses’ honor points to the reality of continued divine revelation, handed down through a divinely appointed order."
    }
  ],
  "translatedAt": "2025-12-24T07:47:32.698Z"
}