{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 48,
  "verses": [
    {
      "pk": 28048001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 1,
      "text": "Then the prophet Elijah arose like fire, and his word burned like a torch.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "Elijah’s prophetic ministry is described with fiery imagery, reflecting his zeal and the powerful signs accompanying his words. The fire recalls Elijah calling down fire from heaven, which established true worship among the Israelites. This also foreshadows spiritual purification and typifies John's role leading up to Christ (see Luke 1:17)."
    },
    {
      "pk": 28048002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 2,
      "text": "He brought famine upon them, and by his zeal he made their number few.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/11/18/2'>1 Kings 18:2</a>",
      "comment": "Elijah’s prayer halted rain as a judgement on Israel’s apostasy. The effect of his prayer visibly altered Israel’s history, highlighting prophet’s authority. This serves as a reminder of the efficacy of intercessory prayer and faithful obedience."
    },
    {
      "pk": 28048003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 3,
      "text": "By the word of the Lord he shut up the heavens, and also three times brought down fire.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>; <a href='/AIV/12/1/10'>2 Kings 1:10-14</a>",
      "comment": "This summarizes Elijah’s miracles: closing the heavens to prevent rain and calling down fire, signifying God’s power working through chosen servants. The triple appearance of fire corresponds to three incidents involving divine fire in Elijah’s ministry, emphasizing divine confirmation."
    },
    {
      "pk": 28048004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 4,
      "text": "How gloriously you were honored, O Elijah, in your wondrous deeds! And who can boast as you have?",
      "links": "<a href='/AIV/11/18/36-39'>1 Kings 18:36-39</a>",
      "comment": "Elijah’s unique status as a miracle worker is praised. His acts distinguish him among the prophets, hinting at an enduring legacy and typological parallel to Christ’s own miraculous ministry."
    },
    {
      "pk": 28048005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 5,
      "text": "You raised a corpse from death and the depths of Hades, by the word of the Most High.",
      "links": "<a href='/AIV/11/17/17-23'>1 Kings 17:17-23</a>",
      "comment": "Elijah restored the widow’s son to life, prefiguring the resurrection. This act foreshadows Christ’s authority over death and his own resurrection, and affirms the belief in the power of God working through his messengers."
    },
    {
      "pk": 28048006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 6,
      "text": "You brought kings down to destruction, and famous men from their beds.",
      "links": "<a href='/AIV/11/21/17-24'>1 Kings 21:17-24</a>",
      "comment": "Elijah’s prophetic judgement led to the downfall of the wicked King Ahab and other rulers, showing God’s sovereignty over earthly powers. Prophetic authority is shown to be greater than mere royal might."
    },
    {
      "pk": 28048007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 7,
      "text": "You heard rebuke at Sinai, and judgments of vengeance at Horeb.",
      "links": "<a href='/AIV/11/19/8-18'>1 Kings 19:8-18</a>; <a href='/AIV/2/19/18'>Exodus 19:18</a>",
      "comment": "Sinai and Horeb mark places of divine encounter and judgement. Elijah’s retreat mirrors Moses’, and hearing God’s voice in the silence links him to the tradition of receiving revelation and judgement."
    },
    {
      "pk": 28048008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 8,
      "text": "You anointed kings for retribution, and prophets to succeed you.",
      "links": "<a href='/AIV/11/19/15-16'>1 Kings 19:15-16</a>; <a href='/AIV/11/19/16'>1 Kings 19:16</a>",
      "comment": "Elijah’s commission from God includes the anointing of successors in leadership and prophecy, indicating continuity and legitimate succession in God’s plan. Linking kingship and prophecy here suggests an established order willed by God."
    },
    {
      "pk": 28048009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 9,
      "text": "You were taken up in a whirlwind of fire, in a chariot with fiery horses.",
      "links": "<a href='/AIV/12/2/11'>2 Kings 2:11</a>",
      "comment": "Elijah’s assumption into heaven is a type for later hopes of bodily resurrection and assumption, showing the reward of faithful witness. This event inspired Jewish messianic expectation and is referenced at the Transfiguration of Christ (Matthew 17:3)."
    },
    {
      "pk": 28048010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 10,
      "text": "You are destined, in writing, for the time of wrath, to turn back the heart of fathers to their sons, and to restore the tribes of Jacob.",
      "links": "<a href='/AIV/39/4/5-6'>Malachi 4:5-6</a>; <a href='/AIV/42/1/17'>Luke 1:17</a>",
      "comment": "Elijah’s eschatological role is interpreted as reconciling families and restoring unity among the people, anticipating the ministry of John the Baptist as foretold. This prophecy connects old covenant figures with the coming of Christ and the new covenant."
    },
    {
      "pk": 28048011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 11,
      "text": "Blessed are those who see you, and those who have fallen asleep in love, for we too shall surely live.",
      "links": "<a href='/AIV/40/17/3'>Matthew 17:3</a>",
      "comment": "Contact with God’s true prophet is a mark of blessing. The reference to those ‘fallen asleep in love’ points subtly to the communion of saints and those awaiting resurrection; the promise of life is grounded in God’s enduring love."
    },
    {
      "pk": 28048012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 12,
      "text": "Elijah was enveloped in a whirlwind, and Elisha was filled with his spirit. In his days he did not tremble before any ruler, and no one subdued him.",
      "links": "<a href='/AIV/12/2/9-15'>2 Kings 2:9-15</a>",
      "comment": "Elisha inherits Elijah’s prophetic spirit, indicating transfer of authority and continuation. The singular courage marks both as fearless before earthly powers, echoing the boldness expected of spiritual leaders."
    },
    {
      "pk": 28048013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 13,
      "text": "Nothing was too hard for him, and even in death his body prophesied.",
      "links": "<a href='/AIV/12/13/21'>2 Kings 13:21</a>",
      "comment": "Elisha’s wonder-working did not cease even after death, as a dead man’s contact with his bones brought life. This attests to the enduring power of holiness and foreshadows later Christian reverence for the relics of saints."
    },
    {
      "pk": 28048014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 14,
      "text": "In his life he performed wonders, and in death his deeds were marvelous.",
      "links": "<a href='/AIV/12/2/19-22'>2 Kings 2:19-22</a>; <a href='/AIV/12/4/38-44'>2 Kings 4:38-44</a>",
      "comment": "Elisha’s miracles during and after his life highlight God’s power through human instruments, manifesting that divine favor is not bound by mortality."
    },
    {
      "pk": 28048015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 15,
      "text": "Despite all this, the people did not repent, nor did they turn away from their sins, until they were carried off and scattered throughout the earth.",
      "links": "<a href='/AIV/12/17/6-18'>2 Kings 17:6-18</a>",
      "comment": "Miracles and prophecy were not enough to induce repentance amongst Israel, leading to exile. This underscores the necessity of both faith and obedience, and points to the gravity of free will in rejection of God’s call."
    },
    {
      "pk": 28048016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 16,
      "text": "Nevertheless, a few remained, led by a ruler from the house of David.",
      "links": "<a href='/AIV/12/19/32'>2 Kings 19:32</a>; <a href='/AIV/10/7/16'>2 Samuel 7:16</a>",
      "comment": "God preserves a remnant, highlighting his fidelity to promise. The mention of the house of David reaffirms messianic hope and the role of the Davidic line in restoration, ultimately fulfilled in the coming of Christ."
    },
    {
      "pk": 28048017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 17,
      "text": "Some did what was right, but others multiplied sin.",
      "links": "<a href='/AIV/12/18/3-4'>2 Kings 18:3-4</a>",
      "comment": "This contrast highlights the varying response to God’s grace. Those who did right exemplify the few faithful among many, typifying the spiritual principle of a holy remnant."
    },
    {
      "pk": 28048018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 18,
      "text": "Hezekiah strengthened his city, bringing water into its midst; with iron he dug through the rock, and built wells for water.",
      "links": "<a href='/AIV/12/20/20'>2 Kings 20:20</a>; <a href='/AIV/14/32/30'>2 Chronicles 32:30</a>",
      "comment": "Hezekiah’s wise governance safeguards Jerusalem, a visible sign of practical wisdom paired with faith. Water as a symbol points to spiritual sustenance and fulfills the tradition of God's provision for his people."
    },
    {
      "pk": 28048019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 19,
      "text": "In his days Sennacherib came up and sent Rabshakeh; he lifted his hand against Zion and boasted in his arrogance.",
      "links": "<a href='/AIV/12/18/13-35'>2 Kings 18:13-35</a>",
      "comment": "Sennacherib’s siege symbolizes the continual threats faced by the city of God. The arrogance and blasphemy of enemies contrast with God’s enduring protection of his chosen dwelling and servants."
    },
    {
      "pk": 28048020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 20,
      "text": "Then their hearts and hands trembled, and they writhed in pain, like women in childbirth.",
      "links": "<a href='/AIV/12/19/1'>2 Kings 19:1</a>; <a href='/AIV/23/37/3'>Isaiah 37:3</a>",
      "comment": "Israel’s distress is poetically likened to birth pains, pointing to both suffering and anticipation of eventual deliverance. This metaphor is repeated in messianic contexts to signal tribulation before God’s saving act."
    },
    {
      "pk": 28048021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 21,
      "text": "But they called upon the Merciful Lord, stretching out their hands toward him. From heaven the Holy One quickly heard them.",
      "links": "<a href='/AIV/12/19/14-20'>2 Kings 19:14-20</a>",
      "comment": "Repentance and prayer lead to divine intervention. The speed and willingness of God’s response to those who humble themselves underscores the necessity of regular communal prayer in times of trial."
    },
    {
      "pk": 28048022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 22,
      "text": "He remembered their words, and did not hand them over to their enemies; instead, he delivered them by the hand of Isaiah.",
      "links": "<a href='/AIV/12/19/20-35'>2 Kings 19:20-35</a>",
      "comment": "The prophet Isaiah, here acting as God’s chosen intercessor, delivers the people, emphasizing that God’s saving work is often accomplished through appointed spokesmen. The importance of prophetic mediation is highlighted."
    },
    {
      "pk": 28048023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 23,
      "text": "He struck down the camp of the Assyrians, and his angel destroyed them.",
      "links": "<a href='/AIV/12/19/35'>2 Kings 19:35</a>; <a href='/AIV/23/37/36'>Isaiah 37:36</a>",
      "comment": "God’s angel acts as an instrument of divine justice, recalling other instances of angelic intervention. This highlights belief in heavenly forces assisting God’s people, and further underlines God's direct protection."
    },
    {
      "pk": 28048024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 24,
      "text": "For Hezekiah did what was pleasing to the Lord, and held firmly to the ways of David his ancestor, as commanded by the prophet Isaiah, who was great and trustworthy in his visions.",
      "links": "<a href='/AIV/12/18/3'>2 Kings 18:3</a>; <a href='/AIV/23/37/6'>Isaiah 37:6</a>",
      "comment": "Hezekiah’s righteousness is shown by his adherence to David’s path and obedience to prophetic instruction. This affirms continuity of true worship, and the role of prophesy as God’s ongoing guidance for leadership and faith."
    },
    {
      "pk": 28048025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 48,
      "verse": 25,
      "text": "In his days the sun was turned back, and he added life to the king; in the power of the Spirit he saw the future, and comforted the mourners of Zion.",
      "links": "<a href='/AIV/12/20/11'>2 Kings 20:11</a>; <a href='/AIV/23/38/5-8'>Isaiah 38:5-8</a>",
      "comment": "Isaiah’s miraculous sign involving the sun and his prophecy lengthening Hezekiah’s life, demonstrate God’s sovereignty over creation and human destiny. The prophetic spirit brings consolation and hope, which anticipate the ministry of Christ and the consolation offered through the Spirit."
    }
  ],
  "translatedAt": "2025-12-24T07:49:21.333Z"
}