{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 38,
  "verses": [
    {
      "pk": 28038001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 1,
      "text": "Honor the physician with the honor due him, according to your need of him, for the Lord created him.",
      "links": "<a href='/AIV/21/1/9'>Wisdom 1:9</a>; <a href='/AIV/19/103/3'>Psalm 103:3</a> ",
      "comment": "The physician is to be respected, since his wisdom and skill come from God. This highlight's God's use of human instruments to provide healing, reflecting the value of both faith and practical means."
    },
    {
      "pk": 28038002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 2,
      "text": "For healing comes from the Most High, and the king shall reward him for his service.",
      "links": "<a href='/AIV/02/15/26'>Exodus 15:26</a>; <a href='/AIV/19/107/20'>Psalm 107:20</a>",
      "comment": "Ultimately, all healing is a gift from God. The reference to kings rewarding the physician affirms that earthly authority should recognize the value of God's appointed instruments for good."
    },
    {
      "pk": 28038003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 3,
      "text": "The physician’s skill lifts up his head, and he is admired in the presence of the great.",
      "links": "<a href='/AIV/20/22/29'>Proverbs 22:29</a>",
      "comment": "Skillful knowledge exalted by God is worthy of respect, echoing the biblical theme of God's wisdom bestowed upon His servants."
    },
    {
      "pk": 28038004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 4,
      "text": "The Lord created medicines from the earth, and the sensible will not despise them.",
      "links": "<a href='/AIV/01/1/12'>Genesis 1:12</a>; <a href='/AIV/19/104/14'>Psalm 104:14</a>",
      "comment": "Natural means of healing are to be received gratefully, showing the harmony of faith and reason. The verse supports the principle that the material and spiritual can work together for our good."
    },
    {
      "pk": 28038005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 5,
      "text": "Was not water made sweet with wood, that the power of God might be known?",
      "links": "<a href='/AIV/02/15/25'>Exodus 15:25</a>",
      "comment": "Recalls how God used physical means (wood) to work miracles (purifying water), showing His presence in both the miraculous and the ordinary."
    },
    {
      "pk": 28038006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 6,
      "text": "By these medicines, He heals and takes away pain, and the pharmacist makes a mixture of them.",
      "links": "<a href='/AIV/02/30/25'>Exodus 30:25</a>; <a href='/AIV/24/8/22'>Jeremiah 8:22</a>",
      "comment": "Acknowledges both the natural and human role in preparing medicine for healing—God working through material means and human cooperation."
    },
    {
      "pk": 28038007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 7,
      "text": "The works of the Lord are marvelous; His works are kept in His word.",
      "links": "<a href='/AIV/19/111/2'>Psalm 111:2</a>; <a href='/AIV/19/33/9'>Psalm 33:9</a>",
      "comment": "Echoes the Psalmist’s praise for God’s wonders. God’s works, including healing, remain accessible through His ongoing providence."
    },
    {
      "pk": 28038008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 8,
      "text": "Through them, the physician relieves pain, and the pharmacist prepares his mixtures.",
      "links": "<a href='/AIV/19/147/3'>Psalm 147:3</a>",
      "comment": "God’s creative order is revealed in the art of healing; medicine is not separate from faith but acts according to God's design."
    },
    {
      "pk": 28038009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 9,
      "text": "My child, when you are sick, do not despair, but pray to the Lord, for He will heal you.",
      "links": "<a href='/AIV/19/30/2'>Psalm 30:2</a>; <a href='/AIV/59/5/14'>James 5:14</a>",
      "comment": "Prayer and trust in God's power are primary in times of illness, in harmony with seeking natural means (v.4). Suggests that suffering can be redemptive and linked to prayer."
    },
    {
      "pk": 28038010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 10,
      "text": "Cleanse your heart from sin, and make a freewill offering, and reduce your offense.",
      "links": "<a href='/AIV/03/5/6'>Leviticus 5:6</a>; <a href='/AIV/19/51/10'>Psalm 51:10</a>",
      "comment": "Links healing of the body with the turning from sin and offering sacrifices—illustrative of the biblical principle that spiritual health is interrelated with physical well-being."
    },
    {
      "pk": 28038011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 11,
      "text": "Offer sweet-smelling sacrifice and a memorial of fine flour, and prepare a generous offering, according to your means.",
      "links": "<a href='/AIV/03/2/1-2'>Leviticus 2:1-2</a>",
      "comment": "This affirms the value of acts of worship and sacrifice for restoration, demonstrating the importance of liturgical prayer and offerings for reconciliation."
    },
    {
      "pk": 28038012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 12,
      "text": "Then give the physician his place, for the Lord created him; do not let him leave you, for you need him.",
      "links": "<a href='/AIV/28/38/1'>Sirach 38:1</a>",
      "comment": "Reiterates the value of working with physicians, showing God's providence through both prayer and earthly mediators."
    },
    {
      "pk": 28038013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 13,
      "text": "There may come a time when health is in their hands,",
      "links": "<a href='/AIV/19/147/3'>Psalm 147:3</a>",
      "comment": "Physical healing often requires human means. The power entrusted to the physician is ultimately from God."
    },
    {
      "pk": 28038014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 14,
      "text": "for they too pray to the Lord, so He will help them give relief and a cure, to preserve life.",
      "links": "<a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Suggests collaborative work between God and man, and affirms the dignity of those called to healing ministries."
    },
    {
      "pk": 28038015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 15,
      "text": "Whoever sins against his Maker acts with arrogance toward the physician.",
      "links": "<a href='/AIV/28/38/2'>Sirach 38:2</a>",
      "comment": "Implying a spiritual pride in refusing both God's mercy and His means for healing; God uses both spiritual and material means to restore His people."
    },
    {
      "pk": 28038016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 16,
      "text": "My child, let your tears flow for the dead, as one in deep sorrow; begin your lament with wailing, and observe mourning according to what is right, and do not be careless in your grief.",
      "links": "<a href='/AIV/01/23/2'>Genesis 23:2</a>; <a href='/AIV/43/11/35'>John 11:35</a>",
      "comment": "Mourning is seen as natural and even necessary, Christ Himself wept at the tomb of Lazarus (John 11:35), affirming the goodness of grief when done with hope."
    },
    {
      "pk": 28038017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 17,
      "text": "Prepare the body for burial according to custom, and do not neglect his burial.",
      "links": "<a href='/AIV/06/24/30'>Joshua 24:30</a>; <a href='/AIV/40/27/59'>Matthew 27:59</a>",
      "comment": "Proper burial honors the dignity of mankind, echoing how Joseph of Arimathea buried Jesus with reverence (Matt 27:59)."
    },
    {
      "pk": 28038018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 18,
      "text": "Weep bitterly and make passionate lament, but mourn appropriately, lest you harm yourself with sorrow.",
      "links": "<a href='/AIV/09/1/17'>1 Samuel 1:17</a>; <a href='/AIV/21/3/1-4'>Ecclesiastes 3:1-4</a>",
      "comment": "This verse teaches moderation in grief, recognizing both the value of sorrow and the need to accept God’s will, reflecting biblical wisdom in grieving with hope."
    },
    {
      "pk": 28038019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 19,
      "text": "Grief lingers for a while; then, comfort comes, for a life of sorrow is unbearable.",
      "links": "<a href='/AIV/19/30/5'>Psalm 30:5</a>",
      "comment": "God provides relief after mourning, signaling resurrection hope after death—'weeping may stay for the night, but rejoicing comes in the morning.'"
    },
    {
      "pk": 28038020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 20,
      "text": "Do not surrender your heart to grief, but drive it away, and remember your own end.",
      "links": "<a href='/AIV/26/24/17'>Ezekiel 24:17</a>; <a href='/AIV/40/6/34'>Matthew 6:34</a>",
      "comment": "This advises balance—living in the light of eternity while not neglecting prudent care for one's soul and relationships."
    },
    {
      "pk": 28038021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 21,
      "text": "Remember him who has died, for there is no return; you cannot help him, and you will only injure yourself.",
      "links": "<a href='/AIV/09/12/23'>1 Samuel 12:23</a>; <a href='/AIV/58/9/27'>Hebrews 9:27</a>",
      "comment": "A realistic appraisal of human mortality, tradition also recognizes prayers for the dead as a spiritual work of mercy."
    },
    {
      "pk": 28038022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 22,
      "text": "Remember his fate, for it is also yours; 'Yesterday it was his, today it is yours.'",
      "links": "<a href='/AIV/19/39/4'>Psalm 39:4</a>; <a href='/AIV/59/4/14'>James 4:14</a>",
      "comment": "Contemplating mortality encourages humility and preparation for the afterlife, a central theme in Christian ascetic and devotional teaching."
    },
    {
      "pk": 28038023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 23,
      "text": "When the dead is at rest, let his memory rest, and comfort yourself over him when his spirit departs.",
      "links": "<a href='/AIV/11/2/10'>1 Kings 2:10</a>; <a href='/AIV/52/4/13'>1 Thessalonians 4:13</a>",
      "comment": "Honoring the dead's memory is a reverent act, paralleling the hope of resurrection and eternal rest for the faithful."
    },
    {
      "pk": 28038024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 24,
      "text": "The wisdom of the scribe comes through the opportunity for leisure, and whoever has little business may become wise.",
      "links": "<a href='/AIV/20/1/5'>Proverbs 1:5</a>; <a href='/AIV/44/6/4'>Acts 6:4</a>",
      "comment": "Dedication to study and contemplation is extolled; those given to spiritual reflection hold wisdom esteemed by God and community."
    },
    {
      "pk": 28038025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 25,
      "text": "How can one become wise who handles a plow and prides himself in the work of oxen, and whose occupation is to turn up the soil?",
      "links": "<a href='/AIV/20/12/11'>Proverbs 12:11</a>",
      "comment": "Contrasts the manual laborer's busyness with the scribe's leisure for wisdom. The dignity of both vocations is affirmed in God's providence."
    },
    {
      "pk": 28038026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 26,
      "text": "He sets his mind on furrows, and, staying up late, he is watchful about fodder for his heifers.",
      "links": "<a href='/AIV/20/27/23'>Proverbs 27:23</a>",
      "comment": "Highlights the diligence of physical labor, recognizing that not all are called to the same pursuit; all roles contribute to the common good."
    },
    {
      "pk": 28038027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 27,
      "text": "So it is with every craftsman and artisan—who works at night as well as day, carving seals and being exact in his work.",
      "links": "<a href='/AIV/02/31/1-5'>Exodus 31:1-5</a>",
      "comment": "Skillful work is presented as a calling, echoing how God appointed skilled workers for His service. All honest labor can glorify God."
    },
    {
      "pk": 28038028,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 28,
      "text": "He sets his heart on the likeness of his art, and he stays awake to finish his work.",
      "links": "<a href='/AIV/02/35/30-34'>Exodus 35:30-34</a>",
      "comment": "Individual attention to one's vocation reflects the biblical theme of diligence and stewardship."
    },
    {
      "pk": 28038029,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 29,
      "text": "So does the smith, sitting by the anvil, intent on his ironwork; heat of the fire melts his flesh, and he battles the flames in the heat of the furnace:",
      "links": "<a href='/AIV/23/54/16'>Isaiah 54:16</a>",
      "comment": "The imagery of forging parallels the spiritual life—a process refined through perseverance and testing."
    },
    {
      "pk": 28038030,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 30,
      "text": "His ear is alert to the sound of the hammer; his eyes are on the pattern of his work. He sets his heart on finishing his work, and he keeps watch to perfect its details.",
      "links": "<a href='/AIV/20/22/29'>Proverbs 22:29</a>",
      "comment": "Professional attention to detail is affirmed; all labor done with care images the Creator, whose works are ‘very good’ (Genesis 1:31)."
    },
    {
      "pk": 28038031,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 31,
      "text": "So too the potter, sitting at his work, turning the wheel with his feet, always engrossed in his task, turning it with his arms—he shapes the clay with his might, bending strength over his feet, he puts all his energy into forming the vessel.",
      "links": "<a href='/AIV/24/18/2-6'>Jeremiah 18:2-6</a>",
      "comment": "The image of the potter recalls God as the sovereign shaper of His people—a favorite prophetic theme and later applied to spiritual formation."
    },
    {
      "pk": 28038032,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 32,
      "text": "He is always concerned how to finish his work and glazes it in the fire to perfection.",
      "links": "<a href='/AIV/23/29/16'>Isaiah 29:16</a>",
      "comment": "The labor that refines, even through fire, parallels how God perfects souls, with echoes in New Testament images of testing by fire (cf. 1 Corinthians 3:13)."
    },
    {
      "pk": 28038033,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 33,
      "text": "All these rely on their hands, and each is skillful in their own work.",
      "links": "<a href='/AIV/20/22/29'>Proverbs 22:29</a>",
      "comment": "Upholds the dignity of work, echoing the doctrine that both prayer and labor (cf. 'ora et labora') are means to sanctity."
    },
    {
      "pk": 28038034,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 38,
      "verse": 34,
      "text": "Without them, a city could not be built, and no one can sojourn or live there. But they are not sought for advice by the people, nor do they attain to a place in the assembly. They do not occupy the seat of the judge, nor do they understand the decisions of the court. They cannot expound discipline or judgment, but they keep the fabric of the world secure, and the prayers of their works are in the practice of their craft.",
      "links": "<a href='/AIV/46/12/14-19'>1 Corinthians 12:14-19</a>",
      "comment": "This closing verse affirms the value of every role in society, not all hold the place of teachers or judges, but every honest profession is a contribution to the common good and participates in God’s creative order."
    }
  ],
  "translatedAt": "2025-12-24T07:44:03.108Z"
}