{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 9,
  "verses": [
    {
      "pk": 17009001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 1,
      "text": "Then Tobias called Raphael and said to him, 'Brother Azariah, take with you a servant and two camels, and travel to Rages in Media to Gabael. Receive for me the money, and bring him to the wedding feast, for Raguel has sworn that I cannot leave.'",
      "links": "<a href='/AIV/17/5/15-23'>Tobit 5:15-23</a>; <a href='/AIV/01/24/10-11'>Gen. 24:10-11</a>",
      "comment": "Tobias demonstrates obedience and trust by entrusting Raphael (the angel in disguise) with the important task, reflecting Old Testament examples of delegation for important missions (Gen. 24:10-11). The use of 'wedding feast' points to the solemnity and celebration of marriage in biblical tradition, prefiguring the marriage imagery later fulfilled in Christ (cf. Eph. 5:32)."
    },
    {
      "pk": 17009002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 2,
      "text": "So Raphael went and lodged with Gabael, and gave him the receipt; Gabael brought out the bags with the seals and counted them before him.",
      "links": "<a href='/AIV/17/1/14'>Tobit 1:14</a>; <a href='/AIV/17/4/20-21'>Tobit 4:20-21</a>",
      "comment": "The careful counting and presence of a receipt highlight the importance of faithfulness and stewardship in small things (Luke 16:10-12). This passage suggests a deeper spiritual reality: God’s faithfulness in returning what was entrusted, paralleling the return of spiritual gifts when used rightly."
    },
    {
      "pk": 17009003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 3,
      "text": "Then they both loaded the bags on the camels, and they traveled together to the wedding feast.",
      "links": "<a href='/AIV/17/8/19'>Tobit 8:19</a>; <a href='/AIV/01/24/61'>Gen. 24:61</a>",
      "comment": "The journey together with gifts recalls Old Testament marriage customs (cf. Gen. 24:61) and symbolizes the mutual participation of believers in God’s blessings, a theme which echoes the communal nature of the Church and its sacraments."
    },
    {
      "pk": 17009004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 4,
      "text": "As they entered Raguel's house, they found Tobias sitting at the table.",
      "links": "<a href='/AIV/17/7/14'>Tobit 7:14</a>; <a href='/AIV/19/23/5'>Psalm 23:5</a>",
      "comment": "The wedding banquet is an image permeating Scripture, culminating in the heavenly banquet of the Lamb (Rev. 19:9). Tobias being seated at table brings to mind Psalm 23:5 and Jesus’ invitations to the feast, both literal and spiritual, in the Gospels."
    },
    {
      "pk": 17009005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 5,
      "text": "He was filled with joy as he greeted Gabael, who wept and blessed him, saying, 'Good and noble son of a good and noble father, may God’s blessing rest on you and on your wife and your wife’s father and mother. Blessed be God, because I have seen Tobias, who is so much like his father!'",
      "links": "<a href='/AIV/17/7/6-7'>Tobit 7:6-7</a>; <a href='/AIV/01/47/7-10'>Gen. 47:7-10</a>",
      "comment": "Gabael’s blessing recalls patriarchal blessings (cf. Gen. 47:7-10), emphasizing the continuity of faith and familial blessing through generations. The generational aspect points to the Church’s appreciation for tradition and apostolic succession, and the blessing mirrors Christ’s blessing upon households (Matt. 10:13)."
    },
    {
      "pk": 17009006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 9,
      "verse": 6,
      "text": "Then they all rejoiced together. They praised God and sat down to share the feast.",
      "links": "<a href='/AIV/19/22/26'>Ps. 22:26</a>; <a href='/AIV/42/15/6,9,32'>Luke 15:6,9,32</a>",
      "comment": "This final verse highlights the gathering of believers in joyful thanksgiving and shared feasts—a strong biblical image fulfilled most fully in communion with Christ (cf. Luke 22:19-20). The joy and praise exemplify unity, thanksgiving, and the anticipation of the heavenly celebration. There is also a spiritual foreshadowing of the ultimate feast—the Eucharist—where Christ gives Himself as the center of our joy and thanksgiving."
    }
  ],
  "translatedAt": "2025-12-24T04:57:39.371Z"
}