{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 13,
  "verses": [
    {
      "pk": 17013001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 1,
      "text": "Then Tobit opened his mouth in prayer and said: 'Blessed is God who lives forever, and blessed is his kingdom.'",
      "links": "<a href='/AIV/27/2/20'>Dan. 2:20</a>; <a href='/AIV/19/145/13'>Ps. 145:13</a>",
      "comment": "Tobit begins a hymn of praise; the emphasis on God’s eternal kingdom hints at the universal sovereignty anticipated in the kingdom proclaimed by Christ (Dan. 2:44; Matt. 6:10)."
    },
    {
      "pk": 17013002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 2,
      "text": "'For he afflicts and shows mercy; he leads down to Hades and brings up again. No one can escape his hand.'",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>; <a href='/AIV/09/2/6'>1 Sam. 2:6</a>",
      "comment": "The power of God over life, death, and mercy prefigures Christ’s authority over death itself (John 11:25-26). The mention of God’s hand echoes his sovereign will."
    },
    {
      "pk": 17013003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 3,
      "text": "'Acknowledge him before the nations, all you children of Israel! For he has scattered you among them.'",
      "links": "<a href='/AIV/23/43/21'>Isa. 43:21</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "Emphasizes public confession of God—a call to be witnesses among the nations. The diaspora motif points forward to the Great Commission (Matt. 28:19-20). Spread of faith is grounded in this missionary call."
    },
    {
      "pk": 17013004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 4,
      "text": "'There declare his greatness, and exalt him before all the living; because he is our Lord and God, he is our Father forever.'",
      "links": "<a href='/AIV/19/34/3'>Ps. 34:3</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "Acknowledging God as Father predicts Jesus’ teaching on God’s fatherhood. This anticipates the universal family of believers (Gal. 4:6-7)."
    },
    {
      "pk": 17013005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 5,
      "text": "'He will discipline you for your iniquities, but will again show mercy on all of you. He will gather you from all the nations among whom you have been scattered.'",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/19/106/47'>Ps. 106:47</a>",
      "comment": "God’s just discipline and mercy foreshadow Christ’s redemptive mission and the future gathering of God’s people into unity."
    },
    {
      "pk": 17013006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 6,
      "text": "'If you turn to him with your whole heart and with all your soul, to do what is true before him, then he will turn to you and will not hide his face from you. See what he will do with you; give him thanks with all your full voice. Praise the Lord of righteousness, and exalt the King of the ages.'",
      "links": "<a href='/AIV/05/30/2'>Deut. 30:2</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Echoes the call for heartfelt repentance and assurance of God’s mercy; parallels the New Testament command to love God with all your heart (Mark 12:30)."
    },
    {
      "pk": 17013007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 7,
      "text": "'I give him thanks in the land of my captivity, for he has shown his greatness even there. Turn to him, you sinners, and do what is right before him; who knows if he will accept you and have mercy on you?'",
      "links": "<a href='/AIV/09/12/14'>1 Sam. 12:14</a>; <a href='/AIV/24/18/8'>Jer. 18:8</a>",
      "comment": "Faithfulness is possible even in exile, prefiguring faithfulness under any circumstance. A call to repentance, echoed in New Testament teaching (Acts 3:19)."
    },
    {
      "pk": 17013008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 8,
      "text": "'I exalt my God, and my soul exalts the King of heaven, and will rejoice in his greatness.'",
      "links": "<a href='/AIV/42/1/46-47'>Luke 1:46-47</a>; <a href='/AIV/19/103/1'>Ps. 103:1</a>",
      "comment": "Mary’s Magnificat echoes Tobit’s praise, showing continuity in joyful thanksgiving to God. Rejoicing in the greatness of God marks the response of every believer."
    },
    {
      "pk": 17013009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 9,
      "text": "'Let all speak of his greatness, and celebrate him in Jerusalem!'",
      "links": "<a href='/AIV/23/2/3'>Isa. 2:3</a>; <a href='/AIV/19/48/1-2'>Ps. 48:1-2</a>",
      "comment": "Emphasis shifts to Jerusalem, a symbol of unity and worship in the people of God. Points ahead to new Jerusalem themes in Revelation (Rev. 21:2)."
    },
    {
      "pk": 17013010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 10,
      "text": "'O Jerusalem, holy city, he will afflict you for the deeds of your children, but again he will show mercy to the children of the righteous.'",
      "links": "<a href='/AIV/25/1/8'>Lam. 1:8</a>; <a href='/AIV/19/122/6'>Ps. 122:6</a>",
      "comment": "Discipline and promised mercy for Jerusalem reflect both earthly and heavenly realities. Points to God’s future restoration and enduring faithfulness."
    },
    {
      "pk": 17013011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 11,
      "text": "'Give thanks to the Lord as is fitting, and bless the King of the ages, so that his tent may be rebuilt in you with joy. May he cheer those who are exiles and love those who are afflicted, to all generations forever.'",
      "links": "<a href='/AIV/23/54/2'>Isa. 54:2</a>; <a href='/AIV/19/126/1-2'>Ps. 126:1-2</a>",
      "comment": "Images of restoration—'tent rebuilt'—reference both the future rebuilding of Jerusalem and the establishment of God’s dwelling among his people (John 1:14; Rev. 21:3)."
    },
    {
      "pk": 17013012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 12,
      "text": "'A bright light will shine upon all the ends of the earth. Many nations will come to you from afar, and the inhabitants of all the limits of the earth will come, bearing gifts in their hands to the King of heaven. Generations will shout for joy, and the name of the chosen city will endure forever.'",
      "links": "<a href='/AIV/23/60/3-6'>Isa. 60:3-6</a>; <a href='/AIV/40/2/1-2'>Matt. 2:1-2</a>",
      "comment": "Prophetic vision of worldwide pilgrimage, fulfilled in Christ drawing the nations (Matt. 28:19; Rev. 21:24-26). 'Chosen city' hints at the spiritual assembly of God’s people."
    },
    {
      "pk": 17013013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 13,
      "text": "'Cursed are all they who despise you; blessed are all who love you forever.'",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/19/122/6'>Ps. 122:6</a>",
      "comment": "Blessing for those who love the city of God mirrors the Abrahamic promise and later Christian unity around the city of God (Heb. 12:22)."
    },
    {
      "pk": 17013014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 14,
      "text": "'Rejoice and be glad for the children of the righteous, for they will be gathered together and will bless the Lord of the righteous.'",
      "links": "<a href='/AIV/27/12/3'>Dan. 12:3</a>; <a href='/AIV/40/13/43'>Matt. 13:43</a>",
      "comment": "Points toward the ultimate gathering of the righteous, an image taken up by Jesus in the parables of the kingdom and in the final resurrection."
    },
    {
      "pk": 17013015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 15,
      "text": "'Blessed are those who love you, they will rejoice in your peace. Blessed are all those who grieve over all your afflictions, for they will rejoice in you and see all your glory forever.'",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/23/66/10-14'>Isa. 66:10-14</a>",
      "comment": "Rejoicing in the peace and glory of Jerusalem points to the enduring peace promised to God's people (John 14:27). Mourners are comforted, relating to the Beatitudes (Matt. 5:4)."
    },
    {
      "pk": 17013016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 16,
      "text": "'Let my soul bless the Lord, the great King, for Jerusalem will be built with sapphires and emeralds, with precious stones; its walls and towers and battlements with pure gold, and its streets paved with rubies and stones of Ophir.'",
      "links": "<a href='/AIV/23/54/11-12'>Isa. 54:11-12</a>; <a href='/AIV/66/21/18-21'>Rev. 21:18-21</a>",
      "comment": "Symbolic language for the glorious renewal of God’s city; echoes the New Jerusalem in Revelation, emphasizing spiritual beauty and perfection."
    },
    {
      "pk": 17013017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 17,
      "text": "'All her streets will cry, “Hallelujah!” and give praise, saying, “Blessed be God who has exalted you forever!”'",
      "links": "<a href='/AIV/19/148/1'>Ps. 148:1</a>; <a href='/AIV/66/19/1'>Rev. 19:1</a>",
      "comment": "'Hallelujah'—praise of God by the renewed city—points to future, unending worship in God's presence. Participation in the city of God is tied to eternal praise."
    },
    {
      "pk": 17013018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 13,
      "verse": 18,
      "text": "'Blessed be those who will love you, for they will rejoice in your peace. Blessed are all those who grieve over all your afflictions, for they will share in your joy for all generations to come.'",
      "links": "<a href='/AIV/23/66/10'>Isa. 66:10</a>; <a href='/AIV/40/5/4'>Matt. 5:4</a>",
      "comment": "Repeats the blessing for those who love and mourn for the city; Christian unity and hope even in suffering, leading to everlasting joy (see Rom. 8:18-21)."
    }
  ],
  "translatedAt": "2025-12-24T04:59:26.506Z"
}