{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 14,
  "verses": [
    {
      "pk": 17014001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 1,
      "text": "So Tobit ended his words of praise. He was fifty-eight years old when he lost his sight, and after eight years he regained it. He gave alms and continued to praise the Lord God and to declare His greatness.",
      "links": "<a href='/AIV/17/2/7-8'>Tobit 2:7-8</a>;<a href='/AIV/17/11/13-15'>Tobit 11:13-15</a>;<a href='/AIV/19/150/1'>Psalm 150:1</a>",
      "comment": "Tobit's restoration of sight after eight years echoes God's continued care for the righteous. His response is to give alms and praise, highlighting the importance of both mercy and worship. In the broader canonical context, this points to an ongoing call for believers to combine faith and works (see <a href='/AIV/59/2/17'>James 2:17</a>)."
    },
    {
      "pk": 17014002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 2,
      "text": "When he was very old, he called his son Tobias and the sons of Tobias, and said to them, \"My son, take your children;",
      "links": "<a href='/AIV/17/4/3'>Tobit 4:3</a>; <a href='/AIV/20/13/22'>Proverbs 13:22</a>",
      "comment": "Tobit prepares to give his final instructions, similar to many patriarchs before death. This reflects the biblical tradition of elders imparting spiritual inheritance (compare <a href='/AIV/1/49/1-33'>Genesis 49:1-33</a>)."
    },
    {
      "pk": 17014003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 3,
      "text": "Depart promptly for Media, my son, for I believe the word which Jonah the prophet spoke concerning Nineveh, that it will be overthrown. But in Media there will be peace for a time. Our relatives live there, and you will be safer there, my child.\"",
      "links": "<a href='/AIV/32/3/4'>Jonah 3:4</a>; <a href='/AIV/17/1/14'>Tobit 1:14</a>",
      "comment": "Tobit refers to the prophecy of Jonah as authoritative, underlining the unity between prophetic utterance and wisdom. Trust in prophetic tradition and familial continuity is emphasized."
    },
    {
      "pk": 17014004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 4,
      "text": "\"See, my child, what Nadab did to Ahiqar who raised him. Was not Ahiqar brought down alive into the earth? Yet God vindicated him before Nadab humiliated him. Nadab himself went down into eternal darkness. For all who act unjustly or practice sin will be punished, but if you do righteousness, you will be rewarded.\"",
      "links": "<a href='/AIV/17/1/22'>Tobit 1:22</a>; <a href='/AIV/19/37/40'>Psalm 37:40</a>",
      "comment": "Here, an Old Testament motif of divine retribution is expressed: righteous suffering is ultimately vindicated, and the wicked are punished—echoing later teachings on final judgment and eternal consequence (compare <a href='/AIV/40/25/46'>Matthew 25:46</a>)."
    },
    {
      "pk": 17014005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 5,
      "text": "\"Now, my child, observe what the Lord commands you, and do what is pleasing in His sight all the days of your life. Do not walk in the ways of wrongdoing.\"",
      "links": "<a href='/AIV/17/4/5'>Tobit 4:5</a>; <a href='/AIV/5/6/18'>Deuteronomy 6:18</a>",
      "comment": "Obedience is again central—doing what is 'pleasing in His sight' recalls the theme of living faith with works, which is foundational for a holy life (<a href='/AIV/59/2/24'>James 2:24</a>)."
    },
    {
      "pk": 17014006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 6,
      "text": "\"For those who act in truth will prosper in all their works. To all who practice righteousness, give generously from your possessions, and do not be afraid.\"",
      "links": "<a href='/AIV/19/112/5'>Psalm 112:5</a>; <a href='/AIV/17/12/8-9'>Tobit 12:8-9</a>",
      "comment": "Giving alms is stressed, connected directly with prosperity and spiritual benefit. This anticipates the teaching of Jesus on storing up treasure in heaven (<a href='/AIV/40/6/19-21'>Matthew 6:19-21</a>), and the spiritual power of charity."
    },
    {
      "pk": 17014007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 7,
      "text": "\"You will see their destruction and bury them. Now, my child, endure patiently, for God will surely punish those who commit injustice, and all the works of their pride will be brought down to the ground. Then righteousness will flourish like a garden of peace, and the faithful will rejoice for ever.\"",
      "links": "<a href='/AIV/23/32/17'>Isaiah 32:17</a>; <a href='/AIV/19/92/12'>Psalm 92:12</a>",
      "comment": "An eschatological vision appears here—the triumph of righteousness, the flourishing of the faithful. This points to the promise of ultimate justice and lasting joy for those who persevere, a hope deepened by New Testament revelations (<a href='/AIV/66/21/4'>Revelation 21:4</a>)."
    },
    {
      "pk": 17014008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 8,
      "text": "\"You, therefore, my son, and your children, depart from here and remain no longer. See what Nineveh has done to my people and all that Nadab did to Ahiqar. Nineveh, where we suffer, will be punished and destroyed; at the appointed time all will be vindicated.\"",
      "links": "<a href='/AIV/32/3/4'>Jonah 3:4</a>; <a href='/AIV/34/1/8'>Nahum 1:8</a>",
      "comment": "Nineveh's destruction as foretold is a reminder of the certainty of God's justice. The reference to family endurance and vindication links to the theme of trusting God's timing."
    },
    {
      "pk": 17014009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 9,
      "text": "After he had spoken these things, Tobit died in peace at the age of one hundred and twelve, and was buried honorably at Nineveh.",
      "links": "<a href='/AIV/17/7/7'>Tobit 7:7</a>; <a href='/AIV/1/25/8'>Genesis 25:8</a>",
      "comment": "Dying 'in peace' with an 'honorable' burial is a sign of divine favor and faithful life, recalling the deaths of patriarchs such as Abraham. The number 112 is specific in later traditions; the Septuagint says 102. Main meaning remains: long life as seen as a reward for faithfulness."
    },
    {
      "pk": 17014010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 10,
      "text": "Tobias carried out his father's instructions, together with Anna his mother. He departed for Media and lived there, he and his wife and children.",
      "links": "<a href='/AIV/17/10/10-11'>Tobit 10:10-11</a>",
      "comment": "Tobias' obedience to his father is commended. Attentiveness to the wisdom of elders is a recurring virtue throughout Scripture (compare <a href='/AIV/2/20/12'>Exodus 20:12</a>)."
    },
    {
      "pk": 17014011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 11,
      "text": "He buried his father and mother honorably. He inherited their possessions and those of his father-in-law, Raguel.",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/4/6/16'>Numbers 6:16</a>",
      "comment": "Inheritance of possessions following honorable burial reaffirms the importance of family duties and generational blessing. Burial rites and inheritance law are deeply rooted throughout the Old Testament."
    },
    {
      "pk": 17014012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 12,
      "text": "He lived in Media until his death, at the age of one hundred and seventeen years.",
      "links": "<a href='/AIV/17/1/4'>Tobit 1:4</a>",
      "comment": "Longevity is again highlighted as a sign of living in righteousness and God's favor."
    },
    {
      "pk": 17014013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 13,
      "text": "But before he died, he heard about the destruction of Nineveh, which Nebuchadnezzar and Ahasuerus took captive. He rejoiced over Nineveh’s downfall and over the deliverance of Media.",
      "links": "<a href='/AIV/34/3/7'>Nahum 3:7</a>; <a href='/AIV/27/5/31'>Daniel 5:31</a>",
      "comment": "Hearing of Nineveh’s fall and Media’s deliverance shows the fulfillment of prophetic warnings. Joy over God’s justice is a key theme, paralleling the biblical exultation at the vindication of the oppressed (<a href='/AIV/19/58/10'>Psalm 58:10</a>)."
    },
    {
      "pk": 17014014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 14,
      "text": "He praised the Lord God for all things and blessed Him as long as he lived.",
      "links": "<a href='/AIV/19/34/1'>Psalm 34:1</a>",
      "comment": "A life marked by thanksgiving and blessing God mirrors the call to constant praise found throughout both Old and New Testaments (<a href='/AIV/52/5/18'>1 Thessalonians 5:18</a>)."
    },
    {
      "pk": 17014015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 14,
      "verse": 15,
      "text": "So, he died with honor. All his family and descendants remained faithful and lived a good life, and they were buried with him in Media. And Tobias inherited his house, as did his descendants.",
      "links": "<a href='/AIV/17/1/20'>Tobit 1:20</a>; <a href='/AIV/1/25/8'>Genesis 25:8</a>",
      "comment": "Faithful descendants and shared burial highlight the enduring power of legacy and tradition, sustaining the promises and blessings across generations. Spiritually, this points to the communion of the faithful and continuity in the one family of God, united in worship and righteousness."
    }
  ],
  "translatedAt": "2025-12-24T04:59:55.282Z"
}