{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 2,
  "verses": [
    {
      "pk": 17002001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 1,
      "text": "Afterward, during the feast of Pentecost, which is the holy festival of Weeks, I cooked a meal and sat down to eat.",
      "links": "<a href='/AIV/3/23/15-21'>Lev. 23:15-21</a>; <a href='/AIV/2/34/22'>Ex. 34:22</a>",
      "comment": "The reference to the festival of Weeks (Pentecost) connects Tobit's devotion to the ancient law, affirming the continuity of God's covenant. The tradition of celebrating feasts ties believers together across generations, foreshadowing the greater fulfillment found in Christ (Acts 2:1-4)."
    },
    {
      "pk": 17002002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 2,
      "text": "As I saw many hungry Israelites, I said to my son, 'Go, bring some of our kin who are faithful and in need, so that they may share this meal with me.'",
      "links": "<a href='/AIV/5/15/7'>Deut. 15:7</a>; <a href='/AIV/20/19/17'>Prov. 19:17</a>",
      "comment": "Tobit's invitation shows charity rooted in the law, a virtue advanced by Christ who commanded care for the poor (Matt. 25:35-40). Sharing with the needy is a spiritual act of mercy, reflecting the unity and communal character of the early Church."
    },
    {
      "pk": 17002003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 3,
      "text": "When my son returned, he said, 'Father, one of our people has been strangled and thrown into the marketplace.'",
      "links": "<a href='/AIV/11/21/16'>Judg. 21:16</a>; <a href='/AIV/19/79/3'>Ps. 79:3</a>",
      "comment": "The neglected dead reflect Israel's suffering in exile and the need for dignity even in death. This concern for the body expresses belief in bodily resurrection and hope, pointing to the physical care shown in Christ's burial (Matt. 27:59-60)."
    },
    {
      "pk": 17002004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 4,
      "text": "I immediately rose from the meal, left the food untouched, and took the body from the marketplace. I laid it in a room until sunset so I could bury it.",
      "links": "<a href='/AIV/3/19/17'>Lev. 19:17</a>; <a href='/AIV/41/15/46'>Mark 15:46</a>",
      "comment": "Interrupting his feast, Tobit prioritizes mercy and the law, echoing Christ’s teaching of mercy over ritual (Matt. 9:13). Gathering the body prefigures Christian concern for burial and resurrection, bearing the marks of self-giving sacrifice."
    },
    {
      "pk": 17002005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 5,
      "text": "When sunset had come, I went out and buried him.",
      "links": "<a href='/AIV/5/21/23'>Deut. 21:23</a>; <a href='/AIV/42/23/53'>Luke 23:53</a>",
      "comment": "Tobit's care to bury at sunset fulfills Deuteronomic law, showing respect for God's command and the dignity of the body—an early sign of hope in the resurrection (John 5:28-29)."
    },
    {
      "pk": 17002006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 6,
      "text": "My neighbors mocked me, saying, 'He would rather be killed for this than flee.'",
      "links": "<a href='/AIV/19/44/22'>Ps. 44:22</a>; <a href='/AIV/40/5/11'>Matt. 5:11</a>",
      "comment": "Mockery for righteousness is a theme throughout Scripture, culminating in Christ's suffering. The willingness to endure ridicule for charity and obedience foreshadows blessedness in persecution (Matt. 5:12)."
    },
    {
      "pk": 17002007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 7,
      "text": "That night, after I buried him, I came home, washed myself, and lay down by the wall of the courtyard, leaving my face uncovered because I was defiled.",
      "links": "<a href='/AIV/3/11/24-25'>Lev. 11:24-25</a>; <a href='/AIV/20/28/13'>Prov. 28:13</a>",
      "comment": "Tobit’s purification and humility reveal trust in God's law and a recognition of human frailty. His actions point ahead to Christian practices of confession and purification."
    },
    {
      "pk": 17002008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 8,
      "text": "But I did not know there were sparrows on the wall. Their droppings fell into my eyes, then I developed white spots and became blind.",
      "links": "<a href='/AIV/19/38/10-14'>Ps. 38:10-14</a>; <a href='/AIV/43/9/1-7'>John 9:1-7</a>",
      "comment": "Physical affliction after an act of mercy illustrates the mysterious ways in which suffering can follow righteousness (see Job). Note the parallel to Jesus' healing of the blind, where physical darkness leads to a greater revelation of faith."
    },
    {
      "pk": 17002009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 9,
      "text": "For four years I was unable to see. All my family was grieved, and Ahikar cared for me for two years, until he went to Elymais.",
      "links": "<a href='/AIV/19/22/14'>Ps. 22:14</a>; <a href='/AIV/44/9/8'>Acts 9:8</a>",
      "comment": "Tobit's blindness evokes themes of suffering, patience, and reliance on the community for help—an early sign of the Church as a body ministering to its members (1 Cor. 12:25-26)."
    },
    {
      "pk": 17002010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 10,
      "text": "During that time, my wife Anna supported the household by spinning wool.",
      "links": "<a href='/AIV/20/31/10-13'>Prov. 31:10-13</a>; <a href='/AIV/4/14/23'>Num. 14:23</a>",
      "comment": "Anna’s diligent support recalls the virtuous woman praised in Proverbs. The inclusion of her labor shows the mutual support and dignity of family life set forth by God."
    },
    {
      "pk": 17002011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 11,
      "text": "She would deliver what she made to the owners, and they would pay her wages.",
      "links": "<a href='/AIV/20/31/24'>Prov. 31:24</a>; <a href='/AIV/3/19/13'>Lev. 19:13</a>",
      "comment": "Honest work and just wages are emphasized as enduring values, upheld later by apostolic teaching (1 Thess. 4:11–12)."
    },
    {
      "pk": 17002012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 12,
      "text": "On the seventh day, she finished spinning and delivered the cloth. They gave her her wages and also a young goat.",
      "links": "<a href='/AIV/3/23/12'>Lev. 23:12</a>; <a href='/AIV/26/45/17'>Ezek. 45:17</a>",
      "comment": "The mention of the seventh day and gift of a goat highlights the connection to offerings and ritual purity, showing how daily life was intertwined with honoring God."
    },
    {
      "pk": 17002013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 13,
      "text": "But when she came home, the goat began to bleat. I said to her, 'Where did you get this goat? Is it stolen? Return it to the owners, for we must not eat anything unlawfully taken.'",
      "links": "<a href='/AIV/2/20/15'>Ex. 20:15</a>; <a href='/AIV/3/19/11'>Lev. 19:11</a>",
      "comment": "Tobit's insistence on justice and honesty in even the smallest matter reiterates holiness in daily living. The integrity signaled here speaks to a sacramental view where even the ordinary is consecrated."
    },
    {
      "pk": 17002014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 2,
      "verse": 14,
      "text": "But she replied, 'It was given to me as a bonus.' Yet I did not believe her, and told her to return it to the owners. I was ashamed of her. She said, 'Where are your acts of charity? Where are your righteous deeds? Everyone knows what you've done.'",
      "links": "<a href='/AIV/20/19/17'>Prov. 19:17</a>; <a href='/AIV/40/6/1-4'>Matt. 6:1-4</a>",
      "comment": "Anna’s defense highlights recognition of good deeds among the community. Authentic righteousness is known by fruit, as Christ taught (Matt. 7:16). Personal conflict teaches humility and the reality of virtue practiced in hidden ways."
    }
  ],
  "translatedAt": "2025-12-24T04:54:40.628Z"
}