{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 7,
  "verses": [
    {
      "pk": 17007001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 1,
      "text": "When they entered Ecbatana, Tobias said, 'Brother Azariah, lead me straight to the house of Raguel.' So he brought him to Raguel's house, and they found him sitting at the door of the courtyard. They greeted him first, and he replied, 'Greetings to you, brothers. Welcome!' He invited them into his house.",
      "links": "<a href='/AIV/01/18/1'>Gen. 18:1</a>; <a href='/AIV/58/13/2'>Heb. 13:2</a>",
      "comment": "The emphasis on hospitality here echoes Abraham’s encounter in Genesis 18, and later Christian teaching on welcoming strangers. Raguel’s opening of his home recalls the call to charity and openness to God's messengers."
    },
    {
      "pk": 17007002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 2,
      "text": "Raguel said to Edna his wife, 'How much this young man resembles my cousin Tobit!'",
      "links": "<a href='/AIV/06/22/14'>Josh. 22:14</a>;",
      "comment": "Family resemblances are important in ancient cultures for recognition and kinship. Note that Edna is named, which highlights the role of women in the household."
    },
    {
      "pk": 17007003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 3,
      "text": "Raguel asked them, 'Where do you come from, brothers?' They replied, 'We are sons of Naphtali, taken captive in Nineveh.'",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>",
      "comment": "Their identity as exiles from Naphtali roots their story in Israel’s history under Assyrian captivity, connecting the personal narrative to larger salvation history."
    },
    {
      "pk": 17007004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 4,
      "text": "Raguel said, 'So you know Tobit, our kinsman?' They answered, 'Yes, we know him.'",
      "links": "<a href='/AIV/17/1/1'>Tob. 1:1</a>",
      "comment": "Recognition among the dispersed Israelites links the faithfulness of God’s covenant people, even outside the Promised Land."
    },
    {
      "pk": 17007005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 5,
      "text": "Raguel said, 'He is my cousin. What is his health? Is he well?' They replied, 'He is alive and well.' Then Tobias added, 'He is my father.'",
      "links": "<a href='/AIV/17/5/1'>Tob. 5:1</a>",
      "comment": "This direct link reveals the nearness of the family. In biblical tradition, the well-being of one’s relatives is cherished (see 3 John 1:2)."
    },
    {
      "pk": 17007006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 6,
      "text": "Raguel jumped up and embraced Tobias and wept. He said, 'Blessings on you, my child, son of a good and noble father!' When he heard that Tobit had lost his sight, he was grieved and wept.",
      "links": "<a href='/AIV/20/10/1'>Prov. 10:1</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Physical gestures—embrace, tears—show the strength of family bonds. Note the blessing given over Tobias, reflecting a tradition of imparting spiritual well-being through spoken blessing."
    },
    {
      "pk": 17007007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 7,
      "text": "Edna, his wife, and Sarah, his daughter, wept with him. They welcomed them warmly.",
      "links": "<a href='/AIV/17/11/19'>Tob. 11:19</a>",
      "comment": "Notice the shared sorrow and joyful welcome by the women of the house. This mirrors New Testament depictions of love and compassion in the community of believers (see John 11:35)."
    },
    {
      "pk": 17007008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 8,
      "text": "Then they slaughtered a ram from the flock and set the table for them. Tobias said to Raphael, 'Brother Azariah, speak about what you told me on the journey regarding the matter.'",
      "links": "<a href='/AIV/17/6/12'>Tob. 6:12</a>; <a href='/AIV/01/18/7'>Gen. 18:7</a>",
      "comment": "Sharing a meal after a sacrificial offering reflects the Old Testament model of covenant fellowship (see Exodus 24:11). Food and sacrifice prefigure the deeper sacramental meals that mark faith communities."
    },
    {
      "pk": 17007009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 9,
      "text": "Raguel said, 'Speak, my child.' So Tobias said, 'Raguel, I wish to marry your daughter Sarah. I will not marry anyone else except her. I am your relative.'",
      "links": "<a href='/AIV/06/27/4'>Josh. 27:4</a>; <a href='/AIV/04/36/6'>Num. 36:6</a>",
      "comment": "Marriage within the broader family ensured the preservation of inheritance and faith. The faithfulness of Tobias in seeking this arrangement underlines both obedience and the sanctity of marriage as a divine ordinance."
    },
    {
      "pk": 17007010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 10,
      "text": "But Raguel replied, 'My child, I must tell you the truth. I have given her to seven men from among our relatives, and all of them died the night they approached her. But for now, rejoice.'",
      "links": "<a href='/AIV/17/3/8'>Tob. 3:8</a>",
      "comment": "Raguel’s honesty and sorrow point to the mysterious suffering of Sarah. The motif of seven unsuccessful suitors recalls God’s sovereignty even amid repeated tragedy."
    },
    {
      "pk": 17007011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 11,
      "text": "But Tobias said, 'I will marry her despite this. I am not afraid, for she is appointed to me since the beginning. You yourself will see that your daughter will be safe and unharmed.'",
      "links": "<a href='/AIV/17/6/17'>Tob. 6:17</a>; <a href='/AIV/23/46/10'>Isa. 46:10</a>",
      "comment": "Tobias’ confidence in divine providence and destiny shows trust in God’s sovereign plan (cf. Ephesians 1:11). The idea of marriage being divinely appointed from the beginning resonates with the Christian view of God’s hand in matrimony."
    },
    {
      "pk": 17007012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 12,
      "text": "Then Raguel said, 'She is yours according to the decree written in the Book of Moses. Heaven itself decrees she will be yours. Accept her, take her, and bring her safely to your father's house. May the God of heaven grant you prosperity.'",
      "links": "<a href='/AIV/05/24/1'>Deut. 24:1</a>; <a href='/AIV/01/2/24'>Gen. 2:24</a>",
      "comment": "Raguel’s reference to the Book of Moses and 'Heaven decrees' highlights marriage as a sacred covenant in accordance with divine law. This line also subtly affirms the authority of written Scripture and tradition in matters of faith."
    },
    {
      "pk": 17007013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 13,
      "text": "He called his daughter Sarah over to him. She came to him, and he took her hand and gave her to Tobias. He said, 'Take her according to the law and judgment written in the Book of Moses, and take her with you to your father’s house.' Then he blessed them.",
      "links": "<a href='/AIV/01/24/67'>Gen. 24:67</a>; <a href='/AIV/01/2/24'>Gen. 2:24</a>",
      "comment": "Marriage is enacted with a blessing and the public holding of hands, signifying solemn covenant. The law and blessing structure points to the ceremonial aspects found later in Christian matrimonial practice."
    },
    {
      "pk": 17007014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 14,
      "text": "Edna said to Tobias, 'My brother, may the Lord of heaven bring you back in joy and grant me to see your children from Sarah, my daughter, so that before I die, I may rejoice in your company.' Then they all wept together.",
      "links": "<a href='/AIV/19/128/6'>Psalm 128:6</a>; <a href='/AIV/42/2/36'>Luke 2:36</a>",
      "comment": "Edna’s prayer joins the hope of generations and family blessing, which is a strong theme in biblical promises (see Psalm 128). The emotional response reveals the seriousness of family unity."
    },
    {
      "pk": 17007015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 15,
      "text": "Afterward, Raguel slaughtered a ram and welcomed them as guests. They feasted.",
      "links": "<a href='/AIV/01/18/7'>Gen. 18:7</a>; <a href='/AIV/42/15/23'>Luke 15:23</a>",
      "comment": "Sacrificial feasting at moments of covenant echoes both Abraham’s hospitality and the parable of the prodigal son. Meals are not just physical but spiritual acts of communion."
    },
    {
      "pk": 17007016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 16,
      "text": "Raguel called his wife Edna and said, 'Sister, prepare the other room and take her there.'",
      "links": "<a href='/AIV/17/8/1'>Tob. 8:1</a>",
      "comment": "The preparation for the couple’s first night together is described with both tenderness and piety, reflecting the seriousness and sacramental significance of marriage."
    },
    {
      "pk": 17007017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 7,
      "verse": 17,
      "text": "So she went and made the room ready, just as Raguel told her. She brought Sarah there, and she wept for her daughter. Then Edna wiped away her tears and said, 'Take courage, my child. May the Lord of heaven exchange your sorrow for joy. Take courage, my daughter.'",
      "links": "<a href='/AIV/23/61/3'>Isa. 61:3</a>; <a href='/AIV/43/16/20'>John 16:20</a>",
      "comment": "Edna’s motherly comfort points to themes of hope and restoration emphasized throughout the Bible, culminating in the promise that God turns mourning into joy (see Isaiah 61:3, John 16:20)."
    }
  ],
  "translatedAt": "2025-12-24T04:57:06.586Z"
}