{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 6,
  "verses": [
    {
      "pk": 17006001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 1,
      "text": "As they continued on their way, they came near the river Tigris. The young man went down to wash his feet in the river, and suddenly a large fish leapt out of the water and tried to bite him.",
      "links": "<a href='/AIV/01/7/10'>Gen. 7:10</a>; <a href='/AIV/04/21/7-9'>Num. 21:7-9</a>",
      "comment": "The story transitions to Tobias' journey, introducing the river Tigris and the miraculous fish, prefiguring later biblical events where water is a source of both danger and salvation (e.g., Jonah—Jon. 1:17)."
    },
    {
      "pk": 17006002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 2,
      "text": "The angel said to him, 'Catch the fish!' So Tobias grabbed the fish and pulled it up onto the bank.",
      "links": "<a href='/AIV/19/104/26'>Ps. 104:26</a>; <a href='/AIV/40/17/27'>Matt. 17:27</a>",
      "comment": "Divine guidance is evident as the angel instructs Tobias. There is a parallel to the role of angels as protectors and guides, seen throughout Scripture."
    },
    {
      "pk": 17006003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 3,
      "text": "Then the angel said, 'Open the fish and take out its heart, liver, and gall. Keep them safe.' So Tobias did as he was told.",
      "links": "<a href='/AIV/03/9/9-10'>Lev. 9:9-10</a>",
      "comment": "The act of setting aside specific organs for a sacred purpose foreshadows the biblical principle of sanctifying parts of creation for healing, sacrifice, and worship."
    },
    {
      "pk": 17006004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 4,
      "text": "The angel told him, 'The heart, liver, and gall of the fish can be used as medicine. The heart and liver can drive away evil spirits if burned before a man or woman afflicted by such a spirit, and the gall can be used to cure blindness.'",
      "links": "<a href='/AIV/02/15/26'>Ex. 15:26</a>; <a href='/AIV/41/9/25'>Mark 9:25</a>; <a href='/AIV/09/16/23'>1 Sam. 16:23</a>",
      "comment": "This verse underscores sacramental elements—physical substances used as instruments of God’s healing and protection. It prefigures the principle of outward signs carrying spiritual power, seen in various traditions related to healing and exorcism."
    },
    {
      "pk": 17006005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 5,
      "text": "Tobias asked the angel, 'Why must we keep these things?'",
      "links": "<a href='/AIV/01/18/22'>Gen. 18:22</a>",
      "comment": "Seeking further understanding mirrors the biblical motif of questioning divine instruction, which is answered through revelation."
    },
    {
      "pk": 17006006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 6,
      "text": "The angel replied, 'As I said, burning the heart and liver in the presence of someone afflicted by a demon or evil spirit will cause it to flee, never to return.'",
      "links": "<a href='/AIV/40/8/16'>Matt. 8:16</a>; <a href='/AIV/41/1/27'>Mark 1:27</a>",
      "comment": "Notice the clear spiritual authority demonstrated—the use of tangible means to expel evil. This resonates with later sacramental rites of blessing and exorcism, connecting physical action to spiritual effect."
    },
    {
      "pk": 17006007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 7,
      "text": "'As for the gall, apply it to a person’s eyes who is blinded, and it will heal them.'",
      "links": "<a href='/AIV/43/9/6-7'>John 9:6-7</a>; <a href='/AIV/19/146/8'>Ps. 146:8</a>",
      "comment": "The use of the gall to cure blindness is a sign of God’s healing power mediated through creation, anticipating Christ’s healing of the blind."
    },
    {
      "pk": 17006008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 8,
      "text": "After they had traveled two days from Nineveh, they stopped for the night near Ecbatana.",
      "links": "<a href='/AIV/17/1/2'>Esther 1:2</a>",
      "comment": "Geographical detail situates the narrative in historical context, connecting the reader to the reality of ancient Assyrian and Median cities."
    },
    {
      "pk": 17006009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 9,
      "text": "Raphael said to Tobias, 'Brother, tonight we will stay with Raguel; he is your relative, and he has a daughter named Sarah.'",
      "links": "<a href='/AIV/08/3/9'>Ruth 3:9</a>",
      "comment": "Familial relationships underscore themes of providence, kinship, and the God-ordained nature of marriage, echoed throughout biblical history."
    },
    {
      "pk": 17006010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 10,
      "text": "'She is the only child of her father, and you have the right, above all others, to marry her and inherit her father's property.'",
      "links": "<a href='/AIV/04/27/8'>Num. 27:8</a>; <a href='/AIV/08/4/5-10'>Ruth 4:5-10</a>",
      "comment": "The right of inheritance highlights God’s concern for family lines, inheritance, and the institution of marriage."
    },
    {
      "pk": 17006011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 11,
      "text": "Tobias replied, 'I have heard that she has already been married to seven husbands, who all died on the wedding night. I have also heard that a demon killed them.'",
      "links": "<a href='/AIV/17/3/8'>Tob. 3:8</a>",
      "comment": "Tobias’ fear is based on the tragic history of Sarah, which sets up a powerful narrative of deliverance from evil through faith and divine intervention."
    },
    {
      "pk": 17006012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 12,
      "text": "'I am afraid that the demon will harm me, too, since he loves her and does not let her have a husband.'",
      "links": "<a href='/AIV/09/18/10'>1 Sam. 18:10</a>",
      "comment": "The presence of evil spirits in the narrative is a reminder of spiritual realities, which are overcome by obedience to God’s method for protection."
    },
    {
      "pk": 17006013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 13,
      "text": "The angel said to Tobias, 'Remember my words: When you go into the bridal chamber, take part of the fish’s heart and liver, and burn them as incense. The demon will smell it and flee, and never return.'",
      "links": "<a href='/AIV/02/40/27-29'>Ex. 40:27-29</a>; <a href='/AIV/04/16/46'>Num. 16:46</a>",
      "comment": "The burning of incense recalls ancient liturgical practices; the connection between physical elements, intercession, and spiritual deliverance is significant for understanding sacramental theology."
    },
    {
      "pk": 17006014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 14,
      "text": "'Before you approach her, both of you should pray to the Lord, asking Him to show mercy and protect you. Do not be afraid. She was meant for you since the beginning, and you will save her.'",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/20/8/17'>Prov. 8:17</a>; <a href='/AIV/40/19/6'>Matt. 19:6</a>",
      "comment": "Prayer before marriage emphasizes dependence on God and the Divine ordering of human unions, emphasizing providence and vocation in sharing our lives."
    },
    {
      "pk": 17006015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 15,
      "text": "'She will go with you, and I believe you will have children by her, who will be a blessing to you. Do not worry.'",
      "links": "<a href='/AIV/01/17/19'>Gen. 17:19</a>; <a href='/AIV/19/128/3'>Ps. 128:3</a>",
      "comment": "The promise of children and blessing connects marriage with fruitfulness, blessing, and divine favor as revealed in the covenantal promises throughout Scripture."
    },
    {
      "pk": 17006016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 16,
      "text": "When Tobias heard Raphael’s words and learned about Sarah, he loved her deeply, and his heart was drawn to her.",
      "links": "<a href='/AIV/01/29/18-20'>Gen. 29:18-20</a>",
      "comment": "Authentic love develops as Tobias listens to divine wisdom; it highlights love as a vocation and the work of grace in the human heart."
    },
    {
      "pk": 17006017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 17,
      "text": "They continued on their journey until they reached Ecbatana.",
      "links": "<a href='/AIV/17/1/1'>Tob. 1:1</a>",
      "comment": "The movement toward the fulfillment of God’s plan continues, emphasizing pilgrimage, obedience, and trust in divine providence."
    },
    {
      "pk": 17006018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 6,
      "verse": 18,
      "text": "Tobias said, 'Blessed are You, O God of our ancestors!' And the journey brought them within sight of Raguel’s home.",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>; <a href='/AIV/17/7/18'>Tob. 7:18</a>",
      "comment": "Blessing God before entering the fulfillment of His promise models thanksgiving and reverence. This verse subtly points to the ongoing dialogue between God and those who trust in His plans, inviting readers into a deeper relationship rooted in tradition and sacramental living."
    }
  ],
  "translatedAt": "2025-12-24T04:56:37.046Z"
}