{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 10,
  "verses": [
    {
      "pk": 6010001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 1,
      "text": "Now when Adoni-zedek, king of Jerusalem, heard that Joshua had captured Ai and had devoted it to destruction—as he had done to Jericho and its king, so he had done to Ai and its king—and that the inhabitants of Gibeon had made peace with Israel and were living among them,",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>; <a href='/AIV/6/8/26-29'>Josh. 8:26-29</a>",
      "comment": "Adoni-zedek is the king of Jerusalem, foreshadowing the later importance of Jerusalem in salvation history. Note the theme of utter devotion to God and the special status of Israelite agreements."
    },
    {
      "pk": 6010002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 2,
      "text": "he and his people were greatly afraid, because Gibeon was a great city—like one of the royal cities—greater than Ai, and all its men were mighty.",
      "links": "<a href='/AIV/6/9/3,17'>Josh. 9:3,17</a>",
      "comment": "The fear of the Canaanites foreshadows God's plan of salvation: the mightiest powers will be made subject to His will, through covenant and authority."
    },
    {
      "pk": 6010003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 3,
      "text": "So Adoni-zedek king of Jerusalem sent to Hoham king of Hebron, Piram king of Jarmuth, Japhia king of Lachish, and Debir king of Eglon, saying,",
      "links": "<a href='/AIV/6/12/10-13'>Josh. 12:10-13</a>",
      "comment": "This alliance of kings echoes the later gathering of powers against God's chosen people, paralleling spiritual warfare against the Church."
    },
    {
      "pk": 6010004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 4,
      "text": "\"Come up to me and help me, and let us attack Gibeon; for it has made peace with Joshua and with the people of Israel.\"",
      "links": "<a href='/AIV/6/9/15'>Josh. 9:15</a>",
      "comment": "The attack on Gibeon, now allied to Israel, shows the hostility of the world toward those who enter God’s covenant. It also foreshadows Christ’s warning about persecution against the faithful."
    },
    {
      "pk": 6010005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 5,
      "text": "Then the five kings of the Amorites—the kings of Jerusalem, Hebron, Jarmuth, Lachish, and Eglon—gathered their armies and went up with all their troops and camped against Gibeon and made war against it.",
      "links": "<a href='/AIV/6/10/3'>Josh. 10:3</a>",
      "comment": "A united front of kings attacks God’s covenant people, foreshadowing later oppositions to God's singular plan of salvation."
    },
    {
      "pk": 6010006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 6,
      "text": "And the men of Gibeon sent to Joshua at the camp in Gilgal, saying, \"Do not abandon your servants! Come up to us quickly and save us! Help us, for all the kings of the Amorites who live in the hill country have gathered against us.\"",
      "links": "<a href='/AIV/6/9/15'>Josh. 9:15</a>; <a href='/AIV/6/5/10'>Josh. 5:10</a>",
      "comment": "Calling to Joshua for deliverance foreshadows intercessory pleas to those whom God appoints as human leaders and mediators."
    },
    {
      "pk": 6010007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 7,
      "text": "So Joshua went up from Gilgal, he and all the people of war with him, and all the mighty men of valor.",
      "links": "<a href='/AIV/6/8/1'>Josh. 8:1</a>",
      "comment": "Joshua leads all Israel for the sake of the covenant allies, prefiguring the Good Shepherd who defends His flock."
    },
    {
      "pk": 6010008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 8,
      "text": "And the LORD said to Joshua, \"Do not be afraid of them, for I have handed them over to you; not one of them shall stand before you.\"",
      "links": "<a href='/AIV/5/2/25'>Deut. 2:25</a>; <a href='/AIV/6/1/5'>Josh. 1:5</a>",
      "comment": "A direct divine promise assures victory, pointing to Christ’s assurance to His Church that the gates of hell shall not prevail against it (<a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 6010009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 9,
      "text": "So Joshua came upon them suddenly, having marched up all night from Gilgal.",
      "links": "<a href='/AIV/7/7/16-20'>Judg. 7:16-20</a>",
      "comment": "The surprise attack is only possible through God's guidance and is a testament to human cooperation with divine initiative."
    },
    {
      "pk": 6010010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 10,
      "text": "And the LORD threw them into confusion before Israel, and He struck them with a great slaughter at Gibeon, and pursued them by the way of the ascent of Beth-horon, and struck them as far as Azekah and Makkedah.",
      "links": "<a href='/AIV/2/14/24'>Exod. 14:24</a>; <a href='/AIV/5/7/23'>Deut. 7:23</a>",
      "comment": "God fights for Israel by sowing confusion among enemies, revealing the supremacy of divine action in spiritual battles against evil."
    },
    {
      "pk": 6010011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 11,
      "text": "As they fled before Israel, while they were going down the ascent of Beth-horon, the LORD threw down large hailstones from heaven on them as far as Azekah, and they died—more died from the hailstones than those whom the Israelites killed with the sword.",
      "links": "<a href='/AIV/2/9/23'>Exod. 9:23</a>; <a href='/AIV/19/18/13-14'>Ps. 18:13-14</a>",
      "comment": "God’s direct intervention, even more deadly than Israel's efforts, shows that ultimate victory belongs to the Lord and His means are above human power."
    },
    {
      "pk": 6010012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 12,
      "text": "Then Joshua spoke to the LORD in the sight of Israel, and he said, \"Sun, stand still at Gibeon, and moon, in the Valley of Aijalon!\"",
      "links": "<a href='/AIV/35/3/11'>Hab. 3:11</a>",
      "comment": "Joshua’s prayer stops the sun and moon, indicating mankind’s role as intercessors who, when aligned with God’s will, may participate in miraculous works."
    },
    {
      "pk": 6010013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 13,
      "text": "And the sun stood still, and the moon stopped, until the nation avenged themselves upon their enemies. Is this not written in the Book of Jashar? The sun stopped in the midst of heaven and did not hurry to set for about a whole day.",
      "links": "<a href='/AIV/6/10/12'>Josh. 10:12</a>; <a href='/AIV/9/1/18'>2 Sam. 1:18</a>",
      "comment": "God’s supernatural control of creation at the prayer of a righteous leader recalls other biblical wonders, like the resurrection and the authority given to the apostles."
    },
    {
      "pk": 6010014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 14,
      "text": "There has been no day like it before or since, when the LORD listened to the voice of a man; for the LORD fought for Israel.",
      "links": "<a href='/AIV/5/3/22'>Deut. 3:22</a>",
      "comment": "The LORD’s unique response to Joshua’s prayer emphasizes the special authority and priestly role God invested in His chosen leaders."
    },
    {
      "pk": 6010015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 15,
      "text": "Then Joshua and all Israel with him returned to the camp at Gilgal.",
      "links": "<a href='/AIV/6/5/10'>Josh. 5:10</a>",
      "comment": "Gilgal, the site of covenantal renewal, is repeatedly the rallying point, recalling the importance of sacred places and liturgical remembrance."
    },
    {
      "pk": 6010016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 16,
      "text": "But those five kings fled and hid themselves in the cave at Makkedah.",
      "links": "<a href='/AIV/6/10/3-5'>Josh. 10:3-5</a>",
      "comment": "Even earthly rulers cannot escape divine justice, and their hiding foreshadows the final futility of resistance to God’s kingship."
    },
    {
      "pk": 6010017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 17,
      "text": "And it was told to Joshua, \"The five kings have been found, hidden in the cave at Makkedah.\"",
      "links": "<a href='/AIV/6/10/16'>Josh. 10:16</a>",
      "comment": "The discovery of the kings reveals the comprehensive nature of God’s victory."
    },
    {
      "pk": 6010018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 18,
      "text": "And Joshua said, \"Roll large stones against the mouth of the cave, and set men by it to guard them,",
      "links": "<a href='/AIV/27/6/17'>Dan. 6:17</a>; <a href='/AIV/40/27/66'>Matt. 27:66</a>",
      "comment": "Sealing the cave reminds readers of other events where stones and caves play a role in divine deliverance or judgment (see Daniel in the lions’ den, the tomb of Christ)."
    },
    {
      "pk": 6010019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 19,
      "text": "\"but do not stay there yourselves; pursue your enemies, and attack them from behind. Do not let them enter their cities, for the LORD your God has delivered them into your hand.\"",
      "links": "<a href='/AIV/6/8/7'>Josh. 8:7</a>",
      "comment": "Joshua prioritizes fulfilling God’s command, echoing the later call to spiritual vigilance and perseverance."
    },
    {
      "pk": 6010020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 20,
      "text": "When Joshua and the sons of Israel had finished striking them with a very great slaughter, until they were destroyed, and the survivors who remained of them had entered the fortified cities,",
      "links": "<a href='/AIV/5/7/2'>Deut. 7:2</a>",
      "comment": "Complete obedience to divine command is prominent here, reflecting the biblical theme that God’s people must be fully faithful even when not all seems visible."
    },
    {
      "pk": 6010021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 21,
      "text": "Then all the people returned safe to Joshua at the camp at Makkedah. No one uttered a word against any of the sons of Israel.",
      "links": "<a href='/AIV/2/11/7'>Exod. 11:7</a>",
      "comment": "Divine protection results not only in victory but also in silence and awe among the nations—pointing to the fear of God accompanying His visible works."
    },
    {
      "pk": 6010022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 22,
      "text": "Then Joshua said, \"Open the mouth of the cave and bring those five kings out to me from the cave.\"",
      "links": "<a href='/AIV/6/10/16-17'>Josh. 10:16-17</a>",
      "comment": "Judgment falls in public, mirroring the visible justice of God established through His chosen leaders."
    },
    {
      "pk": 6010023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 23,
      "text": "So they brought those five kings out to him from the cave: the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon.",
      "links": "<a href='/AIV/6/10/3,5'>Josh. 10:3,5</a>",
      "comment": "The repeated mention of their names underscores the specificity and completeness of God’s justice."
    },
    {
      "pk": 6010024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 24,
      "text": "And when they brought those kings to Joshua, Joshua called all the men of Israel and said to the chiefs of the men of war who had gone with him, \"Come near; put your feet on the necks of these kings.\" So they came near and put their feet on their necks.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/45/16/20'>Rom. 16:20</a>",
      "comment": "Putting feet on the necks symbolizes total victory—echoed in Psalm 110:1, which Christians understand as a prophecy about Christ’s ultimate triumph."
    },
    {
      "pk": 6010025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 25,
      "text": "And Joshua said to them, \"Do not be afraid or dismayed; be strong and courageous. For thus the LORD will do to all your enemies against whom you fight.\"",
      "links": "<a href='/AIV/5/31/6'>Deut. 31:6</a>; <a href='/AIV/6/1/9'>Josh. 1:9</a>",
      "comment": "The constant exhortation to courage recalls God’s support for His faithful and points forward to the Church’s mission in the world."
    },
    {
      "pk": 6010026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 26,
      "text": "Afterward Joshua struck them and put them to death, and he hanged them on five trees. And they hung on the trees until evening.",
      "links": "<a href='/AIV/5/21/22-23'>Deut. 21:22-23</a>",
      "comment": "Hanging the kings reflects the curse for those who oppose God, prefiguring Christ taking the curse upon Himself by being hanged on a tree (<a href='/AIV/48/3/13'>Gal. 3:13</a>)."
    },
    {
      "pk": 6010027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 27,
      "text": "But at the time of sunset Joshua commanded, and they took them down from the trees, and threw them into the cave where they had hidden themselves, and placed large stones at the mouth of the cave to remain until this very day.",
      "links": "<a href='/AIV/6/8/29'>Josh. 8:29</a>",
      "comment": "The removal and sealing with stones signify a final, public end; the motif of burial in a cave under stone reappears throughout Scripture, including Christ’s tomb."
    },
    {
      "pk": 6010028,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 28,
      "text": "Joshua captured Makkedah on that day, and struck it and its king with the edge of the sword. He utterly destroyed them and every living being in it; he left no survivor. And he did to the king of Makkedah as he had done to the king of Jericho.",
      "links": "<a href='/AIV/6/8/2,29'>Josh. 8:2,29</a>",
      "comment": "The total devotion to destruction highlights the severity of divine justice but also foreshadows the ultimate restoration and purification of creation."
    },
    {
      "pk": 6010029,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 29,
      "text": "Then Joshua and all Israel with him passed on from Makkedah to Libnah, and fought against Libnah.",
      "links": "<a href='/AIV/6/12/15'>Josh. 12:15</a>",
      "comment": "God’s command to continue the conquest reflects the progressive nature of sanctification; victory is not achieved all at once."
    },
    {
      "pk": 6010030,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 30,
      "text": "And the LORD gave it also and its king into the hand of Israel. He struck it with the edge of the sword, and every living being in it; he left no survivor. And he did to its king as he had done to the king of Jericho.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>; <a href='/AIV/6/8/29'>Josh. 8:29</a>",
      "comment": "God’s sovereignty in every battle shows He is Lord of both the spiritual and material realms."
    },
    {
      "pk": 6010031,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 31,
      "text": "And Joshua and all Israel with him passed on from Libnah to Lachish, and camped against it and fought against it.",
      "links": "<a href='/AIV/6/10/3,5'>Josh. 10:3,5</a>",
      "comment": "Relentless adherence to God’s instruction depicts the necessity of perseverance in faith."
    },
    {
      "pk": 6010032,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 32,
      "text": "And the LORD gave Lachish into the hand of Israel, and they captured it on the second day, and struck it with the edge of the sword and every living being in it, as he had done to Libnah.",
      "links": "<a href='/AIV/6/10/30'>Josh. 10:30</a>",
      "comment": "Notice that each victory comes by the LORD’s decision and according to His timing—He is the source of true unity and triumph."
    },
    {
      "pk": 6010033,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 33,
      "text": "Then Horam king of Gezer came up to help Lachish, and Joshua struck him and his people, until he left him no survivor.",
      "links": "<a href='/AIV/6/12/12'>Josh. 12:12</a>",
      "comment": "All opposition rises and falls according to God’s greater plan and justice."
    },
    {
      "pk": 6010034,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 34,
      "text": "Then Joshua and all Israel with him passed on from Lachish to Eglon, and they camped against it and fought against it.",
      "links": "<a href='/AIV/6/10/3,5'>Josh. 10:3,5</a>",
      "comment": "A steady advance shows that faithfulness in small tasks prepares for greater victories."
    },
    {
      "pk": 6010035,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 35,
      "text": "They captured it on that day, and struck it with the edge of the sword, and every living being in it he utterly destroyed that day, as he had done to Lachish.",
      "links": "<a href='/AIV/6/10/32'>Josh. 10:32</a>",
      "comment": "Utter destruction underlines the seriousness of remaining outside the divine covenant, urging us to seek God's mercy and inclusion in His plan."
    },
    {
      "pk": 6010036,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 36,
      "text": "Then Joshua and all Israel with him went up from Eglon to Hebron, and they fought against it.",
      "links": "<a href='/AIV/6/12/10'>Josh. 12:10</a>",
      "comment": "Hebron is an ancestral city, linking this conquest to the patriarchs and God’s previous promises."
    },
    {
      "pk": 6010037,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 37,
      "text": "They captured it and struck it with the edge of the sword, and its king and all its towns and every living being in it; he left no survivor, as he had done to Eglon, and devoted it to destruction and every living being in it.",
      "links": "<a href='/AIV/6/10/35'>Josh. 10:35</a>",
      "comment": "Like the judgment of Sodom (see Gen. 19), divine justice is complete but also preparatory for greater revelations of mercy ahead."
    },
    {
      "pk": 6010038,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 38,
      "text": "Then Joshua and all Israel with him turned back to Debir and fought against it.",
      "links": "<a href='/AIV/6/12/13'>Josh. 12:13</a>",
      "comment": "Each town’s conquest is a physical counterpart to spiritual conquest—driving out what opposes God’s rule from our hearts."
    },
    {
      "pk": 6010039,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 39,
      "text": "And he captured it and its king and all its towns, and they struck them with the edge of the sword and devoted to destruction every living being in it; he left no survivor. Just as he had done to Hebron and to Libnah and its king, so he did to Debir and its king.",
      "links": "<a href='/AIV/6/10/32,37'>Josh. 10:32,37</a>",
      "comment": "Consistency in following God’s command led to lasting victory, highlighting the need for full fidelity to God’s will."
    },
    {
      "pk": 6010040,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 40,
      "text": "So Joshua struck all the land, the hill country, the Negev, the lowland, and the slopes, and all their kings; he left no survivor, but devoted everything that breathed to destruction, just as the LORD, the God of Israel, had commanded.",
      "links": "<a href='/AIV/5/20/16-18'>Deut. 20:16-18</a>",
      "comment": "See Deut. 20:16-18. Such severity must be read typologically: as a picture of the Church’s call to holiness, driving out all sin."
    },
    {
      "pk": 6010041,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 41,
      "text": "And Joshua struck them from Kadesh-barnea as far as Gaza, and all the land of Goshen, as far as Gibeon.",
      "links": "<a href='/AIV/6/15/3,51'>Josh. 15:3,51</a>",
      "comment": "Kadesh-barnea to Gaza sketches the boundaries later fulfilled in the kingdom and ultimately pointing to the universal scope of God’s promises."
    },
    {
      "pk": 6010042,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 42,
      "text": "And Joshua captured all these kings and their land at one time, because the LORD, the God of Israel, fought for Israel.",
      "links": "<a href='/AIV/2/14/14'>Exod. 14:14</a>",
      "comment": "Israel’s success is grounded not in their strength but in God fighting for His people, as He does for His Church through the ages."
    },
    {
      "pk": 6010043,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 10,
      "verse": 43,
      "text": "Then Joshua and all Israel with him returned to the camp at Gilgal.",
      "links": "<a href='/AIV/6/4/19'>Josh. 4:19</a>",
      "comment": "The narrative concludes as it began, at Gilgal—emphasizing the need for continual renewal in covenant worship and unity."
    }
  ],
  "translatedAt": "2025-12-24T02:22:04.093Z"
}