{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 17,
  "verses": [
    {
      "pk": 6017001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 1,
      "text": "The portion for the tribe of Manasseh, for he was Joseph’s firstborn, was assigned. To Makir, the firstborn of Manasseh and the father of Gilead, were allotted Gilead and Bashan, because he was a man of war.",
      "links": "<a href='/AIV/4/26/29'>Num. 26:29</a>; <a href='/AIV/6/13/31'>Josh. 13:31</a>",
      "comment": "Makir, as the eldest son, is given special mention and a double portion—foreshadowing the biblical importance of firstborn inheritance. There's a typological resonance with the inheritance promises carried out through spiritual fidelity."
    },
    {
      "pk": 6017002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 2,
      "text": "And the remaining sons of Manasseh received their inheritance by their clans: the sons of Abiezer, Helek, Asriel, Shechem, Hepher, and Shemida; these were the male descendants of Manasseh son of Joseph, by their families.",
      "links": "<a href='/AIV/4/26/30-32'>Num. 26:30-32</a>",
      "comment": "The division among these clans emphasizes the unity and diversity present in the people of God, a pattern echoed later in the apostolic church, where many members form one body (cf. 1 Cor. 12:12)."
    },
    {
      "pk": 6017003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 3,
      "text": "Now Zelophehad, son of Hepher, son of Gilead, son of Makir, son of Manasseh, had no sons, but only daughters. These are the names of his daughters: Mahlah, Noah, Hoglah, Milcah, and Tirzah.",
      "links": "<a href='/AIV/4/26/33'>Num. 26:33</a>; <a href='/AIV/4/27/1'>Num. 27:1</a>; <a href='/AIV/4/36/11'>Num. 36:11</a>",
      "comment": "These daughters' presence in the text underlines God's justice and the inclusion of women in the inheritance, a sign that points ahead toward the full participation of all believers within the family of faith (cf. Gal. 3:28)."
    },
    {
      "pk": 6017004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 4,
      "text": "They came before Eleazar the priest, Joshua son of Nun, and the leaders, saying, \"The LORD commanded Moses to give us an inheritance among our male relatives.\" So, according to the word of the LORD, they were given an inheritance among their father’s brothers.",
      "links": "<a href='/AIV/4/27/1-7'>Num. 27:1-7</a>",
      "comment": "This passage highlights the authority of divinely appointed leaders, confirming that God’s commands are fulfilled through the mediation of the priest and the leaders. This prefigures an ongoing role for spiritual leadership in distributing the blessings of faith."
    },
    {
      "pk": 6017005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 5,
      "text": "Thus, ten portions fell to Manasseh, besides the land of Gilead and Bashan, which were on the other side of the Jordan.",
      "links": "<a href='/AIV/6/13/29-31'>Josh. 13:29-31</a>",
      "comment": "The mention of ten portions underscores the completeness and abundance of God's blessing, while remembering the divided inheritance across the Jordan hints toward unity that embraces diversity."
    },
    {
      "pk": 6017006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 6,
      "text": "Because the daughters of Manasseh received an inheritance alongside his sons. The land of Gilead was assigned to the rest of the male descendants of Manasseh.",
      "links": "<a href='/AIV/6/17/3-4'>Josh. 17:3-4</a>; <a href='/AIV/4/36/1-12'>Num. 36:1-12</a>",
      "comment": "Again, the narrative affirms the just order of inheritance established by God, reinforcing the idea that divine law ensures justice for all generations of believers."
    },
    {
      "pk": 6017007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 7,
      "text": "The border of Manasseh stretched from Asher to Mikmethath, which is east of Shechem. The border went south to the inhabitants of En Tappuah.",
      "links": "<a href='/AIV/6/16/7'>Josh. 16:7</a>",
      "comment": "Detailed boundary descriptions in Israel serve as a reminder that God is a God of order, assigning to each their place in the community—mirroring the structure and boundaries found in the church."
    },
    {
      "pk": 6017008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 8,
      "text": "The land of Tappuah belonged to Manasseh, but Tappuah itself, on the border of Manasseh, belonged to the descendants of Ephraim.",
      "links": "<a href='/AIV/6/16/8-9'>Josh. 16:8-9</a>",
      "comment": "This division of territory reflects the close relationship between the tribes of Joseph, seen later in the unity among believers despite different roles and missions (cf. Rom. 12:4-5)."
    },
    {
      "pk": 6017009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 9,
      "text": "Then the border went down to the brook of Kanah, south of the brook. These cities among the cities of Manasseh belonged to Ephraim. Then the border of Manasseh was on the north side of the brook, and ended at the sea.",
      "links": "<a href='/AIV/6/16/9'>Josh. 16:9</a>",
      "comment": "Even as the land is split, there is mutual sharing between Ephraim and Manasseh, showing how inheritance is often interwoven—just as spiritual blessings are often shared across the family of faith."
    },
    {
      "pk": 6017010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 10,
      "text": "The south land belonged to Ephraim, and the north to Manasseh. The sea was its border; they met together in Asher on the north and in Issachar on the east.",
      "links": "<a href='/AIV/6/19/26'>Josh. 19:26</a>",
      "comment": "Tribe boundaries remind us that unity in God’s people withstands distinctions, foreshadowing the harmony from diversity in the household of faith (cf. Eph. 4:4-6)."
    },
    {
      "pk": 6017011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 11,
      "text": "Within Issachar and Asher, Manasseh possessed Beth-shean and its villages, Ibleam and its villages, the inhabitants of Dor and its villages, the inhabitants of Endor and its villages, the inhabitants of Taanach and its villages, and the inhabitants of Megiddo and its villages—the three regions.",
      "links": "<a href='/AIV/7/1/27'>Judg. 1:27</a>",
      "comment": "Manasseh’s inheritance includes prominent towns. This descent into Gentile regions hints at the future spread of the people of God among the nations (cf. Acts 1:8)."
    },
    {
      "pk": 6017012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 12,
      "text": "Yet the people of Manasseh could not dispossess the inhabitants of those cities, because the Canaanites persisted in dwelling in that land.",
      "links": "<a href='/AIV/7/1/27-28'>Judg. 1:27-28</a>",
      "comment": "Incomplete obedience points to the need for steadfast faith, and ultimately, the need for a Redeemer to fully conquer sin and establish perfect possession of the promised inheritance."
    },
    {
      "pk": 6017013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 13,
      "text": "But when the people of Israel grew strong, they put the Canaanites to forced labor, but did not drive them out entirely.",
      "links": "<a href='/AIV/7/1/28'>Judg. 1:28</a>",
      "comment": "Israel’s partial conquest foreshadows the ongoing need for spiritual purification. The gradual sanctification of believers is reflected in their daily striving to root out sin, corresponding with the journey toward holiness."
    },
    {
      "pk": 6017014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 14,
      "text": "The descendants of Joseph spoke to Joshua, saying, “Why have you given us only one lot and one portion as an inheritance, although we are a numerous people, whom the LORD has blessed up to this point?”",
      "links": "<a href='/AIV/1/48/16-20'>Gen. 48:16-20</a>",
      "comment": "Their desire for more points to both human ambition and the legitimate spiritual longing for a fuller share in God’s blessings."
    },
    {
      "pk": 6017015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 15,
      "text": "And Joshua said to them, “If you are a numerous people, go up to the forest and clear land for yourselves there in the land of the Perizzites and the Rephaim, since the hill country of Ephraim is too narrow for you.”",
      "links": "<a href='/AIV/1/14/5'>Gen. 14:5</a>",
      "comment": "Joshua’s response highlights the importance of spiritual initiative. God’s promises do not eliminate effort; we must cooperate with grace to lay hold of our spiritual inheritance."
    },
    {
      "pk": 6017016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 16,
      "text": "The descendants of Joseph said, “The hill country is not enough for us. And all the Canaanites who live in the lowlands have iron chariots, both those in Beth-shean and its villages and those in the Valley of Jezreel.”",
      "links": "<a href='/AIV/7/1/19'>Judg. 1:19</a>",
      "comment": "This reflects common hesitation to embrace God’s call due to apparent obstacles. Such fear is overcome through faith empowered by God, just as the apostles faced giants in their mission."
    },
    {
      "pk": 6017017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 17,
      "text": "Joshua spoke again to the house of Joseph, to Ephraim and Manasseh, saying, “You are a numerous and strong people; you shall not have just one lot.",
      "links": "<a href='/AIV/1/48/19'>Gen. 48:19</a>",
      "comment": "The affirmation of their strength and promise recalls the blessing given to Joseph’s sons. It’s a reminder that the people of God are called to fruitfulness through faith and obedience."
    },
    {
      "pk": 6017018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 17,
      "verse": 18,
      "text": "But the hill country shall be yours. Though it is forest, you shall clear it and possess it to its farthest borders. For you shall drive out the Canaanites, even though they have iron chariots and are strong.”",
      "links": "<a href='/AIV/6/14/12-14'>Josh. 14:12-14</a>",
      "comment": "This promise to drive out the Canaanites—even against daunting odds—prefigures the final victory of God's people over spiritual adversaries, not by human might, but through faith and divine grace. Perseverance in cooperation with God leads to the fullness of the promise."
    }
  ],
  "translatedAt": "2025-12-24T02:25:49.317Z"
}