{
  "book": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 20,
  "verses": [
    {
      "pk": 2020001,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 1,
      "text": "Then the LORD spoke to Joshua, saying,",
      "links": "<a href='/AIV/4/35/9'>Num. 35:9</a>",
      "comment": "This verse is a direct transition, with no significant changes from the Hebrew."
    },
    {
      "pk": 2020002,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 2,
      "text": "\"Speak to the Israelites, and say: 'Appoint the cities of refuge, about which I spoke to you through Moses,\"",
      "links": "<a href='/AIV/4/35/11-15'>Num. 35:11–15</a>; <a href='/AIV/5/19/2-10'>Deut. 19:2–10</a>",
      "comment": "Paraphrased for clarity; keeps the direct instruction, referencing prior commandments."
    },
    {
      "pk": 2020003,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 3,
      "text": "\"so that anyone who kills a person accidentally and unintentionally may flee there. They will be a refuge from the avenger of blood.\"",
      "links": "<a href='/AIV/4/35/15'>Num. 35:15</a>; <a href='/AIV/5/19/4'>Deut. 19:4</a>",
      "comment": "Preserves the concept of accidental killing and the protection offered."
    },
    {
      "pk": 2020004,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 4,
      "text": "\"He shall flee to one of these cities, stand at the entrance of the city gate, and state his case before the elders of that city. They shall take him into the city to themselves and give him a place to live among them.\"",
      "links": "<a href='/AIV/4/35/12'>Num. 35:12</a>; <a href='/AIV/5/19/6'>Deut. 19:6</a>",
      "comment": "Keeps the order and clarity; 'state his case' means to explain his situation."
    },
    {
      "pk": 2020005,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 5,
      "text": "\"If the avenger of blood pursues him, they must not hand him over, because he killed his neighbor unintentionally and did not hate him beforehand.\"",
      "links": "<a href='/AIV/4/35/25'>Num. 35:25'>Num. 35:25</a>; <a href='/AIV/5/19/6'>Deut. 19:6</a>",
      "comment": "Retains the original requirement to protect those who killed unintentionally."
    },
    {
      "pk": 2020006,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 6,
      "text": "\"He shall remain in that city until he stands before the congregation for judgment, and until the death of the high priest who is serving at that time. Then the slayer may return to his own city and his own house, to the city from which he fled.\"",
      "links": "<a href='/AIV/4/35/25-28'>Num. 35:25–28</a>",
      "comment": "'Congregation' refers to the community or court. No significant deviation."
    },
    {
      "pk": 2020007,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 7,
      "text": "So they set apart Kedesh in Galilee in the hill country of Naphtali, Shechem in the hill country of Ephraim, and Kiriath-arba (that is, Hebron) in the hill country of Judah.",
      "links": "<a href='/AIV/4/35/14'>Num. 35:14</a>",
      "comment": "Preserves the naming and locations; 'Kiriath-arba (Hebron)' included per common translations."
    },
    {
      "pk": 2020008,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 8,
      "text": "And beyond the Jordan east of Jericho, they appointed Bezer in the wilderness on the plain from the tribe of Reuben, Ramoth in Gilead from the tribe of Gad, and Golan in Bashan from the tribe of Manasseh.",
      "links": "<a href='/AIV/4/35/14'>Num. 35:14</a>; <a href='/AIV/5/4/43'>Deut. 4:43</a>",
      "comment": "Lists the eastern cities clearly; regional names preserved as in original."
    },
    {
      "pk": 2020009,
      "translation": "AIV",
      "book": 6,
      "chapter": 20,
      "verse": 9,
      "text": "These were the cities appointed for all the Israelites and for the foreigner living among them, so that anyone who kills a person unintentionally may flee there, and not die by the hand of the avenger of blood until he stands before the congregation.",
      "links": "<a href='/AIV/4/35/15'>Num. 35:15</a>; <a href='/AIV/5/19/10'>Deut. 19:10</a>",
      "comment": "'Foreigner living among them' is a literal translation of 'sojourner.' No inclusivity added; faithful to the original."
    }
  ],
  "translatedAt": "2025-12-22T07:00:16.876Z"
}