{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 5,
  "verses": [
    {
      "pk": 6005001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 1,
      "text": "When all the kings of the Amorites west of the Jordan, and all the kings of the Canaanites who were by the sea, heard how the LORD had dried up the waters of the Jordan before the people of Israel until they had crossed over, their hearts melted; no courage remained in them because of the Israelites.",
      "links": "<a href='/AIV/02/15/14'>Ex. 15:14</a>; <a href='/AIV/06/2/10'>Josh. 2:10-11</a>",
      "comment": "The miraculous crossing of the Jordan echoes Israel’s crossing of the Red Sea, showing God's continued intervention in salvation history. The fear among the Canaanite nations sets the stage for the conquest, highlighting God’s providential hand guiding His people. Consider the typology here: the crossing into the promised land foreshadows entering into spiritual promises fulfilled in Christ. See also <a href='/AIV/58/4/8'>Hebrews 4:8</a> on entering God’s rest."
    },
    {
      "pk": 6005002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 2,
      "text": "At that time the LORD said to Joshua, 'Make for yourself flint knives and circumcise again the sons of Israel a second time.'",
      "links": "<a href='/AIV/01/17/10'>Gen. 17:10-14</a>; <a href='/AIV/02/4/24-26'>Ex. 4:24-26</a>",
      "comment": "Circumcision as the covenant sign was neglected in the wilderness generation. Here, God reaffirms His desire for His people to be set apart through ritual and obedience, which prefigures the role of sacramental initiation in the New Covenant (see <a href='/AIV/51/2/11-12'>Col. 2:11-12</a>). The emphasis on physical signs points to the importance of tangible means of grace and spiritual rebirth."
    },
    {
      "pk": 6005003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 3,
      "text": "So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth.",
      "links": "<a href='/AIV/06/5/8'>Josh. 5:8</a>",
      "comment": "Gibeath-haaraloth literally means 'hill of foreskins,' signifying the mass circumcision and renewal of covenant obedience. This event is a corporate act of faith and preparation, not unlike how the Church prepares the faithful through rites before major spiritual undertakings."
    },
    {
      "pk": 6005004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 4,
      "text": "This is the reason Joshua circumcised them: all the people who came out of Egypt, all the males, all the men of war, had died in the wilderness after they had come out of Egypt.",
      "links": "<a href='/AIV/04/14/29-30'>Num. 14:29-30</a>",
      "comment": "This verse reminds us of the consequences of disobedience and the need for continuity in covenant faithfulness. Only the new generation enters the land, echoing the necessity of a spiritual rebirth for participation in the promise."
    },
    {
      "pk": 6005005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 5,
      "text": "For all the people who came out had been circumcised, but all the people born in the wilderness along the way after leaving Egypt had not been circumcised.",
      "links": "<a href='/AIV/01/17/12'>Gen. 17:12</a>",
      "comment": "A generation lacking the original covenant sign needed renewal to truly inherit the promise. See the parallel with spiritual rebirth through baptism, which brings one fully into covenant membership."
    },
    {
      "pk": 6005006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 6,
      "text": "For the people of Israel walked forty years in the wilderness, until all the nation, the men of war who came out of Egypt, perished, because they did not obey the voice of the LORD; the LORD swore to them that He would not let them see the land He promised to their ancestors—a land flowing with milk and honey.",
      "links": "<a href='/AIV/04/14/33-35'>Num. 14:33-35</a>; <a href='/AIV/02/3/8'>Ex. 3:8</a>",
      "comment": "The forty years of wandering symbolize purification and preparation, a theme often echoed in Christian spiritual practices. Obedience is linked to inheritance, underscoring that full participation in God’s promises requires faith and action."
    },
    {
      "pk": 6005007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 7,
      "text": "And it was their children, whom He raised up in their place, that Joshua circumcised. For they were uncircumcised because they had not been circumcised on the way.",
      "links": "<a href='/AIV/06/5/4-5'>Josh. 5:4-5</a>",
      "comment": "God’s plan continues through the next generation; covenant faithfulness is not only personal but communal and generational. This underscores the importance of passing on faith through instituted means for future believers."
    },
    {
      "pk": 6005008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 8,
      "text": "When all the nation had completed circumcision, they remained in their places in the camp until they were healed.",
      "links": "<a href='/AIV/06/5/2-3'>Josh. 5:2-3</a>",
      "comment": "The period of healing after circumcision shows the restorative aspect of covenant obedience, similar to the idea of spiritual healing and restoration following sacramental participation."
    },
    {
      "pk": 6005009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 9,
      "text": "The LORD said to Joshua, 'Today I have rolled away from you the reproach of Egypt.' So the name of that place is called Gilgal to this day.",
      "links": "<a href='/AIV/09/7/16'>1 Sam. 7:16</a>",
      "comment": "‘Gilgal’ from the Hebrew word for 'roll,' marks the removal of Egypt’s shame. This corresponds to the removal of sin’s reproach through God’s action—in Christian theology, a precursor to cleansing through baptism and entry into full covenant relationship."
    },
    {
      "pk": 6005010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 10,
      "text": "While the people of Israel were encamped at Gilgal, they kept the Passover on the fourteenth day of the month, at evening, on the plains of Jericho.",
      "links": "<a href='/AIV/02/12/6-8'>Ex. 12:6-8</a>; <a href='/AIV/04/9/5'>Num. 9:5</a>",
      "comment": "Celebration of the Passover links them to their deliverance from Egypt and God's saving acts. The Passover is a type of Christ’s sacrificial death (cf. <a href='/AIV/46/5/7'>1 Cor. 5:7</a>), later reinterpreted through the institution of the Eucharist—a perpetual memorial and participation in the New Covenant sacrifice."
    },
    {
      "pk": 6005011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 11,
      "text": "The day after the Passover, on that very day, they ate some of the produce of the land—unleavened bread and roasted grain.",
      "links": "<a href='/AIV/02/12/39'>Ex. 12:39</a>",
      "comment": "Eating the fruit of the land signifies the fulfillment of God’s promise. The unleavened bread directly links Passover to the Eucharistic themes in the New Testament—sharing spiritual food as a sign of covenant and unity."
    },
    {
      "pk": 6005012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 12,
      "text": "And the manna ceased the day after they ate from the produce of the land. There was no longer manna for the Israelites, but they ate of the yield of the land of Canaan that year.",
      "links": "<a href='/AIV/02/16/35'>Ex. 16:35</a>",
      "comment": "The stopping of manna demonstrates the transition from miraculous provision to ordinary means, as God’s people mature in faith. As the Church transitions from signs to sacramental realities, the idea of God's ongoing nourishment through spiritual food finds its fulfillment in the New Covenant."
    },
    {
      "pk": 6005013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 13,
      "text": "When Joshua was near Jericho, he looked up and saw a Man standing opposite him with His sword drawn in His hand. Joshua approached Him and said, 'Are You for us or for our adversaries?'",
      "links": "<a href='/AIV/01/18/2'>Gen. 18:2</a>; <a href='/AIV/07/6/11-12'>Judg. 6:11-12</a>",
      "comment": "The appearance of this Man is widely interpreted as a theophany (appearance of God) or at least a high angelic figure—possibly a pre-incarnate manifestation of Christ (see <a href='/AIV/58/1/3'>Heb. 1:3</a>). Joshua’s inquiry sets up his recognition of divine authority above human conflict."
    },
    {
      "pk": 6005014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 14,
      "text": "He replied, 'No; but I am the commander of the army of the LORD. Now I have come.' Then Joshua fell on his face to the ground and worshiped, and said to Him, 'What does my lord say to His servant?'",
      "links": "<a href='/AIV/02/3/2'>Ex. 3:2</a>; <a href='/AIV/06/6/2'>Josh. 6:2</a>",
      "comment": "Joshua's worship here is accepted, suggesting this figure's divinity. The commander of the LORD’s army prefigures Christ as head of the church militant. Submission to divine authority is depicted through posture and immediate obedience, pointing to the importance of reverence toward God’s presence."
    },
    {
      "pk": 6005015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 5,
      "verse": 15,
      "text": "The commander of the LORD's army said to Joshua, 'Take off your sandals from your feet, for the place where you are standing is holy.' And Joshua did so.",
      "links": "<a href='/AIV/02/3/5'>Ex. 3:5</a>; <a href='/AIV/01/28/16'>Gen. 28:16</a>",
      "comment": "Echoing the call to Moses at the burning bush, this moment underlines God's presence in sacred space. Joshua's obedience models reverence, linking to themes of sacred tradition and the honoring of holy places—an enduring principle in worship and sacramental life."
    }
  ],
  "translatedAt": "2025-12-24T02:18:46.714Z"
}