{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 2,
  "verses": [
    {
      "pk": 6002001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 1,
      "text": "Then Joshua son of Nun sent two men secretly from Shittim as spies, saying, “Go, look over the land, especially Jericho.” So they went and entered the house of a prostitute named Rahab and stayed there.",
      "links": "<a href='/AIV/4/13/1'>Num. 13:1-2</a>; <a href='/AIV/40/1/5'>Matt. 1:5</a>",
      "comment": "Joshua continues the leadership shown by Moses. The mention of Rahab is significant; she is later listed among the ancestors of Jesus (see Matt. 1:5), showing the divine plan uses even those outside of Israel. This hints at the importance of God working through all peoples, and the continuity of God's people."
    },
    {
      "pk": 6002002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 2,
      "text": "But it was reported to the king of Jericho, 'Look, some men from the Israelites have come here tonight to spy out the land.'",
      "links": "",
      "comment": "Notice the vigilance of Jericho's authorities. The threat of God's people causes fear, showing God's reputation precedes the Israelites. This sets up the main tension of the chapter."
    },
    {
      "pk": 6002003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 3,
      "text": "So the king of Jericho sent word to Rahab, saying, 'Bring out the men who came to you and entered your house, for they have come to spy out the entire land.'",
      "links": "",
      "comment": "Rahab's house is singled out. Traditional interpretations see in Rahab's sheltering of the spies an early symbol of faith and protection, which is echoed throughout salvation history (see Heb. 11:31; Jas. 2:25)."
    },
    {
      "pk": 6002004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 4,
      "text": "But the woman had taken the two men and hidden them. She said, 'It’s true, the men came to me, but I didn’t know where they were from.'",
      "links": "<a href='/AIV/58/11/31'>Heb. 11:31</a>",
      "comment": "Rahab takes a risk to protect the spies. This act of faith is praised in the New Testament as a genuine response to God's revelation."
    },
    {
      "pk": 6002005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 5,
      "text": "'When it was time to shut the city gate at dusk, the men left. I don't know where they went. Hurry after them and you may catch up with them.'",
      "links": "",
      "comment": "Rahab misleads the authorities to protect the spies. By prioritizing God's plans over worldly concerns, she aligns herself with God's people—foreshadowing New Testament teaching on faith leading to belonging within the People of God (see Rom. 11:17)."
    },
    {
      "pk": 6002006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 6,
      "text": "But she had taken them up to the roof and hidden them under the stalks of flax she had laid in order there.",
      "links": "",
      "comment": "Rahab acts prudently and resourcefully, providing shelter. Her deed is both an act of faith and a work, both held in harmony, similar to the New Testament’s view of faith working through love (see Jas. 2:25)."
    },
    {
      "pk": 6002007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 7,
      "text": "So the men set out in pursuit of the spies along the road to the fords of the Jordan. As soon as the pursuers had gone, the gate was shut.",
      "links": "",
      "comment": "Closing the gate increases the drama, ensuring the spies are trapped unless aided from within. The parallels to being saved from within a hostile world by the intercession of holy people are notable."
    },
    {
      "pk": 6002008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 8,
      "text": "Before the men lay down, she came up to them on the roof",
      "links": "",
      "comment": "Rahab’s initiative continues. She approaches the Israelites to speak, marking her as a courageous intermediary."
    },
    {
      "pk": 6002009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 9,
      "text": "and said to the men, 'I know that the LORD has given you this land, and that terror of you has fallen upon us, and all the inhabitants of the land melt with fear because of you.'",
      "links": "<a href='/AIV/2/15/13-16'>Ex. 15:13-16</a>",
      "comment": "Rahab explicitly confesses belief in the God of Israel and His power. Her faith, born of hearing about God’s mighty acts, aligns with the importance of hearing and responding to revealed truth (cf. Rom. 10:17)."
    },
    {
      "pk": 6002010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 10,
      "text": "'For we have heard how the LORD dried up the waters of the Red Sea before you when you came out of Egypt, and what you did to Sihon and Og, the two Amorite kings east of the Jordan, whom you completely destroyed.'",
      "links": "<a href='/AIV/2/14/21-29'>Ex. 14:21-29</a>; <a href='/AIV/4/21/21-35'>Num. 21:21-35</a>",
      "comment": "Rahab’s faith is founded on God's past interventions. Memory and tradition are central to faith formation, and the passing on of God's mighty works is a sign of a living, organic faith."
    },
    {
      "pk": 6002011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 11,
      "text": "'When we heard, our hearts melted, nor did spirit remain in any man because of you; for the LORD your God, He is God in the heavens above and on the earth beneath.'",
      "links": "<a href='/AIV/5/4/39'>Deut. 4:39</a>",
      "comment": "Rahab’s confession recognizes the uniqueness and sovereignty of the LORD. Her words echo Deut. 4:39 and foreshadow the universal scope of salvation in the New Covenant."
    },
    {
      "pk": 6002012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 12,
      "text": "'Now therefore, please swear to me by the LORD that, as I have shown kindness to you, so you will show kindness to my father's house, and give me a true sign'",
      "links": "",
      "comment": "Rahab seeks a covenant, requesting a sign in exchange for her faith and deeds. The concept of covenant sign (sacramental) is foundational for biblical faith, prefiguring later rites as outward signs of inward realities."
    },
    {
      "pk": 6002013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 13,
      "text": "'that you will spare the lives of my father, my mother, my brothers and sisters, and all that belong to them, and that you will deliver us from death.'",
      "links": "",
      "comment": "Rahab’s intercession extends beyond herself, reflecting the importance of communal salvation—a theme seen throughout Scripture. Her plea for her household points towards the later New Testament emphasis on household faith (Acts 16:31)."
    },
    {
      "pk": 6002014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 14,
      "text": "The men said to her, 'Our life for yours, if you do not tell this business of ours; and when the LORD gives us the land, we will deal kindly and faithfully with you.'",
      "links": "",
      "comment": "A mutual oath is sworn, binding both parties. The language of covenant and fidelity points ahead to the oaths and covenants God makes with His people, ultimately fulfilled in Christ."
    },
    {
      "pk": 6002015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 15,
      "text": "Then she let them down by a rope through the window, for her house was built into the city wall; she lived in the wall.",
      "links": "",
      "comment": "Rahab uses what she has at hand to aid God's people, combining courage and practical wisdom. Her house's location plays a providential role—a detail that also underlines literal historical grounding."
    },
    {
      "pk": 6002016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 16,
      "text": "She said to them, 'Go to the hill country so that the pursuers will not find you; hide yourselves there for three days until they return, and afterward you may go your way.'",
      "links": "<a href='/AIV/40/12/40'>Matt. 12:40</a>",
      "comment": "The three days in hiding prefigures other significant 'third day' moments in the Bible, most notably the resurrection of Jesus. The pattern of salvation after a period of testing is deeply embedded in salvation history."
    },
    {
      "pk": 6002017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 17,
      "text": "The men said to her, 'We will be released from this oath you made us swear, unless certain conditions are fulfilled.'",
      "links": "",
      "comment": "The oath's binding force is dependent on Rahab’s continued faithfulness. Conditional covenants echo biblical themes of faith and obedience."
    },
    {
      "pk": 6002018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 18,
      "text": "'Behold, when we come into the land, you must tie this scarlet cord in the window through which you let us down, and gather into your house your father, your mother, your brothers, and all your family.'",
      "links": "",
      "comment": "The scarlet cord is a sign—interpreted by Church fathers as a symbol reminiscent of the Passover blood (Ex. 12:7) and even the blood of Christ, pointing to salvation through visible signs."
    },
    {
      "pk": 6002019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 19,
      "text": "'If anyone goes outside the doors of your house into the street, his blood will be on his own head, and we shall be guiltless; but if anyone is with you in the house, his blood will be on our head if a hand is laid on him.'",
      "links": "<a href='/AIV/2/12/22-23'>Ex. 12:22-23</a>",
      "comment": "Salvation is tied to staying within the house marked by the sign, a powerful type of staying within the community of faith. Parallels to the Passover and theological significance for belonging to the visible community are evident."
    },
    {
      "pk": 6002020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 20,
      "text": "'But if you tell this business of ours, then we will be released from the oath you made us swear.'",
      "links": "",
      "comment": "Integrity and secrecy preserve the covenant. Continued faithfulness to the conditions reflects the necessity of perseverance in faith."
    },
    {
      "pk": 6002021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 21,
      "text": "She replied, 'Let it be as you say.' So she sent them away and they departed. Then she tied the scarlet cord in the window.",
      "links": "",
      "comment": "Rahab acts promptly in obedience. Tying the scarlet cord is a physical act of faith, displaying outwardly the inward reality of trust—a pattern that finds echoes in apostolic teachings on faith and works together."
    },
    {
      "pk": 6002022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 22,
      "text": "They went out and came to the hill country and stayed there for three days, until the pursuers returned. The pursuers searched all along the way and found nothing.",
      "links": "",
      "comment": "The spies’ escape shows God’s protection over His agents, emphasizing both human responsibility and divine providence."
    },
    {
      "pk": 6002023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 23,
      "text": "Then the two men returned, came down from the hill country, crossed the river, and came to Joshua son of Nun, and told him all that had happened to them.",
      "links": "",
      "comment": "The testimony of the spies—faithful witnesses—fulfills their mission and is reminiscent of apostolic witness in later revelation."
    },
    {
      "pk": 6002024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 2,
      "verse": 24,
      "text": "They said to Joshua, 'Truly, the LORD has given all the land into our hands. Moreover, all the inhabitants of the land melt away before us.'",
      "links": "<a href='/AIV/1/14/8'>Gen. 14:8</a>; <a href='/AIV/6/1/2'>Josh. 1:2</a>",
      "comment": "Their confidence points to fulfilled promise and the certainty of God’s guidance. Rahab’s story is thus woven into the story of Israel, foreshadowing the extension of God’s people to all nations—later fulfilled in the Gospel’s call."
    }
  ],
  "translatedAt": "2025-12-24T02:17:30.328Z"
}