{
  "book": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 17,
  "verses": [
    {
      "pk": 2017001,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 1,
      "text": "Then the allotment for the tribe of Manasseh, for he was Joseph’s firstborn: Machir, the firstborn son of Manasseh, the father of Gilead, received Gilead and Bashan because he was a man of war.",
      "links": "<a href='/AIV/4/32/39-40'>Num. 32:39–40</a>; <a href='/AIV/13/5/23'>1 Chr. 5:23</a>",
      "comment": "Clarified Machir's relationship as Manasseh’s firstborn, maintaining close wording to the Hebrew."
    },
    {
      "pk": 2017002,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 2,
      "text": "So an allotment was also assigned to the rest of the sons of Manasseh according to their clans: the sons of Abiezer, Helek, Asriel, Shechem, Hepher, and Shemida. These were the male descendants of Manasseh son of Joseph, by their clans.",
      "links": "<a href='/AIV/4/26/30-32'>Num. 26:30–32</a>; <a href='/AIV/13/7/18-19'>1 Chr. 7:18–19</a>",
      "comment": "Retained names of clans, as listed in genealogies; ‘male descendants’ added for clarity."
    },
    {
      "pk": 2017003,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 3,
      "text": "Now Zelophehad son of Hepher, son of Gilead, son of Machir, son of Manasseh, had no sons but only daughters. Their names were Mahlah, Noah, Hoglah, Milcah, and Tirzah.",
      "links": "<a href='/AIV/4/27/1-7'>Num. 27:1–7</a>; <a href='/AIV/4/36/1-12'>Num. 36:1–12</a>",
      "comment": "Genealogical order matches the original; daughter’s names kept as in ancient texts."
    },
    {
      "pk": 2017004,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 4,
      "text": "They approached Eleazar the priest, Joshua son of Nun, and the leaders, saying, ‘The LORD commanded Moses to give us an inheritance among our male relatives.’ So in accordance with the LORD’s command, he gave them an inheritance among their father’s brothers.",
      "links": "<a href='/AIV/4/27/6-7'>Num. 27:6–7</a>; <a href='/AIV/4/36/2'>Num. 36:2</a>",
      "comment": "Quoted their request; specified the fulfillment of the LORD’s command as in Numbers."
    },
    {
      "pk": 2017005,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 5,
      "text": "Ten portions fell to Manasseh, besides the land of Gilead and Bashan which are on the other side of the Jordan;",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>",
      "comment": "‘Fell to’ means allotted to; clarified that Gilead and Bashan are east of the Jordan."
    },
    {
      "pk": 2017006,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 6,
      "text": "because the daughters of Manasseh received an inheritance among his sons. The land of Gilead belonged to the rest of the sons of Manasseh.",
      "links": "<a href='/AIV/4/27/7'>Num. 27:7</a>",
      "comment": "Clarifies division between east and west of the Jordan, maintaining original sense."
    },
    {
      "pk": 2017007,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 7,
      "text": "The border of Manasseh began at Asher, from Michmethath, which is east of Shechem, and ran southward to the inhabitants of En Tappuah.",
      "links": "<a href='/AIV/6/16/6'>Josh. 16:6</a>",
      "comment": "Border details as per original; phrasing updated for clarity."
    },
    {
      "pk": 2017008,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 8,
      "text": "The land of Tappuah belonged to Manasseh, but Tappuah itself, on the border of Manasseh, belonged to the descendants of Ephraim.",
      "links": "<a href='/AIV/6/16/7'>Josh. 16:7</a>",
      "comment": "Differentiates the city from surrounding land, as in Hebrew."
    },
    {
      "pk": 2017009,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 9,
      "text": "The border went down to the brook Kanah, southward of the brook. The cities belonging to Ephraim among the cities of Manasseh are south of the border of Manasseh. The border of Manasseh ran north of the brook, ending at the sea.",
      "links": "<a href='/AIV/6/16/8'>Josh. 16:8</a>",
      "comment": "Topographical terms modernized; maintained separation of tribal cities."
    },
    {
      "pk": 2017010,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 10,
      "text": "The south belonged to Ephraim and the north belonged to Manasseh, and the sea was its border. They met Asher on the north and Issachar on the east.",
      "links": "<a href='/AIV/6/19/24-32'>Josh. 19:24–32</a>",
      "comment": "Directional wording clarified for more natural modern English."
    },
    {
      "pk": 2017011,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 11,
      "text": "Within Issachar and Asher, Manasseh had Beth-shean and its towns, Ibleam and its towns, the inhabitants of Dor and its towns, the inhabitants of Endor and its towns, the inhabitants of Taanach and its towns, and the inhabitants of Megiddo and its towns—the third is Napheth.",
      "links": "<a href='/AIV/7/1/27'>Judg. 1:27</a>; <a href='/AIV/13/7/29'>1 Chr. 7:29</a>",
      "comment": "City and town names retained from original; ‘third is Napheth’ as per Hebrew."
    },
    {
      "pk": 2017012,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 12,
      "text": "But the people of Manasseh could not drive out the inhabitants of those cities; so the Canaanites continued to dwell in that land.",
      "links": "<a href='/AIV/7/1/27-28'>Judg. 1:27–28</a>",
      "comment": "Maintained active wording from Hebrew; ‘drive out’ for expel."
    },
    {
      "pk": 2017013,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 13,
      "text": "When the Israelites grew strong, they put the Canaanites to forced labor, but did not completely drive them out.",
      "links": "<a href='/AIV/7/1/28'>Judg. 1:28</a>",
      "comment": "‘Forced labor’ for ‘tribute’—matches best sense of Hebrew mas."
    },
    {
      "pk": 2017014,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 14,
      "text": "Then the sons of Joseph spoke to Joshua, saying, ‘Why have you given us only one lot and one portion as our inheritance, although we are a numerous people, for the Lord has blessed us until now?’",
      "links": "<a href='/AIV/6/16/4'>Josh. 16:4</a>",
      "comment": "Dialogue is modernized for clear speech, but otherwise faithful."
    },
    {
      "pk": 2017015,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 15,
      "text": "Joshua said to them, ‘If you are a numerous people, go up into the forest and clear land for yourselves there in the land of the Perizzites and the Rephaim, since the hill country of Ephraim is too narrow for you.’",
      "links": "<a href='/AIV/1/14/5'>Gen. 14:5</a>; <a href='/AIV/6/17/18'>Josh. 17:18</a>",
      "comment": "Joshua’s response kept nearly word-for-word as original."
    },
    {
      "pk": 2017016,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 16,
      "text": "The sons of Joseph replied, ‘The hill country is not enough for us, and all the Canaanites who live in the lowlands have iron chariots, both those who are in Beth-shean and its towns and those who are in the Valley of Jezreel.’",
      "links": "<a href='/AIV/7/4/3'>Judg. 4:3</a>",
      "comment": "‘Iron chariots’ kept literal as in the original; city names preserved."
    },
    {
      "pk": 2017017,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 17,
      "text": "Then Joshua said to the house of Joseph, to Ephraim and Manasseh, ‘You are a numerous people and have great power; you shall not have just one lot,",
      "links": "<a href='/AIV/6/17/14'>Josh. 17:14</a>",
      "comment": "Separates Ephraim and Manasseh per Hebrew syntax."
    },
    {
      "pk": 2017018,
      "translation": "AIV",
      "book": 6,
      "chapter": 17,
      "verse": 18,
      "text": "but the hill country shall be yours. Although it is forested, you shall clear it and possess it as far as its farthest borders. For you shall drive out the Canaanites, even though they have iron chariots and though they are strong.’",
      "links": "<a href='/AIV/7/1/19'>Judg. 1:19</a>",
      "comment": "Final verse is word for word, with minor modernization for readability."
    }
  ],
  "translatedAt": "2025-12-22T06:59:02.870Z"
}