{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 9,
  "verses": [
    {
      "pk": 6009001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 1,
      "text": "When all the kings west of the Jordan heard about these things—the kings in the hill country, the lowland, and all along the coast of the Great Sea toward Lebanon, the Hittite, Amorite, Canaanite, Perizzite, Hivite, and Jebusite—",
      "links": "<a href='/AIV/06/3/10'>Josh. 3:10</a>; <a href='/AIV/07/3/5'>Judg. 3:5</a>",
      "comment": "The verse lists the nations dwelling in Canaan, showing the wide alliance against Israel. Repetition shows the seriousness of the opposition and echoes God’s promise to overcome these nations."
    },
    {
      "pk": 6009002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 2,
      "text": "they gathered together with one purpose, to fight against Joshua and Israel.",
      "links": "<a href='/AIV/02/15/9'>Ex. 15:9</a>; <a href='/AIV/19/83/5'>Ps. 83:5</a>",
      "comment": "The unity of these nations in opposition brings out a typology of the world gathering against God’s chosen, reminiscent of Psalm 2:2. This foreshadows similar resistance to God’s people, fulfilled in church history."
    },
    {
      "pk": 6009003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 3,
      "text": "But when the inhabitants of Gibeon heard what Joshua had done to Jericho and Ai,",
      "links": "<a href='/AIV/06/6/21-27'>Josh. 6:21–27</a>; <a href='/AIV/06/8/28-29'>Josh. 8:28–29</a>",
      "comment": "Gibeon's response sets them apart from the other nations by seeking an alternative to destruction, showing wisdom that resembles the reverence for God's will."
    },
    {
      "pk": 6009004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 4,
      "text": "they, acting craftily, went and prepared provisions and took worn-out sacks for their donkeys, worn-out wineskins torn and mended,",
      "links": "<a href='/AIV/06/2/4-5'>Josh. 2:4–5</a>",
      "comment": "The craftiness of the Gibeonites is similar to Rahab hiding the spies, showing that those outside can seek mercy through humility and faith—even through imperfect means."
    },
    {
      "pk": 6009005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 5,
      "text": "and old, patched sandals on their feet, and worn-out clothes on themselves, and all the bread of their provisions was dry and crumbly.",
      "links": "<a href='/AIV/09/16/1-3'>1 Sam. 16:1–3</a>",
      "comment": "Their appearance supports their deception, emphasizing the idea that outward appearances can be misleading, and wisdom requires discernment—paralleled by Paul’s words about deceivers masquerading as apostles (2 Cor. 11:13)."
    },
    {
      "pk": 6009006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 6,
      "text": "They went to Joshua in the camp at Gilgal and said to him and to the men of Israel, 'We have come from a distant country; make a covenant with us.'",
      "links": "<a href='/AIV/06/5/10'>Josh. 5:10</a>; <a href='/AIV/02/23/32'>Ex. 23:32</a>",
      "comment": "The theme of covenant appears again, highlighting the sacred nature of vows and the seriousness of oath-taking, paralleling later Old Testament teaching and Christ’s emphasis on truthfulness (Matt. 5:33–37)."
    },
    {
      "pk": 6009007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 7,
      "text": "But the men of Israel said to the Hivites, 'Perhaps you dwell among us. So how can we make a covenant with you?'",
      "links": "<a href='/AIV/05/7/2'>Deut. 7:2</a>; <a href='/AIV/06/2/12-13'>Josh. 2:12–13</a>",
      "comment": "God’s command not to make treaties with local nations (see Deut. 7:2) points to the need to maintain holiness—yet, as in the church, God's mercy is always available to the repentant outsider."
    },
    {
      "pk": 6009008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 8,
      "text": "They said to Joshua, 'We are your servants.' Then Joshua said to them, 'Who are you, and where do you come from?'",
      "links": "<a href='/AIV/06/5/14-15'>Josh. 5:14–15</a>",
      "comment": "'We are your servants' is a clear phrase of humility. Joshua's questioning illustrates discernment, reminding leaders to test spirits and motives (1 John 4:1)."
    },
    {
      "pk": 6009009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 9,
      "text": "They answered him, 'Your servants have come from a very distant country because of the name of the LORD your God. For we have heard of His fame and all that He did in Egypt,",
      "links": "<a href='/AIV/06/2/10-11'>Josh. 2:10–11</a>; <a href='/AIV/02/15/14-16'>Ex. 15:14–16</a>",
      "comment": "The Gibeonites’ reference to 'the name of the LORD' shows the power of witness: God’s deeds make His name known among all peoples (cf. Ps. 22:27; Acts 10:34–35)."
    },
    {
      "pk": 6009010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 10,
      "text": "and all that He did to the two kings of the Amorites who were beyond the Jordan, to Sihon king of Heshbon and to Og king of Bashan, who was in Ashtaroth.",
      "links": "<a href='/AIV/04/21/21-35'>Num. 21:21–35</a>; <a href='/AIV/05/3/1-11'>Deut. 3:1–11</a>",
      "comment": "Retelling salvation history is essential for conversion and growth, just as the Passover and the Eucharist are perpetually remembered in the Christian faith."
    },
    {
      "pk": 6009011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 11,
      "text": "So our elders and all the inhabitants of our country said to us, ‘Take provisions in your hand for the journey, and go to meet them and say to them, “We are your servants. Now make a covenant with us.”’",
      "links": "<a href='/AIV/06/2/12'>Josh. 2:12</a>",
      "comment": "The request to make a covenant reveals the universal human desire for peace with God, a foreshadowing of the new covenant opened to the nations through Christ."
    },
    {
      "pk": 6009012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 12,
      "text": "This is our bread. It was still warm when we took it from our houses as our food for the journey the day we set out to come to you, but now, look, it is dry and crumbly.",
      "links": "<a href='/AIV/09/28/8'>1 Sam. 28:8</a>",
      "comment": "Physical evidence is used to support their story. Note the continued theme of outward appearances and necessity of spiritual discernment—a repeated lesson in the New Testament and the apostolic church."
    },
    {
      "pk": 6009013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 13,
      "text": "And these wineskins were new when we filled them, but see, they are torn. And these garments and sandals have worn out because of the very long journey.'",
      "links": "<a href='/AIV/40/9/17'>Matt. 9:17</a>; <a href='/AIV/41/2/22'>Mark 2:22</a>",
      "comment": "The image of wineskins links forward to Jesus’ teaching about new and old (Matthew 9:17), foreshadowing how Christ fulfills and surpasses the earlier covenants."
    },
    {
      "pk": 6009014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 14,
      "text": "So the men took some of their provisions, but they did not ask counsel from the LORD.",
      "links": "<a href='/AIV/04/27/21'>Num. 27:21</a>; <a href='/AIV/06/7/2'>Josh. 7:2</a>",
      "comment": "A critical moment: not seeking God’s guidance brings trouble. This stresses the importance of consulting God through divinely instituted authority—mirrored in the apostolic succession and tradition."
    },
    {
      "pk": 6009015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 15,
      "text": "And Joshua made peace with them and made a covenant with them, to let them live. And the leaders of the congregation swore an oath to them.",
      "links": "<a href='/AIV/02/23/32'>Ex. 23:32</a>; <a href='/AIV/19/15/4'>Ps. 15:4</a>",
      "comment": "The binding nature of oaths echoes Jesus' warning in Matthew 5:33–37 and the lasting weight of sacramental covenants in the church."
    },
    {
      "pk": 6009016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 16,
      "text": "And at the end of three days after they had made a covenant with them, they heard that they were their neighbors, living among them.",
      "links": "<a href='/AIV/06/3/16'>Josh. 3:16</a>",
      "comment": "The number three often is symbolic of revelation and fulfillment—seen most fully in the resurrection of Christ on the third day."
    },
    {
      "pk": 6009017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 17,
      "text": "And the people of Israel set out and came to their cities on the third day. Now their cities were Gibeon, Chephirah, Beeroth, and Kiriath-jearim.",
      "links": "<a href='/AIV/06/18/25-28'>Josh. 18:25–28</a>",
      "comment": "Gibeon becomes a significant city later, even as a place of worship (see 1 Chr. 16:39), prefiguring the gathering of nations into the one true worship."
    },
    {
      "pk": 6009018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 18,
      "text": "But the people of Israel did not attack them because the leaders of the congregation had sworn to them by the LORD, the God of Israel. Then all the congregation grumbled against the leaders.",
      "links": "<a href='/AIV/04/14/2'>Num. 14:2</a>; <a href='/AIV/09/14/24'>1 Sam. 14:24</a>",
      "comment": "Keeping oaths, even when difficult, is a recurring theme—emphasizing the virtue of faithfulness and obedience to authority, seen throughout both Testaments."
    },
    {
      "pk": 6009019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 19,
      "text": "But all the leaders said to all the congregation, 'We have sworn to them by the LORD, the God of Israel, and now we cannot touch them.'",
      "links": "<a href='/AIV/19/15/4'>Ps. 15:4</a>; <a href='/AIV/09/21/1-2'>2 Sam. 21:1–2</a>",
      "comment": "Faithfulness to covenant is demanded by God. This foreshadows New Testament teaching on oaths and the unbreakable nature of God’s promises (Heb. 6:17–18)."
    },
    {
      "pk": 6009020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 20,
      "text": "'This is what we will do to them: let them live, lest wrath be upon us because of the oath that we swore to them.'",
      "links": "<a href='/AIV/09/21/2'>2 Sam. 21:2</a>",
      "comment": "Upholding oaths shows the seriousness of binding words. The leaders’ concern for God’s wrath underscores divine justice and the authority given to the church's leaders."
    },
    {
      "pk": 6009021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 21,
      "text": "And the leaders said to them, 'Let them live.' So they became cutters of wood and drawers of water for all the congregation, just as the leaders had said of them.",
      "links": "<a href='/AIV/05/29/11'>Deut. 29:11</a>; <a href='/AIV/06/9/23'>Josh. 9:23</a>",
      "comment": "Gibeonites are assigned humble tasks in service, foreshadowing the church’s universal call to serve. All are called to the altar of sacrifice and liturgical service, regardless of background."
    },
    {
      "pk": 6009022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 22,
      "text": "Then Joshua summoned them and said, 'Why did you deceive us, saying, ",
      "links": "<a href='/AIV/06/9/9'>Josh. 9:9</a>",
      "comment": "Joshua’s confrontation reveals that God’s mercy still brings consequences, yet also integration into the community of faith—a principle seen in church discipline and reconciliation."
    },
    {
      "pk": 6009023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 23,
      "text": "Now therefore you are cursed, and some of you will never cease being servants, cutters of wood and drawers of water for the house of my God.'",
      "links": "<a href='/AIV/06/9/27'>Josh. 9:27</a>",
      "comment": "Despite their deception, the Gibeonites find a share in the service of God’s house. This prefigures the drawing in of Gentile converts to ministerial roles in the new covenant era."
    },
    {
      "pk": 6009024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 24,
      "text": "So they answered Joshua, 'Because it was told your servants for certain that the LORD your God had commanded His servant Moses to give you all the land and to destroy all the inhabitants of the land from before you—so we feared for our lives because of you, and did this thing.'",
      "links": "<a href='/AIV/05/7/1-2'>Deut. 7:1–2</a>",
      "comment": "Their confession shows the power of God's word and authority passed to Moses and Joshua, a model for church hierarchy preserving and applying divine command."
    },
    {
      "pk": 6009025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 25,
      "text": "And now, behold, we are in your hand. Do to us as it seems good and right in your eyes to do to us.'",
      "links": "<a href='/AIV/02/10/8'>Ex. 10:8</a>",
      "comment": "Submission to judgment acknowledges appointed authority and points to the judgment seat of Christ and His church (Matt. 16:19)."
    },
    {
      "pk": 6009026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 26,
      "text": "So he did this to them and delivered them from the hand of the people of Israel, and they did not kill them.",
      "links": "<a href='/AIV/06/9/20-21'>Josh. 9:20-21</a>",
      "comment": "Mercy triumphs over judgment—Joshua as a type of Christ, who both upholds justice and offers mercy, integrating all into His one people."
    },
    {
      "pk": 6009027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 9,
      "verse": 27,
      "text": "But on that day Joshua made them cutters of wood and drawers of water for the congregation and for the altar of the LORD, to this day, in the place that He would choose.",
      "links": "<a href='/AIV/05/12/5'>Deut. 12:5</a>; <a href='/AIV/06/18/1'>Josh. 18:1</a>",
      "comment": "Their lasting role in service to the altar points forward to the inclusion of all nations in the sacrificial worship of the true God, fulfilled in Christ and the new covenant. The idea of 'the place He would choose' hints at God's establishment of an authoritative center for unified worship."
    }
  ],
  "translatedAt": "2025-12-24T02:21:13.510Z"
}