{
  "book": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 5,
  "verses": [
    {
      "pk": 1005001,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 1,
      "text": "Now when all the kings of the Amorites who were beyond the Jordan to the west, and all the kings of the Canaanites who were by the sea, heard that the LORD had dried up the waters of the Jordan before the children of Israel until they had crossed over, their hearts melted, and there was no longer any spirit in them because of the children of Israel.",
      "links": "<a href='/AIV/02/15/14'>Ex. 15:14-16</a>; <a href='/AIV/06/2/10'>Josh. 2:10-11</a>",
      "comment": "Preserves the sequence as in the Hebrew text. 'Amorites' and 'Canaanites' are distinct peoples; 'spirit' here refers to courage."
    },
    {
      "pk": 1005002,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 2,
      "text": "At that time the LORD said to Joshua, 'Make flint knives and circumcise the sons of Israel again, a second time.'",
      "links": "<a href='/AIV/01/17/10'>Gen. 17:10-14</a>; <a href='/AIV/02/12/48'>Ex. 12:48</a>",
      "comment": "Flint knives—following the Hebrew 'rock knives'. 'Circumcise again' refers to those who hadn't been circumcised during the wilderness period."
    },
    {
      "pk": 1005003,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 3,
      "text": "So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth.",
      "links": "<a href='/AIV/01/34/24'>Gen. 34:24</a>",
      "comment": "Gibeath-haaraloth means 'Hill of the Foreskins'. Place name is transliterated as in most translations."
    },
    {
      "pk": 1005004,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 4,
      "text": "And this is the reason why Joshua circumcised them: all the males who came out of Egypt—all the men of war—had died in the wilderness, along the way after they came out of Egypt.",
      "links": "<a href='/AIV/04/14/29'>Num. 14:29-32</a>",
      "comment": "Clarifies that those circumcised were those born in the wilderness, not the original generation."
    },
    {
      "pk": 1005005,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 5,
      "text": "For all the people who came out were circumcised, but all the people born in the wilderness along the way after they came out of Egypt had not been circumcised.",
      "links": "<a href='/AIV/04/14/33'>Num. 14:33</a>",
      "comment": "Closely follows Hebrew; clarifies situation of uncircumcised generation."
    },
    {
      "pk": 1005006,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 6,
      "text": "For the children of Israel walked forty years in the wilderness, until all the nation, the men of war who came out of Egypt, had perished, because they did not obey the voice of the LORD. The LORD swore to them that He would not let them see the land which the LORD had sworn to their fathers to give us, a land flowing with milk and honey.",
      "links": "<a href='/AIV/04/32/13'>Num. 32:13</a>; <a href='/AIV/02/3/8'>Ex. 3:8</a>; <a href='/AIV/04/14/23'>Num. 14:23</a>",
      "comment": "'A land flowing with milk and honey' matches common biblical phrasing; 'swore' as in original."
    },
    {
      "pk": 1005007,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 7,
      "text": "And He raised up their sons in their place; it was these Joshua circumcised, for they were uncircumcised, because they had not been circumcised along the way.",
      "links": "<a href='/AIV/04/26/64-65'>Num. 26:64-65</a>",
      "comment": "Directly reflects the Hebrew narrative flow; repeated circumcision clarification."
    },
    {
      "pk": 1005008,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 8,
      "text": "And when all the nation had finished being circumcised, they remained in their places in the camp until they were healed.",
      "links": "<a href='/AIV/01/34/25'>Gen. 34:25</a>",
      "comment": "'Remained...until healed' matches the Hebrew participle for recovery time."
    },
    {
      "pk": 1005009,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 9,
      "text": "Then the LORD said to Joshua, 'Today I have rolled away the reproach of Egypt from you.' So the name of that place is called Gilgal to this day.",
      "links": "<a href='/AIV/06/4/19'>Josh. 4:19</a>",
      "comment": "'Gilgal' is a play on the Hebrew 'galal', to roll. 'Reproach of Egypt' refers to their shame of previous disobedience/slavery."
    },
    {
      "pk": 1005010,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 10,
      "text": "While the children of Israel were camped at Gilgal, they kept the Passover on the fourteenth day of the month at evening, in the plains of Jericho.",
      "links": "<a href='/AIV/02/12/6'>Ex. 12:6</a>; <a href='/AIV/04/9/5'>Num. 9:5</a>",
      "comment": "Rephrased for modern clarity—Passover date and location per Hebrew text."
    },
    {
      "pk": 1005011,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 11,
      "text": "And on the day after the Passover, on that very day, they ate from the produce of the land, unleavened cakes and roasted grain.",
      "links": "<a href='/AIV/03/23/14'>Lev. 23:14</a>",
      "comment": "'Unleavened cakes'—matches Hebrew 'matzot'. 'Produce of the land' signals first fruits in Canaan."
    },
    {
      "pk": 1005012,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 12,
      "text": "And the manna ceased the day after they had eaten from the produce of the land, and there was no more manna for the children of Israel. So they ate from the fruit of the land of Canaan that year.",
      "links": "<a href='/AIV/02/16/35'>Ex. 16:35</a>",
      "comment": "'Fruit of the land' preserves Hebrew sense. Manna's end signaled new provision."
    },
    {
      "pk": 1005013,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 13,
      "text": "And it happened, when Joshua was by Jericho, he lifted up his eyes and looked, and behold, a man was standing in front of him with his drawn sword in his hand. Joshua went to him and asked, 'Are you for us, or for our adversaries?'",
      "links": "<a href='/AIV/01/18/2'>Gen. 18:2</a>; <a href='/AIV/02/3/2'>Ex. 3:2</a>",
      "comment": "Keeps original tense and phrasing; 'drawn sword' reflects Hebrew."
    },
    {
      "pk": 1005014,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 14,
      "text": "He replied, 'No; but I am the commander of the army of the LORD. Now I have come.' And Joshua fell on his face to the ground and bowed down, and he said to him, 'What does my lord command his servant?'",
      "links": "<a href='/AIV/02/3/5'>Ex. 3:5</a>; <a href='/AIV/01/18/3'>Gen. 18:3</a>",
      "comment": "'Commander' preserves Hebrew 'sar'. 'Bowed down'—prostration before divine figure."
    },
    {
      "pk": 1005015,
      "translation": "AIV",
      "book": 6,
      "chapter": 5,
      "verse": 15,
      "text": "The commander of the LORD's army said to Joshua, 'Remove your sandals from your feet, for the place where you are standing is holy.' And Joshua did so.",
      "links": "<a href='/AIV/02/3/5'>Ex. 3:5</a>; <a href='/AIV/01/28/16'>Gen. 28:16'</a>",
      "comment": "Echoes Moses at the burning bush—'Remove your sandals' signals holy ground per Hebrew."
    }
  ],
  "translatedAt": "2025-12-20T10:06:42.339Z"
}