{
  "book": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 10,
  "verses": [
    {
      "pk": 1043001,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 1,
      "text": "Now when Adoni-zedek king of Jerusalem heard that Joshua had captured Ai and had utterly destroyed it—just as he had done to Jericho and its king, so he had done to Ai and its king—and that the inhabitants of Gibeon had made peace with Israel and were among them,",
      "links": "<a href='/AIV/6/8/26-29'>Josh. 8:26–29</a>; <a href='/AIV/6/9/15'>Josh. 9:15</a>",
      "comment": "‘Utterly destroyed’ is a translation of the Hebrew 'herem', meaning devoted to destruction."
    },
    {
      "pk": 1043002,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 2,
      "text": "He greatly feared, because Gibeon was a great city, like one of the royal cities, even greater than Ai, and all its men were mighty.",
      "links": "<a href='/AIV/6/9/3-15'>Josh. 9:3–15</a>",
      "comment": "Gibeon’s status is emphasized for context about the alliance."
    },
    {
      "pk": 1043003,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 3,
      "text": "So Adoni-zedek king of Jerusalem sent to Hoham king of Hebron, Piram king of Jarmuth, Japhia king of Lachish, and Debir king of Eglon, saying,",
      "links": "<a href='/AIV/6/12/10-13'>Josh. 12:10–13</a>",
      "comment": ""
    },
    {
      "pk": 1043004,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 4,
      "text": "\"Come up to me and help me, and let us attack Gibeon, for it has made peace with Joshua and the people of Israel.\"",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1043005,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 5,
      "text": "So the five kings of the Amorites—the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon—gathered together and went up, they and all their armies, and camped against Gibeon and made war against it.",
      "links": "",
      "comment": "‘Amorites’ here is a general term for the Canaanite peoples of the hill country."
    },
    {
      "pk": 1043006,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 6,
      "text": "And the men of Gibeon sent to Joshua at the camp at Gilgal, saying, “Do not abandon your servants; come up to us quickly, save us and help us, for all the kings of the Amorites who dwell in the hill country are gathered against us.”",
      "links": "<a href='/AIV/6/9/15'>Josh. 9:15</a>",
      "comment": ""
    },
    {
      "pk": 1043007,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 7,
      "text": "So Joshua went up from Gilgal, he and all the people of war with him, and all the mighty men of valor.",
      "links": "<a href='/AIV/6/1/14'>Josh. 1:14</a>",
      "comment": ""
    },
    {
      "pk": 1043008,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 8,
      "text": "The LORD said to Joshua, “Do not fear them, for I have delivered them into your hand; not one of them will stand before you.”",
      "links": "<a href='/AIV/6/1/5'>Josh. 1:5</a>; <a href='/AIV/6/8/1'>Josh. 8:1</a>",
      "comment": ""
    },
    {
      "pk": 1043009,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 9,
      "text": "So Joshua came upon them suddenly, having marched up all night from Gilgal.",
      "links": "",
      "comment": "Emphasis on the surprise attack and forced march."
    },
    {
      "pk": 1043010,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 10,
      "text": "And the LORD threw them into confusion before Israel, and struck them with a great blow at Gibeon, and chased them along the way that goes up to Beth-horon, and struck them as far as Azekah and Makkedah.",
      "links": "<a href='/AIV/2/23/27'>Ex. 23:27</a>",
      "comment": "Confusion or panic is often God's intervention in battle."
    },
    {
      "pk": 1043011,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 11,
      "text": "As they fled before Israel, while they were going down the ascent of Beth-horon, the LORD threw down large hailstones from heaven on them as far as Azekah, and they died. More died because of the hailstones than the sons of Israel killed with the sword.",
      "links": "<a href='/AIV/2/9/18-26'>Ex. 9:18–26</a>; <a href='/AIV/19/18/13'>Ps. 18:13</a>",
      "comment": "Literal hailstones. God’s direct intervention in battle."
    },
    {
      "pk": 1043012,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 12,
      "text": "Then Joshua spoke to the LORD in the day when the LORD gave the Amorites over to the sons of Israel, and he said in the sight of Israel: \"Sun, stand still at Gibeon, and moon, in the Valley of Aijalon.\"",
      "links": "<a href='/AIV/6/10/14'>Josh. 10:14</a>; <a href='/AIV/35/3/11'>Hab. 3:11</a>",
      "comment": "'Stand still' can also mean 'be silent' or 'stop moving.'"
    },
    {
      "pk": 1043013,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 13,
      "text": "And the sun stood still, and the moon stopped, until the nation took vengeance on their enemies. Is this not written in the Book of Jashar? The sun stopped in the midst of the sky and did not hurry to go down for about a whole day.",
      "links": "<a href='/AIV/2/14/27'>Ex. 14:27</a>; <a href='/AIV/6/10/12'>Josh. 10:12</a>",
      "comment": "'Book of Jashar' was an ancient book of poetry or history now lost."
    },
    {
      "pk": 1043014,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 14,
      "text": "There has been no day like it, before or since, when the LORD listened to the voice of a man; for the LORD fought for Israel.",
      "links": "<a href='/AIV/6/10/42'>Josh. 10:42</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Emphasizes the extraordinary nature of this miracle."
    },
    {
      "pk": 1043015,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 15,
      "text": "Then Joshua and all Israel with him returned to the camp at Gilgal.",
      "links": "<a href='/AIV/6/9/6'>Josh. 9:6</a>",
      "comment": "Some manuscripts omit this verse here, but most include it."
    },
    {
      "pk": 1043016,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 16,
      "text": "But these five kings fled and hid themselves in the cave at Makkedah.",
      "links": "<a href='/AIV/6/10/22'>Josh. 10:22</a>",
      "comment": ""
    },
    {
      "pk": 1043017,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 17,
      "text": "And it was told to Joshua, “The five kings have been found, hidden in the cave at Makkedah.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1043018,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 18,
      "text": "Joshua said, “Roll large stones against the mouth of the cave and set men by it to guard them.",
      "links": "<a href='/AIV/6/10/22'>Josh. 10:22</a>",
      "comment": ""
    },
    {
      "pk": 1043019,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 19,
      "text": "But do not stay there yourselves; pursue your enemies and attack them from the rear. Do not let them enter their cities, for the LORD your God has delivered them into your hand.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1043020,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 20,
      "text": "When Joshua and the sons of Israel had finished striking them with a very great slaughter, until they were destroyed, and the few survivors who remained had entered the fortified cities,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1043021,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 21,
      "text": "Then all the people returned safe to Joshua at the camp at Makkedah. No one moved his tongue against any of the people of Israel.",
      "links": "<a href='/AIV/2/11/7'>Ex. 11:7</a>",
      "comment": "'No one moved his tongue' means no one spoke against them or threatened them."
    },
    {
      "pk": 1043022,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 22,
      "text": "Then Joshua said, “Open the mouth of the cave, and bring those five kings out to me from the cave.”",
      "links": "<a href='/AIV/6/10/16-18'>Josh. 10:16–18</a>",
      "comment": ""
    },
    {
      "pk": 1043023,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 23,
      "text": "They brought the five kings out to him from the cave: the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon.",
      "links": "<a href='/AIV/6/10/3'>Josh. 10:3</a>",
      "comment": ""
    },
    {
      "pk": 1043024,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 24,
      "text": "And when they brought those kings to Joshua, Joshua summoned all the men of Israel and said to the chiefs of the men of war who had gone with him, “Come near, put your feet on the necks of these kings.” So they came near and put their feet on their necks.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "'Putting feet on necks' was a sign of victory and subjugation."
    },
    {
      "pk": 1043025,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 25,
      "text": "Joshua said to them, “Do not be afraid or dismayed; be strong and courageous, for thus the LORD will do to all your enemies against whom you fight.”",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>; <a href='/AIV/19/2/9'>Ps. 2:9</a>",
      "comment": ""
    },
    {
      "pk": 1043026,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 26,
      "text": "Afterward Joshua struck them and put them to death, and he hanged them on five trees, and they hung on the trees until evening.",
      "links": "<a href='/AIV/5/21/22-23'>Deut. 21:22–23</a>",
      "comment": "'Trees' can also be translated 'poles.'"
    },
    {
      "pk": 1043027,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 27,
      "text": "At sunset Joshua gave command, and they took them down from the trees and threw them into the cave where they had hidden themselves, and they set large stones against the mouth of the cave to this very day.",
      "links": "<a href='/AIV/6/10/18'>Josh. 10:18</a>",
      "comment": "Deuteronomy 21:22-23 explains that bodies should not remain hanging overnight."
    },
    {
      "pk": 1043028,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 28,
      "text": "Joshua captured Makkedah on that day and struck it and its king with the edge of the sword. He utterly destroyed them and every person in it. He left none remaining. And he did to the king of Makkedah just as he had done to the king of Jericho.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>",
      "comment": "'Utterly destroyed' again translates 'herem,' see comment at v1."
    },
    {
      "pk": 1043029,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 29,
      "text": "Then Joshua and all Israel with him passed on from Makkedah to Libnah, and fought against Libnah.",
      "links": "<a href='/AIV/6/12/15'>Josh. 12:15</a>",
      "comment": ""
    },
    {
      "pk": 1043030,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 30,
      "text": "And the LORD gave it also and its king into the hand of Israel. And he struck it with the edge of the sword, and every person in it. He left none remaining in it. And he did to its king as he had done to the king of Jericho.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>",
      "comment": ""
    },
    {
      "pk": 1043031,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 31,
      "text": "Then Joshua and all Israel with him passed on from Libnah to Lachish, and camped against it and fought against it.",
      "links": "<a href='/AIV/6/12/11'>Josh. 12:11</a>",
      "comment": ""
    },
    {
      "pk": 1043032,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 32,
      "text": "The LORD gave Lachish into the hand of Israel, and he captured it on the second day and struck it with the edge of the sword, and every person in it, as he had done to Libnah.",
      "links": "<a href='/AIV/6/10/30'>Josh. 10:30</a>",
      "comment": ""
    },
    {
      "pk": 1043033,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 33,
      "text": "Then Horam king of Gezer came up to help Lachish. But Joshua struck him and his people, until he left none remaining.",
      "links": "<a href='/AIV/6/16/10'>Josh. 16:10</a>",
      "comment": ""
    },
    {
      "pk": 1043034,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 34,
      "text": "And Joshua and all Israel with him passed on from Lachish to Eglon, and they camped against it and fought against it.",
      "links": "<a href='/AIV/6/10/3'>Josh. 10:3</a>",
      "comment": ""
    },
    {
      "pk": 1043035,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 35,
      "text": "And they captured it on that day, and struck it with the edge of the sword. He utterly destroyed every person in it on that day, as he had done to Lachish.",
      "links": "<a href='/AIV/6/10/32'>Josh. 10:32</a>",
      "comment": ""
    },
    {
      "pk": 1043036,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 36,
      "text": "Then Joshua and all Israel with him went up from Eglon to Hebron, and they fought against it.",
      "links": "<a href='/AIV/6/12/10'>Josh. 12:10</a>",
      "comment": ""
    },
    {
      "pk": 1043037,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 37,
      "text": "And they captured it and struck it with the edge of the sword, its king and all its towns, and every person in it. He left none remaining, as he had done to Eglon, and he utterly destroyed it and every person in it.",
      "links": "<a href='/AIV/6/10/35'>Josh. 10:35</a>",
      "comment": ""
    },
    {
      "pk": 1043038,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 38,
      "text": "Then Joshua and all Israel with him turned back to Debir and fought against it.",
      "links": "<a href='/AIV/6/15/15'>Josh. 15:15</a>",
      "comment": ""
    },
    {
      "pk": 1043039,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 39,
      "text": "And he captured it and its king and all its towns. They struck them with the edge of the sword and utterly destroyed every person in it; he left none remaining. Just as he had done to Hebron and to Libnah and its king, so he did to Debir and its king.",
      "links": "<a href='/AIV/6/10/37'>Josh. 10:37</a>",
      "comment": ""
    },
    {
      "pk": 1043040,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 40,
      "text": "So Joshua struck all the land—the hill country, the Negev, the lowland, and the slopes, and all their kings. He left none remaining, but utterly destroyed all that breathed, just as the LORD, the God of Israel, had commanded.",
      "links": "<a href='/AIV/5/20/16'>Deut. 20:16</a>",
      "comment": "'All that breathed' refers to every living person, see Deut. 20:16."
    },
    {
      "pk": 1043041,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 41,
      "text": "And Joshua struck them from Kadesh-barnea as far as Gaza, and all the land of Goshen, as far as Gibeon.",
      "links": "<a href='/AIV/6/15/3'>Josh. 15:3</a>",
      "comment": "'Land of Goshen' is a different Goshen than in Egypt; here it's in the south of Canaan."
    },
    {
      "pk": 1043042,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 42,
      "text": "Joshua captured all these kings and their land at one time, because the LORD, the God of Israel, fought for Israel.",
      "links": "<a href='/AIV/6/10/14'>Josh. 10:14</a>; <a href='/AIV/6/23/3'>Josh. 23:3</a>",
      "comment": ""
    },
    {
      "pk": 1043043,
      "translation": "AIV",
      "book": 6,
      "chapter": 10,
      "verse": 43,
      "text": "Then Joshua and all Israel with him returned to the camp at Gilgal.",
      "links": "<a href='/AIV/6/10/15'>Josh. 10:15</a>",
      "comment": "Repetition of the earlier summary statement; marks transition in the narrative."
    }
  ],
  "translatedAt": "2025-12-22T06:55:53.848Z"
}