{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 8,
  "verses": [
    {
      "pk": 6008001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 1,
      "text": "Then the LORD said to Joshua, \"Do not be afraid or discouraged. Take all the people of war with you and rise up, go to Ai. See, I have given into your hand the king of Ai, his people, his city, and his land.\"",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>; <a href='/AIV/6/6/2'>Josh. 6:2</a>",
      "comment": "God’s assurance echoes His promise from the beginning of Joshua’s leadership. The message to not fear highlights divine provision for Israel, reminiscent of themes of trust and obedience leading to blessing. The granting of land points to both a temporal and spiritual fulfillment, suggesting God's providential care for His people."
    },
    {
      "pk": 6008002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 2,
      "text": "\"You shall do to Ai and its king as you did to Jericho and its king. But you may take the spoil and cattle for yourselves. Set an ambush behind the city.\"",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>; <a href='/AIV/5/20/20-21'>Deut. 20:20-21</a>",
      "comment": "Unlike Jericho, here Israel is permitted to take spoils, hinting at shifting divine instructions that require listening to God for each situation. This provision shows that obedience to God’s commands brings both victory and blessing, while also offering tangible rewards."
    },
    {
      "pk": 6008003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 3,
      "text": "So Joshua and all the people of war rose up to go to Ai. Joshua chose thirty thousand mighty men of valor and sent them out by night.",
      "links": "<a href='/AIV/7/20/30'>Judg. 20:30</a>",
      "comment": "This strategic deployment under Joshua's leadership illustrates both careful planning and faithfulness to divine guidance. Night operations here symbolize the need for wisdom alongside faith, a theme prominent in the Hebrew Scriptures."
    },
    {
      "pk": 6008004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 4,
      "text": "He commanded them, saying, \"See, you shall lie in ambush behind the city. Do not go far from the city, and all of you be ready.\"",
      "links": "<a href='/AIV/7/20/36-37'>Judg. 20:36-37</a>",
      "comment": "Joshua’s detailed command shows wise military preparation and a model of clear leadership. The emphasis on readiness calls to mind the spiritual necessity of watchfulness, as Jesus urges in the Gospels."
    },
    {
      "pk": 6008005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 5,
      "text": "\"I and all the people who are with me will approach the city. When they come out against us, as they did before, we will flee before them.\"",
      "links": "<a href='/AIV/6/7/5'>Josh. 7:5</a>",
      "comment": "This strategy uses Israel’s previous defeat to draw out Ai’s defenders. It’s a use of history for redemptive purpose, reminiscent of how God turns seeming defeat to spiritual victory."
    },
    {
      "pk": 6008006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 6,
      "text": "\"They will come out after us until we have drawn them away from the city, for they will say, 'They are fleeing before us as before.' So we will flee before them.\"",
      "links": "<a href='/AIV/6/7/4'>Josh. 7:4</a>",
      "comment": "A reminder that reliance on past victories can lead to overconfidence for enemies. Spiritually, it shows that humility is key to victory, a theme prominent in both Testaments."
    },
    {
      "pk": 6008007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 7,
      "text": "\"Then you shall rise up from the ambush and take possession of the city, for the LORD your God will give it into your hand.\"",
      "links": "<a href='/AIV/6/6/2'>Josh. 6:2</a>",
      "comment": "Victory is ultimately credited to God, not human cunning. The act of rising up reflects resurrection imagery that foreshadows Christ’s triumph over death."
    },
    {
      "pk": 6008008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 8,
      "text": "\"When you have seized the city, set it on fire. Do according to the word of the LORD. See, I command you.\"",
      "links": "<a href='/AIV/6/6/24'>Josh. 6:24</a>",
      "comment": "The destruction of Ai parallels Jericho, signifying judgment against sin and a call to complete obedience. Fire as judgment anticipates both Old and New Testament uses, such as Pentecost’s purifying fire."
    },
    {
      "pk": 6008009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 9,
      "text": "So Joshua sent them out. They went to lie in ambush and stayed between Bethel and Ai, to the west of Ai. But Joshua spent that night among the people.",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "Joshua’s presence among the people indicates pastoral leadership, foreshadowing Christ-like care for those entrusted to leaders. The location between Bethel and Ai recalls Abram’s altar, hinting at continuity in sacred history."
    },
    {
      "pk": 6008010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 10,
      "text": "Joshua rose early in the morning and mustered the people. He and the elders of Israel went up before the people to Ai.",
      "links": "<a href='/AIV/6/3/1'>Josh. 3:1</a>; <a href='/AIV/6/7/6'>Josh. 7:6</a>",
      "comment": "Joshua's rising early shows diligence in leadership. The involvement of elders signifies both communal and apostolic patterns in spiritual governance."
    },
    {
      "pk": 6008011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 11,
      "text": "All the people of war who were with him went up and drew near to the city, arriving opposite Ai. He camped on the north side of Ai, with a valley between him and the city.",
      "links": "<a href='/AIV/6/7/2'>Josh. 7:2</a>",
      "comment": "Strategic placement indicates wisdom in battle, balancing faith and action. The valley can symbolize the trials God’s people endure before victory."
    },
    {
      "pk": 6008012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 12,
      "text": "He took about five thousand men and set them in ambush between Bethel and Ai, to the west of the city.",
      "links": "<a href='/AIV/6/7/2'>Josh. 7:2</a>",
      "comment": "Another group is sent to ensure victory, showing the importance of fullness in preparation and unity. Spiritually, it encourages believers to persist with both prayer and practical effort."
    },
    {
      "pk": 6008013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 13,
      "text": "So the people stationed the main army north of the city, and their ambush west of the city. Joshua went that night into the midst of the valley.",
      "links": "<a href='/AIV/6/8/11'>Josh. 8:11</a>",
      "comment": "Joshua’s presence in the valley connects with motifs of descent before exaltation, which can be interpreted symbolically as a type of Christ’s humility before glorification."
    },
    {
      "pk": 6008014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 14,
      "text": "When the king of Ai saw it, he hurried and rose up early, and the men of the city went out against Israel to battle, he and all his people, at the appointed place before the plain. But he did not know there was an ambush against him behind the city.",
      "links": "<a href='/AIV/6/8/4-6'>Josh. 8:4-6</a>",
      "comment": "The ignorance of Ai's king highlights the blindness that pride brings, a frequent theme attributed to spiritual opposition throughout Scripture."
    },
    {
      "pk": 6008015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 15,
      "text": "Joshua and all Israel pretended to be beaten before them and fled by the way of the wilderness.",
      "links": "<a href='/AIV/6/7/5'>Josh. 7:5</a>",
      "comment": "Israel’s feigned retreat is a feint, showing wisdom in weakness—a tactic mirrored by Christ’s seeming defeat at the Cross, which led to victory."
    },
    {
      "pk": 6008016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 16,
      "text": "All the people in Ai were called together to pursue them. So they pursued Joshua and were drawn away from the city.",
      "links": "<a href='/AIV/6/8/6'>Josh. 8:6</a>",
      "comment": "Leaving the city unguarded exposes Ai to defeat. This highlights how disordered desires lead away from security, resonant with spiritual parallels throughout Scripture."
    },
    {
      "pk": 6008017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 17,
      "text": "Not a man was left in Ai or Bethel who did not go out after Israel. They left the city open and pursued Israel.",
      "links": "<a href='/AIV/6/8/14'>Josh. 8:14</a>",
      "comment": "A complete emptying of the city shows how a divided heart leaves one spiritually vulnerable, as seen in warnings against spiritual neglect."
    },
    {
      "pk": 6008018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 18,
      "text": "Then the LORD said to Joshua, \"Stretch out the javelin that is in your hand toward Ai, for I will give it into your hand.\" So Joshua stretched out the javelin toward the city.",
      "links": "<a href='/AIV/6/8/26'>Josh. 8:26</a>; <a href='/AIV/7/15/15'>Judg. 15:15</a>",
      "comment": "The act of stretching out the javelin mirrors Moses’ staff at the Red Sea. Symbolically, it serves as a sign of faith and authority conferred by God."
    },
    {
      "pk": 6008019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 19,
      "text": "The ambush rose quickly from their place, ran as soon as he had stretched out his hand, and entered the city, took it, and hurried to set the city on fire.",
      "links": "<a href='/AIV/6/8/7-8'>Josh. 8:7-8</a>",
      "comment": "Prompt obedience brings swift victory, displaying that responsiveness to divine signals is essential for both spiritual and temporal triumphs."
    },
    {
      "pk": 6008020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 20,
      "text": "When the men of Ai looked back, they saw smoke rising from the city. They could not escape in any direction, because the people who had fled toward the wilderness turned upon their pursuers.",
      "links": "<a href='/AIV/6/8/21'>Josh. 8:21</a>; <a href='/AIV/1/19/27-28'>Gen. 19:27-28</a>",
      "comment": "Smoke as a sign of judgment and defeat parallels other biblical instances, such as Sodom, representing the certainty of God's justice."
    },
    {
      "pk": 6008021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 21,
      "text": "When Joshua and all Israel saw that the ambush had taken the city and the smoke was rising from it, they turned back and struck down the men of Ai.",
      "links": "<a href='/AIV/6/8/19-20'>Josh. 8:19-20</a>",
      "comment": "Israel's reversal echoes spiritual themes of repentance and return, where turning back to God brings restoration and renewal."
    },
    {
      "pk": 6008022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 22,
      "text": "Others came out of the city against them, so they were trapped in the midst of Israel, some on this side and some on that side. They struck them down until no survivor or fugitive remained.",
      "links": "<a href='/AIV/6/10/20'>Josh. 10:20</a>",
      "comment": "The completeness of the victory emphasizes the total consecration demanded by God. Spiritually, it’s a reminder to root out evil fully from one’s life."
    },
    {
      "pk": 6008023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 23,
      "text": "But they took the king of Ai alive and brought him to Joshua.",
      "links": "<a href='/AIV/6/10/22'>Josh. 10:22</a>",
      "comment": "Capturing the king for public judgment models justice and order, reflecting both civil and spiritual authority structures in God’s purposes."
    },
    {
      "pk": 6008024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 24,
      "text": "When Israel had finished killing all the inhabitants of Ai in the open country where they pursued them, and all had fallen by the edge of the sword, all Israel returned to Ai and struck it with the sword.",
      "links": "<a href='/AIV/6/10/28'>Josh. 10:28</a>",
      "comment": "The execution of judgment is universal. The sword is a motif for God’s word as both judgment and truth, echoed throughout the New Testament."
    },
    {
      "pk": 6008025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 25,
      "text": "All who fell that day, both men and women, were twelve thousand—all the people of Ai.",
      "links": "<a href='/AIV/6/8/1-2'>Josh. 8:1-2</a>",
      "comment": "The number twelve-thousand may carry symbolic weight, as twelve is a number of completeness and authority throughout Scripture."
    },
    {
      "pk": 6008026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 26,
      "text": "Joshua did not withdraw the javelin with which he stretched out his hand until he had utterly destroyed all the inhabitants of Ai.",
      "links": "<a href='/AIV/6/8/18'>Josh. 8:18</a>; <a href='/AIV/2/17/11'>Ex. 17:11</a>",
      "comment": "Joshua's perseverance parallels Moses holding up his hands in battle, connecting the need for steadfast intercession and leadership, a lesson for all spiritual leaders."
    },
    {
      "pk": 6008027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 27,
      "text": "Israel took only the cattle and the spoil of that city for themselves, as the LORD had commanded Joshua.",
      "links": "<a href='/AIV/6/8/2'>Josh. 8:2</a>",
      "comment": "Obedience to specific divine command allowed Israel to benefit materially, foreshadowing spiritual rewards promised for fidelity to God."
    },
    {
      "pk": 6008028,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 28,
      "text": "So, Joshua burned Ai and made it a heap forever, a desolation to this day.",
      "links": "<a href='/AIV/6/6/24'>Josh. 6:24</a>; <a href='/AIV/6/8/8'>Josh. 8:8</a>",
      "comment": "The city’s permanent destruction symbolizes eternal consequences for sin and rebellion, reinforcing the biblical message of judgment."
    },
    {
      "pk": 6008029,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 29,
      "text": "He hanged the king of Ai on a tree until evening. At sunset, Joshua commanded, and they took his body down from the tree, threw it at the entrance of the city gate, and raised a great heap of stones over it, which remains to this day.",
      "links": "<a href='/AIV/5/21/22-23'>Deut. 21:22-23</a>; <a href='/AIV/6/7/25-26'>Josh. 7:25-26</a>; <a href='/AIV/48/3/13'>Gal. 3:13</a>",
      "comment": "The hanging and removal before nightfall follows Mosaic Law, prefiguring later themes of cursedness and redemption, as Christ would bear the curse and be removed from the cross before night (see Galatians 3:13)."
    },
    {
      "pk": 6008030,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 30,
      "text": "Then Joshua built an altar to the LORD, the God of Israel, on Mount Ebal,",
      "links": "<a href='/AIV/5/27/4-5'>Deut. 27:4-5</a>",
      "comment": "The construction of an altar marks the renewal of covenant worship and remembrance of God’s saving acts—an important pattern for Christian spiritual life, showing the link between sacrifice and community."
    },
    {
      "pk": 6008031,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 31,
      "text": "just as Moses, the servant of the LORD, had commanded the sons of Israel, as it is written in the Book of the Law of Moses: an altar of uncut stones, upon which no iron tool had been used. They offered burnt offerings to the LORD on it, and sacrificed peace offerings.",
      "links": "<a href='/AIV/5/27/5-7'>Deut. 27:5-7</a>; <a href='/AIV/2/20/25'>Ex. 20:25</a>",
      "comment": "Observing the Law exactly points to a continuity in worship and the sacrificial system. Burnt and peace offerings prefigure the need for both atonement and communion with God, themes fulfilled in Christ."
    },
    {
      "pk": 6008032,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 32,
      "text": "He wrote there on the stones a copy of the Law of Moses, which he had written in the presence of the sons of Israel.",
      "links": "<a href='/AIV/5/27/8'>Deut. 27:8</a>",
      "comment": "Inscribing the Law makes it visible and accessible, mirroring the importance of scriptural tradition and transmission for all generations."
    },
    {
      "pk": 6008033,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 33,
      "text": "All Israel, with their elders, officers, and judges, were standing on both sides of the ark before the priests, the Levites, who carried the ark of the covenant of the LORD, both the stranger and the native. Half of them stood in front of Mount Gerizim and half of them before Mount Ebal, as Moses the servant of the LORD had commanded, to bless the people of Israel first.",
      "links": "<a href='/AIV/5/27/11-13'>Deut. 27:11-13</a>",
      "comment": "The entire community is gathered in covenant renewal, both leaders and common people. The division reflects liturgical practices and the unity between Law and blessing."
    },
    {
      "pk": 6008034,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 34,
      "text": "Afterward he read all the words of the law, the blessing and the curse, according to all that is written in the Book of the Law.",
      "links": "<a href='/AIV/5/27/14-26'>Deut. 27:14-26</a>; <a href='/AIV/5/28/1-68'>Deut. 28:1-68</a>",
      "comment": "Reading both the blessings and curses emphasizes the reality of God’s judgment and mercy. The foundation of God's people rests on fidelity to His Word."
    },
    {
      "pk": 6008035,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 8,
      "verse": 35,
      "text": "There was not a word of all that Moses had commanded that Joshua did not read before all the assembly of Israel, with the women, the little ones, and the strangers who were living among them.",
      "links": "<a href='/AIV/5/31/12'>Deut. 31:12</a>; <a href='/AIV/6/8/33'>Josh. 8:33</a>",
      "comment": "The inclusion of women, children, and foreigners points to the universality of God’s covenant. The public proclamation of the entire Law models comprehensive teaching and tradition."
    }
  ],
  "translatedAt": "2025-12-24T02:20:32.846Z"
}