{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 6,
  "verses": [
    {
      "pk": 6006001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 1,
      "text": "Now Jericho was tightly shut up because of the Israelites. No one went out, and no one came in.",
      "links": "<a href='/AIV/4/13/29'>Num. 13:29</a>; <a href='/AIV/6/2/9-11'>Josh. 2:9-11</a>",
      "comment": "Jericho's gates are closed in fear of Israel, showing how God had already begun to put dread of His people in the hearts of their enemies (see Josh. 2:9-11)."
    },
    {
      "pk": 6006002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 2,
      "text": "Then the LORD said to Joshua, 'See, I have given Jericho into your hand, along with its king and its mighty warriors.'",
      "links": "<a href='/AIV/6/1/3'>Josh. 1:3</a>; <a href='/AIV/6/8/1'>Josh. 8:1</a>",
      "comment": "God speaks in the past tense, confirming His sovereignty: the victory is certain, even before the battle starts (cf. Josh. 1:3)."
    },
    {
      "pk": 6006003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 3,
      "text": "You shall march around the city, all the men of war going around the city once. You shall do this for six days.",
      "links": "<a href='/AIV/11/20/29'>1 Kings 20:29</a>",
      "comment": "The unusual strategy highlights that the victory will be by God's power, not human strength (see 2 Cor. 4:7 for a spiritual application)."
    },
    {
      "pk": 6006004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 4,
      "text": "Seven priests shall carry seven trumpets of rams' horns before the Ark. On the seventh day you shall march around the city seven times, and the priests shall blow the trumpets.",
      "links": "<a href='/AIV/3/25/9'>Lev. 25:9</a>; <a href='/AIV/6/6/13'>Josh. 6:13</a>",
      "comment": "The number seven signifies completeness and perfection in the Bible (Gen. 2:2-3; Rev. 1:4). The Ark's central place points to God's real presence among His people—a foreshadow of the incarnate Christ (John 1:14)."
    },
    {
      "pk": 6006005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 5,
      "text": "When they make a sustained blast with the ram’s horn and you hear the sound of the trumpet, all the people shall shout with a great shout. Then the wall of the city will fall down flat, and the people shall go up, every man straight ahead.",
      "links": "<a href='/AIV/11/1/6'>1 Kings 1:6</a>; <a href='/AIV/14/13/14'>2 Chr. 13:14-15</a>",
      "comment": "Obedience and faith lead to victory by divine intervention—not military power. The ‘shout’ and walls falling prefigure miraculous acts in the New Testament (Acts 16:26)."
    },
    {
      "pk": 6006006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 6,
      "text": "So Joshua son of Nun called the priests and said to them, 'Take up the Ark of the Covenant, and let seven priests carry seven trumpets of rams’ horns before the Ark of the LORD.'",
      "links": "<a href='/AIV/4/4/15'>Num. 4:15</a>; <a href='/AIV/6/3/3'>Josh. 3:3</a>",
      "comment": "Joshua’s precise repetition of God’s commands demonstrates the importance of authoritative leadership and faithfulness to divine instruction (Heb. 13:7, 17)."
    },
    {
      "pk": 6006007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 7,
      "text": "And he said to the people, 'Advance! March around the city, and let the armed men go before the Ark of the LORD.'",
      "links": "<a href='/AIV/7/7/20'>Judg. 7:20</a>",
      "comment": "The people are led in ordered procession, similar to worship processions (see Ps. 68:24-27). The close tie between worship and warfare reflects the unity of spiritual and practical obedience."
    },
    {
      "pk": 6006008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 8,
      "text": "As soon as Joshua had spoken to the people, the seven priests carrying the seven trumpets of rams’ horns before the LORD moved forward and blew the trumpets. The Ark of the Covenant of the LORD followed them.",
      "links": "<a href='/AIV/6/3/6'>Josh. 3:6</a>; <a href='/AIV/2/25/10'>Ex. 25:10</a>",
      "comment": "God’s tangible presence accompanies His people into battle. The trumpets proclaim both judgment and salvation (cf. 1 Thess. 4:16)."
    },
    {
      "pk": 6006009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 9,
      "text": "The armed men went before the priests blowing the trumpets, and the rear guard came after the Ark, while the trumpets kept sounding.",
      "links": "<a href='/AIV/4/10/25'>Num. 10:25</a>",
      "comment": "The procession's structure around the Ark illustrates the primacy of God's presence in the life and victory of the people—a spiritual lesson for all worship and mission."
    },
    {
      "pk": 6006010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 10,
      "text": "Now Joshua had commanded the people, 'Do not shout or let your voice be heard; do not let a word come out of your mouth until the day I tell you to shout. Then you shall shout.'",
      "links": "<a href='/AIV/14/20/20'>2 Chr. 20:20</a>",
      "comment": "The command for silence heightens the sense of anticipation and obedience, reflecting a meditative, controlled discipline in worship and warfare."
    },
    {
      "pk": 6006011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 11,
      "text": "So he had the Ark of the LORD circle the city, going around it once. Then they came into the camp and spent the night in the camp.",
      "links": "<a href='/AIV/6/14/6'>Josh. 14:6</a>",
      "comment": "Their daily return to the camp implies trust in the process and the rhythm of persistence, another spiritual discipline seen in later covenant life."
    },
    {
      "pk": 6006012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 12,
      "text": "Joshua rose early in the morning, and the priests took up the Ark of the LORD.",
      "links": "<a href='/AIV/6/3/1'>Josh. 3:1</a>",
      "comment": "Rising early to serve God is a pattern throughout Scripture (Gen. 22:3; Ps. 63:1), indicating zeal and readiness for obedience."
    },
    {
      "pk": 6006013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 13,
      "text": "The seven priests bearing seven trumpets of rams’ horns before the Ark of the LORD went on continually, and blew the trumpets. The armed men went before them, and the rear guard followed after the Ark of the LORD, while the trumpets kept sounding.",
      "links": "<a href='/AIV/6/6/8'>Josh. 6:8</a>",
      "comment": "The ongoing blowing of trumpets during the march is reminiscent of the liturgical traditions of sound and movement, reinforcing communal worship."
    },
    {
      "pk": 6006014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 14,
      "text": "On the second day they marched around the city once and returned to the camp. They did this for six days.",
      "links": "<a href='/AIV/6/6/3'>Josh. 6:3</a>",
      "comment": "The repetition of the ritual over six days cultivates perseverance and communal discipline, both essential for God’s covenant people."
    },
    {
      "pk": 6006015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 15,
      "text": "Then on the seventh day, they rose early at daybreak, and marched around the city in the same manner seven times. It was only on that day that they marched around the city seven times.",
      "links": "<a href='/AIV/6/6/4'>Josh. 6:4</a>",
      "comment": "Rising early reflects eagerness and dedication (Ps. 5:3). The emphasis on “seventh” day and “seven” times echoes God’s pattern for sacred things (see Ex. 16:26, Lev. 23:15)."
    },
    {
      "pk": 6006016,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 16,
      "text": "At the seventh time, when the priests had blown the trumpets, Joshua said to the people, 'Shout! For the LORD has given you the city.'",
      "links": "<a href='/AIV/8/6/1'>1 Sam. 6:1</a>",
      "comment": "The shout is an act of faith. The pattern of seven and the sacred shout foreshadow new covenant liturgy, with the people participating in God’s work."
    },
    {
      "pk": 6006017,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 17,
      "text": "The city and all that is in it shall be devoted to the LORD for destruction. Only Rahab the prostitute and all who are with her in her house shall live, because she hid the messengers whom we sent.",
      "links": "<a href='/AIV/6/2/1'>Josh. 2:1</a>; <a href='/AIV/58/11/31'>Heb. 11:31</a>; <a href='/AIV/59/2/25'>James 2:25</a>",
      "comment": "Devoting (herem) the city means it is set apart wholly for God (see Lev. 27:28-29). Rahab’s salvation is a sign of faith and prefigures how God includes Gentiles who trust Him."
    },
    {
      "pk": 6006018,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 18,
      "text": "But you, keep yourselves from the things devoted to destruction, lest when you have devoted them you take any of the devoted things and make the camp of Israel liable to destruction and bring trouble upon it.",
      "links": "<a href='/AIV/6/7/1'>Josh. 7:1</a>; <a href='/AIV/3/10/12-13'>Lev. 10:12-13</a>",
      "comment": "Faithful stewardship and obedience to God’s commands are critical. Disobedience brings communal consequences (see 1 Cor. 5:6-8), underscoring the believers’ mutual responsibility."
    },
    {
      "pk": 6006019,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 19,
      "text": "But all the silver and gold, and vessels of bronze and iron, are holy to the LORD; they shall go into the treasury of the LORD.",
      "links": "<a href='/AIV/4/31/54'>Num. 31:54</a>; <a href='/AIV/11/7/51'>1 Kings 7:51</a>",
      "comment": "The materials are consecrated as an offering, prefiguring the future wealth gathered and sanctified for God’s purposes, as in the building of the temple (1 Kings 7:51)."
    },
    {
      "pk": 6006020,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 20,
      "text": "So the people shouted, and the trumpets were blown. As soon as the people heard the sound of the trumpet, the people shouted a great shout, and the wall fell down flat, so that the people went up into the city, every man straight before him, and they captured the city.",
      "links": "<a href='/AIV/58/11/30'>Heb. 11:30</a>",
      "comment": "God grants victory through the faith and obedience of the people (Heb. 11:30). There is a parallel here to the fall of barriers in the spiritual life, overcome by faith in God’s promise."
    },
    {
      "pk": 6006021,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 21,
      "text": "Then they utterly destroyed with the edge of the sword all in the city, both men and women, young and old, oxen, sheep, and donkeys.",
      "links": "<a href='/AIV/5/20/16-18'>Deut. 20:16-18</a>; <a href='/AIV/6/8/26'>Josh. 8:26</a>",
      "comment": "Such destruction seems harsh but must be read in light of God’s justice and the depth of Jericho’s depravity (Gen. 15:16; Deut. 20:16-18). Even so, the mercy shown to Rahab is a sign of God’s universal plan for salvation."
    },
    {
      "pk": 6006022,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 22,
      "text": "But Joshua said to the two men who had spied out the country, 'Go into the prostitute’s house and bring out the woman and all who belong to her, as you promised to her.'",
      "links": "<a href='/AIV/6/2/14'>Josh. 2:14</a>",
      "comment": "Keeping the promise to Rahab highlights the faithfulness required in God’s people. It also emphasizes the inclusion of all who turn in faith, regardless of background."
    },
    {
      "pk": 6006023,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 23,
      "text": "So the young men who had done the spying went in and brought out Rahab, her father, her mother, her brothers, and all who belonged to her. They brought out all her relatives and set them outside the camp of Israel.",
      "links": "<a href='/AIV/6/2/18'>Josh. 2:18</a>",
      "comment": "Rahab and her family are set apart from the immediate encampment as a process of incorporation into Israel, which prefigures the careful and gradual assimilation of new believers into the covenant community, a pattern continued in the early church (Acts 15:28-29)."
    },
    {
      "pk": 6006024,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 24,
      "text": "Then they burned the city with fire and all that was in it. Only the silver and gold, and the vessels of bronze and iron, they put into the treasury of the house of the LORD.",
      "links": "<a href='/AIV/6/6/19'>Josh. 6:19</a>",
      "comment": "The total destruction emphasizes radical separation from idolatry. Setting apart valuables for the Lord points to sacrificial offerings, a foreshadow of later giving for sacred purposes."
    },
    {
      "pk": 6006025,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 25,
      "text": "But Rahab the prostitute, her father's household, and all who belonged to her, Joshua spared. She has lived in Israel to this day because she hid the messengers whom Joshua sent to spy out Jericho.",
      "links": "<a href='/AIV/58/11/31'>Heb. 11:31</a>; <a href='/AIV/40/1/5'>Matt. 1:5</a>",
      "comment": "Rahab’s continued presence in Israel demonstrates the lasting inclusion of the repentant. In fact, she becomes an ancestor of Jesus (Matt. 1:5), underscoring the transformative power of faith and obedience."
    },
    {
      "pk": 6006026,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 26,
      "text": "Joshua laid an oath at that time, saying, 'Cursed is the man before the LORD who rises up and rebuilds this city, Jericho. At the cost of his firstborn shall he lay its foundation, and at the cost of his youngest son shall he set up its gates.'",
      "links": "<a href='/AIV/11/16/34'>1 Kings 16:34</a>",
      "comment": "The curse pronounced is fulfilled in 1 Kings 16:34. This curse signals the danger of violating God’s commands and the spiritual consequence of disobedience, further affirming the leader’s authority to bind and loose for the good of the community (see Matt. 16:19)."
    },
    {
      "pk": 6006027,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 6,
      "verse": 27,
      "text": "So the LORD was with Joshua, and his fame spread throughout all the land.",
      "links": "<a href='/AIV/6/3/7'>Josh. 3:7</a>; <a href='/AIV/6/4/14'>Josh. 4:14</a>",
      "comment": "God’s presence with Joshua authenticates his commission and authority. The spread of Joshua’s fame prefigures how God exalts those who faithfully serve Him and remain true to the covenant community."
    }
  ],
  "translatedAt": "2025-12-24T02:19:22.752Z"
}