{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 10,
  "verses": [
    {
      "pk": 30010001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 1,
      "text": "Hear the word that the Lord speaks to you, O house of Israel.",
      "links": "<a href='/AIV/23/1/2'>Isa. 1:2</a>; <a href='/AIV/24/2/4'>Jer. 2:4</a>",
      "comment": "Jeremiah addresses the people with a call to listen, establishing God's authority over Israel. This theme of divine direction is common in prophetic literature."
    },
    {
      "pk": 30010002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 2,
      "text": "Thus says the Lord: 'Do not learn the way of the nations, nor be dismayed at the signs of the heavens, though the nations are dismayed at them.'",
      "links": "<a href='/AIV/24/13/1'>Jer. 13:1</a>; <a href='/AIV/19/96/5'>Ps. 96:5</a>",
      "comment": "God warns against adopting pagan customs or being fearful of astrological signs. This underscores the importance of worship rooted in truth, foreshadowing the fullness of revelation."
    },
    {
      "pk": 30010003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 3,
      "text": "For the customs of the peoples are worthless; they cut wood from the forest, a craftsman shapes it with his chisel.",
      "links": "<a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Idol making is condemned as vanity. The distinction between created things and the Creator sharpens the contrast between true worship and false worship. Compare with Isa. 44 and Ps. 115."
    },
    {
      "pk": 30010004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 4,
      "text": "They decorate it with silver and gold; they fasten it with hammer and nails so it will not move.",
      "links": "<a href='/AIV/19/135/15'>Ps. 135:15</a>; <a href='/AIV/24/10/9'>Jer. 10:9</a>",
      "comment": "The elaborate process of idol decoration is mocked, highlighting the futility of worshipping the work of human hands. See recurring themes in Psalms on idols’ inability."
    },
    {
      "pk": 30010005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 5,
      "text": "Like a scarecrow in a melon field, their idols cannot speak. They must be carried because they cannot walk. Do not be afraid of them, for they cannot do harm nor any good.",
      "links": "<a href='/AIV/19/115/5-7'>Ps. 115:5-7</a>",
      "comment": "Idols are dead and powerless—this literal imagery points to the necessity of a living, personal God. Note how Christ later embodies God’s living presence among us."
    },
    {
      "pk": 30010006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 6,
      "text": "There is none like you, O Lord; you are great, and your name is mighty in power.",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/89/6-8'>Ps. 89:6-8</a>",
      "comment": "A hymn proclaiming the uniqueness and greatness of God. The worship of God as singular majesty sets a foundation leading toward deeper communal adoration and liturgical praise."
    },
    {
      "pk": 30010007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 7,
      "text": "Who would not fear you, O King of the nations? For this is your due. Among all the wise men of the nations and in all their kingdoms, there is none like you.",
      "links": "<a href='/AIV/19/47/7'>Ps. 47:7</a>; <a href='/AIV/23/40/18-19'>Isa. 40:18-19</a>",
      "comment": "God stands above all earthly wisdom and power. The reverence due to God prefigures the universal worship believers are called to within the one body of Christ."
    },
    {
      "pk": 30010008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 8,
      "text": "They are altogether senseless and foolish; their idols are mere wood, a worthless doctrine.",
      "links": "<a href='/AIV/19/135/16'>Ps. 135:16</a>; <a href='/AIV/45/1/22-23'>Rom. 1:22-23</a>",
      "comment": "Idolatry is equated with emptiness and false teaching. Paul’s later critique in Romans echoes this condemnation, contrasting faith in the living God with false belief."
    },
    {
      "pk": 30010009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 9,
      "text": "Silver beaten into plates is brought from Tarshish, and gold from Uphaz, the work of a craftsman and of the hands of a goldsmith. Their clothes are blue and purple—all made by skilled workers.",
      "links": "<a href='/AIV/27/10/5'>Dan. 10:5</a>; <a href='/AIV/24/52/16'>Jer. 52:16</a>",
      "comment": "Descriptions highlight costly and artful production of idols, yet they remain powerless. The detailed worship preparations point toward the proper reverence found in genuine worship."
    },
    {
      "pk": 30010010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 10,
      "text": "But the Lord is the true God; he is the living God and the everlasting King. When he is angry, the earth trembles, and the nations cannot endure his wrath.",
      "links": "<a href='/AIV/19/42/2'>Ps. 42:2</a>; <a href='/AIV/24/23/36'>Jer. 23:36</a>",
      "comment": "God’s living reality stands in contrast to lifeless idols. The language anticipates the incarnation: Christ as God living among us. Note the reference to God’s kingship."
    },
    {
      "pk": 30010011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 11,
      "text": "Thus shall you say to them: 'The gods who did not make the heavens and the earth shall perish from the earth and from under the heavens.'",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>; <a href='/AIV/44/14/15'>Acts 14:15</a>",
      "comment": "Jeremiah issues a judgment against false gods. This verse is unique in Aramaic, likely to address foreign worshippers. See Paul’s preaching in Acts for continuity of this condemnation."
    },
    {
      "pk": 30010012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 12,
      "text": "He made the earth by his power, established the world by his wisdom, and stretched out the heavens by his understanding.",
      "links": "<a href='/AIV/24/51/15'>Jer. 51:15</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "God’s creative power is emphasized. This ordering by wisdom and understanding hints at the Logos concept fulfilled in Christ (John 1:1-3) and the Church’s teaching on creation."
    },
    {
      "pk": 30010013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 13,
      "text": "When he utters his voice, there is a rush of water in the heavens, and he makes the clouds rise from the ends of the earth. He makes lightning for the rain and brings out the wind from his storehouses.",
      "links": "<a href='/AIV/19/135/7'>Ps. 135:7</a>; <a href='/AIV/24/51/16'>Jer. 51:16</a>",
      "comment": "God controls the elements, unlike powerless idols. Water, lightning, and wind symbolize divine sovereignty. See also Psalms. This physical imagery foreshadows later sacramental use of elements."
    },
    {
      "pk": 30010014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 14,
      "text": "Every man is senseless and without knowledge; every goldsmith is put to shame by his idols, for his images are false, and there is no breath in them.",
      "links": "<a href='/AIV/24/51/17'>Jer. 51:17</a>; <a href='/AIV/19/135/17'>Ps. 135:17</a>",
      "comment": "Human effort cannot create life. Only God gives breath and existence. This physical-spiritual distinction prepares the way for later teachings about the indwelling Spirit."
    },
    {
      "pk": 30010015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 15,
      "text": "They are worthless, a work of deception; at the time of their punishment they shall perish.",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>; <a href='/AIV/24/51/18'>Jer. 51:18</a>",
      "comment": "Idols will be destroyed; only the true God persists. A subtle reminder of the permanence of the Church built upon true belief."
    },
    {
      "pk": 30010016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 16,
      "text": "The portion of Jacob is not like these, for he is the Maker of all things, and Israel is the tribe of his inheritance; the Lord of hosts is his name.",
      "links": "<a href='/AIV/24/51/19'>Jer. 51:19</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "God’s people receive a special inheritance. The language of 'portion' and 'Maker' aligns with themes of election and spiritual authority later expounded by the apostles."
    },
    {
      "pk": 30010017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 17,
      "text": "Gather up your belongings from the land, O you who dwell under siege.",
      "links": "<a href='/AIV/24/21/4-10'>Jer. 21:4-10</a>",
      "comment": "A call to prepare for exile. The motif of pilgrimage and preparation anticipates Christian life as a journey toward ultimate fulfillment."
    },
    {
      "pk": 30010018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 18,
      "text": "For thus says the Lord: 'Behold, I will fling out the inhabitants of the land at this time, and will distress them that they may feel it.'",
      "links": "<a href='/AIV/24/9/16'>Jer. 9:16</a>; <a href='/AIV/24/15/4'>Jer. 15:4</a>",
      "comment": "Judgment is coming; suffering is allowed for the purpose of awakening. Such passages echo the discipline seen in the life of the Church and redemptive suffering."
    },
    {
      "pk": 30010019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 19,
      "text": "Woe is me because of my brokenness! My wound is severe. But I said, 'Truly, this is my grief, and I must bear it.'",
      "links": "<a href='/AIV/24/8/21'>Jer. 8:21</a>; <a href='/AIV/19/38/17'>Ps. 38:17</a>",
      "comment": "A lament echoes the suffering servant imagery. Personal acceptance of suffering here mirrors themes later fulfilled in Christ and the saints."
    },
    {
      "pk": 30010020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 20,
      "text": "My tent is destroyed, and all my cords are broken; my children have gone from me, and they are no more; there is no one to stretch out my tent or set up my curtains.",
      "links": "<a href='/AIV/24/4/20'>Jer. 4:20</a>; <a href='/AIV/25/1/1'>Lam. 1:1</a>",
      "comment": "Aftermath of judgment—Israel’s loss evokes the scattering and longing for restoration. The tent motif anticipates later themes of tabernacle and Temple fulfilled in Christ’s Church."
    },
    {
      "pk": 30010021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 21,
      "text": "The shepherds are senseless and do not seek the Lord. Therefore they do not prosper, and all their flock is scattered.",
      "links": "<a href='/AIV/24/23/1-4'>Jer. 23:1-4</a>; <a href='/AIV/26/34/5'>Ezek. 34:5</a>",
      "comment": "Leaders fail their people. This sharp critique of shepherds sets the stage for the Good Shepherd, Christ, whose authority is exercised visibly through the Church’s structure."
    },
    {
      "pk": 30010022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 22,
      "text": "A noise of great commotion from the north—the cities of Judah will be laid waste and become a haunt for jackals.",
      "links": "<a href='/AIV/24/1/14-15'>Jer. 1:14-15</a>; <a href='/AIV/19/44/19'>Ps. 44:19</a>",
      "comment": "The destruction from the north anticipates Babylon’s invasion. Judgment points toward need for restoration and unity, a theme later central in the apostles’ teachings."
    },
    {
      "pk": 30010023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 23,
      "text": "I know, O Lord, that the way of man is not in himself; it is not for man who walks to direct his steps.",
      "links": "<a href='/AIV/19/37/23'>Ps. 37:23</a>; <a href='/AIV/20/16/9'>Prov. 16:9</a>",
      "comment": "Acknowledgment of human dependence on divine guidance. Submission to God’s will is foundational, and later finds full expression in the life of disciples and Church tradition."
    },
    {
      "pk": 30010024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 24,
      "text": "Correct me, O Lord, but with justice; not in your anger, lest you bring me to nothing.",
      "links": "<a href='/AIV/19/6/1'>Ps. 6:1</a>; <a href='/AIV/19/38/1'>Ps. 38:1</a>",
      "comment": "A plea for merciful correction. The balance of justice and mercy is central to later theology, especially regarding God’s discipline of His people."
    },
    {
      "pk": 30010025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 10,
      "verse": 25,
      "text": "Pour out your wrath on the nations that do not know you, on the peoples who do not call on your name. For they have devoured Jacob; they have consumed him and made his habitation desolate.",
      "links": "<a href='/AIV/19/79/6-7'>Ps. 79:6-7</a>; <a href='/AIV/24/25/15-29'>Jer. 25:15-29</a>",
      "comment": "Request for God’s judgment on the wicked. God’s justice serves to vindicate His people, which prefigures the final restoration and unity of all who truly worship Him."
    }
  ],
  "translatedAt": "2025-12-24T08:26:48.919Z"
}