{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 14,
  "verses": [
    {
      "pk": 30014001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 1,
      "text": "This is the word of the LORD that came to Jeremiah concerning the drought:",
      "links": "",
      "comment": "The context is a devastating drought sent by God as a judgment. This sets the stage for the dialogue between God and His prophet. Compare the prophetic motif of signs in <a href='/AIV/11/17/1'>1 Kings 17:1</a> and <a href='/AIV/12/8/1-2'>2 Kings 8:1-2</a>."
    },
    {
      "pk": 30014002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 2,
      "text": "Judah mourns, and her gates languish; they sit on the ground in mourning, and the cry of Jerusalem ascends up.",
      "links": "<a href='/AIV/25/1/4'>Lam. 1:4</a>; <a href='/AIV/23/3/26'>Isa. 3:26</a>",
      "comment": "The imagery of gates personifies the suffering of the people. Ancient mourning customs involved sitting on the ground, signifying deep lament."
    },
    {
      "pk": 30014003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 3,
      "text": "The nobles send their servants for water; they come to the cisterns and find no water. They return with empty vessels; they are ashamed and confounded and cover their heads.",
      "links": "<a href='/AIV/28/4/3'>Hos. 4:3</a>; <a href='/AIV/23/29/22'>Isa. 29:22</a>",
      "comment": "This communal shame reflects both physical and spiritual desolation. Covering the head is a sign of grief (cf. <a href='/AIV/10/15/30'>2 Sam. 15:30</a>). The nobles’ power is useless when God’s blessing is withdrawn."
    },
    {
      "pk": 30014004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 4,
      "text": "Because the ground is cracked, since there is no rain in the land, the farmers are ashamed; they cover their heads.",
      "links": "<a href='/AIV/29/1/10-12'>Joel 1:10-12</a>",
      "comment": "Desolation affects all—from rulers to farmers. Lack of rain is a frequent sign of covenant curse (<a href='/AIV/05/28/23-24'>Deut. 28:23-24</a>)."
    },
    {
      "pk": 30014005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 5,
      "text": "Even the doe in the field abandons her newborn calf because there is no grass.",
      "links": "<a href='/AIV/18/39/1-4'>Job 39:1-4</a>; <a href='/AIV/29/1/18-20'>Joel 1:18-20</a>",
      "comment": "Nature itself groans from the effects of sin in the world (cf. <a href='/AIV/45/8/22'>Rom. 8:22</a>). The suffering of even innocent animals highlights the depth of the people’s predicament."
    },
    {
      "pk": 30014006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 6,
      "text": "Wild donkeys stand on the barren heights; they pant for air like jackals. Their eyes fail because there is no grass.",
      "links": "<a href='/AIV/29/1/20'>Joel 1:20</a>",
      "comment": "The wild donkeys, animals adapted to drought, are desperate. Such imagery shows how complete God’s judgment is."
    },
    {
      "pk": 30014007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 7,
      "text": "Though our iniquities testify against us, O LORD, act for Your name’s sake; for our backslidings are many; we have sinned against You.",
      "links": "<a href='/AIV/19/25/11'>Ps. 25:11</a>; <a href='/AIV/27/9/18-19'>Dan. 9:18-19</a>",
      "comment": "Jeremiah appeals for mercy based not on Israel’s merit, but God’s holy name—anticipating the New Testament’s teaching on intercessory prayer and the nature of repentance."
    },
    {
      "pk": 30014008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 8,
      "text": "O Hope of Israel, its Savior in times of trouble, why are you like a stranger in the land, like a traveler who turns aside to stay for a night?",
      "links": "<a href='/AIV/19/39/7'>Ps. 39:7</a>; <a href='/AIV/23/63/17'>Isa. 63:17</a>",
      "comment": "Israel calls God their ‘Hope’ and ‘Savior’. The imagery of God as a temporary visitor sets up a longing for God to dwell permanently among His people as fulfilled in Christ (see <a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 30014009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 9,
      "text": "Why should you be like a man stunned, like a mighty warrior who cannot save? Yet you, O LORD, are in our midst, and we are called by your name. Do not forsake us!",
      "links": "<a href='/AIV/26/48/35'>Ezek. 48:35</a>; <a href='/AIV/04/6/27'>Num. 6:27</a>",
      "comment": "God remains present despite outward appearance. In Christ, the divine presence is realized in the fullness of the Messiah’s indwelling. This is a model prayer in times of seeming forsakenness."
    },
    {
      "pk": 30014010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 10,
      "text": "Thus says the LORD about this people: They have loved to wander; they have not restrained their feet. Therefore, the LORD does not accept them. Now he will remember their iniquity and punish their sins.",
      "links": "<a href='/AIV/28/8/13'>Hos. 8:13</a>; <a href='/AIV/23/63/10'>Isa. 63:10</a>",
      "comment": "God’s patience has limits; unrepentant wandering leads to punishment. Compare this theme with Christ’s Parable of the Prodigal Son (<a href='/AIV/42/15/13'>Luke 15:13</a>), showing the necessity to return fully to God."
    },
    {
      "pk": 30014011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 11,
      "text": "Then the LORD said to me: Do not pray for the good of this people.",
      "links": "<a href='/AIV/24/7/16'>Jer. 7:16</a>",
      "comment": "God’s instruction to refrain from interceding underscores the severe judgment. This foreshadows the seriousness of continually rejecting God’s grace."
    },
    {
      "pk": 30014012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 12,
      "text": "Though they fast, I will not listen to their cry; though they offer burnt offering and grain offering, I will not accept them. But I will consume them by the sword, by famine, and by plague.",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>; <a href='/AIV/28/5/6'>Hos. 5:6</a>",
      "comment": "Outward rituals without inward repentance are ineffective. The triad of sword, famine, and plague recurs as symbols of covenant curse (cf. <a href='/AIV/26/14/21'>Ezek. 14:21</a>)."
    },
    {
      "pk": 30014013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 13,
      "text": "Then I said, ‘Ah, Lord GOD, here the prophets keep saying to them, “You will not see the sword, nor will you have famine, but I will give you assured peace in this place.”’",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>; <a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "Jeremiah appeals on behalf of deceived people, misled by false prophets. This anticipates the New Testament’s repeated warnings about false teachers (<a href='/AIV/40/7/15'>Matt. 7:15</a>)."
    },
    {
      "pk": 30014014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 14,
      "text": "And the LORD said to me, ‘The prophets are prophesying lies in my name. I did not send them, nor command them, nor speak to them. They are prophesying to you a lying vision, worthless divination, the deceit of their own minds.’",
      "links": "<a href='/AIV/05/18/20-22'>Deut. 18:20-22</a>; <a href='/AIV/24/23/21-22'>Jer. 23:21-22</a>",
      "comment": "True prophecy comes only from God. The necessity of proper spiritual authority and discernment is vital—a principle echoed in apostolic tradition (<a href='/AIV/60/1/20-21'>2 Pet. 1:20-21</a>)."
    },
    {
      "pk": 30014015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 15,
      "text": "Therefore thus says the LORD concerning the prophets who prophesy in my name though I did not send them, yet they say, ‘Sword and famine shall not be in this land’: by sword and famine those prophets shall be consumed.",
      "links": "<a href='/AIV/23/9/14-15'>Isa. 9:14-15</a>",
      "comment": "False teachers will suffer the judgment they denied. The principle of divine justice applies even to religious leaders who mislead."
    },
    {
      "pk": 30014016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 16,
      "text": "And the people to whom they prophesy shall be cast out in the streets of Jerusalem because of the famine and the sword. There will be no one to bury them—them, their wives, their sons, or their daughters. For I will pour out their evil upon them.",
      "links": "<a href='/AIV/19/79/3'>Ps. 79:3</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "The lack of burial is a sign of utter disgrace and judgment (contrast with reverence for the dead in <a href='/AIV/01/50/10-14'>Gen. 50:10-14</a>). God’s justice is holistic, affecting family and community."
    },
    {
      "pk": 30014017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 17,
      "text": "You shall speak this word to them: ‘Let my eyes run down with tears night and day, and let them not cease, for the virgin daughter of my people is broken with a great wound, with a crushing blow.’",
      "links": "<a href='/AIV/25/2/18'>Lam. 2:18</a>; <a href='/AIV/24/9/1'>Jer. 9:1</a>",
      "comment": "Jeremiah is called the ‘weeping prophet’. This verse reveals God’s heart suffers over His people’s pain—a foretaste of Christ’s lament over Jerusalem (<a href='/AIV/40/23/37'>Matt. 23:37</a>)."
    },
    {
      "pk": 30014018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 18,
      "text": "If I go out into the field—behold, those slain by the sword! And if I enter the city—behold, the diseases brought by famine! Even prophet and priest go about in a land they do not know.",
      "links": "<a href='/AIV/25/2/22'>Lam. 2:22</a>; <a href='/AIV/05/28/36'>Deut. 28:36</a>",
      "comment": "No one escapes judgment—outside and inside the city, all are affected. Priest and prophet wandering points to the loss of spiritual direction and need for God’s true guidance."
    },
    {
      "pk": 30014019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 19,
      "text": "Have you utterly rejected Judah? Does your soul loathe Zion? Why have you struck us so there is no healing for us? We looked for peace, but no good came; for a time of healing, but behold, terror.",
      "links": "<a href='/AIV/25/5/22'>Lam. 5:22</a>; <a href='/AIV/23/59/11'>Isa. 59:11</a>",
      "comment": "The people’s question reveals the depth of despair and the apparent absence of hope—except in the mercy of God."
    },
    {
      "pk": 30014020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 20,
      "text": "We acknowledge, O LORD, our wickedness and the iniquity of our fathers, for we have sinned against you.",
      "links": "<a href='/AIV/16/1/6'>Neh. 1:6</a>; <a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "The prayer acknowledges both corporate guilt and ancestral sin, indicating a communal understanding of repentance. The biblical model of confessing collective sin prefigures later Christian confessional traditions."
    },
    {
      "pk": 30014021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 21,
      "text": "For your name’s sake do not despise us; do not dishonor your glorious throne; remember and do not break your covenant with us.",
      "links": "<a href='/AIV/03/26/44-45'>Lev. 26:44-45</a>; <a href='/AIV/19/89/34'>Ps. 89:34</a>",
      "comment": "The plea appeals to God's faithfulness to His covenant and His throne in Jerusalem. This anticipates the fulfillment of the new and eternal covenant through Christ, who reigns as King."
    },
    {
      "pk": 30014022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 14,
      "verse": 22,
      "text": "Can any of the worthless idols of the nations bring rain? Or can the heavens give showers? Is it not you, O LORD our God? Therefore we will wait for you, for you are the one who does all these things.",
      "links": "<a href='/AIV/11/18/39'>1 Kings 18:39</a>; <a href='/AIV/44/14/17'>Acts 14:17</a>",
      "comment": "Only the Lord, not idols or nature itself, sends life-giving rain. Their final response is one of faith. Resonates with New Testament teaching on God as the source of all blessing."
    }
  ],
  "translatedAt": "2025-12-24T08:29:16.075Z"
}