{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 5,
  "verses": [
    {
      "pk": 30005001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 1,
      "text": "Run to and fro through the streets of Jerusalem; look and take note! Search in its squares to see if you can find a single person, anyone who does justice and seeks truth, so that I may pardon her.",
      "links": "<a href='/AIV/01/18/23-32'>Gen. 18:23-32</a>; <a href='/AIV/26/22/30'>Ezek. 22:30</a>",
      "comment": "God's mercy extends at the discovery of even one righteous person, reminiscent of Abraham pleading for Sodom (Gen. 18). This points to the biblical principle of intercession and the idea of the faithful remnant."
    },
    {
      "pk": 30005002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 2,
      "text": "Even though they say, 'As the Lord lives,' they swear falsely.",
      "links": "<a href='/AIV/40/23/16-22'>Matt. 23:16-22</a>",
      "comment": "Outward profession of faith does not guarantee authenticity. Jesus critiqued similar hypocrisy—see Matt. 23:16-22. Here, the need for internal transformation and sincerity in worship is emphasized."
    },
    {
      "pk": 30005003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 3,
      "text": "Lord, do Your eyes not look for truth? You have struck them, but they did not feel it; You have consumed them, but they refused to accept discipline. They have made their faces harder than stone; they have refused to return.",
      "links": "<a href='/AIV/19/32/9'>Ps. 32:9</a>; <a href='/AIV/66/16/9-11'>Rev. 16:9-11</a>",
      "comment": "Divine discipline is often met with stubbornness—a theme throughout the biblical narrative (Rev. 16:9-11). The resistance to repentance prefigures the necessity for deeper grace and sacramental means of conversion."
    },
    {
      "pk": 30005004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 4,
      "text": "Then I said, 'These are only the poor; they are foolish, for they do not know the way of the Lord, the justice of their God.'",
      "links": "<a href='/AIV/28/4/6'>Hosea 4:6</a>",
      "comment": "A lack of knowledge of God's law leads to moral failure (Hosea 4:6). The importance of being taught and led in truth is subtly recommended here—suggesting the role of tradition and teaching authority."
    },
    {
      "pk": 30005005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 5,
      "text": "I will go to the great and speak to them; for they know the way of the Lord, the justice of their God. But these, too, have all together broken the yoke, they have burst the bonds.",
      "links": "<a href='/AIV/19/2/3'>Ps. 2:3</a>; <a href='/AIV/20/28/1'>Prov. 28:1</a>",
      "comment": "Leadership and knowledge do not guarantee faithfulness. Everyone, regardless of status, is accountable for obedience. Spiritual authority is only authentic when aligned with service and truth."
    },
    {
      "pk": 30005006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 6,
      "text": "Therefore a lion from the forest will strike them down, a wolf from the desert will ravage them, a leopard is watching their cities. Everyone who goes out will be torn to pieces, because their transgressions are many, their apostasies are great.",
      "links": "<a href='/AIV/19/91/13'>Ps. 91:13</a>; <a href='/AIV/28/13/7'>Hosea 13:7</a>",
      "comment": "Wild animals here symbolize judgment, as in Hosea 13:7. The consequences of apostasy are severe. Spiritual danger awaits those who abandon covenant faithfulness."
    },
    {
      "pk": 30005007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 7,
      "text": "Why should I forgive you? Your children have forsaken Me and have sworn by gods that are not gods. I provided for them abundantly, yet they committed adultery and thronged to the houses of prostitutes.",
      "links": "<a href='/AIV/05/32/16-21'>Deut. 32:16-21</a>; <a href='/AIV/19/106/36-38'>Ps. 106:36-38</a>",
      "comment": "Idolatry and infidelity are equated. God's generous provision contrasted sharply with human betrayal. This prefigures the need for true faithfulness symbolized in marriage imagery throughout Scripture (Eph. 5:25-27)."
    },
    {
      "pk": 30005008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 8,
      "text": "They were like lusty stallions, each neighing for his neighbor's wife.",
      "links": "<a href='/AIV/02/20/17'>Ex. 20:17</a>; <a href='/AIV/40/5/28'>Matt. 5:28</a>",
      "comment": "The comparison illustrates the deep loss of self-control and the violation of commandments (Ex. 20:17). Jesus intensified this teaching in the Sermon on the Mount (Matt. 5:28)."
    },
    {
      "pk": 30005009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 9,
      "text": "Should I not punish them for these things?' says the Lord, 'Should I not avenge Myself on such a nation as this?'",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/23/34/8'>Isa. 34:8</a>",
      "comment": "God's justice demands a response to persistent sin. The implications for national accountability and collective responsibility are highlighted here."
    },
    {
      "pk": 30005010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 10,
      "text": "Go up through her vineyards and destroy, but do not make a full end. Strip away her branches, for they do not belong to the Lord.",
      "links": "<a href='/AIV/23/6/13'>Isa. 6:13</a>; <a href='/AIV/19/80/8-16'>Ps. 80:8-16</a>",
      "comment": "A distinction is drawn between destruction and preservation—a remnant is always kept (Isa. 6:13). The vineyard imagery is consistently used in Scripture for God's people."
    },
    {
      "pk": 30005011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 11,
      "text": "'For the house of Israel and the house of Judah have dealt very treacherously with Me,' declares the Lord.",
      "links": "<a href='/AIV/28/6/7'>Hosea 6:7</a>",
      "comment": "Both Israel and Judah are held accountable, showing the unity and the responsibilities of the entire chosen people."
    },
    {
      "pk": 30005012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 12,
      "text": "They have lied about the Lord and said, 'He will do nothing; calamity will not come upon us, nor shall we see sword or famine.'",
      "links": "<a href='/AIV/26/13/10'>Ezek. 13:10</a>; <a href='/AIV/40/24/37-39'>Matt. 24:37-39</a>",
      "comment": "Denial of divine judgment is spiritually dangerous. Jesus teaches about the suddenness and certainty of judgment in Matt. 24."
    },
    {
      "pk": 30005013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 13,
      "text": "The prophets will become wind; the word is not in them. Thus shall it be done to them.",
      "links": "<a href='/AIV/33/3/5-7'>Micah 3:5-7</a>",
      "comment": "False prophets are empty and lack divine authority—a warning about the importance of adhering to authentic guides and teachers."
    },
    {
      "pk": 30005014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 14,
      "text": "Therefore thus says the Lord, the God of hosts: 'Because you have spoken this word, behold, I am making My words in your mouth a fire, and this people wood, and it shall consume them.'",
      "links": "<a href='/AIV/66/11/5'>Rev. 11:5</a>; <a href='/AIV/20/25/21-22'>Prov. 25:21-22</a>",
      "comment": "The power and authority of God's word is depicted as a consuming fire. The importance of preaching with true authority is central, with echoes in Revelation and Proverbs."
    },
    {
      "pk": 30005015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 15,
      "text": "'Behold, I am bringing against you a nation from afar, O house of Israel,' declares the Lord. 'It is an enduring nation, an ancient nation, a nation whose language you do not know, nor can you understand what they say.'",
      "links": "<a href='/AIV/05/28/49'>Deut. 28:49</a>",
      "comment": "Foreign conquest as divine discipline is a recurring tool in biblical history. Israel's inability to understand their conquerors further emphasizes the pain of exile."
    },
    {
      "pk": 30005016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 16,
      "text": "Their quiver is like an open grave; they are all mighty warriors.",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>; <a href='/AIV/19/64/3'>Ps. 64:3</a>",
      "comment": "The metaphor emphasizes both the deadliness and the inevitability of God's judgment through foreign invaders."
    },
    {
      "pk": 30005017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 17,
      "text": "They shall eat up your harvest and your food, they shall devour your sons and your daughters, they shall eat up your flocks and your herds, your vines and your fig trees. With the sword they shall destroy your fortified cities in which you trust.",
      "links": "<a href='/AIV/28/7/14'>Hosea 7:14</a>; <a href='/AIV/01/41/29-30'>Gen. 41:29-30</a>",
      "comment": "Total devastation resulting from infidelity to the covenant. Trust in human defenses is futile when God removes His protection."
    },
    {
      "pk": 30005018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 18,
      "text": "But even in those days,' declares the Lord, 'I will not make a complete end of you.'",
      "links": "<a href='/AIV/24/4/27'>Jer. 4:27</a>; <a href='/AIV/11/19/18'>1 Kings 19:18</a>",
      "comment": "God always preserves a remnant, reflecting His faithful love and the enduring promise of restoration."
    },
    {
      "pk": 30005019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 19,
      "text": "And when your people say, 'Why has the Lord our God done all these things to us?' you shall say to them, 'As you have forsaken Me and served foreign gods in your land, so you shall serve foreigners in a land that is not yours.'",
      "links": "<a href='/AIV/05/28/36'>Deut. 28:36</a>; <a href='/AIV/24/16/10-13'>Jer. 16:10-13</a>",
      "comment": "The principle of reciprocal justice: as the people abandoned God, so they will experience what they chose for themselves—servitude far from home."
    },
    {
      "pk": 30005020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 20,
      "text": "Declare this in the house of Jacob and proclaim it in Judah:",
      "links": "<a href='/AIV/24/2/4'>Jer. 2:4</a>",
      "comment": "The message is for the entire covenant people, emphasizing national accountability and unity."
    },
    {
      "pk": 30005021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 21,
      "text": "Hear this, O foolish people, who have eyes but do not see, who have ears but do not hear:",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>",
      "comment": "Spiritual blindness and deafness are common images for stubbornness towards God's message, also referenced by Jesus (Matt. 13:13-15)."
    },
    {
      "pk": 30005022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 22,
      "text": "Do you not fear Me?' declares the Lord. 'Will you not tremble before Me, who set the sand as the boundary for the sea, a perpetual barrier it cannot pass? Though its waves toss, they cannot prevail; though they roar, they cannot cross it.'",
      "links": "<a href='/AIV/18/38/8-11'>Job 38:8-11</a>; <a href='/AIV/19/104/9'>Ps. 104:9</a>",
      "comment": "The absolute sovereignty of God over creation underpins the call to fear and worship Him rightly."
    },
    {
      "pk": 30005023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 23,
      "text": "But this people has a stubborn and rebellious heart; they have turned aside and gone away.",
      "links": "<a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Human free will can resist God's grace, yet the persistence of God's call is unending—a theme throughout biblical history."
    },
    {
      "pk": 30005024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 24,
      "text": "They do not say in their hearts, 'Let us fear the Lord our God, who gives the autumn and spring rains in their season, who keeps for us the appointed weeks of the harvest.'",
      "links": "<a href='/AIV/03/26/4'>Lev. 26:4</a>; <a href='/AIV/28/6/3'>Hosea 6:3</a>",
      "comment": "God's providence in creation and seasons is cause for gratitude, yet the people are negligent in thanksgiving and worship—a subtle reference to the value of ordered, habitual praise."
    },
    {
      "pk": 30005025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 25,
      "text": "Your iniquities have turned these away, and your sins have withheld good from you.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>",
      "comment": "Sin has tangible consequences, not only spiritual but also material; the connection between faithfulness and blessing is direct."
    },
    {
      "pk": 30005026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 26,
      "text": "For wicked men are found among My people; they lie in wait like those who set traps; they set a snare to catch men.",
      "links": "<a href='/AIV/19/10/9'>Ps. 10:9</a>",
      "comment": "Corruption exists even within the chosen—pointing to the need for continual purification and vigilance."
    },
    {
      "pk": 30005027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 27,
      "text": "As a cage is full of birds, so their houses are full of deceit; therefore they have become great and wealthy.",
      "links": "<a href='/AIV/19/73/12'>Ps. 73:12</a>",
      "comment": "Material success through deceit stands condemned. Wealth is not always a sign of divine favor."
    },
    {
      "pk": 30005028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 28,
      "text": "They have grown fat and sleek. They excel in evil deeds; they do not judge with justice the cause of the fatherless, to prosper, and they do not defend the rights of the needy.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/20/24/11-12'>Prov. 24:11-12</a>",
      "comment": "Neglect of justice and mercy for the most vulnerable is a grave sin—echoing teachings throughout the wisdom literature and prophets."
    },
    {
      "pk": 30005029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 29,
      "text": "'Shall I not punish them for these things?' says the Lord, 'Shall I not avenge Myself on such a nation as this?'",
      "links": "<a href='/AIV/24/5/9'>Jer. 5:9</a>; <a href='/AIV/19/94/2'>Ps. 94:2</a>",
      "comment": "Repeating verse 9, the certainty of divine justice is reaffirmed. God's vengeance is righteous and always proportionate."
    },
    {
      "pk": 30005030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 30,
      "text": "An appalling and horrible thing has happened in the land:",
      "links": "<a href='/AIV/24/23/14'>Jer. 23:14</a>",
      "comment": "The gravity of the nation's spiritual crisis is highlighted. 'Appalling and horrible' underscores the seriousness of spiritual corruption."
    },
    {
      "pk": 30005031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 5,
      "verse": 31,
      "text": "The prophets prophesy falsely, and the priests rule at their direction; and My people love it this way. But what will you do when the end comes?",
      "links": "<a href='/AIV/26/22/25-28'>Ezek. 22:25-28</a>; <a href='/AIV/40/7/15'>Matt. 7:15</a>",
      "comment": "False prophets and unrighteous priests misleading the people emphasize the need for faithful shepherds and authentic tradition. The question at the end is a sober call to personal accountability in light of divine judgment."
    }
  ],
  "translatedAt": "2025-12-24T08:24:07.617Z"
}