{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 13,
  "verses": [
    {
      "pk": 30013001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 1,
      "text": "This is what the LORD said to me: 'Go and buy yourself a linen sash and put it around your waist, but do not dip it in water.'",
      "links": "<a href='/AIV/3/16/4'>Lev. 16:4</a>; <a href='/AIV/24/19/1'>Jer. 19:1</a>",
      "comment": "A linen sash was a symbolic piece of clothing, often signifying purity (Lev. 16:4). The command not to wash it underlines the symbolic message about the people of Israel's spiritual state."
    },
    {
      "pk": 30013002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 2,
      "text": "So I bought the sash in keeping with the word of the LORD, and I put it around my waist.",
      "links": "<a href='/AIV/24/27/2'>Jer. 27:2</a>",
      "comment": "Jeremiah’s obedience to the LORD’s command sets an example of faithful submission to divine instruction, a theme common throughout the prophets."
    },
    {
      "pk": 30013003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 3,
      "text": "Then the word of the LORD came to me a second time:",
      "links": "<a href='/AIV/24/18/5'>Jer. 18:5</a>",
      "comment": "The repetition emphasizes the importance of God’s message and Jeremiah’s prophetic role."
    },
    {
      "pk": 30013004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 4,
      "text": "‘Take the sash that you bought and are wearing, and get up and go to the Euphrates and hide it there in a crevice of the rock.’",
      "links": "<a href='/AIV/24/51/63'>Jer. 51:63</a>",
      "comment": "The journey to the Euphrates, far from Judah, hints at exile—a key prophetic theme. Obedient action with symbolic meaning points to the importance of visible signs in conveying spiritual realities (see Ezek. 24:24)."
    },
    {
      "pk": 30013005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 5,
      "text": "So I went and hid it by the Euphrates, as the LORD had commanded me.",
      "links": "<a href='/AIV/24/13/4'>Jer. 13:4</a>",
      "comment": "Jeremiah’s role mirrors that of a priest performing a rite that has both literal and spiritual implications – obedience brings understanding."
    },
    {
      "pk": 30013006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 6,
      "text": "After many days the LORD said to me, ‘Get up, go to the Euphrates, and take from there the sash that I commanded you to hide.’",
      "links": "<a href='/AIV/24/13/4-5'>Jer. 13:4-5</a>",
      "comment": "The lapse of time further symbolizes Israel’s period of abandonment and, ultimately, their return and restoration."
    },
    {
      "pk": 30013007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 7,
      "text": "So I went to the Euphrates and dug, and I took the sash from the place where I had hidden it. And behold, the sash was ruined; it was useless for anything.",
      "links": "<a href='/AIV/24/13/1-6'>Jer. 13:1-6</a>",
      "comment": "The ruined sash graphically represents the spiritual corruption that comes from separating from closeness to God, a theme seen in Deut. 28:20."
    },
    {
      "pk": 30013008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 8,
      "text": "Then the word of the LORD came to me:",
      "links": "<a href='/AIV/24/13/3'>Jer. 13:3</a>",
      "comment": "God continues to reveal His message through Jeremiah—consistent prophetic revelation."
    },
    {
      "pk": 30013009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 9,
      "text": "'This is what the LORD says: In the same way I will ruin the pride of Judah and the great pride of Jerusalem.'",
      "links": "<a href='/AIV/24/17/23'>Jer. 17:23</a>; <a href='/AIV/24/48/29'>Jer. 48:29</a>",
      "comment": "The judgment against pride is a core biblical principle (Prov. 16:18). The decay parallels sin, which renders the chosen people unfit for their calling (Rom. 11:20-21)."
    },
    {
      "pk": 30013010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 10,
      "text": "'These evil people, who refuse to listen to my words, who walk in the stubbornness of their hearts, and go after other gods to serve and worship them, will be like this sash—which is useless for anything.'",
      "links": "<a href='/AIV/5/29/18'>Deut. 29:18</a>; <a href='/AIV/24/7/24'>Jer. 7:24</a>",
      "comment": "Idolatry, stubbornness, and rejection of the true faith cause spiritual ruin, as in Hosea 4:17."
    },
    {
      "pk": 30013011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 11,
      "text": "'For as a sash clings to a person’s waist, so I made the whole house of Israel and the whole house of Judah cling to me,' says the LORD, 'so that they might be for me a people, a name, a praise, and a glory. But they would not listen.'",
      "links": "<a href='/AIV/2/19/5'>Ex. 19:5</a>; <a href='/AIV/5/4/20'>Deut. 4:20</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "God’s desire is for intimate communion with His people—a people who are set apart for His glory. The language links to the theme of covenant and election (Ex. 19:5; 1 Pet. 2:9). Spiritual obedience preserves closeness to God, as seen in the New Testament’s call to unity and faithfulness."
    },
    {
      "pk": 30013012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 12,
      "text": "You are to speak this word to them: 'This is what the LORD, the God of Israel, says: Every wineskin shall be filled with wine.' And when they say to you, ‘Don’t we already know every wineskin shall be filled with wine?’",
      "links": "<a href='/AIV/28/9/1'>Hos. 9:1</a>; <a href='/AIV/40/9/17'>Matt. 9:17</a>",
      "comment": "Wineskins filled with wine are an image of abundance, but also, in this context, of coming judgment and intoxication resulting in destruction (see Hos. 9:1). Jesus reuses the wineskin image for spiritual renewal (Matt. 9:17)."
    },
    {
      "pk": 30013013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 13,
      "text": "Then say to them, ‘This is what the LORD says: Look, I am about to fill all who live in this land, the kings who sit on David’s throne, the priests, the prophets, and all the people of Jerusalem, with drunkenness.'",
      "links": "<a href='/AIV/19/60/3'>Ps. 60:3</a>; <a href='/AIV/24/25/15-16'>Jer. 25:15-16</a>",
      "comment": "Drunkenness here is symbolic of divine judgment and confusion (Ps. 60:3; Jer. 25:15). Note the judgment falls on all—kings, priests, prophets—a foreshadowing of later calls for spiritual and doctrinal unity among all God’s people."
    },
    {
      "pk": 30013014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 14,
      "text": "'I will shatter them one against another, fathers and sons together,' declares the LORD. 'I will not show pity or mercy or compassion, so as not to destroy them.'",
      "links": "<a href='/AIV/24/16/5'>Jer. 16:5</a>",
      "comment": "God’s judgment, when ignored, brings severe consequences even to family bonds, but justice here is always linked to a later hope for restoration (Jer. 30:17)."
    },
    {
      "pk": 30013015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 15,
      "text": "Hear and pay attention! Do not be arrogant, for the LORD has spoken.",
      "links": "<a href='/AIV/24/44/16'>Jer. 44:16</a>",
      "comment": "A recurring prophetic call to humility and repentance. See also Jas. 4:6—'God opposes the proud, but gives grace to the humble.'"
    },
    {
      "pk": 30013016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 16,
      "text": "Give glory to the LORD your God before He causes darkness, before your feet stumble on darkening mountains. You will look for light, but He will turn it into deep shadow and thick gloom.",
      "links": "<a href='/AIV/19/107/10'>Ps. 107:10</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Light and darkness contrast spiritual enlightenment with the blindness caused by sin. Christ later proclaims, 'I am the light of the world' (John 8:12)."
    },
    {
      "pk": 30013017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 17,
      "text": "But if you will not listen, my soul will weep in secret for your arrogance. My eyes will weep bitterly and run down with tears, because the LORD’s flock has been taken captive.",
      "links": "<a href='/AIV/25/1/16'>Lam. 1:16</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "Jeremiah’s lamentation foreshadows Christ’s own weeping over Jerusalem (Matt. 23:37). The shepherd imagery points toward the unity and special care God intends for His flock."
    },
    {
      "pk": 30013018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 18,
      "text": "Say to the king and the queen mother, 'Sit down low, for your glorious crowns have fallen from your heads.'",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>; <a href='/AIV/25/5/16'>Lam. 5:16</a>",
      "comment": "All earthly authority, even royalty, submits to God’s judgment. The humility of rulers is a recurring theme preparing for the true King (Luke 1:52)."
    },
    {
      "pk": 30013019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 19,
      "text": "The cities of the Negev are shut up, and there is no one to open them. All Judah has been carried into exile—all of it—taken away completely.",
      "links": "<a href='/AIV/14/36/20'>2 Chr. 36:20</a>; <a href='/AIV/24/7/34'>Jer. 7:34</a>",
      "comment": "Total judgment brings total exile, which later enables a new covenant and restoration (see Jer. 31:31)."
    },
    {
      "pk": 30013020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 20,
      "text": "Lift up your eyes and see those coming from the north. Where is the flock that was given to you, your beautiful sheep?",
      "links": "<a href='/AIV/24/1/15'>Jer. 1:15</a>; <a href='/AIV/24/6/22'>Jer. 6:22</a>",
      "comment": "The enemy from the north refers to Babylon. The flock represents God’s people, a motif extended in John 10:11 where Christ calls Himself the Good Shepherd."
    },
    {
      "pk": 30013021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 21,
      "text": "What will you say when He sets over you those you have trained to be close to you as allies? Will not pain grip you like that of a woman in labor?",
      "links": "<a href='/AIV/24/4/31'>Jer. 4:31</a>; <a href='/AIV/48/4/19'>Gal. 4:19</a>",
      "comment": "Judah’s former allies become her masters. Labor pains are a frequent biblical image for judgment, but also for future birth or renewal (Gal. 4:19)."
    },
    {
      "pk": 30013022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 22,
      "text": "If you say in your heart, 'Why have these things happened to me?' It is because of the greatness of your iniquity that your skirts are lifted up and you are exposed.",
      "links": "<a href='/AIV/24/5/19'>Jer. 5:19</a>; <a href='/AIV/23/47/3'>Isa. 47:3</a>",
      "comment": "Sin leads to shameful exposure. The prophetic image points to the consequences of persistent unfaithfulness to God’s covenant."
    },
    {
      "pk": 30013023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 23,
      "text": "Can the Ethiopian change his skin or the leopard his spots? Then may you also do good who are accustomed to doing evil.",
      "links": "<a href='/AIV/18/14/4'>Job 14:4</a>; <a href='/AIV/40/7/18'>Matt. 7:18</a>",
      "comment": "This highlights the necessity of God’s grace for true conversion of heart—by natural power alone, change is impossible (cf. John 3:3-6 on being born again)."
    },
    {
      "pk": 30013024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 24,
      "text": "Therefore I will scatter them like chaff driven by the desert wind.",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/24/18/17'>Jer. 18:17</a>",
      "comment": "Chaff is repeatedly used as an image of the fate of the wicked (Ps. 1:4). Dispersion reinforces the need for spiritual unity and right worship."
    },
    {
      "pk": 30013025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 25,
      "text": "This is your lot, the portion I have measured out for you, declares the LORD, because you have forgotten me and trusted in falsehood.",
      "links": "<a href='/AIV/5/32/18'>Deut. 32:18</a>; <a href='/AIV/19/4/2'>Ps. 4:2</a>",
      "comment": "Forgetting God and trusting in falsehood shows the grave consequences of separating from truth. Spiritual forgetfulness is a major reason for the call to remember and participate in worship practices."
    },
    {
      "pk": 30013026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 26,
      "text": "Therefore I will also lift up your skirts over your face, and your shame will be seen.",
      "links": "<a href='/AIV/25/1/8'>Lam. 1:8</a>",
      "comment": "Public shame comes from unfaithfulness—a warning to all to maintain covenantal fidelity. Compare to Lam. 1:8."
    },
    {
      "pk": 30013027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 13,
      "verse": 27,
      "text": "Your adulteries, your lustful neighings, your shameless prostitution! I have seen your abominations on the hills and in the fields. Woe to you, Jerusalem! How long will you remain unclean?",
      "links": "<a href='/AIV/26/16/15'>Ezek. 16:15</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "Spiritual adultery is a metaphor for idolatry and infidelity to God’s covenant. Notice the closing plea for cleansing—preparing the way for forgiveness and a restored people, themes central to the church’s teaching on reconciliation and the enduring call to unity."
    }
  ],
  "translatedAt": "2025-12-24T08:28:39.558Z"
}