{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 52,
  "verses": [
    {
      "pk": 30052001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 1,
      "text": "Zedekiah was twenty-one years old when he became king, and he reigned eleven years in Jerusalem. His mother’s name was Hamutal daughter of Jeremiah, from Libnah.",
      "links": "<a href='/AIV/12/24/18'>2 Kings 24:18</a>; <a href='/AIV/30/1/1'>Jer. 1:1</a>",
      "comment": "The opening closely parallels 2 Kings 24:18, establishing Zedekiah's age and lineage. Note the emphasis on royal succession, which points to the biblical theme of legitimate authority passed through David's line."
    },
    {
      "pk": 30052002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 2,
      "text": "He did what was evil in the sight of the LORD, just as Jehoiakim had done.",
      "links": "<a href='/AIV/12/23/37'>2 Kings 23:37</a>; <a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "Zedekiah’s reign continued the same sinful practices as previous rulers, contributing to Jerusalem's downfall. The verse highlights the consequences of forsaking faith and obedience, a foundational biblical theme."
    },
    {
      "pk": 30052003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 3,
      "text": "Because of the LORD’s anger, all these things came upon Jerusalem and Judah, until He finally cast them out from His presence. Zedekiah rebelled against the king of Babylon.",
      "links": "<a href='/AIV/12/24/20'>2 Kings 24:20</a>; <a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "The Lord’s anger and the consequent exile are directly connected. The language, 'cast them out from His presence,' foreshadows spiritual separation from God—a theme linked with the need for atonement and reconciliation, later fulfilled Christologically."
    },
    {
      "pk": 30052004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 4,
      "text": "In the ninth year of Zedekiah’s reign, in the tenth month, on the tenth day of the month, Nebuchadnezzar king of Babylon came against Jerusalem with all his army, and they laid siege to it. They built siege works all around the city.",
      "links": "<a href='/AIV/26/24/2'>Ezek. 24:2</a>; <a href='/AIV/12/25/1'>2 Kings 25:1</a>",
      "comment": "The precise dating underscores the seriousness of judgment. The siege's detail foreshadows later biblical imagery of spiritual warfare and the consequence of hardened hearts."
    },
    {
      "pk": 30052005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 5,
      "text": "The city was besieged until the eleventh year of King Zedekiah.",
      "links": "<a href='/AIV/12/25/2'>2 Kings 25:2</a>",
      "comment": "The prolonged siege signifies the extent of Jerusalem’s suffering—a repeated motif in lament literature, pointing toward humanity's need for divine intervention."
    },
    {
      "pk": 30052006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 6,
      "text": "On the ninth day of the fourth month, the famine grew very severe in the city, and there was no food for the people of the land.",
      "links": "<a href='/AIV/19/102/4'>Ps. 102:4</a>; <a href='/AIV/28/4/8'>Hos. 4:8</a>",
      "comment": "Famine reflects God’s discipline upon His people. The physical hunger mirrors spiritual starvation, which is later remedied in the hope of restoration and redemption."
    },
    {
      "pk": 30052007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 7,
      "text": "Then the city was broken through, and all the men of war fled, leaving through the gate between two walls by the king’s garden, though the Chaldeans surrounded the city. They went in the direction of the Arabah.",
      "links": "<a href='/AIV/12/25/4'>2 Kings 25:4</a>; <a href='/AIV/26/12/12'>Ezek 12:12</a>",
      "comment": "Jerusalem’s fall highlights the consequences of distancing from God. The remnant theme emerges, connecting with the future faithful remnant's role in God’s plan."
    },
    {
      "pk": 30052008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 8,
      "text": "But the Chaldean army chased after the king, and they overtook Zedekiah in the plains of Jericho. His whole army was scattered from him.",
      "links": "<a href='/AIV/6/4/13'>Josh. 4:13</a>; <a href='/AIV/30/39/5'>Jer. 39:5</a>",
      "comment": "The scattering of Zedekiah’s army illustrates the consequences of broken covenant. Jericho’s reference ties back to former victories now reversed due to disobedience."
    },
    {
      "pk": 30052009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 9,
      "text": "They seized Zedekiah and brought him up to the king of Babylon at Riblah in the land of Hamath, and he pronounced judgment on him.",
      "links": "<a href='/AIV/30/39/6'>Jer. 39:6</a>",
      "comment": "Judgment delivered in a foreign land underscores the theme of exile and loss of divine protection as a consequence of persistent sin."
    },
    {
      "pk": 30052010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 10,
      "text": "The king of Babylon slaughtered the sons of Zedekiah before his eyes, and he also killed all the officials of Judah at Riblah.",
      "links": "<a href='/AIV/30/39/6'>Jer. 39:6</a>",
      "comment": "The execution of royalty and leaders shows the seriousness of national apostasy. This kind of loss points to the greater need for restoration and lasting kingship, hinting at messianic fulfillment."
    },
    {
      "pk": 30052011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 11,
      "text": "He put out Zedekiah’s eyes and bound him in bronze shackles. The king of Babylon took him to Babylon, where he was imprisoned until the day of his death.",
      "links": "<a href='/AIV/12/25/7'>2 Kings 25:7</a>",
      "comment": "Blinding and imprisonment symbolize the spiritual blindness and bondage resulting from sin—a motif mirrored in several prophets, prompting reflection on spiritual freedom through later redemption."
    },
    {
      "pk": 30052012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 12,
      "text": "In the fifth month, on the tenth day of the month—that is, in the nineteenth year of King Nebuchadnezzar of Babylon—Nebuzaradan, the captain of the guard, entered Jerusalem.",
      "links": "<a href='/AIV/12/25/8'>2 Kings 25:8</a>",
      "comment": "The specificity of time underlines the historical reality of God's judgment, anchoring prophecy to measurable events."
    },
    {
      "pk": 30052013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 13,
      "text": "He burned the house of the LORD, the king’s house, and all the houses of Jerusalem; every great house he burned with fire.",
      "links": "<a href='/AIV/25/2/7'>Lam. 2:7</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The destruction of the temple and city highlights Israel’s loss, but also sets up powerful imagery for later restoration. The burning of the house of the LORD prefigures the new dwelling of God with His people."
    },
    {
      "pk": 30052014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 14,
      "text": "All the Chaldean army, under the captain of the guard, broke down all the walls around Jerusalem.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "The breaching of Jerusalem’s defenses further manifests total desolation—fulfillment of Jeremiah’s earlier warnings."
    },
    {
      "pk": 30052015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 15,
      "text": "Nebuzaradan, captain of the guard, carried into exile some of the poorest people and those who remained in the city, as well as the deserters who had joined the king of Babylon, and the rest of the craftsmen.",
      "links": "<a href='/AIV/30/39/9'>Jer. 39:9</a>",
      "comment": "Exile is portrayed as both physical and spiritual, again reinforcing the biblical motif of the remnant’s future significance and restoration."
    },
    {
      "pk": 30052016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 16,
      "text": "But Nebuzaradan left behind some of the poorest of the land to work vineyards and fields.",
      "links": "<a href='/AIV/30/40/7'>Jer. 40:7</a>",
      "comment": "Leaving the poor for agricultural work anticipates God’s ongoing care for the least and marginalized, focusing on a recurring biblical ethic of mercy and providence."
    },
    {
      "pk": 30052017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 17,
      "text": "The Chaldeans broke apart the bronze pillars that were in the house of the LORD, the stands, and the bronze sea in the house of the LORD, and carried the bronze to Babylon.",
      "links": "<a href='/AIV/11/7/15'>1 Kings 7:15</a>; <a href='/AIV/19/137/1'>Ps. 137:1</a>",
      "comment": "Destruction of temple furnishings underscores loss of sacred space. The physical elements point to the importance of material symbols and sacramental understanding that would persist in worship."
    },
    {
      "pk": 30052018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 18,
      "text": "They took away the pots, shovels, wick trimmers, basins, spoons, and all the bronze articles used in the service of the temple.",
      "links": "<a href='/AIV/02/25/38'>Exod. 25:38</a>; <a href='/AIV/11/7/50'>1 Kings 7:50</a>",
      "comment": "Removal of the vessels necessary for liturgy marks the end of temple worship, driving longing for restoration of proper worship practices."
    },
    {
      "pk": 30052019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 19,
      "text": "The captain of the guard took the cups, fire pans, basins, pots, lampstands, spoons, and bowls—what was of gold and what was of silver.",
      "links": "<a href='/AIV/02/25/31'>Exod. 25:31</a>",
      "comment": "Emphasis on both gold and silver items accentuates the richness of worship, and the loss thereof, anticipating eventual restoration through renewed covenant."
    },
    {
      "pk": 30052020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 20,
      "text": "As for the two pillars, the sea, and the twelve bronze bulls beneath it, which King Solomon had made for the house of the LORD, the bronze of all these articles could not be weighed.",
      "links": "<a href='/AIV/11/7/25'>1 Kings 7:25</a>; <a href='/AIV/14/4/2'>2 Chron. 4:2</a>",
      "comment": "Reference to Solomon ties temple worship to royal authority and wisdom, underlying the biblical importance of continuity in sacred tradition."
    },
    {
      "pk": 30052021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 21,
      "text": "Regarding the pillars: each pillar was eighteen cubits high, with a circumference of twelve cubits. Each pillar was four fingers thick and hollow.",
      "links": "<a href='/AIV/11/7/15'>1 Kings 7:15</a>",
      "comment": "The detailed description enshrines God’s glory in material form. Such attention to architectural specifics demonstrates the care given to places of worship."
    },
    {
      "pk": 30052022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 22,
      "text": "On top of each pillar was a capital of bronze. The height of each capital was five cubits, with network and pomegranates on the capitals all around, of bronze. The second pillar was like these, with pomegranates also.",
      "links": "<a href='/AIV/11/7/20'>1 Kings 7:20</a>",
      "comment": "Pomegranates symbolize fruitfulness; their incorporation into worship signals the desired abundance from divine blessing. Network and capitals show a connection between heaven and earth in temple design."
    },
    {
      "pk": 30052023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 23,
      "text": "There were ninety-six pomegranates on the sides; all the pomegranates around the network numbered one hundred.",
      "links": "<a href='/AIV/11/7/42'>1 Kings 7:42</a>",
      "comment": "Significance of numbers in scripture often carries spiritual meaning—here, pointing to the beauty and order of worship, anticipating restoration."
    },
    {
      "pk": 30052024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 24,
      "text": "The captain of the guard took Seraiah the chief priest, Zephaniah the second priest, and the three doorkeepers.",
      "links": "<a href='/AIV/30/21/1'>Jer. 21:1</a>; <a href='/AIV/11/8/3'>1 Kings 8:3</a>",
      "comment": "Taking priests and doorkeepers emphasizes the full disruption of liturgical order, foreshadowing the importance of priestly leadership in future restorations."
    },
    {
      "pk": 30052025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 25,
      "text": "He also took off the city one official in command of the men of war, seven men from among the king’s advisers who were found in the city, the secretary of the commander of the army who mustered the people of the land, and sixty men of the people of the land who were in the city.",
      "links": "<a href='/AIV/30/39/9'>Jer. 39:9</a>",
      "comment": "The removal of both religious and civic leaders marks a complete collapse of order, again establishing the necessity for God’s chosen leaders."
    },
    {
      "pk": 30052026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 26,
      "text": "Nebuzaradan the captain of the guard took these and brought them to the king of Babylon at Riblah.",
      "links": "<a href='/AIV/12/25/20'>2 Kings 25:20</a>",
      "comment": "Physical exile of leaders serves as a historical warning, but also opens the way for hope of return and purification."
    },
    {
      "pk": 30052027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 27,
      "text": "The king of Babylon had them struck down and put to death at Riblah in the land of Hamath. So Judah was taken into exile away from its land.",
      "links": "<a href='/AIV/30/39/6'>Jer. 39:6</a>",
      "comment": "This verse marks the official end of the kingdom before exile—a key event for understanding prophecy and the need for messiah."
    },
    {
      "pk": 30052028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 28,
      "text": "This is the number of people whom Nebuchadnezzar carried away captive: in the seventh year, 3,023 Jews were taken from Jerusalem.",
      "links": "<a href='/AIV/30/29/2'>Jer. 29:2</a>",
      "comment": "Quantifying the exiles provides a historic anchor. The preservation of numbers reflects the careful memory of those awaiting restoration."
    },
    {
      "pk": 30052029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 29,
      "text": "In Nebuchadnezzar’s eighteenth year, he took captive from Jerusalem 832 people.",
      "links": "<a href='/AIV/30/39/9'>Jer. 39:9</a>",
      "comment": "The exile is recorded in stages, underlining its impact and the hope for eventual return."
    },
    {
      "pk": 30052030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 30,
      "text": "In his twenty-third year, Nebuzaradan the captain of the guard deported 745 Jews. In total, 4,600 people were taken captive.",
      "links": "<a href='/AIV/30/40/1'>Jer. 40:1</a>",
      "comment": "Final tally of the exiles reinforces the magnitude of loss, while the preservation of a remnant implies hope rooted in promise."
    },
    {
      "pk": 30052031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 31,
      "text": "In the thirty-seventh year of the exile of Jehoiachin king of Judah, on the twenty-fifth day of the twelfth month, Evil-merodach king of Babylon in the year he began to reign showed kindness to Jehoiachin king of Judah and released him from prison.",
      "links": "<a href='/AIV/12/25/27'>2 Kings 25:27</a>",
      "comment": "The release and kindness extended to Jehoiachin foreshadows the possibility of mercy and reconciliation, present also in Christ's redemptive acts. Prophetic tradition often centers hope in such moments."
    },
    {
      "pk": 30052032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 32,
      "text": "He spoke kindly to him and gave him a seat above the other kings who were with him in Babylon.",
      "links": "<a href='/AIV/12/25/28'>2 Kings 25:28</a>",
      "comment": "Elevation from prison to honor echoes biblical motifs of reversal—anticipating spiritual restoration and the raising up of the just."
    },
    {
      "pk": 30052033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 33,
      "text": "Jehoiachin changed out of his prison clothes, and ate before the king continually all the days of his life.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/42/15/22'>Luke 15:22</a>",
      "comment": "Eating continually in the king’s presence represents restored fellowship, subtly pointing to the eschatological hope of communion with the true King. The mention of changing clothes hints at spiritual renewal."
    },
    {
      "pk": 30052034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 52,
      "verse": 34,
      "text": "As for his allowance, a regular portion was given to him by the king of Babylon for each day, until the day of his death, all the days of his life.",
      "links": "<a href='/AIV/12/25/30'>2 Kings 25:30</a>; <a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "The daily allowance echoes the biblical theme of ‘daily bread’ (see Matthew 6:11), and God’s faithful provision through human means, preparing the reader for the deeper spiritual fulfillment found in Christ's redemptive mission."
    }
  ],
  "translatedAt": "2025-12-24T08:51:28.119Z"
}