{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 30,
  "verses": [
    {
      "pk": 30030001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD, saying:",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1-2</a>",
      "comment": "This introductory formula signals a new prophecy, emphasizing divine origin. Jeremiah's role as a prophet echoes Moses' role as an intermediary and foreshadows the later importance of apostolic authority in God's plan."
    },
    {
      "pk": 30030002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 2,
      "text": "'Thus says the LORD, the God of Israel: Write in a book all the words I have spoken to you.",
      "links": "<a href='/AIV/24/36/2'>Jer. 36:2</a>; <a href='/AIV/02/34/27'>Ex. 34:27</a>",
      "comment": "God instructs Jeremiah to record His words, stressing the importance of written tradition. This affirms that God's revelation is preserved both orally and in writing, anticipating the later tradition of scriptural and authoritative writings."
    },
    {
      "pk": 30030003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 3,
      "text": "'For behold, days are coming,' declares the LORD, 'when I will restore the fortunes of My people, Israel and Judah,' says the LORD. 'I will bring them back to the land that I gave to their ancestors, and they shall possess it.'",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/24/23/7-8'>Jer. 23:7-8</a>",
      "comment": "God promises restoration and unity for Israel and Judah. This has both a historical and spiritual meaning, foreshadowing the ultimate spiritual gathering of God's people — not only physically, but into true unity."
    },
    {
      "pk": 30030004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 4,
      "text": "These are the words the LORD spoke concerning Israel and Judah:",
      "links": "<a href='/AIV/24/33/14'>Jer. 33:14</a>; <a href='/AIV/11/12/24'>1 Kings 12:24</a>",
      "comment": "The focus shifts to both Israel and Judah, indicating that God’s plan involves all His chosen people, later connecting to the universal family of believers."
    },
    {
      "pk": 30030005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 5,
      "text": "'For thus says the LORD: We have heard the sound of trembling, fear, and not peace.",
      "links": "<a href='/AIV/23/22/4'>Isa. 22:4</a>; <a href='/AIV/24/6/24'>Jer. 6:24</a>",
      "comment": "The approach of trouble brings fear rather than peace. This echoes humanity’s condition before ultimate redemption through Christ."
    },
    {
      "pk": 30030006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 6,
      "text": "Ask now, and see: Can a man bear a child? Why do I see every man with his hands on his loins like a woman in labor, and every face turned pale?",
      "links": "<a href='/AIV/24/4/31'>Jer. 4:31</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "Portrays a time of distress so severe that men are compared to women in labor. This is a metaphor for the depth of suffering preceding redemption, which has both historical and eschatological significance."
    },
    {
      "pk": 30030007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 7,
      "text": "Alas! That day is great, so that none is like it; it is the time of distress for Jacob, yet he shall be saved out of it.",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/24/46/10'>Jer. 46:10</a>",
      "comment": "This verse is often linked to 'Jacob's trouble,' symbolic of final tribulation, but with a promise of deliverance. Early Christian tradition understood such times as pointing to Christ's salvific work."
    },
    {
      "pk": 30030008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 8,
      "text": "'And it shall come to pass in that day,' declares the LORD of hosts, 'that I will break his yoke from off your neck, and will burst your bonds; and strangers shall no longer make him their slave.",
      "links": "<a href='/AIV/24/2/20'>Jer. 2:20</a>; <a href='/AIV/23/14/25'>Isa. 14:25</a>",
      "comment": "Freedom from bondage points to both political liberation and spiritual freedom from sin, realized fully through Christ’s victory."
    },
    {
      "pk": 30030009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 9,
      "text": "But they shall serve the LORD their God and David their king, whom I will raise up for them.",
      "links": "<a href='/AIV/26/34/23-24'>Ezek. 34:23-24</a>; <a href='/AIV/24/23/5'>Jer. 23:5</a>; <a href='/AIV/40/22/42-45'>Matt. 22:42-45</a>",
      "comment": "Prophecies concerning 'David their king' anticipate the coming Messiah, fulfilled in Jesus, the Son of David. This also points to a visible, continuous authority in the kingdom, hinting at apostolic succession."
    },
    {
      "pk": 30030010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 10,
      "text": "'Therefore do not fear, O My servant Jacob,' says the LORD, 'nor be dismayed, O Israel. For behold, I will save you from afar, and your offspring from the land of their captivity. Jacob shall return and have quiet and be at ease, and no one shall make him afraid.",
      "links": "<a href='/AIV/01/15/13-14'>Gen. 15:13-14</a>; <a href='/AIV/24/46/27'>Jer. 46:27</a>",
      "comment": "God’s promise of physical and spiritual restoration reassures the people of hope. This is reflected in Christ’s promise to gather the scattered children of God."
    },
    {
      "pk": 30030011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 11,
      "text": "'For I am with you to save you,' declares the LORD. 'I will make a full end of all the nations where I have scattered you, but I will not make a full end of you. I will discipline you in measure, and not leave you unpunished.'",
      "links": "<a href='/AIV/24/46/28'>Jer. 46:28</a>; <a href='/AIV/19/94/12'>Ps. 94:12</a>",
      "comment": "God’s discipline is for correction, not destruction. This reflects the principle of redemptive suffering, a theme carried into the New Covenant as believers participate in Christ's sufferings."
    },
    {
      "pk": 30030012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 12,
      "text": "For thus says the LORD: 'Your wound is incurable, your injury is grievous.",
      "links": "<a href='/AIV/24/8/22'>Jer. 8:22</a>; <a href='/AIV/23/1/6'>Isa. 1:6</a>",
      "comment": "Humanity’s spiritual condition is described as incurable without divine intervention, setting the stage for the need of a Savior."
    },
    {
      "pk": 30030013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 13,
      "text": "There is no one to plead your cause, no remedy for your wound, no healing for you.",
      "links": "<a href='/AIV/18/9/33'>Job 9:33</a>; <a href='/AIV/23/53/4-5'>Isa. 53:4-5</a>",
      "comment": "No earthly intercessor is able to heal. Christ as the true mediator and high priest brings ultimate healing."
    },
    {
      "pk": 30030014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 14,
      "text": "All your lovers have forgotten you; they seek you no more; for I have wounded you with the wound of an enemy, with the punishment of a cruel one, because your sins are many and your guilt is great.",
      "links": "<a href='/AIV/24/5/19'>Jer. 5:19</a>; <a href='/AIV/24/2/25'>Jer. 2:25'>Jer. 2:25</a>",
      "comment": "Former allies cannot help; discipline comes as a result of sin, reminding us that forgiveness and restoration come only through true repentance and grace."
    },
    {
      "pk": 30030015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 15,
      "text": "Why do you cry over your wound? Your pain is incurable. Because your sins are many and your guilt is great, I have done these things to you.",
      "links": "<a href='/AIV/24/14/17'>Jer. 14:17</a>; <a href='/AIV/19/147/3'>Ps. 147:3</a>",
      "comment": "God reemphasizes the seriousness of sin and the necessity of His justice. Mercy is offered, but not without recognition of guilt."
    },
    {
      "pk": 30030016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 16,
      "text": "'Therefore all who devour you shall be devoured; and all your adversaries, every one of them, shall go into captivity. Those who plunder you shall be plundered, and all who prey on you I will make a prey.'",
      "links": "<a href='/AIV/23/41/11-12'>Isa. 41:11-12</a>",
      "comment": "God promises just retribution against Israel’s enemies. This echoes the principle of divine justice and vindication."
    },
    {
      "pk": 30030017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 17,
      "text": "'For I will restore health to you, and your wounds I will heal,' declares the LORD, 'because they have called you an outcast: ",
      "It is Zion, for whom no one cares.": "Jer. 33:6</a>; <a href='/AIV/23/57/18-19'>Isa. 57:18-19</a>",
      "comment": "Healing and restoration are God's response to rejection. Zion's restoration foretells God's faithfulness to His promises and the establishment of a new, holy people called to unity."
    },
    {
      "pk": 30030018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 18,
      "text": "Thus says the LORD: 'Behold, I will restore the fortunes of Jacob’s tents and have compassion on his dwellings. The city shall be rebuilt on its mound, and the place of palace shall stand as of old.",
      "links": "<a href='/AIV/24/31/4'>Jer. 31:4</a>; <a href='/AIV/16/3/8'>Neh. 3:8</a>",
      "comment": "God's renewal involves both material and spiritual restoration. The rebuilding of the city foreshadows the New Jerusalem and the visible gathering of believers."
    },
    {
      "pk": 30030019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 19,
      "text": "Out of them shall come thanksgiving and the sound of those celebrating. I will multiply them, and they shall not be few; I will make them honored, and they shall not be low.",
      "links": "<a href='/AIV/24/33/11'>Jer. 33:11</a>; <a href='/AIV/19/107/22'>Ps. 107:22</a>",
      "comment": "Blessing and joy after suffering hint at the future liturgical worship of God’s people, perfected in the gathering of the Church."
    },
    {
      "pk": 30030020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 20,
      "text": "Their children shall be as they were before, and their congregation shall be established before Me, and I will punish all who oppress them.",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/19/22/22'>Ps. 22:22</a>",
      "comment": "The establishment of a 'congregation' before God hints at His people gathered in worship and unity, consistent with the visible reality of a worshiping community."
    },
    {
      "pk": 30030021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 21,
      "text": "Their leader shall be one of their own, and their ruler shall come forth from their midst. I will draw him near, and he shall approach Me; for who would dare to approach Me otherwise?' declares the LORD.",
      "links": "<a href='/AIV/05/18/15'>Deut. 18:15</a>; <a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "This ruler, raised from the people and able to approach God, points to the mystery of the Incarnation and the high priestly ministry of Christ, as well as the importance of a divinely appointed spiritual leader."
    },
    {
      "pk": 30030022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 22,
      "text": "'And you shall be My people, and I will be your God.'",
      "links": "<a href='/AIV/24/7/23'>Jer. 7:23</a>; <a href='/AIV/03/26/12'>Lev. 26:12</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "The covenant language confirms God’s intent of relationship with His people, realized fully in the New Covenant through the Church — the new Israel."
    },
    {
      "pk": 30030023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 23,
      "text": "Behold, the storm of the LORD! Wrath has gone forth, a sweeping whirlwind; it will burst upon the head of the wicked.",
      "links": "<a href='/AIV/24/23/19'>Jer. 23:19</a>; <a href='/AIV/19/11/6'>Ps. 11:6</a>",
      "comment": "God’s judgment is swift and decisive, reinforcing that mercy must be sought lest judgment fall on the unrepentant."
    },
    {
      "pk": 30030024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 30,
      "verse": 24,
      "text": "The fierce anger of the LORD will not turn back until He has performed and accomplished the intentions of His heart. In the latter days, you will understand this.",
      "links": "<a href='/AIV/24/23/20'>Jer. 23:20</a>; <a href='/AIV/66/10/7'>Rev. 10:7</a>",
      "comment": "Final fulfillment and understanding come in the 'latter days,' suggesting the future realization of God's plan in and through the Messiah and the establishment of a visible, spiritual kingdom."
    }
  ],
  "translatedAt": "2025-12-24T08:37:48.520Z"
}