{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 42,
  "verses": [
    {
      "pk": 30042001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 1,
      "text": "Then all the commanders of the forces, and Johanan son of Kareah, Jezaniah son of Hoshaiah, and all the people from the least to the greatest, came near",
      "links": "<a href='/AIV/24/40/13'>Jer. 40:13</a>; <a href='/AIV/24/41/16'>Jer. 41:16</a>",
      "comment": "The gathering of both leaders and people highlights the seriousness and desperation of the remnant after the fall of Jerusalem. The phrase 'from the least to the greatest' points to the inclusion of the entire community, emphasizing unity in seeking God’s will."
    },
    {
      "pk": 30042002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 2,
      "text": "and said to Jeremiah the prophet, 'Let our plea for mercy come before you, and pray to the LORD your God for us, for all this remnant—for we are left but a few of many, as your eyes see us—'",
      "links": "<a href='/AIV/24/37/3'>Jer. 37:3</a>; <a href='/AIV/24/7/16'>Jer. 7:16</a>",
      "comment": "The people ask Jeremiah to intercede for them, acknowledging their reduced numbers. The concept of appealing to a prophet for intercession anticipates the New Testament understanding of mediatorship, subtly pointing toward the spiritual importance of intercessory prayer. See also James 5:16."
    },
    {
      "pk": 30042003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 3,
      "text": "'that the LORD your God may show us the way we should go, and the thing that we should do.'",
      "links": "<a href='/AIV/19/143/8'>Ps. 143:8</a>; <a href='/AIV/23/30/21'>Isa. 30:21</a>",
      "comment": "Seeking divine guidance in specific actions reveals a reliance on revelation beyond personal discernment, inviting reflection on the importance of seeking God’s will through established authority and spiritual discernment (cf. Acts 9:6 for NT parallel)."
    },
    {
      "pk": 30042004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 4,
      "text": "Jeremiah the prophet said to them, 'I have heard you. Behold, I will pray to the LORD your God according to your request, and whatever the LORD answers you, I will declare to you; I will not keep back a word from you.'",
      "links": "<a href='/AIV/24/23/28'>Jer. 23:28</a>; <a href='/AIV/24/1/7-8'>Jer. 1:7-8</a>",
      "comment": "Jeremiah’s faithfulness to proclaim all of God’s message, withholding nothing, sets a model for divine revelation’s integrity and completeness. This reflects the enduring principle that prophetic truth is not self-edited, an idea seen in Acts 20:27 regarding apostolic teaching."
    },
    {
      "pk": 30042005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 5,
      "text": "Then they said to Jeremiah, 'May the LORD be a true and faithful witness against us if we do not act according to all the word with which the LORD your God sends you to us.'",
      "links": "<a href='/AIV/24/5/2'>Jer. 5:2</a>; <a href='/AIV/24/43/2'>Jer. 43:2</a>",
      "comment": "Their solemn oath before God underscores the seriousness of obedience to revelation. The people’s vow anticipates the New Testament principle of obedience to apostolic teaching (see Matthew 28:20), and points to the Church as a reliable witness of God’s word."
    },
    {
      "pk": 30042006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 6,
      "text": "'Whether it is good or evil, we will obey the voice of the LORD our God to whom we are sending you, that it may be well with us when we obey the voice of the LORD our God.'",
      "links": "<a href='/AIV/24/7/23'>Jer. 7:23</a>; <a href='/AIV/24/26/13'>Jer. 26:13</a>",
      "comment": "Total submission to God’s word is expressed, echoing Deuteronomy 5:27. In biblical spirituality, blessings result from obedience (cf. James 1:22), anticipating the fullness of divine guidance through those whom God appoints."
    },
    {
      "pk": 30042007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 7,
      "text": "At the end of ten days, the word of the LORD came to Jeremiah.",
      "links": "<a href='/AIV/24/39/15'>Jer. 39:15</a>",
      "comment": "The ten-day delay highlights that God’s timing governs revelation, not human urgency. This encourages patient waiting upon the Lord for authentic, binding guidance (cf. Psalm 27:14)."
    },
    {
      "pk": 30042008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 8,
      "text": "Then he called Johanan son of Kareah and all the commanders of the forces who were with him, and all the people from the least to the greatest,",
      "links": "<a href='/AIV/24/41/16'>Jer. 41:16</a>",
      "comment": "Jeremiah gathers everyone, ensuring the entire remnant hears God’s word together. The public nature of revelation underscores the community’s accountability, a principle reflected in the communal aspect of Church life (see Acts 15 for conciliar decisions)."
    },
    {
      "pk": 30042009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 9,
      "text": "and said to them, 'Thus says the LORD, the God of Israel, to whom you sent me to present your supplication before him:'",
      "links": "<a href='/AIV/24/38/17'>Jer. 38:17</a>",
      "comment": "Jeremiah’s use of 'Thus says the LORD' reiterates his role as mouthpiece for God, aligning with the unbroken prophetic and apostolic succession by which God’s word remains present among his people."
    },
    {
      "pk": 30042010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 10,
      "text": "'If you will still remain in this land, then I will build you up and not pull you down; I will plant you and not pluck you up, for I relent of the disaster that I have brought upon you.'",
      "links": "<a href='/AIV/24/1/10'>Jer. 1:10</a>; <a href='/AIV/24/18/8-9'>Jer. 18:8-9</a>",
      "comment": "God pledges to restore if they trust and remain. The 'building and planting' imagery echoes the Church’s mission (cf. Matthew 16:18, planting and authority imagery), and recalls God’s original blessing and intention for humanity."
    },
    {
      "pk": 30042011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 11,
      "text": "'Do not be afraid of the king of Babylon, whom you now fear. Do not be afraid of him, declares the LORD, for I am with you, to save you and to deliver you from his hand.'",
      "links": "<a href='/AIV/24/1/8'>Jer. 1:8</a>; <a href='/AIV/24/30/10-11'>Jer. 30:10-11</a>",
      "comment": "God’s repeated assurance of his presence in deliverance foreshadows the promise 'I am with you always' (Matthew 28:20). Trust in divine protection is a spiritual lesson for all who face external threats."
    },
    {
      "pk": 30042012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 12,
      "text": "'I will show you mercy, that he may have mercy on you and let you remain in your own land.'",
      "links": "<a href='/AIV/24/39/12'>Jer. 39:12</a>; <a href='/AIV/24/33/26'>Jer. 33:26</a>",
      "comment": "Mercy is a core theme, linking Old Testament and New Testament teachings (cf. Luke 1:78). God works even through non-Israelite rulers to show kindness toward his people."
    },
    {
      "pk": 30042013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 13,
      "text": "'But if you say, \"We will not stay in this land,\" not obeying the voice of the LORD your God,'",
      "links": "<a href='/AIV/24/7/23-26'>Jer. 7:23-26</a>",
      "comment": "This conditional warning reiterates that God’s guidance is offered with the expectation of obedience, echoing Israel’s historic struggles to trust God’s commands."
    },
    {
      "pk": 30042014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 14,
      "text": "'and you say, \"No, but we will go to the land of Egypt, where we will not see war or hear the sound of the trumpet or be hungry for bread, and we will dwell there,\"'",
      "links": "<a href='/AIV/24/43/7'>Jer. 43:7</a>; <a href='/AIV/02/16/3'>Ex. 16:3</a>",
      "comment": "Egypt is a repeated symbol throughout scripture for worldly security in contrast to faith in God, paralleling earlier Israelite grumbling. Spiritually, this verse warns against seeking safety apart from God’s will."
    },
    {
      "pk": 30042015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 15,
      "text": "'then hear now the word of the LORD, O remnant of Judah: Thus says the LORD of hosts, the God of Israel: If you set your faces to enter Egypt and go to live there,'",
      "links": "<a href='/AIV/24/44/12-14'>Jer. 44:12-14</a>",
      "comment": "A clear prophetic warning. The persistent phrase 'remnant of Judah' recalls God’s preservation of a faithful people, as developed in Joel 2:32 and Romans 11:5."
    },
    {
      "pk": 30042016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 16,
      "text": "'then the sword that you fear shall overtake you there in the land of Egypt, and the famine of which you are afraid will follow close after you to Egypt, and there you shall die.'",
      "links": "<a href='/AIV/24/44/13'>Jer. 44:13</a>",
      "comment": "Trusting in worldly powers instead of God ensures the very fate they fear. This principle is echoed in Psalm 146:3, which warns against trusting in princes."
    },
    {
      "pk": 30042017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 17,
      "text": "'All the men who set their faces to go to Egypt to live there shall die by the sword, by famine, and by pestilence. They shall have no remnant or survivor from the disaster that I will bring upon them.'",
      "links": "<a href='/AIV/24/44/27'>Jer. 44:27</a>; <a href='/AIV/24/24/10'>Jer. 24:10</a>",
      "comment": "Going against God’s word ends in ruin, a strong call to trust God’s promises above perceived worldly security. The complete destruction mentioned is reminiscent of earlier judgments upon the faithless."
    },
    {
      "pk": 30042018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 18,
      "text": "'For thus says the LORD of hosts, the God of Israel: As my anger and my wrath have been poured out on the inhabitants of Jerusalem, so my wrath will be poured out on you when you go to Egypt; you shall become a curse, a horror, a reproach, and a taunt. You shall see this place no more.'",
      "links": "<a href='/AIV/24/44/12'>Jer. 44:12</a>; <a href='/AIV/24/18/16'>Jer. 18:16</a>",
      "comment": "The fate awaiting those who reject God’s guidance is exile and infamy. This severe warning prefigures spiritual exile from God’s presence for willful disobedience (cf. Matthew 7:23)."
    },
    {
      "pk": 30042019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 19,
      "text": "The LORD has spoken concerning you, O remnant of Judah: 'Do not go to Egypt. Know for certain that I have warned you this day.'",
      "links": "<a href='/AIV/05/08/19'>Deut. 8:19</a>; <a href='/AIV/24/43/2'>Jer. 43:2</a>",
      "comment": "God’s will is unambiguous. The repetition underlines the clarity of divine command, calling to mind the need for confident reliance on God’s direction."
    },
    {
      "pk": 30042020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 20,
      "text": "'For you have gone astray at the cost of your own lives, for you sent me to the LORD your God, saying, \"Pray for us to the LORD our God, and whatever the LORD our God says, declare to us and we will do it.\"'",
      "links": "<a href='/AIV/24/42/2-6'>Jer. 42:2-6</a>",
      "comment": "Jeremiah exposes the insincerity of their request. Outward piety without inner commitment leads to spiritual danger, paralleling God’s call for authentic worship (cf. Isaiah 29:13, Matthew 15:8)."
    },
    {
      "pk": 30042021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 21,
      "text": "'And I have declared it to you this day, but you have not obeyed the voice of the LORD your God in anything that he sent me to tell you.'",
      "links": "<a href='/AIV/24/7/26'>Jer. 7:26</a>; <a href='/AIV/24/25/4'>Jer. 25:4</a>",
      "comment": "Obedience to divine revelation is central. This identifies the importance of listening to faithful spiritual leadership and submitting to revealed truth, a consistent biblical message."
    },
    {
      "pk": 30042022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 42,
      "verse": 22,
      "text": "'Now therefore know for certain that you shall die by the sword, by famine, and by pestilence in the place where you desire to go to live.'",
      "links": "<a href='/AIV/24/27/8'>Jer. 27:8</a>; <a href='/AIV/24/44/13'>Jer. 44:13</a>",
      "comment": "The conclusion restates the high cost of disobedience. Spiritual application: true life is found in surrender to God’s will, not in following our own wisdom apart from revealed truth."
    }
  ],
  "translatedAt": "2025-12-24T08:44:52.172Z"
}