{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 38,
  "verses": [
    {
      "pk": 30038001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 1,
      "text": "Now Shephatiah son of Mattan, Gedaliah son of Pashhur, Jucal son of Shelemiah, and Pashhur son of Malchiah heard the words Jeremiah was speaking to all the people, saying:",
      "links": "<a href='/AIV/24/20/1'>Jer. 20:1</a>; <a href='/AIV/24/37/3'>Jer. 37:3</a>",
      "comment": "Introduces several officials who were hostile to Jeremiah. Their genealogy underscores their priestly and political influence."
    },
    {
      "pk": 30038002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 2,
      "text": "This is what he said: 'This is what the LORD says: “Whoever remains in this city will die by the sword, famine, or plague; but whoever goes out to the Chaldeans will live and will have his life as a prize.'",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>; <a href='/AIV/24/27/13'>Jer. 27:13</a>",
      "comment": "Jeremiah delivers a message of judgment, echoing earlier prophecies. The call to surrender is harsh but rooted in obedience."
    },
    {
      "pk": 30038003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 3,
      "text": "“This city will certainly be handed over to the army of the king of Babylon, and he will capture it.”",
      "links": "<a href='/AIV/24/32/3'>Jer. 32:3</a>; <a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Direct prophecy of Jerusalem’s fall; speaks to the certainty of God’s word above political hope or resistance."
    },
    {
      "pk": 30038004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 4,
      "text": "Then the officials said to the king, 'Let this man be put to death! He is weakening the hands of the soldiers who remain in this city, and of all the people, by speaking such words to them; this man does not seek the welfare of this people, but their harm.'",
      "links": "<a href='/AIV/24/26/11'>Jer. 26:11</a>; <a href='/AIV/24/37/13'>Jer. 37:13</a>",
      "comment": "Jeremiah is accused of treason. Note the tension between prophetic truth and political power."
    },
    {
      "pk": 30038005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 5,
      "text": "King Zedekiah said, 'He is in your hands; the king can do nothing against you.'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Zedekiah’s weakness is exposed; he abdicates responsibility and gives in to pressure, foreshadowing his downfall."
    },
    {
      "pk": 30038006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 6,
      "text": "So they took Jeremiah and cast him into the cistern of Malchiah, the king’s son, which was in the court of the guard. They lowered Jeremiah with ropes, but there was no water in the cistern, only mud, and Jeremiah sank into the mud.",
      "links": "<a href='/AIV/24/37/16'>Jer. 37:16</a>; <a href='/AIV/1/37/20-24'>Gen. 37:20-24</a>",
      "comment": "The imagery recalls Joseph’s mistreatment (Gen. 37:20-24); Jeremiah, like many prophets, suffers for God’s truth."
    },
    {
      "pk": 30038007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 7,
      "text": "But Ebed-Melech the Cushite, an official in the king’s palace, heard that Jeremiah had been put in the cistern. While the king was sitting in the Benjamin Gate,",
      "links": "<a href='/AIV/24/39/16-18'>Jer. 39:16-18</a>",
      "comment": "Ebed-Melech, a foreigner and palace official, is moved to act compassionately, reflecting God’s concern for the righteous—no matter their background."
    },
    {
      "pk": 30038008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 8,
      "text": "Ebed-Melech left the king’s palace and spoke to the king,",
      "links": "<a href='/AIV/24/22/3'>Jer. 22:3</a>",
      "comment": "A bold act—advocating for justice in the face of danger parallels the biblical theme of intercession and mediation."
    },
    {
      "pk": 30038009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 9,
      "text": "'My lord the king, those men have acted wickedly in all they have done to Jeremiah the prophet. They have cast him into the cistern, and he will die there of hunger, for there is no longer any bread in the city.'",
      "links": "<a href='/AIV/24/26/16'>Jer. 26:16</a>",
      "comment": "Ebed-Melech courageously appeals to the king, recognizing the value of Jeremiah’s prophetic role—a sign of God’s ongoing guidance through chosen intermediaries."
    },
    {
      "pk": 30038010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 10,
      "text": "Then the king commanded Ebed-Melech the Cushite, saying, 'Take thirty men from here and lift Jeremiah the prophet out of the cistern before he dies.'",
      "links": "<a href='/AIV/24/40/6'>Jer. 40:6</a>",
      "comment": "The king relents and authorizes a rescue. The sizable force suggests both urgency and potential resistance, highlighting Jeremiah’s importance."
    },
    {
      "pk": 30038011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 11,
      "text": "So Ebed-Melech took the men with him and went to the king’s palace, to a room under the treasury, and took worn-out clothes and old rags, and let them down by ropes to Jeremiah in the cistern.",
      "links": "<a href='/AIV/24/39/16'>Jer. 39:16</a>",
      "comment": "Worn-out clothes and rags show both compassion and ingenuity—care for the body, not just the spirit, is biblically affirmed."
    },
    {
      "pk": 30038012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 12,
      "text": "Ebed-Melech the Cushite said to Jeremiah, 'Put these rags and worn-out clothes under your arms to cushion the ropes.' Jeremiah did so.",
      "links": "<a href='/AIV/24/39/17'>Jer. 39:17</a>",
      "comment": "A small act of mercy for the suffering prophet, echoing the biblical call to love one’s neighbor through concrete deeds."
    },
    {
      "pk": 30038013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 13,
      "text": "Then they pulled Jeremiah up with ropes and lifted him out of the cistern. And Jeremiah remained in the court of the guard.",
      "links": "<a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "Jeremiah is saved—his resilience prefigures Christ’s endurance under persecution and highlights God’s faithfulness."
    },
    {
      "pk": 30038014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 14,
      "text": "King Zedekiah sent for Jeremiah the prophet and had him brought to the third entrance of the LORD’s temple. The king said to Jeremiah, 'I want to ask you something; do not hide anything from me.'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "In private, Zedekiah seeks a true word from Jeremiah. The temple setting suggests the importance of revelation and God’s guidance for leadership."
    },
    {
      "pk": 30038015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 15,
      "text": "Jeremiah said to Zedekiah, 'If I give you an answer, you will surely put me to death; and if I give you counsel, you will not listen to me.'",
      "links": "<a href='/AIV/24/26/15'>Jer. 26:15</a>; <a href='/AIV/24/37/20'>Jer. 37:20</a>",
      "comment": "Jeremiah senses the king’s reluctance to obey, highlighting the cost of delivering God’s uncomfortable truths."
    },
    {
      "pk": 30038016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 16,
      "text": "So King Zedekiah secretly swore to Jeremiah, 'As surely as the LORD lives, who gave us this life, I will not put you to death nor hand you over to those who seek your life.'",
      "links": "<a href='/AIV/7/15/2'>Judg. 15:2</a>",
      "comment": "Zedekiah’s oath in the name of the living LORD invokes the gravity of covenant, underscoring the biblical view of oaths and their sacredness."
    },
    {
      "pk": 30038017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 17,
      "text": "Then Jeremiah said to Zedekiah, 'This is what the LORD, the God of Hosts, the God of Israel, says: “If you will surrender to the officials of the king of Babylon, then your life will be spared, and this city will not be burned with fire; you and your family will live.”'",
      "links": "<a href='/AIV/24/27/12'>Jer. 27:12</a>; <a href='/AIV/24/21/8-10'>Jer. 21:8-10</a>",
      "comment": "The message is one of grace through obedience—God’s mercy awaits those who submit to divine will, even when it is difficult."
    },
    {
      "pk": 30038018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 18,
      "text": "But if you do not surrender to the officials of the king of Babylon, this city will be handed over to the Chaldeans, and they will burn it with fire. You yourself will not escape from their hands.'",
      "links": "<a href='/AIV/24/32/29'>Jer. 32:29</a>; <a href='/AIV/12/25/8-12'>2 Kgs. 25:8-12</a>",
      "comment": "God’s warnings are always serious, and refusal brings judgment—a recurring biblical theme that points forward to Christ’s warnings in the New Testament."
    },
    {
      "pk": 30038019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 19,
      "text": "King Zedekiah said to Jeremiah, 'I am afraid of the Judeans who have gone over to the Chaldeans; they may deliver me into their hands, and they will mistreat me.'",
      "links": "<a href='/AIV/24/39/4'>Jer. 39:4</a>",
      "comment": "Zedekiah’s fear of betrayal illustrates the weakness of earthly leadership compared to reliance on God’s promises and providence."
    },
    {
      "pk": 30038020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 20,
      "text": "Jeremiah replied, 'You will not be handed over to them. Obey the voice of the LORD in what I am telling you, and it will go well for you and your life will be spared.'",
      "links": "<a href='/AIV/24/17/7-8'>Jer. 17:7-8</a>",
      "comment": "Jeremiah’s assurance highlights the importance of obedience to divine revelation—a spiritual principle seen throughout Scripture."
    },
    {
      "pk": 30038021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 21,
      "text": "'But if you refuse to surrender, this is what the LORD has revealed to me:'",
      "links": "<a href='/AIV/24/27/14'>Jer. 27:14</a>",
      "comment": "Conditional prophecy—the gift of free will operates with consequences. Divine warnings invite conversion and repentance."
    },
    {
      "pk": 30038022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 22,
      "text": "'All the women left in the king of Judah’s palace will be brought out to the officials of the king of Babylon, and they will say: “Your trusted friends have deceived you and prevailed over you; your feet are sunk in the mud, and they have turned away.”'",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>",
      "comment": "The motif of betrayal by friends is common in Scripture (cf. Ps. 41:9). The imagery of sinking in mud recalls Jeremiah’s personal suffering and the fate of the unfaithful."
    },
    {
      "pk": 30038023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 23,
      "text": "'All your wives and children will be brought out to the Chaldeans, and you yourself will not escape from their hands. You will be captured by the king of Babylon, and this city will be burned with fire.'",
      "links": "<a href='/AIV/12/25/8-11'>2 Kgs. 25:8-11</a>",
      "comment": "Sobering consequences of disobedience—family and city suffer under judgment, emphasizing corporate responsibility in biblical revelation."
    },
    {
      "pk": 30038024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 24,
      "text": "Then Zedekiah said to Jeremiah, 'Let no one know about this conversation, or you may die.'",
      "links": "<a href='/AIV/24/26/24'>Jer. 26:24</a>",
      "comment": "Secrecy suggests fear and lack of openness—contrasting with biblical calls for transparency and truth, as seen in Christ’s public ministry."
    },
    {
      "pk": 30038025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 25,
      "text": "If the officials hear that I have talked with you, and come to you and say, 'Tell us what you said to the king and what the king said to you; do not hide it from us, or we will kill you,'",
      "links": "<a href='/AIV/24/37/17'>Jer. 37:17</a>",
      "comment": "Political pressure mounts; parallels exist in the New Testament, where Christ and the apostles face threats for speaking God’s truth."
    },
    {
      "pk": 30038026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 26,
      "text": "then tell them, ‘I was pleading with the king not to send me back to Jonathan’s house to die there.’",
      "links": "<a href='/AIV/24/37/20'>Jer. 37:20</a>",
      "comment": "Jeremiah is instructed to share a partial truth for self-preservation—a rare biblical instance where discretion is permitted under duress."
    },
    {
      "pk": 30038027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 27,
      "text": "Then all the officials came to Jeremiah and questioned him. He reported everything the king had instructed him to say. So they left him alone, for no one had overheard the conversation.",
      "links": "<a href='/AIV/24/37/20'>Jer. 37:20</a>",
      "comment": "God protects Jeremiah through prudence—highlights the virtue of wisdom joined to truth. Discretion can serve God's purposes in a fallen world."
    },
    {
      "pk": 30038028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 38,
      "verse": 28,
      "text": "Jeremiah remained in the court of the guard until the day Jerusalem was taken.",
      "links": "<a href='/AIV/24/39/14'>Jer. 39:14</a>; <a href='/AIV/24/37/21'>Jer. 37:21</a>",
      "comment": "Jeremiah’s endurance and fidelity mirror those of Christ under arrest (cf. John 18); God’s servant remains present, interceding for the people as judgment arrives."
    }
  ],
  "translatedAt": "2025-12-24T08:42:56.008Z"
}