{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 29,
  "verses": [
    {
      "pk": 30029001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 1,
      "text": "These are the words of the letter that Jeremiah the prophet sent from Jerusalem to the remainder of the elders of the exiles, to the priests, the prophets, and all the people whom Nebuchadnezzar had taken away captive from Jerusalem to Babylon.",
      "links": "<a href='/AIV/27/1/1-7'>Dan. 1:1-7</a>; <a href='/AIV/14/36/20'>2 Chron. 36:20</a>",
      "comment": "Jeremiah records his letter addressed to the exiles in Babylon, including elders, priests, and prophets, emphasizing a structured and ongoing leadership among God's people even in exile."
    },
    {
      "pk": 30029002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 2,
      "text": "This happened after King Jeconiah, the queen mother, the officials, the leaders of Judah and Jerusalem, the craftsmen, and the smiths had departed from Jerusalem.",
      "links": "<a href='/AIV/12/24/12-16'>2 Kings 24:12-16</a>",
      "comment": "The text refers to the first major exile, highlighting the loss of both leadership and skilled workers—a pattern of God's judgment yet also preparation for renewal."
    },
    {
      "pk": 30029003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 3,
      "text": "The letter was sent by the hand of Elasah the son of Shaphan and Gemariah the son of Hilkiah, whom Zedekiah king of Judah sent to Babylon to Nebuchadnezzar king of Babylon. It said:",
      "links": "<a href='/AIV/12/22/12'>2 Kings 22:12</a>; <a href='/AIV/12/24/17'>2 Kings 24:17</a>",
      "comment": "Naming the letter bearers underscores the message's authenticity and preserves the historic foundation of this divine communication."
    },
    {
      "pk": 30029004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 4,
      "text": "'Thus says the LORD of hosts, the God of Israel, to all the exiles whom I have sent from Jerusalem to Babylon:",
      "links": "<a href='/AIV/23/44/26'>Isa. 44:26</a>; <a href='/AIV/24/24/5'>Jer. 24:5</a>",
      "comment": "God asserts His sovereignty, reminding the exiles their captivity is by His will—a theme for later Christian understanding of trust in divine providence."
    },
    {
      "pk": 30029005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 5,
      "text": "'Build houses and live in them; plant gardens and eat their fruit.",
      "links": "<a href='/AIV/01/41/52'>Gen. 41:52</a>",
      "comment": "God instructs the exiles to seek stability and fruitfulness in a foreign land, reminding us of the spiritual value of perseverance and community living even in adversity."
    },
    {
      "pk": 30029006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 6,
      "text": "'Take wives and have sons and daughters; take wives for your sons and give your daughters in marriage, that they may bear sons and daughters. Multiply there; do not decrease.",
      "links": "<a href='/AIV/01/09/07'>Gen. 9:7</a>",
      "comment": "The command to multiply echoes Genesis. It also indicates that God's people are called to carry on their faith and family lines even when separated from their homeland."
    },
    {
      "pk": 30029007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 7,
      "text": "'Seek the peace and prosperity of the city to which I have sent you into exile. Pray to the LORD on its behalf, for in its peace you will find your peace.'",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/54/2/1-2'>1 Tim. 2:1-2</a>",
      "comment": "Praying for the welfare of the foreign city prefigures Christians' later call to be 'in the world, but not of it.' Community prayer and intercession remain central practices of the people of God."
    },
    {
      "pk": 30029008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 8,
      "text": "For this is what the LORD of hosts, the God of Israel, says: 'Do not let your prophets and diviners who are among you deceive you, nor listen to your dreams which you dream.'",
      "links": "<a href='/AIV/24/23/16-17'>Jer. 23:16-17</a>",
      "comment": "God warns against false hopes or unauthorized spiritual leadership. The scriptural call for discernment stresses the value of authoritative tradition."
    },
    {
      "pk": 30029009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 9,
      "text": "'For they prophesy falsely to you in My name; I have not sent them,' declares the LORD.",
      "links": "<a href='/AIV/24/28/15'>Jer. 28:15</a>",
      "comment": "False prophecy is condemned. Only those truly sent share authentic revelation—important for later understanding of legitimate spiritual authority."
    },
    {
      "pk": 30029010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 10,
      "text": "For thus says the LORD, 'When seventy years are completed for Babylon, I will visit you, and I will fulfill My good promise to you and bring you back to this place.'",
      "links": "<a href='/AIV/27/9/2'>Dan. 9:2</a>; <a href='/AIV/24/25/12'>Jer. 25:12</a>",
      "comment": "The promise of a seventy-year exile is concrete. Fulfillment of prophecy here foreshadows the faithfulness of God to fulfill even greater promises later in salvation history."
    },
    {
      "pk": 30029011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 11,
      "text": "'For I know the plans I have for you,' says the LORD, 'plans for your welfare and not for harm, to give you a future and a hope.'",
      "links": "<a href='/AIV/19/40/5'>Ps. 40:5</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "A beloved verse, often cited for encouragement: God’s plans ultimately point toward eternal salvation. This passage is often spiritually interpreted in reference to God’s wider plan fulfilled in Christ."
    },
    {
      "pk": 30029012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 12,
      "text": "'Then you will call upon Me, and come and pray to Me, and I will listen to you.'",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "God welcomes and hears genuine prayer, laying a foundation for both Old and New Testament teachings on the necessity of personal and communal prayer."
    },
    {
      "pk": 30029013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 13,
      "text": "'You will seek Me and find Me when you search for Me with all your heart.'",
      "links": "<a href='/AIV/05/04/29'>Deut. 4:29</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "Wholehearted seeking is essential; spiritually, this foreshadows Christ’s teaching to ask, seek, and knock for the kingdom of God."
    },
    {
      "pk": 30029014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 14,
      "text": "'I will be found by you,' says the LORD, 'and I will restore your fortunes and gather you from all the nations and all the places where I have driven you,' says the LORD, 'and I will bring you back to the place from which I sent you into exile.'",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/24/23/3'>Jer. 23:3</a>",
      "comment": "The gathering from all nations foreshadows the universal call of God’s people, found in the prophetic hope, and fully realized in the mission of Christ and his followers."
    },
    {
      "pk": 30029015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 15,
      "text": "Because you have said, 'The LORD has raised up prophets for us in Babylon,'—",
      "links": "<a href='/AIV/24/28/1'>Jer. 28:1</a>",
      "comment": "The people wished for new prophets among the exiles, but God cautions that not every spiritual leader is from Him, emphasizing the need for discernment and true continuity of prophetic authority."
    },
    {
      "pk": 30029016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 16,
      "text": "thus says the LORD about the king who sits on David’s throne, and all the people who dwell in this city, your kinsmen who did not go out with you into exile:",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/24/21/9'>Jer. 21:9</a>",
      "comment": "God addresses those still in Jerusalem under the throne of David, maintaining the promise to David’s line despite repeated unfaithfulness—important for understanding later messianic hopes."
    },
    {
      "pk": 30029017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 17,
      "text": "'Thus says the LORD of hosts: Behold, I am sending upon them the sword, famine, and pestilence, and I will make them like rotten figs that are so bad they cannot be eaten.'",
      "links": "<a href='/AIV/24/24/2-10'>Jer. 24:2-10</a>",
      "comment": "The imagery of bad figs is parallel to earlier prophetic visions; it serves as a stark warning about judgment and the consequences of rejecting God’s ways."
    },
    {
      "pk": 30029018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 18,
      "text": "I will pursue them with sword, famine, and pestilence, and I will make them a horror to all the kingdoms of the earth, a curse, a shock, a hissing, and a reproach among all the nations where I have driven them.",
      "links": "<a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "This judgment echoes Deuteronomy’s covenant warnings, illustrating the seriousness of the Lord’s justice alongside the promise of restoration."
    },
    {
      "pk": 30029019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 19,
      "text": "Because they have not listened to My words,' declares the LORD, 'which I sent to them again and again by My servants the prophets; but you would not listen,' declares the LORD.",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>",
      "comment": "Persistent rejection of God's word, despite repeated prophetic calls, is highlighted as the chief cause of judgment."
    },
    {
      "pk": 30029020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 20,
      "text": "But hear the word of the LORD, all you exiles, whom I have sent away from Jerusalem to Babylon.",
      "links": "<a href='/AIV/24/29/4'>Jer. 29:4</a>",
      "comment": "The exiles are directly addressed, reinforcing that the Lord's message is present and active wherever His people are scattered."
    },
    {
      "pk": 30029021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 21,
      "text": "Thus says the LORD of hosts, the God of Israel, concerning Ahab the son of Kolaiah and Zedekiah the son of Maaseiah, who are prophesying a lie to you in My name: 'Behold, I will deliver them into the hand of Nebuchadnezzar king of Babylon, and he shall put them to death before your eyes.'",
      "links": "<a href='/AIV/24/28/15-17'>Jer. 28:15-17</a>",
      "comment": "False prophets receive severe condemnation. The public punishment also serves as a sign for true and false teaching in any age."
    },
    {
      "pk": 30029022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 22,
      "text": "And because of them this curse shall be used by all the exiles of Judah in Babylon: 'May the LORD make you like Zedekiah and Ahab, whom the king of Babylon roasted in the fire,'",
      "links": "<a href='/AIV/27/3/20-22'>Dan. 3:20-22</a>",
      "comment": "Their judgment becomes proverbial. This contrasts with God’s deliverance of the faithful (as in Daniel’s friends), subtly contrasting true and false witness and the lasting power of tradition."
    },
    {
      "pk": 30029023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 23,
      "text": "because they have done a disgraceful thing in Israel, committed adultery with their neighbors’ wives, and spoken lying words in My name, words I did not command. I am He who knows and am witness,' declares the LORD.",
      "links": "<a href='/AIV/04/05/31'>Num. 5:31</a>; <a href='/AIV/19/44/21'>Ps. 44:21</a>",
      "comment": "The link between immorality and false prophecy is underlined, and God as witness reminds us of His omniscience and holiness."
    },
    {
      "pk": 30029024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 24,
      "text": "To Shemaiah the Nehelamite you shall speak, saying,",
      "links": "<a href='/AIV/24/29/31'>Jer. 29:31</a>",
      "comment": "Transition to a message to another false prophet, indicating the seriousness with which God addresses disorder among His people."
    },
    {
      "pk": 30029025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 25,
      "text": "Thus says the LORD of hosts, the God of Israel: You have sent letters in your own name to all the people in Jerusalem, to Zephaniah the son of Maaseiah the priest, and to all the priests, saying,",
      "links": "<a href='/AIV/24/21/1'>Jer. 21:1</a>",
      "comment": "Shemaiah's self-initiated prophecy bypasses proper channels; the priesthood’s role is emphasized, prefiguring later emphasis on instituted spiritual authority."
    },
    {
      "pk": 30029026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 26,
      "text": "'The LORD has made you priest instead of Jehoiada the priest, to have charge in the house of the LORD over every madman who prophesies, to put him in the stocks and neck irons.'",
      "links": "<a href='/AIV/12/11/18'>2 Kings 11:18</a>",
      "comment": "This highlights the temple’s order and the priest’s authority to discipline false prophecy, emphasizing continuity and order in religious leadership."
    },
    {
      "pk": 30029027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 27,
      "text": "Now then, why have you not rebuked Jeremiah of Anathoth who prophesies to you?",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "Shemaiah questions why Jeremiah goes unpunished, illustrating the conflict between false and authentic prophecy and the challenge to recognize God’s true messengers."
    },
    {
      "pk": 30029028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 28,
      "text": "For he has sent to us in Babylon, saying, 'The exile will be long; build houses and live in them, plant gardens and eat their fruit.'",
      "links": "<a href='/AIV/24/29/5'>Jer. 29:5</a>",
      "comment": "Restatement of God’s original command through Jeremiah—a realistic approach to the exile rather than false hope of quick return. Emphasizes acceptance of God’s providence."
    },
    {
      "pk": 30029029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 29,
      "text": "Zephaniah the priest read this letter in the hearing of Jeremiah the prophet.",
      "links": "<a href='/AIV/24/21/1-2'>Jer. 21:1-2</a>",
      "comment": "The public reading reflects the communal and hierarchical nature of discernment on prophetic matters."
    },
    {
      "pk": 30029030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 30,
      "text": "Then the word of the LORD came to Jeremiah:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "God continues to speak directly to Jeremiah, showing prophetic revelation’s primacy over self-appointed claims."
    },
    {
      "pk": 30029031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 31,
      "text": "'Send to all the exiles, saying: Thus says the LORD concerning Shemaiah the Nehelamite: Because Shemaiah has prophesied to you though I did not send him, and has made you trust in a lie,'",
      "links": "<a href='/AIV/24/28/15'>Jer. 28:15</a>",
      "comment": "Shemaiah’s presumption is exposed. Authentic proclamation comes only through those commissioned by God."
    },
    {
      "pk": 30029032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 29,
      "verse": 32,
      "text": "'Therefore thus says the LORD: Behold, I will punish Shemaiah the Nehelamite and his descendants. He shall not have anyone living among this people, nor shall he see the good that I am about to do to My people,' declares the LORD, 'because he has spoken rebellion against the LORD.'",
      "links": "<a href='/AIV/24/28/16-17'>Jer. 28:16-17</a>",
      "comment": "False prophetic authority is judged; Shemaiah’s punishment serves as a warning that divine blessing is reserved for those who remain faithful to God’s revealed order."
    }
  ],
  "translatedAt": "2025-12-24T08:37:21.301Z"
}