{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 31,
  "verses": [
    {
      "pk": 30031001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 1,
      "text": "\"At that time,\" declares the LORD, \"I will be the God of all the families of Israel, and they shall be My people.\"",
      "links": "<a href='/AIV/3/26/12'>Lev 26:12</a>; <a href='/AIV/24/30/22'>Jer 30:22</a>",
      "comment": "God reaffirms His everlasting covenant with Israel, assuring them of His faithful relationship. This covenant relationship prefigures the later new covenant in Christ (see verse 31 below)."
    },
    {
      "pk": 30031002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 2,
      "text": "Thus says the LORD: \"The people who survived the sword found grace in the wilderness; when Israel sought for rest.\"",
      "links": "<a href='/AIV/2/15/22-25'>Ex 15:22-25</a>; <a href='/AIV/28/2/14'>Hos 2:14</a>",
      "comment": "God’s compassion is revealed in the history of Israel, both physically (deliverance from Egypt) and spiritually, prefiguring the grace found in Christ."
    },
    {
      "pk": 30031003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 3,
      "text": "The LORD appeared to him from far away, saying, \"I have loved you with an everlasting love; therefore I have drawn you with loving kindness.\"",
      "links": "<a href='/AIV/28/11/4'>Hos 11:4</a>; <a href='/AIV/19/103/17'>Ps 103:17</a>",
      "comment": "God’s love is eternal. His loving kindness draws us—this reflects the doctrine of prevenient grace, where God takes the initiative in our salvation."
    },
    {
      "pk": 30031004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 4,
      "text": "\"Again I will build you, and you shall be built, O virgin Israel! Again you shall take up your tambourines and go forth in the dance of the merrymakers.\"",
      "links": "<a href='/AIV/2/15/20'>Ex 15:20</a>; <a href='/AIV/19/30/11'>Ps 30:11</a>",
      "comment": "The imagery of restoration looks forward to God renewing His people, both in the return from exile and in the ultimate restoration through Christ and the unity of His people."
    },
    {
      "pk": 30031005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 5,
      "text": "\"Again you shall plant vineyards on the mountains of Samaria; the planters shall plant and shall enjoy the fruit.\"",
      "links": "<a href='/AIV/23/65/21'>Isa 65:21</a>; <a href='/AIV/30/9/14'>Amos 9:14</a>",
      "comment": "Restoration includes physical blessings and spiritual abundance. The healing of Israel’s land prefigures the spiritual fruitfulness promised in the Church."
    },
    {
      "pk": 30031006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 6,
      "text": "\"For there shall be a day when watchmen will call in the hill country of Ephraim: ‘Arise, let us go up to Zion, to the LORD our God!’\"",
      "links": "<a href='/AIV/23/2/3'>Isa 2:3</a>; <a href='/AIV/19/122/1'>Ps 122:1</a>",
      "comment": "An invitation for the people to return to true worship in Jerusalem, which is ultimately fulfilled as all nations are gathered into the one true worship of God."
    },
    {
      "pk": 30031007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 7,
      "text": "For thus says the LORD: \"Sing aloud with gladness for Jacob, and shout for the chief of the nations; proclaim, give praise, and say, ‘O LORD, save Your people, the remnant of Israel.’\"",
      "links": "<a href='/AIV/19/47/1'>Ps 47:1</a>; <a href='/AIV/36/3/17'>Zeph 3:17</a>",
      "comment": "The remnant motif shows God’s faithfulness to preserve a people for Himself, which will blossom fully in the new covenant community."
    },
    {
      "pk": 30031008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 8,
      "text": "\"Behold, I will bring them from the north country, and gather them from the farthest parts of the earth, among them the blind and the lame, the pregnant woman and she who is in labor, together; a great company, they shall return here.\"",
      "links": "<a href='/AIV/23/35/5-6'>Isa 35:5-6</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "The gathering of all, especially the weak and marginalized, prefigures the inclusive nature of God’s kingdom and the universality of Christ’s mission."
    },
    {
      "pk": 30031009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 9,
      "text": "\"With weeping they shall come, and with pleas for mercy I will lead them back. I will make them walk by streams of water, in a straight path in which they shall not stumble; for I am a father to Israel, and Ephraim is My firstborn.\"",
      "links": "<a href='/AIV/19/23/2-3'>Ps 23:2-3</a>; <a href='/AIV/2/4/22'>Ex 4:22</a>",
      "comment": "God’s gentle, fatherly leadership recalls His guidance in the exodus and in Psalm 23. ‘Firstborn’ stresses a chosen, privileged status, later shared by all in Christ (Rom 8:29)."
    },
    {
      "pk": 30031010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 10,
      "text": "\"Hear the word of the LORD, O nations, and declare it in the distant coastlands; say, ‘He who scattered Israel will gather him, and will keep him as a shepherd keeps his flock.’\"",
      "links": "<a href='/AIV/26/34/12'>Ezek 34:12</a>; <a href='/AIV/43/11/52'>John 11:52</a>",
      "comment": "The gathering centers not just on Israel but includes the nations. The image of shepherding is echoed in Christ’s role as the Good Shepherd (John 10)."
    },
    {
      "pk": 30031011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 11,
      "text": "\"For the LORD has ransomed Jacob and redeemed him from hands too strong for him.\"",
      "links": "<a href='/AIV/23/43/1'>Isa 43:1</a>; <a href='/AIV/49/20/28'>Obad 1:17</a>",
      "comment": "Redemption language here anticipates the Messiah’s work, purchasing His people from the power of sin and death (see Eph 1:7)."
    },
    {
      "pk": 30031012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 12,
      "text": "\"They shall come and sing aloud on the height of Zion, and they shall be radiant over the goodness of the LORD—over the grain, the new wine, the oil, and over the young of the flock and the herd; their life shall be like a well-watered garden, and they shall never languish again.\"",
      "links": "<a href='/AIV/23/58/11'>Isa 58:11</a>; <a href='/AIV/19/36/8'>Ps 36:8</a>",
      "comment": "Abundant blessings—visible in the old covenant but fulfilled spiritually in the overflowing life of grace Christ gives."
    },
    {
      "pk": 30031013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 13,
      "text": "\"Then shall the young women rejoice in the dance, and the young men and the old shall be merry. I will turn their mourning into joy, I will comfort them, and give them gladness for sorrow.\"",
      "links": "<a href='/AIV/19/30/11'>Ps 30:11</a>; <a href='/AIV/23/35/10'>Isa 35:10</a>",
      "comment": "God’s ultimate plan is consolation and joy for His people. This theme is echoed in prophetic images of the restoration found in Revelation 21:4."
    },
    {
      "pk": 30031014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 14,
      "text": "\"I will satisfy the priests with abundance, and My people shall be filled with My bounty,\" declares the LORD.",
      "links": "<a href='/AIV/5/18/1-8'>Deut 18:1-8</a>; <a href='/AIV/19/132/15-16'>Ps 132:15-16</a>",
      "comment": "The satisfaction of the priests hints at the rich spiritual food and grace available in the sacraments and in worship."
    },
    {
      "pk": 30031015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 15,
      "text": "Thus says the LORD: \"A voice is heard in Ramah, lamentation and bitter weeping. Rachel is weeping for her children; she refuses to be comforted for her children, because they are no more.\"",
      "links": "<a href='/AIV/1/35/18-20'>Gen 35:18-20</a>; <a href='/AIV/40/2/17-18'>Matt 2:17-18</a>",
      "comment": "Rachel's tears symbolize loss, but their fulfillment in Matthew 2 at the slaughter of the innocents connects Israel's suffering with Christ’s coming."
    },
    {
      "pk": 30031016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 16,
      "text": "Thus says the LORD: \"Keep your voice from weeping, and your eyes from tears, for your work shall be rewarded, declares the LORD, and they shall come back from the land of the enemy.\"",
      "links": "<a href='/AIV/24/29/10-14'>Jer 29:10-14</a>; <a href='/AIV/19/126/5-6'>Ps 126:5-6</a>",
      "comment": "God promises restoration and hope after sorrow. The exile’s reversal is both physical and spiritual, echoed in resurrection hope."
    },
    {
      "pk": 30031017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 17,
      "text": "\"There is hope for your future, declares the LORD, and your children shall come back to their own country.\"",
      "links": "<a href='/AIV/24/29/11'>Jer 29:11</a>; <a href='/AIV/19/147/2-3'>Ps 147:2-3</a>",
      "comment": "God’s faithfulness is the foundation for our hope, not just for Israel’s return but for a future home united with Him."
    },
    {
      "pk": 30031018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 18,
      "text": "\"I have surely heard Ephraim grieving: ‘You have disciplined me, and I was disciplined, like an untrained calf. Bring me back that I may be restored, for You are the LORD my God.'\"",
      "links": "<a href='/AIV/28/6/1'>Hos 6:1</a>; <a href='/AIV/19/80/3'>Ps 80:3</a>",
      "comment": "True restoration involves repentance and God’s transforming work. Even discipline leads to mercy and conversion."
    },
    {
      "pk": 30031019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 19,
      "text": "\"For after I turned away, I repented; and after I was instructed, I struck my thigh; I was ashamed and humiliated because I bore the disgrace of my youth.\"",
      "links": "<a href='/AIV/26/16/61-63'>Ezek 16:61-63</a>; <a href='/AIV/19/51/17'>Ps 51:17</a>",
      "comment": "Repentance leads to restoration. Shown here is both the acknowledgment of past sin and hope through God’s forgiveness."
    },
    {
      "pk": 30031020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 20,
      "text": "\"Is Ephraim My dear son? Is he My darling child? For as often as I speak against him, I still remember him. Therefore My heart yearns for him; I will surely have mercy on him, declares the LORD.\"",
      "links": "<a href='/AIV/28/11/8'>Hos 11:8</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "God’s compassion for Ephraim is like a father’s love for a prodigal son—echoing Luke 15 and Divine Mercy."
    },
    {
      "pk": 30031021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 21,
      "text": "\"Set up road markers for yourself; make guideposts. Consider well the highway, the road by which you went. Return, O virgin Israel, return to these your cities.\"",
      "links": "<a href='/AIV/23/62/10-12'>Isa 62:10-12</a>; <a href='/AIV/19/84/5'>Ps 84:5</a>",
      "comment": "Preparation to return looks forward to spiritual return and the way of holiness, forming a pattern for Christian conversion."
    },
    {
      "pk": 30031022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 22,
      "text": "\"How long will you wander, O faithless daughter? For the LORD has created a new thing on the earth: a woman shall surround a man.\"",
      "links": "<a href='/AIV/1/3/15'>Gen 3:15</a>; <a href='/AIV/42/1/35'>Luke 1:35</a>",
      "comment": "This cryptic prophecy has been linked by Christian tradition to the virginal conception of Christ—the new thing, the unique role of the woman (Mary) in salvation history."
    },
    {
      "pk": 30031023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 23,
      "text": "Thus says the LORD of hosts, the God of Israel: \"Once more they shall use these words in the land of Judah and in its cities, when I restore their fortunes: ‘The LORD bless you, O habitation of righteousness, O holy hill!’\"",
      "links": "<a href='/AIV/23/1/26-27'>Isa 1:26-27</a>; <a href='/AIV/19/48/1'>Ps 48:1</a>",
      "comment": "Judah is restored as a holy place, imaging the holiness of the Church as the new ‘holy hill’ set apart for God."
    },
    {
      "pk": 30031024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 24,
      "text": "And Judah and all its cities shall dwell there together, and the farmers and those who wander with flocks.",
      "links": "<a href='/AIV/23/65/21-23'>Isa 65:21-23</a>",
      "comment": "Peace and unity among all classes of people—a sign of authentic renewal found among God’s people."
    },
    {
      "pk": 30031025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 25,
      "text": "For I will satiate the weary soul, and every languishing soul I will replenish.\"",
      "links": "<a href='/AIV/19/107/9'>Ps 107:9</a>; <a href='/AIV/40/11/28'>Matt 11:28</a>",
      "comment": "God alone fully satisfies the soul, fulfilled spiritually by Christ’s invitation to the weary (Matt 11:28)."
    },
    {
      "pk": 30031026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 26,
      "text": "At this I awoke and looked, and my sleep was pleasant to me.",
      "links": "<a href='/AIV/19/4/8'>Ps 4:8</a>",
      "comment": "Jeremiah experiences peace, signifying the sweetness of God’s promise and rest for those who hope in Him."
    },
    {
      "pk": 30031027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 27,
      "text": "Behold, the days are coming, declares the LORD, when I will sow the house of Israel and the house of Judah with the seed of man and the seed of beast.",
      "links": "<a href='/AIV/26/36/11'>Ezek 36:11</a>",
      "comment": "A prophecy of renewal and fruitfulness, with unity for both Israel and Judah, a sign of God’s larger plan."
    },
    {
      "pk": 30031028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 28,
      "text": "And as I have watched over them to pluck up and break down, to overthrow, destroy, and bring harm, so I will watch over them to build and to plant, declares the LORD.",
      "links": "<a href='/AIV/24/1/10'>Jer 1:10</a>; <a href='/AIV/26/36/36'>Ezek 36:36</a>",
      "comment": "God’s sovereignty is seen in both discipline and restoration. The processes of judgment and rebuilding are both His."
    },
    {
      "pk": 30031029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 29,
      "text": "In those days they shall no longer say: ‘The fathers have eaten sour grapes, and the children’s teeth are set on edge.’",
      "links": "<a href='/AIV/26/18/2'>Ezek 18:2</a>",
      "comment": "The shift from collective to individual responsibility prepares for the soul’s personal accountability before God."
    },
    {
      "pk": 30031030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 30,
      "text": "But everyone shall die for his own sin. Each man who eats sour grapes, his teeth shall be set on edge.",
      "links": "<a href='/AIV/5/24/16'>Deut 24:16</a>",
      "comment": "Personal responsibility for sin is clarified—a foundational truth for individual confession and reconciliation."
    },
    {
      "pk": 30031031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 31,
      "text": "\"Behold, the days are coming,\" declares the LORD, \"when I will make a new covenant with the house of Israel and the house of Judah,\"",
      "links": "<a href='/AIV/58/8/8-12'>Heb 8:8-12</a>; <a href='/AIV/40/26/28'>Matt 26:28</a>",
      "comment": "This prophecy of the new covenant is fulfilled in Jesus Christ (see Matt 26:28). The new covenant is the foundation for the sacraments and unity of God’s people."
    },
    {
      "pk": 30031032,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 32,
      "text": "\"not like the covenant that I made with their fathers on the day when I took them by the hand to bring them out of the land of Egypt, My covenant that they broke, though I was their husband, declares the LORD.\"",
      "links": "<a href='/AIV/2/19/5-6'>Ex 19:5-6</a>; <a href='/AIV/23/54/5'>Isa 54:5</a>",
      "comment": "The image of God as husband suggests a deep, intimate relationship; the new covenant provides the grace to fulfill what was lacking in the old."
    },
    {
      "pk": 30031033,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 33,
      "text": "\"For this is the covenant that I will make with the house of Israel after those days, declares the LORD: I will put My law within them, and I will write it on their hearts. I will be their God, and they shall be My people.\"",
      "links": "<a href='/AIV/26/36/26-27'>Ezek 36:26-27</a>; <a href='/AIV/47/3/3'>2 Cor 3:3</a>",
      "comment": "Interior transformation is promised here—God’s law written on the heart (not just stone)—accomplished through the outpouring of the Holy Spirit."
    },
    {
      "pk": 30031034,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 34,
      "text": "\"And no longer shall each one teach his neighbor and each his brother, saying, ‘Know the LORD,’ for they shall all know Me, from the least of them to the greatest, declares the LORD. For I will forgive their iniquity, and I will remember their sin no more.\"",
      "links": "<a href='/AIV/58/8/11-12'>Heb 8:11-12</a>; <a href='/AIV/19/103/3'>Ps 103:3</a>",
      "comment": "Forgiveness and access to personal knowledge of God are central promises of the new covenant, realized through Christ and preserved through the teaching and sanctifying mission of the Church."
    },
    {
      "pk": 30031035,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 35,
      "text": "Thus says the LORD, who gives the sun for light by day and the fixed order of the moon and the stars for light by night, who stirs up the sea so that its waves roar—the LORD of hosts is His name:",
      "links": "<a href='/AIV/1/1/16'>Gen 1:16</a>; <a href='/AIV/19/89/9'>Ps 89:9</a>",
      "comment": "God’s faithfulness is as constant as creation itself; the stability of the created order guarantees His promises."
    },
    {
      "pk": 30031036,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 36,
      "text": "\"If this fixed order departs from before Me, declares the LORD, then shall the offspring of Israel cease from being a nation before Me forever.\"",
      "links": "<a href='/AIV/19/89/36-37'>Ps 89:36-37</a>",
      "comment": "Israel’s continuation is as certain as the heavens; God’s covenant people will never cease, and the Church inherits this permanent promise."
    },
    {
      "pk": 30031037,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 37,
      "text": "Thus says the LORD: \"If the heavens above can be measured, and the foundations of the earth below can be explored, then I will cast off all the offspring of Israel for all that they have done, declares the LORD.\"",
      "links": "<a href='/AIV/19/103/11'>Ps 103:11</a>; <a href='/AIV/33/7/18-20'>Mic 7:18-20</a>",
      "comment": "God’s mercy and faithfulness are infinite; Israel’s calling is irrevocable (see Rom 11:29)."
    },
    {
      "pk": 30031038,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 38,
      "text": "\"Behold, the days are coming, declares the LORD, when the city shall be rebuilt for the LORD from the Tower of Hananel to the Corner Gate.\"",
      "links": "<a href='/AIV/16/3/1-3'>Neh 3:1-3</a>",
      "comment": "Jerusalem will be rebuilt, symbolizing the enduring nature of God’s city—the eternal city which reflects God’s presence in the midst of His people."
    },
    {
      "pk": 30031039,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 39,
      "text": "And the measuring line shall go out farther, straight to the hill Gareb, and shall turn to Goah.",
      "links": "<a href='/AIV/38/2/1-2'>Zech 2:1-2</a>",
      "comment": "Expansion of the city indicates the abundant and expanding dwelling of God with His people."
    },
    {
      "pk": 30031040,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 31,
      "verse": 40,
      "text": "The whole valley of the dead bodies and the ashes, and all the fields as far as the Brook Kidron, to the corner of the Horse Gate toward the east, shall be holy to the LORD. It shall not be uprooted or overthrown anymore forever.",
      "links": "<a href='/AIV/38/14/20-21'>Zech 14:20-21</a>; <a href='/AIV/66/21/2-4'>Rev 21:2-4</a>",
      "comment": "Even formerly unclean places become holy, showing the future sanctification of all creation under God. The everlasting nature of this promise is tied to the unshakable presence of God with His people, ultimately fulfilled in the heavenly Jerusalem."
    }
  ],
  "translatedAt": "2025-12-24T08:38:41.382Z"
}