{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 18,
  "verses": [
    {
      "pk": 30018001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD:",
      "links": "<a href='/AIV/30/1/2'>Jer. 1:2</a>",
      "comment": "This opening signals a direct prophetic message. Jeremiah regularly receives direct instruction from God, emphasizing the importance of God’s continued guidance to His chosen leaders. Compare to other instances where prophets receive the word (see Jer. 1:2)."
    },
    {
      "pk": 30018002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 2,
      "text": "\"Arise and go down to the potter’s house, and there I will let you hear My words.\"",
      "links": "<a href='/AIV/23/29/16'>Isa. 29:16</a>; <a href='/AIV/45/9/21'>Rom. 9:21</a>",
      "comment": "God uses the ordinary scene of the potter as a teaching illustration, inviting Jeremiah to observe and learn. Similar imagery is found in Isaiah and Paul’s writings in Romans."
    },
    {
      "pk": 30018003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 3,
      "text": "So I went down to the potter’s house, and there he was working at his wheel.",
      "links": "<a href='/AIV/23/64/8'>Isa. 64:8</a>",
      "comment": "Jeremiah faithfully obeys God’s instruction. The potter’s wheel acts as the stage for God’s revelation—the metaphor of making and remaking vessels is powerful for understanding divine sovereignty."
    },
    {
      "pk": 30018004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 4,
      "text": "And when the vessel that he was making from clay was spoiled in the potter’s hand, he reworked it into another vessel as it seemed good to the potter to make.",
      "links": "<a href='/AIV/23/45/9'>Isa. 45:9</a>; <a href='/AIV/45/9/21'>Rom. 9:21</a>",
      "comment": "The potter’s ability to reshape flawed clay into something new reveals God’s creative, patient authority over humanity—He can refashion lives and nations. St. Paul later relates this image to God’s sovereign freedom (Rom. 9:21)."
    },
    {
      "pk": 30018005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 5,
      "text": "Then the word of the LORD came to me:",
      "links": "",
      "comment": "A recurring phrase marking divine instruction, reinforcing Jeremiah’s authority as a prophet and the immediacy of God's message."
    },
    {
      "pk": 30018006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 6,
      "text": "\"O house of Israel, can I not do with you as this potter does?\" declares the LORD. \"Just as clay in the potter’s hand, so are you in My hand, O house of Israel.\"",
      "links": "<a href='/AIV/23/64/8'>Isa. 64:8</a>; <a href='/AIV/45/9/21'>Rom. 9:21</a>",
      "comment": "God's sovereignty over His people is illustrated with striking clarity. The analogy emphasizes humanity's dependence on God and the possibility of personal and national renewal. The prophet’s message includes both judgment and the hope of restoration."
    },
    {
      "pk": 30018007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 7,
      "text": "\"If at any time I declare concerning a nation or a kingdom, that I will uproot, break down, and destroy it,",
      "links": "<a href='/AIV/30/1/10'>Jer. 1:10</a>",
      "comment": "God announces His right to judge and uproot nations, echoing Jeremiah’s call as prophet to 'pluck up and to break down' (Jer. 1:10). This stresses both God’s justice and flexibility."
    },
    {
      "pk": 30018008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 8,
      "text": "but if that nation turns away from its evil, I will repent of the disaster that I intended to do to it.",
      "links": "<a href='/AIV/32/3/10'>Jonah 3:10</a>; <a href='/AIV/26/18/21-22'>Ezek. 18:21-22</a>",
      "comment": "This verse reveals God’s mercy and willingness to forgive. Those who repent can avoid judgment, demonstrating the centrality of conversion and ongoing transformation in the life of the believer—see also Jonah and Ezekiel."
    },
    {
      "pk": 30018009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 9,
      "text": "\"Or if at another time I declare concerning a nation or kingdom that I will build and plant it,",
      "links": "<a href='/AIV/30/1/10'>Jer. 1:10</a>; <a href='/AIV/30/24/6'>Jer. 24:6</a>",
      "comment": "God not only pronounces judgment—He also promises restoration and future hope. Notice again imagery related to Jeremiah’s prophetic commission (Jer. 1:10), connecting tearing down with building up."
    },
    {
      "pk": 30018010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 10,
      "text": "if it does evil in My sight and does not listen to My voice, then I will reconsider the good that I intended to do for it.\"",
      "links": "<a href='/AIV/30/7/23-24'>Jer. 7:23-24</a>",
      "comment": "God’s covenant blessings are not unconditional; obedience is required. Failure to listen results in the loss of favor, reinforcing the need for ongoing fidelity and repentance."
    },
    {
      "pk": 30018011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 11,
      "text": "\"Now therefore, say to the people of Judah and the inhabitants of Jerusalem: 'This is what the LORD says: Behold, I am shaping disaster for you and devising a plan against you. Return, each of you, from your evil way, and amend your ways and your deeds.'\"",
      "links": "<a href='/AIV/30/26/13'>Jer. 26:13</a>; <a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "God calls for personal and communal repentance. The command to amend one's ways is foundational to spiritual renewal, reminiscent of New Testament calls to conversion and holiness."
    },
    {
      "pk": 30018012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 12,
      "text": "But they say, 'It is hopeless! We will follow our own plans, and each of us will act according to the stubbornness of his evil heart.'",
      "links": "<a href='/AIV/30/7/24'>Jer. 7:24</a>; <a href='/AIV/45/2/5'>Rom. 2:5</a>",
      "comment": "Israel’s tragic obstinacy highlights human resistance to grace. The heart’s stubbornness leads away from God—see how Paul later expands on this theme (Rom. 2:5)."
    },
    {
      "pk": 30018013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 13,
      "text": "Therefore this is what the LORD says: 'Ask now among the nations, who has heard the like of this? The virgin Israel has done a most horrible thing.'",
      "links": "<a href='/AIV/26/23/4'>Ezek. 23:4</a>",
      "comment": "The reference to Israel as 'virgin' denotes her intended purity and special relationship with God. The horror at her betrayal underscores the depth of the covenantal bond."
    },
    {
      "pk": 30018014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 14,
      "text": "Does the snow of Lebanon leave the rocky slopes, or do the cool waters, flowing from afar, dry up?",
      "links": "",
      "comment": "The rhetorical question stresses the abnormality of Israel’s behavior. Just as natural phenomena follow predictable patterns, Israel’s rejection of fidelity is a shocking disruption."
    },
    {
      "pk": 30018015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 15,
      "text": "But My people have forgotten Me; they burn incense to worthless idols, and they have stumbled in their ways, from the ancient paths, to walk in byways, not the highway.",
      "links": "<a href='/AIV/19/106/36'>Ps. 106:36</a>; <a href='/AIV/23/59/8'>Isa. 59:8</a>",
      "comment": "Idolatry leads to spiritual confusion and disorder. The 'ancient paths' represent the perennial tradition and the way of truth, to which believers must continually return."
    },
    {
      "pk": 30018016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 16,
      "text": "to make their land a horror, a perpetual scorn. Everyone who passes by it will be appalled and shake his head.",
      "links": "<a href='/AIV/19/44/14'>Ps. 44:14</a>",
      "comment": "Judgment upon the land becomes a spectacle to the nations, serving as both warning and call to repentance."
    },
    {
      "pk": 30018017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 17,
      "text": "Like the east wind I will scatter them before the enemy; I will show them my back, not my face, in the day of their calamity.",
      "links": "<a href='/AIV/19/80/16'>Ps. 80:16</a>",
      "comment": "God’s presence is withdrawn as a sign of judgment—the orientation of God’s face or back represents acceptance or rejection, a motif echoed throughout Scripture."
    },
    {
      "pk": 30018018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 18,
      "text": "Then they said, 'Come, let us plot against Jeremiah, for the law shall not perish from the priest, nor counsel from the wise, nor the word from the prophet. Come, let us strike him with the tongue, and let us not pay attention to any of his words.'",
      "links": "<a href='/AIV/30/11/19'>Jer. 11:19</a>; <a href='/AIV/42/11/47-51'>Luke 11:47-51</a>",
      "comment": "Jeremiah faces opposition as the messenger of truth, a pattern fulfilled in later prophets and ultimately Christ (see how Jesus connects Himself to persecuted prophets, Luke 11:51)."
    },
    {
      "pk": 30018019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 19,
      "text": "Hear me, O LORD, and listen to the voice of my adversaries!",
      "links": "<a href='/AIV/19/86/6'>Ps. 86:6</a>",
      "comment": "Jeremiah launches into intercessory prayer, calling on God to attend to his plight—a model of honest spirituality."
    },
    {
      "pk": 30018020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 20,
      "text": "Should good be repaid with evil? Yet they have dug a pit for me. Remember how I stood before You to speak good for them, to turn away Your wrath from them.",
      "links": "<a href='/AIV/19/35/7-13'>Ps. 35:7-13</a>",
      "comment": "Jeremiah’s self-offering recalls mediators throughout Scripture, including Moses and Christ, who intercede for the people despite rejection (see Psalm 35 and also Christ’s forgiving posture in Luke 23:34)."
    },
    {
      "pk": 30018021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 21,
      "text": "Therefore deliver their children to famine; let them be handed over to the power of the sword. Let their wives become childless and widowed, and let their men be put to death; their young men struck down by the sword in battle.",
      "links": "<a href='/AIV/19/109/9'>Ps. 109:9</a>",
      "comment": "A rare but intense imprecatory prayer, Jeremiah’s lament reflects the seriousness of the breach between Israel and God. Prayers of this type highlight the gravity of covenant violation."
    },
    {
      "pk": 30018022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 22,
      "text": "Let a cry be heard from their houses, when You suddenly bring raiders upon them, for they have dug a pit to capture me and laid snares for my feet.",
      "links": "<a href='/AIV/19/57/6'>Ps. 57:6</a>; <a href='/AIV/19/64/5-6'>Ps. 64:5-6</a>",
      "comment": "Jeremiah’s prayer for vindication is deeply personal, mirroring the imprecatory psalms—a literary and spiritual tradition in the Old Testament."
    },
    {
      "pk": 30018023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 18,
      "verse": 23,
      "text": "But You, O LORD, know all their plans to kill me. Do not forgive their iniquity, nor blot out their sin from Your sight. Let them be overthrown before You; deal with them in the time of Your anger.",
      "links": "<a href='/AIV/19/69/27-28'>Ps. 69:27-28</a>",
      "comment": "Jeremiah’s closing prayer appeals for justice, reflecting the tension between intercession and judgment. This prepares readers to reflect on how both mercy and justice are ultimately fulfilled by Christ (see also Psalm 69)."
    }
  ],
  "translatedAt": "2025-12-24T08:31:30.833Z"
}