{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 4,
  "verses": [
    {
      "pk": 30004001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 1,
      "text": "\"If you return, Israel,\" declares the LORD, \"return to Me. If you remove your detestable idols from My presence and do not stray,",
      "links": "<a href='/AIV/28/14/1'>Hos. 14:1</a>; <a href='/AIV/05/30/2'>Deut. 30:2</a>",
      "comment": "God urges a true, wholehearted return, not just external reform. 'Return to Me' expresses a personal, covenant relationship."
    },
    {
      "pk": 30004002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 2,
      "text": "and if you swear, ‘As the LORD lives,’ in truth, justice, and righteousness, then nations will bless themselves in Him, and in Him they will glory.\"",
      "links": "<a href='/AIV/01/22/18'>Gen. 22:18</a>; <a href='/AIV/24/12/16'>Jer. 12:16</a>",
      "comment": "Swearing by the LORD rightly involves living as a witness. The blessing of the nations recalls the promise to Abraham, pointing towards the future gathering of peoples through God's covenant."
    },
    {
      "pk": 30004003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 3,
      "text": "For thus says the LORD to the men of Judah and Jerusalem: \"Break up your fallow ground, and do not sow among thorns.",
      "links": "<a href='/AIV/28/10/12'>Hos. 10:12</a>; <a href='/AIV/40/13/22'>Matt. 13:22</a>",
      "comment": "Breaking up the hard ground symbolizes repentance and readiness for God's word. Jesus later uses similar language about the heart's readiness for the Gospel."
    },
    {
      "pk": 30004004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 4,
      "text": "Circumcise yourselves to the LORD; remove the foreskin of your hearts, men of Judah and inhabitants of Jerusalem, lest My wrath break out like fire and burn, with no one to quench it, because of your evil deeds.",
      "links": "<a href='/AIV/05/10/16'>Deut. 10:16</a>; <a href='/AIV/45/2/29'>Rom. 2:29</a>",
      "comment": "This calls for an inward change, not merely outward ritual, a foreshadowing of spiritual renewal, which Paul later explains as 'circumcision of the heart.'"
    },
    {
      "pk": 30004005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 5,
      "text": "Declare in Judah and proclaim in Jerusalem, and say: 'Blow the trumpet through the land.' Cry aloud and say: 'Assemble yourselves, and let us go into the fortified cities!'",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>; <a href='/AIV/28/5/8'>Hos. 5:8</a>",
      "comment": "The trumpet is a warning of coming judgment. Gathering into fortified cities pictures urgent preparation for what is coming."
    },
    {
      "pk": 30004006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 6,
      "text": "Raise a standard toward Zion! Flee for safety; do not stand still! For I bring disaster from the north, great destruction.",
      "links": "<a href='/AIV/24/1/14'>Jer. 1:14</a>; <a href='/AIV/24/6/1-22'>Jer. 6:1-22</a>",
      "comment": "The invader from the north is Babylon. Zion remains a place of refuge in Old Testament symbolism, an early type for salvation found in God's dwelling."
    },
    {
      "pk": 30004007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 7,
      "text": "A lion has come up from his thicket, a destroyer of nations has set out; he has left his place to lay waste your land. Your cities will be ruins, without inhabitants.",
      "links": "<a href='/AIV/24/2/15'>Jer. 2:15</a>; <a href='/AIV/25/3/10'>Lam. 3:10</a>",
      "comment": "The lion is the Babylonian king, used by God as an instrument of judgment. Throughout Scripture, God uses earthly powers providentially."
    },
    {
      "pk": 30004008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 8,
      "text": "So put on sackcloth, lament and wail, for the fierce anger of the LORD has not turned away from us.",
      "links": "<a href='/AIV/29/1/13'>Joel 1:13</a>; <a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "Sackcloth and lamentation are classic signs of repentance. Recognition of God’s just anger leads to humility and the hope of mercy."
    },
    {
      "pk": 30004009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 9,
      "text": "On that day, declares the LORD, the heart of the king and the officials will fail, the priests will be appalled, and the prophets will be astounded.",
      "links": "<a href='/AIV/24/49/22'>Jer. 49:22</a>; <a href='/AIV/24/8/1-2'>Jer. 8:1-2</a>",
      "comment": "All leadership—civil, religious, prophetic—are shown as powerless before God’s judgment. This prefigures the need for a new kind of priest and king (see Heb. 7:26-28)."
    },
    {
      "pk": 30004010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 10,
      "text": "Then I said: \"Alas, Lord GOD! Surely You have utterly deceived this people and Jerusalem, saying, ‘You will have peace,’ while the sword is at our throats.\"",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>; <a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "Jeremiah honestly voices his confusion. False prophets promised peace without repentance, while true safety is only found in submitting to God’s will."
    },
    {
      "pk": 30004011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 11,
      "text": "At that time it will be said to this people and to Jerusalem, \"A hot wind from the bare heights in the wilderness blows against My people, not for winnowing or cleansing;\"",
      "links": "<a href='/AIV/24/13/24'>Jer. 13:24</a>; <a href='/AIV/19/1/4'>Ps. 1:4</a>",
      "comment": "The wind is not for cleansing but for destruction—a judgment, not a mercy. This shift is crucial for understanding restoration must follow judgment."
    },
    {
      "pk": 30004012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 12,
      "text": "\"a full wind from these places will come for Me. Now I also will pronounce judgments against them.\"",
      "links": "<a href='/AIV/24/1/16'>Jer. 1:16</a>",
      "comment": "It is God’s own judgment ultimately, not merely political or natural forces. His sovereignty remains over all events."
    },
    {
      "pk": 30004013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 13,
      "text": "Look! He comes up like clouds, his chariots like a whirlwind; his horses are swifter than eagles. Woe to us, for we are ruined!",
      "links": "<a href='/AIV/24/23/19'>Jer. 23:19</a>; <a href='/AIV/34/2/4'>Nah. 2:4</a>",
      "comment": "The overwhelming speed and force of the coming enemy is likened to a storm. Such imagery is echoed in Christ’s warning of coming judgment (Matt. 24:27)."
    },
    {
      "pk": 30004014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 14,
      "text": "O Jerusalem, wash your heart from evil, that you may be saved. How long shall your wicked thoughts remain within you?",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>; <a href='/AIV/23/1/16'>Isa. 1:16</a>",
      "comment": "Salvation is connected to inward purification, pointing ahead to the full cleansing provided by the Messiah’s sacrifice and the ongoing call to interior holiness."
    },
    {
      "pk": 30004015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 15,
      "text": "For a voice declares from Dan and proclaims evil from Mount Ephraim:",
      "links": "<a href='/AIV/07/18/29'>Judg. 18:29</a>; <a href='/AIV/24/8/16'>Jer. 8:16</a>",
      "comment": "Dan and Ephraim are northern extremities, indicating the enemy’s advance from the north. The warning is public and unavoidable."
    },
    {
      "pk": 30004016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 16,
      "text": "\"Warn the nations: Behold, proclaim against Jerusalem! Besiegers are coming from a distant land; they raise their voices against the cities of Judah.",
      "links": "<a href='/AIV/24/5/15'>Jer. 5:15</a>; <a href='/AIV/23/39/3'>Isa. 39:3</a>",
      "comment": "Even the nations are called as witnesses to Jerusalem's coming judgment. The universality of this warning foreshadows the expansion of God’s message to all peoples."
    },
    {
      "pk": 30004017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 17,
      "text": "They surround her like keepers of a field, because she has rebelled against Me,\" declares the LORD.",
      "links": "<a href='/AIV/24/6/3'>Jer. 6:3</a>",
      "comment": "The enemy’s siege is pictured as watchmen, showing Jerusalem's complete encirclement due to rebellion—sin cuts off God’s protection."
    },
    {
      "pk": 30004018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 18,
      "text": "Your ways and your deeds have brought this upon you. This is your evil; it is bitter, it reaches to your heart.\"",
      "links": "<a href='/AIV/24/2/19'>Jer. 2:19</a>; <a href='/AIV/48/6/7'>Gal. 6:7</a>",
      "comment": "The bitter consequences are self-inflicted. Sin affects the heart, showing both the depth of human fallenness and the necessity of real grace and healing."
    },
    {
      "pk": 30004019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 19,
      "text": "My anguish, my anguish! I writhe in pain. O the walls of my heart! My heart is in turmoil within me, I cannot keep silent, for I hear the sound of the trumpet, the alarm of war.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>; <a href='/AIV/19/77/4'>Ps. 77:4</a>",
      "comment": "Jeremiah's agony mirrors God's own heartbreak over the sin and coming suffering of His people. The prophet's identification with the people is an early type of the heart of Christ for His Church."
    },
    {
      "pk": 30004020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 20,
      "text": "Disaster follows disaster; the whole land is ruined. Suddenly my tents are destroyed, my curtains in an instant.",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>; <a href='/AIV/19/78/60'>Ps. 78:60</a>",
      "comment": "The repetition and imagery of tents recall the temporary nature of life. God’s judgment sweeps away all false security—a call to build on the foundation that endures (cf. Matt. 7:24-27)."
    },
    {
      "pk": 30004021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 21,
      "text": "How long must I see the standard and hear the sound of the trumpet?",
      "links": "<a href='/AIV/24/6/17'>Jer. 6:17</a>",
      "comment": "The repeated warning signals represent both God’s patience and the responsibility to respond before judgment is fulfilled."
    },
    {
      "pk": 30004022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 22,
      "text": "\"For My people are foolish; they do not know Me. They are senseless children, and they have no understanding. They are skilled in doing evil, but do not know how to do good.\"",
      "links": "<a href='/AIV/23/1/3'>Isa. 1:3</a>; <a href='/AIV/45/1/22'>Rom. 1:22</a>",
      "comment": "Lack of knowledge of God here reflects not mere ignorance, but rejection of relationship. The fruit of the Spirit and knowledge of God come by grace and formation, not self-effort."
    },
    {
      "pk": 30004023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 23,
      "text": "I looked at the earth, and behold, it was formless and empty; and at the heavens, and they had no light.",
      "links": "<a href='/AIV/01/1/2'>Gen. 1:2</a>; <a href='/AIV/23/34/11'>Isa. 34:11</a>",
      "comment": "Jeremiah’s vision alludes to creation before order and blessing, showing judgment as a kind of undoing of creation—but always with hope for restoration."
    },
    {
      "pk": 30004024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 24,
      "text": "I looked at the mountains, and behold, they were quaking, and all the hills moved to and fro.",
      "links": "<a href='/AIV/19/18/7'>Ps. 18:7</a>",
      "comment": "Cosmic upheaval marks God’s presence or judgment in the Old Testament, anticipating apocalyptic imagery in the New (see Rev. 6:14)."
    },
    {
      "pk": 30004025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 25,
      "text": "I looked, and behold, there was no man, and all the birds of the sky had fled.",
      "links": "<a href='/AIV/01/7/23'>Gen. 7:23</a>; <a href='/AIV/36/1/3'>Zeph. 1:3</a>",
      "comment": "The depopulation recalls the flood judgment and points to the reversal of the creation blessings—a picture meant to prepare for a new ordering under God."
    },
    {
      "pk": 30004026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 26,
      "text": "I looked, and behold, the fruitful land was a desert, and all its cities lay in ruins before the LORD, before His burning anger.",
      "links": "<a href='/AIV/05/29/23'>Deut. 29:23</a>",
      "comment": "Fruitfulness lost is the cost of forsaking God. Yet, all restoration will ultimately come from Him when repentance is real."
    },
    {
      "pk": 30004027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 27,
      "text": "For thus says the LORD: \"The whole land shall be a desolation, yet I will not make a full end.\"",
      "links": "<a href='/AIV/24/5/18'>Jer. 5:18</a>; <a href='/AIV/03/26/44'>Lev. 26:44</a>",
      "comment": "Despite judgment, God preserves a remnant. The promise of 'not a full end' is important for understanding God’s faithfulness to His covenant people."
    },
    {
      "pk": 30004028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 28,
      "text": "Because of this, the earth shall mourn and the heavens above grow dark, for I have spoken, I have purposed; I will not change My mind, nor will I turn back from it.",
      "links": "<a href='/AIV/23/50/3'>Isa. 50:3</a>; <a href='/AIV/04/23/19'>Num. 23:19</a>",
      "comment": "Creation reacts to the Creator’s judgment, highlighting the seriousness of sin and the unchangeable nature of God’s decree while leaving room for mercy."
    },
    {
      "pk": 30004029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 29,
      "text": "At the sound of the horseman and archer every city flees; they go into the thickets and climb among the rocks. Every city is forsaken, and not a man dwells in them.",
      "links": "<a href='/AIV/07/6/2'>Judg. 6:2</a>; <a href='/AIV/24/4/25'>Jer. 4:25</a>",
      "comment": "The people's desperate flight into hiding emphasizes the totality of the disaster—compare this with Christ's warning of flight at the time of Jerusalem’s destruction (Luke 21:21)."
    },
    {
      "pk": 30004030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 30,
      "text": "And you, desolate one, what will you do? Though you dress in scarlet, adorn yourself with gold jewelry, and paint your eyes with makeup, in vain you beautify yourself. Your lovers despise you; they seek your life.",
      "links": "<a href='/AIV/26/23/40'>Ezek. 23:40</a>; <a href='/AIV/28/2/13'>Hos. 2:13</a>",
      "comment": "Jerusalem’s vain attempts at self-beautification symbolize unfaithful reliance on other peoples or idols. True restoration comes not by outward beauty but in returning fully to God."
    },
    {
      "pk": 30004031,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 4,
      "verse": 31,
      "text": "For I hear a cry as of a woman in labor, anguish as of one giving birth to her first child, the cry of the Daughter of Zion gasping for breath, stretching out her hands: \"Woe is me, for my soul faints before the murderers!\"",
      "links": "<a href='/AIV/24/6/24'>Jer. 6:24</a>; <a href='/AIV/66/12/2'>Rev. 12:2</a>",
      "comment": "The labor pains image often signals the onset of redemption through suffering. It foreshadows, both literally and spiritually, the birth of a renewed people through affliction (see Rom. 8:22; John 16:21)."
    }
  ],
  "translatedAt": "2025-12-24T08:23:35.260Z"
}