{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 34,
  "verses": [
    {
      "pk": 30034001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 1,
      "text": "The word that came to Jeremiah from the LORD, when King Nebuchadnezzar of Babylon and all his army, as well as all the kingdoms under his authority, and every people he ruled, were fighting against Jerusalem and all its surrounding towns:",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>; <a href='/AIV/12/25/1'>2 Kings 25:1</a>",
      "comment": "This sets the context for the prophecy—a time of siege under a foreign king, reminiscent of other warnings about judgment for covenant unfaithfulness. The mention of Nebuchadnezzar emphasizes divine sovereignty over nations."
    },
    {
      "pk": 30034002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 2,
      "text": "The LORD says: Go and speak to King Zedekiah of Judah and tell him: ‘This is what the LORD says: I am about to hand this city over to the king of Babylon, and he will burn it with fire.’",
      "links": "<a href='/AIV/24/21/10'>Jer. 21:10</a>; <a href='/AIV/12/25/9'>2 Kings 25:9</a>",
      "comment": "The directness underscores the prophetic authority. Deliverance is not promised; instead, the judgment is pronounced—a motif echoing Jesus’ warnings about Jerusalem (see Luke 19:41–44)."
    },
    {
      "pk": 30034003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 3,
      "text": "You will not escape from his grasp; you will certainly be captured and handed over to him. You will see the king of Babylon with your own eyes, and he will speak to you face to face. You will go to Babylon.",
      "links": "<a href='/AIV/24/32/4'>Jer. 32:4</a>; <a href='/AIV/12/25/7'>2 Kings 25:7</a>",
      "comment": "Zedekiah’s direct encounter with Nebuchadnezzar fulfills earlier prophecy. Historically, this occurred as recorded in 2 Kings. The theme of unavoidable consequence for rebellion is prominent."
    },
    {
      "pk": 30034004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 4,
      "text": "Yet hear the LORD’s word, O Zedekiah king of Judah: This is what the LORD says about you: ‘You will not die by the sword.",
      "links": "<a href='/AIV/24/38/17'>Jer. 38:17</a>",
      "comment": "Mercy is shown even in judgment—Zedekiah’s death will not be violent. This pattern reflects God’s continual call to repentance and His patience with leaders, a theme prominent in salvation history."
    },
    {
      "pk": 30034005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 5,
      "text": "You will die peacefully. As people made fires in your honor for your fathers, the former kings of Judah, so will they mourn for you, saying, ‘Alas, lord!’ This I have spoken, declares the LORD.",
      "links": "<a href='/AIV/24/16/7'>Jer. 16:7</a>; <a href='/AIV/24/22/18'>Jer. 22:18</a>",
      "comment": "Even in exile, royal mourning customs persist. This shows God’s faithfulness to promises given to David’s line (2 Sam. 7:16), despite the people’s unfaithfulness."
    },
    {
      "pk": 30034006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 6,
      "text": "Then Jeremiah the prophet spoke all these words to Zedekiah king of Judah in Jerusalem",
      "links": "<a href='/AIV/24/21/3-7'>Jer. 21:3-7</a>",
      "comment": "Jeremiah’s obedience here models the prophetic office. He is a type of Christ—faithful unto suffering for delivering God’s message (see John 12:49–50)."
    },
    {
      "pk": 30034007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 7,
      "text": "while the army of the king of Babylon was fighting against Jerusalem and against the remaining cities of Judah, Lachish and Azekah. These were the only fortified cities left in Judah.",
      "links": "<a href='/AIV/24/1/13'>Jer. 1:13</a>; <a href='/AIV/14/11/9'>2 Chr. 11:9</a>",
      "comment": "The focus narrows to the last holdouts. This persistent resistance recalls human tendencies to rely on fortifications rather than the LORD, contrasting with Christ’s teaching to depend on God alone."
    },
    {
      "pk": 30034008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 8,
      "text": "The word came to Jeremiah from the LORD after King Zedekiah made a covenant with all the people in Jerusalem to proclaim liberty to them:",
      "links": "<a href='/AIV/24/34/15'>Jer. 34:15</a>; <a href='/AIV/2/21/2'>Ex. 21:2</a>",
      "comment": "Covenant language draws attention to Israel’s foundational relationship with God (cf. Ex. 24:7–8). Proclaiming liberty echoes the Year of Jubilee—a practice filled with redemptive overtones and later fulfilled in Christ (Luke 4:18–19)."
    },
    {
      "pk": 30034009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 9,
      "text": "that everyone should set free his Hebrew slaves, male and female, so that no one should enslave a fellow Jew.",
      "links": "<a href='/AIV/3/25/10'>Lev. 25:10</a>; <a href='/AIV/5/15/12'>Deut. 15:12</a>",
      "comment": "Manumission was commanded by the Law. Faithful observance of this law symbolizes spiritual release and anticipates how Christ sets us free from slavery to sin (Rom. 6:18)."
    },
    {
      "pk": 30034010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 10,
      "text": "All the officials and people who had entered into the covenant agreed to set free their male and female slaves, so that they would no longer be enslaved. They obeyed and set them free.",
      "links": "<a href='/AIV/2/21/2'>Ex. 21:2</a>",
      "comment": "Obedience here points to the blessing that comes with faithfulness. The freedom granted anticipates the deeper liberation Christ brings to His people (Gal. 5:1)."
    },
    {
      "pk": 30034011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 11,
      "text": "But afterward they changed their minds and took back their male and female slaves whom they had set free and made them slaves again.",
      "links": "<a href='/AIV/24/34/16'>Jer. 34:16</a>",
      "comment": "The breaking of covenant mirrors Israel’s history of repeated backsliding, a dynamic that recurs in salvation history and which Christ came to heal through a New Covenant (see Heb. 8:8–12)."
    },
    {
      "pk": 30034012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 12,
      "text": "Then the word of the LORD came to Jeremiah:",
      "links": "<a href='/AIV/24/1/4'>Jer. 1:4</a>",
      "comment": "God’s response to covenant breach is never silence; He reveals His will, preparing the way for the fullness of revelation in Christ (John 1:14)."
    },
    {
      "pk": 30034013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 13,
      "text": "Thus says the LORD, the God of Israel: I made a covenant with your ancestors when I brought them out of Egypt, out of the house of slavery, saying:",
      "links": "<a href='/AIV/2/20/2'>Ex. 20:2</a>; <a href='/AIV/3/25/38'>Lev. 25:38</a>",
      "comment": "God grounds His commands in redemption history. The Exodus foreshadows Christ’s work, the true deliverance from slavery, and the new covenant sealed once and for all (Luke 22:20)."
    },
    {
      "pk": 30034014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 14,
      "text": "Every seventh year each of you must free his fellow Hebrew who has been sold to you and has served you six years; you must let him go free from you. But your fathers did not listen or pay attention to Me.",
      "links": "<a href='/AIV/5/15/12'>Deut. 15:12</a>; <a href='/AIV/2/21/2'>Ex. 21:2</a>",
      "comment": "The Sabbath-year release points to God’s design for justice and mercy in the community. Their disobedience sets the stage for the need for a Shepherd King who fulfills the Law perfectly (Matt. 5:17)."
    },
    {
      "pk": 30034015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 15,
      "text": "Recently you repented and did what was right in My eyes by proclaiming liberty, each to his neighbor. You made a covenant before Me in the house that bears My name.",
      "links": "<a href='/AIV/24/7/10'>Jer. 7:10</a>",
      "comment": "Covenant renewal in the temple demonstrates the importance of sacred ritual as a means of grace—a theme that finds deeper fulfillment in Christ instituting new rites for His followers (1 Cor. 11:23–26)."
    },
    {
      "pk": 30034016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 16,
      "text": "But then you turned back and profaned My name by taking back your male and female slaves whom you had set free and forcing them to become your slaves again.",
      "links": "<a href='/AIV/3/19/12'>Lev. 19:12</a>; <a href='/AIV/24/34/11'>Jer. 34:11</a>",
      "comment": "To ‘profane’ God’s name is not merely a legal issue but a spiritual offense, showing the depth of sin. The importance of living out vows remains central in Christian moral teaching."
    },
    {
      "pk": 30034017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 17,
      "text": "Therefore, thus says the LORD: You have not obeyed Me by proclaiming liberty, each to his brother and neighbor. So now I proclaim ‘liberty’ to you, declares the LORD—to the sword, to pestilence, and to famine—and I will make you a horror to all the kingdoms of the earth.",
      "links": "<a href='/AIV/24/15/4'>Jer. 15:4</a>; <a href='/AIV/5/28/25'>Deut. 28:25'>",
      "comment": "Their ‘liberty’ becomes a judgment, showing the consequences of covenant infidelity—an image echoed in New Testament warnings of judgment (Rom. 1:24)."
    },
    {
      "pk": 30034018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 18,
      "text": "The men who transgressed My covenant and did not keep the terms of the covenant they made before Me, I will make like the calf which they cut in two and passed between its parts—",
      "links": "<a href='/AIV/1/15/10'>Gen. 15:10</a>",
      "comment": "Cutting the calf alludes to ancient covenant-making and its solemn curse. Jesus refers to the cup of the new covenant (Luke 22:20), fulfilling and surpassing these old rituals."
    },
    {
      "pk": 30034019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 19,
      "text": "the officials of Judah and Jerusalem, the palace officers, the priests, and all the people of the land who passed between the parts of the calf—",
      "links": "<a href='/AIV/24/2/8'>Jer. 2:8</a>",
      "comment": "Priests and leaders are included; spiritual and temporal leaders are equally accountable. This foreshadows the need for a true High Priest who mediates a perfect covenant (Heb. 7:26–28)."
    },
    {
      "pk": 30034020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 20,
      "text": "I will hand them over to their enemies who seek their lives. Their dead bodies will be given as food to the birds of the sky and the beasts of the earth.",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/19/79/2'>Ps. 79:2</a>",
      "comment": "This judgment fulfillment echoes Deut. 28’s covenant curses, reinforcing the seriousness of faithlessness. In Christ, judgment and mercy are perfectly united."
    },
    {
      "pk": 30034021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 21,
      "text": "I will also hand over Zedekiah king of Judah and his officials to their enemies and to the army of the king of Babylon which has withdrawn from you.",
      "links": "<a href='/AIV/24/32/4-5'>Jer. 32:4–5</a>",
      "comment": "Even apparent reprieves or delays in judgment are temporary. True deliverance is not from earthly alliances but from trusting in God’s covenant promise."
    },
    {
      "pk": 30034022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 34,
      "verse": 22,
      "text": "I will command and bring them back to this city. They will fight against it, take it, and burn it with fire. And I will make the towns of Judah a desolation without inhabitant.",
      "links": "<a href='/AIV/24/52/13'>Jer. 52:13</a>; <a href='/AIV/12/25/9'>2 Kings 25:9</a>",
      "comment": "This is the final judgment for covenant infidelity, yet always with the prospect of future restoration. The desolation prepares for renewal, just as the cross prepares for the resurrection—a pattern present throughout all of Scripture."
    }
  ],
  "translatedAt": "2025-12-24T08:40:43.495Z"
}