{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 6,
  "verses": [
    {
      "pk": 30006001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 1,
      "text": "Flee for safety, you people of Benjamin, out of Jerusalem! Blow the trumpet in Tekoa, and raise a signal over Beth-Hakkerem; for disaster threatens from the north, even great destruction.",
      "links": "<a href='/AIV/24/4/5-6'>Jer. 4:5-6</a>; <a href='/AIV/24/1/14-15'>Jer. 1:14-15</a>",
      "comment": "Jeremiah warns Benjamin, the tribe surrounding Jerusalem, about impending invasion from the north—traditionally the direction of enemy attacks, symbolizing judgment. The call to blow the trumpet and raise a signal emphasizes urgent warning, drawing parallels to prophetic warnings in <a href='/AIV/26/33/3-6'>Ezek. 33:3-6</a> where watchmen must warn the people."
    },
    {
      "pk": 30006002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 2,
      "text": "I will destroy the lovely and delicate daughter of Zion.",
      "links": "<a href='/AIV/23/1/8'>Isa. 1:8</a>; <a href='/AIV/24/4/31'>Jer. 4:31</a>",
      "comment": "Zion is personified as a beautiful maiden, expressing God's deep sorrow in allowing her destruction due to the people's unfaithfulness. This use of feminine imagery connects to images in <a href='/AIV/25/1/6'>Lam. 1:6</a>, highlighting relational themes of covenant."
    },
    {
      "pk": 30006003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 3,
      "text": "Shepherds with their flocks will come against her. They pitch their tents all around her, each feeding in their place.",
      "links": "<a href='/AIV/24/1/15'>Jer. 1:15</a>; <a href='/AIV/24/4/17'>Jer. 4:17</a>",
      "comment": "The invaders are described metaphorically as shepherds, surrounding Jerusalem and consuming its resources. This foreshadows future besiegement and aligns with imagery of judgment and gathering for punishment as in <a href='/AIV/23/22/24'>Isa. 22:24</a>."
    },
    {
      "pk": 30006004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 4,
      "text": "Prepare war against her. Rise up, let us attack at noon! Woe to us, for the day is fading; the evening shadows are growing long.",
      "links": "<a href='/AIV/24/5/6'>Jer. 5:6</a>; <a href='/AIV/19/102/11'>Ps. 102:11</a>",
      "comment": "The invaders are eager and urgent, but realize time is passing. Darkness in biblical literature often reflects impending judgment, as seen in <a href='/AIV/24/13/16'>Jer. 13:16</a>."
    },
    {
      "pk": 30006005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 5,
      "text": "'Rise up, let us attack by night and destroy her palaces!'",
      "links": "<a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "Night attacks add to the element of fear and sudden destruction, showing the totality of the impending disaster, echoing motifs seen in <a href='/AIV/24/4/7'>Jer. 4:7</a>."
    },
    {
      "pk": 30006006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 6,
      "text": "For the LORD of hosts says: 'Cut down her trees! Build siege ramps against Jerusalem. This city must be punished; it is filled with oppression.'",
      "links": "<a href='/AIV/23/10/34'>Isa. 10:34</a>; <a href='/AIV/24/15/8'>Jer. 15:8</a>",
      "comment": "God here commands the attackers, affirming His sovereignty even in judgment. The image of siege ramps and cutting trees is classic warfare imagery (see <a href='/AIV/05/20/19-20'>Deut. 20:19-20</a>). The phrase 'LORD of hosts' stresses the Lord as ruler of angelic and earthly armies."
    },
    {
      "pk": 30006007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 7,
      "text": "As a well keeps its water fresh, so she keeps her wickedness fresh; violence and destruction are heard within her, sickness and wounds are always before Me.",
      "links": "<a href='/AIV/23/57/20'>Isa. 57:20</a>; <a href='/AIV/24/8/18'>Jer. 8:18</a>",
      "comment": "Jerusalem’s wickedness is unending, naturally generated like water from a well. This illustrates how deeply depravity had permeated, making repentance necessary, similar to the call in <a href='/AIV/24/2/13'>Jer. 2:13</a>."
    },
    {
      "pk": 30006008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 8,
      "text": "Hear this warning, Jerusalem, or I will turn away from you and make your land desolate, without anyone to live in it.",
      "links": "<a href='/AIV/24/2/19'>Jer. 2:19</a>; <a href='/AIV/23/64/10'>Isa. 64:10</a>",
      "comment": "God repeatedly gives opportunity to repent, but warns of absolute desolation. The warning to 'hear' recalls Israel’s vocation to be attentive to God’s voice (see <a href='/AIV/05/6/4'>Deut. 6:4</a>)."
    },
    {
      "pk": 30006009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 9,
      "text": "This is what the LORD of hosts says: 'Glean, as the last grapes on the vine, the remnant of Israel. Pass your hand over the branches again, like a gatherer.'",
      "links": "<a href='/AIV/24/5/10'>Jer. 5:10</a>; <a href='/AIV/23/17/6'>Isa. 17:6</a>",
      "comment": "The imagery of gleaning illustrates judgment, but also hints at a remnant preserved, tying to God's promise that not all would be destroyed (see <a href='/AIV/23/10/21'>Isa. 10:21</a>)."
    },
    {
      "pk": 30006010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 10,
      "text": "To whom can I speak and give warning, who will listen to Me? Their ears are closed, they cannot pay attention. The word of the LORD is offensive to them; they find no pleasure in it.",
      "links": "<a href='/AIV/24/5/21'>Jer. 5:21</a>; <a href='/AIV/24/7/27'>Jer. 7:27</a>",
      "comment": "This verse shows spiritual deafness and hardness of heart, related to Isaiah’s call in <a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>. The rejection of God's word echoes later attitudes toward Christ and the Apostles (<a href='/AIV/40/13/14-15'>Matt. 13:14-15</a>)."
    },
    {
      "pk": 30006011,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 11,
      "text": "I am full of the wrath of the LORD; I cannot hold it in. Pour it out on the children in the street and on the gatherings of young men too; both husband and wife will be taken, the elderly and the very old.",
      "links": "<a href='/AIV/24/4/8'>Jer. 4:8</a>; <a href='/AIV/24/9/21'>Jer. 9:21</a>",
      "comment": "God’s judgment will be universal, sparing no one. The Old Testament often sees judgment as both a temporal consequence and an invitation to repentance and reformation, typologically fulfilled in Christ’s sacrificial suffering for all people (<a href='/AIV/23/53/6'>Isa. 53:6</a>)."
    },
    {
      "pk": 30006012,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 12,
      "text": "Their houses will be turned over to others, together with their fields and their wives, when I stretch out My hand against the people of the land, declares the LORD.",
      "links": "<a href='/AIV/24/8/10'>Jer. 8:10</a>; <a href='/AIV/24/20/5'>Jer. 20:5</a>",
      "comment": "Loss of possessions and families symbolizes complete dispossession, underscoring the seriousness of turning away from God. It foreshadows exile, a theme connected to restoration and return (<a href='/AIV/24/29/14'>Jer. 29:14</a>)."
    },
    {
      "pk": 30006013,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 13,
      "text": "'From the least to the greatest, all are greedy for gain; prophets and priests alike practice deceit.",
      "links": "<a href='/AIV/24/8/10'>Jer. 8:10</a>; <a href='/AIV/26/22/27-28'>Ezek. 22:27-28</a>",
      "comment": "Corruption runs through all ranks, including spiritual leaders. The prophetic critique of priests and prophets forms a foreshadowing of Christ’s opposition to false spiritual authority (<a href='/AIV/40/23/27'>Matt. 23:27</a>)."
    },
    {
      "pk": 30006014,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 14,
      "text": "They dress the wound of My people as though it were not serious, saying, 'Peace, peace,' when there is no peace.",
      "links": "<a href='/AIV/24/8/11'>Jer. 8:11</a>; <a href='/AIV/26/13/10'>Ezek. 13:10'>",
      "comment": "False prophets offer shallow comfort, ignoring deeper spiritual wounds. This presages Jesus’ call to authentic healing and reconciliation (<a href='/AIV/40/9/12'>Matt. 9:12</a>)."
    },
    {
      "pk": 30006015,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 15,
      "text": "Were they ashamed of their detestable deeds? No, they were not at all ashamed; they do not even know how to blush. So they will fall among the fallen; when I punish them, they will collapse,\" says the LORD.",
      "links": "<a href='/AIV/24/3/3'>Jer. 3:3</a>; <a href='/AIV/19/36/12'>Ps. 36:12</a>",
      "comment": "The lack of shame reveals hardened hearts. This prepares for the New Testament teaching on repentance and contrition (<a href='/AIV/42/18/13'>Luke 18:13</a>)."
    },
    {
      "pk": 30006016,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 16,
      "text": "This is what the LORD says: 'Stand at the crossroads and look; ask for the ancient paths, where the good way is, and walk in it, and you will find rest for your souls. But you said, \"We will not walk in it.\"'",
      "links": "<a href='/AIV/19/23/3'>Ps. 23:3</a>; <a href='/AIV/40/11/29'>Matt. 11:29</a>",
      "comment": "God invites the people to rediscover authentic tradition, obedience, and true rest. Christ alludes to this in <a href='/AIV/40/11/29'>Matt. 11:29</a>, promising rest. Note the word 'ancient paths'—a theme that values the security and authority of divinely-instituted tradition and the importance of historical faith continuity."
    },
    {
      "pk": 30006017,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 17,
      "text": "I appointed watchmen over you and said, 'Listen to the sound of the trumpet.' But you said, 'We will not listen.'",
      "links": "<a href='/AIV/26/33/3-7'>Ezek. 33:3-7</a>; <a href='/AIV/24/7/13'>Jer. 7:13</a>",
      "comment": "Watchmen symbolize prophets and spiritual leaders, tasked to warn and guide. Their voice being ignored highlights consequences of rejecting divine authority, reminiscent of Christ’s warning to heed true teaching (<a href='/AIV/40/7/24'>Matt. 7:24</a>)."
    },
    {
      "pk": 30006018,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 18,
      "text": "Therefore hear, you nations, and observe what will happen to them.",
      "links": "<a href='/AIV/05/32/1'>Deut. 32:1</a>; <a href='/AIV/24/5/15'>Jer. 5:15</a>",
      "comment": "Other nations are called as witnesses to Israel's judgment—affirming God’s universal authority and setting a precedent for invitations to all peoples (<a href='/AIV/19/67/2'>Ps. 67:2</a>)."
    },
    {
      "pk": 30006019,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 19,
      "text": "Hear, O earth! I am bringing disaster on this people, the fruit of their schemes, because they have not listened to My words or My law, but have rejected it.",
      "links": "<a href='/AIV/24/5/19'>Jer. 5:19</a>; <a href='/AIV/05/30/15-20'>Deut. 30:15-20</a>",
      "comment": "Universal summoning ('earth') stresses the seriousness of Israel’s sin and points to the cosmic scope of both sin and salvation, a theme fulfilled in global proclamation in Christ (<a href='/AIV/40/28/19'>Matt. 28:19</a>)."
    },
    {
      "pk": 30006020,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 20,
      "text": "What do I care about frankincense from Sheba or sweet cane from a distant land? Your burnt offerings are not acceptable, nor are your sacrifices pleasing to Me.",
      "links": "<a href='/AIV/23/1/11-13'>Isa. 1:11-13</a>; <a href='/AIV/19/51/16'>Ps. 51:16</a>",
      "comment": "God rejects empty ritual, emphasizing the necessity of interior conversion—David expresses similarly in Psalm 51:16. This anticipates Christ’s teaching on true worship in <a href='/AIV/43/4/24'>John 4:24</a>."
    },
    {
      "pk": 30006021,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 21,
      "text": "Therefore, this is what the LORD says: 'I will lay obstacles before this people. Parents and children together will stumble over them; neighbors and friends will perish.'",
      "links": "<a href='/AIV/19/119/165'>Ps. 119:165</a>; <a href='/AIV/24/13/12'>Jer. 13:12</a>",
      "comment": "Obstacles signify trials resulting from disobedience, affecting all spheres of life. This underscores communal consequences of sin, echoing biblical teaching on the seriousness of communal solidarity."
    },
    {
      "pk": 30006022,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 22,
      "text": "This is what the LORD says: 'Look, a people is coming from the land of the north; a great nation is being stirred up from the ends of the earth.'",
      "links": "<a href='/AIV/24/1/14-15'>Jer. 1:14-15</a>; <a href='/AIV/24/4/6'>Jer. 4:6</a>",
      "comment": "The invader from the north represents Babylon. The reference to 'ends of the earth' suggests divine orchestration of global history, foreshadowing the gathering of nations under Messiah in the last days."
    },
    {
      "pk": 30006023,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 23,
      "text": "They hold bow and spear; they are cruel and merciless. Their voice roars like the sea; they ride horses, arrayed like men ready for battle against you, daughter of Zion.",
      "links": "<a href='/AIV/24/4/13'>Jer. 4:13</a>; <a href='/AIV/23/5/28'>Isa. 5:28</a>",
      "comment": "The terrifying description stresses overwhelming military power. The use of ‘daughter of Zion’ maintains the theme of God’s people as His beloved under threat."
    },
    {
      "pk": 30006024,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 24,
      "text": "We have heard the report of them, our hands hang limp; anguish has taken hold of us, pain like that of a woman in labor.",
      "links": "<a href='/AIV/23/13/8'>Isa. 13:8</a>; <a href='/AIV/24/4/31'>Jer. 4:31</a>",
      "comment": "Labor pain symbolizes both judgment and the hope of new birth; scripturally, such imagery is later appropriated in describing the coming of the Messiah (<a href='/AIV/43/16/21'>John 16:21</a>)."
    },
    {
      "pk": 30006025,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 25,
      "text": "Do not go out into the fields or walk on the roads, for the enemy has a sword; terror is on every side.",
      "links": "<a href='/AIV/24/20/3'>Jer. 20:3</a>; <a href='/AIV/24/6/23'>Jer. 6:23</a>",
      "comment": "‘Terror on every side’ becomes a prophetic refrain, warning of the total insecurity that follows rejection of God. Refers to later warnings during the siege."
    },
    {
      "pk": 30006026,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 26,
      "text": "Daughter of My people, put on sackcloth and roll in ashes; mourn with bitter wailing as for an only child, for sudden destruction will come upon us.",
      "links": "<a href='/AIV/23/22/12'>Isa. 22:12</a>; <a href='/AIV/24/8/21'>Jer. 8:21</a>",
      "comment": "Sackcloth and ashes symbolize repentance, a recurring biblical theme. Mourning for an only child highlights the magnitude of loss, foreshadowing the sorrow felt at Christ’s crucifixion (<a href='/AIV/38/12/10'>Zech. 12:10</a>)."
    },
    {
      "pk": 30006027,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 27,
      "text": "I have made you a tester of metals among My people, that you may know and test their ways.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/24/9/7'>Jer. 9:7</a>",
      "comment": "Jeremiah is appointed as a examiner of Israel’s purity; this metaphor anticipates the later role of spiritual authority in guiding and correcting the people’s faith and morals."
    },
    {
      "pk": 30006028,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 28,
      "text": "They are all stubborn rebels, going around with slanders; they are bronze and iron, all of them corrupt.",
      "links": "<a href='/AIV/19/78/8'>Ps. 78:8</a>; <a href='/AIV/24/9/6'>Jer. 9:6</a>",
      "comment": "Hard metals reflect moral hardness and corruption. Biblical use of metals as metaphors for spiritual states recurs in prophetic literature (<a href='/AIV/27/2/33'>Dan. 2:33</a>)."
    },
    {
      "pk": 30006029,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 29,
      "text": "The bellows blow fiercely to burn away the lead; but the refining fire goes in vain, for the wicked are not separated.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/24/9/7'>Jer. 9:7</a>",
      "comment": "Attempts at spiritual purification are frustrated by ongoing rebellion, setting up the need for a more perfect means of redemption—hinting at the necessity of divine intervention later fulfilled in Christ’s sacrifice."
    },
    {
      "pk": 30006030,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 6,
      "verse": 30,
      "text": "They will be called rejected silver, because the LORD has rejected them.",
      "links": "<a href='/AIV/24/9/7'>Jer. 9:7</a>; <a href='/AIV/24/7/29'>Jer. 7:29</a>",
      "comment": "‘Rejected silver’ represents the people’s failure to be purified. This closes the chapter with a somber declaration of judgment—yet scripture will go on to show that God’s ultimate plan involves restoration through a new and living way (see <a href='/AIV/58/10/20'>Heb. 10:20</a>)."
    }
  ],
  "translatedAt": "2025-12-24T08:24:45.234Z"
}