{
  "book": 30,
  "bookName": "Jeremiah",
  "bookAbbreviation": "Jer",
  "chapter": 24,
  "verses": [
    {
      "pk": 30024001,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 1,
      "text": "After Nebuchadnezzar king of Babylon took Jeconiah son of Jehoiakim, king of Judah, and the officials, along with the craftsmen and the metalworkers from Jerusalem and brought them to Babylon, the LORD showed me two baskets of figs set before the temple of the LORD.",
      "links": "<a href='/AIV/12/24/15-16'>2 Kings 24:15-16</a>; <a href='/AIV/14/36/10-20'>2 Chron. 36:10-20</a>",
      "comment": "Jeremiah receives a vision immediately following the first deportation. The placement of the baskets before the temple highlights the encounter's religious significance and the judgment against God's people for their covenantal unfaithfulness."
    },
    {
      "pk": 30024002,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 2,
      "text": "One basket had very good figs, like those first ripe; but the other basket had very bad figs, so bad they could not be eaten.",
      "links": "<a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>; <a href='/AIV/40/21/18-19'>Matt. 21:18-19</a>",
      "comment": "The good and bad figs symbolize two groups among the exiles—those who will be preserved and restored, and those who face judgment. Throughout Scripture, fruit often represents spiritual faithfulness or lack thereof. (Matt. 21:18-19)"
    },
    {
      "pk": 30024003,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 3,
      "text": "Then the LORD said to me, 'What do you see, Jeremiah?' I answered, 'Figs. The good figs are very good, but the bad ones are so bad they cannot be eaten.'",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>; <a href='/AIV/30/7/8'>Amos 7:8</a>",
      "comment": "The LORD often asks prophets to describe visions, emphasizing discernment and revelation. God's direct address demonstrates intimate guidance—important for seeing his faithful children versus the rebellious."
    },
    {
      "pk": 30024004,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 4,
      "text": "Then the word of the LORD came to me:",
      "links": "",
      "comment": "Jeremiah continues receiving direct revelation. Notice the verbal formula, marking a trustworthy proclamation from God—a sign of authoritative tradition."
    },
    {
      "pk": 30024005,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 5,
      "text": "'This is what the LORD, the God of Israel, says: As for the good figs, so I regard as good the exiles from Judah, whom I have sent away from this place to the land of the Chaldeans.'",
      "links": "<a href='/AIV/24/29/4-14'>Jer. 29:4-14</a>; <a href='/AIV/05/30/3-5'>Deut. 30:3-5</a>",
      "comment": "God's sovereign purpose in exile emerges: He allows suffering but intends to restore. The language anticipates both temporal restoration and a deeper spiritual renewal—a theme also evident in later depictions of the 'new covenant.'"
    },
    {
      "pk": 30024006,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 6,
      "text": "'I will set my eyes on them for good, and I will bring them back to this land. I will build them up and not tear them down; I will plant them and not uproot them.'",
      "links": "<a href='/AIV/24/31/28'>Jer. 31:28</a>; <a href='/AIV/24/32/41'>Jer. 32:41</a>",
      "comment": "God's restoration is active and positive. 'Planting and building' are recurring themes that signal the permanence of God's promises and his faithful, nurturing care—a reflection of his fatherly providence and mercy."
    },
    {
      "pk": 30024007,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 7,
      "text": "'I will give them a heart to know Me, that I am the LORD. They will be My people, and I will be their God, for they will return to Me with all their heart.'",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/24/32/38'>Jer. 32:38</a>; <a href='/AIV/26/11/19'>Ezek. 11:19</a>; <a href='/AIV/43/17/3'>John 17:3</a>",
      "comment": "This alludes to God initiating covenant relationship, giving the gift of true knowledge and inner transformation. 'A heart to know Me' points to the necessity of grace, foreshadowing the work of God's Spirit to renew and unify his people in authentic worship."
    },
    {
      "pk": 30024008,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 8,
      "text": "'But as for the bad figs, so bad they cannot be eaten—this is what the LORD says—so will I treat Zedekiah king of Judah, his officials, and the remnant of Jerusalem, those who remain in this land and those living in Egypt.'",
      "links": "<a href='/AIV/24/29/15-19'>Jer. 29:15-19</a>; <a href='/AIV/24/43/7'>Jer. 43:7</a>",
      "comment": "God's judgment is precise, emphasizing that mere physical proximity to sacred places does not guarantee spiritual safety. Rootedness in faith, not just geography, is vital—a shadow of the future teaching about authentic membership in God's people."
    },
    {
      "pk": 30024009,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 9,
      "text": "'I will make them a horror, a disaster to all the kingdoms of the earth, a reproach and a byword, a taunt and a curse, wherever I drive them.'",
      "links": "<a href='/AIV/24/29/18'>Jer. 29:18</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "Divine justice brings public shame as consequence for covenant breaking. It also serves as a call to repentance, demonstrating the seriousness of fidelity to God—a reminder that true restoration comes through submission and humility."
    },
    {
      "pk": 30024010,
      "translation": "AIV",
      "book": 30,
      "bookName": "Jeremiah",
      "bookAbbreviation": "Jer",
      "chapter": 24,
      "verse": 10,
      "text": "'I will send sword, famine, and pestilence among them until they are consumed from the land that I gave to them and to their ancestors.'",
      "links": "<a href='/AIV/03/26/25'>Lev. 26:25</a>; <a href='/AIV/05/28/21'>Deut. 28:21</a>; <a href='/AIV/24/21/6-7'>Jer. 21:6-7</a>",
      "comment": "The triple judgment underscores the gravity of separation from God's covenant. Loss of land represents broken relationship. Restoration, hinted in previous verses, depends on renewal of heart and acceptance of God's merciful plan through sacrificial grace, which is fully revealed in Christ’s New Covenant (cf. Jer. 31:31-34)."
    }
  ],
  "translatedAt": "2025-12-24T08:34:24.937Z"
}