{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 6,
  "verses": [
    {
      "pk": 2550601,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 1,
      "text": "Now when Sanballat, Tobiah, Geshem the Arab, and the rest of our enemies heard that I had rebuilt the wall, and that no gap was left in it—though up to that time I had not set up the doors in the gates—",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/16/4/7'>Neh. 4:7-8</a>",
      "comment": "Sanballat and Tobiah represent persistent opposition to God's work, echoing recurring challenges faced by God's people throughout Scripture (see Neh. 2:19, 4:7–8). The wall being almost complete highlights perseverance and spiritual protection for the community."
    },
    {
      "pk": 2550602,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 2,
      "text": "Sanballat and Geshem sent to me, saying, \"Come, let us meet together at Hakkephirim in the plain of Ono.\" But they intended to harm me.",
      "links": "<a href='/AIV/16/6/10'>Neh. 6:10-13</a>",
      "comment": "The enemy's invitation to meet was a deceptive attempt to stop God's work; discernment is needed when following God's calling. The desire to harm reflects the spiritual warfare believers face (Eph. 6:12), and God's protection over leadership."
    },
    {
      "pk": 2550603,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 3,
      "text": "So I sent messengers to them, saying, \"I am doing a great work and cannot come down. Why should the work stop while I leave it and come down to you?\"",
      "links": "<a href='/AIV/16/6/9'>Neh. 6:9</a>; <a href='/AIV/62/2/15'>1 John 2:15-17</a>",
      "comment": "Nehemiah's firm resolve shows single-minded devotion, reminiscent of the apostolic calling to prioritize God's work (cf. Luke 9:62). Leaders in the faith should not easily be distracted from their mission for lesser matters."
    },
    {
      "pk": 2550604,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 4,
      "text": "They sent to me four times in this way, and I answered them in the same manner.",
      "links": "<a href='/AIV/16/4/14'>Neh. 4:14</a>",
      "comment": "Persistence in temptation calls for steadfastness. Nehemiah's repeated refusal highlights endurance, similar to Christ's answers in the wilderness (Matt. 4:1-11)."
    },
    {
      "pk": 2550605,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 5,
      "text": "Then Sanballat sent his servant to me the fifth time with an open letter in his hand.",
      "links": "<a href='/AIV/16/6/19'>Neh. 6:19</a>",
      "comment": "An open letter meant public exposure and intimidation, similar to how Christ was falsely accused before the crowds (Mark 15:11-14). The enemy often seeks to undermine with slander."
    },
    {
      "pk": 2550606,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 6,
      "text": "In it was written: \"It is reported among the nations, and Geshem says it as well, that you and the Jews intend to rebel. That is why you are rebuilding the wall, and according to these reports you wish to become their king.\"",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/27/6/3-5'>Dan. 6:3-5</a>",
      "comment": "False accusations of rebellion against God’s anointed leader echo Old Testament patterns and foreshadow how Christ was accused by his enemies (Luke 23:2)."
    },
    {
      "pk": 2550607,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 7,
      "text": "\"And you have also set up prophets to proclaim about you in Jerusalem, ‘There is a king in Judah!’ And now these words will reach the king. So come, that we may consult together.\"",
      "links": "<a href='/AIV/11/13/33'>1 Kings 13:33</a>; <a href='/AIV/42/23/2'>Luke 23:2</a>",
      "comment": "The claim of false prophets declaring Nehemiah king symbolizes efforts to distort God's plan. This methodology is seen in how religious leaders later accuse Christ of claiming kingship (Luke 23:2)."
    },
    {
      "pk": 2550608,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 8,
      "text": "Then I sent to him, saying, \"No such things as you say have been done, for you are inventing them out of your own mind.\"",
      "links": "<a href='/AIV/16/6/14'>Neh. 6:14</a>",
      "comment": "Nehemiah directly refutes lies, choosing truthfulness, a virtue central to a life of faith (see John 8:44 for lies as the enemy’s tactic)."
    },
    {
      "pk": 2550609,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 9,
      "text": "For they all wanted to frighten us, thinking, \"Their hands will drop from the work, and it will not be completed.\" But now, O God, strengthen my hands.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/16/2/20'>Neh. 2:20</a>",
      "comment": "Nehemiah's prayer for strength points to the need for dependence on God's grace amid adversity, a theme resonant throughout Christian living (Phil. 4:13). The invocation acknowledges the importance of perseverance in leadership and faith."
    },
    {
      "pk": 2550610,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 10,
      "text": "Afterward, I went to the house of Shemaiah, the son of Delaiah, son of Mehetabel, who was confined in his home. He said, \"Let us meet together in the house of God, inside the temple, and let us shut the doors of the temple, for they are coming to kill you—by night they are coming to kill you.\"",
      "links": "<a href='/AIV/16/13/4-9'>Neh. 13:4-9</a>; <a href='/AIV/09/22/11-19'>1 Sam. 22:11-19</a>",
      "comment": "Shemaiah’s counsel appears holy but is deceptive. Entering the temple as protection was forbidden for a layman, showing that not every spiritual-sounding advice honors God’s law or order. This illustrates the critical need for discernment and obedience to divinely established boundaries."
    },
    {
      "pk": 2550611,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 11,
      "text": "But I said, \"Should a man like me run away? And should someone like me enter the temple to save his life? I will not go in!\"",
      "links": "<a href='/AIV/04/18/7'>Num. 18:7</a>",
      "comment": "Nehemiah refuses to violate temple protocol, showing honor for God’s established offices and order. This reverence for sacred boundaries foreshadows later Christian respect for the sacramental and hierarchical nature of the faith."
    },
    {
      "pk": 2550612,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 12,
      "text": "And I understood and saw that God had not sent him, but that he had pronounced this prophecy against me because Tobiah and Sanballat had hired him.",
      "links": "<a href='/AIV/24/23/21'>Jer. 23:21</a>; <a href='/AIV/16/13/2'>Neh. 13:2</a>",
      "comment": "False prophecy is a recurring challenge (Jer. 23:21) and requires discernment. Authenticity and faithfulness to God’s word are central to true leadership."
    },
    {
      "pk": 2550613,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 13,
      "text": "For this purpose he was hired, that I should become afraid and act in this way and sin, so that they might have a bad report to reproach me.",
      "links": "<a href='/AIV/16/4/2-3'>Neh. 4:2-3</a>",
      "comment": "Temptations often come as snares, urging us to abandon faith and sin out of fear. Integrity is crucial to faithfulness, even under threat."
    },
    {
      "pk": 2550614,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 14,
      "text": "Remember Tobiah and Sanballat, O my God, according to these their works, and also the prophetess Noadiah and the rest of the prophets who wanted to frighten me.",
      "links": "<a href='/AIV/19/35/24'>Ps. 35:24</a>; <a href='/AIV/24/18/23'>Jer. 18:23</a>",
      "comment": "Nehemiah calls for God's justice, trusting God's ultimate authority and righteousness, reminiscent of the Psalms’ prayers for vindication."
    },
    {
      "pk": 2550615,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 15,
      "text": "So the wall was finished on the twenty-fifth day of the month Elul, in fifty-two days.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "Completion of the wall in record time points to divine blessing and providence, reinforcing the importance of unity and steadfastness among the people of God."
    },
    {
      "pk": 2550616,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 16,
      "text": "And when all our enemies heard of it, all the nations around us were afraid and lost their confidence, for they perceived that this work had been accomplished with the help of our God.",
      "links": "<a href='/AIV/02/14/25'>Ex. 14:25'>; <a href='/AIV/19/126/2-3'>Ps. 126:2-3</a>",
      "comment": "The fear of the nations reflects that God's power is made evident through his people's fidelity. Their realization recalls how God fights for those who trust Him, which finds fulfillment throughout salvation history."
    },
    {
      "pk": 2550617,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 17,
      "text": "Also in those days, the nobles of Judah were sending many letters to Tobiah, and Tobiah's letters came to them.",
      "links": "<a href='/AIV/16/13/4-7'>Neh. 13:4-7</a>",
      "comment": "The internal correspondence reveals division and duplicity within God's people. Unity and faithfulness to the appointed leadership is crucial for integrity of worship and community."
    },
    {
      "pk": 2550618,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 18,
      "text": "For many in Judah were bound by oath to him, because he was the son-in-law of Shecaniah the son of Arah, and his son Jehohanan had married the daughter of Meshullam the son of Berechiah.",
      "links": "<a href='/AIV/16/13/28'>Neh. 13:28</a>",
      "comment": "Intermarriage and questionable alliances introduced tension, highlighting the importance of holiness, fidelity, and correct relationships among the people, which would later be foundational in developing ordered and sacramental community."
    },
    {
      "pk": 2550619,
      "translation": "AIV",
      "book": 16,
      "chapter": 6,
      "verse": 19,
      "text": "They also spoke well of Tobiah in front of me and reported my words to him. And Tobiah continued to send letters to frighten me.",
      "links": "<a href='/AIV/16/4/8'>Neh. 4:8</a>",
      "comment": "The continual attempts to undermine Nehemiah show that opposition to God-given leadership and mission persists within the faith community. Vigilance, prayer, and fidelity remain essential elements as seen across Scripture."
    }
  ],
  "translatedAt": "2025-12-23T04:36:34.609Z"
}