{
  "book": 16,
  "bookName": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 13,
  "verses": [
    {
      "pk": 16013001,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 1,
      "text": "On that day, the Book of Moses was read aloud in the hearing of the people. It was found written that no Ammonite or Moabite should ever enter the assembly of God.",
      "links": "<a href='/AIV/05/23/3'>Deut. 23:3</a>; <a href='/AIV/04/25/1-9'>Num. 25:1-9</a>",
      "comment": "This recalls the restrictions in Deuteronomy against certain foreign groups joining Israel's worship. It highlights the importance of maintaining the purity of communal worship, which has spiritual implications concerning preparation to receive God's presence, later mirrored in teachings about holiness and the need for separation from sin."
    },
    {
      "pk": 16013002,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 2,
      "text": "For they did not meet the Israelites with bread and water, but hired Balaam against them to curse them. However, our God turned the curse into a blessing.",
      "links": "<a href='/AIV/04/22/5-6'>Num. 22:5-6</a>; <a href='/AIV/04/23/11-12'>Num. 23:11-12</a>",
      "comment": "This verse demonstrates God's sovereignty in transforming attempts to harm His people into good, a theme later fulfilled in Christ turning death into salvation (<a href='/AIV/45/8/28'>Rom. 8:28</a>). The principle of God's blessing emerging out of adversity is seen throughout salvation history."
    },
    {
      "pk": 16013003,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 3,
      "text": "When they heard this law, they separated from Israel all those of foreign descent.",
      "links": "<a href='/AIV/15/10/3'>Ezra 10:3</a>; <a href='/AIV/16/9/2'>Neh. 9:2</a>",
      "comment": "Obedience to God's word required difficult decisions, such as separation from ungodliness. This anticipates the New Testament call to holiness and distinctness from the world (<a href='/AIV/47/6/17'>2 Cor. 6:17</a>)."
    },
    {
      "pk": 16013004,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 4,
      "text": "Now before this, Eliashib the priest, appointed over the storerooms of the house of our God, was related to Tobiah.",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>; <a href='/AIV/16/6/17-19'>Neh. 6:17-19</a>",
      "comment": "Eliashib’s relationship with Tobiah led to compromise within the temple, revealing the danger of divided loyalties in spiritual leadership. The integrity of worship space is a recurring biblical theme."
    },
    {
      "pk": 16013005,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 5,
      "text": "Eliashib had prepared for Tobiah a large room, formerly used to store grain offerings, incense, vessels, and the tithes of grain, wine, and oil for the Levites, singers, and gatekeepers, as well as the contributions for the priests.",
      "links": "<a href='/AIV/16/10/37-39'>Neh. 10:37-39</a>; <a href='/AIV/04/18/21-28'>Num. 18:21-28</a>",
      "comment": "The misuse of the temple storeroom for secular purposes undermined proper worship and provision for ministry leaders. God’s house is meant for sacred, not common, use – a principle carried forward in teachings about reverence for places of worship and for holy rites."
    },
    {
      "pk": 16013006,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 6,
      "text": "But while all this was happening, I was not in Jerusalem, for in the thirty-second year of Artaxerxes king of Babylon I had returned to the king. After some time, I asked for leave from the king...",
      "links": "<a href='/AIV/16/2/1'>Neh. 2:1</a>; <a href='/AIV/16/1/1'>Neh. 1:1</a>",
      "comment": "Nehemiah’s absence revealed how easily spiritual integrity can slip without godly leadership. The role of spiritual oversight is vital for maintaining faithful worship, echoing later teachings about guardian ministry and apostolic succession."
    },
    {
      "pk": 16013007,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 7,
      "text": "And I came to Jerusalem and discovered the evil that Eliashib had done for Tobiah by preparing a room for him in the courts of the house of God.",
      "links": "<a href='/AIV/16/6/18'>Neh. 6:18</a>",
      "comment": "Nehemiah’s righteous indignation reveals the priority of keeping the worship space free from compromise, foreshadowing Christ’s cleansing of the temple (<a href='/AIV/43/2/13-16'>John 2:13-16</a>)."
    },
    {
      "pk": 16013008,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 8,
      "text": "I was very angry and threw out all of Tobiah’s household goods from the room.",
      "links": "<a href='/AIV/16/10/39'>Neh. 10:39</a>; <a href='/AIV/43/2/15'>John 2:15</a>",
      "comment": "Nehemiah’s zeal echoes the righteous anger Jesus would later display in purifying the Temple of corruption. Maintaining holiness within the worship space is essential for true communion with God."
    },
    {
      "pk": 16013009,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 9,
      "text": "Then I ordered the rooms to be purified, and brought back the vessels of the house of God, along with the grain offering and the incense.",
      "links": "<a href='/AIV/16/12/45'>Neh. 12:45</a>; <a href='/AIV/03/14/49'>Lev. 14:49</a>",
      "comment": "Restoring the sacred objects and offerings highlights the primacy of ritual purity and correct worship. This process prefigures a theology of restoration and renewal often seen in the sacraments and the importance of purification before God."
    },
    {
      "pk": 16013010,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 10,
      "text": "I also found that the portions assigned to the Levites had not been given to them. The Levites and singers who did the work had each returned to his field.",
      "links": "<a href='/AIV/16/12/44'>Neh. 12:44</a>; <a href='/AIV/04/18/21'>Num. 18:21</a>",
      "comment": "When ministry leaders are neglected, spiritual life suffers. The proper support for those serving God is both a practical and spiritual principle, traced throughout Old and New Testaments (<a href='/AIV/54/5/17-18'>1 Tim. 5:17-18</a>)."
    },
    {
      "pk": 16013011,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 11,
      "text": "I rebuked the officials and asked, 'Why has the house of God been neglected?' Then I gathered the Levites and singers and restored them to their posts.",
      "links": "<a href='/AIV/16/10/39'>Neh. 10:39</a>",
      "comment": "Nehemiah’s action to restore proper worship is a pattern for reform within the worshiping community. Godly leadership must guard and renew the spiritual life of the people."
    },
    {
      "pk": 16013012,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 12,
      "text": "Then all Judah brought the tithe of grain, wine, and oil into the storerooms.",
      "links": "<a href='/AIV/03/27/30'>Lev. 27:30</a>; <a href='/AIV/16/10/38'>Neh. 10:38</a>",
      "comment": "Faithfulness to God is shown in sacrificial giving. Restored worship is marked by practical support for ministry, fitting with teachings on stewardship and generosity (<a href='/AIV/47/9/7'>2 Cor. 9:7</a>)."
    },
    {
      "pk": 16013013,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 13,
      "text": "I appointed as treasurers over the storerooms Shelemiah the priest, Zadok the scribe, and Pedaiah of the Levites; and as assistant, Hanan the son of Zaccur, son of Mattaniah, because they were considered trustworthy. They were responsible for distributing the portions to their brothers.",
      "links": "<a href='/AIV/16/7/2'>Neh. 7:2</a>",
      "comment": "Trustworthiness in those appointed to manage sacred things is vital, anticipating the qualifications for church leadership carefully laid out by apostles (<a href='/AIV/54/3/2-13'>1 Tim. 3:2-13</a>)."
    },
    {
      "pk": 16013014,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 14,
      "text": "Remember me for this, my God, and do not blot out the kindnesses I have done for the house of my God and for its services.",
      "links": "<a href='/AIV/16/5/19'>Neh. 5:19</a>; <a href='/AIV/19/106/4'>Ps. 106:4</a>",
      "comment": "Nehemiah’s prayer reflects dependence on God’s remembrance and mercy, a theme found in Jesus’ teaching on heavenly reward (<a href='/AIV/40/6/4'>Matt. 6:4</a>). Acts of service for worship and ministry have enduring spiritual impact."
    },
    {
      "pk": 16013015,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 15,
      "text": "In those days I saw people in Judah treading winepresses on the Sabbath, and bringing in heaps of grain, loading them on donkeys, as well as wine, grapes, figs, and other burdens, bringing them into Jerusalem on the Sabbath day. I warned them about selling food on that day.",
      "links": "<a href='/AIV/02/20/8-11'>Ex. 20:8-11</a>; <a href='/AIV/24/17/21-22'>Jer. 17:21-22</a>",
      "comment": "The sabbath observance, central to worship, points toward a theology of sacred time. Neglecting it leads to spiritual decline, underscoring the New Testament’s emphasis on a day dedicated to worship and rest for the Lord."
    },
    {
      "pk": 16013016,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 16,
      "text": "People from Tyre who lived in Jerusalem were bringing in fish and all kinds of merchandise and selling them on the Sabbath to the people of Judah, and in Jerusalem itself.",
      "links": "<a href='/AIV/24/17/22'>Jer. 17:22</a>; <a href='/AIV/16/10/31'>Neh. 10:31</a>",
      "comment": "Commerce on the sabbath represents a disregard of holiness for economic gain. Spiritual tradition values obedience and devotion above material concerns."
    },
    {
      "pk": 16013017,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 17,
      "text": "So I confronted the nobles of Judah and asked, 'What is this evil thing that you are doing, profaning the Sabbath day?'",
      "links": "<a href='/AIV/24/17/23'>Jer. 17:23</a>",
      "comment": "Strong words against profaning the sabbath reiterate the call to spiritual discipline. Sacred time requires active safeguarding, as shown by Christ’s keeping of the sabbath until its fulfillment (<a href='/AIV/41/2/27-28'>Mark 2:27-28</a>)."
    },
    {
      "pk": 16013018,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 18,
      "text": "Did not your ancestors do the same things, causing our God to bring all this trouble on us and on this city? Now you are increasing the wrath on Israel by profaning the Sabbath.",
      "links": "<a href='/AIV/24/17/27'>Jer. 17:27</a>; <a href='/AIV/12/23/11'>2 Kings 23:11</a>",
      "comment": "Linking present sin to historic consequences highlights the importance of communal faithfulness. The idea of collective responsibility for sin prepares the way for Christ’s atoning sacrifice for His people."
    },
    {
      "pk": 16013019,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 19,
      "text": "When evening shadows fell on the gates of Jerusalem before the Sabbath, I commanded that the gates be shut and not opened until after the Sabbath. I also stationed some of my men at the gates so that no burden could be brought in on the Sabbath day.",
      "links": "<a href='/AIV/16/7/3'>Neh. 7:3</a>",
      "comment": "Actively guarding the city’s gates is symbolic of safeguarding worship from intrusion, foreshadowing spiritual vigilance in Christian life (<a href='/AIV/60/5/8'>1 Pet. 5:8</a>)."
    },
    {
      "pk": 16013020,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 20,
      "text": "Merchants and sellers of all kinds of wares spent the night outside Jerusalem once or twice.",
      "links": "<a href='/AIV/24/17/19'>Jer. 17:19</a>",
      "comment": "Attempts to circumvent sacred traditions show that holiness needs protection and continual renewal, as spiritual life can be threatened by worldly influences."
    },
    {
      "pk": 16013021,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 21,
      "text": "Then I warned them and said, 'Why do you spend the night beside the wall? If you do so again, I will lay hands on you.' From that time on, they did not come back on the Sabbath.",
      "links": "<a href='/AIV/16/4/7-8'>Neh. 4:7-8</a>",
      "comment": "Firm boundaries set for worship and rest reinforce the sanctity God demands from His people. The spiritual leader’s role in defending and preserving holiness again finds resonance in apostolic governance."
    },
    {
      "pk": 16013022,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 22,
      "text": "I commanded the Levites to purify themselves and to guard the gates to keep the Sabbath day holy. Remember me for this also, my God, and show me mercy according to your great love.",
      "links": "<a href='/AIV/03/16/30-34'>Lev. 16:30-34</a>; <a href='/AIV/16/1/11'>Neh. 1:11</a>",
      "comment": "Purification before service and the call to mercy reflect deeper spiritual truths of preparation and reliance on God’s grace, which reach their fulfillment in the New Covenant and its sacred rites."
    },
    {
      "pk": 16013023,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 23,
      "text": "In those days I also saw Jews who had married women of Ashdod, Ammon, and Moab.",
      "links": "<a href='/AIV/16/10/30'>Neh. 10:30</a>; <a href='/AIV/15/9/1-2'>Ezra 9:1-2</a>",
      "comment": "Intermarriage with pagan nations posed threats to Israel’s spiritual identity, leading to syncretism and dilution of faith. Spiritual unity in worship and life is a recurring biblical theme."
    },
    {
      "pk": 16013024,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 24,
      "text": "Half of their children spoke the language of Ashdod and could not speak the language of Judah, but the language of their respective peoples.",
      "links": "<a href='/AIV/02/13/19'>Ex. 13:19</a>",
      "comment": "Loss of language symbolized a loss of cultural and religious identity. Scripture consistently affirms the importance of catechesis and transmitting faith and tradition to the next generation."
    },
    {
      "pk": 16013025,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 25,
      "text": "So I rebuked them, cursed some of them, struck some, and pulled out their hair. I made them swear by God, saying, 'You shall not give your daughters to their sons, or take their daughters for your sons or for yourselves.'",
      "links": "<a href='/AIV/05/7/3-4'>Deut. 7:3-4</a>",
      "comment": "Nehemiah’s harsh actions underscore the seriousness of spiritual compromise. While not recommended now, it affirms the priority God places on holy marriage and family—ultimately reflected in the union Christ desires for the Church."
    },
    {
      "pk": 16013026,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 26,
      "text": "Did not Solomon king of Israel sin on account of such women? Among many nations there was no king like him, beloved by his God, and God made him king over all Israel; but even he was led into sin by foreign women.",
      "links": "<a href='/AIV/11/11/1-8'>1 Kings 11:1-8</a>",
      "comment": "Even Solomon, with all his wisdom and status, fell due to compromise in relationships. The dangers of mixed allegiance repeat through Scripture, and total faithfulness is expected of God’s people."
    },
    {
      "pk": 16013027,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 27,
      "text": "So should we then hear that you are doing all this great evil, acting unfaithfully against our God by marrying foreign women?",
      "links": "<a href='/AIV/15/9/2'>Ezra 9:2</a>",
      "comment": "Spiritual infidelity through marriage symbolizes broader unfaithfulness, a motif culminating in the Church’s call to be the pure Bride of Christ (<a href='/AIV/49/5/25-27'>Eph. 5:25-27</a>)."
    },
    {
      "pk": 16013028,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 28,
      "text": "And one of the sons of Joiada, son of Eliashib the high priest, was son-in-law to Sanballat the Horonite; so I drove him away from me.",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>; <a href='/AIV/16/6/18'>Neh. 6:18</a>",
      "comment": "Sanballat had persistently opposed the rebuilding, yet was connected to the priestly line through marriage. Leadership must remain above reproach, free from compromising alliances."
    },
    {
      "pk": 16013029,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 29,
      "text": "Remember them, my God, because they have defiled the priesthood and the covenant of the priesthood and the Levites.",
      "links": "<a href='/AIV/03/8/1-9'>Lev. 8:1-9</a>",
      "comment": "Upholding purity in priesthood is a major theme throughout Scripture, echoing later requirements for apostolic successors and ministers to maintain the integrity of worship and teaching."
    },
    {
      "pk": 16013030,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 30,
      "text": "So I purified them from everything foreign, and I assigned duties for the priests and the Levites, each to his own task.",
      "links": "<a href='/AIV/04/3/6-10'>Num. 3:6-10</a>",
      "comment": "Proper assignment of duties reflects the principle of order and hierarchy in worship, which foreshadows the discipline and structure adopted for ministry in the later Church."
    },
    {
      "pk": 16013031,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 13,
      "verse": 31,
      "text": "And for the wood offering at appointed times, and for the firstfruits. Remember me, my God, for good.",
      "links": "<a href='/AIV/16/10/34-35'>Neh. 10:34-35</a>; <a href='/AIV/39/3/16'>Mal. 3:16</a>",
      "comment": "Nehemiah’s last prayer again places trust in God’s remembrance and mercy. The offerings and firstfruits are emblematic of further dedication and thankfulness, finalized in the perpetual ministry and sacrificial offerings of the Church."
    }
  ],
  "translatedAt": "2025-12-24T04:53:40.454Z"
}