{
  "book": 16,
  "bookName": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 9,
  "verses": [
    {
      "pk": 16009001,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 1,
      "text": "Now on the twenty-fourth day of this month, the children of Israel gathered with fasting, wearing sackcloth, and with dust on their heads.",
      "links": "<a href='/AIV/03/16/29'>Lev. 16:29</a>; <a href='/AIV/23/58/5'>Isa. 58:5</a>",
      "comment": "The fasting and sackcloth reflect authentic repentance and sorrow for sin, a visible sign often seen in Israelite tradition."
    },
    {
      "pk": 16009002,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 2,
      "text": "Those of Israelite descent separated themselves from all foreigners and stood to confess their sins and the wrongdoings of their fathers.",
      "links": "<a href='/AIV/03/16/21'>Lev. 16:21</a>; <a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "Confession is made both for personal sin and generational transgression, showcasing the communal nature of intercessory prayer."
    },
    {
      "pk": 16009003,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 3,
      "text": "They stood where they were and read from the Book of the Law of the LORD their God for a quarter of the day, and for another quarter they confessed and worshiped the LORD their God.",
      "links": "<a href='/AIV/16/8/3'>Neh. 8:3</a>; <a href='/AIV/19/119/164'>Ps. 119:164</a>",
      "comment": "Ritual reading of Scripture with extended worship and confession aligns with the structure of liturgical prayer found later in Christian practice."
    },
    {
      "pk": 16009004,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 4,
      "text": "Jeshua, Bani, Kadmiel, Shebaniah, Bunni, Sherebiah, Bani, and Chenani stood on the stairs of the Levites and cried out in a loud voice to the LORD their God.",
      "links": "<a href='/AIV/16/9/5'>Neh. 9:5</a>",
      "comment": "Levites publicly leading worship underscores the importance of ordained ministry in guiding communal prayer."
    },
    {
      "pk": 16009005,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 5,
      "text": "Then the Levites—Jeshua, Kadmiel, Bani, Hashabneiah, Sherebiah, Hodiah, Shebaniah, and Pethahiah—said, \"Stand up and bless the LORD your God forever and ever! Blessed be Your glorious name, which is exalted above all blessing and praise.\"",
      "links": "<a href='/AIV/19/41/13'>Ps. 41:13</a>; <a href='/AIV/19/72/18-19'>Ps. 72:18-19</a>",
      "comment": "The call to 'stand and bless' reflects the worship posture often prescribed in Christian assemblies."
    },
    {
      "pk": 16009006,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 6,
      "text": "\"You alone are the LORD; You made the heavens, the heavens of heavens and all their host, the earth and everything on it, the seas and all that is in them. You give life to them all, and the host of heaven worships You.\"",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/19/148/2-5'>Ps. 148:2-5</a>",
      "comment": "Acknowledging God as Creator, the basis for understanding divine sovereignty, connects to later Christian doctrines affirming the Trinity in creation."
    },
    {
      "pk": 16009007,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 7,
      "text": "\"You are the LORD God, who chose Abram and brought him out of Ur of the Chaldeans and gave him the name Abraham.\"",
      "links": "<a href='/AIV/01/12/1'>Gen. 12:1</a>; <a href='/AIV/01/17/5'>Gen. 17:5</a>",
      "comment": "The divine initiative in salvation history starts with Abram, foreshadowing election and grace."
    },
    {
      "pk": 16009008,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 8,
      "text": "\"You found his heart faithful before You and made a covenant with him to give the land of the Canaanite, the Hittite, the Amorite, the Perizzite, the Jebusite, and the Girgashite—to give it to his descendants. And You have kept Your promise, for You are righteous.\"",
      "links": "<a href='/AIV/01/15/18-21'>Gen. 15:18-21</a>; <a href='/AIV/01/22/16-18'>Gen. 22:16-18</a>",
      "comment": "God's covenant points forward to the New Covenant established in Christ, maintaining continuity in salvation history."
    },
    {
      "pk": 16009009,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 9,
      "text": "\"You saw the suffering of our ancestors in Egypt and heard their cry at the Red Sea.\"",
      "links": "<a href='/AIV/02/3/7'>Ex. 3:7</a>; <a href='/AIV/02/14/10'>Ex. 14:10</a>",
      "comment": "Remembrance of God's deliverance from Egypt becomes a template for redemption and salvation, echoed in Christian liturgy."
    },
    {
      "pk": 16009010,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 10,
      "text": "\"You performed signs and wonders against Pharaoh, against all his servants, and against all the people of his land; for You knew how arrogantly they treated our fathers. You made a name for Yourself, as it is this day.\"",
      "links": "<a href='/AIV/02/7/3'>Ex. 7:3</a>; <a href='/AIV/02/9/16'>Ex. 9:16</a>",
      "comment": "The miracles serve as acts of divine revelation, signifying God's active intervention—anticipating greater miracles in Christ."
    },
    {
      "pk": 16009011,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 11,
      "text": "\"You parted the sea before them, and they passed through the midst of the sea on dry ground; but as for their pursuers, You cast them into the depths like a stone in mighty waters.\"",
      "links": "<a href='/AIV/02/14/21-28'>Ex. 14:21-28</a>",
      "comment": "The crossing of the Red Sea prefigures Christian baptism, passing through water and leaving bondage behind."
    },
    {
      "pk": 16009012,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 12,
      "text": "\"You led them by a pillar of cloud by day and by a pillar of fire by night to light for them the way in which they should go.\"",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>",
      "comment": "God guiding His people with visible signs prefigures the guidance of the Holy Spirit in the Church."
    },
    {
      "pk": 16009013,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 13,
      "text": "\"You came down on Mount Sinai and spoke with them from heaven. You gave them regulations and laws that are true, good statutes and commandments.\"",
      "links": "<a href='/AIV/02/19/20'>Ex. 19:20</a>; <a href='/AIV/19/19/7'>Ps. 19:7</a>",
      "comment": "God’s revelation of the Law is the foundation for moral teaching—fulfilled and perfected in the teachings of Christ."
    },
    {
      "pk": 16009014,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 14,
      "text": "\"You made known to them Your holy Sabbath, and gave them commandments, statutes, and a law through Your servant Moses.\"",
      "links": "<a href='/AIV/02/20/8-11'>Ex. 20:8-11</a>; <a href='/AIV/26/20/12'>Ezek. 20:12</a>",
      "comment": "The Sabbath is a sign and gift, later interpreted as fulfillment in the New Testament rest found in Christ."
    },
    {
      "pk": 16009015,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 15,
      "text": "\"You gave them bread from heaven for their hunger and brought them water from the rock for their thirst. You told them to go in and take possession of the land You had sworn to give them.\"",
      "links": "<a href='/AIV/02/16/4'>Ex. 16:4</a>; <a href='/AIV/04/20/11'>Num. 20:11</a>; <a href='/AIV/43/6/32-35'>John 6:32-35</a>",
      "comment": "The bread from heaven prefigures the true Bread, Christ Himself, revealed in the Eucharist as the fulfillment."
    },
    {
      "pk": 16009016,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 16,
      "text": "\"But they, our ancestors, acted arrogantly and stiffened their necks and did not obey Your commandments.\"",
      "links": "<a href='/AIV/02/32/9'>Ex. 32:9</a>; <a href='/AIV/19/106/7'>Ps. 106:7</a>",
      "comment": "The recurring hardness of heart shows the need for God's grace and restoration; a theme fulfilled in Christ’s redemption."
    },
    {
      "pk": 16009017,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 17,
      "text": "\"They refused to obey and were not mindful of the wonders that You worked among them, but stiffened their necks and appointed a leader to return to their slavery in Egypt. But You are a God ready to pardon, gracious and merciful, slow to anger and abounding in steadfast love, and You did not forsake them.\"",
      "links": "<a href='/AIV/02/14/12'>Ex. 14:12</a>; <a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "God’s attributes of mercy and forbearance are upheld, anticipating divine forgiveness in Christ."
    },
    {
      "pk": 16009018,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 18,
      "text": "\"Even when they made a molten calf and said, 'This is your god who brought you up out of Egypt,' and committed great blasphemies,\"",
      "links": "<a href='/AIV/02/32/4'>Ex. 32:4</a>",
      "comment": "The golden calf incident is an archetype of idolatry, which finds correction and fulfillment in right worship through Christ."
    },
    {
      "pk": 16009019,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 19,
      "text": "\"You, in Your great mercy, did not forsake them in the wilderness. The pillar of cloud did not depart from them by day to guide them, nor the pillar of fire by night to show them the way they should go.\"",
      "links": "<a href='/AIV/02/13/22'>Ex. 13:22</a>",
      "comment": "God’s steadfast presence in times of trial prefigures the enduring promise of Christ’s presence among His people."
    },
    {
      "pk": 16009020,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 20,
      "text": "\"You gave Your good Spirit to instruct them and did not withhold Your manna from their mouth and gave them water for their thirst.\"",
      "links": "<a href='/AIV/04/11/25'>Num. 11:25</a>; <a href='/AIV/16/9/15'>Neh. 9:15</a>",
      "comment": "The giving of the Spirit points ahead to the promised indwelling of the Spirit in all believers (see Acts 2)."
    },
    {
      "pk": 16009021,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 21,
      "text": "\"For forty years You sustained them in the wilderness, and they lacked nothing. Their clothes did not wear out and their feet did not swell.\"",
      "links": "<a href='/AIV/05/8/4'>Deut. 8:4</a>; <a href='/AIV/05/29/5'>Deut. 29:5</a>",
      "comment": "God’s providential care for His people is highlighted; foreshadows spiritual nourishment provided through the sacramental life."
    },
    {
      "pk": 16009022,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 22,
      "text": "\"You gave them kingdoms and peoples and allotted them every corner. They conquered the land of Sihon king of Heshbon and the land of Og king of Bashan.\"",
      "links": "<a href='/AIV/04/21/21-35'>Num. 21:21-35</a>; <a href='/AIV/05/3/1-4'>Deut. 3:1-4</a>",
      "comment": "God establishes His chosen people, anticipating the growth of His universal kingdom in salvation history."
    },
    {
      "pk": 16009023,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 23,
      "text": "\"You multiplied their descendants as the stars of heaven, and brought them into the land You had promised to their fathers.\"",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>; <a href='/AIV/02/1/7'>Ex. 1:7</a>",
      "comment": "The promise of descendants points to the blessings fulfilled in Christ, who makes all believers children of Abraham."
    },
    {
      "pk": 16009024,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 24,
      "text": "\"So their children went in and possessed the land. You subdued before them the inhabitants of the land—the Canaanites—and gave them into their hands, with their kings and the peoples of the land, that they might do with them as they wished.\"",
      "links": "<a href='/AIV/06/1/1-2'>Josh. 1:1-2</a>",
      "comment": "Israel's conquest of the land prefigures Christ's victory over sin and the establishment of the spiritual kingdom."
    },
    {
      "pk": 16009025,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 25,
      "text": "\"They captured fortified cities and fertile land. They took possession of houses filled with every good thing, wells already dug, vineyards, olive groves, and fruit trees in abundance. So they ate, were satisfied, and grew fat, delighting themselves in Your great goodness.\"",
      "links": "<a href='/AIV/05/6/10-11'>Deut. 6:10-11</a>",
      "comment": "The abundance received is a reminder that earthly blessings point to greater spiritual gifts in Christ."
    },
    {
      "pk": 16009026,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 26,
      "text": "\"But they were disobedient and rebelled against You, cast Your law behind their backs, and killed Your prophets who warned them to turn back to You, and they committed great blasphemy.\"",
      "links": "<a href='/AIV/11/19/10'>1 Kings 19:10</a>; <a href='/AIV/24/2/30'>Jer. 2:30</a>",
      "comment": "The persecution of prophets prefigures the rejection of Christ, the greatest Prophet and High Priest."
    },
    {
      "pk": 16009027,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 27,
      "text": "\"Therefore You gave them into the hand of their enemies who oppressed them. But when they cried to You in their distress, You heard from heaven and, in Your great mercy, You gave them deliverers who saved them from their enemies.\"",
      "links": "<a href='/AIV/07/3/9'>Judg. 3:9</a>",
      "comment": "God raises up deliverers (judges), foreshadowing the ultimate deliverance in Christ."
    },
    {
      "pk": 16009028,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 28,
      "text": "\"But after they had rest, they did evil again before You, and You abandoned them to the hand of their enemies, so that they ruled over them. Yet when they turned and cried to You once more, You heard from heaven, and many times You delivered them according to Your mercy.\"",
      "links": "<a href='/AIV/07/2/18'>Judg. 2:18</a>",
      "comment": "God’s constant readiness to forgive is the model of mercy for His people, reflected in later teachings on reconciliation."
    },
    {
      "pk": 16009029,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 29,
      "text": "\"You warned them to return to Your law. Yet they acted arrogantly and did not listen to Your commandments but sinned against Your laws, which, if a person does them, he shall live by them. They stubbornly turned their backs, stiffened their necks, and would not listen.\"",
      "links": "<a href='/AIV/03/18/5'>Lev. 18:5</a>; <a href='/AIV/26/20/11'>Ezek. 20:11</a>",
      "comment": "The call to the law anticipates the greater, inward law written on hearts in the New Covenant."
    },
    {
      "pk": 16009030,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 30,
      "text": "\"You were patient with them for many years and warned them by Your Spirit through Your prophets, yet they would not listen. So You gave them into the hand of the peoples of the lands.\"",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>; <a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "The long-suffering patience of God is a recurring theme, anticipating Christ’s patience and forgiveness towards sinners."
    },
    {
      "pk": 16009031,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 31,
      "text": "\"Nevertheless, in Your great mercy, You did not make an end of them or abandon them, for You are a gracious and merciful God.\"",
      "links": "<a href='/AIV/19/103/8-10'>Ps. 103:8-10</a>",
      "comment": "God preserves a remnant, anticipating the continued lineage through which Christ would come."
    },
    {
      "pk": 16009032,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 32,
      "text": "\"Now therefore, our God—the great, mighty, and awesome God who keeps covenant and mercy—do not let all the hardship that has come upon us, upon our kings, our princes, our priests, our prophets, our ancestors, and all Your people, since the days of the kings of Assyria until this day, seem little before You.\"",
      "links": "<a href='/AIV/05/7/9'>Deut. 7:9</a>; <a href='/AIV/19/145/3'>Ps. 145:3</a>",
      "comment": "Reference to priests and prophets in historical context anticipates roles later fulfilled in the structure of Christian leadership."
    },
    {
      "pk": 16009033,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 33,
      "text": "\"In all that has happened to us, You have been just. You have acted faithfully, while we have done wrong.\"",
      "links": "<a href='/AIV/27/9/14'>Dan. 9:14</a>",
      "comment": "God’s justice is perfect, yet always paired with mercy—a balance taught by Christ."
    },
    {
      "pk": 16009034,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 34,
      "text": "\"Our kings, our princes, our priests, and our ancestors did not keep Your law or pay attention to Your commandments and warnings which You gave them.\"",
      "links": "<a href='/AIV/12/17/13'>2 Kings 17:13</a>",
      "comment": "The leadership’s continued disobedience sets the stage for Christ, the obedient King and eternal High Priest."
    },
    {
      "pk": 16009035,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 35,
      "text": "\"Even in their own kingdom, amid Your great goodness which You gave them, in the spacious and fertile land You set before them, they did not serve You or turn away from their evil deeds.\"",
      "links": "<a href='/AIV/19/78/11'>Ps. 78:11</a>",
      "comment": "Spiritual indifference despite blessing warns believers to respond to grace with faithful obedience."
    },
    {
      "pk": 16009036,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 36,
      "text": "\"Here we are today, slaves in the land that You gave our ancestors to eat its fruit and its bounty. Here we are, slaves in it!\"",
      "links": "<a href='/AIV/25/5/5'>Lam. 5:5</a>",
      "comment": "This recognition of exile is a call to repentance and restoration only fully achieved in the spiritual deliverance through Christ."
    },
    {
      "pk": 16009037,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 37,
      "text": "\"Its rich produce goes to the kings whom You have set over us because of our sins; they rule over our bodies and cattle as they please, and we are in great distress.\"",
      "links": "<a href='/AIV/23/1/7'>Isa. 1:7</a>",
      "comment": "Slavery to foreign rulers is both a literal and spiritual type, foreshadowing liberation from sin through the work of Christ."
    },
    {
      "pk": 16009038,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 9,
      "verse": 38,
      "text": "\"Because of all this, we make a firm covenant in writing; on the sealed document are the names of our leaders, Levites, and priests.\"",
      "links": "<a href='/AIV/16/10/1'>Neh. 10:1</a>",
      "comment": "The covenant renewal with formal seals and signatures emphasizes a lasting commitment, prefiguring the formal, visible initiation and vows in the life of the Church."
    }
  ],
  "translatedAt": "2025-12-24T04:50:20.231Z"
}