{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 9,
  "verses": [
    {
      "pk": 3909001,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 1,
      "text": "On the twenty-fourth day of this month, the people of Israel gathered, fasting and dressed in sackcloth, with dust on their heads.",
      "links": "<a href='/AIV/03/16/29'>Lev. 16:29</a>; <a href='/AIV/15/10/7'>Ezra 10:7</a>",
      "comment": "Fasting and wearing sackcloth are signs of repentance throughout the Old Testament (see Joel 2:12), expressing a deep sorrow for sin both personally and communally."
    },
    {
      "pk": 3909002,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 2,
      "text": "Those of Israelite descent separated themselves from all foreigners and stood to confess their sins and the wrongdoings of their fathers.",
      "links": "<a href='/AIV/03/16/30'>Lev. 16:30</a>; <a href='/AIV/15/9/1-2'>Ezra 9:1-2</a>",
      "comment": "Confession of sin—both personal and ancestral—points to the communal nature of faith and repentance. For protestants, note how the people openly confessed together, anticipating the practice of communal confession and intercession (<a href='/AIV/19/106/6'>Ps. 106:6</a>)."
    },
    {
      "pk": 3909003,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 3,
      "text": "They stood in their places and read from the Book of the Law of the LORD their God for a quarter of the day; for another quarter they made confession and worshipped the LORD their God.",
      "links": "<a href='/AIV/15/9/5'>Ezra 9:5</a>; <a href='/AIV/19/119/164'>Ps. 119:164</a>",
      "comment": "The rhythm of reading, confessing, and worshipping demonstrates a liturgical structure. The close tie between Scripture and confession has shaped Christian liturgy over centuries."
    },
    {
      "pk": 3909004,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 4,
      "text": "Jeshua, Bani, Kadmiel, Shebaniah, Bunni, Sherebiah, Bani, and Chenani stood on the Levites’ platform and cried out with loud voices to the LORD their God.",
      "links": "<a href='/AIV/04/3/6'>Num. 3:6</a>",
      "comment": "The Levites lead the congregation in prayer, emphasizing the role of ordained ministers in guiding communal worship."
    },
    {
      "pk": 3909005,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 5,
      "text": "Then the Levites—Jeshua, Kadmiel, Bani, Hashabneiah, Sherebiah, Hodiah, Shebaniah, and Pethahiah—said: 'Stand up and bless the LORD your God from everlasting to everlasting. Blessed be your glorious name, which is higher than all blessing and praise.'",
      "links": "<a href='/AIV/19/41/13'>Ps. 41:13</a>; <a href='/AIV/19/106/48'>Ps. 106:48</a>",
      "comment": "This echoes numerous psalms calling the people to bless God eternally. The concept 'from everlasting to everlasting' foreshadows eternal worship, seen in Revelation (<a href='/AIV/66/4/8-11'>Rev. 4:8-11</a>)."
    },
    {
      "pk": 3909006,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 6,
      "text": "You alone are the LORD. You made the heavens, the heavens of heavens and all their host, the earth and all that is on it, the seas and all that is in them. You preserve them all, and the heavenly host worships you.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/148/2-5'>Ps. 148:2-5</a>",
      "comment": "God as sole Creator is foundational. 'Heavens of heavens' intensifies the scope of God's creation. The theme of all creation worshipping God is fulfilled eschatologically (<a href='/AIV/66/5/13'>Rev. 5:13</a>)."
    },
    {
      "pk": 3909007,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 7,
      "text": "You are the LORD, the God who chose Abram and brought him out of Ur of the Chaldeans, and gave him the name Abraham.",
      "links": "<a href='/AIV/01/12/1'>Gen. 12:1</a>; <a href='/AIV/01/17/5'>Gen. 17:5</a>",
      "comment": "The divine calling and renaming of Abraham highlights God's initiative and personal relationship with his people."
    },
    {
      "pk": 3909008,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 8,
      "text": "You found his heart faithful before you, and made a covenant with him to give his offspring the land of the Canaanite, Hittite, Amorite, Perizzite, Jebusite, and Girgashite. And you have kept your promise, for you are righteous.",
      "links": "<a href='/AIV/01/15/18'>Gen. 15:18</a>; <a href='/AIV/06/21/45'>Josh. 21:45</a>",
      "comment": "God’s faithfulness to his promises to Abraham is a recurring theme. The concept of covenant prefigures New Testament fulfillment in Christ (<a href='/AIV/48/3/16'>Gal. 3:16</a>)."
    },
    {
      "pk": 3909009,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 9,
      "text": "You saw the affliction of our ancestors in Egypt and heard their cry at the Red Sea.",
      "links": "<a href='/AIV/02/3/7'>Exod. 3:7</a>; <a href='/AIV/02/14/10'>Exod. 14:10</a>",
      "comment": "The Exodus is central to Israel’s identity. God hears and acts for the suffering, a motif later fulfilled in Christ’s deliverance (<a href='/AIV/40/2/18'>Matt. 2:18</a>)."
    },
    {
      "pk": 3909010,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 10,
      "text": "You performed signs and wonders against Pharaoh and all his servants and all the people of his land, for you knew how they acted arrogantly against our ancestors. You made a name for yourself that remains to this day.",
      "links": "<a href='/AIV/02/7/5'>Exod. 7:5</a>; <a href='/AIV/19/135/8-9'>Ps. 135:8-9</a>",
      "comment": "The demonstration of power in Exodus is mirrored in the miracles of Christ and apostolic authority (<a href='/AIV/44/2/22'>Acts 2:22</a>)."
    },
    {
      "pk": 3909011,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 11,
      "text": "You divided the sea before them, so that they passed through the midst on dry ground, but you hurled their pursuers into the depths like a stone into mighty waters.",
      "links": "<a href='/AIV/02/14/21-28'>Exod. 14:21-28</a>; <a href='/AIV/19/106/9-11'>Ps. 106:9-11</a>",
      "comment": "The victory at the Red Sea is a primary symbol of salvation—often seen as typological of baptism and deliverance in Christ."
    },
    {
      "pk": 3909012,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 12,
      "text": "By day you led them with a pillar of cloud, and by night with a pillar of fire, to light for them the way in which they should go.",
      "links": "<a href='/AIV/02/13/21'>Exod. 13:21</a>; <a href='/AIV/03/9/15-23'>Lev. 9:15-23</a>",
      "comment": "God's guidance through tangible signs foreshadows the work of the Holy Spirit, guiding the Church."
    },
    {
      "pk": 3909013,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 13,
      "text": "You came down on Mount Sinai and spoke with them from heaven and gave them just ordinances, true laws, good statutes and commandments.",
      "links": "<a href='/AIV/02/19/18-25'>Exod. 19:18-25</a>",
      "comment": "The Sinai theophany foreshadows the incarnation—God drawing near to reveal his will directly."
    },
    {
      "pk": 3909014,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 14,
      "text": "You made known to them your holy Sabbath and commanded them commandments, statutes, and law through your servant Moses.",
      "links": "<a href='/AIV/02/20/8-11'>Exod. 20:8-11</a>; <a href='/AIV/03/23/3'>Lev. 23:3</a>",
      "comment": "Notice the importance of Sabbath. The transmission of law through Moses anticipates authoritative teaching offices."
    },
    {
      "pk": 3909015,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 15,
      "text": "You gave them bread from heaven for their hunger, and brought water out of the rock for their thirst. You told them to go in to possess the land you had sworn to give them.",
      "links": "<a href='/AIV/02/16/4'>Exod. 16:4</a>; <a href='/AIV/04/20/8'>Num. 20:8</a>",
      "comment": "The manna and water typify divine provision; in John 6, Jesus alludes to himself as true bread from heaven (<a href='/AIV/43/6/31-35'>John 6:31-35</a>)."
    },
    {
      "pk": 3909016,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 16,
      "text": "But they and our ancestors acted arrogantly and stiffened their necks, and did not obey your commandments.",
      "links": "<a href='/AIV/02/32/9'>Exod. 32:9</a>; <a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Stiff-neckedness is Old Testament shorthand for persistent rebellion, underlining the need for grace and transformation."
    },
    {
      "pk": 3909017,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 17,
      "text": "They refused to listen and did not remember the wonders you performed among them. They stiffened their necks and appointed a leader to return to their slavery in Egypt. But you are a God ready to forgive, gracious and merciful, slow to anger and abundant in steadfast love, and did not forsake them.",
      "links": "<a href='/AIV/02/34/6'>Exod. 34:6</a>; <a href='/AIV/04/14/4'>Num. 14:4</a>",
      "comment": "This declaration of God's mercy is echoed in numerous psalms and is central to the gospel message."
    },
    {
      "pk": 3909018,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 18,
      "text": "Even when they made for themselves a golden calf and said, 'This is your god who brought you up out of Egypt,' and committed great blasphemies,",
      "links": "<a href='/AIV/02/32/4'>Exod. 32:4</a>",
      "comment": "The golden calf represents idolatry, a constant temptation; the New Testament links this to spiritual idolatry in the heart (<a href='/AIV/46/10/7'>1 Cor. 10:7</a>)."
    },
    {
      "pk": 3909019,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 19,
      "text": "You in your great compassion did not forsake them in the wilderness. The pillar of cloud did not leave them by day to guide, nor the pillar of fire by night to light the way they should travel.",
      "links": "<a href='/AIV/04/9/17-23'>Num. 9:17-23</a>",
      "comment": "God's enduring presence, despite sin, points to his faithfulness—prefiguring Christ’s promise to never forsake his people (<a href='/AIV/40/28/20'>Matt. 28:20</a>)."
    },
    {
      "pk": 3909020,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 20,
      "text": "You gave your good Spirit to instruct them. You did not withhold your manna from their mouths and gave them water for their thirst.",
      "links": "<a href='/AIV/16/9/15'>Nehemiah 9:15</a>; <a href='/AIV/04/20/11'>Num. 20:11</a>",
      "comment": "The giving of the Spirit is a rare Old Testament reference, highlighting that God’s guidance is both external and internal."
    },
    {
      "pk": 3909021,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 21,
      "text": "Forty years you sustained them in the wilderness; they lacked nothing. Their clothes did not wear out and their feet did not swell.",
      "links": "<a href='/AIV/05/8/4'>Deut. 8:4</a>; <a href='/AIV/05/29/5'>Deut. 29:5</a>",
      "comment": "Miraculous provision underscores God’s total care, touching even bodily needs."
    },
    {
      "pk": 3909022,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 22,
      "text": "You gave them kingdoms and peoples, and allotted them every corner. So they took possession of the land of Sihon king of Heshbon and the land of Og king of Bashan.",
      "links": "<a href='/AIV/04/21/24-35'>Num. 21:24-35</a>",
      "comment": "God’s sovereignty in giving lands points to his authority over all nations. See also Joshua’s conquest."
    },
    {
      "pk": 3909023,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 23,
      "text": "You multiplied their descendants as the stars of heaven, and brought them into the land which you had promised to their ancestors that they should enter and possess.",
      "links": "<a href='/AIV/01/15/5'>Gen. 15:5</a>; <a href='/AIV/06/1/2'>Josh. 1:2</a>",
      "comment": "God’s promise to Abraham is seen here in its literal fulfillment, reinforcing his fidelity."
    },
    {
      "pk": 3909024,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 24,
      "text": "So their descendants went in and possessed the land. You subdued before them the inhabitants of the land, the Canaanites, and gave them into their hands, with their kings and the peoples of the land, that they might do with them as they pleased.",
      "links": "<a href='/AIV/06/11/23'>Josh. 11:23</a>",
      "comment": "Conquest of Canaan is a fulfillment of the promise, but also points toward the tension of judgment and mercy."
    },
    {
      "pk": 3909025,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 25,
      "text": "And they captured strong cities and fertile land, took possession of houses filled with every good thing, cisterns already dug, vineyards, olive orchards, and fruit trees in abundance. They ate, were filled, and became fat, and delighted themselves in your great goodness.",
      "links": "<a href='/AIV/05/6/10-11'>Deut. 6:10-11</a>",
      "comment": "Material blessings are described as gifts from God; spiritual prosperity is tied to physical blessings."
    },
    {
      "pk": 3909026,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 26,
      "text": "Nevertheless they were disobedient and rebelled against you. They cast your law behind their backs and killed your prophets who warned them in order to turn them back to you. And they committed great blasphemies.",
      "links": "<a href='/AIV/11/19/10'>1 Kings 19:10</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "Persecution of prophets anticipates rejection of Christ. Compare the lament in Matthew 23."
    },
    {
      "pk": 3909027,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 27,
      "text": "Therefore you gave them into the hands of their enemies, who oppressed them. And in the time of their distress, they cried out to you, and you heard from heaven. According to your great compassion you delivered them many times.",
      "links": "<a href='/AIV/07/2/16-19'>Judg. 2:16-19</a>",
      "comment": "Repeated cycles of sin, punishment, repentance, and deliverance highlight God’s enduring mercy."
    },
    {
      "pk": 3909028,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 28,
      "text": "But as soon as they had relief, they again did evil before you, and you abandoned them to the hand of their enemies, so that they had dominion over them. Yet, when they turned and cried to you, you heard from heaven, and many times you rescued them according to your compassion.",
      "links": "<a href='/AIV/19/106/43-44'>Ps. 106:43-44</a>",
      "comment": "Persistent failure is never met with utter rejection; God's mercy endures. This cycle shows the need for lasting transformation."
    },
    {
      "pk": 3909029,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 29,
      "text": "You warned them, in order to turn them back to your law. But they acted arrogantly and did not obey your commandments, but sinned against your rules, which if a person does, he shall live by them. They turned a stubborn shoulder and stiffened their neck and would not listen.",
      "links": "<a href='/AIV/03/18/5'>Lev. 18:5</a>; <a href='/AIV/26/20/11'>Ezek. 20:11</a>",
      "comment": "'If a person does, he shall live by them' echoes the principle of obedience leading to life, which Paul later reinterprets in the context of faith in Christ (<a href='/AIV/48/3/12'>Gal. 3:12</a>)."
    },
    {
      "pk": 3909030,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 30,
      "text": "Many years you bore with them and warned them by your Spirit through your prophets, yet they would not listen. Therefore you gave them into the hands of the peoples of the lands.",
      "links": "<a href='/AIV/12/17/13'>2 Kings 17:13</a>; <a href='/AIV/26/11/5'>Ezek. 11:5</a>",
      "comment": "Divine patience and prophetic ministry are crucial in God’s redemptive story."
    },
    {
      "pk": 3909031,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 31,
      "text": "Nevertheless, in your great mercies you did not make an end of them or forsake them, for you are gracious and merciful.",
      "links": "<a href='/AIV/25/3/22'>Lam. 3:22</a>",
      "comment": "Though judgment comes, God’s covenant love endures. The phrase 'did not make an end' emphasizes perpetual hope."
    },
    {
      "pk": 3909032,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 32,
      "text": "Now therefore, our God—the great, the mighty, and the awesome God, who keeps covenant and steadfast love—do not let the hardships seem too little to you that have come upon us, our kings, our rulers, our priests, our prophets, our ancestors, and all your people, from the time of the kings of Assyria to this day.",
      "links": "<a href='/AIV/05/7/9'>Deut. 7:9</a>; <a href='/AIV/19/89/49'>Ps. 89:49</a>",
      "comment": "The mention of 'priests, prophets, rulers, and kings' affirms structured leadership under God’s covenant—consider the necessity of visible, ordered authority."
    },
    {
      "pk": 3909033,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 33,
      "text": "Yet you have been righteous in all that has come upon us, for you have acted faithfully, while we have acted wickedly.",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "Confession of sin and affirmation of God’s justice is foundational to true repentance."
    },
    {
      "pk": 3909034,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 34,
      "text": "Our kings, our rulers, our priests, and our ancestors have not kept your law or paid attention to your commandments and your warnings that you gave them.",
      "links": "<a href='/AIV/14/36/14-16'>2 Chron. 36:14-16</a>",
      "comment": "National sin is acknowledged at every level, emphasizing the need for restoration both individually and communally."
    },
    {
      "pk": 3909035,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 35,
      "text": "Even in their own kingdom, enjoying your great goodness that you gave them, and in the spacious and fertile land you set before them, they did not serve you or turn from their evil deeds.",
      "links": "<a href='/AIV/05/8/7-14'>Deut. 8:7-14</a>",
      "comment": "Prosperity can be a test of faith; their failure reminds us to receive blessings as occasions for gratitude and service."
    },
    {
      "pk": 3909036,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 36,
      "text": "Behold, we are slaves today, slaves in the land that you gave to our ancestors to eat its fruit and its goodness. Behold, we are slaves in it.",
      "links": "<a href='/AIV/25/5/1-2'>Lam. 5:1-2</a>",
      "comment": "Despite occupying the land, they experience bondage—a call to spiritual as well as physical renewal."
    },
    {
      "pk": 3909037,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 37,
      "text": "Its abundant produce goes to the kings whom you have set over us because of our sins. They rule over our bodies and our livestock as they please, and we are in great distress.",
      "links": "<a href='/AIV/05/28/33'>Deut. 28:33</a>",
      "comment": "The consequences of sin are not only spiritual but practical, impacting every area of life—not unlike warnings in later scripture about the wages of sin (<a href='/AIV/45/6/23'>Rom. 6:23</a>)."
    },
    {
      "pk": 3909038,
      "translation": "AIV",
      "book": 16,
      "chapter": 9,
      "verse": 38,
      "text": "And because of all this, we make a firm covenant in writing; on the sealed document are the names of our leaders, Levites, and priests.",
      "links": "<a href='/AIV/16/10/1'>Neh. 10:1</a>",
      "comment": "The written covenant underscores the importance of ritual, commitment, and visible signs of faith—concepts that find a deeper spiritual application in the sacraments and the body of Christ."
    }
  ],
  "translatedAt": "2025-12-23T04:38:30.789Z"
}