{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 8,
  "verses": [
    {
      "pk": 3508101,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 1,
      "text": "And all the people gathered as one man into the square in front of the Water Gate. They told Ezra the scribe to bring the Book of the Law of Moses that the Lord had commanded Israel.",
      "links": "<a href='/AIV/03/23/3'>Lev. 23:3</a>; <a href='/AIV/05/31/11'>Deut. 31:11–13</a>",
      "comment": "An emphasis on communal worship and obedience to God's Law. This public reading reflects the united desire of the people to reconnect with the covenant. This gathering prefigures the later pattern of public worship and Scripture reading in the church."
    },
    {
      "pk": 3508102,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 2,
      "text": "So Ezra the priest brought the Law before the assembly, both men and women and all who could understand, on the first day of the seventh month.",
      "links": "<a href='/AIV/03/23/24'>Lev. 23:24</a>",
      "comment": "Notice the Law is presented to all who are able to understand—not just men, but women and older children, stressing the broad inclusion of the faithful in spiritual instruction."
    },
    {
      "pk": 3508103,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 3,
      "text": "He read from it in the open square that was in front of the Water Gate from early morning until midday, in the presence of the men, the women, and those who could understand; and the ears of all the people were attentive to the Book of the Law.",
      "links": "<a href='/AIV/15/7/6'>Ezra 7:6</a>",
      "comment": "The long public reading and attentive audience highlight the hunger for God's Word. This pattern echoes the later liturgical readings in Christian worship."
    },
    {
      "pk": 3508104,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 4,
      "text": "Ezra the scribe stood on a wooden platform that they had made for the purpose. Beside him stood Mattithiah, Shema, Anaiah, Uriah, Hilkiah, and Maaseiah on his right hand; and on his left, Pedaiah, Mishael, Malchijah, Hashum, Hashbadana, Zechariah, and Meshullam.",
      "links": "",
      "comment": "The construction of a platform for the public proclamation of Scripture points to the dignity given to God's Word, paralleling later traditions of reading from an elevated place during the liturgy."
    },
    {
      "pk": 3508105,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 5,
      "text": "Ezra opened the book in the sight of all the people, for he was above all the people; and as he opened it, all the people stood up.",
      "links": "",
      "comment": "Standing for the reading of Scripture shows reverence, a practice that continues in many Christian traditions."
    },
    {
      "pk": 3508106,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 6,
      "text": "Ezra blessed the Lord, the great God, and all the people answered, \"Amen, Amen,\" lifting up their hands. Then they bowed down and worshiped the Lord with their faces to the ground.",
      "links": "<a href='/AIV/19/134/2'>Ps. 134:2</a>; <a href='/AIV/19/95/6'>Ps. 95:6</a>",
      "comment": "The response of 'Amen' and gestures of worship demonstrate a deeply participatory and physical form of worship—prefiguring the universal call to active and reverent participation in church liturgy."
    },
    {
      "pk": 3508107,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 7,
      "text": "Jeshua, Bani, Sherebiah, Jamin, Akkub, Shabbethai, Hodiah, Maaseiah, Kelita, Azariah, Jozabad, Hanan, Pelaiah, and the Levites helped the people understand the Law, while the people remained in their places.",
      "links": "<a href='/AIV/05/33/10'>Deut. 33:10</a>",
      "comment": "Levites assisting in interpretation demonstrates the authoritative role of ordained ministers in communicating and safeguarding the meaning of Scripture."
    },
    {
      "pk": 3508108,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 8,
      "text": "They read from the book, from the Law of God, clearly; and gave the sense, so that the people understood the reading.",
      "links": "<a href='/AIV/09/3/2'>1 Sam. 3:2</a>",
      "comment": "The distinction between reading and interpretation suggests Scripture requires authoritative explanation to be rightly understood—a pattern that continues in the tradition of homilies."
    },
    {
      "pk": 3508109,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 9,
      "text": "Nehemiah, who was the governor, and Ezra the priest and scribe, and the Levites who taught the people, said to all the people, \"This day is holy to the Lord your God; do not mourn or weep.\" For all the people wept when they heard the words of the Law.",
      "links": "<a href='/AIV/03/23/24'>Lev. 23:24</a>; <a href='/AIV/26/9/8'>Ezek. 9:8</a>",
      "comment": "Hearing the Law leads to sorrow for sin—echoing the need for repentance and confession, but also the encouragement to rejoice in God's mercy."
    },
    {
      "pk": 3508110,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 10,
      "text": "Then he said to them, \"Go your way, eat the fat and drink sweet wine and send portions to him who has nothing prepared, for this day is holy to our Lord; and do not be grieved, for the joy of the Lord is your strength.\"",
      "links": "<a href='/AIV/05/16/14'>Deut. 16:14</a>; <a href='/AIV/19/28/7'>Ps. 28:7</a>",
      "comment": "This verse links holiness and joy, underscoring the communal celebration and provision for the needy—a prefiguration of shared feasts and fellowship."
    },
    {
      "pk": 3508111,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 11,
      "text": "So the Levites quieted all the people, saying, \"Be still, for the day is holy; do not be grieved.\"",
      "links": "",
      "comment": "The Levites act as spiritual mediators, guiding the people's response. Their authority is respected and shows the enduring importance of spiritual leaders in worship."
    },
    {
      "pk": 3508112,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 12,
      "text": "And all the people went away to eat and drink and send portions and to make great rejoicing, because they had understood the words that were declared to them.",
      "links": "<a href='/AIV/05/16/14'>Deut. 16:14</a>",
      "comment": "Joy is rooted in an encounter with God's Word, not merely material celebration. Sharing portions reflects a spirit of unity and charity."
    },
    {
      "pk": 3508113,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 13,
      "text": "On the second day the heads of fathers' houses of all the people, with the priests and Levites, came together to Ezra the scribe in order to study the words of the Law.",
      "links": "",
      "comment": "Ongoing catechesis is emphasized as family heads, priests, and Levites continue learning together. The model underscores the value of regular deeper study, especially among community leaders."
    },
    {
      "pk": 3508114,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 14,
      "text": "They found written in the Law that the Lord had commanded by Moses that the people of Israel should dwell in booths during the feast of the seventh month,",
      "links": "<a href='/AIV/03/23/42-43'>Lev. 23:42–43</a>",
      "comment": "The leaders' discovery and obedience to the command regarding the festival show the ongoing necessity of reading the Scriptures and practicing the traditions handed down through the generations."
    },
    {
      "pk": 3508115,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 15,
      "text": "and that they should proclaim it and publish it in all their towns and in Jerusalem, \"Go out to the hill country and bring branches of olive, wild olive, myrtle, palm, and other leafy trees to make booths, as it is written.\"",
      "links": "<a href='/AIV/03/23/4-43'>Lev. 23:4–43</a>",
      "comment": "Proclamation and obedience go hand in hand. Faithfulness to detail in observing the command reflects the value of holding to tradition alongside Scripture."
    },
    {
      "pk": 3508116,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 16,
      "text": "So the people went out and brought them and made booths for themselves, each on his roof, and in their courts, and in the courts of the house of God, and in the square at the Water Gate, and in the square at the Gate of Ephraim.",
      "links": "<a href='/AIV/03/23/40-42'>Lev. 23:40–42</a>",
      "comment": "The booths assembled throughout the city symbolize unity and participation as one people under God—a visible, communal witness of faith."
    },
    {
      "pk": 3508117,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 17,
      "text": "And all the assembly of those who had returned from the captivity made booths and lived in the booths, for since the days of Joshua the son of Nun to that day the people of Israel had not done so. And there was very great rejoicing.",
      "links": "<a href='/AIV/06/1/1'>Josh. 1:1</a>",
      "comment": "This restoration of a neglected tradition led to renewed joy. The return to the fullness of prescribed worship indicates the blessings of lovingly practicing all that God has revealed, both in Scripture and through continuing tradition."
    },
    {
      "pk": 3508118,
      "translation": "AIV",
      "book": 16,
      "chapter": 8,
      "verse": 18,
      "text": "And day by day, from the first day to the last, he read from the Book of the Law of God. They kept the feast seven days, and on the eighth day there was a solemn assembly, according to the rule.",
      "links": "<a href='/AIV/03/23/36'>Lev. 23:36</a>; <a href='/AIV/04/29/35'>Num. 29:35</a>",
      "comment": "Daily reading of the Law and the climactic solemn gathering on the eighth day foreshadow regular, rhythmic worship culminating in special celebrations. This anticipates the pattern of weekly worship followed by a solemn, communal feast—pointing ultimately to the Christian liturgical life centered around God's Word and the breaking of bread."
    }
  ],
  "translatedAt": "2025-12-23T04:37:49.981Z"
}