{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 13,
  "verses": [
    {
      "pk": 21001301,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 1,
      "text": "On that day, the Book of Moses was read aloud in the hearing of the people, and it was found written that no Ammonite or Moabite should ever enter the assembly of God.",
      "links": "<a href='/AIV/5/23/3-6'>Deut. 23:3–6</a>",
      "comment": "The restriction comes from Deuteronomy, emphasizing the purity of worship and community. The intense interpretation of separation underlines the continuity of Israelite tradition and discipline."
    },
    {
      "pk": 21001302,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 2,
      "text": "For they did not meet the Israelites with bread and water, but hired Balaam against them to curse them—yet our God turned the curse into a blessing.",
      "links": "<a href='/AIV/4/22/5-6'>Num. 22:5–6</a>; <a href='/AIV/4/23/8-11'>Num. 23:8–11</a>",
      "comment": "This recounts historical opposition, but also God's power to transform evil intentions into blessing—pointing forward to the redemptive work in Christ (see Rom. 8:28)."
    },
    {
      "pk": 21001303,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 3,
      "text": "When they heard the law, they separated all those of foreign descent from Israel.",
      "links": "<a href='/AIV/10/6/17-19'>Ezra 6:17–19</a>",
      "comment": "Obedience to the law resulted in renewed separation. This act of purification spiritually parallels the call to holiness in the New Testament (2 Cor. 6:17)."
    },
    {
      "pk": 21001304,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 4,
      "text": "Now before this, Eliashib the priest, appointed over the chambers of the house of our God, and related to Tobiah,",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>; <a href='/AIV/16/3/1'>Neh. 3:1</a>",
      "comment": "Eliashib's connection to Tobiah represents a problematic blending of spiritual authority and compromise—note the warning about undue influence within the leadership."
    },
    {
      "pk": 21001305,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 5,
      "text": "had prepared for Tobiah a large room, where they had previously stored the grain offerings, frankincense, the vessels, and the tithes of grain, wine, and oil reserved for the priests, the Levites, and the singers, and the contributions for the gatekeepers.",
      "links": "<a href='/AIV/3/2/2'>Lev. 2:2</a>; <a href='/AIV/16/12/44'>Neh. 12:44</a>",
      "comment": "The sacred space was repurposed for personal interest, highlighting the danger of neglecting worship and stewardship. The sanctity of God’s house remains foundational—for Christians, this foreshadows reverence in places set apart for worship."
    },
    {
      "pk": 21001306,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 6,
      "text": "But while all this was happening, I was not in Jerusalem, for in the thirty-second year of Artaxerxes king of Babylon, I had gone back to the king. Then, after some time, I requested leave from the king",
      "links": "<a href='/AIV/16/2/6'>Neh. 2:6</a>",
      "comment": "Nehemiah’s absence allowed corruption to creep in; his accountability and subsequent intervention model righteous leadership that safeguards worship and community integrity."
    },
    {
      "pk": 21001307,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 7,
      "text": "and I returned to Jerusalem and discovered the evil that Eliashib had done for Tobiah, preparing a room for him in the courts of the house of God.",
      "links": "<a href='/AIV/40/21/12-13'>Matt. 21:12–13</a>",
      "comment": "Nehemiah’s swift response mirrors Christ’s cleansing of the temple, emphasizing the seriousness of safeguarding sacred spaces from unholy influence."
    },
    {
      "pk": 21001308,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 8,
      "text": "I was greatly displeased, and I threw all of Tobiah’s household goods out of the room.",
      "links": "<a href='/AIV/40/21/12'>Matt. 21:12</a>; <a href='/AIV/43/2/15'>John 2:15</a>",
      "comment": "Physical cleansing of the space represents the call to spiritual purity. Christ’s actions in the temple echo this zeal for the sanctity of worship."
    },
    {
      "pk": 21001309,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 9,
      "text": "Then I commanded them to cleanse the rooms, and I brought back the vessels of the house of God, along with the grain offering and the frankincense.",
      "links": "<a href='/AIV/3/2/2'>Lev. 2:2</a>",
      "comment": "Restoration of sacred elements and offerings signals repentance and renewal, symbolizing liturgical order and reverence carried forward into Christian worship traditions."
    },
    {
      "pk": 21001310,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 10,
      "text": "I also discovered that the portions for the Levites had not been given to them, so that the Levites and singers, who did the work, had gone back to their own fields.",
      "links": "<a href='/AIV/4/18/21'>Num. 18:21</a>",
      "comment": "Neglect of the ministers of God’s house resulted in their withdrawal—emphasizing the necessity for the faithful support of spiritual leaders."
    },
    {
      "pk": 21001311,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 11,
      "text": "So I confronted the officials and asked, 'Why has the house of God been neglected?' Then I gathered the Levites and singers and restored them to their posts.",
      "links": "<a href='/AIV/16/10/39'>Neh. 10:39</a>",
      "comment": "Direct action and restoration of ministerial service recall apostolic concerns for order and pastoral care in the early church (see Acts 6:2–4)."
    },
    {
      "pk": 21001312,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 12,
      "text": "Then all Judah brought the tithe of grain, wine, and oil into the storehouses.",
      "links": "<a href='/AIV/3/27/30'>Lev. 27:30</a>; <a href='/AIV/16/10/37'>Neh. 10:37</a>",
      "comment": "Renewed commitment to tithing and offering signals repentance. See the spiritual principle in Malachi 3:10—reminding believers of the connection between faithfulness in offering and blessing."
    },
    {
      "pk": 21001313,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 13,
      "text": "I appointed as treasurers over the storehouses Shelemiah the priest, Zadok the scribe, and a Levite named Pedaiah, and next to them Hanan son of Zaccur, son of Mattaniah; for they were considered trustworthy. Their task was to distribute to their brothers.",
      "links": "<a href='/AIV/16/12/13'>Neh. 12:13</a>",
      "comment": "The appointment of trustworthy administrators reflects the importance of integrity in handling offerings."
    },
    {
      "pk": 21001314,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 14,
      "text": "Remember me for this, my God, and do not wipe out my good deeds that I have done for the house of my God and its services.",
      "links": "<a href='/AIV/19/20/1-3'>Ps. 20:1–3</a>",
      "comment": "Nehemiah appeals to God’s remembrance of his works—a spiritual principle echoed in the reward for faithfulness (see Heb. 6:10)."
    },
    {
      "pk": 21001315,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 15,
      "text": "In those days I saw in Judah people treading winepresses on the Sabbath, bringing in sheaves, loading donkeys with wine, grapes, figs, and all kinds of loads, which they brought into Jerusalem on the Sabbath day. So I testified against them on the day they sold food.",
      "links": "<a href='/AIV/2/20/8-10'>Ex. 20:8–10</a>",
      "comment": "Neglect of Sabbath observance reveals a deeper spiritual forgetfulness; Sabbath is set apart as sacred, underscoring the necessity of rest and worship in obedience to God. See spiritual significance in Heb. 4:9."
    },
    {
      "pk": 21001316,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 16,
      "text": "Men from Tyre who lived there also brought in fish and all kinds of merchandise and sold them on the Sabbath to the people of Judah, in Jerusalem itself.",
      "links": "<a href='/AIV/11/9/26-28'>1 Kings 9:26–28</a>",
      "comment": "Foreign traders added to disregard of Sabbath, revealing social and economic pressures against holiness."
    },
    {
      "pk": 21001317,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 17,
      "text": "Then I rebuked the nobles of Judah and said to them, 'What evil thing is this that you do, profaning the Sabbath day?'",
      "links": "<a href='/AIV/23/56/2'>Isa. 56:2</a>",
      "comment": "Faithful leadership calls out spiritual compromise. Upkeeping sacred time anticipates the discipline and structure of Christian worship."
    },
    {
      "pk": 21001318,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 18,
      "text": "Did not your ancestors do the same things, so that our God brought all this disaster on us and on this city? Now you are bringing even more wrath upon Israel by profaning the Sabbath.",
      "links": "<a href='/AIV/24/17/27'>Jer. 17:27</a>",
      "comment": "Nehemiah warns of repeating past sins. The cyclical nature of sin and judgment underscores the need for renewal—echoed in the Christian call for continual conversion and holiness."
    },
    {
      "pk": 21001319,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 19,
      "text": "When it began to grow dark at the gates of Jerusalem before the Sabbath, I commanded that the doors be shut and ordered that they not be opened until after the Sabbath. And I posted some of my servants at the gates, so that no load might be brought in on the Sabbath day.",
      "links": "<a href='/AIV/16/7/3'>Neh. 7:3</a>",
      "comment": "Enforcing Sabbath discipline shows the necessity of boundaries to preserve holiness. The act prefigures the safeguarding of sacred times and liturgy."
    },
    {
      "pk": 21001320,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 20,
      "text": "Then the merchants and sellers of every kind of merchandise spent the night outside Jerusalem once or twice.",
      "links": "",
      "comment": "External pressure to violate sacred practice continues, showing that holiness involves resisting worldly influence."
    },
    {
      "pk": 21001321,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 21,
      "text": "But I warned them and said to them, 'Why do you spend the night by the wall? If you do it again, I will lay hands on you.' From that time they did not come on the Sabbath.",
      "links": "",
      "comment": "Firm leadership stops compromise. Boundary keeping in worship life remains essential for spiritual fruitfulness."
    },
    {
      "pk": 21001322,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 22,
      "text": "Then I commanded the Levites to purify themselves and to come and guard the gates, to keep the Sabbath holy. Remember me for this also, my God, and show me mercy according to your steadfast love.",
      "links": "<a href='/AIV/19/51/7'>Ps. 51:7</a>",
      "comment": "Purification and mercy are paired—Nehemiah seeks both ritual cleansing and God’s compassion. The spiritual sense anticipates forgiveness and purification in Christ."
    },
    {
      "pk": 21001323,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 23,
      "text": "Also in those days, I saw Jews who had married women of Ashdod, Ammon, and Moab;",
      "links": "<a href='/AIV/16/10/30'>Neh. 10:30</a>",
      "comment": "Intermarriage led to dilution of faith and practice. The literal concern for purity also admits a spiritual interpretation—a call to preserve faith from syncretism."
    },
    {
      "pk": 21001324,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 24,
      "text": "and half of their children spoke the language of Ashdod and could not speak the Jewish language, but only the language of the other people.",
      "links": "",
      "comment": "Loss of language reflects loss of tradition and identity. Learning and handing down liturgy remain vital in the faith."
    },
    {
      "pk": 21001325,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 25,
      "text": "So I confronted them and cursed them, beat some of their men and pulled out their hair. I made them swear by God, saying, 'You shall not give your daughters to their sons or take their daughters for your sons or for yourselves.'",
      "links": "<a href='/AIV/5/7/3'>Deut. 7:3</a>",
      "comment": "Harsh discipline illustrates the seriousness of spiritual compromise. Zeal for purity underlines the gravity of apostasy, paralleling exhortations in 2 Cor. 6:14."
    },
    {
      "pk": 21001326,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 26,
      "text": "'Did not Solomon king of Israel sin because of these women? Among many nations there was no king like him; he was loved by his God, and God made him king over all Israel. But even he was led into sin by foreign women.'",
      "links": "<a href='/AIV/11/11/1-8'>1 Kings 11:1–8</a>",
      "comment": "Solomon’s failure despite his wisdom and divine favor serves as a warning. Even the greatest can fall due to compromise in faith and practice."
    },
    {
      "pk": 21001327,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 27,
      "text": "Shall we then hear that you are doing all this great evil, acting unfaithfully toward our God by marrying foreign women?",
      "links": "",
      "comment": "Nehemiah warns that spiritual fidelity is non-negotiable. Purity of worship and faith is placed above social or political convenience."
    },
    {
      "pk": 21001328,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 28,
      "text": "And one of the sons of Joiada, son of Eliashib the high priest, was the son-in-law of Sanballat the Horonite. So I chased him away from me.",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>",
      "comment": "Compromise within leadership is met with strong discipline, foreshadowing the safeguarding of apostolic succession and the integrity of leadership in the church."
    },
    {
      "pk": 21001329,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 29,
      "text": "Remember them, my God, because they have defiled the priesthood and the covenant of the priesthood and the Levites.",
      "links": "<a href='/AIV/4/25/13'>Num. 25:13</a>",
      "comment": "Nehemiah intercedes regarding defilement of sacred office. This anticipates later emphasis on the discipline and consecration of clergy and those entrusted with holy things."
    },
    {
      "pk": 21001330,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 30,
      "text": "Thus I cleansed them from everything foreign, and I assigned duties to the priests and Levites, each to his task;",
      "links": "<a href='/AIV/3/8/30'>Lev. 8:30</a>",
      "comment": "Restoration of order and assignment of duties parallels later models of church governance, marking the importance of sacred order and distinction."
    },
    {
      "pk": 21001331,
      "translation": "AIV",
      "book": 16,
      "chapter": 13,
      "verse": 31,
      "text": "and provided for the wood offering at appointed times, and for the firstfruits. Remember me, my God, for good.",
      "links": "<a href='/AIV/3/6/12'>Lev. 6:12</a>; <a href='/AIV/16/10/34-35'>Neh. 10:34–35</a>",
      "comment": "Proper provision for offerings and firstfruits closes Nehemiah’s reforms. His prayer for remembrance highlights the enduring value of faithful service. Trust in God’s mercy and reward echoes New Testament teachings on perseverance and reward (see Heb. 10:35–36)."
    }
  ],
  "translatedAt": "2025-12-23T04:41:05.031Z"
}