{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 5,
  "verses": [
    {
      "pk": 4005001,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 1,
      "text": "Now there was a great outcry of the people and their wives against their Jewish brothers.",
      "links": "<a href='/AIV/02/3/7'>Exod. 3:7</a>; <a href='/AIV/16/4/7-8'>Neh. 4:7-8</a>",
      "comment": "Verse 1 sets the stage for a social issue among the returned exiles. The word 'outcry' echoes the cries for justice heard in Egypt."
    },
    {
      "pk": 4005002,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 2,
      "text": "For there were some who said, 'We, our sons, and our daughters are many. Therefore, let us get grain, so that we may eat and live.'",
      "links": "<a href='/AIV/01/41/55'>Gen. 41:55</a>; <a href='/AIV/02/16/3'>Exod. 16:3</a>",
      "comment": "The people's need for survival reflects themes from earlier scriptures where famine leads to desperate pleas for food."
    },
    {
      "pk": 4005003,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 3,
      "text": "There were also some who said, 'We have mortgaged our fields, our vineyards, and our houses just so we may buy grain because of the famine.'",
      "links": "<a href='/AIV/03/25/35-38'>Lev. 25:35-38</a>; <a href='/AIV/12/4/1-7'>2 Kgs. 4:1-7</a>",
      "comment": "Reference to mortgaging land connects back to Levitical laws protecting the poor."
    },
    {
      "pk": 4005004,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 4,
      "text": "And others said, 'We have borrowed money on our fields and vineyards to pay the king’s tax.'",
      "links": "<a href='/AIV/15/4/13'>Ezra 4:13</a>",
      "comment": "Persian taxation was heavy on the returned exiles, adding to their hardship."
    },
    {
      "pk": 4005005,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 5,
      "text": "Yet now our flesh is like the flesh of our brothers, our children as their children. But we are forcing our sons and our daughters into bondage. Some of our daughters have already been enslaved, and we have no power to redeem them, for others own our fields and our vineyards.",
      "links": "<a href='/AIV/03/25/39-42'>Lev. 25:39-42</a>; <a href='/AIV/02/21/7'>Exod. 21:7</a>",
      "comment": "Enslavement for debt was forbidden among the Israelites; spiritual sense points to Christ as redeemer who frees us from bondage."
    },
    {
      "pk": 4005006,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 6,
      "text": "When I heard their outcry and these words, I was very angry.",
      "links": "<a href='/AIV/02/11/8'>Exod. 11:8</a>; <a href='/AIV/19/7/11'>Ps. 7:11</a>",
      "comment": "Nehemiah’s anger reflects righteous indignation against injustice, a character of leadership mourning for God’s people."
    },
    {
      "pk": 4005007,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 7,
      "text": "I considered these things in my heart, and then accused the nobles and the officials. I said to them, 'You are each lending at interest to your brother.' And I organized a great assembly against them.",
      "links": "<a href='/AIV/03/25/36-37'>Lev. 25:36-37</a>; <a href='/AIV/05/23/19-20'>Deut. 23:19-20</a>",
      "comment": "Lending with interest to one’s own people contradicted Mosaic Law, showing the importance of upholding tradition."
    },
    {
      "pk": 4005008,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 8,
      "text": "And I said to them, 'We have bought back our Jewish brothers who were sold to the nations, as much as we could. Now you would even sell your brothers, that they may be sold to us!' Then they were silent and could find nothing to say.",
      "links": "<a href='/AIV/03/25/48-49'>Lev. 25:48-49</a>",
      "comment": "This verse highlights the contradiction in reclaiming exiles while reselling them into slavery. Note the prophetic foreshadowing of redemption found in Christ."
    },
    {
      "pk": 4005009,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 9,
      "text": "So I said, 'The thing you are doing is not good. Should you not walk in the fear of our God to keep the reproach of the nations, our enemies, away from us?'",
      "links": "<a href='/AIV/05/10/12'>Deut. 10:12</a>; <a href='/AIV/19/111/10'>Ps. 111:10</a>",
      "comment": "'Fear of God' here signals not just reverence, but living by God’s law and testimony before the world—a call to holiness and unity."
    },
    {
      "pk": 4005010,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 10,
      "text": "And likewise, I, my brothers, and my servants are lending them money and grain. Let us stop this taking of interest.",
      "links": "<a href='/AIV/03/25/36'>Lev. 25:36</a>",
      "comment": "Nehemiah includes himself, emphasizing the call for collective repentance and reform."
    },
    {
      "pk": 4005011,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 11,
      "text": "Return to them immediately their fields, their vineyards, their olive groves, and their houses, as well as the interest on money, grain, new wine, and oil that you have been charging them.",
      "links": "<a href='/AIV/03/25/13'>Lev. 25:13</a>; <a href='/AIV/05/15/2'>Deut. 15:2</a>",
      "comment": "This mandate aligns with the Jubilee regulations—restoration and forgiveness. A spiritual meaning emerges: God’s people must return what is justly due, echoing Christ’s call to mercy (<a href='/AIV/40/6/12'>Matt. 6:12</a>)."
    },
    {
      "pk": 4005012,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 12,
      "text": "Then they said, 'We will restore it, and will require nothing from them; we will do as you say.' So I called the priests and made them swear to do according to this promise.",
      "links": "<a href='/AIV/03/19/12'>Lev. 19:12</a>; <a href='/AIV/24/34/8-10'>Jer. 34:8-10</a>",
      "comment": "Invoking the priests raises the importance of binding vows before God through His appointed ministers—a subtle nod to sacramental action."
    },
    {
      "pk": 4005013,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 13,
      "text": "I also shook out the fold of my garment and said, 'So may God shake out every man from his house and from his labor who does not keep this promise; so may he be shaken out and emptied.' And all the assembly said, 'Amen' and praised the LORD. And the people did according to this promise.",
      "links": "<a href='/AIV/44/13/51'>Acts 13:51</a>; <a href='/AIV/05/27/15'>Deut. 27:15</a>",
      "comment": "The symbolic act and assent of 'Amen' together reflect the ancient tradition of communal responsibility and covenant oath."
    },
    {
      "pk": 4005014,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 14,
      "text": "Moreover, from the time when I was appointed to be their governor in the land of Judah, from the twentieth year to the thirty-second year of Artaxerxes the king, twelve years, neither I nor my brothers ate the food allotted to the governor.",
      "links": "<a href='/AIV/16/2/1'>Neh. 2:1</a>; <a href='/AIV/16/13/6'>Neh. 13:6</a>",
      "comment": "Nehemiah’s refusal to benefit from his office emphasizes humble leadership and self-denial—a virtue modeled perfectly in Christ."
    },
    {
      "pk": 4005015,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 15,
      "text": "But the earlier governors who were before me laid heavy burdens on the people, and took from them bread and wine, plus forty shekels of silver. Even their servants oppressed the people. But I did not do so, because of the fear of God.",
      "links": "<a href='/AIV/09/8/11-18'>1 Sam. 8:11-18</a>",
      "comment": "Nehemiah contrasts his leadership with past rulers. The 'fear of God' again is the motivator—a pattern of virtuous authority echoed in New Testament teaching (<a href='/AIV/41/10/42-45'>Mark 10:42-45</a>)."
    },
    {
      "pk": 4005016,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 16,
      "text": "Indeed, I devoted myself to the work on this wall, nor did we buy any land. All my servants were gathered there for the work.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "Personal sacrifice for the good of the people is a recurring biblical theme, with the rebuilding foreshadowing the unifying work of Christ."
    },
    {
      "pk": 4005017,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 17,
      "text": "Moreover, there were at my table one hundred and fifty of the Jews and officials, besides those who came to us from the nations around us.",
      "links": "<a href='/AIV/10/9/7'>2 Sam. 9:7</a>; <a href='/AIV/16/6/15-16'>Neh. 6:15-16</a>",
      "comment": "Nehemiah's hospitality prefigures the banquet imagery that Jesus later uses to describe the coming Kingdom (<a href='/AIV/42/14/13-24'>Luke 14:13-24</a>)."
    },
    {
      "pk": 4005018,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 18,
      "text": "Now that which was prepared for each day was one ox and six choice sheep, and birds were prepared for me, and once every ten days all kinds of wine in abundance. Yet in all this I did not demand the food allowance of the governor, because of the heavy bondage on this people.",
      "links": "<a href='/AIV/13/29/21-22'>1 Chr. 29:21-22</a>",
      "comment": "The abundance echoes Old Testament sacrificial feasts, while Nehemiah’s restraint displays self-emptying for the sake of others."
    },
    {
      "pk": 4005019,
      "translation": "AIV",
      "book": 16,
      "chapter": 5,
      "verse": 19,
      "text": "Remember me, my God, for good, all that I have done for this people.",
      "links": "<a href='/AIV/16/13/14'>Neh. 13:14</a>; <a href='/AIV/19/106/4'>Ps. 106:4</a>",
      "comment": "This prayer for remembrance anticipates Jesus' words at the Last Supper ('Do this in remembrance of me', <a href='/AIV/42/22/19'>Luke 22:19</a>), connecting faithful deeds and divine memory—a key biblical principle."
    }
  ],
  "translatedAt": "2025-12-23T04:36:11.881Z"
}