{
  "book": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 4,
  "verses": [
    {
      "pk": 1945001,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 1,
      "text": "When Sanballat heard that we were rebuilding the wall, he was angry and greatly enraged. He mocked the Jews.",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>; <a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "Sanballat’s opposition to the rebuilding recalls frequent persecution of God's people. Opposition is expected for those who do God’s work."
    },
    {
      "pk": 1945002,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 2,
      "text": "He spoke before his brothers and the army of Samaria, and said, 'What are these feeble Jews doing? Will they restore it for themselves? Will they offer sacrifices? Will they finish in a day? Will they revive stones out of the heaps of rubble, burned as they are?'",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/19/69/10'>Ps. 69:10</a>",
      "comment": "Mockery of faith and worship is a common tactic of enemies of God’s people. Note the reference to sacrifices—the worship at the Temple is seen as central."
    },
    {
      "pk": 1945003,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 3,
      "text": "Tobiah the Ammonite was beside him, and he said, 'Whatever they are building, if even a fox climbs up on it, he will break down their stone wall!'",
      "links": "<a href='/AIV/16/2/10'>Neh. 2:10</a>",
      "comment": "Tobiah belittles their efforts, underestimating both human perseverance and divine help. Discouragement is a typical weapon against believers."
    },
    {
      "pk": 1945004,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 4,
      "text": "Hear, O our God, for we are despised. Turn their taunts back on their own heads, and give them up as plunder in a land of captivity.",
      "links": "<a href='/AIV/19/123/3-4'>Ps. 123:3–4</a>; <a href='/AIV/19/79/12'>Ps. 79:12</a>",
      "comment": "Nehemiah prays an imprecatory prayer, calling for justice—a reminder of the importance of bringing troubles to God in prayer."
    },
    {
      "pk": 1945005,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 5,
      "text": "Do not cover their guilt, and do not let their sin be blotted out from your sight, for they have provoked you to anger before the builders.",
      "links": "<a href='/AIV/19/109/14'>Ps. 109:14</a>",
      "comment": "A strong plea for justice highlights the seriousness of obstructing God’s work. The mention of sin being 'blotted out' points toward the biblical concept of forgiveness, fulfilled in Christ (<a href='/AIV/44/3/19'>Acts 3:19</a>)."
    },
    {
      "pk": 1945006,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 6,
      "text": "So we built the wall, and all the wall was joined together up to half its height, for the people had a mind to work.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "The unity and commitment of the people are key to the progress. Cooperation in building reflects a model for the Church—a theme that grows throughout Scripture."
    },
    {
      "pk": 1945007,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 7,
      "text": "But when Sanballat and Tobiah, and the Arabs, the Ammonites and the Ashdodites heard that the repairing of the walls of Jerusalem was progressing, and that the gaps were closing, they were very angry.",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/16/6/1'>Neh. 6:1</a>",
      "comment": "Multiple nations oppose Jerusalem’s restoration, a spiritual symbol for the opposition to God’s gathered people."
    },
    {
      "pk": 1945008,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 8,
      "text": "And they all conspired together to come and fight against Jerusalem and to cause confusion in it.",
      "links": "<a href='/AIV/19/83/2-3'>Ps. 83:2–3</a>",
      "comment": "Physical attack and confusion are threats to spiritual life and worship. Jerusalem’s walls symbolize order, protection, and unity."
    },
    {
      "pk": 1945009,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 9,
      "text": "But we prayed to our God and stationed a guard because of them day and night.",
      "links": "<a href='/AIV/16/2/20'>Neh. 2:20</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Prayer and practical action go hand in hand. This union of faith and works becomes a key principle in scripture (<a href='/AIV/59/2/17'>James 2:17</a>)."
    },
    {
      "pk": 1945010,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 10,
      "text": "In Judah it was said, 'The laborers’ strength is failing, and there is so much rubble that we cannot rebuild the wall.'",
      "links": "<a href='/AIV/19/6/6'>Ps. 6:6</a>",
      "comment": "Discouragement within the community highlights human weakness and dependence on God’s grace for perseverance."
    },
    {
      "pk": 1945011,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 11,
      "text": "And our adversaries said, 'They will not know or see until we come among them and kill them and stop the work.'",
      "links": "<a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "External threats are hidden and deadly—a reminder of spiritual warfare and the constant need for vigilance."
    },
    {
      "pk": 1945012,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 12,
      "text": "When the Jews who lived near them came, they repeatedly told us, 'Wherever you turn, they will attack us.'",
      "links": "<a href='/AIV/19/35/1'>Ps. 35:1</a>",
      "comment": "Proximity to the enemy brings regular warnings. Overcoming fear requires trust in God’s protection and promises."
    },
    {
      "pk": 1945013,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 13,
      "text": "So I set people in the lowest parts of the space behind the wall, in open places. I stationed them by their families, with their swords, their spears, and their bows.",
      "links": "<a href='/AIV/20/24/27'>Prov. 24:27</a>",
      "comment": "Nehemiah’s organization reinforces communal protection and strength. Families defend together—a foretaste of the Church’s call to stand united in faith and defense."
    },
    {
      "pk": 1945014,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 14,
      "text": "And I looked, and arose, and said to the nobles, the officials, and the rest of the people, 'Do not be afraid of them. Remember the Lord, who is great and awesome, and fight for your brothers, your sons and daughters, your wives and your homes.'",
      "links": "<a href='/AIV/05/31/6'>Deut. 31:6</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Rousing trust in God and protecting families echoes core tenets of Christian teaching—courage grounded in faith, and defending the faith community."
    },
    {
      "pk": 1945015,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 15,
      "text": "When our enemies heard that it was known to us and that God had frustrated their plan, we all returned to the wall, each to his work.",
      "links": "<a href='/AIV/19/33/10'>Ps. 33:10</a>",
      "comment": "God overturns the schemes of adversaries—a sign of His sovereignty and care for those who trust Him."
    },
    {
      "pk": 1945016,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 16,
      "text": "From that day on, half of my servants worked on construction, and half held the spears, shields, bows, and armor. The leaders stood behind the people of Judah.",
      "links": "<a href='/AIV/16/7/3'>Neh. 7:3</a>",
      "comment": "The community divides its efforts between service and defense, showing the dual role of building up and protecting the faith—a theme continued in the apostolic age."
    },
    {
      "pk": 1945017,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 17,
      "text": "Those who built on the wall, and those who carried burdens, loaded themselves so that each labored with one hand and held a weapon with the other.",
      "links": "<a href='/AIV/16/4/23'>Neh. 4:23</a>",
      "comment": "A vivid picture of vigilance: working and defending at the same time. This anticipates the scriptural command to be spiritually alert."
    },
    {
      "pk": 1945018,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 18,
      "text": "And each of the builders had his sword strapped at his side while building. The man who sounded the trumpet was beside me.",
      "links": "<a href='/AIV/13/15/24'>1 Chr. 15:24</a>",
      "comment": "The trumpet signals unity and coordinated action—foreshadowing the call and gathering of God’s people in times of need."
    },
    {
      "pk": 1945019,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 19,
      "text": "And I said to the nobles, the officials, and the rest of the people, 'The work is great and widely spread, and we are separated on the wall, far from one another.'",
      "links": "<a href='/AIV/16/3/38'>Neh. 3:38 (LXX: Neh. 4:1)</a>",
      "comment": "The scattered workers highlight the challenge of unity amid diversity. The Church later inherits this challenge, scattered across nations yet called to oneness."
    },
    {
      "pk": 1945020,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 20,
      "text": "'Wherever you hear the sound of the trumpet, gather to us there. Our God will fight for us.'",
      "links": "<a href='/AIV/02/14/14'>Ex. 14:14</a>; <a href='/AIV/07/7/22'>Judg. 7:22</a>",
      "comment": "Gathering at the trumpet’s call mirrors themes of assembly and divine intervention—fulfilled in the broader gathering of God’s people, especially in worship."
    },
    {
      "pk": 1945021,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 21,
      "text": "So we labored in the work, and half of them held spears from dawn until the stars came out.",
      "links": "<a href='/AIV/19/119/147'>Ps. 119:147</a>",
      "comment": "Long, diligent commitment is shown. Perseverance in faith and defense continues as a hallmark of the Church."
    },
    {
      "pk": 1945022,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 22,
      "text": "I also said to the people at that time, 'Let every man and his servant stay inside Jerusalem at night, so that they may be a guard for us by night and work by day.'",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>",
      "comment": "Protection is maintained without neglecting work—indicative of the rhythm of prayer and labor that characterizes Christian living."
    },
    {
      "pk": 1945023,
      "translation": "AIV",
      "book": 16,
      "chapter": 4,
      "verse": 23,
      "text": "Neither I nor my brothers nor my servants nor the men of the guard who followed me—none of us took off our clothes; each kept his weapon at his side.",
      "links": "<a href='/AIV/49/6/11'>Eph. 6:11</a>",
      "comment": "Constant preparedness with spiritual armor is a New Testament command (<a href='/AIV/49/6/11'>Eph. 6:11</a>): ‘Put on the whole armor of God.’ Spiritual vigilance and readiness are marks of faithful leadership."
    }
  ],
  "translatedAt": "2025-12-23T04:35:43.986Z"
}