{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 3,
  "verses": [
    {
      "pk": 3010301,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 1,
      "text": "After these things, King Xerxes promoted Haman son of Hammedatha the Agagite, and elevated him, setting his seat above all the officials who were with him.",
      "links": "<a href='/AIV/9/15/8'>1 Sam. 15:8</a>; <a href='/AIV/17/2/21'>Esth. 2:21</a>",
      "comment": "Haman’s lineage as an Agagite links to the traditional enemy of Israel, recalling Saul’s conflict with Agag (see 1 Sam. 15:8)."
    },
    {
      "pk": 3010302,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 2,
      "text": "And all the king’s servants who were at the king’s gate would kneel and bow down before Haman, for the king had commanded it; but Mordecai would not kneel or bow down.",
      "links": "<a href='/AIV/27/3/12'>Dan. 3:12</a>; <a href='/AIV/17/5/9'>Esth. 5:9</a>",
      "comment": "Mordecai’s refusal mirrors Daniel’s uncompromising loyalty to God. His actions highlight the precedence of divine law over royal decrees."
    },
    {
      "pk": 3010303,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 3,
      "text": "Then the king’s servants at the king’s gate said to Mordecai, “Why do you disobey the king’s command?”",
      "links": "<a href='/AIV/17/3/2'>Esth. 3:2</a>",
      "comment": "This verse emphasizes both social pressure and faithfulness under persecution, echoing similar trials throughout Scripture."
    },
    {
      "pk": 3010304,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 4,
      "text": "Day after day they spoke to him, but he did not listen to them. So they reported it to Haman, to see whether Mordecai’s reasoning would stand—for he had told them that he was a Jew.",
      "links": "<a href='/AIV/17/6/10'>Esth. 6:10</a>; <a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "Mordecai openly confesses his faith, foreshadowing later public declarations of loyalty to God."
    },
    {
      "pk": 3010305,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 5,
      "text": "When Haman saw that Mordecai did not kneel or bow before him, he was filled with fury.",
      "links": "<a href='/AIV/27/3/13'>Dan. 3:13</a>; <a href='/AIV/17/5/9'>Esth. 5:9</a>",
      "comment": "Haman’s rage intensifies the conflict. The spiritual struggle against pride is a recurring biblical theme."
    },
    {
      "pk": 3010306,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 6,
      "text": "But he considered it beneath him to lay hands only on Mordecai, for they had told him the people of Mordecai. So Haman sought to destroy all the Jews, throughout the whole kingdom of Xerxes—the people of Mordecai.",
      "links": "<a href='/AIV/2/20/13'>Ex. 20:13</a>; <a href='/AIV/17/8/5'>Esth. 8:5</a>",
      "comment": "Haman’s plan to destroy an entire people reflects the broader spiritual battles endured by God’s chosen, with echoes of attempts to eradicate the faithful throughout history."
    },
    {
      "pk": 3010307,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 7,
      "text": "In the first month, the month of Nisan, in the twelfth year of King Xerxes, they cast Pur—that is, the lot—before Haman for day and month, until it fell on the twelfth month, the month of Adar.",
      "links": "<a href='/AIV/17/9/24'>Esth. 9:24</a>; <a href='/AIV/3/16/33'>Prov. 16:33</a>",
      "comment": "Casting lots displays both man’s attempt at chance and God’s sovereign direction over history, later commemorated in the feast of Purim."
    },
    {
      "pk": 3010308,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 8,
      "text": "Then Haman said to King Xerxes, “There is a certain people scattered and set apart from among all the other peoples in your empire; their laws are different from those of every other people, and they do not keep the king’s laws. It is not to the king’s advantage to tolerate them.”",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>; <a href='/AIV/4/34/11'>Deut. 34:11</a>",
      "comment": "Haman distorts the truth for evil ends. ‘Set apart’ reminds us of God’s calling to holy distinction among His people."
    },
    {
      "pk": 3010309,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 9,
      "text": "If it pleases the king, let an edict be written to destroy them, and I will pay ten thousand talents of silver into the hands of those who carry out the king’s business, to put it into the king’s treasuries.”",
      "links": "<a href='/AIV/17/4/7'>Esth. 4:7</a>",
      "comment": "Haman offers wealth for evil, highlighting the misuse of riches and influence. There is an undercurrent of injustice here, countered later by divine providence."
    },
    {
      "pk": 3010310,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 10,
      "text": "So the king took his signet ring from his hand and gave it to Haman son of Hammedatha the Agagite, the enemy of the Jews.",
      "links": "<a href='/AIV/17/8/2'>Esth. 8:2</a>; <a href='/AIV/41/14/10'>Mark 14:10</a>",
      "comment": "The signet ring symbolizes delegated authority; compare Judas receiving money for betrayal, pointing to greater betrayals and redemption in salvation history."
    },
    {
      "pk": 3010311,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 11,
      "text": "And the king said to Haman, “The silver is yours, and the people too; do to them as you see fit.”",
      "links": "<a href='/AIV/17/8/7'>Esth. 8:7</a>",
      "comment": "Xerxes’ indifference illustrates the potential dangers of unchecked authority, underscoring the need for just rulers—a theme echoed in the teachings of Jesus and his chosen leaders."
    },
    {
      "pk": 3010312,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 12,
      "text": "Then the king’s scribes were called on the thirteenth day of the first month. Everything Haman commanded was written to the king’s satraps, to the governors over each province, and to the officials of each people—to every province in its own script and every people in its own language—and it was written in the name of King Xerxes and sealed with the king’s signet ring.",
      "links": "<a href='/AIV/17/8/9'>Esth. 8:9</a>; <a href='/AIV/27/6/8'>Dan. 6:8</a>",
      "comment": "The wide-reaching edict emphasizes the apparent finality of human authority; contrast this with the divine Word, universal and unchanging."
    },
    {
      "pk": 3010313,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 13,
      "text": "Letters were sent by couriers to all the king’s provinces, instructing to destroy, kill, and annihilate all Jews—young and old, children and women—in one day, on the thirteenth day of the twelfth month, the month of Adar, and to seize their possessions as spoil.",
      "links": "<a href='/AIV/17/8/11'>Esth. 8:11</a>; <a href='/AIV/2/20/13'>Ex. 20:13</a>",
      "comment": "The genocidal intent is explicitly stated, revealing the depth of evil opposed to God’s people, similar to times when believers are called to endure persecution, and pointing ahead to the ultimate victory over death secured in Christ."
    },
    {
      "pk": 3010314,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 14,
      "text": "A copy of the text of the edict was issued as law in every province, made public to all peoples, so they would be ready for that day.",
      "links": "<a href='/AIV/17/8/13'>Esth. 8:13</a>; <a href='/AIV/27/3/6'>Dan. 3:6</a>",
      "comment": "Public proclamation of law underscores both the gravity and the seeming immutability of human laws, later contrasted with the mercy at work in God’s providence."
    },
    {
      "pk": 3010315,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 15,
      "text": "The couriers went out hurriedly, by order of the king, and the edict was issued in Susa the citadel. And while the king and Haman sat down to drink, the city of Susa was bewildered.",
      "links": "<a href='/AIV/17/8/15'>Esth. 8:15</a>; <a href='/AIV/19/73/3'>Ps. 73:3</a>",
      "comment": "The rulers feast while the city is thrown into confusion—mirroring times when leaders are blind to injustice. God’s providence later prevails, reminding us of divine order over earthly chaos. Subtly, the narrative builds anticipation of sacrificial intercession and mediated redemption."
    }
  ],
  "translatedAt": "2025-12-23T04:42:09.709Z"
}