{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 7,
  "verses": [
    {
      "pk": 3207001,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 1,
      "text": "So the king and Haman went in to feast with Queen Esther.",
      "links": "<a href='/AIV/17/5/8'>Esth. 5:8</a>",
      "comment": "This verse connects back to Esther's earlier invitation (Esth. 5:8), highlighting the timing and importance of the second banquet in Esther's plan."
    },
    {
      "pk": 3207002,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 2,
      "text": "And on the second day, as they drank wine at the feast, the king again said to Esther, 'What is your petition, Queen Esther? It will be granted you. And what is your request? Even up to half of the kingdom, it will be fulfilled.'",
      "links": "<a href='/AIV/17/5/3'>Esth. 5:3</a>; <a href='/AIV/6/7/2'>Dan. 7:2</a>",
      "comment": "The king repeats his generous promise, echoing phrases common in royal courts (see Esth. 5:3, Mark 6:23). Esther’s title, 'Queen,' is emphasized, indicating her authority and dignity."
    },
    {
      "pk": 3207003,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 3,
      "text": "Then Queen Esther answered, 'If I have found favor in your eyes, O king, and if it pleases the king, let my life be granted me—this is my petition—and the lives of my people—this is my request.'",
      "links": "<a href='/AIV/17/4/8'>Esth. 4:8</a>",
      "comment": "Esther courageously identifies herself with her people, asking for their deliverance. Her humility and intercession reflect the righteous one who pleads for God's people (cf. Rom. 8:34)."
    },
    {
      "pk": 3207004,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 4,
      "text": "For we have been sold, I and my people, to be destroyed, killed, and annihilated. If we had simply been sold as male and female slaves, I would have kept silent, for our suffering would not be worth troubling the king.'",
      "links": "<a href='/AIV/17/3/9'>Esth. 3:9</a>; <a href='/AIV/17/4/7'>Esth. 4:7</a>",
      "comment": "Esther reveals the decree against her people but shows restraint, signifying her deep concern for justice and mercy. This points to the prophetic role of intercession on behalf of the community."
    },
    {
      "pk": 3207005,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 5,
      "text": "Then King Ahasuerus said to Queen Esther, 'Who is he, and where is he, who has dared to do this?'",
      "links": "<a href='/AIV/17/6/4'>Esth. 6:4</a>",
      "comment": "The king’s shock highlights the secrecy with which Haman had acted. The king's accountability for his people foreshadows Christ as the true righteous king."
    },
    {
      "pk": 3207006,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 6,
      "text": "And Esther said, 'A foe and an enemy!—this wicked Haman!' Then Haman was terrified before the king and queen.",
      "links": "<a href='/AIV/17/3/10'>Esth. 3:10</a>; <a href='/AIV/17/6/13'>Esth. 6:13</a>",
      "comment": "Esther boldly names Haman as the enemy. Her role as a mediator brings judgment, foreshadowing the ultimate defeat of evil in salvation history (cf. Rev. 20:10)."
    },
    {
      "pk": 3207007,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 7,
      "text": "The king rose in his wrath from the wine-drinking and went into the palace garden. But Haman stayed to beg for his life from Queen Esther, for he saw that harm was determined against him by the king.",
      "links": "<a href='/AIV/17/2/21-23'>Esth. 2:21–23</a>",
      "comment": "Haman realizes his fate is sealed. He asks mercy from Esther as intercessor, prefiguring the importance of seeking true mediation before judgment."
    },
    {
      "pk": 3207008,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 8,
      "text": "And the king returned from the palace garden to the place of the wine-drinking, as Haman was falling on the couch where Esther was. Then the king said, 'Will he even assault the queen while I am in the house?' As the word left the king’s mouth, they covered Haman’s face.",
      "links": "<a href='/AIV/17/6/7-9'>Esth. 6:7–9</a>",
      "comment": "The covering of Haman’s face signifies his condemnation. Esther’s dignity is protected, reminiscent of God’s defense of His people."
    },
    {
      "pk": 3207009,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 9,
      "text": "Then Harbona, one of the king’s eunuchs, said, 'Look, the gallows, fifty cubits high, that Haman prepared for Mordecai, whose word saved the king, stands at Haman’s house.' And the king said, 'Hang him on it.'",
      "links": "<a href='/AIV/17/5/14'>Esth. 5:14</a>; <a href='/AIV/17/6/2'>Esth. 6:2</a>",
      "comment": "Haman receives the punishment he intended for another, fulfilling the biblical principle of divine justice (cf. Prov. 26:27)."
    },
    {
      "pk": 3207010,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 10,
      "text": "So they hanged Haman on the gallows that he had prepared for Mordecai. Then the king’s wrath was appeased.",
      "links": "<a href='/AIV/17/5/14'>Esth. 5:14</a>; <a href='/AIV/17/2/23'>Esth. 2:23</a>",
      "comment": "Haman’s end brings peace and justice, showing how God can turn evil for good (cf. Gen. 50:20; Rom. 8:28). This foreshadows the ultimate victory of righteousness through allowed authorities and the mysterious ways in which the faithful are vindicated."
    }
  ],
  "translatedAt": "2025-12-23T05:14:02.879Z"
}