{
  "book": 19,
  "bookName": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 2,
  "verses": [
    {
      "pk": 19002001,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 1,
      "text": "After these things, when King Ahasuerus’s anger had subsided, he remembered Vashti, what she had done, and what had been decreed against her.",
      "links": "<a href='/AIV/19/1/12'>Esth. 1:12</a>;<a href='/AIV/19/1/19'>Esth. 1:19</a>",
      "comment": "The king’s remembrance of Vashti sets the stage for the search for a new queen. The decree's irrevocability shows the authority and finality of royal edicts in the Persian empire, reflecting how divine decrees cannot be overturned. (cf. Dan. 6:8-15)"
    },
    {
      "pk": 19002002,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 2,
      "text": "Then the king’s servants who attended him said, \"Let beautiful young virgins be sought for the king.\"",
      "links": "<a href='/AIV/19/1/9'>Esth. 1:9</a>",
      "comment": "This begins the process that will ultimately introduce Esther. The emphasis on purity and beauty echoes Old Testament patterns where chosen individuals are prepared for unique vocations, similar to Joseph's preparation (Gen. 39:6)."
    },
    {
      "pk": 19002003,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 3,
      "text": "\"Let the king appoint officers in all the provinces of his kingdom, so that they may gather every beautiful young virgin to the citadel of Susa, into the harem, under the custody of Hegai, the king’s eunuch who keeps the women. Let ointments be given to them.\"",
      "links": "<a href='/AIV/19/2/8'>Esth. 2:8</a>",
      "comment": "The gathering from all provinces highlights the global reach of the Persian empire and foreshadows God’s providential ordering in salvation history, where the chosen are gathered from all nations."
    },
    {
      "pk": 19002004,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 4,
      "text": "\"And let the young woman who pleases the king be queen instead of Vashti.\" This advice pleased the king, and he did so.",
      "links": "<a href='/AIV/19/2/17'>Esth. 2:17</a>",
      "comment": "A clear statement of the search’s purpose. The ‘one who pleases the king’ mirrors biblical selection motifs where one is specially chosen, emphasizing grace and election."
    },
    {
      "pk": 19002005,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 5,
      "text": "Now there was a Jew in the citadel of Susa whose name was Mordecai, son of Jair, son of Shimei, son of Kish, a Benjamite.",
      "links": "<a href='/AIV/09/9/1'>1 Sam. 9:1</a>;<a href='/AIV/09/10/21'>1 Sam. 10:21</a>",
      "comment": "Mordecai is identified with royal lineages. The genealogy connects him to Saul (cf. 1 Sam. 9:1), which subtly sets up conflict with Haman, who is an Agagite (Esth. 3:1)."
    },
    {
      "pk": 19002006,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 6,
      "text": "He had been taken into exile from Jerusalem with the captives who had been carried away with Jeconiah king of Judah, whom Nebuchadnezzar king of Babylon had exiled.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>; <a href='/AIV/10/24/1'>Jer. 24:1</a>",
      "comment": "The historical exile provides the backdrop for Esther, reflecting how God preserves a remnant even amidst exile, foreshadowing restoration and the continuous presence of God’s people."
    },
    {
      "pk": 19002007,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 7,
      "text": "He was raising Hadassah, that is Esther, his uncle’s daughter, for she had neither father nor mother. The young woman was lovely in figure and beautiful in appearance. When her parents died, Mordecai took her as his own daughter.",
      "links": "<a href='/AIV/19/2/15'>Esth. 2:15</a>",
      "comment": "Hadassah is her Hebrew name, Esther her Persian name. Her orphan status and adoption relate spiritually to how God adopts the faithful into His family (cf. Eph. 1:5; Rom. 8:15). The care of orphans echoes James 1:27."
    },
    {
      "pk": 19002008,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 8,
      "text": "When the king’s command and his decree were proclaimed, and many young women were gathered to the citadel of Susa under the custody of Hegai, Esther was also brought to the king’s palace and entrusted to Hegai, who was in charge of the women.",
      "links": "<a href='/AIV/19/2/3'>Esth. 2:3</a>",
      "comment": "Esther’s inclusion demonstrates divine providence working through human events to accomplish salvation, seen elsewhere in Scripture (cf. Gen. 50:20; Rom. 8:28)."
    },
    {
      "pk": 19002009,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 9,
      "text": "The young woman pleased him and won his favor, so he quickly provided her with ointments and her appointed portions, and seven chosen young women from the king’s palace to attend her. He transferred her and her attendants to the best place in the harem.",
      "links": "<a href='/AIV/19/10/3'>Esth. 10:3</a>",
      "comment": "Esther’s favor mirrors the theme of grace: favor bestowed for an elevated role, as seen with Joseph (Gen. 39:4). The preparation hints at spiritual formation before service and consecration."
    },
    {
      "pk": 19002010,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 10,
      "text": "Esther had not revealed her people or her family, because Mordecai had instructed her not to do so.",
      "links": "<a href='/AIV/19/2/20'>Esth. 2:20</a>",
      "comment": "Esther’s obedience to Mordecai reflects submission to true authority, echoing scriptural obedience to spiritual leaders (cf. Heb. 13:17; Eph. 6:1), and points to discreet witness in hostile circumstances."
    },
    {
      "pk": 19002011,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 11,
      "text": "Every day Mordecai walked in front of the courtyard of the harem to learn how Esther was and what was happening to her.",
      "links": "<a href='/AIV/19/2/7'>Esth. 2:7</a>",
      "comment": "This fatherly concern echoes the vigilant care of God for His children (cf. Mt. 10:29-31), and the spiritual responsibility entrusted to faithful guardians."
    },
    {
      "pk": 19002012,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 12,
      "text": "Each young woman’s turn came to go in to King Ahasuerus after twelve months of beautification — six months with oil of myrrh and six months with perfumes and other cosmetic treatments for women.",
      "links": "<a href='/AIV/19/2/3'>Esth. 2:3</a>",
      "comment": "This extended preparation period highlights the value of readiness and purification before entering royal presence, spiritually paralleling personal sanctification before approaching God (cf. Ex. 19:10-15)."
    },
    {
      "pk": 19002013,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 13,
      "text": "When the young woman went in to the king, she was given whatever she desired to take with her from the harem to the king’s palace.",
      "links": "<a href='/AIV/19/2/15'>Esth. 2:15</a>",
      "comment": "The freedom to request underscores personal agency, while the choice to take little (as Esther later does) shows humility and discernment, virtues praised in Scripture (cf. Prov. 3:34; Mt. 5:5)."
    },
    {
      "pk": 19002014,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 14,
      "text": "In the evening she went in, and in the morning she returned to the second harem, under the care of Shaashgaz, the king’s eunuch who was in charge of the concubines. She would not go in to the king again unless he delighted in her and summoned her by name.",
      "links": "<a href='/AIV/19/4/11'>Esth. 4:11</a>",
      "comment": "Access to the king required invitation, a subtle parallel to the exclusive access God grants through election and grace. The summons by name reflects intimacy in relationship (cf. Is. 43:1; Jn. 10:3)."
    },
    {
      "pk": 19002015,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 15,
      "text": "When the time came for Esther, daughter of Abihail the uncle of Mordecai, who had taken her as his own daughter, to go in to the king, she asked for nothing except what Hegai the king’s eunuch, the keeper of the women, advised. Esther won favor in the eyes of everyone who saw her.",
      "links": "<a href='/AIV/19/2/9'>Esth. 2:9</a>",
      "comment": "Esther’s humility and her willingness to be guided manifests a docile spirit, receptive to wise counsel. Her universal favor hints at a larger purpose—chosen and equipped by God for a saving mission, reminiscent of Mary in Luke 1:28."
    },
    {
      "pk": 19002016,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 16,
      "text": "Esther was taken to King Ahasuerus in the royal palace, in the tenth month (that is, the month of Tebeth), in the seventh year of his reign.",
      "links": "<a href='/AIV/19/2/12'>Esth. 2:12</a>",
      "comment": "The date situates Esther within history, grounding the narrative in real events, echoing biblical patterns that chronicle God’s work through time."
    },
    {
      "pk": 19002017,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 17,
      "text": "The king loved Esther more than all the other women, and she found favor and kindness in his sight beyond any of the virgins. So he set the royal crown on her head and made her queen instead of Vashti.",
      "links": "<a href='/AIV/19/1/19'>Esth. 1:19</a>; <a href='/AIV/19/6/8'>Esth. 6:8</a>",
      "comment": "Esther’s crowning echoes biblical themes of exaltation after humility (cf. 1 Sam. 2:8; Lk. 1:48-52). The giving of the royal crown has spiritual implications, signifying participation in a divine vocation."
    },
    {
      "pk": 19002018,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 18,
      "text": "Then the king held a great banquet for all his officials and servants—it was Esther’s banquet. And he granted a holiday for the provinces and gave gifts with royal generosity.",
      "links": "<a href='/AIV/19/1/3'>Esth. 1:3</a>; <a href='/AIV/19/5/6'>Esth. 5:6</a>",
      "comment": "The celebration foreshadows liturgical feasts commemorating deliverance. Banquets in Esther mark turning points, subtly pointing to the spiritual significance of sacred feasting (cf. Is. 25:6; Jn. 2:1-11)."
    },
    {
      "pk": 19002019,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 19,
      "text": "When the virgins were assembled a second time, Mordecai was sitting at the king’s gate.",
      "links": "<a href='/AIV/19/2/21'>Esth. 2:21</a>",
      "comment": "Mordecai’s presence at the gate signals elevated status and alertness, paralleling the spiritual role of leadership and vigilance for the community (cf. Ps. 84:10; Acts 20:28)."
    },
    {
      "pk": 19002020,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 20,
      "text": "Esther still had not revealed her family or her people, just as Mordecai had commanded her. For Esther kept Mordecai’s command as she always did when she was with him.",
      "links": "<a href='/AIV/19/2/10'>Esth. 2:10</a>",
      "comment": "Esther’s obedience illustrates constancy and humility before authority, consistent with the virtue of submission in the spiritual life (cf. Lk. 2:51; Heb. 13:17)."
    },
    {
      "pk": 19002021,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 21,
      "text": "In those days, while Mordecai was sitting at the king’s gate, Bigthan and Teresh, two of the king’s eunuchs who guarded the doorway, became angry and conspired to assassinate King Ahasuerus.",
      "links": "<a href='/AIV/19/6/2'>Esth. 6:2</a>",
      "comment": "The conspiracy introduces the theme of divine protection over rulers and God’s providence working through human agents for the good of all, a motif often seen in salvation history."
    },
    {
      "pk": 19002022,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 22,
      "text": "But Mordecai found out about the plot and told Queen Esther, and Esther informed the king in Mordecai’s name.",
      "links": "<a href='/AIV/19/6/2'>Esth. 6:2</a>",
      "comment": "Reporting in Mordecai’s name highlights the weight of authority and mediation. This choice has implications for understanding intercession—how one advocates on behalf of another, a recurring theme from Genesis to Revelation."
    },
    {
      "pk": 19002023,
      "translation": "AIV",
      "book": 19,
      "bookName": "Esther",
      "bookAbbreviation": "Esth",
      "chapter": 2,
      "verse": 23,
      "text": "When the affair was investigated and found to be true, both men were hanged on the gallows. The incident was recorded in the book of the chronicles before the king.",
      "links": "<a href='/AIV/19/6/1'>Esth. 6:1</a>",
      "comment": "Justice is executed and the deed remembered in the chronicles, foreshadowing the biblical idea of the Book of Life where every deed is recorded (cf. Mal. 3:16; Rev. 20:12)."
    }
  ],
  "translatedAt": "2025-12-24T05:08:52.505Z"
}