{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 4,
  "verses": [
    {
      "pk": 1942001,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 1,
      "text": "When Mordecai heard all that had happened, he tore his clothes, put on sackcloth and ashes, left the city, and cried loudly and bitterly in the middle of the city.",
      "links": "<a href='/ESV/01/37/34'>Gen. 37:34</a>; <a href='/ESV/15/9/5'>Ezra 9:5</a>",
      "comment": "Mourning in sackcloth and ashes is a sign of deep sorrow and repentance, found elsewhere in Scripture (Gen. 37:34; Ezra 9:5)."
    },
    {
      "pk": 1942002,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 2,
      "text": "He went as far as the king's gate, but no one dressed in sackcloth was allowed to enter the king’s gate.",
      "links": "<a href='/ESV/16/3/35'>Neh. 3:35</a>",
      "comment": "The king’s gate represented authority and access to power. Mourning garments kept the grieving separate from official matters, pointing to the need for transformation before entering the presence of the king, reminiscent of spiritual preparation before approaching God (cf. Ps. 24:3–4)."
    },
    {
      "pk": 1942003,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 3,
      "text": "In every province, wherever the king’s command and decree reached, there was great mourning among the Jews, with fasting, weeping, and laments. Many lay in sackcloth and ashes.",
      "links": "<a href='/ESV/19/35/13-14'>Ps. 35:13-14</a>; <a href='/ESV/27/9/3'>Dan. 9:3</a>",
      "comment": "Fasting and communal lamentation recall Israel's practices of national repentance (Ps. 35:13–14; Dan. 9:3), highlighting the power of intercessory prayer and humility before God in times of crisis."
    },
    {
      "pk": 1942004,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 4,
      "text": "When Esther’s young women and eunuchs came and told her, the queen was deeply troubled. She sent clothing for Mordecai to replace his sackcloth, but he would not accept them.",
      "links": "<a href='/ESV/01/45/5'>Gen. 45:5</a>",
      "comment": "Esther’s concern and attempt to ease Mordecai’s distress by sending clothes shows her compassion and desire for reconciliation, an anticipation of Christ’s ministry of comforting the afflicted (cf. Isa. 61:1–3)."
    },
    {
      "pk": 1942005,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 5,
      "text": "Then Esther summoned Hathach, one of the king’s eunuchs assigned to attend her, and ordered him to find out what this was about and why it was happening.",
      "links": "<a href='/ESV/27/1/10-11'>Dan. 1:10-11</a>",
      "comment": "Esther’s use of an intermediary mirrors the biblical theme of mediation and intercession, which prefigures the ultimate mediation of Christ (1 Tim. 2:5)."
    },
    {
      "pk": 1942006,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 6,
      "text": "Hathach went out to see Mordecai in the city square in front of the king’s gate.",
      "links": "",
      "comment": "The meeting at the city gate is significant; the gate was a place of public business and justice (cf. Ruth 4:1)."
    },
    {
      "pk": 1942007,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 7,
      "text": "Mordecai told him everything that had happened, including the exact sum of money Haman had promised to pay into the king’s treasury to destroy the Jews.",
      "links": "<a href='/ESV/17/3/9'>Esth. 3:9</a>",
      "comment": "The detail of Haman's bribe (cf. Esth. 3:9) shows the depth of corruption and injustice that the faith community faces in exile."
    },
    {
      "pk": 1942008,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 8,
      "text": "He also gave him a copy of the written decree issued in Susa to destroy them, to show Esther, and explained it to her, urging her to go to the king to plead for mercy and intercede for her people.",
      "links": "<a href='/ESV/17/7/3-4'>Esth. 7:3–4</a>",
      "comment": "Mordecai’s instruction for Esther to intercede is a strong example of intercessory advocacy, paralleling the biblical call for believers to stand in the gap for others (Ezek. 22:30)."
    },
    {
      "pk": 1942009,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 9,
      "text": "Hathach returned and told Esther what Mordecai had said.",
      "links": "",
      "comment": "The careful relay of messages highlights trust and careful discernment in spiritual crises."
    },
    {
      "pk": 1942010,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 10,
      "text": "Esther replied to Hathach and instructed him to tell Mordecai,",
      "links": "",
      "comment": "Esther acts as both listener and communicator, accepting her responsibility in a communal crisis, much as Christians are called to respond to God’s prompting."
    },
    {
      "pk": 1942011,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 11,
      "text": "“All the king’s servants and the people of the king’s provinces know that if any man or woman goes to the king inside the inner court without being called, there is but one law—to be put to death. Only he to whom the king holds out the golden scepter may live. But as for me, I have not been called to see the king for thirty days.”",
      "links": "<a href='/ESV/08/4/11'>Ruth 4:11</a>, <a href='/ESV/17/5/2'>Esth. 5:2</a>",
      "comment": "Approaching the king uninvited was a capital offense. The golden scepter symbolizes grace and favor, paralleling the concept of divine mercy received by intercession."
    },
    {
      "pk": 1942012,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 12,
      "text": "They told Mordecai what Esther had said.",
      "links": "",
      "comment": "The exchange demonstrates clarity of communication in critical spiritual matters."
    },
    {
      "pk": 1942013,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 13,
      "text": "Then Mordecai told them to reply to Esther, “Do not think in your heart that you will escape in the king’s palace any more than all the other Jews.",
      "links": "<a href='/ESV/04/32/23'>Num. 32:23</a>",
      "comment": "Mordecai reminds Esther that personal security cannot be found apart from faithfulness to one’s calling. God's providence works even in hidden and fearful circumstances."
    },
    {
      "pk": 1942014,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 14,
      "text": "For if you remain silent at this time, relief and deliverance will arise for the Jews from another place, but you and your father’s house will perish. And who knows if you have not come to the kingdom for such a time as this?”",
      "links": "<a href='/ESV/01/45/7'>Gen. 45:7</a>",
      "comment": "Mordecai’s statement affirms divine providence and human cooperation with God’s plan, echoing the belief that the faithful are placed in times and roles by God for redemptive purposes. This foreshadows Christian teaching on responding to grace."
    },
    {
      "pk": 1942015,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 15,
      "text": "Then Esther sent this reply to Mordecai:",
      "links": "",
      "comment": "Esther’s response signifies her willingness to discern and respond to God’s will in challenging circumstances."
    },
    {
      "pk": 1942016,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 16,
      "text": "\"Go, gather all the Jews who are in Susa, and fast for me. Do not eat or drink for three days, night or day. I and my young women will also fast likewise. Then I will go to the king, even though it is against the law. If I perish, I perish.\"",
      "links": "<a href='/ESV/44/27/33'>Acts 27:33</a>; <a href='/ESV/27/6/18'>Dan. 6:18</a>",
      "comment": "Esther’s call for communal fasting unites the people in seeking divine favor. It foreshadows the New Testament practice of prayer and fasting for major decisions (Acts 13:2–3) and points to Christ’s willingness to lay down His life for His people (John 10:17–18)."
    },
    {
      "pk": 1942017,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 17,
      "text": "So Mordecai went away and did all that Esther had ordered him.",
      "links": "<a href='/ESV/42/22/10'>Luke 22:10</a>",
      "comment": "Mordecai’s obedience to Esther’s command highlights the dynamic cooperation between leaders and the community—a pattern continued in the apostolic era where the Church community responds to divinely guided leadership (Luke 22:10; Acts 1:15-26)."
    }
  ],
  "translatedAt": "2025-12-23T04:42:29.250Z"
}