{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 8,
  "verses": [
    {
      "pk": 1808001,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 1,
      "text": "On that same day, King Xerxes gave the house of Haman, the enemy of the Jews, to Queen Esther. And Mordecai came before the king, for Esther had revealed what Mordecai was to her.",
      "links": "<a href='/AIV/17/7/3-6'>Esther 7:3-6</a>",
      "comment": "Esther, acting in her regal role, intercedes on behalf of her people. Her courage and advocacy reflect a mediator’s role, prefiguring Christ as intercessor (see Hebrews 7:25). The king entrusts both authority and wealth to Esther—a pattern of divine providence."
    },
    {
      "pk": 1808002,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 2,
      "text": "And the king took off his signet ring, which he had recovered from Haman, and gave it to Mordecai. And Esther appointed Mordecai over the house of Haman.",
      "links": "<a href='/AIV/41/16/19'>Mark 16:19</a>; <a href='/AIV/17/3/10'>Esther 3:10</a>",
      "comment": "The transfer of the ring signifies authority. Similar to Joseph receiving Pharaoh’s ring (Genesis 41:42), Mordecai’s elevation shows the reward of faithfulness. Esther’s act of entrusting the estate reflects stewardship entrusted to the saints (cf. Luke 19:17)."
    },
    {
      "pk": 1808003,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 3,
      "text": "Then Esther spoke again to the king. She fell at his feet, wept, and pleaded with him to remove the evil plan that Haman the Agagite had devised against the Jews.",
      "links": "<a href='/AIV/17/4/8-17'>Esther 4:8-17</a>",
      "comment": "Esther’s humility and perseverance in prayer resemble the persistence in intercessory prayer encouraged throughout the Scriptures (cf. James 5:16; Luke 18:1). Her advocacy foreshadows the Church’s maternal intercession for her children."
    },
    {
      "pk": 1808004,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 4,
      "text": "And the king held out to Esther the golden scepter. So Esther rose and stood before the king.",
      "links": "<a href='/AIV/17/5/2'>Esther 5:2</a>",
      "comment": "The golden scepter symbolizes the king’s permission and favor, an image for divine grace allowing us to approach God’s throne (cf. Hebrews 4:16). The scepter also points toward legitimate authority granted for the good of God’s people."
    },
    {
      "pk": 1808005,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 5,
      "text": "She said, \"If it pleases the king, and if I have found favor in his sight, and if the matter seems right to the king and I am pleasing in his eyes, let a decree be written to revoke the letters devised by Haman son of Hammedatha, the Agagite, which he wrote to destroy the Jews who are in all the provinces of the king.\"",
      "links": "<a href='/AIV/17/3/8-9'>Esther 3:8-9</a>",
      "comment": "Esther appeals with humility and logic. Her submission and seeking the king's favor evoke Mary’s fiat (Luke 1:38), manifesting openness to the king’s will and placing the good of her people above her own."
    },
    {
      "pk": 1808006,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 6,
      "text": "\"For how can I bear to see the evil that will befall my people? How can I endure the destruction of my relatives?\"",
      "links": "<a href='/AIV/17/7/3-4'>Esther 7:3-4</a>",
      "comment": "Esther’s personal concern for her people echoes the love that Christ exhibits (John 15:13). Her willingness to share in their fate foreshadows the connection between individual and communal salvation."
    },
    {
      "pk": 1808007,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 7,
      "text": "King Xerxes replied to Queen Esther and Mordecai the Jew, \"See, I have given Haman’s house to Esther, and he has been hanged on the gallows because he tried to lay hands on the Jews.",
      "links": "<a href='/AIV/17/7/9-10'>Esther 7:9-10</a>",
      "comment": "Justice is enacted against Haman, signifying the reversal of evil, a common theme in Scripture (Genesis 50:20). Rewarding the righteous and punishing the wicked reflects divine justice and the vindication of God’s people."
    },
    {
      "pk": 1808008,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 8,
      "text": "\"Now you may write as you see fit regarding the Jews, in the king’s name, and seal it with the king’s signet ring. For an edict written in the king’s name and sealed with his ring cannot be revoked.\"",
      "links": "<a href='/AIV/17/1/19'>Esther 1:19</a>",
      "comment": "The irrevocable royal decree has echoes of God’s unchangeable promises (Numbers 23:19). The ability to act with the king’s authority foreshadows spiritual authority delegated to leaders within the Kingdom (see Matthew 16:19)."
    },
    {
      "pk": 1808009,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 9,
      "text": "So the royal scribes were called at once, in the third month, which is the month of Sivan, on the twenty-third day. The decree was written for the Jews, to every satrap, governor, and official of the 127 provinces from India to Cush, to each province in its own script and to each people in their own language, and also to the Jews in their writing and language.",
      "links": "<a href='/AIV/17/1/1'>Esther 1:1</a>",
      "comment": "The widespread publication of the edict reflects the Church’s universal mission—salvation offered to every nation and tongue (cf. Revelation 7:9). The careful attention to language and culture prefigures Pentecost’s miracle (Acts 2:4-11)."
    },
    {
      "pk": 1808010,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 10,
      "text": "He wrote in the name of King Xerxes, sealed it with the king’s signet ring, and sent the letters by mounted couriers on fast horses bred for the king’s service.",
      "links": "<a href='/AIV/17/3/12-13'>Esther 3:12-13</a>",
      "comment": "Speed and urgency in delivering the message recall the apostles’ zeal in spreading the Gospel (Romans 10:15). The idea of a sealed message echoes the seal of the Spirit given to believers (Ephesians 1:13)."
    },
    {
      "pk": 1808011,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 11,
      "text": "The king’s edict granted the Jews in every city the right to gather and defend their lives, to destroy, kill, and annihilate any armed force of any people or province that threatened them, including women and children, and to take their possessions as spoil.",
      "links": "<a href='/AIV/17/9/2-5'>Esther 9:2-5</a>",
      "comment": "This self-defense decree marks a huge reversal—where the persecuted gain legitimacy. Spiritually, the text can be viewed as an allegory of spiritual warfare against evil (cf. Ephesians 6:10-18), affirming believers’ protection."
    },
    {
      "pk": 1808012,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 12,
      "text": "This would take place on one day throughout all the provinces of King Xerxes—on the thirteenth day of the twelfth month, which is Adar.",
      "links": "<a href='/AIV/17/3/13'>Esther 3:13</a>",
      "comment": "A reversal of fortune: what was meant for harm (Esther 3:13) now becomes deliverance. The crisis’s timing underscores divine providence and the importance of remembering redemptive history in sacred feasts."
    },
    {
      "pk": 1808013,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 13,
      "text": "A copy of the written decree was to be issued as law in every province and made known to all peoples, that the Jews should be ready on that day to take vengeance against their enemies.",
      "links": "<a href='/AIV/17/3/14-15'>Esther 3:14-15</a>",
      "comment": "Just as the original edict called for destruction, this one calls for protection—a vivid illustration of redemption, justice, and preparation (cf. 1 Peter 4:7). The idea of written law points to the importance of authoritative tradition."
    },
    {
      "pk": 1808014,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 14,
      "text": "The couriers, riding on royal horses, urgently left, pressed on by the king’s command. The decree was also issued at the fortress of Susa.",
      "links": "<a href='/AIV/17/3/15'>Esther 3:15</a>",
      "comment": "The urgency reflects the decisive proclamation of good news (cf. Mark 1:15). Issuing the decree at Susa, the capital, signals authority and the centrality of faithfulness to the king."
    },
    {
      "pk": 1808015,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 15,
      "text": "Then Mordecai went out from the king’s presence wearing royal garments of blue and white, a large golden crown, and a cloak of fine linen and purple. And the city of Susa shouted with joy and rejoiced.",
      "links": "<a href='/AIV/17/6/8-11'>Esther 6:8-11</a>; <a href='/AIV/19/30/11'>Psalm 30:11</a>",
      "comment": "Mordecai’s attire signifies his exaltation and victory over adversity, a ‘type’ of Christ’s glorification (cf. Revelation 19:16). The rejoicing city portrays the joy of redemption and the celebration of goodness winning over evil."
    },
    {
      "pk": 1808016,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 16,
      "text": "For the Jews there was light and gladness, joy and honor.",
      "links": "<a href='/AIV/19/27/1'>Psalm 27:1</a>; <a href='/AIV/19/97/11'>Psalm 97:11</a>",
      "comment": "Light often symbolizes salvation and the presence of God (John 1:4-5). Their joy and honor recall the glory bestowed upon the people of God—a foretaste of eternal celebration at the end of the age."
    },
    {
      "pk": 1808017,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 17,
      "text": "And in every province and city, wherever the decree of the king came, there was gladness and joy among the Jews, feasting and celebration. Many of the people of the land declared themselves Jews, for fear of the Jews had fallen upon them.",
      "links": "<a href='/AIV/17/9/19-22'>Esther 9:19-22</a>",
      "comment": "The conversion of many hints at the universal call to holiness and the transformative witness of God’s people (cf. Isaiah 56:3-8; Acts 2:41). Feasts and celebrations anticipate sanctified times of communal worship. The narrative quietly points toward the enduring, visible witness to God’s saving action in history."
    }
  ],
  "translatedAt": "2025-12-23T05:14:24.005Z"
}