{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 5,
  "verses": [
    {
      "pk": 2605001,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 1,
      "text": "On the third day, Esther put on her royal robes and stood in the inner court of the king’s palace, opposite the king’s hall. The king was sitting on his royal throne inside the hall, facing the entrance.",
      "links": "<a href='/AIV/17/4/16'>Esther 4:16</a>; <a href='/AIV/7/6/14'>Judges 6:14</a>",
      "comment": "Esther’s three days of preparation hints at the pattern of prayer, fasting, and mediation seen elsewhere in Scripture. Her act of courage recalls Moses (Exod. 5:1) approaching Pharaoh and foreshadows the willingness of believers to advocate for God’s people."
    },
    {
      "pk": 2605002,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 2,
      "text": "When the king saw Queen Esther standing in the court, she gained favor in his eyes, and he held out to Esther the golden scepter that was in his hand. So Esther approached and touched the tip of the scepter.",
      "links": "<a href='/AIV/17/4/11'>Esther 4:11</a>; <a href='/AIV/2/4/31'>Ex. 4:31</a>",
      "comment": "Esther is granted an audience through the king’s gesture. This royal favor alludes to the merciful access we have to the throne of grace (Heb. 4:16). The act of approaching a king with reverence mirrors liturgical access to God."
    },
    {
      "pk": 2605003,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 3,
      "text": "Then the king said to her, 'What is it, Queen Esther? What is your request? It shall be given to you, even up to half of the kingdom.'",
      "links": "<a href='/AIV/6/15/18'>Josh. 15:18</a>; <a href='/AIV/41/6/23'>Mark 6:23</a>",
      "comment": "The king’s phrase is a common Near Eastern expression of generosity, used elsewhere of Herod’s promise to Herodias’s daughter (Mark 6:23). It highlights the king’s willingness, reflecting God’s readiness to hear intercessory prayer."
    },
    {
      "pk": 2605004,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 4,
      "text": "Esther answered, 'If it pleases the king, let the king and Haman come today to a banquet that I have prepared for him.'",
      "links": "<a href='/AIV/17/7/1'>Esther 7:1</a>",
      "comment": "Esther uses both deference and wisdom. Her invitation to a banquet as a means of intercession foreshadows Jesus’ own use of meals to reveal deeper truths (Luke 14:15)."
    },
    {
      "pk": 2605005,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 5,
      "text": "Then the king said, 'Bring Haman quickly, so that we may do as Esther has requested.' So the king and Haman came to the banquet that Esther had prepared.",
      "links": "<a href='/AIV/17/6/4'>Esther 6:4</a>",
      "comment": "The king’s swift obedience to Esther’s request shows the power of favor gained through humility and intercession – a precedence in both salvation history and the spiritual life."
    },
    {
      "pk": 2605006,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 6,
      "text": "As they drank wine, the king again said to Esther, 'What is your request? It shall be granted to you. And what is your petition? Even up to half the kingdom, it shall be done.'",
      "links": "<a href='/AIV/17/5/3'>Esther 5:3</a>; <a href='/AIV/7/1/15'>Judges 1:15</a>",
      "comment": "The repeated question intensifies the king’s anticipation, echoing the importance of persistent prayer (Luke 18:1–8). The banquet setting alludes to sacred feasts and the hospitality of the covenant."
    },
    {
      "pk": 2605007,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 7,
      "text": "Then Esther replied, 'This is my request and my petition:",
      "links": "<a href='/AIV/17/7/3'>Esther 7:3</a>",
      "comment": "Esther’s measured disclosure shows wisdom in timing and readiness to act, a hallmark of discernment seen in God’s prophets and saints."
    },
    {
      "pk": 2605008,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 8,
      "text": "If I have found favor in the eyes of the king, and if it pleases the king to grant my petition and fulfill my request, let the king and Haman come to the banquet that I will prepare for them tomorrow. I will do as the king has said.'",
      "links": "<a href='/AIV/17/7/2'>Esther 7:2</a>",
      "comment": "Esther delays her true petition, mirroring the process of spiritual maturity and the importance of discernment in intercession. The second invitation prefigures the theme of ‘already and not yet’, echoing the patient persistence in God’s plan."
    },
    {
      "pk": 2605009,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 9,
      "text": "Haman went out that day joyful and glad of heart. But when Haman saw Mordecai at the gate of the king, and that he neither rose nor trembled before him, he was filled with wrath against Mordecai.",
      "links": "<a href='/AIV/17/3/2'>Esther 3:2</a>; <a href='/AIV/19/37/12'>Ps. 37:12</a>",
      "comment": "Haman’s pride and resentment recall the folly of the wicked in Psalm 37:12. The contrast between false honor and true reverence points to the inversion of worldly values found in the Gospel (Matt. 23:12)."
    },
    {
      "pk": 2605010,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 10,
      "text": "Nevertheless, Haman restrained himself and went home. He sent for his friends and his wife Zeresh.",
      "links": "<a href='/AIV/17/6/13'>Esther 6:13</a>",
      "comment": "Haman’s self-restraint is outward; inwardly, his evil intentions fester. The involvement of his family in his plans mirrors the way pride and sin can draw in others (Gen. 3:6)."
    },
    {
      "pk": 2605011,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 11,
      "text": "Haman recounted to them the glory of his wealth, the multitude of his sons, and all the ways the king had promoted him and given him authority above the officials and servants of the king.",
      "links": "<a href='/AIV/17/1/4'>Esther 1:4</a>; <a href='/AIV/18/21/7-9'>Job 21:7–9</a>",
      "comment": "Haman’s boasting is reminiscent of Psalm 49:16–20. The fleetingness of his prideful position reflects the wisdom tradition’s warning about trust in earthly honor."
    },
    {
      "pk": 2605012,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 12,
      "text": "Haman said, 'Even Queen Esther let no one but me come with the king to the banquet she prepared. And tomorrow also I am invited by her together with the king.'",
      "links": "<a href='/AIV/17/6/6'>Esther 6:6</a>; <a href='/AIV/42/14/7-11'>Luke 14:7–11</a>",
      "comment": "Haman’s sense of exclusivity and pride foreshadow his downfall, inverting Jesus’ teaching that those who exalt themselves will be humbled."
    },
    {
      "pk": 2605013,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 13,
      "text": "Yet all this gives me no satisfaction, as long as I see Mordecai the Jew sitting at the king’s gate.'",
      "links": "<a href='/AIV/17/3/5'>Esther 3:5</a>; <a href='/AIV/21/1/8'>Eccl. 1:8</a>",
      "comment": "Sin breeds discontent, visible here in Haman. A heart not at peace in right worship is never satisfied—a theme echoed in Ecclesiastes."
    },
    {
      "pk": 2605014,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 14,
      "text": "Then his wife Zeresh and all his friends said to him, 'Let a gallows fifty cubits high be made, and in the morning say to the king that Mordecai should be hanged on it. Then go joyfully with the king to the banquet.' The advice pleased Haman, and he had the gallows made.",
      "links": "<a href='/AIV/17/7/9-10'>Esther 7:9–10</a>; <a href='/AIV/19/7/15-16'>Ps. 7:15–16</a>",
      "comment": "The counsel given to Haman is a counsel to sin, but judgment is swift—just as in Psalm 7, the pit prepared for another leads to the downfall of the wicked plotter. God’s providence reverses human evil, prefiguring the resurrection and victory of the humble."
    }
  ],
  "translatedAt": "2025-12-23T04:42:51.173Z"
}