{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 10,
  "verses": [
    {
      "pk": 100100,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 1,
      "text": "King Xerxes imposed tribute on the land and on the islands of the sea.",
      "links": "<a href='/AIV/17/1/1'>Est. 1:1</a>; <a href='/AIV/12/23/34'>2 Kings 23:34</a>",
      "comment": "This verse marks the extent and authority of King Xerxes' rule, emphasizing his power over distant territories. The text parallels other Old Testament references to great monarchs exerting control beyond their borders, alluding to the fulfillment of God's providence through secular rulers."
    },
    {
      "pk": 100101,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 2,
      "text": "All the achievements of his power and might, along with a detailed account of Mordecai’s prominence, are written in the Book of the Chronicles of the Kings of Media and Persia.",
      "links": "<a href='/AIV/17/2/23'>Est. 2:23</a>; <a href='/AIV/11/14/19'>1 Kings 14:19</a>",
      "comment": "The public recording of Mordecai’s deeds suggests recognition and honor, echoing Old Testament traditions of righteous individuals acknowledged in authoritative registers. As with other figures entrusted with leadership, this acknowledges both historical and spiritual preservation of the faithful, hinting at God’s hidden guidance behind human history. The idea of faithful records anticipates Christ’s own inscription in the Book of Life (<a href='/AIV/66/20/12'>Rev. 20:12</a>)."
    },
    {
      "pk": 100102,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 3,
      "text": "For Mordecai the Jew was second in rank to King Xerxes, esteemed by his fellow Jews, beloved by many, and he worked for the good of his people and spoke peace to all their descendants.",
      "links": "<a href='/AIV/17/8/15'>Est. 8:15</a>; <a href='/AIV/20/11/10'>Prov. 11:10</a>; <a href='/AIV/40/5/9'>Matt. 5:9</a>",
      "comment": "Mordecai’s position as second to the king reflects a typology of mediatorship—one who intercedes on behalf of others, like Joseph in Egypt (<a href='/AIV/1/41/40'>Gen. 41:40</a>). His role in bringing peace and good to the people foreshadows Christ’s own peace-giving mission (<a href='/AIV/40/5/9'>Matt. 5:9</a>). The spiritual reading highlights the enduring legacy of righteousness and self-giving leadership, resonant with themes of mediation and communal blessing found throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-23T05:15:14.809Z"
}