{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 1,
  "verses": [
    {
      "pk": 4100101,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 1,
      "text": "Now it came to pass in the days of Ahasuerus, the Ahasuerus who reigned over one hundred and twenty-seven provinces from India to Ethiopia,",
      "links": "<a href='/AIV/27/2/48'>Daniel 2:48</a>; <a href='/AIV/8/1/1'>Ruth 1:1</a>",
      "comment": "Ahasuerus is commonly identified with Xerxes I, the powerful Persian ruler. The mention of the extent of his realm sets the stage for the book's dramatic events. Note the similarity to biblical introductions which emphasize sovereignty and providence."
    },
    {
      "pk": 4100102,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 2,
      "text": "in those days, when King Ahasuerus sat on his royal throne in the palace of Susa,",
      "links": "<a href='/AIV/16/1/1'>Nehemiah 1:1</a>; <a href='/AIV/7/8/16'>Judges 8:16</a>",
      "comment": "Susa was the chief city of Persia, underscoring the grandeur and historical importance of these events. Susa’s royal significance foreshadows divine intervention in pagan cultures (see Daniel)."
    },
    {
      "pk": 4100103,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 3,
      "text": "in the third year of his reign, he gave a banquet for all his officials and servants. The army leaders of Persia and Media, the nobles, and the governors of the provinces were present before him.",
      "links": "<a href='/AIV/7/14/10'>Judges 14:10</a>; <a href='/AIV/6/23/2'>Joshua 23:2</a>",
      "comment": "The gathering of all officers points to unity and hierarchical structure in the kingdom, a recurring biblical motif anticipating God's order and providential care over the nations."
    },
    {
      "pk": 4100104,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 4,
      "text": "He displayed the wealth of his glorious kingdom and the splendor of his majesty for many days, for one hundred and eighty days.",
      "links": "<a href='/AIV/11/10/21'>1 Kings 10:21</a>; <a href='/AIV/19/145/12'>Psalm 145:12</a>",
      "comment": "The extravagant display is reminiscent of Solomon’s wealth, echoing Old Testament themes of regal splendor and human pride contrasted to divine humility."
    },
    {
      "pk": 4100105,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 5,
      "text": "And when these days were completed, the king held another feast for all the people present in Susa the capital, both great and small, for seven days, in the courtyard of the garden of the king’s palace.",
      "links": "<a href='/AIV/2/12/16'>Exodus 12:16</a>; <a href='/AIV/9/16/10'>1 Samuel 16:10</a>",
      "comment": "Seven days recalls the week of creation (Genesis 2:2–3). The invitation of both ‘great and small’ can be seen as a foreshadowing of the inclusive nature of God’s kingdom."
    },
    {
      "pk": 4100106,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 6,
      "text": "There were hangings of white linen, blue and purple, fastened with cords of fine linen and purple on silver rods and marble pillars. There were couches of gold and silver on a mosaic pavement of porphyry, marble, mother-of-pearl, and precious stones.",
      "links": "<a href='/AIV/2/26/1'>Exodus 26:1</a>; <a href='/AIV/11/7/7'>1 Kings 7:7</a>",
      "comment": "The vivid description of colors and precious materials recalls the tabernacle and temple designs, pointing to the biblical motif of earthly splendor as a shadow of heavenly reality."
    },
    {
      "pk": 4100107,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 7,
      "text": "Drinks were served in golden vessels, each different from the other, and the royal wine flowed in abundance according to the king’s generosity.",
      "links": "<a href='/AIV/19/23/5'>Psalm 23:5</a>; <a href='/AIV/11/10/21'>1 Kings 10:21</a>",
      "comment": "The abundance of wine is significant—a recurring symbol of joy and covenantal blessing in scripture, also echoing the Messianic Banquet imagery (Isaiah 25:6; Matthew 22:2)."
    },
    {
      "pk": 4100108,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 8,
      "text": "The drinking was done by law, without compulsion, for the king had ordered all the officials of his palace to do as each person desired.",
      "links": "<a href='/AIV/64/1/7'>Philemon 1:7</a>; <a href='/AIV/20/23/20'>Proverbs 23:20</a>",
      "comment": "This rare freedom at a royal feast indicates openness and kindness, mirroring the invitation of grace in Christ, freely given and received (Ephesians 2:8–9)."
    },
    {
      "pk": 4100109,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 9,
      "text": "Also, Queen Vashti held a feast for the women in the royal palace which belonged to King Ahasuerus.",
      "links": "<a href='/AIV/11/10/13'>1 Kings 10:13</a>; <a href='/AIV/40/14/21'>Matthew 14:21</a>",
      "comment": "Vashti’s separate banquet signals the status and dignity afforded to women of rank, revealing the underlying social order of Persian society and foreshadowing Esther’s own rise."
    },
    {
      "pk": 4100110,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 10,
      "text": "On the seventh day, when the king’s heart was merry with wine, he commanded Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carcas, the seven eunuchs who served him,",
      "links": "<a href='/AIV/27/1/3'>Daniel 1:3</a>; <a href='/AIV/11/10/8'>1 Kings 10:8</a>",
      "comment": "The use of eunuchs in service aligns with other ancient courts, including that of Nebuchadnezzar in Daniel; seven signifies completeness (cf. Genesis 2:2)."
    },
    {
      "pk": 4100111,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 11,
      "text": "to bring Queen Vashti before the king with her royal crown, to show the peoples and the officials her beauty, for she was very beautiful.",
      "links": "<a href='/AIV/11/1/11'>1 Kings 1:11</a>; <a href='/AIV/19/45/11'>Psalm 45:11</a>",
      "comment": "The request to display Vashti’s beauty is met with her refusal, introducing themes of dignity and honor, and laying foundational tension for Esther’s later appearance as queen."
    },
    {
      "pk": 4100112,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 12,
      "text": "But Queen Vashti refused to come at the king’s command conveyed by the eunuchs. Then the king became very angry, and his wrath burned within him.",
      "links": "<a href='/AIV/11/21/4'>1 Kings 21:4</a>; <a href='/AIV/18/32/2'>Job 32:2</a>",
      "comment": "Vashti’s refusal reflects personal integrity and prepares the way for God’s providential work through Esther’s future obedience—a subtle plan guiding human events."
    },
    {
      "pk": 4100113,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 13,
      "text": "Then the king spoke with the wise men who understood the times, for it was the king’s practice to consult with all who knew law and judgment.",
      "links": "<a href='/AIV/11/12/6'>1 Kings 12:6</a>; <a href='/AIV/20/11/14'>Proverbs 11:14</a>",
      "comment": "Consulting the wise men shows reverence for tradition and law—echoing the scriptural importance of godly counsel and spiritual discernment (cf. Proverbs)."
    },
    {
      "pk": 4100114,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 14,
      "text": "Those closest to him were: Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan, the seven princes of Persia and Media, who had access to the king’s presence and ranked highest in the kingdom.",
      "links": "<a href='/AIV/07/9/4'>Judges 9:4</a>; <a href='/AIV/27/6/3'>Daniel 6:3</a>",
      "comment": "The symbolism of seven again points to completeness, while ‘princes’ echoes the New Testament hint of apostles and church leadership (cf. Matthew 10:2)."
    },
    {
      "pk": 4100115,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 15,
      "text": "He asked, 'What should be done to Queen Vashti according to the law, since she has not obeyed the command of King Ahasuerus delivered by the eunuchs?'",
      "links": "<a href='/AIV/2/18/15'>Exodus 18:15</a>; <a href='/AIV/11/3/16'>1 Kings 3:16</a>",
      "comment": "The appeal to law hints at justice and order—key biblical virtues fulfilled in the New Testament through Christ as the true Judge."
    },
    {
      "pk": 4100116,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 16,
      "text": "Memucan said before the king and the princes, 'Queen Vashti has wronged not only the king but all the officials and all the peoples in all the provinces of King Ahasuerus.'",
      "links": "<a href='/AIV/9/8/7'>1 Samuel 8:7</a>; <a href='/AIV/20/14/34'>Proverbs 14:34</a>",
      "comment": "Memucan’s statement draws attention to social order and the ripple effects of disobedience, reminiscent of Adam and Eve’s disobedience in Genesis."
    },
    {
      "pk": 4100117,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 17,
      "text": "'For the queen’s behavior will be made known to all women, causing them to despise their husbands, saying, "
    },
    "King Ahasuerus commanded Queen Vashti to be brought before him, but she did not come.'",
    "links",
    "<a href='/AIV/20/12/4'>Proverbs 12:4</a>; <a href='/AIV/10/6/23'>2 Samuel 6:23</a>",
    "comment",
    "This verse highlights the importance of example and authority, which have deeper spiritual implications for the obedience owed within God’s ordained structures for family and community.",
    {
      "pk": 4100118,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 18,
      "text": "'This day, the wives of the princes of Persia and Media, who have heard about the queen’s actions, will speak the same way to all the king’s officials, and there will be contempt and anger.'",
      "links": "<a href='/AIV/20/14/1'>Proverbs 14:1</a>; <a href='/AIV/11/11/3'>1 Kings 11:3</a>",
      "comment": "Social unrest as a result of Vashti’s actions reveals the need for order—a theme later resolved not only in Esther’s mediated peace but anticipating Christ as the Prince of Peace."
    },
    {
      "pk": 4100119,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 19,
      "text": "'If it pleases the king, let a royal decree go out from him, and let it be written in the laws of Persia and Media which cannot be repealed, that Vashti is never again to come before King Ahasuerus. Let the king give her royal position to another who is better than she.'",
      "links": "<a href='/AIV/27/6/12'>Daniel 6:12</a>; <a href='/AIV/11/2/35'>1 Kings 2:35</a>",
      "comment": "The irrevocable nature of Persian law echoes the binding authority of God’s word; transferring royal dignity to another points forward to moments of divine election and replacement, even anticipating Mary as chosen by God among women."
    },
    {
      "pk": 4100120,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 20,
      "text": "'And when the king’s decree, which he will issue, is announced throughout all his kingdom, great as it is, then all women will give respect to their husbands, both great and small.'",
      "links": "<a href='/AIV/49/5/33'>Ephesians 5:33</a>; <a href='/AIV/20/31/10'>Proverbs 31:10</a>",
      "comment": "The decree enshrines respect and order within marriage, a biblical principle reaffirmed by the apostles, yet always perfected through grace. Such order reflects a higher spiritual harmony."
    },
    {
      "pk": 4100121,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 21,
      "text": "The proposal pleased the king and the princes, and the king did as Memucan suggested:",
      "links": "<a href='/AIV/09/18/23'>1 Samuel 18:23</a>; <a href='/AIV/44/15/22'>Acts 15:22</a>",
      "comment": "Consensus and agreement show the importance of council and wisdom in leadership, a principle applied throughout the Old and New Testaments as reflective of the Spirit guiding the Church."
    },
    {
      "pk": 4100122,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 22,
      "text": "He sent letters to all the provinces of the kingdom, to each province in its own script and to every people in their own language, instructing that every man should be master in his own house and speak in the language of his own people.",
      "links": "<a href='/AIV/2/12/49'>Exodus 12:49</a>; <a href='/AIV/44/2/8'>Acts 2:8</a>",
      "comment": "This emphasis on unity amid diversity of tongue is an echo of the Pentecost event, where the Spirit enabled the apostles to be understood in all languages, prefiguring universality and harmony in faith."
    }
  ],
  "translatedAt": "2025-12-23T04:41:30.077Z"
}