{
  "book": "Esther",
  "bookAbbreviation": "Esth",
  "chapter": 6,
  "verses": [
    {
      "pk": 22006001,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 1,
      "text": "That night, the king could not sleep, so he ordered that the book of memorable deeds, the chronicles, be brought in, and they were read before the king.",
      "links": "<a href='/AIV/17/2/23'>Esth. 2:23</a>",
      "comment": "The king’s insomnia, which leads to the salvation of the Jews, indicates how Providence can work through ordinary events. The 'chronicles' record was a common practice in Persian courts (Esth. 2:23)."
    },
    {
      "pk": 22006002,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 2,
      "text": "And it was found written how Mordecai had told about Bigthana and Teresh, two of the king’s eunuchs, who guarded the entrance and who had sought to lay hands on King Ahasuerus.",
      "links": "<a href='/AIV/17/2/21-23'>Esth. 2:21–23</a>",
      "comment": "This recalls the earlier act of loyalty by Mordecai (Esth. 2:21–23), which had not yet been rewarded. The justice of reward is a theme—faithful acts are ultimately recognized in time, resembling New Testament teaching on eternal reward (cf. Matt. 25:21)."
    },
    {
      "pk": 22006003,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 3,
      "text": "And the king said, 'What honor or distinction has been given to Mordecai for this?' Then the king’s servants who attended him said, 'Nothing has been done for him.'",
      "links": "<a href='/AIV/17/10/3'>Esth. 10:3</a>",
      "comment": "Mordecai’s good deed had gone unrewarded until now, reflecting the mysterious timing of divine providence. The concept of honor here also foreshadows Christ, who was despised before being exalted (cf. Phil. 2:9)."
    },
    {
      "pk": 22006004,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 4,
      "text": "And the king said, 'Who is in the court?' Now Haman had just entered the outer court of the king’s house to speak to the king about hanging Mordecai on the gallows that he had prepared for him.",
      "links": "<a href='/AIV/17/5/14'>Esth. 5:14</a>",
      "comment": "Haman’s timing highlights the irony and reversal in God’s plan. Wicked plans are often used for good by Providence, as Joseph proclaimed in Gen. 50:20."
    },
    {
      "pk": 22006005,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 5,
      "text": "And the king’s servants said to him, 'Haman is standing in the court.' And the king said, 'Let him come in.'",
      "links": "",
      "comment": "The invitation to Haman, without the king’s awareness of his intentions, shows how human plans are subject to the higher wisdom of God (cf. Prov. 16:9)."
    },
    {
      "pk": 22006006,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 6,
      "text": "So Haman came in, and the king said to him, 'What should be done for the man whom the king desires to honor?' And Haman said to himself, 'Whom would the king desire to honor more than me?'",
      "links": "<a href='/AIV/17/3/1-2'>Esth. 3:1–2</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Haman’s pride blinds him to the real recipient. Pride comes before a fall (Prov. 16:18). There is a parallel with Jesus’s teaching on humility and reversal (Luke 14:11)."
    },
    {
      "pk": 22006007,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 7,
      "text": "And Haman said to the king, 'For the man whom the king desires to honor,",
      "links": "",
      "comment": "Haman assumes the king’s favor is for himself. The expectation is shattered dramatically—mirroring the biblical theme that the humble are often exalted unexpectedly."
    },
    {
      "pk": 22006008,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 8,
      "text": "let royal robes be brought, which the king has worn, and a horse on which the king has ridden, and on whose head a royal crown is placed.",
      "links": "<a href='/AIV/41/11/7'>Mark 11:7</a>",
      "comment": "Bestowing royal robes and a horse are marks of the highest distinction. This foreshadows Christ’s entry into Jerusalem, clothed and honored as King (Mark 11:7)."
    },
    {
      "pk": 22006009,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 9,
      "text": "And let the robes and the horse be handed over to one of the king’s most noble officials; and let them dress the man whom the king desires to honor, and let him be led on horseback through the city square, proclaiming before him, ‘Thus it shall be done to the man whom the king delights to honor!’”",
      "links": "<a href='/AIV/40/21/7-9'>Matt. 21:7–9</a>",
      "comment": "Public recognition and proclamation echo the motif of honoring the just. Note the liturgical procession-like imagery, similar to Christ’s Palm Sunday entry (Matt. 21:7–9); these processions have significant symbolic meaning throughout salvation history."
    },
    {
      "pk": 22006010,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 10,
      "text": "Then the king said to Haman, 'Quickly! Take the robes and the horse, just as you have said, and do so for Mordecai the Jew, who sits at the king’s gate. Leave nothing out of all that you have mentioned.'",
      "links": "<a href='/AIV/17/2/19'>Esth. 2:19</a>",
      "comment": "The reversal is complete. Mordecai, previously excluded, is now the recipient of honor. The king’s precise command also implies the effectiveness of intercessory prayer and mediation, key elements in both Jewish and Christian spirituality."
    },
    {
      "pk": 22006011,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 11,
      "text": "So Haman took the robes and the horse, dressed Mordecai, and led him on horseback through the city square, proclaiming before him, ‘Thus it shall be done to the man whom the king delights to honor!’",
      "links": "<a href='/AIV/17/8/15'>Esth. 8:15</a>",
      "comment": "Haman’s humiliation is a consequence of pride; Mordecai’s elevation manifests divine justice. This passage prefigures the paradox of Christian victory through apparent defeat, a central mystery in the life of Christ."
    },
    {
      "pk": 22006012,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 12,
      "text": "Then Mordecai returned to the king’s gate. But Haman hurried to his house, mourning and his head covered.",
      "links": "<a href='/AIV/17/4/1'>Esth. 4:1</a>",
      "comment": "Haman’s mourning—his head covered—is a traditional sign of grief or shame (Esth. 4:1). The contrast with Mordecai’s humility is stark. Christianity likewise values penitence and humility leading to exaltation."
    },
    {
      "pk": 22006013,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 13,
      "text": "And Haman recounted to Zeresh his wife and all his friends everything that had happened to him. Then his wise men and his wife Zeresh said to him, 'If Mordecai, before whom you have begun to fall, is of Jewish descent, you will not overcome him but will surely fall before him.'",
      "links": "<a href='/AIV/17/4/14'>Esth. 4:14</a>",
      "comment": "Zeresh’s prophecy underscores the invincibility of God’s chosen ones. Echoes of this assurance are seen in the promises made to the Church in the New Testament (cf. Matt. 16:18)."
    },
    {
      "pk": 22006014,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 14,
      "text": "While they were still talking with him, the king’s eunuchs arrived and hurried Haman to the banquet that Esther had prepared.",
      "links": "<a href='/AIV/17/5/8'>Esth. 5:8</a>; <a href='/AIV/17/7/1'>Esth. 7:1</a>",
      "comment": "The verse sets up the final reversal at Esther’s banquet. The ‘prepared banquet’ motif foreshadows themes of the wedding feast in Christian eschatology (cf. Rev. 19:9), showing the importance of readiness, obedience, and the mysterious preparation God has for the faithful."
    }
  ],
  "translatedAt": "2025-12-23T04:43:12.485Z"
}