{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 13,
  "verses": [
    {
      "pk": 18013001,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 1,
      "text": "Look, my eye has seen all this, my ear has heard and understood it.",
      "links": "<a href='/AIV/18/12/3'>Job 12:3</a>",
      "comment": "Job begins by asserting he possesses understanding equal to his friends. This highlights his readiness to defend his position and appeals to both reason and personal experience, an approach often used in apologetics."
    },
    {
      "pk": 18013002,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 2,
      "text": "What you know, I also know; I am not inferior to you.",
      "links": "<a href='/AIV/18/12/3'>Job 12:3</a>",
      "comment": "Job rejects any intellectual superiority claimed by his friends, emphasizing equality in knowledge and setting the stage for his personal testimony."
    },
    {
      "pk": 18013003,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 3,
      "text": "Yet I desire to speak to the Almighty; I want to argue my case before God.",
      "links": "<a href='/AIV/18/9/32-35'>Job 9:32-35</a>",
      "comment": "Job's yearning to approach God directly prefigures the New Testament teaching of approaching God through a mediator (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>). His desire shows faith in God’s justice and the possibility of a personal relationship with the divine."
    },
    {
      "pk": 18013004,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 4,
      "text": "But you are smearers with lies; you are all worthless physicians.",
      "links": "<a href='/AIV/18/16/2'>Job 16:2</a>",
      "comment": "Job accuses his friends of being inadequate comforters, a reminder that merely human wisdom is insufficient to heal deep suffering. God’s true healing often requires submission to divine revelation."
    },
    {
      "pk": 18013005,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 5,
      "text": "If only you would be silent! That would be wisdom for you.",
      "links": "<a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Wisdom is sometimes shown in silence, as Proverbs attests. In spiritual matters, silence can be reverent, showing humility before mystery."
    },
    {
      "pk": 18013006,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 6,
      "text": "Listen now to my reasoning, and hear the pleading of my lips.",
      "links": "<a href='/AIV/18/33/1'>Job 33:1</a>",
      "comment": "Job’s request for attentive listening echoes the biblical need to hear both sides of a matter. There is a longing for fair judgment and spiritual discernment."
    },
    {
      "pk": 18013007,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 7,
      "text": "Will you speak falsely for God, and speak deceitfully for him?",
      "links": "<a href='/AIV/18/42/7'>Job 42:7</a>",
      "comment": "Job cautions against misrepresenting God, an admonition to respect divine mystery and avoid presuming full understanding of His ways—a principle vital for the unity of faith."
    },
    {
      "pk": 18013008,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 8,
      "text": "Will you show partiality for him, or will you argue the case for God?",
      "links": "<a href='/AIV/05/16/19'>Deut. 16:19</a>",
      "comment": "Condemning partiality and presuming to defend God, Job calls for honest justice. Echoes the scriptural theme that true faith judges with righteousness."
    },
    {
      "pk": 18013009,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 9,
      "text": "Will it be well when he examines you? Can you deceive him as you would deceive a man?",
      "links": "<a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>",
      "comment": "God's omniscience thwarts deception—a central biblical theme. Recognizing this leads to humility and dependence on divine mercy."
    },
    {
      "pk": 18013010,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 10,
      "text": "He will surely rebuke you if you secretly show partiality.",
      "links": "<a href='/AIV/20/24/23'>Prov. 24:23</a>",
      "comment": "Job warns that God rebukes injustice, pointing to the need for holiness and integrity in earthly judgment, themes elevated throughout Scripture."
    },
    {
      "pk": 18013011,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 11,
      "text": "Will not his majesty terrify you and the dread of him fall upon you?",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>",
      "comment": "Job reminds his friends of God’s awe-inspiring majesty, a motif that inspires respectful fear and is key to true wisdom."
    },
    {
      "pk": 18013012,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 12,
      "text": "Your maxims are proverbs of ashes; your defenses crumble like clay.",
      "links": "<a href='/AIV/18/4/19'>Job 4:19</a>",
      "comment": "Human wisdom apart from God proves transient and empty, as highlighted by the imagery of ashes and clay."
    },
    {
      "pk": 18013013,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 13,
      "text": "Be silent! Let me speak, and let whatever may come upon me come.",
      "links": "<a href='/AIV/18/13/5'>Job 13:5</a>",
      "comment": "Job’s resolve to speak truth regardless of consequences prefigures prophetic courage later seen in Christ and the apostles (<a href='/AIV/40/10/19-20'>Matt. 10:19-20</a>)."
    },
    {
      "pk": 18013014,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 14,
      "text": "Why should I take my flesh in my teeth and put my life in my hands?",
      "links": "<a href='/AIV/07/12/3'>Judg. 12:3</a>",
      "comment": "Job uses vivid imagery of risk, emphasizing his willingness to entrust himself wholly to God—an act of surrender and faith."
    },
    {
      "pk": 18013015,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 15,
      "text": "Though he slay me, yet I will hope in him; but I will defend my ways to his face.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/19/73/26'>Ps. 73:26</a>",
      "comment": "Job’s paradoxical faith under suffering echoes later scenes of Christ’s faithfulness unto death. This verse is a profound testimony to hope and perseverance, even amidst suffering, and spiritual abandonment."
    },
    {
      "pk": 18013016,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 16,
      "text": "This will be my salvation, for no hypocrite may come before him.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>",
      "comment": "Job recognizes that only the sincere may approach God—a theme later developed in both sacramental and spiritual teachings about purity and holiness."
    },
    {
      "pk": 18013017,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 17,
      "text": "Listen closely to my speech, and let my declaration be in your ears.",
      "links": "<a href='/AIV/18/21/2'>Job 21:2</a>",
      "comment": "Again Job insists on being heard, showing the value of attentive listening and careful discernment in spiritual dialogue."
    },
    {
      "pk": 18013018,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 18,
      "text": "Look, I have prepared my case; I know that I shall be vindicated.",
      "links": "<a href='/AIV/18/9/15'>Job 9:15</a>, <a href='/AIV/45/8/33'>Rom. 8:33</a>",
      "comment": "Job’s confidence in vindication ultimately points to the hope of resurrection and final justification before God as later developed in the New Testament."
    },
    {
      "pk": 18013019,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 19,
      "text": "Who will contend with me? For then I would be silent and die.",
      "links": "<a href='/AIV/18/9/32'>Job 9:32</a>",
      "comment": "This rhetorical question shows Job’s trust that God alone is the ultimate judge."
    },
    {
      "pk": 18013020,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 20,
      "text": "Only grant me these two things, then I will not hide from your face:",
      "links": "<a href='/AIV/18/9/34'>Job 9:34</a>",
      "comment": "Job appeals to God for mercy, desiring direct and honest interaction."
    },
    {
      "pk": 18013021,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 21,
      "text": "Remove your hand far from me, and let not your terror frighten me.",
      "links": "<a href='/AIV/18/9/34'>Job 9:34</a>",
      "comment": "Job asks for relief from God's overwhelming power so he may approach in dialogue—showing the yearning for a mediator and gentle approach found in later redemptive themes."
    },
    {
      "pk": 18013022,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 22,
      "text": "Then call, and I will answer; or let me speak, and you reply to me.",
      "links": "<a href='/AIV/18/9/34-35'>Job 9:34-35</a>",
      "comment": "Job desires straightforward communication with God, an echo of the desire for spiritual dialogue and prayer."
    },
    {
      "pk": 18013023,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 23,
      "text": "How many are my iniquities and my sins? Make known to me my transgression and my sin.",
      "links": "<a href='/AIV/19/19/12'>Ps. 19:12</a>; <a href='/AIV/19/139/23-24'>Ps. 139:23-24</a>",
      "comment": "Job’s plea for self-examination and confession foreshadows the importance of honest acknowledgment of sin, a key element of the biblical journey toward redemption."
    },
    {
      "pk": 18013024,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 24,
      "text": "Why do you hide your face and count me as your enemy?",
      "links": "<a href='/AIV/19/88/14'>Ps. 88:14</a>",
      "comment": "The motif of God hiding his face appears frequently in the Psalms, expressing anguish yet ultimately hope for restoration of divine favor."
    },
    {
      "pk": 18013025,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 25,
      "text": "Will you frighten a driven leaf and pursue dry chaff?",
      "links": "<a href='/AIV/19/35/5'>Ps. 35:5</a>",
      "comment": "Job’s humility is vivid, acknowledging frailty. God's attention to the weakest shows both his justice and mercy."
    },
    {
      "pk": 18013026,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 26,
      "text": "For you write bitter things against me and make me inherit the sins of my youth.",
      "links": "<a href='/AIV/19/25/7'>Ps. 25:7</a>",
      "comment": "This points to the idea that sins have lasting consequences but also to the need for atonement and forgiveness available through divine means."
    },
    {
      "pk": 18013027,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 27,
      "text": "You put my feet in the stocks and watch all my paths; you mark out the soles of my feet.",
      "links": "<a href='/AIV/18/33/11'>Job 33:11</a>",
      "comment": "The imagery signifies limitation and scrutiny, evoking God’s sovereign control but also compassion for those who submit to His correction."
    },
    {
      "pk": 18013028,
      "translation": "AIV",
      "book": 18,
      "chapter": 13,
      "verse": 28,
      "text": "A man wastes away like something rotten, like a garment eaten by moths.",
      "links": "<a href='/AIV/19/39/11'>Ps. 39:11</a>; <a href='/AIV/23/51/8'>Isa. 51:8</a>",
      "comment": "This final verse emphasizes human mortality and the need for divine intervention and transformation—an image found throughout Scripture, ultimately pointing to the hope of resurrection and renewal."
    }
  ],
  "translatedAt": "2025-12-23T05:20:23.914Z"
}