{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 19,
  "verses": [
    {
      "pk": 1819001,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "",
      "comment": "Job’s reply begins; context shows he is responding to his friends’ accusations. The direct address sets the stage for his lament."
    },
    {
      "pk": 1819002,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 2,
      "text": "How long will you torment me and break me to pieces with words?",
      "links": "<a href='/AIV/18/16/2'>Job 16:2</a>",
      "comment": "Job’s suffering is compounded by his friends’ harsh words; compare Job 16:2 where Job refers to his friends as 'miserable comforters.'"
    },
    {
      "pk": 1819003,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 3,
      "text": "Ten times you have reproached me; you are not ashamed to wrong me.",
      "links": "<a href='/AIV/01/31/7'>Gen. 31:7</a>",
      "comment": "'Ten times' is a figurative expression meaning 'often' (see Gen. 31:7). Job accuses his friends of being relentless and unjust."
    },
    {
      "pk": 1819004,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 4,
      "text": "And if indeed I have erred, my error remains with me.",
      "links": "<a href='/AIV/18/6/24'>Job 6:24</a>",
      "comment": "Job insists that, even if he were at fault, it concerns only himself, challenging the assertion that his suffering is due to God's judgment."
    },
    {
      "pk": 1819005,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 5,
      "text": "If you would truly exalt yourselves over me and use my disgrace against me,",
      "links": "",
      "comment": "Job recognizes the pride of his friends; they use his suffering as evidence against him."
    },
    {
      "pk": 1819006,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 6,
      "text": "then know that God has wronged me and has surrounded me with His net.",
      "links": "<a href='/AIV/18/6/4'>Job 6:4</a>",
      "comment": "Job perceives God as the source of his suffering, like being trapped in a net—see also Job 6:4 for similar language."
    },
    {
      "pk": 1819007,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 7,
      "text": "Look, I cry, 'Violence!' but I am not answered; I call for help, but there is no justice.",
      "links": "<a href='/AIV/16/5/15'>Neh. 5:15</a>",
      "comment": "Job feels forsaken and unheard, emphasizing his sense of injustice and abandonment."
    },
    {
      "pk": 1819008,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 8,
      "text": "He has fenced up my path so I cannot pass, and He has set darkness upon my ways.",
      "links": "<a href='/AIV/18/3/23'>Job 3:23</a>",
      "comment": "God’s 'fencing' recalls Job 3:23, describing the limitations and frustration placed upon him."
    },
    {
      "pk": 1819009,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 9,
      "text": "He has stripped me of my glory and taken the crown from my head.",
      "links": "",
      "comment": "Job uses royal imagery; loss of glory and crown symbolizes his complete humiliation and despair."
    },
    {
      "pk": 1819010,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 10,
      "text": "He breaks me down on every side, so I am gone; He has uprooted my hope like a tree.",
      "links": "<a href='/AIV/18/14/7-9'>Job 14:7–9</a>",
      "comment": "Job’s hope is depicted as uprooted; in Job 14, a felled tree can grow again, but here the hope is gone—showing profound despair."
    },
    {
      "pk": 1819011,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 11,
      "text": "He has kindled His wrath against me and considers me as one of His enemies.",
      "links": "<a href='/AIV/18/13/24'>Job 13:24</a>",
      "comment": "Job’s sense of alienation from God is intense; compare Job 13:24, where he feels abandoned."
    },
    {
      "pk": 1819012,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 12,
      "text": "His troops advance together and build up their way against me; they encamp around my tent.",
      "links": "<a href='/AIV/19/27/3'>Ps. 27:3</a>",
      "comment": "Imagery dramatizes Job’s siege-like suffering. Troops symbolize overwhelming adversities, similar to David’s depiction in Psalm 27:3."
    },
    {
      "pk": 1819013,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 13,
      "text": "He has removed my brothers far from me, and my acquaintances are completely estranged from me.",
      "links": "<a href='/AIV/19/88/8'>Ps. 88:8</a>",
      "comment": "Job describes his isolation; compare Psalm 88:8, where the psalmist is similarly deserted."
    },
    {
      "pk": 1819014,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 14,
      "text": "My relatives have failed me, and my close friends have forgotten me.",
      "links": "",
      "comment": "Echoes the theme of desertion. Job’s suffering has driven away even those closest to him."
    },
    {
      "pk": 1819015,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 15,
      "text": "Those who dwell in my house and my maids regard me as a stranger; I am a foreigner in their eyes.",
      "links": "",
      "comment": "Job is cut off from household intimacy, reflecting complete social and relational isolation."
    },
    {
      "pk": 1819016,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 16,
      "text": "I call to my servant, but he doesn’t answer; I must plead with him with my mouth.",
      "links": "",
      "comment": "Job’s suffering has inverted household hierarchy—he begs his own servant, showing his loss of dignity."
    },
    {
      "pk": 1819017,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 17,
      "text": "My breath is repulsive to my wife, and I am loathsome to my own brothers.",
      "links": "",
      "comment": "Physical suffering is so severe even those closest recoil; the Hebrew word for 'brothers' can also include other family members."
    },
    {
      "pk": 1819018,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 18,
      "text": "Even young children despise me; when I rise, they speak against me.",
      "links": "",
      "comment": "Job’s shame is total—even children, lowest on the social scale, mock him."
    },
    {
      "pk": 1819019,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 19,
      "text": "All my intimate friends abhor me, and those I loved have turned against me.",
      "links": "",
      "comment": "Repeated emphasis: Job is abandoned even by those he cared for most."
    },
    {
      "pk": 1819020,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 20,
      "text": "My bones cling to my skin and to my flesh, and I have escaped by the skin of my teeth.",
      "links": "",
      "comment": "Vivid expression for near-death; 'skin of my teeth' still used in English for narrow escape."
    },
    {
      "pk": 1819021,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 21,
      "text": "Have pity on me, have pity on me, O you my friends, for the hand of God has struck me!",
      "links": "",
      "comment": "Job pleads for compassion, not judgment, emphasizing it is God who has inflicted him."
    },
    {
      "pk": 1819022,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 22,
      "text": "Why do you persecute me as God does and are not satisfied with my flesh?",
      "links": "",
      "comment": "Job rebukes his friends for exceeding reason in their condemnation—he has suffered enough."
    },
    {
      "pk": 1819023,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 23,
      "text": "Oh, that my words were written! Oh, that they were inscribed in a book!",
      "links": "<a href='/AIV/24/36/2'>Jer. 36:2</a>",
      "comment": "Job wishes his case were recorded for posterity—a reference to the enduring nature of the written word."
    },
    {
      "pk": 1819024,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 24,
      "text": "That with an iron pen and lead they might be engraved in rock forever!",
      "links": "",
      "comment": "Iron pen and lead were used for permanent inscriptions in stone; Job desires vindication beyond his life."
    },
    {
      "pk": 1819025,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 25,
      "text": "For I know that my Redeemer lives, and at last He will stand upon the earth.",
      "links": "<a href='/AIV/42/24/39'>Luke 24:39</a>; <a href='/AIV/18/16/19'>Job 16:19</a>; <a href='/AIV/23/47/4'>Isa. 47:4</a>",
      "comment": "Job’s declaration of a living 'Redeemer' is a high point of faith in suffering. Traditionally interpreted in Christian theology as prophetic of Christ’s resurrection and intercessory role. The term 'Redeemer' here can mean 'vindicator' but points toward the hope for a personal, living savior. Spiritual interpretation sees a promise of bodily resurrection (cf. Luke 24:39), and the vindication of the righteous."
    },
    {
      "pk": 1819026,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 26,
      "text": "And after my skin has been destroyed, yet in my flesh I shall see God,",
      "links": "<a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "Job expresses belief in life after death; a literal reading affirms bodily resurrection, while spiritually it denotes hope in final communion with God. Christians often see this as looking forward to resurrection as taught by Christ (John 11:25)."
    },
    {
      "pk": 1819027,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 27,
      "text": "Whom I shall see for myself, and my eyes shall behold, and not another. My heart yearns within me.",
      "links": "<a href='/AIV/19/17/15'>Ps. 17:15</a>",
      "comment": "Personal vision of God is affirmed; connection to Psalm 17:15, 'when I awake, I shall be satisfied with your likeness.' Both literal and spiritual hope is expressed."
    },
    {
      "pk": 1819028,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 28,
      "text": "If you say, 'How shall we pursue him?' and, 'The root of the matter is found in him,'",
      "links": "",
      "comment": "Job anticipates his friends’ desire to continue prosecution, implying they still seek to incriminate him."
    },
    {
      "pk": 1819029,
      "translation": "AIV",
      "book": 18,
      "chapter": 19,
      "verse": 29,
      "text": "Be afraid of the sword, for wrath brings punishment by the sword, so that you may know there is a judgment.",
      "links": "<a href='/AIV/01/9/6'>Gen. 9:6</a>; <a href='/AIV/18/31/28'>Job 31:28</a>",
      "comment": "Job warns them of divine judgment—God’s ultimate justice will be realized. Links to Gen. 9:6 (judgment by sword) and Job 31:28 (retribution for sin). Literal and spiritual senses both point to accountability before God."
    }
  ],
  "translatedAt": "2025-12-23T05:22:51.940Z"
}