{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 40,
  "verses": [
    {
      "pk": 400001,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 1,
      "text": "And the LORD answered Job and said:",
      "links": "<a href='/AIV/18/38/1'>Job 38:1</a>; <a href='/AIV/18/39/1'>Job 39:1</a>",
      "comment": "This verse begins the LORD's final speech to Job, continuing the direct address from previous chapters. The LORD's response signals both judgment and instruction following Job’s questions."
    },
    {
      "pk": 400002,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 2,
      "text": "\"Will the one who contends with the Almighty correct Him? Let him who argues with God answer.\"",
      "links": "<a href='/AIV/18/9/3'>Job 9:3</a>; <a href='/AIV/45/9/20'>Rom. 9:20</a>",
      "comment": "The LORD puts Job’s challenge in perspective, reflecting on the proper approach to divine mystery. Romans 9:20 echoes a similar warning about questioning God's will, pointing to human humility before God’s sovereignty."
    },
    {
      "pk": 400003,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 3,
      "text": "Then Job answered the LORD and said:",
      "links": "<a href='/AIV/18/42/1'>Job 42:1</a>",
      "comment": "Job’s reply marks his recognition of the LORD’s authority, foreshadowing his later repentance."
    },
    {
      "pk": 400004,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 4,
      "text": "\"Behold, I am insignificant. What can I answer You? I put my hand over my mouth.\"",
      "links": "<a href='/AIV/18/42/6'>Job 42:6</a>; <a href='/AIV/21/5/2'>Eccl. 5:2</a>",
      "comment": "Job displays humility, a foundational virtue. Silence before God suggests the necessity of reverence and awe, echoed in Ecclesiastes 5:2 and Job’s later contrition."
    },
    {
      "pk": 400005,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 5,
      "text": "\"I have spoken once, and I will not answer; twice, and I will say no more.\"",
      "links": "<a href='/AIV/18/33/14'>Job 33:14</a>",
      "comment": "Job surrenders argument, recognizing his limitations. This attitude encourages silent trust in divine wisdom."
    },
    {
      "pk": 400006,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 6,
      "text": "Then the LORD answered Job out of the whirlwind, and said:",
      "links": "<a href='/AIV/18/38/1'>Job 38:1</a>; <a href='/AIV/2/19/18'>Ex. 19:18</a>",
      "comment": "God speaks from the whirlwind—a symbol of divine power and majesty, seen also in Exodus 19:18. Theophanies like this point to the mystery of God's presence."
    },
    {
      "pk": 400007,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 7,
      "text": "\"Dress yourself now like a man; I will question you, and you shall answer Me.\"",
      "links": "<a href='/AIV/18/38/3'>Job 38:3</a>",
      "comment": "The LORD repeats the call for Job to respond, as in Job 38:3. The divine challenge tests Job’s understanding and submission."
    },
    {
      "pk": 400008,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 8,
      "text": "\"Will you really annul My judgment? Will you condemn Me so you may be justified?\"",
      "links": "<a href='/AIV/18/34/17'>Job 34:17</a>",
      "comment": "Here, God confronts the tendency to justify oneself at God’s expense. The rhetorical question underscores the perfection of divine justice. Spiritual meaning emphasizes righteous submission to God’s authority."
    },
    {
      "pk": 400009,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 9,
      "text": "\"Do you have an arm like God? Can you thunder with a voice like His?\"",
      "links": "<a href='/AIV/19/89/13'>Ps. 89:13</a>; <a href='/AIV/2/14/31'>Ex. 14:31</a>",
      "comment": "These questions highlight God’s omnipotence, echoed throughout the Psalms and Exodus. Physical and spiritual strength belong to God alone."
    },
    {
      "pk": 400010,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 10,
      "text": "\"Adorn yourself with majesty and dignity; clothe yourself with splendor and glory.\"",
      "links": "<a href='/AIV/19/104/1'>Ps. 104:1</a>",
      "comment": "God challenges Job to match His glory, alluding to the themes of divine kingship in the Psalms. Majesty and dignity are reserved for the LORD, inviting spiritual humility."
    },
    {
      "pk": 400011,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 11,
      "text": "\"Pour out the overflowings of your anger; look on everyone who is proud and bring him low.\"",
      "links": "<a href='/AIV/19/18/27'>Ps. 18:27</a>; <a href='/AIV/19/147/6'>Ps. 147:6</a>",
      "comment": "Only God can humble the proud and exercise righteous judgment. Spiritual meaning: Divine justice brings down the arrogant, a theme central to wisdom literature."
    },
    {
      "pk": 400012,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 12,
      "text": "\"Look on everyone who is proud and humble him; crush the wicked where they stand.\"",
      "links": "<a href='/AIV/19/101/8'>Ps. 101:8</a>; <a href='/AIV/19/136/17-20'>Ps. 136:17–20</a>",
      "comment": "This continues the theme of God’s unique authority over the proud and wicked, highlighting God's justice and mercy in the order of creation."
    },
    {
      "pk": 400013,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 13,
      "text": "\"Hide them all in the dust together; bind their faces in darkness.\"",
      "links": "<a href='/AIV/19/9/17'>Ps. 9:17</a>; <a href='/AIV/23/47/3'>Isa. 47:3</a>",
      "comment": "The imagery of dust and darkness points to divine judgment and the finality of God’s reign, linking with broader biblical motifs of mortality and the fate of the wicked."
    },
    {
      "pk": 400014,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 14,
      "text": "\"Then even I will confess to you that your own right hand can save you.\"",
      "links": "<a href='/AIV/19/44/3'>Ps. 44:3</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "No human strength or effort can match God's saving power—a subtle anticipation of the necessity of grace, and ultimately Christ as the only true source of salvation."
    },
    {
      "pk": 400015,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 15,
      "text": "\"Behold, Behemoth, which I made as I made you; he eats grass like an ox.\"",
      "links": "<a href='/AIV/18/39/9'>Job 39:9</a>; <a href='/AIV/19/104/14'>Ps. 104:14</a>",
      "comment": "The introduction of Behemoth marks a turn toward God’s creation, illustrating majesty and power. Some interpret Behemoth as a poetic symbol of creaturely strength under God's design."
    },
    {
      "pk": 400016,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 16,
      "text": "\"See now, his strength is in his loins, and his power is in the muscles of his belly.\"",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "Description emphasizes physical might as God’s gift, echoing Psalms’ portrayal of creation’s strength."
    },
    {
      "pk": 400017,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 17,
      "text": "\"He moves his tail like a cedar; the sinews of his thighs are knit together.\"",
      "links": "<a href='/AIV/18/41/12-17'>Job 41:12–17</a>",
      "comment": "The cedar implies grandeur, and the tightly knit sinews reflect God’s craftsmanship in creation."
    },
    {
      "pk": 400018,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 18,
      "text": "\"His bones are tubes of bronze, his limbs like bars of iron.\"",
      "links": "<a href='/AIV/19/18/33'>Ps. 18:33</a>",
      "comment": "Behemoth’s form represents unyielding strength, underpinning the lesson that all power originates from God."
    },
    {
      "pk": 400019,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 19,
      "text": "\"He is the first of the works of God; only his Maker can approach him with the sword.\"",
      "links": "<a href='/AIV/19/104/24'>Ps. 104:24</a>; <a href='/AIV/18/41/33'>Job 41:33</a>",
      "comment": "Behemoth’s status as ‘first’ of God’s works may imply both literal and spiritual preeminence among creatures. Only the Creator can master creation, alluding to sovereignty and dependence."
    },
    {
      "pk": 400020,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 20,
      "text": "\"For the mountains yield food for him, where all the wild beasts play.\"",
      "links": "<a href='/AIV/19/104/20'>Ps. 104:20</a>",
      "comment": "The mountains as Behemoth’s pasture highlight abundance and provision. God provides for all creatures, reflecting divine generosity."
    },
    {
      "pk": 400021,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 21,
      "text": "\"He lies under the lotus trees, in the shelter of the reeds and in the marsh.\"",
      "links": "<a href='/AIV/19/104/10'>Ps. 104:10</a>",
      "comment": "Natural imagery stresses how God gives shelter and sustenance to even the strongest of creatures—pointing to the depths of divine providence."
    },
    {
      "pk": 400022,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 22,
      "text": "\"The lotus trees cover him with their shade; the willows of the brook surround him.\"",
      "links": "<a href='/AIV/19/23/2'>Ps. 23:2</a>",
      "comment": "Shelter and shade depict rest and guarding by nature, a motif echoing Psalm 23’s peaceful provision."
    },
    {
      "pk": 400023,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 23,
      "text": "\"Behold, if the river rages, he is not alarmed; he is confident though the Jordan rushes against his mouth.\"",
      "links": "<a href='/AIV/19/46/3'>Ps. 46:3</a>",
      "comment": "Behemoth's fearlessness before mighty waters reflects untamed creation subject only to its Maker."
    },
    {
      "pk": 400024,
      "translation": "AIV",
      "book": 18,
      "chapter": 40,
      "verse": 24,
      "text": "\"Can anyone take him by the eyes or pierce his nose with a snare?\"",
      "links": "<a href='/AIV/18/41/1'>Job 41:1</a>",
      "comment": "The chapter closes with the rhetorical question emphasizing Behemoth’s indomitability. Creation’s mysterious power is a sign of God’s sovereignty, hinting at the need for trustful reverence and not presumption before the divine."
    }
  ],
  "translatedAt": "2025-12-23T05:32:57.831Z"
}