{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 8,
  "verses": [
    {
      "pk": 1898001,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 1,
      "text": "Then Bildad the Shuhite answered and said:",
      "links": "<a href='/AIV/18/2/11'>Job 2:11</a>",
      "comment": "Bildad is the second of Job's friends to speak. The dialogue continues as the friends seek to explain Job's suffering through their traditional beliefs."
    },
    {
      "pk": 1898002,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 2,
      "text": "How long will you say these things, and the words of your mouth be like a mighty wind?",
      "links": "<a href='/AIV/18/16/3'>Job 16:3</a>",
      "comment": "Bildad rebukes Job for his continued complaints, comparing them to a strong, destructive wind (an image for empty words)."
    },
    {
      "pk": 1898003,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 3,
      "text": "Does God pervert justice? Does the Almighty twist what is right?",
      "links": "<a href='/AIV/18/34/12'>Job 34:12</a>; <a href='/AIV/19/94/15'>Ps. 94:15</a>",
      "comment": "Bildad appeals to the righteousness and justice of God, affirming that God's ways are always just. This anticipates later Christian teaching about the unchanging justice and goodness of God."
    },
    {
      "pk": 1898004,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 4,
      "text": "If your children sinned against him, he has delivered them into the hand of their wrongdoing.",
      "links": "<a href='/AIV/18/1/18-19'>Job 1:18-19</a>",
      "comment": "Bildad suggests a direct link between sin and suffering, which will be challenged by the book's conclusion and in Christ’s own teaching (see <a href='/AIV/43/9/2-3'>John 9:2-3</a>), encouraging openness to mystery in God's providential economy."
    },
    {
      "pk": 1898005,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 5,
      "text": "If you will seek God and plead with the Almighty for mercy,",
      "links": "<a href='/AIV/19/32/6'>Ps. 32:6</a>",
      "comment": "Bildad invites Job to repentance and prayer. This foreshadows the biblical pattern of appeal to divine mercy, as fulfilled ultimately in Christ and accessed through humble prayer and supplication."
    },
    {
      "pk": 1898006,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 6,
      "text": "if you are pure and upright, surely then he will awaken for you and restore your rightful habitation.",
      "links": "<a href='/AIV/18/11/14-15'>Job 11:14-15</a>",
      "comment": "The conditional logic of retribution is reflected here: purity leads to restoration. The gospel corrects a simplistic view of suffering and reward (see <a href='/AIV/40/5/10-12'>Matt. 5:10-12</a>), situating suffering within a greater redemptive purpose."
    },
    {
      "pk": 1898007,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 7,
      "text": "Though your beginning was small, your latter days will be very great.",
      "links": "<a href='/AIV/18/42/12'>Job 42:12</a>; <a href='/AIV/38/4/10'>Zech. 4:10</a>",
      "comment": "A principle of hope: God is able to turn small beginnings into greater blessings, a theme seen again when Job is restored at the end. Spiritually, this verse resonates with the reward promised to the faithful (cf. <a href='/AIV/40/13/31-32'>Matt. 13:31-32</a>)."
    },
    {
      "pk": 1898008,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 8,
      "text": "For inquire, please, of former generations, and consider what their fathers have searched out.",
      "links": "<a href='/AIV/18/15/18'>Job 15:18</a>",
      "comment": "Bildad appeals to tradition, urging Job to heed the wisdom of past generations. The call to receive trusted traditions and the wisdom handed down anticipates the way doctrine and practice are maintained throughout salvation history."
    },
    {
      "pk": 1898009,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 9,
      "text": "For we are of yesterday and know nothing, for our days on earth are only a shadow.",
      "links": "<a href='/AIV/18/14/2'>Job 14:2</a>; <a href='/AIV/19/39/5'>Ps. 39:5</a>",
      "comment": "Human life is brief; humility in the face of inherited wisdom is promoted. Recognizing our limitations draws us toward dependence on God’s revelation, as ultimately fulfilled in the coming of Christ, the true Wisdom."
    },
    {
      "pk": 1898010,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 10,
      "text": "Will they not teach you and speak to you and bring forth words from their understanding?",
      "links": "<a href='/AIV/20/1/8'>Prov. 1:8</a>",
      "comment": "Bildad emphasizes learning from the community’s spiritual heritage—a theme that echoes in the exhortation to ‘obey those who teach you’ (<a href='/AIV/58/13/17'>Heb. 13:17</a>)."
    },
    {
      "pk": 1898011,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 11,
      "text": "Can papyrus grow where there is no marsh? Can reeds flourish without water?",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>",
      "comment": "Natural law is invoked as a metaphor: blessing is likened to dependence on a life-giving source. Spiritually, fullness of life in God is only possible when rooted in Him, drawing a subtle parallel with sacramental life and grace."
    },
    {
      "pk": 1898012,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 12,
      "text": "While still in its greenness and not cut down, it withers faster than any plant.",
      "links": "<a href='/AIV/23/40/6-8'>Isa. 40:6-8</a>",
      "comment": "A vivid image of the fleeting nature of life without a secure foundation in God. This foreshadows Christ’s call to abide in Him for enduring fruit (<a href='/AIV/43/15/5'>John 15:5</a>)."
    },
    {
      "pk": 1898013,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 13,
      "text": "So are the paths of all who forget God; the hope of the godless will perish.",
      "links": "<a href='/AIV/18/27/8'>Job 27:8</a>",
      "comment": "Bildad warns that forgetting God leads only to ruin. The call to perseverance and remembrance of God’s works prefigures themes echoed in Jesus’ own warnings about building a life on a solid foundation (<a href='/AIV/40/7/24-27'>Matt. 7:24-27</a>)."
    },
    {
      "pk": 1898014,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 14,
      "text": "His confidence is cut off, and his trust is like a spider’s web.",
      "links": "<a href='/AIV/23/59/5-6'>Isa. 59:5-6</a>",
      "comment": "A poetic depiction of false hope—delicate, fleeting, unable to support. The web image also subtly recalls the futility of self-reliance apart from God, and directs us to trust in the true Rock."
    },
    {
      "pk": 1898015,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 15,
      "text": "He leans on his house, but it will not stand; he takes hold of it, but it will not endure.",
      "links": "<a href='/AIV/23/30/12-13'>Isa. 30:12-13</a>",
      "comment": "The perishable nature of earthly security is highlighted. True stability is found in what endures—the living faith, tradition, and the assembly of the faithful."
    },
    {
      "pk": 1898016,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 16,
      "text": "He is a well-watered plant in the sunshine, and its shoots spread over its garden.",
      "links": "<a href='/AIV/19/92/12-13'>Ps. 92:12-13</a>",
      "comment": "In prosperity, the wicked may appear to flourish; yet apart from authentic rootedness, this is superficial. The imagery anticipates the parables of Jesus concerning the wheat and tares (<a href='/AIV/40/13/24-30'>Matt. 13:24-30</a>)."
    },
    {
      "pk": 1898017,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 17,
      "text": "Its roots intertwine among the stones; it looks for a place among the rocks.",
      "links": "<a href='/AIV/18/29/19'>Job 29:19</a>",
      "comment": "A plant seeking a foundation in rocky ground has only an appearance of strength. Spiritually, true rootedness requires deeper communion with God and his works—hints at the importance of more than mere external observance."
    },
    {
      "pk": 1898018,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 18,
      "text": "If it is uprooted from its place, its place will deny it, saying, ‘I have never seen you.’",
      "links": "<a href='/AIV/19/37/35-36'>Ps. 37:35-36</a>",
      "comment": "Ultimate security is found not in self or fleeting accomplishment, but in God’s enduring presence. Jesus uses similar language about those He does not know (<a href='/AIV/40/7/23'>Matt. 7:23</a>), urging us towards authentic relationship."
    },
    {
      "pk": 1898019,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 19,
      "text": "See, this is the joy of his way; and out of the earth others will spring up.",
      "links": "<a href='/AIV/19/103/16'>Ps. 103:16</a>",
      "comment": "Life’s brevity and replacement is emphasized—one generation passes, another takes its place. Yet hope lies in being planted by God into His covenant family."
    },
    {
      "pk": 1898020,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 20,
      "text": "Surely God does not reject a blameless man, nor take the hand of evildoers.",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "Bildad asserts God’s commitment to justice. Yet Job’s innocence points toward the mystery of redemptive suffering—a theme taken up and fulfilled in the passion of Christ."
    },
    {
      "pk": 1898021,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 21,
      "text": "He will yet fill your mouth with laughter and your lips with shouts of joy.",
      "links": "<a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "The promise of future restoration and joy for the righteous foreshadows God’s faithful action, ultimately fulfilled in the resurrection and the hope of everlasting life."
    },
    {
      "pk": 1898022,
      "translation": "AIV",
      "book": 18,
      "chapter": 8,
      "verse": 22,
      "text": "Those who hate you will be clothed with shame, and the tent of the wicked will be no more.",
      "links": "<a href='/AIV/19/132/18'>Ps. 132:18</a>",
      "comment": "The final justice of God ensures the downfall of evil. This anticipates the ultimate vindication of the righteous, a theme central to the hope of God’s people."
    }
  ],
  "translatedAt": "2025-12-23T05:18:26.695Z"
}