{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 9,
  "verses": [
    {
      "pk": 2009001,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "",
      "comment": "Job begins his reply to Bildad's arguments, initiating a profound reflection on God's nature and human righteousness."
    },
    {
      "pk": 2009002,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 2,
      "text": "\"Truly I know that this is so. But how can a mortal be right before God?",
      "links": "<a href='/AIV/19/143/2'>Psalm 143:2</a>; <a href='/AIV/45/3/20'>Romans 3:20</a>",
      "comment": "Job affirms God's justice, yet questions how anyone can be justified before Him, highlighting mankind's need for divine grace and foreshadowing New Testament teaching on justification."
    },
    {
      "pk": 2009003,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 3,
      "text": "If one wished to dispute with Him, he could not answer Him once in a thousand times.",
      "links": "<a href='/AIV/41/12/13'>Mark 12:13-17</a>",
      "comment": "God's wisdom and governance are far above human comprehension; even Jesus silenced His challengers, demonstrating God's unfathomable mind."
    },
    {
      "pk": 2009004,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 4,
      "text": "He is wise in heart and mighty in strength—who has hardened himself against Him and succeeded?",
      "links": "<a href='/AIV/18/4/17'>Job 4:17</a>",
      "comment": "Job recognizes God's unmatched wisdom and power; defiance against Him is futile. This echoes the lesson: humility before God is essential."
    },
    {
      "pk": 2009005,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 5,
      "text": "He moves mountains without them knowing it, overturning them in His anger.",
      "links": "<a href='/AIV/19/114/6'>Ps. 114:6</a>",
      "comment": "God's sovereign rule over creation is shown in His power to move mountains—imagery later applied to faith in Christ (Matthew 17:20)."
    },
    {
      "pk": 2009006,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 6,
      "text": "He shakes the earth out of its place, and its pillars tremble.",
      "links": "<a href='/AIV/19/75/3'>Ps. 75:3</a>",
      "comment": "This recalls God’s absolute control over all the cosmos, reinforcing both literal and spiritual senses: God is the foundation of all reality."
    },
    {
      "pk": 2009007,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 7,
      "text": "He commands the sun, and it does not rise; He seals up the stars.",
      "links": "<a href='/AIV/19/104/19'>Ps. 104:19</a>",
      "comment": "Job portrays God as master of celestial bodies. All creation is subject to His will, aligning with Christ who is described as the true light (John 1:9)."
    },
    {
      "pk": 2009008,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 8,
      "text": "He alone stretches out the heavens and walks on the waves of the sea.",
      "links": "<a href='/AIV/19/104/2'>Ps. 104:2</a>; <a href='/AIV/40/14/25'>Matthew 14:25</a>",
      "comment": "An early foreshadowing of Christ walking on water, attesting both to God's transcendence and Jesus' divinity in the New Testament."
    },
    {
      "pk": 2009009,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 9,
      "text": "He made the Bear, Orion, and the Pleiades, and the chambers of the south.",
      "links": "<a href='/AIV/18/38/31'>Job 38:31-32</a>",
      "comment": "Job references star constellations, highlighting God’s creative power—in keeping with Genesis 1:16, where God appoints the heavenly hosts."
    },
    {
      "pk": 2009010,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 10,
      "text": "He does great and unsearchable things, wonders without number.",
      "links": "<a href='/AIV/19/40/5'>Ps. 40:5</a>",
      "comment": "God’s works are beyond counting—communicating His mystery and inviting awe, a theme echoed throughout Scripture."
    },
    {
      "pk": 2009011,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 11,
      "text": "If He passes by me, I do not see Him; if He moves on, I do not notice Him.",
      "links": "<a href='/AIV/18/23/8'>Job 23:8-9</a>",
      "comment": "God’s presence is often hidden, reminding that faith sometimes involves trusting beyond what can be seen (2 Corinthians 5:7)."
    },
    {
      "pk": 2009012,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 12,
      "text": "If He snatches away, who can stop Him? Who can say to Him, 'What are You doing?'",
      "links": "<a href='/AIV/18/11/10'>Job 11:10</a>; <a href='/AIV/45/9/20'>Romans 9:20</a>",
      "comment": "God’s authority is unquestionable; Paul echoes this in Romans illustrating God as Potter, humanity as clay."
    },
    {
      "pk": 2009013,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 13,
      "text": "God will not turn back His anger; the helpers of Rahab bow beneath Him.",
      "links": "<a href='/AIV/19/89/10'>Ps. 89:10</a>",
      "comment": "Rahab here symbolizes chaos subdued by God—an image of divine mastery over cosmic disorder, as noted also in Isaiah 51:9."
    },
    {
      "pk": 2009014,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 14,
      "text": "How then can I answer Him, or choose my words before Him?",
      "links": "<a href='/AIV/18/9/3'>Job 9:3</a>",
      "comment": "Job feels inadequate before God’s majesty; this humility is a theme in biblical wisdom literature (Proverbs 9:10)."
    },
    {
      "pk": 2009015,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 15,
      "text": "Even though I am right, I could not answer Him; I must appeal to my judge for mercy.",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>",
      "comment": "Job acknowledges the need for mercy, foreshadowing the deep biblical tradition that salvation is through grace, not works alone."
    },
    {
      "pk": 2009016,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 16,
      "text": "If I summoned Him and He answered me, I do not believe He would listen to my voice.",
      "links": "<a href='/AIV/18/21/15'>Job 21:15</a>",
      "comment": "Job’s sense of separation from God reflects the need for a mediator, anticipating the New Testament revelation of Christ as Mediator (1 Timothy 2:5)."
    },
    {
      "pk": 2009017,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 17,
      "text": "He crushes me with a storm and multiplies my wounds without cause.",
      "links": "<a href='/AIV/18/2/3'>Job 2:3</a>",
      "comment": "Job maintains his innocence, even as he suffers, reminiscent of Christ's innocent suffering (Isaiah 53:9)."
    },
    {
      "pk": 2009018,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 18,
      "text": "He will not let me catch my breath, but fills me with bitterness.",
      "links": "<a href='/AIV/18/7/19'>Job 7:19</a>",
      "comment": "Job’s ongoing distress echoes lament psalms, a spiritual tradition of honest prayer in times of trouble."
    },
    {
      "pk": 2009019,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 19,
      "text": "If it is a matter of strength, He is mighty! If it is of justice, who can summon Him?",
      "links": "<a href='/AIV/19/62/11'>Ps. 62:11</a>",
      "comment": "Both God’s strength and His justice are absolute, reinforcing the need for reverence and humility."
    },
    {
      "pk": 2009020,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 20,
      "text": "Though I am right, my own mouth would condemn me; though I am innocent, it would declare me guilty.",
      "links": "<a href='/AIV/19/130/3'>Ps. 130:3</a>",
      "comment": "Human words and self-assertion cannot justify before God—anticipating Paul’s teaching (Romans 3:23), all have sinned and need redemption."
    },
    {
      "pk": 2009021,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 21,
      "text": "I am blameless; I don't care for myself; I despise my life.",
      "links": "<a href='/AIV/18/7/16'>Job 7:16</a>",
      "comment": "Job’s despair echoes themes later seen in the Psalms and in the martyr’s spirit, letting go of self in search of God’s will."
    },
    {
      "pk": 2009022,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 22,
      "text": "It is all one; therefore I say, ‘He destroys both the blameless and the wicked.’",
      "links": "<a href='/AIV/18/21/23'>Job 21:23-26</a>",
      "comment": "Job recognizes the mystery of suffering, anticipating Christ's words on rain falling on both just and unjust (Matthew 5:45)."
    },
    {
      "pk": 2009023,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 23,
      "text": "When disaster brings sudden death, He mocks at the despair of the innocent.",
      "links": "<a href='/AIV/18/12/6'>Job 12:6</a>",
      "comment": "Job’s perception that God appears indifferent is shared by other biblical writers—though ultimately, God’s justice is perfect, even if hidden."
    },
    {
      "pk": 2009024,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 24,
      "text": "The earth is given into the hand of the wicked; He covers the faces of its judges. If it is not He, then who is it?",
      "links": "<a href='/AIV/18/21/7'>Job 21:7</a>",
      "comment": "Job notes injustice in the world, pointing to the persistent problem of evil, and the deep longing for divine justice and righteous leadership."
    },
    {
      "pk": 2009025,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 25,
      "text": "My days are swifter than a runner; they flee away, and I see no good.",
      "links": "<a href='/AIV/19/90/9'>Ps. 90:9</a>",
      "comment": "Job’s sense of life’s brevity echoes Psalm 90: Life is short—urging us to focus on eternity and hope in redemption."
    },
    {
      "pk": 2009026,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 26,
      "text": "They pass by like vessels made of reeds, like an eagle swooping down on prey.",
      "links": "<a href='/AIV/18/7/6'>Job 7:6</a>",
      "comment": "Images of fleetingness accentuate Job’s lament—reminding believers to seek what is lasting and to anchor hope in God’s enduring promises."
    },
    {
      "pk": 2009027,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 27,
      "text": "\"If I say, ‘I will forget my complaint, I will put off my sad face and be cheerful,’",
      "links": "<a href='/AIV/18/7/13'>Job 7:13-16</a>",
      "comment": "Job wrestles with his suffering, showing the struggle between resignation and hope—a familiar spiritual dynamic (Romans 8:18)."
    },
    {
      "pk": 2009028,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 28,
      "text": "I am afraid of all my sufferings, for I know You will not declare me innocent.",
      "links": "<a href='/AIV/18/10/15'>Job 10:15</a>",
      "comment": "Job’s fear betrays a yearning for assurance—spiritually, this echoes the human longing for forgiveness and reconciliation with God."
    },
    {
      "pk": 2009029,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 29,
      "text": "I shall be condemned; why then do I labor in vain?",
      "links": "<a href='/AIV/21/2/22'>Ecclesiastes 2:22</a>",
      "comment": "Job questions the meaning of striving for righteousness, a theme also explored in Ecclesiastes and resolved in grace under Christ."
    },
    {
      "pk": 2009030,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 30,
      "text": "If I wash myself with snow and cleanse my hands with lye,",
      "links": "<a href='/AIV/18/31/7'>Job 31:7'>Job 31:7</a>",
      "comment": "Job’s images of cleansing foreshadow sacramental language of spiritual purification, pointing to deeper realities of forgiveness."
    },
    {
      "pk": 2009031,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 31,
      "text": "Yet You will plunge me into a pit, and my own clothes will abhor me.",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>",
      "comment": "Even efforts at self-cleansing fail before God’s holiness—driving home the need for divine intervention, a theme fulfilled in Christ’s atonement."
    },
    {
      "pk": 2009032,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 32,
      "text": "\"For He is not a man like I am, that I might answer Him, that we could go to court together.",
      "links": "<a href='/AIV/04/23/19'>Numbers 23:19</a>",
      "comment": "God’s nature is infinitely beyond ours; only through a divine mediator can we approach Him—anticipating Christ’s unique role."
    },
    {
      "pk": 2009033,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 33,
      "text": "There is no umpire between us, who might lay his hand on both of us.",
      "links": "<a href='/AIV/54/2/5'>1 Timothy 2:5</a>",
      "comment": "Job desires a mediator, a longing fulfilled in the New Testament with Christ interceding on behalf of humanity, bridging God and man."
    },
    {
      "pk": 2009034,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 34,
      "text": "Let Him take His rod away from me, and let His dread not terrify me.",
      "links": "<a href='/AIV/19/39/10'>Ps. 39:10</a>",
      "comment": "Job’s plea for respite echoes the cry for deliverance often found in the Psalms; spiritual tradition encourages approaching God through trust and hope."
    },
    {
      "pk": 2009035,
      "translation": "AIV",
      "book": 18,
      "chapter": 9,
      "verse": 35,
      "text": "Then I would speak without fear of Him, for I am not so in myself.",
      "links": "<a href='/AIV/18/13/22'>Job 13:22</a>",
      "comment": "Job’s final remark acknowledges distance between God and man. The need for restoration and communion is ultimately realized through the Incarnation, inviting believers into deeper relationship with God through grace and mediation."
    }
  ],
  "translatedAt": "2025-12-23T05:18:54.272Z"
}