{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 35,
  "verses": [
    {
      "pk": 2063501,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 1,
      "text": "Elihu continued and said:",
      "links": "",
      "comment": "Elihu resumes his response, emphasizing his role as a teacher of wisdom amid Job's distress. Introduction similar to previous chapters (see <a href='/AIV/18/32/6'>Job 32:6</a>)."
    },
    {
      "pk": 2063502,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 2,
      "text": "\"Do you think this is right? You say, ‘My righteousness is greater than God’s.’",
      "links": "<a href='/AIV/18/32/2'>Job 32:2</a>; <a href='/AIV/18/34/5'>Job 34:5</a>",
      "comment": "Elihu accuses Job of claiming his own righteousness surpasses God's, subtly rebuking self-justification. Echoes the need for humility before God's holiness (see <a href='/AIV/19/143/2'>Ps. 143:2</a>)."
    },
    {
      "pk": 2063503,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 3,
      "text": "For you ask, ‘What profit is it to me? What do I gain more than if I had sinned?’",
      "links": "<a href='/AIV/18/21/15'>Job 21:15</a>; <a href='/AIV/18/34/9'>Job 34:9</a>",
      "comment": "Job’s complaint questions the practical benefits of righteousness. This highlights the temptation to seek immediate rewards from holiness, but the deeper truth points towards doing good for love of God, not just reward (<a href='/AIV/19/73/13'>Ps. 73:13</a>)."
    },
    {
      "pk": 2063504,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 4,
      "text": "\"I will answer you, and your friends with you.",
      "links": "",
      "comment": "Elihu addresses Job and his companions, seeking correction for all. This collective rebuke recalls the tradition of teaching authority and communal correction (see <a href='/AIV/20/27/17'>Prov. 27:17</a>)."
    },
    {
      "pk": 2063505,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 5,
      "text": "Look up to the heavens and see, and observe the clouds, which are higher than you.",
      "links": "<a href='/AIV/19/8/3'>Ps. 8:3</a>; <a href='/AIV/18/22/12'>Job 22:12'>Job 22:12</a>",
      "comment": "Elihu invites Job to contemplate God’s transcendence. The heavens symbolize God’s majesty above human understanding, suggesting our dependence on divine revelation for truth."
    },
    {
      "pk": 2063506,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 6,
      "text": "If you sin, what effect do you have on Him? If your transgressions are many, what does that do to Him?",
      "links": "<a href='/AIV/18/7/20'>Job 7:20</a>; <a href='/AIV/19/50/12'>Ps. 50:12</a>",
      "comment": "God is not diminished by human sin, yet sin harms our soul. This idea parallels teaching on mortal sin separating us from God’s grace (<a href='/AIV/23/59/2'>Isa. 59:2</a>)."
    },
    {
      "pk": 2063507,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 7,
      "text": "If you are righteous, what do you give Him, or what does He receive from your hand?",
      "links": "<a href='/AIV/18/22/3'>Job 22:3</a>; <a href='/AIV/19/16/2'>Ps. 16:2</a>",
      "comment": "Human righteousness does not add to God, yet we are called to holiness out of love, not mere obligation—hinting towards a life shaped by sacramental grace and divine communion."
    },
    {
      "pk": 2063508,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 8,
      "text": "Your wickedness affects only humans like yourself, and your righteousness only impacts other people.",
      "links": "<a href='/AIV/18/20/22'>Job 20:22</a>",
      "comment": "Elihu reminds Job that moral actions primarily affect fellow humans, not God directly. This supports community morality and responsibility, echoing perennial teaching on corporality and charity (<a href='/AIV/19/119/63'>Ps. 119:63</a>)."
    },
    {
      "pk": 2063509,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 9,
      "text": "\"People cry out because of oppression; they call for help because of the arm of the mighty.",
      "links": "<a href='/AIV/18/24/12'>Job 24:12</a>; <a href='/AIV/19/10/18'>Ps. 10:18</a>",
      "comment": "Human suffering leads to prayer, often seeking justice. Later biblical tradition links this to prayer as a means of entering into communion with God and with the faithful (see <a href='/AIV/19/34/17'>Ps. 34:17</a>)."
    },
    {
      "pk": 2063510,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 10,
      "text": "But no one says, ‘Where is God, my Maker, who gives songs in the night?’",
      "links": "<a href='/AIV/19/42/8'>Ps. 42:8</a>; <a href='/AIV/18/36/24'>Job 36:24</a>",
      "comment": "Elihu laments that people seldom seek spiritual consolation from God Himself. God's presence is the source of joy in darkness, foreshadowing themes of hope and worship in suffering."
    },
    {
      "pk": 2063511,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 11,
      "text": "Who teaches us more than the animals of the earth, and makes us wiser than the birds of the sky?",
      "links": "<a href='/AIV/18/12/7'>Job 12:7–10</a>",
      "comment": "God’s unique gift of reason elevates humans above creation, pointing towards humanity’s vocation to seek truth and wisdom through revelation and tradition."
    },
    {
      "pk": 2063512,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 12,
      "text": "There they cry, but He does not answer, because of the pride of evil men.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/20/15/29'>Prov. 15:29</a>",
      "comment": "God sometimes withholds response to those ensnared by pride. Humility is necessary for prayer to penetrate to God—a principle that echoes teaching on humility before receiving grace."
    },
    {
      "pk": 2063513,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 13,
      "text": "Surely God does not hear meaningless cries, nor does the Almighty regard them.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/19/18/41'>Ps. 18:41</a>",
      "comment": "Sincerity matters in prayer; rote words without faith or repentance are not effective. This prepares the foundation for later teachings on the necessity of true contrition."
    },
    {
      "pk": 2063514,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 14,
      "text": "\"How much less when you say that you do not see Him, that your case is before Him, and you are waiting for Him!",
      "links": "<a href='/AIV/18/23/8-9'>Job 23:8–9</a>; <a href='/AIV/19/77/7-9'>Ps. 77:7–9</a>",
      "comment": "Elihu chides the impatience for God’s response, touching on the mystery of divine providence and the necessity to trust even in silence."
    },
    {
      "pk": 2063515,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 15,
      "text": "And now, because God has not punished in anger, nor has He noticed your arrogance,",
      "links": "<a href='/AIV/19/103/8-10'>Ps. 103:8–10</a>",
      "comment": "Elihu points out God's longsuffering patience, inviting reflection on divine mercy rather than strict judgment, which is fulfilled later in salvation history."
    },
    {
      "pk": 2063516,
      "translation": "AIV",
      "book": 18,
      "chapter": 35,
      "verse": 16,
      "text": "Job opens his mouth in vain and multiplies words without knowledge.\"",
      "links": "<a href='/AIV/18/38/2'>Job 38:2</a>",
      "comment": "The final verse rebukes Job for speaking without true wisdom. This prepares for God's direct discourse, underlining the value of humble receptiveness to divine teaching—an attitude crucial for spiritual growth both individually and corporately."
    }
  ],
  "translatedAt": "2025-12-23T05:30:40.150Z"
}