{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 11,
  "verses": [
    {
      "pk": 192011,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 1,
      "text": "Then Zophar the Naamathite answered and said:",
      "links": "<a href='/ESV/18/2/11'>Job 2:11</a>",
      "comment": "Zophar is the third friend to speak. His words represent a challenge to Job's claims of innocence."
    },
    {
      "pk": 192012,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 2,
      "text": "Should a multitude of words go unanswered, and should a man full of talk be justified?",
      "links": "<a href='/ESV/18/8/2'>Job 8:2</a>",
      "comment": "Zophar criticizes Job for speaking at length, implying that lengthy speech does not make one right before God."
    },
    {
      "pk": 192013,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 3,
      "text": "Should your empty words silence men, and when you mock, should no one shame you?",
      "links": "<a href='/ESV/18/13/9'>Job 13:9</a>",
      "comment": "Zophar accuses Job of speaking without substance and mocking others, suggesting that truthful correction is necessary among believers (see <a href='/AIV/20/27/6'>Prov. 27:6</a>)."
    },
    {
      "pk": 192014,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 4,
      "text": "For you say, 'My teaching is pure, and I am clean in your eyes.'",
      "links": "<a href='/ESV/18/10/7'>Job 10:7</a>",
      "comment": "Zophar summarizes Job's claim of innocence, echoing Job 10:7. This theme relates to later New Testament understandings of righteousness only being fulfilled through divine means (cf. <a href='/AIV/45/3/10'>Rom. 3:10</a> and <a href='/AIV/46/1/30'>1 Cor. 1:30</a>)."
    },
    {
      "pk": 192015,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 5,
      "text": "But oh, that God would speak and open his lips against you,",
      "links": "<a href='/AIV/18/38/1'>Job 38:1</a>",
      "comment": "Zophar wishes God would intervene directly—a longing that anticipates God's discourse in Job 38. It also points to the need for divine revelation, as seen in the Incarnation (John 1:14)."
    },
    {
      "pk": 192016,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 6,
      "text": "and that he would declare to you the secrets of wisdom! For true wisdom has two sides. Know then that God exacts from you less than your guilt deserves.",
      "links": "<a href='/AIV/18/5/8'>Job 5:8</a>; <a href='/AIV/19/130/3'>Psalm 130:3</a>",
      "comment": "Zophar claims that God's wisdom is multifaceted and implies Job deserves even greater judgment—anticipating the teaching that only God's grace can save (cf. <a href='/AIV/49/2/8-9'>Eph. 2:8</a>)."
    },
    {
      "pk": 192017,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 7,
      "text": "Can you find out the deep things of God? Can you find out the limits of the Almighty?",
      "links": "<a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "This rhetorical question highlights human limitations in understanding God's mysteries, a theme fulfilled in Christ, who reveals God's nature (<a href='/AIV/43/1/18'>John 1:18</a>)."
    },
    {
      "pk": 192018,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 8,
      "text": "They are higher than heaven—what can you do? Deeper than Sheol—what can you know?",
      "links": "<a href='/AIV/19/139/8'>Psalm 139:8</a>",
      "comment": "The infinite knowledge of God is beyond reach. See also the mystery of Christ's descent and ascent (<a href='/AIV/49/4/9-10'>Eph. 4:9-10</a>)."
    },
    {
      "pk": 192019,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 9,
      "text": "Its measure is longer than the earth and broader than the sea.",
      "links": "<a href='/AIV/19/36/6'>Psalm 36:6</a>",
      "comment": "This language reflects the immeasurable scope of God's wisdom, a theme echoed throughout Scripture (<a href='/AIV/19/103/11'>Psalm 103:11</a>)."
    },
    {
      "pk": 192020,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 10,
      "text": "If he passes by and imprisons someone, and commands judgment, who can oppose him?",
      "links": "<a href='/AIV/54/6/15'>Dan. 4:35</a>",
      "comment": "Affirms the sovereignty of God over all things, much like later affirmations of God's absolute power (cf. <a href='/AIV/45/9/20'>Rom. 9:20</a>)."
    },
    {
      "pk": 192021,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 11,
      "text": "For he knows worthless men; when he sees iniquity, will he not take note of it?",
      "links": "<a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "God perceives human hearts; there is no hiding from him. See how Christ knows what is in man (<a href='/AIV/43/2/25'>John 2:25</a>)."
    },
    {
      "pk": 192022,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 12,
      "text": "But a witless man will become wise, when a wild donkey's colt is born a man.",
      "links": "<a href='/AIV/18/39/5'>Job 39:5</a>",
      "comment": "Zophar argues that true wisdom is impossible for sinful humanity without God's intervention, anticipating the need for a divinely given transformation (<a href='/AIV/24/31/33'>Jer. 31:33</a>)."
    },
    {
      "pk": 192023,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 13,
      "text": "If you prepare your heart and stretch out your hands toward him,",
      "links": "<a href='/AIV/19/143/6'>Psalm 143:6</a>",
      "comment": "Turning the heart toward God and prayer is seen as an essential act of humility. Compare with <a href='/AIV/59/4/8'>James 4:8</a>, where drawing near to God requires purity."
    },
    {
      "pk": 192024,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 14,
      "text": "if iniquity is in your hand, put it far away, and let no injustice dwell in your tents.",
      "links": "<a href='/AIV/19/119/11'>Psalm 119:11</a>",
      "comment": "A call for personal repentance and moral integrity—cleansing oneself in preparation for true worship, a theme which is deepened by sacramental participation in the New Testament (<a href='/AIV/58/10/22'>Heb. 10:22</a>)."
    },
    {
      "pk": 192025,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 15,
      "text": "Surely then you will lift up your face without blemish; you will be secure and will not fear.",
      "links": "<a href='/AIV/19/34/5'>Psalm 34:5</a>",
      "comment": "Purity is associated with confidence before God (cf. <a href='/AIV/62/3/21'>1 John 3:21</a>). Note the idea of being 'without blemish' connects to sacrifices and ultimately to Christ the spotless Lamb (<a href='/AIV/60/1/19'>1 Pet. 1:19</a>)."
    },
    {
      "pk": 192026,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 16,
      "text": "You will forget your misery; you will remember it as waters that have passed away.",
      "links": "<a href='/AIV/23/65/17'>Isa. 65:17</a>",
      "comment": "A promise of eventual consolation and healing, fulfilled in the final promises of God where past troubles are remembered no more (<a href='/AIV/66/21/4'>Rev. 21:4</a>)."
    },
    {
      "pk": 192027,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 17,
      "text": "And your life will be brighter than the noon; darkness will become like the morning.",
      "links": "<a href='/AIV/23/58/10'>Isa. 58:10</a>",
      "comment": "Light overcoming darkness is a key biblical motif. Christ, the Light of the world, fulfills this metaphor (<a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 192028,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 18,
      "text": "And you will have confidence because there is hope; you will look around and rest in security.",
      "links": "<a href='/AIV/19/16/9'>Psalm 16:9</a>",
      "comment": "Hope and security come from trust in God's providence, a theme running throughout both Testaments (see <a href='/AIV/45/5/5'>Rom. 5:5</a>)."
    },
    {
      "pk": 192029,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 19,
      "text": "You will lie down, and none shall make you afraid; many will seek your favor.",
      "links": "<a href='/AIV/19/4/8'>Psalm 4:8</a>",
      "comment": "Divine peace that removes fear is ultimately fulfilled in Christ's promise of peace (see <a href='/AIV/43/14/27'>John 14:27</a>)."
    },
    {
      "pk": 192030,
      "translation": "AIV",
      "book": 18,
      "chapter": 11,
      "verse": 20,
      "text": "But the eyes of the wicked will fail; all way of escape will be lost to them, and their hope will be to breathe their last.",
      "links": "<a href='/AIV/19/112/10'>Psalm 112:10</a>",
      "comment": "A warning that apart from repentance, the wicked have no lasting hope. This calls attention to the necessity of remaining in God's grace until the end, in line with the biblical call to perseverance (<a href='/AIV/58/3/14'>Heb. 3:14</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:19:40.092Z"
}