{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 30,
  "verses": [
    {
      "pk": 183001,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 1,
      "text": "But now, those younger than I mock me, whose fathers I would have disdained to set with the dogs of my flock.",
      "links": "<a href='/ESV/18/12/4'>Job 12:4</a>; <a href='/ESV/19/119/51'>Ps. 119:51</a>",
      "comment": "Job's reversal: once honored, he is now mocked by those of lowest status, highlighting the depth of his suffering, which foreshadows Christ's own humiliation (<a href='/AIV/23/53/3'>Isa. 53:3</a>)."
    },
    {
      "pk": 183002,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 2,
      "text": "What use to me was the strength of their hands, men in whom old age had perished?",
      "links": "",
      "comment": "Job emphasizes that even the fathers of his mockers were weak and of little value, underscoring the irony of his situation."
    },
    {
      "pk": 183003,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 3,
      "text": "Through want and hard hunger they gnawed the dry ground by night in desolate wastelands.",
      "links": "<a href='/AIV/18/24/8'>Job 24:8</a>",
      "comment": "A picture of extreme deprivation, symbolizing spiritual famine as well (<a href='/AIV/30/8/11'>Amos 8:11</a>), warning of the consequences of a life apart from God."
    },
    {
      "pk": 183004,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 4,
      "text": "They plucked saltwort among the bushes and roots of broom trees for their food.",
      "links": "",
      "comment": "Job describes scavenging for survival, further emphasizing the outcasts' poverty. Saltwort and broom roots were the food of the most destitute."
    },
    {
      "pk": 183005,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 5,
      "text": "They were driven out from among men, who shouted after them as after a thief.",
      "links": "<a href='/AIV/19/109/10'>Psalm 109:10</a>",
      "comment": "Being cast out reflects the deepest alienation, similar to Christ's rejection (<a href='/AIV/23/53/3'>Isa. 53:3</a>)."
    },
    {
      "pk": 183006,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 6,
      "text": "So they dwell in dreadful valleys, in holes of the earth and of the rocks.",
      "links": "<a href='/AIV/58/11/38'>Heb. 11:38</a>",
      "comment": "Living in caves mirrors the life of prophets and saints often rejected by the world (<a href='/AIV/11/19/9'>1 Kings 19:9</a>)."
    },
    {
      "pk": 183007,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 7,
      "text": "Among the bushes they bray, under the nettles they huddle together.",
      "links": "",
      "comment": "Their animal-like cries show the degree of their misery, reminiscent of the effects of sin and separation from human community."
    },
    {
      "pk": 183008,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 8,
      "text": "They are a senseless brood, children without a name; they have been whipped out of the land.",
      "links": "<a href='/AIV/19/37/22'>Psalm 37:22</a>",
      "comment": "Job highlights their status as social outcasts, 'children without a name,' a phrase associated with the biblical theme of inheritance and spiritual adoption (<a href='/AIV/48/4/7'>Gal. 4:7</a>)."
    },
    {
      "pk": 183009,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 9,
      "text": "And now I have become their song; I am a byword among them.",
      "links": "<a href='/AIV/19/69/12'>Psalm 69:12</a>; <a href='/AIV/25/3/14'>Lam. 3:14</a>",
      "comment": "Being scorned recalls how the righteous and suffering are often mocked, as seen in David’s life and Jesus’ passion."
    },
    {
      "pk": 183010,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 10,
      "text": "They loathe me; they keep distant from me; they do not hesitate to spit in my face.",
      "links": "<a href='/AIV/37/7/5'>Matthew 26:67</a>",
      "comment": "Job’s humiliation anticipates the treatment of Christ, who was also spat upon in fulfillment of prophecy."
    },
    {
      "pk": 183011,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 11,
      "text": "Because God has loosened my bowstring and humbled me, they cast off all restraint before me.",
      "links": "<a href='/AIV/18/12/9'>Job 12:9</a>",
      "comment": "Job sees his disgrace as permitted by God, reflecting the mystery of suffering in God’s providence."
    },
    {
      "pk": 183012,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 12,
      "text": "On my right the rabble rise; they send me sprawling, and build up their ways of destruction against me.",
      "links": "",
      "comment": "The 'rabble' suggests a mob's lawless attack, a pattern seen throughout salvation history when the righteous are persecuted."
    },
    {
      "pk": 183013,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 13,
      "text": "They break up my path; they push forward my calamity, and there is no one to help.",
      "links": "<a href='/AIV/19/22/11'>Psalm 22:11</a>",
      "comment": "Job finds himself isolated, echoing the suffering servant's lament."
    },
    {
      "pk": 183014,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 14,
      "text": "As through a wide breach they come; amid the ruins they roll on.",
      "links": "",
      "comment": "Imagery of an unprotected wall emphasizes Job's vulnerability."
    },
    {
      "pk": 183015,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 15,
      "text": "Terrors are turned upon me; my dignity is driven away like the wind, and my salvation has faded like a cloud.",
      "links": "<a href='/AIV/18/27/20'>Job 27:20</a>",
      "comment": "Job’s anguish reaches a climax here, paralleling spiritual desolation which has been experienced by many saints."
    },
    {
      "pk": 183016,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 16,
      "text": "And now my soul is poured out within me; days of affliction have taken hold of me.",
      "links": "<a href='/AIV/19/22/14'>Psalm 22:14</a>",
      "comment": "Job’s physical and spiritual exhaustion is reminiscent of David’s psalms and points ahead to Christ’s agony."
    },
    {
      "pk": 183017,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 17,
      "text": "The night racks my bones, and the pain that gnaws me never rests.",
      "links": "",
      "comment": "Intense suffering, both day and night, again reflects the full extent of trial and purification."
    },
    {
      "pk": 183018,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 18,
      "text": "By great force my garment is disfigured; it binds me about like the collar of my tunic.",
      "links": "",
      "comment": "Job’s affliction affects every aspect of his life, symbolized in his distorted clothing."
    },
    {
      "pk": 183019,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 19,
      "text": "God has cast me into the mire, and I have become like dust and ashes.",
      "links": "<a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "‘Dust and ashes’—a phrase used to express the deepest humility and a call to repentance (<a href='/AIV/19/103/14'>Ps. 103:14</a>)."
    },
    {
      "pk": 183020,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 20,
      "text": "I cry out to You for help, but You do not answer me; I stand up, and You only look at me.",
      "links": "<a href='/AIV/19/22/2'>Psalm 22:2</a>",
      "comment": "This complaint is echoed in Jesus’ cry from the cross (<a href='/AIV/41/15/34'>Mark 15:34</a>), foreshadowing the silence of God at times of trial."
    },
    {
      "pk": 183021,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 21,
      "text": "You have turned cruel to me; with the might of Your hand You oppose me.",
      "links": "",
      "comment": "Job wrestles honestly with the apparent severity of God, a deep mystery explored in later Scripture."
    },
    {
      "pk": 183022,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 22,
      "text": "You lift me up on the wind; You make me ride on it, and You toss me about in the roar of the storm.",
      "links": "<a href='/AIV/19/107/25'>Psalm 107:25-27</a>",
      "comment": "The unpredictability of suffering is imaged here, subjecting Job to forces beyond his control."
    },
    {
      "pk": 183023,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 23,
      "text": "For I know that You will bring me to death, to the house appointed for all the living.",
      "links": "<a href='/AIV/18/3/19'>Job 3:19</a>; <a href='/AIV/58/9/27'>Hebrews 9:27</a>",
      "comment": "Job affirms the universality of death—the 'house for all living'—inviting reflection on the hope of resurrection promised later in Scripture (<a href='/AIV/46/15/51'>1 Cor. 15:51</a>)."
    },
    {
      "pk": 183024,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 24,
      "text": "Yet does one in a heap of ruins not stretch out his hand, or in his disaster not cry for help?",
      "links": "",
      "comment": "Job appeals to basic compassion, an important aspect of God’s justice and mercy."
    },
    {
      "pk": 183025,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 25,
      "text": "Did I not weep for him whose day was difficult? Did not my soul grieve for the needy?",
      "links": "<a href='/AIV/19/35/13'>Psalm 35:13</a>",
      "comment": "Job’s generous heart contrasts with the lack of mercy he experiences now."
    },
    {
      "pk": 183026,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 26,
      "text": "But when I looked for good, evil came; when I waited for light, darkness came.",
      "links": "<a href='/AIV/24/8/15'>Jer. 8:15</a>",
      "comment": "Job’s suffering defies human logic, highlighting that virtue does not guarantee comfort in this life."
    },
    {
      "pk": 183027,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 27,
      "text": "My insides boil and are not quiet; days of affliction confront me.",
      "links": "",
      "comment": "Graphic language for inner turmoil, as experienced by the truly penitent."
    },
    {
      "pk": 183028,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 28,
      "text": "I go about in mourning, not in the sun; I stand up in the assembly and cry for help.",
      "links": "",
      "comment": "Job’s lament is public, inviting community participation in intercession, a pattern later evident in the practice of public fasts and prayer."
    },
    {
      "pk": 183029,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 29,
      "text": "I have become a brother to jackals and a companion to ostriches.",
      "links": "",
      "comment": "Wild animals symbolize desolation—Job feels forsaken by civilized society."
    },
    {
      "pk": 183030,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 30,
      "text": "My skin turns black and peels from me; my bones burn with fever.",
      "links": "",
      "comment": "Physical decay shows the effects of suffering, relating bodily affliction to spiritual trial."
    },
    {
      "pk": 183031,
      "translation": "AIV",
      "book": 18,
      "chapter": 30,
      "verse": 31,
      "text": "My harp is turned to mourning, and my flute to the voice of those who weep.",
      "links": "<a href='/AIV/19/137/2'>Psalm 137:2</a>",
      "comment": "Job's joy has been utterly turned to lament, a common biblical metaphor for times of testing and purification in the journey toward hope (<a href='/AIV/19/126/5'>Ps. 126:5</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:27:58.510Z"
}