{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 20,
  "verses": [
    {
      "pk": 1920001,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 1,
      "text": "Then Zophar the Naamathite answered and said:",
      "links": "<a href='/AIV/18/11/1'>Job 11:1</a>",
      "comment": "Zophar, one of Job’s friends, responds for the second and last time in the book. The dialogue continues with a focus on the fate of the wicked."
    },
    {
      "pk": 1920002,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 2,
      "text": "\"My anxious thoughts make me answer, because of my inward agitation.",
      "links": "",
      "comment": "Zophar speaks out of emotional restlessness, hinting at the deep distress caused by Job’s responses. A reminder that inner turmoil can lead to hasty words (see <a href='/AIV/20/29/20'>Prov. 29:20</a>)."
    },
    {
      "pk": 1920003,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 3,
      "text": "I have heard a rebuke that insults me, and my spirit prompts me to reply with understanding.",
      "links": "<a href='/AIV/18/19/2-3'>Job 19:2-3</a>",
      "comment": "Zophar feels personally attacked by Job and counters with what he believes is wisdom. The interplay of personal honor and divine justice foreshadows the later teachings of Christ about bearing insults without vengeance (<a href='/AIV/40/5/11'>Matt. 5:11</a>)."
    },
    {
      "pk": 1920004,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 4,
      "text": "Do you not know this from of old, since man was placed on earth,",
      "links": "<a href='/AIV/18/8/8-9'>Job 8:8-9</a>",
      "comment": "Zophar appeals to ancient tradition, suggesting that moral truths are unchanging. This reliance on tradition and teaching echoes the importance of handed-down doctrine in the faith community."
    },
    {
      "pk": 1920005,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 5,
      "text": "that the exulting of the wicked is short, and the joy of the godless is but for a moment?",
      "links": "<a href='/AIV/18/21/7-13'>Job 21:7-13</a>; <a href='/AIV/19/37/35-36'>Ps. 37:35-36</a>",
      "comment": "Zophar teaches that wickedness ultimately leads to swift judgment, a theme repeated throughout the Psalms and Proverbs. Those far from God may have brief joy, but justice prevails in the end."
    },
    {
      "pk": 1920006,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 6,
      "text": "Though his height mount up to the heavens and his head reach to the clouds,",
      "links": "<a href='/AIV/18/16/19'>Job 16:19</a>; <a href='/AIV/23/14/13'>Isa. 14:13-15</a>",
      "comment": "The imagery invokes prideful men who exalt themselves (see Lucifer in Isa. 14:13-15). The fall of the proud is a recurring biblical theme, showing that true exaltation comes through humility (cf. <a href='/AIV/42/18/14'>Luke 18:14</a>)."
    },
    {
      "pk": 1920007,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 7,
      "text": "he will perish forever like his own dung; those who have seen him will say, 'Where is he?'",
      "links": "<a href='/AIV/19/83/10'>Ps. 83:10</a>; <a href='/AIV/18/7/8-10'>Job 7:8-10</a>",
      "comment": "The ultimate fate of the wicked is complete destruction and being forgotten, emphasizing the fleeting glory of the ungodly compared to the enduring remembrance of the righteous."
    },
    {
      "pk": 1920008,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 8,
      "text": "He will fly away like a dream and be found no more; he will be chased away like a vision of the night.",
      "links": "<a href='/AIV/18/18/18'>Job 18:18'>Job 18:18</a>",
      "comment": "The image of fleeting dreams and vanishing visions points to the transient nature of life without God—his judgments are thorough and final (<a href='/AIV/19/73/20'>Ps. 73:20</a>)."
    },
    {
      "pk": 1920009,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 9,
      "text": "The eye that saw him will see him no more, nor will his place behold him any longer.",
      "links": "<a href='/AIV/18/7/10'>Job 7:10</a>",
      "comment": "This continues the theme of utter removal fromÂ the community, showing the seriousness of divine justice."
    },
    {
      "pk": 1920010,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 10,
      "text": "His children will seek the favor of the poor, and his hands will give back his wealth.",
      "links": "<a href='/AIV/18/27/14,16-17'>Job 27:14,16-17</a>",
      "comment": "The fortunes of the wicked are reversed: rather than oppressing, their children are reduced to pleading with those they once despised. Reparation and restoration are subtle motifs of divine justice."
    },
    {
      "pk": 1920011,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 11,
      "text": "His bones are full of his youthful vigor, but it will lie with him in the dust.",
      "links": "<a href='/AIV/18/21/23-26'>Job 21:23-26</a>",
      "comment": "Earthly strength and youthful vigor are fleeting—death levels all, reminding us of the biblical concept of mortality and judgment (<a href='/AIV/58/9/27'>Heb. 9:27</a>)."
    },
    {
      "pk": 1920012,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 12,
      "text": "\"Though evil is sweet in his mouth, though he hides it under an his tongue,",
      "links": "<a href='/AIV/19/10/7'>Ps. 10:7</a>",
      "comment": "The idea of savoring evil alludes to willful and hidden sin, which is condemned both in the Old and New Testaments (<a href='/AIV/40/12/34'>Matt. 12:34</a>)."
    },
    {
      "pk": 1920013,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 13,
      "text": "though he spares it and does not let it go, but keeps it still within his mouth,",
      "links": "",
      "comment": "The persistence in cherishing evil highlights the human tendency towards attachment to sin, which biblical tradition warns always brings ruin."
    },
    {
      "pk": 1920014,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 14,
      "text": "yet his food in his stomach turns bitter; it becomes the venom of cobras within him.",
      "links": "<a href='/AIV/19/140/3'>Ps. 140:3</a>",
      "comment": "What was pleasurable soon becomes deadly, showing the poisonous effect of sin on the soul (see also <a href='/AIV/59/1/15'>James 1:15</a>)."
    },
    {
      "pk": 1920015,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 15,
      "text": "He swallows riches but vomits them up; God drives them out of his belly.",
      "links": "<a href='/AIV/18/20/18'>Job 20:18</a>",
      "comment": "The ill-gotten wealth of the wicked is taken from them, emphasizing divine retribution and justice."
    },
    {
      "pk": 1920016,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 16,
      "text": "He will suck the poison of vipers; the tongue of a viper will kill him.",
      "links": "<a href='/AIV/19/58/4'>Ps. 58:4</a>",
      "comment": "Poison is symbolic of the consequence of sin (cf. Gen. 3:14-15 and the serpentine curse)."
    },
    {
      "pk": 1920017,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 17,
      "text": "He will not look on the streams, the rivers flowing with honey and curds.",
      "links": "<a href='/AIV/2/3/8'>Ex. 3:8</a>; <a href='/AIV/18/29/6'>Job 29:6</a>",
      "comment": "Promise of blessing (‘honey and curds’) is withheld from the wicked, contrasting the inheritance of the faithful who enter the Promised Land."
    },
    {
      "pk": 1920018,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 18,
      "text": "He will restore what he gained and will not consume it; he will not enjoy the profit from his trade.",
      "links": "",
      "comment": "Earthly prosperity without righteousness is fruitless; restitution without satisfaction anticipates later teachings on making amends for injustice (<a href='/AIV/42/19/8'>Luke 19:8</a>)."
    },
    {
      "pk": 1920019,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 19,
      "text": "For he has oppressed the poor and abandoned them; he has seized houses he did not build.",
      "links": "<a href='/AIV/23/5/8'>Isa. 5:8</a>; <a href='/AIV/18/22/5-9'>Job 22:5-9</a>",
      "comment": "Social justice is a key concern: God will avenge the oppressed and bring down the oppressor."
    },
    {
      "pk": 1920020,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 20,
      "text": "\"Because his appetite was not satisfied, he let nothing escape his greed, therefore his prosperity will not endure.",
      "links": "",
      "comment": "Greed brings about ruin. The insatiable desire for more is condemned throughout both the Old and New Testaments."
    },
    {
      "pk": 1920021,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 21,
      "text": "There was nothing left after he finished devouring; therefore his prosperity will not last.",
      "links": "",
      "comment": "Zophar repeats the fate of those who deplete without giving—they are cut off from genuine prosperity."
    },
    {
      "pk": 1920022,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 22,
      "text": "In the fullness of his plenty, he will be in distress; the hand of everyone in misery will come against him.",
      "links": "<a href='/AIV/18/18/12'>Job 18:12</a>",
      "comment": "The reversal of fortune is a repeated biblical theme—those who exalt themselves are humbled."
    },
    {
      "pk": 1920023,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 23,
      "text": "When he fills his belly, God will send his burning anger against him and rain it down upon him as his food.",
      "links": "<a href='/AIV/18/21/20'>Job 21:20</a>",
      "comment": "God’s just wrath is depicted as inescapable for the unrepentant. Zophar uses vivid imagery to show the seriousness of standing against God."
    },
    {
      "pk": 1920024,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 24,
      "text": "He may flee from an iron weapon, but a bronze-tipped arrow will pierce him.",
      "links": "",
      "comment": "There is no escaping divine justice—no earthly method offers protection from God’s righteous judgment."
    },
    {
      "pk": 1920025,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 25,
      "text": "It is drawn forth and comes out of his body, the glittering point from his gall; terrors come upon him.",
      "links": "",
      "comment": "Describes the inevitability and terror of judgment upon the wicked—imagery meant to evoke fear of consequences."
    },
    {
      "pk": 1920026,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 26,
      "text": "Total darkness is stored up for his treasures; a fire not fanned will consume him; it will destroy what is left in his tent.",
      "links": "<a href='/AIV/18/15/34'>Job 15:34</a>",
      "comment": "‘Fire not fanned’ implies divine and supernatural judgment, foreshadowing New Testament imagery of final judgment (<a href='/AIV/40/25/41'>Matt. 25:41</a>)."
    },
    {
      "pk": 1920027,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 27,
      "text": "The heavens will reveal his guilt, and the earth will rise up against him.",
      "links": "<a href='/AIV/18/16/19'>Job 16:19</a>; <a href='/AIV/19/50/6'>Ps. 50:6</a>",
      "comment": "Ultimate justice involves all of creation as witnesses—echoing later biblical themes of cosmic testimony."
    },
    {
      "pk": 1920028,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 28,
      "text": "The possessions of his house will be carried away, swept off in the day of God’s wrath.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "God’s wrath is timely and thorough—it removes both person and possession from unrighteousness."
    },
    {
      "pk": 1920029,
      "translation": "AIV",
      "book": 18,
      "chapter": 20,
      "verse": 29,
      "text": "This is the portion that God allots the wicked, the heritage decreed for them by God.",
      "links": "<a href='/AIV/18/27/13'>Job 27:13</a>",
      "comment": "Zophar sums up: the wicked are allotted a portion by God—justice as an immutable decree. The distinction between righteous and wicked evokes the ultimate separation in the final judgment (see <a href='/AIV/40/13/49-50'>Matt. 13:49-50</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:23:21.957Z"
}