{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 31,
  "verses": [
    {
      "pk": 1932310,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 1,
      "text": "I have made a covenant with my eyes; how then could I gaze at a young woman?",
      "links": "<a href='/AIV/19/119/37'>Psalm 119:37</a>; <a href='/AIV/40/5/28'>Matthew 5:28</a>",
      "comment": "Job emphasizes his commitment to purity, paralleling Christ’s words about the covenant of the eyes in Matthew. The language here echoes the concept of guarding one's heart and intentions, foreshadowing later Christian teaching on interior holiness."
    },
    {
      "pk": 1932311,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 2,
      "text": "For what is the portion from God above, and the heritage from the Almighty on high?",
      "links": "<a href='/AIV/18/27/13'>Job 27:13</a>; <a href='/AIV/19/11/6'>Psalm 11:6</a>",
      "comment": "Job acknowledges that God is the source of true reward and judgment, reflecting the idea that blessings and judgments come directly from the Lord."
    },
    {
      "pk": 1932312,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 3,
      "text": "Is it not disaster for the wicked, and calamity for those who do wrong?",
      "links": "<a href='/AIV/18/18/5'>Job 18:5</a>; <a href='/AIV/19/37/38'>Psalm 37:38</a>",
      "comment": "Here Job ties divine justice directly to morality, an early affirmation of God’s just governance over human conduct."
    },
    {
      "pk": 1932313,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 4,
      "text": "Does He not see my ways and count all my steps?",
      "links": "<a href='/AIV/18/23/10'>Job 23:10</a>; <a href='/AIV/19/139/3'>Psalm 139:3</a>",
      "comment": "God’s omniscience is asserted; nothing escapes His notice, reminding readers of both comfort and accountability."
    },
    {
      "pk": 1932314,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 5,
      "text": "If I have walked with falsehood, and my foot has hastened to deceit,",
      "links": "<a href='/AIV/19/26/3'>Psalm 26:3–4</a>",
      "comment": "Job begins a series of self-examinations, mirroring the confessional aspect in later Christian traditions—self-knowledge and honesty before God."
    },
    {
      "pk": 1932315,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 6,
      "text": "let Him weigh me in just balances, and God will know my integrity.",
      "links": "<a href='/AIV/18/13/18'>Job 13:18</a>; <a href='/AIV/19/62/9'>Psalm 62:9</a>",
      "comment": "The image of just balances signifies God’s perfect judgment (cf. Prov. 16:2). Job desires to be tried and found true."
    },
    {
      "pk": 1932316,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 7,
      "text": "If my step has turned aside from the way, and my heart has followed my eyes, and if any spot has stuck to my hands,",
      "links": "<a href='/AIV/19/24/4'>Psalm 24:4</a>; <a href='/AIV/19/119/37'>Psalm 119:37</a>",
      "comment": "Purity of heart and action is emphasized. The recurring call for integrity draws out the necessity for both interior and exterior righteousness."
    },
    {
      "pk": 1932317,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 8,
      "text": "then let me sow, and another eat; and let what grows for me be rooted out.",
      "links": "<a href='/AIV/03/26/16'>Leviticus 26:16</a>",
      "comment": "Job calls for a curse on himself if he is guilty, a public testimony to his innocence."
    },
    {
      "pk": 1932318,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 9,
      "text": "If my heart has been enticed toward a woman, and I have lain in wait at my neighbor’s door,",
      "links": "<a href='/AIV/20/7/6-23'>Proverbs 7:6-23</a>; <a href='/AIV/40/5/28'>Matthew 5:28</a>",
      "comment": "Again, Job insists on the inner moral life as the real battlefield, anticipating the renewed law of Christ (cf. Mt 5:28)."
    },
    {
      "pk": 1932319,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 10,
      "text": "then let my wife grind for another, and let others bow down upon her.",
      "links": "<a href='/AIV/05/28/30'>Deuteronomy 28:30</a>",
      "comment": "He invokes curses that would be considered severe consequences of infidelity. The severity is meant to highlight the seriousness of marital fidelity."
    },
    {
      "pk": 1932320,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 11,
      "text": "For that would be a heinous crime; yes, it would be an iniquity to be punished by the judges.",
      "links": "<a href='/AIV/03/20/10'>Leviticus 20:10</a>",
      "comment": "Adultery is confirmed as a grave sin worthy of punishment—a moral teaching that remains at the core of Christian sexual ethics."
    },
    {
      "pk": 1932321,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 12,
      "text": "For that would be a fire that consumes to destruction, and would root out all my increase.",
      "links": "<a href='/AIV/20/6/27-29'>Proverbs 6:27-29</a>",
      "comment": "Sin has destructive consequences, echoing the biblical imagery of fire as judgment (cf. Mark 9:43–48)."
    },
    {
      "pk": 1932322,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 13,
      "text": "If I have rejected the cause of my male or female servants when they brought a complaint against me,",
      "links": "<a href='/AIV/02/21/20-21'>Exodus 21:20-21</a>; <a href='/AIV/51/4/1'>Colossians 4:1</a>",
      "comment": "Job's concern for justice toward his servants anticipates the call for charity and love towards all, especially the vulnerable."
    },
    {
      "pk": 1932323,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 14,
      "text": "what then shall I do when God rises up? When He calls me to account, what shall I answer Him?",
      "links": "<a href='/AIV/18/19/25-27'>Job 19:25-27</a>; <a href='/AIV/45/14/12'>Romans 14:12</a>",
      "comment": "Job recognizes final accountability to God, a theme central to the doctrine of judgment."
    },
    {
      "pk": 1932324,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 15,
      "text": "Did not He who made me in the womb make him? Did not the same One form us both in the womb?",
      "links": "<a href='/AIV/19/139/13'>Psalm 139:13</a>; <a href='/AIV/40/23/8-9'>Matthew 23:8-9</a>",
      "comment": "Job affirms the dignity of all human life from the womb, prefiguring Christian teaching on the equal value and destiny of every soul."
    },
    {
      "pk": 1932325,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 16,
      "text": "If I have withheld anything that the poor desired, or caused the eyes of the widow to fail,",
      "links": "<a href='/AIV/23/1/17'>Isaiah 1:17</a>; <a href='/AIV/59/1/27'>James 1:27</a>",
      "comment": "Charity towards the poor and vulnerable takes center stage, a theme deeply developed in the New Testament."
    },
    {
      "pk": 1932326,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 17,
      "text": "or have eaten my morsel alone, and the fatherless has not eaten of it—",
      "links": "<a href='/AIV/19/68/5'>Psalm 68:5</a>",
      "comment": "Sharing with the fatherless foreshadows the virtue of hospitality, so prominent in the early Church."
    },
    {
      "pk": 1932327,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 18,
      "text": "(for from my youth the fatherless grew up with me as with a father, and from my mother's womb I guided the widow),",
      "links": "<a href='/AIV/18/29/13'>Job 29:13</a>",
      "comment": "Job’s lifelong practice of compassion is highlighted. His righteousness is both habitual and sincere."
    },
    {
      "pk": 1932328,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 19,
      "text": "if I have seen anyone perish for lack of clothing, or the needy without covering,",
      "links": "<a href='/AIV/23/58/7'>Isaiah 58:7</a>; <a href='/AIV/40/25/36'>Matthew 25:36</a>",
      "comment": "True righteousness provides for the physical needs of others, a recurring hallmark of authentic faith."
    },
    {
      "pk": 1932329,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 20,
      "text": "if his body has not blessed me, and if he was not warmed with the fleece of my sheep,",
      "links": "<a href='/AIV/59/2/15-16'>James 2:15–16</a>",
      "comment": "Alms-deeds accompanied by love illustrate a faith that is neither dead nor alone, but living through works."
    },
    {
      "pk": 1932330,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 21,
      "text": "if I have raised my hand against the fatherless, because I saw my help in the gate,",
      "links": "<a href='/AIV/18/22/8-9'>Job 22:8-9</a>",
      "comment": "Job avoids using power to oppress the weak, reflecting a justice rooted in mercy."
    },
    {
      "pk": 1932331,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 22,
      "text": "then let my shoulder blade fall from my shoulder, and let my arm be broken from its socket.",
      "links": "<a href='/AIV/07/1/7'>Judges 1:7</a>",
      "comment": "A vivid curse illustrates the severity of abusing power—bodily judgment for spiritual corruption."
    },
    {
      "pk": 1932332,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 23,
      "text": "For I was in terror of destruction from God, and I could not have faced His majesty.",
      "links": "<a href='/AIV/18/13/21'>Job 13:21</a>",
      "comment": "Fear of the Lord motivates Job’s justice, a theme developed into Christian reverence."
    },
    {
      "pk": 1932333,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 24,
      "text": "If I have put my trust in gold or called fine gold my confidence,",
      "links": "<a href='/AIV/19/52/7'>Psalm 52:7</a>; <a href='/AIV/41/10/24'>Mark 10:24</a>",
      "comment": "Idolatry of wealth is condemned; Christ later explicitly warns against trusting in riches (cf. Mk 10:23–27)."
    },
    {
      "pk": 1932334,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 25,
      "text": "if I have rejoiced because my wealth was great, or because my hand had gotten much;",
      "links": "<a href='/AIV/05/8/17-18'>Deuteronomy 8:17-18</a>",
      "comment": "Job does not boast in material plenty, putting ultimate trust in God, not in possessions."
    },
    {
      "pk": 1932335,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 26,
      "text": "if I beheld the sun when it shone, or the moon moving in splendor,",
      "links": "<a href='/AIV/05/4/19'>Deuteronomy 4:19</a>",
      "comment": "Ancient idolatry often worshiped celestial bodies; Job swears he has not participated in this."
    },
    {
      "pk": 1932336,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 27,
      "text": "and my heart has been secretly enticed, and my mouth has kissed my hand;",
      "links": "<a href='/AIV/13/29/20'>1 Chronicles 29:20</a>",
      "comment": "The gesture of kissing the hand was a sign of idolatrous affection. Job maintains inner purity by rejecting all forms of false worship."
    },
    {
      "pk": 1932337,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 28,
      "text": "this also would be an iniquity to be punished by the judges, for I would have denied God above.",
      "links": "<a href='/AIV/26/8/16'>Ezekiel 8:16</a>; <a href='/AIV/45/1/21-23'>Romans 1:21-23</a>",
      "comment": "Idolatry is equal to denial of the true God, a primary sin in the biblical tradition."
    },
    {
      "pk": 1932338,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 29,
      "text": "If I have rejoiced at the ruin of him who hated me, or exulted when ruin found him—",
      "links": "<a href='/AIV/19/35/13-14'>Psalm 35:13–14</a>; <a href='/AIV/40/5/44'>Matthew 5:44</a>",
      "comment": "Job upholds love of enemy, anticipating Jesus’ command to love and pray for one’s persecutors."
    },
    {
      "pk": 1932339,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 30,
      "text": "I have not let my mouth sin by asking for a curse on his life—",
      "links": "<a href='/AIV/19/7/4'>Psalm 7:4</a>",
      "comment": "Refraining from vengeance remains a virtue highlighted in both Old and New Testament moral teaching."
    },
    {
      "pk": 1932340,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 31,
      "text": "if the men of my tent have not said, ‘Who is there that has not been filled with Job’s food?’",
      "links": "<a href='/AIV/58/13/2'>Hebrews 13:2</a>",
      "comment": "Hospitality is again noted, showing the consistency of Job’s righteousness before witnesses."
    },
    {
      "pk": 1932341,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 32,
      "text": "the sojourner has not lodged in the street; I have opened my doors to the traveler.",
      "links": "<a href='/AIV/01/18/1-8'>Genesis 18:1-8</a>",
      "comment": "Reception of strangers signals a heart open to all—a moral trait highly praised in the new covenant."
    },
    {
      "pk": 1932342,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 33,
      "text": "if I have covered my transgressions as Adam, by hiding my iniquity in my heart,",
      "links": "<a href='/AIV/01/3/7-10'>Genesis 3:7-10</a>",
      "comment": "Job rejects hypocrisy—a true confession and repentance is commended here, anticipating the fuller Christian sacramental understanding of reconciliation."
    },
    {
      "pk": 1932343,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 34,
      "text": "because I feared the great multitude, and the contempt of families terrified me, so that I kept silence, and did not go out of doors—",
      "links": "<a href='/AIV/20/29/25'>Proverbs 29:25</a>",
      "comment": "Job did not hide sin out of fear of public opinion. True righteousness is oriented to God, not man."
    },
    {
      "pk": 1932344,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 35,
      "text": "Oh, that I had one to hear me!—here is my signature; let the Almighty answer me!—O that I had the indictment which my adversary has written!",
      "links": "<a href='/AIV/18/13/22-23'>Job 13:22-23</a>",
      "comment": "Job longs for vindication, anticipating the New Testament promise that Christ is our advocate before the Father (see 1 John 2:1)."
    },
    {
      "pk": 1932345,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 36,
      "text": "Surely I would carry it on my shoulder; I would bind it on me as a crown.",
      "links": "<a href='/AIV/19/132/18'>Psalm 132:18</a>",
      "comment": "Job is confident enough in his innocence to wear the indictment as a badge, a sign of humble surrender to God’s justice."
    },
    {
      "pk": 1932346,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 37,
      "text": "I would declare to Him the number of my steps; like a prince I would approach Him.",
      "links": "<a href='/AIV/58/4/16'>Hebrews 4:16</a>",
      "comment": "Approaching God with confidence anticipates the Christian teaching on bold access to God through grace."
    },
    {
      "pk": 1932347,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 38,
      "text": "If my land has cried out against me and its furrows have wept together;",
      "links": "<a href='/AIV/01/4/10'>Genesis 4:10</a>",
      "comment": "Sin affects even the creation, a motif later made explicit in Romans 8:19-22. Justice or injustice stains the land."
    },
    {
      "pk": 1932348,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 39,
      "text": "if I have eaten its yield without payment, or have caused its owners to lose their lives,",
      "links": "<a href='/AIV/24/22/13'>Jeremiah 22:13</a>",
      "comment": "Economic justice is part of integrity; cheating others of their due is an offense before God."
    },
    {
      "pk": 1932349,
      "translation": "AIV",
      "book": 18,
      "chapter": 31,
      "verse": 40,
      "text": "let thorns grow instead of wheat, and foul weeds instead of barley.” The words of Job are ended.",
      "links": "<a href='/AIV/01/3/17-18'>Genesis 3:17-18</a>; <a href='/AIV/40/13/24-30'>Matthew 13:24-30</a>",
      "comment": "The curse of thorns recalls Genesis and Jesus' parables about wheat and tares. Job's closing invokes the covenantal consequences of sin on creation."
    }
  ],
  "translatedAt": "2025-12-23T05:28:43.807Z"
}