{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 2,
  "verses": [
    {
      "pk": 2004201,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 1,
      "text": "Again, there was a day when the sons of God came to present themselves before the LORD, and Satan also came among them to present himself before the LORD.",
      "links": "<a href='/AIV/18/1/6'>Job 1:6</a>; <a href='/AIV/19/89/6'>Ps. 89:6</a>",
      "comment": "This scene reflects the ongoing dialogue in the heavenly court, where even those opposed to God must answer to Him. The 'sons of God' refers to angelic beings (see also Job 1:6). The translation maintains the literal sense of the Hebrew 'ha-satan' (the Adversary)."
    },
    {
      "pk": 2004202,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 2,
      "text": "And the LORD said to Satan, 'Where have you come from?' Satan answered the LORD, 'From roaming the earth and walking around on it.'",
      "links": "<a href='/AIV/18/1/7'>Job 1:7</a>; <a href='/AIV/1/3/8'>Gen. 3:8</a>",
      "comment": "Satan’s roaming indicates his limited power—he is restricted to the earth and remains under God’s authority. The text emphasizes God’s sovereignty, even over Satan."
    },
    {
      "pk": 2004203,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 3,
      "text": "Then the LORD said to Satan, 'Have you considered My servant Job? There is no one like him on earth, a man blameless and upright, who fears God and turns away from evil. He holds fast to his integrity, even though you incited Me against him to destroy him without cause.'",
      "links": "<a href='/AIV/18/1/8'>Job 1:8</a>; <a href='/AIV/20/14/16'>Prov. 14:16</a>",
      "comment": "God praises Job’s perseverance in righteousness, despite severe trials. This verse foreshadows the righteous suffering seen in Christ (see Isa. 53:9), and highlights the virtue of steadfast endurance (cf. James 5:11)."
    },
    {
      "pk": 2004204,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 4,
      "text": "Satan answered the LORD, 'Skin for skin! A man will give all he has for his own life.'",
      "links": "<a href='/AIV/18/1/11'>Job 1:11</a>",
      "comment": "The phrase 'skin for skin' expresses a maxim about self-preservation; Satan is arguing that Job’s faithfulness is only due to his concern for his own life. This accusation tests the purity of human faith."
    },
    {
      "pk": 2004205,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 5,
      "text": "But stretch out Your hand now and touch his bone and his flesh, and he will surely curse You to Your face.'",
      "links": "<a href='/AIV/18/1/11'>Job 1:11</a>; <a href='/AIV/18/19/20'>Job 19:20</a>",
      "comment": "Satan’s challenge lies in suffering—believing that affliction will break Job’s faith. Here, bodily suffering is highlighted as a supreme test of loyalty to God, foreshadowing the suffering of the righteous in later revelation."
    },
    {
      "pk": 2004206,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 6,
      "text": "The LORD said to Satan, 'Behold, he is in your hand; only spare his life.'",
      "links": "<a href='/AIV/18/1/12'>Job 1:12</a>; <a href='/AIV/19/34/19'>Ps. 34:19</a>",
      "comment": "God grants Satan limited permission—Job’s life must be spared. This reveals that all suffering is ultimately bounded by God’s will, which assures believers that God never abandons His own, even in tribulation. (cf. 1 Cor. 10:13)"
    },
    {
      "pk": 2004207,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 7,
      "text": "So Satan went out from the presence of the LORD and struck Job with painful sores from the sole of his foot to the crown of his head.",
      "links": "<a href='/AIV/18/7/5'>Job 7:5</a>; <a href='/AIV/5/28/27'>Deut. 28:27</a>",
      "comment": "Job’s suffering is both total and visible. This extreme physical affliction echoes the curses of the Law for faithlessness (Deut. 28:27), yet Job suffers though he is righteous, prefiguring redemptive suffering seen in the New Testament."
    },
    {
      "pk": 2004208,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 8,
      "text": "And Job took a piece of broken pottery to scrape himself as he sat among the ashes.",
      "links": "<a href='/AIV/41/1/40'>Mark 1:40</a>; <a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "Job’s posture—sitting in ashes—was a traditional sign of mourning and repentance (cf. Jonah 3:6). This scene illustrates humility and contrition, spiritual virtues commended throughout Scripture (cf. Luke 18:13)."
    },
    {
      "pk": 2004209,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 9,
      "text": "Then his wife said to him, 'Are you still holding on to your integrity? Curse God and die!'",
      "links": "<a href='/AIV/18/27/5'>Job 27:5</a>; <a href='/AIV/18/2/3'>Job 2:3</a>",
      "comment": "Job’s wife’s counsel represents a temptation toward despair and abandonment of faith. Her words can be seen as a test, similar to the temptations presented to Jesus (cf. Matt. 4:1–11; Heb. 4:15)."
    },
    {
      "pk": 2004210,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 10,
      "text": "But he said to her, 'You speak as one of the foolish women would speak. Should we accept good from God, and not accept adversity?' In all this Job did not sin with his lips.",
      "links": "<a href='/AIV/18/1/22'>Job 1:22</a>; <a href='/AIV/18/13/15'>Job 13:15</a>",
      "comment": "Job firmly rebukes despair, affirming that God is sovereign over both blessings and suffering, a theme expanded in Rom. 8:28. Job’s sinlessness in this trial points to the later call for faithful endurance (cf. Jas. 1:12), and models perfect trust in God’s providence."
    },
    {
      "pk": 2004211,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 11,
      "text": "Now when Job’s three friends heard of all this evil that had come upon him, they each came from his own place: Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite. They made an appointment together to come to show him sympathy and comfort him.",
      "links": "<a href='/AIV/18/42/11'>Job 42:11</a>; <a href='/AIV/45/12/15'>Rom. 12:15</a>",
      "comment": "The arrival of Job’s friends introduces themes of communal response to suffering. Their intention to comfort mirrors the call for believers to bear one another’s burdens (see Gal. 6:2)."
    },
    {
      "pk": 2004212,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 12,
      "text": "When they saw him from a distance, they did not recognize him. They raised their voices and wept; each tore his robe, and they threw dust into the air over their heads toward heaven.",
      "links": "<a href='/AIV/18/1/20'>Job 1:20</a>; <a href='/AIV/16/9/1'>Neh. 9:1</a>",
      "comment": "These gestures are traditional expressions of mourning and empathy. The scene underscores the depth of Job’s suffering and the shared nature of human sorrow, echoing the importance of sacrificial love and unity among believers."
    },
    {
      "pk": 2004213,
      "translation": "AIV",
      "book": 18,
      "chapter": 2,
      "verse": 13,
      "text": "So they sat with him on the ground seven days and seven nights, and no one spoke a word to him, for they saw that his suffering was very great.",
      "links": "<a href='/AIV/18/10/1'>Job 10:1</a>; <a href='/AIV/18/42/13'>Job 42:13</a>",
      "comment": "Seven days is a period of perfect completion. The friends’ silent presence honors his suffering, modeling patience and compassionate accompaniment. The value of silent solidarity is reflected in Christian traditions of liturgy and prayerful support."
    }
  ],
  "translatedAt": "2025-12-23T05:15:59.854Z"
}