{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 10,
  "verses": [
    {
      "pk": 1801001,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 1,
      "text": "My soul is weary of my life; I will give free expression to my complaint. I will speak in the bitterness of my soul.",
      "links": "<a href='/AIV/19/77/3'>Ps. 77:3</a>; <a href='/AIV/18/7/11'>Job 7:11</a>",
      "comment": "Job is raw in expressing his suffering, establishing the honesty found in biblical lament. The soul’s bitterness foreshadows the psalmist’s cries in the Psalms, linking personal grief to communal worship and prayer."
    },
    {
      "pk": 1801002,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 2,
      "text": "I will say to God, 'Do not condemn me! Show me why you contend with me.'",
      "links": "<a href='/AIV/18/7/20'>Job 7:20</a>; <a href='/AIV/19/143/2'>Ps. 143:2</a>",
      "comment": "Job appeals directly to God, seeking understanding—a model for personal dialogue with the Divine. The cry for vindication anticipates later theological concepts of justification."
    },
    {
      "pk": 1801003,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 3,
      "text": "Is it good for you to oppress, for you to despise the work of your hands, and smile on the plan of the wicked?",
      "links": "<a href='/AIV/19/119/126'>Ps. 119:126</a>; <a href='/AIV/18/14/15'>Job 14:15</a>",
      "comment": "Job challenges divine justice—a theme that echoes through Scripture. The 'work of your hands' can be seen as a signal to God’s personal care, which appears again in creation accounts."
    },
    {
      "pk": 1801004,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 4,
      "text": "Do you have eyes of flesh? Do you see as man sees?",
      "links": "<a href='/AIV/18/22/12'>Job 22:12</a>; <a href='/AIV/23/55/8-9'>Isa. 55:8-9</a>",
      "comment": "Job contrasts God’s perspective with human limitations, anticipating later teachings about the difference between divine and human understanding. This emphasis on transcendence highlights God’s otherness."
    },
    {
      "pk": 1801005,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 5,
      "text": "Are your days like the days of a mortal, or your years as a man's years?",
      "links": "<a href='/AIV/18/36/26'>Job 36:26</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>",
      "comment": "The rhetorical question underscores God’s eternity, set against human frailty. This reflection harmonizes with biblical passages affirming God’s timelessness."
    },
    {
      "pk": 1801006,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 6,
      "text": "That you seek out my iniquity and search for my sin?",
      "links": "<a href='/AIV/18/14/16'>Job 14:16</a>; <a href='/AIV/19/139/23-24'>Ps. 139:23-24</a>",
      "comment": "Here, Job worries that God is scrutinizing him for faults. The verse touches on the theme of God’s omniscience and examination of the human heart, echoed in the Psalms."
    },
    {
      "pk": 1801007,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 7,
      "text": "Though you know that I am not guilty, and there is no one who can deliver out of your hand.",
      "links": "<a href='/AIV/18/9/32'>Job 9:32</a>; <a href='/AIV/19/31/15'>Ps. 31:15</a>",
      "comment": "Job claims innocence and recognizes God's sovereignty—there is no one above Him. This points toward the biblical truth that ultimate judgment and mercy rest with God alone."
    },
    {
      "pk": 1801008,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 8,
      "text": "Your hands have fashioned and made me, yet now you destroy me completely.",
      "links": "<a href='/AIV/18/31/15'>Job 31:15</a>; <a href='/AIV/19/139/13'>Ps. 139:13</a>",
      "comment": "The creative act of God is juxtaposed with destruction, inviting meditation on not only physical creation but spiritual rebirth, alluding to themes later fulfilled in the New Testament."
    },
    {
      "pk": 1801009,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 9,
      "text": "Remember that you have made me like clay; and will you now turn me again to dust?",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/1/3/19'>Gen. 3:19</a>",
      "comment": "The clay and dust imagery connects to Genesis creation and the mortality of humanity, inviting reflection on the resurrection promise (cf. 1 Cor. 15:42-49)."
    },
    {
      "pk": 1801010,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 10,
      "text": "Did you not pour me out like milk and curdle me like cheese?",
      "links": "<a href='/AIV/19/139/15'>Ps. 139:15</a>",
      "comment": "Poetic language vividly describes the miracle of human formation, stressing God’s intimate involvement in life’s origins."
    },
    {
      "pk": 1801011,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 11,
      "text": "You clothed me with skin and flesh, and knit me together with bones and sinews.",
      "links": "<a href='/AIV/19/139/13-16'>Ps. 139:13-16</a>",
      "comment": "This verse highlights God’s detailed handiwork, supporting the understanding of human life as sacred from conception."
    },
    {
      "pk": 1801012,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 12,
      "text": "You have granted me life and steadfast love, and your care has preserved my spirit.",
      "links": "<a href='/AIV/19/63/3'>Ps. 63:3</a>; <a href='/AIV/19/119/88'>Ps. 119:88</a>",
      "comment": "Here, Job acknowledges both physical and spiritual stewardship—a holistic view of God's providence that foreshadows the fullness of life promised in Christ."
    },
    {
      "pk": 1801013,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 13,
      "text": "Yet these things you have hidden in your heart; I know that this is with you.",
      "links": "<a href='/AIV/18/23/12'>Job 23:12</a>; <a href='/AIV/19/33/11'>Ps. 33:11</a>",
      "comment": "The hidden purposes of God invite humility before divine mystery, a theme echoed in later revelation about God’s incomprehensibility."
    },
    {
      "pk": 1801014,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 14,
      "text": "If I sin, you watch me and do not acquit me of my guilt.",
      "links": "<a href='/AIV/18/14/16'>Job 14:16</a>; <a href='/AIV/19/130/3'>Ps. 130:3</a>",
      "comment": "Job’s anxiety about judgment reinforces the need for a mediator—an anticipation of Christ as intercessor (cf. 1 Tim. 2:5)."
    },
    {
      "pk": 1801015,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 15,
      "text": "If I am guilty, woe to me! And if I am righteous, I dare not lift up my head, for I am filled with disgrace and see my affliction.",
      "links": "<a href='/AIV/18/9/15'>Job 9:15</a>; <a href='/AIV/19/40/12'>Ps. 40:12</a>",
      "comment": "Job’s humility before suffering and guilt echoes the need for grace, which finds deeper fulfillment in the teaching of justification and forgiveness."
    },
    {
      "pk": 1801016,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 16,
      "text": "If I lift up my head, you hunt me like a lion and again display your power against me.",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/18/16/9'>Job 16:9</a>",
      "comment": "God’s power is depicted as wild and untamable, emphasizing the awe due to divine majesty. The lion imagery recurs in prophetic and apocalyptic contexts."
    },
    {
      "pk": 1801017,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 17,
      "text": "You renew your witnesses against me and increase your anger toward me; hardship after hardship confronts me.",
      "links": "<a href='/AIV/18/13/24'>Job 13:24</a>; <a href='/AIV/19/88/7'>Ps. 88:7</a>",
      "comment": "The multiplication of suffering and accusations prefigures Christ's endurance of false witnesses and unjust suffering (cf. Isa. 53:7)."
    },
    {
      "pk": 1801018,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 18,
      "text": "Why then did you bring me out from the womb? I wish I had died and no eye had seen me.",
      "links": "<a href='/AIV/18/3/11'>Job 3:11</a>; <a href='/AIV/19/88/15'>Ps. 88:15</a>",
      "comment": "Job’s sorrow evokes the mystery of suffering and life, a theme answered in later revelation concerning redemptive suffering."
    },
    {
      "pk": 1801019,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 19,
      "text": "I would have been as if I had not existed, carried from the womb to the grave.",
      "links": "<a href='/AIV/18/3/16'>Job 3:16</a>; <a href='/AIV/19/39/13'>Ps. 39:13</a>",
      "comment": "This longing for nonexistence echoes ancient laments, deepening the biblical witness to the complexity of human anguish."
    },
    {
      "pk": 1801020,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 20,
      "text": "Are not my days few? Leave me alone, so that I may have a moment’s joy",
      "links": "<a href='/AIV/18/7/16'>Job 7:16</a>; <a href='/AIV/19/39/4'>Ps. 39:4</a>",
      "comment": "The brevity of life is stressed—this theme underscores the importance of making one’s days meaningful before God, anticipating the New Testament teaching of redeeming the time (Eph. 5:16)."
    },
    {
      "pk": 1801021,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 21,
      "text": "before I go—never to return—to the land of darkness and shadow of death;",
      "links": "<a href='/AIV/19/88/12'>Ps. 88:12</a>; <a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "This verse engages the biblical imagery of Sheol, linking Old Testament wanderings about death with later Christian teaching on the hope of resurrection light."
    },
    {
      "pk": 1801022,
      "translation": "AIV",
      "book": 18,
      "chapter": 10,
      "verse": 22,
      "text": "a land of deepest darkness, like the darkness of chaos, without order, where even light is as darkness.",
      "links": "<a href='/AIV/1/1/2'>Gen. 1:2</a>; <a href='/AIV/18/3/5'>Job 3:5</a>",
      "comment": "Job’s final image returns to primordial chaos, underscoring the need for divine outpouring of grace and order—a theme later fulfilled at the dawn of new creation in Christ."
    }
  ],
  "translatedAt": "2025-12-23T05:19:14.651Z"
}