{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 16,
  "verses": [
    {
      "pk": 5016001,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "",
      "comment": "Job resumes speaking in response to his friends, setting up a new lament. This marks a shift in the dialogue, showing Job’s persistence in stating his innocence (cf. Job 6:1; Job 9:1)."
    },
    {
      "pk": 5016002,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 2,
      "text": "I have heard many such things; miserable comforters are all of you.",
      "links": "<a href='/AIV/18/13/4'>Job 13:4</a>; <a href='/AIV/18/21/34'>Job 21:34</a>",
      "comment": "Job critiques his friends, similar to his earlier rebuke. The phrase 'miserable comforters' highlights the human inability to bring true comfort apart from divine grace."
    },
    {
      "pk": 5016003,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 3,
      "text": "Will words of wind never end? Or what provokes you that you keep answering?",
      "links": "<a href='/AIV/18/8/2'>Job 8:2</a>",
      "comment": "Here, 'words of wind' captures the emptiness of their speeches. Job's rhetorical question underscores the futility of earthly wisdom without revelation from God."
    },
    {
      "pk": 5016004,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 4,
      "text": "I also could speak as you do, if you were in my place; I could join words together against you and shake my head at you.",
      "links": "<a href='/AIV/18/19/5'>Job 19:5</a>",
      "comment": "Job highlights the ease of judgment when suffering is not personal. This introduces the theme of empathy and compassion, which becomes central in Christian teaching (cf. Rom. 12:15)."
    },
    {
      "pk": 5016005,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 5,
      "text": "But I would strengthen you with my mouth, and the comfort of my lips would ease your pain.",
      "links": "<a href='/AIV/18/29/25'>Job 29:25</a>",
      "comment": "Here Job contrasts his hypothetical response, preferring words of true consolation—foreshadowing the ministry of Christ who comforts the afflicted (cf. Isa. 61:1; Matt. 11:28)."
    },
    {
      "pk": 5016006,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 6,
      "text": "If I speak, my pain is not relieved, and if I keep silent, how much am I eased?",
      "links": "<a href='/AIV/18/10/1'>Job 10:1</a>",
      "comment": "Job expresses the enduring nature of his suffering, whether he vents or keeps silent. This points to the limits of human expression in facing profound grief."
    },
    {
      "pk": 5016007,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 7,
      "text": "But now God has worn me out; he has devastated all my family.",
      "links": "<a href='/AIV/18/19/6-7'>Job 19:6-7</a>",
      "comment": "Job attributes his suffering directly to God, a theme that raises questions about divine providence and mystery, central to theology about suffering and redemption."
    },
    {
      "pk": 5016008,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 8,
      "text": "You have seized me and made me shriveled; my witness rises up against me, and my leanness testifies to my face.",
      "links": "<a href='/AIV/18/19/20'>Job 19:20</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "Job’s physical suffering is visible and public—he feels it as a testimony against him. This evokes the imagery of Christ, whose sufferings bore witness (see Isa. 53:3)."
    },
    {
      "pk": 5016009,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 9,
      "text": "In anger, God tears at me and persecutes me; he gnashes at me with his teeth; my adversary glares at me.",
      "links": "<a href='/AIV/19/35/16'>Ps. 35:16</a>; <a href='/AIV/25/3/1'>Lam. 3:1</a>",
      "comment": "Strong imagery of affliction. While Job speaks of God as the adversary, these words anticipate the suffering servant who endures persecution, fulfilled ultimately in Christ."
    },
    {
      "pk": 5016010,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 10,
      "text": "People have opened their mouths against me; they strike me on the cheek with contempt; they gather together against me.",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/25/2/15'>Lam. 2:15'>Lam. 2:15</a>; <a href='/AIV/40/26/67'>Matt. 26:67</a>",
      "comment": "Job’s description is prophetically echoed in the suffering of Jesus, who was struck and scorned (cf. Matt. 26:67). This verse demonstrates the typology between Job and Christ."
    },
    {
      "pk": 5016011,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 11,
      "text": "God delivers me to the ungodly and casts me into the hands of the wicked.",
      "links": "<a href='/AIV/19/22/16'>Ps. 22:16</a>; <a href='/AIV/40/27/26'>Matt. 27:26</a>",
      "comment": "Job’s fate mirrors the passion of Christ, foreshadowed in Psalm 22 and fulfilled when Jesus is delivered to sinners (Matt. 27:26)."
    },
    {
      "pk": 5016012,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 12,
      "text": "I was at ease, but he shattered me; he seized me by the neck and broke me apart. He has set me up as his target.",
      "links": "<a href='/AIV/19/38/2'>Ps. 38:2</a>",
      "comment": "The imagery of being a 'target' recalls the suffering endured for mysterious purposes, often echoed in spiritual interpretations about holiness arising from trial."
    },
    {
      "pk": 5016013,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 13,
      "text": "His archers surround me; he pierces my kidneys without mercy and pours out my gall on the ground.",
      "links": "<a href='/AIV/19/7/12-13'>Ps. 7:12-13</a>; <a href='/AIV/25/3/13'>Lam. 3:13</a>",
      "comment": "The physiological detail of suffering and ‘gall’ echoes messianic prophecy and the theme of shared suffering with Christ (cf. Matt. 27:34; John 19:29)."
    },
    {
      "pk": 5016014,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 14,
      "text": "He breaks me with wound upon wound; he rushes at me like a warrior.",
      "links": "<a href='/AIV/25/3/1-3'>Lam. 3:1-3</a>",
      "comment": "Repeated suffering is noted. The image of God as a ‘warrior’ can be troubling but also points to the mystery of God’s justice and love in redemptive suffering."
    },
    {
      "pk": 5016015,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 15,
      "text": "I have sewed sackcloth upon my skin and have laid my horn in the dust.",
      "links": "<a href='/AIV/18/2/8'>Job 2:8</a>; <a href='/AIV/19/7/17'>Ps. 7:17</a>",
      "comment": "Sackcloth is a symbol of repentance and mourning—a gesture that later becomes associated with penitence in spiritual traditions."
    },
    {
      "pk": 5016016,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 16,
      "text": "My face is red with weeping, and on my eyelids is deep darkness.",
      "links": "<a href='/AIV/19/6/7'>Ps. 6:7</a>",
      "comment": "Job’s intense grief is physically manifest. The vivid description underscores the depth of authentic lament in the relationship with God."
    },
    {
      "pk": 5016017,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 17,
      "text": "Yet my hands are free of violence, and my prayer is pure.",
      "links": "<a href='/AIV/18/1/1'>Job 1:1</a>; <a href='/AIV/18/27/5'>Job 27:5</a>",
      "comment": "Job maintains his innocence and pure prayer, highlighting the biblical view that suffering is not always a direct result of personal sin. This theme finds fulfillment in the sinless sufferings of Christ."
    },
    {
      "pk": 5016018,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 18,
      "text": "O earth, do not cover my blood, and let my cry have no resting place.",
      "links": "<a href='/AIV/01/4/10'>Gen. 4:10</a>; <a href='/AIV/19/9/12'>Ps. 9:12</a>",
      "comment": "Job appeals for justice—echoing Abel’s blood crying out from the ground (Gen. 4:10). This points to the biblical hope for ultimate vindication, fulfilled in Christ’s resurrection."
    },
    {
      "pk": 5016019,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 19,
      "text": "Even now, my witness is in heaven, and my advocate is on high.",
      "links": "<a href='/AIV/18/9/33'>Job 9:33</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>; <a href='/AIV/62/2/1'>1 John 2:1</a>",
      "comment": "A key verse indicating Job’s hope for a heavenly mediator, fulfilled ultimately in Christ’s intercession (Heb. 7:25, 1 John 2:1), and foundational for sacramental approach to mediation and advocacy."
    },
    {
      "pk": 5016020,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 20,
      "text": "My friends scorn me, but my eyes pour out tears to God,",
      "links": "<a href='/AIV/18/19/13-16'>Job 19:13-16</a>",
      "comment": "Despite rejection by his friends, Job persists in his prayer—echoing the Christian call to turn to God alone amid persecution and misunderstanding."
    },
    {
      "pk": 5016021,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 21,
      "text": "That he would argue the case of a man with God, as a son of man does with his neighbor.",
      "links": "<a href='/AIV/18/9/32-35'>Job 9:32-35</a>; <a href='/AIV/40/26/64'>Matt. 26:64</a>",
      "comment": "Job’s longing for a mediator 'Son of Man' prefigures Christ, the ultimate intercessor who advocates for humanity before God (cf. Matt. 26:64)."
    },
    {
      "pk": 5016022,
      "translation": "AIV",
      "book": 18,
      "chapter": 16,
      "verse": 22,
      "text": "For when a few years have passed, I shall go the way from which I shall not return.",
      "links": "<a href='/AIV/18/7/9'>Job 7:9</a>; <a href='/AIV/18/10/21'>Job 10:21</a>",
      "comment": "Job refers to death (‘the way from which I shall not return’), highlighting human mortality and deepening the foreshadowing of the promise of resurrection."
    }
  ],
  "translatedAt": "2025-12-23T05:21:51.121Z"
}