{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 12,
  "verses": [
    {
      "pk": 1831201,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "<a href='/AIV/18/11/2'>Job 11:2</a>",
      "comment": "Job begins his reply, continuing the dialogue with his friends. The opening signals an important transition, echoing earlier speeches."
    },
    {
      "pk": 1831202,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 2,
      "text": "No doubt you are the people, and wisdom will die with you.",
      "links": "<a href='/AIV/18/13/2'>Job 13:2</a>",
      "comment": "Job responds with sarcasm, suggesting his friends think they have a monopoly on wisdom. This rhetorical device highlights the limits of human understanding, a theme found throughout Scripture."
    },
    {
      "pk": 1831203,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 3,
      "text": "But I have understanding as well as you; I am not inferior to you. And who does not know things like these?",
      "links": "<a href='/AIV/18/13/2'>Job 13:2</a>; <a href='/AIV/18/6/6'>Job 6:6</a>",
      "comment": "Job affirms that wisdom is not exclusive. The democratization of wisdom anticipates the universal call to truth and knowledge in later revelation."
    },
    {
      "pk": 1831204,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 4,
      "text": "I am a laughingstock to my friends, though I called on God and He answered me — a just and blameless man is a joke.",
      "links": "<a href='/AIV/18/17/2'>Job 17:2</a>; <a href='/AIV/19/22/6-7'>Ps. 22:6–7</a>",
      "comment": "Here Job foreshadows the suffering of the righteous, a theme later fulfilled in Christ, who was mocked though innocent (see <a href='/AIV/19/22/6-7'>Ps. 22:6-7</a>)."
    },
    {
      "pk": 1831205,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 5,
      "text": "In times of calamity, those whose feet are secure despise and are ready to push down those who stumble.",
      "links": "<a href='/AIV/19/35/15-16'>Ps. 35:15–16</a>",
      "comment": "Job notes the tendency to look down on the suffering, a warning seen elsewhere and reflected in Christ’s call to care for the unfortunate."
    },
    {
      "pk": 1831206,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 6,
      "text": "The tents of robbers prosper, and those who provoke God are secure, who bring their own god in their hand.",
      "links": "<a href='/AIV/19/73/3-12'>Ps. 73:3–12</a>",
      "comment": "Job observes the apparent prosperity of the wicked, which is a puzzle elsewhere in the Old Testament. This tension points to later teachings on justice and judgment."
    },
    {
      "pk": 1831207,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 7,
      "text": "But ask the beasts, and they will teach you; the birds of the sky, and they will tell you;",
      "links": "<a href='/AIV/18/35/11'>Job 35:11</a>; <a href='/AIV/19/148/10'>Ps. 148:10</a>",
      "comment": "Job points to Creation as a source of wisdom, echoing the broader biblical theme that God’s glory is revealed through nature."
    },
    {
      "pk": 1831208,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 8,
      "text": "Speak to the earth, and it will teach you; let the fish of the sea declare to you.",
      "links": "<a href='/AIV/19/104/25-26'>Ps. 104:25–26</a>",
      "comment": "All creation testifies to God’s order, reinforcing the tradition that nature points beyond itself to its Creator, preparing the way for a sacramental worldview."
    },
    {
      "pk": 1831209,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 9,
      "text": "Who among all these does not know that the hand of the LORD has done this?",
      "links": "<a href='/AIV/19/24/1-2'>Ps. 24:1–2</a>; <a href='/AIV/19/19/1-2'>Ps. 19:1–2</a>",
      "comment": "Job insists all creation is aware of God’s sovereignty. This anticipates Romans 1:20, where Paul says God's attributes are evident through creation."
    },
    {
      "pk": 1831210,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 10,
      "text": "In His hand is the life of every living thing, and the breath of all mankind.",
      "links": "<a href='/AIV/18/33/4'>Job 33:4</a>; <a href='/AIV/19/104/29'>Ps. 104:29</a>",
      "comment": "The breath of life belongs to God alone, connecting to the theme of God’s creative and sustaining power throughout Scripture."
    },
    {
      "pk": 1831211,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 11,
      "text": "Does not the ear test words as the palate tastes food?",
      "links": "<a href='/AIV/18/34/3'>Job 34:3</a>",
      "comment": "Job uses a proverb, encouraging discernment. It reflects a biblical wisdom tradition about careful judgment of words and teaching."
    },
    {
      "pk": 1831212,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 12,
      "text": "Wisdom is with the aged, and understanding in length of days.",
      "links": "<a href='/AIV/20/16/31'>Prov. 16:31</a>",
      "comment": "This affirms the value of tradition and inherited wisdom within the faith community, reminiscent of the respect for elders and the transmission of truth."
    },
    {
      "pk": 1831213,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 13,
      "text": "With God are wisdom and might; He has counsel and understanding.",
      "links": "<a href='/AIV/19/147/5'>Ps. 147:5</a>",
      "comment": "Job roots all ultimate wisdom and strength in God, a foundation for humbly accepting divine authority above human reasoning."
    },
    {
      "pk": 1831214,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 14,
      "text": "If He tears something down, it cannot be rebuilt; if He shuts a man in, no one can open.",
      "links": "<a href='/AIV/23/22/22'>Isa. 22:22</a>; <a href='/AIV/66/3/7'>Rev. 3:7</a>",
      "comment": "Job affirms God’s absolute authority. The imagery here is later picked up by Isaiah and Revelation for Christ’s kingly power and authority over salvation."
    },
    {
      "pk": 1831215,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 15,
      "text": "If He holds back the waters, they dry up; if He lets them go, they overwhelm the earth.",
      "links": "<a href='/AIV/1/7/17'>Gen. 7:17</a>; <a href='/AIV/19/104/7-9'>Ps. 104:7–9</a>",
      "comment": "God’s control over the elements recalls Creation and the Flood, emphasizing His providence and power over natural order."
    },
    {
      "pk": 1831216,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 16,
      "text": "With Him are strength and sound wisdom; the deceived and the deceiver are His.",
      "links": "<a href='/AIV/20/21/30'>Prov. 21:30</a>",
      "comment": "Job asserts God's sovereignty even over those who mislead or are misled, hinting at the mysterious allowance of evil for wisdom beyond human grasp."
    },
    {
      "pk": 1831217,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 17,
      "text": "He leads counselors away stripped and makes judges fools.",
      "links": "<a href='/AIV/19/107/40'>Ps. 107:40</a>",
      "comment": "This reverses earthly roles, echoing the theme that divine wisdom is superior to human authority."
    },
    {
      "pk": 1831218,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 18,
      "text": "He undoes the bonds of kings and binds their loins with a belt.",
      "links": "<a href='/AIV/19/76/12'>Ps. 76:12</a>",
      "comment": "God alone changes the fortunes of rulers, a theme in biblical history affirming the legitimacy of divinely appointed leaders."
    },
    {
      "pk": 1831219,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 19,
      "text": "He leads priests away stripped, and overthrows those who have been established.",
      "links": "<a href='/AIV/26/44/10'>Ezek. 44:10</a>",
      "comment": "Even spiritual leaders are subject to God’s judgment, highlighting the spiritual authority and accountability that comes from being set apart."
    },
    {
      "pk": 1831220,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 20,
      "text": "He removes speech from those trusted, and takes away discernment from elders.",
      "links": "<a href='/AIV/23/3/2-3'>Isa. 3:2–3</a>",
      "comment": "Wise counsel depends on God; without Him, even the aged lose insight, recalling the need for spiritual tradition and guidance."
    },
    {
      "pk": 1831221,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 21,
      "text": "He pours contempt on rulers and loosens the belt of the strong.",
      "links": "<a href='/AIV/19/107/40'>Ps. 107:40</a>",
      "comment": "Earthly strength is nothing before God’s will, a theme reminding believers to rely on God rather than worldly power."
    },
    {
      "pk": 1831222,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 22,
      "text": "He reveals deep things out of darkness, and brings the shadow of death to light.",
      "links": "<a href='/AIV/19/139/11-12'>Ps. 139:11–12</a>",
      "comment": "God uncovers mysteries, a foreshadowing of the light of Christ, who brings life to those in darkness, echoed in John 1:5."
    },
    {
      "pk": 1831223,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 23,
      "text": "He makes nations great, and destroys them; He enlarges nations, then leads them away.",
      "links": "<a href='/AIV/2/1/7-12'>Ex. 1:7–12</a>; <a href='/AIV/23/10/5-7'>Isa. 10:5–7</a>",
      "comment": "The rise and fall of nations is under God’s control, reminding us that God’s providence governs history."
    },
    {
      "pk": 1831224,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 24,
      "text": "He takes away understanding from the leaders of the earth, and makes them wander in a trackless wasteland.",
      "links": "<a href='/AIV/18/5/13'>Job 5:13</a>; <a href='/AIV/19/107/40'>Ps. 107:40</a>",
      "comment": "God frustrates worldly wisdom, bringing humility to those who rely on themselves. This reflects the biblical motif of God exalting the humble."
    },
    {
      "pk": 1831225,
      "translation": "AIV",
      "book": 18,
      "chapter": 12,
      "verse": 25,
      "text": "They grope in the dark without light, and He makes them stagger like drunkards.",
      "links": "<a href='/AIV/19/107/27'>Ps. 107:27</a>; <a href='/AIV/40/15/14'>Matt. 15:14</a>",
      "comment": "This closing verse re-emphasizes that without God’s guidance, all fall into confusion. The motif of light and darkness bridges Old and New Testaments, pointing to Christ as the Light of the world."
    }
  ],
  "translatedAt": "2025-12-23T05:20:00.898Z"
}