{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 41,
  "verses": [
    {
      "pk": 1941001,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 1,
      "text": "Can you draw out Leviathan with a fishhook, or tie down his tongue with a rope?",
      "links": "<a href='/AIV/18/40/15-24'>Job 40:15-24</a>; <a href='/AIV/19/104/26'>Ps 104:26</a>",
      "comment": "Leviathan represents a mighty, untamable monster. The rhetorical question emphasizes human limitation before divine creation."
    },
    {
      "pk": 1941002,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 2,
      "text": "Can you put a cord through his nose, or pierce his jaw with a hook?",
      "links": "<a href='/AIV/18/41/1'>v. 1</a>; <a href='/AIV/34/1/12'>Nahum 1:12</a>",
      "comment": "Questions reinforce the impossibility for man to control Leviathan, highlighting God’s sovereignty over all creation."
    },
    {
      "pk": 1941003,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 3,
      "text": "Will he make many supplications to you? Will he speak soft words to you?",
      "links": "<a href='/AIV/18/41/4'>v. 4</a>",
      "comment": "Leviathan is pictured as proud and unyielding, not subject to human authority or persuasion."
    },
    {
      "pk": 1941004,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 4,
      "text": "Will he make a covenant with you, to take him as a servant forever?",
      "links": "<a href='/AIV/18/41/3'>v. 3</a>",
      "comment": "The imagery points to the impossibility of domesticating this creature, echoing human inability to subdue chaos apart from God."
    },
    {
      "pk": 1941005,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 5,
      "text": "Will you play with him as with a bird, or will you tie him up for your girls?",
      "links": "<a href='/AIV/18/41/4'>v. 4</a>",
      "comment": "The notion of children playing with Leviathan intensifies the absurdity, highlighting God's power alone to master creation."
    },
    {
      "pk": 1941006,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 6,
      "text": "Will traders bargain over him? Will they divide him among the merchants?",
      "links": "<a href='/AIV/18/41/5'>v. 5</a>; <a href='/AIV/26/27/12'>Ezek. 27:12</a>",
      "comment": "Leviathan’s value cannot be measured by commerce; his uniqueness reflects the mystery of God's works."
    },
    {
      "pk": 1941007,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 7,
      "text": "Can you fill his skin with harpoons, or his head with fishing spears?",
      "links": "<a href='/AIV/18/41/2'>v. 2</a>",
      "comment": "No human weapon can subdue Leviathan, illustrating God's control over even the strongest forces."
    },
    {
      "pk": 1941008,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 8,
      "text": "Lay your hands on him; remember the battle—you will do it no more!",
      "links": "<a href='/AIV/18/41/9'>v. 9</a>",
      "comment": "A warning about impossible endeavors without divine assistance, a reminder that spiritual warfare must rely on God's grace. (See <a href='/AIV/49/6/12'>Eph. 6:12</a>)"
    },
    {
      "pk": 1941009,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 9,
      "text": "Hope of capturing him is false; just the sight of him will bring terror.",
      "links": "<a href='/AIV/18/41/8'>v. 8</a>",
      "comment": "Leviathan evokes fear, paralleling humanity’s awe before divine mystery. This fosters humble trust in God's providence."
    },
    {
      "pk": 1941010,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 10,
      "text": "No one is so fierce that he dares to stir him up. Who then is able to stand before me?",
      "links": "<a href='/AIV/19/76/7'>Ps 76:7</a>; <a href='/AIV/20/1/7'>Prov. 1:7</a>",
      "comment": "God’s ultimate authority is asserted; man’s terror before nature is nothing compared to the reverence before the Creator."
    },
    {
      "pk": 1941011,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 11,
      "text": "Who has given to me, that I should repay him? Whatever is under all heaven belongs to me.",
      "links": "<a href='/AIV/19/24/1'>Ps 24:1</a>; <a href='/AIV/45/11/35'>Rom. 11:35</a>",
      "comment": "The assertion of ownership affirms God as Creator and sustainer of all things—a foundation for understanding divine providence."
    },
    {
      "pk": 1941012,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 12,
      "text": "I will not keep silence about his limbs, or his mighty strength, or his graceful form.",
      "links": "<a href='/AIV/18/40/15'>Job 40:15</a>",
      "comment": "God’s speech emphasizes the wonder of Leviathan, inviting contemplation of the beauty and complexity of creation."
    },
    {
      "pk": 1941013,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 13,
      "text": "Who can strip off his outer coat? Who can come near him with a bridle?",
      "links": "<a href='/AIV/18/41/7'>v. 7</a>",
      "comment": "Leviathan’s defensive armor further demonstrates human weakness before divine design."
    },
    {
      "pk": 1941014,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 14,
      "text": "Who can open the doors of his face? His teeth are terrifying all around.",
      "links": "<a href='/AIV/18/41/6'>v. 6</a>; <a href='/AIV/18/41/33'>v. 33</a>",
      "comment": "Description shifts from external protection to fearsome internal features, intensifying awe of God's works."
    },
    {
      "pk": 1941015,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 15,
      "text": "His back is made of rows of shields, shut up tightly as with a seal.",
      "links": "<a href='/AIV/18/41/13'>v. 13</a>",
      "comment": "The impenetrable armor symbolizes unstoppable force; a metaphor for evil or chaos which only God can restrain."
    },
    {
      "pk": 1941016,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 16,
      "text": "One is so close to another that no air can come between them.",
      "links": "<a href='/AIV/18/41/15'>v. 15</a>",
      "comment": "This detail magnifies Leviathan’s resistance to attack; the closeness recalls unity and strength."
    },
    {
      "pk": 1941017,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 17,
      "text": "They are joined to each other; they clasp together and cannot be separated.",
      "links": "<a href='/AIV/18/41/16'>v. 16</a>",
      "comment": "Unity of Leviathan’s armor is a reminder of the importance of spiritual unity among God's people. (See <a href='/AIV/43/17/22'>John 17:22</a>)"
    },
    {
      "pk": 1941018,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 18,
      "text": "His sneezes flash forth light, and his eyes are like the eyelids of dawn.",
      "links": "<a href='/AIV/18/41/19'>v. 19</a>; <a href='/AIV/19/104/2'>Ps 104:2</a>",
      "comment": "Vivid supernatural images point to mysterious power, sometimes seen as symbols of underlying spiritual realities."
    },
    {
      "pk": 1941019,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 19,
      "text": "Out of his mouth go flaming torches; sparks of fire leap forth.",
      "links": "<a href='/AIV/18/41/18'>v. 18</a>; <a href='/AIV/66/12/3'>Rev. 12:3</a>",
      "comment": "Leviathan’s fire-breathing evokes later biblical imagery of spiritual warfare and the adversary’s power."
    },
    {
      "pk": 1941020,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 20,
      "text": "Out of his nostrils comes smoke, as from a boiling pot and burning rushes.",
      "links": "<a href='/AIV/18/41/19'>v. 19</a>",
      "comment": "Leviathan’s fiery breath relates to mythic expressions of chaos and evil, under God’s ultimate restraint."
    },
    {
      "pk": 1941021,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 21,
      "text": "His breath kindles coals, and a flame comes out of his mouth.",
      "links": "<a href='/AIV/18/41/19'>v. 19</a>; <a href='/AIV/20/16/27'>Prov. 16:27</a>",
      "comment": "Fire imagery is often tied to judgment and refinement, hinting at spiritual purification through divine trials."
    },
    {
      "pk": 1941022,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 22,
      "text": "In his neck resides strength, and terror dances before him.",
      "links": "<a href='/AIV/18/41/25'>v. 25</a>",
      "comment": "The neck as seat of power signifies steadfastness; spiritual terror is confronted not alone but through God’s grace."
    },
    {
      "pk": 1941023,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 23,
      "text": "The folds of his flesh cling together; firm on him, they are not moved.",
      "links": "<a href='/AIV/18/41/15-17'>v. 15-17</a>",
      "comment": "Emphasizes the creature's impenetrability and God’s creative mastery."
    },
    {
      "pk": 1941024,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 24,
      "text": "His heart is as hard as a stone, as hard as a lower millstone.",
      "links": "<a href='/AIV/18/41/15'>v. 15</a>; <a href='/AIV/26/11/19'>Ezek. 11:19</a>",
      "comment": "A hard heart is occasionally a spiritual metaphor for resistance to repentance, yet even the hardest heart can be transformed by grace."
    },
    {
      "pk": 1941025,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 25,
      "text": "When he rises up, the mighty are afraid; at his crashing they are beside themselves.",
      "links": "<a href='/AIV/18/41/22'>v. 22</a>",
      "comment": "Human strength falters before Leviathan; only faith rooted in God brings peace."
    },
    {
      "pk": 1941026,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 26,
      "text": "When the sword reaches him, it cannot avail; nor the spear, the dart, or the javelin.",
      "links": "<a href='/AIV/18/41/7'>v. 7</a>",
      "comment": "Physical weapons are useless; spiritual victory requires reliance on God’s power, foreshadowing later biblical imagery. (See <a href='/AIV/49/6/13-17'>Eph. 6:13–17</a>)"
    },
    {
      "pk": 1941027,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 27,
      "text": "He counts iron as straw and bronze as rotten wood.",
      "links": "<a href='/AIV/18/41/26'>v. 26</a>",
      "comment": "Earthly might and materials are nothing before Leviathan, much more before God."
    },
    {
      "pk": 1941028,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 28,
      "text": "The arrow cannot make him flee; slingstones are turned to stubble against him.",
      "links": "<a href='/AIV/18/41/26'>v. 26</a>",
      "comment": "Reinforces the indomitable strength of Leviathan, drawing attention to God’s incomprehensible power."
    },
    {
      "pk": 1941029,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 29,
      "text": "Clubs are counted as stubble; he laughs at the shaking of the javelin.",
      "links": "<a href='/AIV/18/41/28'>v. 28</a>",
      "comment": "Leviathan’s contempt for weapons shows the futility of resisting forces beyond earthly means."
    },
    {
      "pk": 1941030,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 30,
      "text": "His underparts are sharp as potsherds; he spreads himself like a threshing sledge on the mire.",
      "links": "<a href='/AIV/18/41/2'>v. 2</a>",
      "comment": "Sharp underparts add to Leviathan’s dangerousness, symbolizing how evil and chaos lurk beneath what appears powerful."
    },
    {
      "pk": 1941031,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 31,
      "text": "He makes the deep boil like a pot; he makes the sea like ointment.",
      "links": "<a href='/AIV/19/74/13-14'>Ps 74:13-14</a>; <a href='/AIV/19/104/25-26'>Ps 104:25-26</a>",
      "comment": "Leviathan’s power over the sea evokes creation and the subduing of chaos, a theme fulfilled by Christ calming the storm."
    },
    {
      "pk": 1941032,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 32,
      "text": "Behind him he leaves a shining wake; one would think the deep had white hair.",
      "links": "<a href='/AIV/18/41/31'>v. 31</a>; <a href='/AIV/19/107/23-30'>Ps 107:23-30</a>",
      "comment": "The poetic imagery enhances Leviathan's grandeur, reminding us of the mystery beyond human comprehension."
    },
    {
      "pk": 1941033,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 33,
      "text": "On earth there is none like him, made without fear.",
      "links": "<a href='/AIV/18/41/14'>v. 14</a>",
      "comment": "Uniqueness of Leviathan reflects the singular majesty and mystery of God’s creation. Leviathan is described as fearless, hinting at the final defeat of evil in salvation history."
    },
    {
      "pk": 1941034,
      "translation": "AIV",
      "book": 18,
      "chapter": 41,
      "verse": 34,
      "text": "He looks down on all that are high; he is king over all the proud.",
      "links": "<a href='/AIV/19/18/27'>Ps 18:27</a>; <a href='/AIV/66/20/2'>Rev 20:2</a>",
      "comment": "Echoes the biblical portrayal of pride and evil under God’s dominion. Leviathan ultimately is subject to God, foreshadowing Christ’s victory over darkness. Spiritually, tradition recognizes Leviathan as a symbol of spiritual evil, but the true King is the One who triumphs over all powers (see <a href='/AIV/51/2/15'>Col 2:15</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:33:25.960Z"
}