{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 4,
  "verses": [
    {
      "pk": 401400,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 1,
      "text": "Then Eliphaz the Temanite answered and said:",
      "links": "",
      "comment": "Eliphaz is the first of Job’s friends to respond, initiating a lengthy discourse on suffering and justice."
    },
    {
      "pk": 401401,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 2,
      "text": "\"If someone tries a word with you, will you be offended? But who can hold back from speaking?",
      "links": "",
      "comment": "Eliphaz gently tries to prepare Job for his following counsel, hinting at the delicate nature of advising a suffering friend."
    },
    {
      "pk": 401402,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 3,
      "text": "Look, you have instructed many, and you have strengthened weak hands.",
      "links": "<a href='/AIV/18/29/11-17'>Job 29:11-17</a>",
      "comment": "Eliphaz appeals to Job’s wisdom and compassion for the afflicted, implying that now Job must apply to himself what he has taught others (cf. Gal. 6:2)."
    },
    {
      "pk": 401403,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 4,
      "text": "Your words have upheld those who were stumbling, and you have made feeble knees strong.",
      "links": "<a href='/AIV/23/35/3'>Isa. 35:3</a>; <a href='/AIV/58/12/12'>Heb. 12:12</a>",
      "comment": "Job’s former encouragement echoes in the prophets and New Testament, where strengthening the weak is a mark of true righteousness."
    },
    {
      "pk": 401404,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 5,
      "text": "But now it has come to you, and you are dismayed; it touches you, and you are troubled.",
      "links": "<a href='/AIV/18/6/14'>Job 6:14</a>",
      "comment": "Eliphaz gently notes the irony that the sufferer becomes distressed, even after comforting others—a common human weakness, as seen even among the apostles."
    },
    {
      "pk": 401405,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 6,
      "text": "Is not your fear of God your confidence, and the integrity of your ways your hope?",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "He appeals to Job’s reverence and uprightness, reminding us that trust in God’s justice is foundational for hope, much as Christ placed all confidence in His Father (cf. Mk. 14:36)."
    },
    {
      "pk": 401406,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 7,
      "text": "Remember: Who that was innocent ever perished? Or where were the upright destroyed?",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "Eliphaz expresses the common belief of reward for righteousness, though this is challenged by Job’s experience. The ultimate Innocent Sufferer, Christ Himself, fulfills and transforms this expectation (cf. Is. 53:9; 2 Cor. 5:21)."
    },
    {
      "pk": 401407,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 8,
      "text": "As I have seen, those who plow iniquity and sow trouble reap the same.",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>; <a href='/AIV/48/6/7'>Gal. 6:7</a>",
      "comment": "This proverbial saying echoes through Scripture, but in light of Christ’s Passion, suffering cannot always be traced directly to personal sin."
    },
    {
      "pk": 401408,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 9,
      "text": "By the breath of God they perish, and by the blast of his anger they are consumed.",
      "links": "<a href='/AIV/19/18/15'>Ps. 18:15</a>",
      "comment": "God’s sovereign power brings judgment; cf. the destruction in the flood (Gen. 6–7) and fire from heaven (Gen. 19)."
    },
    {
      "pk": 401409,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 10,
      "text": "The roar of the lion, the voice of the fierce lion, and the teeth of the young lions are broken.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>; <a href='/AIV/1/49/9'>Gen. 49:9</a>",
      "comment": "Lions symbolize the mighty and proud; Scripture often portrays God humbling the powerful (cf. Dan. 4:30–37)."
    },
    {
      "pk": 401410,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 11,
      "text": "The strong lion perishes for lack of prey, and the whelps of the lioness are scattered.",
      "links": "<a href='/AIV/26/19/5'>Ezek. 19:5'</a>",
      "comment": "The imagery reinforces that prosperity and power offer no immunity to judgment; rather, all are subject to God’s providence."
    },
    {
      "pk": 401411,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 12,
      "text": "\"Now a word came stealthily to me; my ear received a whisper of it.",
      "links": "",
      "comment": "Eliphaz introduces what appears to be a revelation—a mysterious or prophetic dream—reflecting a belief in ongoing divine communication."
    },
    {
      "pk": 401412,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 13,
      "text": "Amid thoughts from visions of the night, when deep sleep falls on men,",
      "links": "<a href='/AIV/1/15/12'>Gen. 15:12</a>",
      "comment": "Nighttime visions often signal the supernatural in the Old Testament (e.g., Abraham, Daniel), pointing to God’s initiative in revelation."
    },
    {
      "pk": 401413,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 14,
      "text": "Dread came upon me, and trembling, which made all my bones shake.",
      "links": "",
      "comment": "Such an encounter inspires real fear; compare with the awe of those in Scripture who encounter angels or the divine (cf. Lk. 1:12; Ex. 3:6)."
    },
    {
      "pk": 401414,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 15,
      "text": "A spirit passed before my face; the hair of my flesh stood up.",
      "links": "",
      "comment": "The ancient world recognized spiritual realities, and even a fleeting presence could provoke terror—a sign of the transcendent."
    },
    {
      "pk": 401415,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 16,
      "text": "It stood still, but I could not discern its appearance. A form was before my eyes; there was silence, then I heard a voice:",
      "links": "",
      "comment": "Mystery surrounds genuine encounters with the divine or the angelic, often more than can be easily understood—preparing for revealed truth."
    },
    {
      "pk": 401416,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 17,
      "text": "\"Can mortal man be righteous before God? Can a man be pure before his Maker?",
      "links": "<a href='/AIV/18/25/4'>Job 25:4</a>; <a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Here lies the deep question of human righteousness—no human, apart from grace, is perfectly righteous before God (see also Rom. 3:10-23). This anticipates the need for a Redeemer who is both fully man and fully God."
    },
    {
      "pk": 401417,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 18,
      "text": "Even in his servants he puts no trust, and his angels he charges with error;",
      "links": "<a href='/AIV/18/15/15'>Job 15:15</a>; <a href='/AIV/61/2/4'>2 Pet. 2:4</a>",
      "comment": "God’s holiness, before which even angels may be found wanting, points to creation's dependence on the Creator and sets the stage for the doctrine of grace."
    },
    {
      "pk": 401418,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 19,
      "text": "how much more those who dwell in houses of clay, whose foundation is in the dust, who are crushed more quickly than a moth!",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/18/13/28'>Job 13:28</a>; <a href='/AIV/47/4/7'>2 Cor. 4:7</a>",
      "comment": "Humankind’s frailty, coming from the dust of the earth, points to our mortality and constant need for God’s mercy and for sanctifying grace."
    },
    {
      "pk": 401419,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 20,
      "text": "Between morning and evening they are shattered; they perish forever without anyone regarding it.",
      "links": "<a href='/AIV/18/14/2'>Job 14:2</a>; <a href='/AIV/19/90/6'>Ps. 90:6</a>",
      "comment": "Human life is described as fleeting—a major theme in wisdom literature, and which Christ answers with the promise of resurrection (cf. Jn. 5:28-29)."
    },
    {
      "pk": 401420,
      "translation": "AIV",
      "book": 18,
      "chapter": 4,
      "verse": 21,
      "text": "Is not their tent-cord pulled up within them, so that they die, and that without wisdom?",
      "links": "<a href='/AIV/23/38/12'>Isa. 38:12</a>",
      "comment": "Here life is likened to a tent quickly taken down, echoing Paul’s image (2 Cor. 5:1-4), and pointing to the greater home for the just after death—the hope of those who trust in God’s saving work."
    }
  ],
  "translatedAt": "2025-12-23T05:16:52.650Z"
}