{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 32,
  "verses": [
    {
      "pk": 1803201,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 1,
      "text": "So these three men stopped answering Job, because he was righteous in his own eyes.",
      "links": "<a href='/AIV/18/29/14'>Job 29:14</a>; <a href='/AIV/18/42/7'>Job 42:7</a>",
      "comment": "Job’s friends have reached the end of their arguments, convinced of Job’s self-righteousness. This sets up the introduction of a new voice, hinting at the need for a mediator to bridge gaps in understanding, foreshadowing the importance of intercession (cf. 1 Tim. 2:5)."
    },
    {
      "pk": 1803202,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 2,
      "text": "Then the anger of Elihu the son of Barachel the Buzite, of the family of Ram, burned against Job. His anger burned because Job justified himself rather than God.",
      "links": "<a href='/AIV/18/42/7-9'>Job 42:7–9</a>",
      "comment": "Elihu introduces a youthful perspective, angered not by malice but by zeal for truth. The theme of justification before God is crucial: true righteousness must come from God, not from self-justification—foreshadowing the doctrine of righteousness imparted by divine grace (Rom. 3:21–26)."
    },
    {
      "pk": 1803203,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 3,
      "text": "He was also angry at his three friends because they had found no answer, yet condemned Job.",
      "links": "<a href='/AIV/18/8/2'>Job 8:2</a>; <a href='/AIV/18/15/2'>Job 15:2</a>",
      "comment": "Elihu’s indignation exposes the failure of mere human wisdom. The need for an authoritative tradition and rightly-ordered judgment is highlighted here, anticipating the value of a divinely guided community’s teaching authority."
    },
    {
      "pk": 1803204,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 4,
      "text": "Now Elihu had waited to speak to Job because they were older than he.",
      "links": "<a href='/AIV/18/32/6'>Job 32:6</a>",
      "comment": "Respect for elders is here shown, consistent with biblical virtue (Lev. 19:32). Yet, Elihu’s arrival shows that authentic wisdom may break into tradition even from unexpected places, as seen throughout salvation history."
    },
    {
      "pk": 1803205,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 5,
      "text": "When Elihu saw that there was no answer in the mouths of these three men, his anger burned.",
      "links": "<a href='/AIV/18/32/3'>Job 32:3</a>",
      "comment": "Elihu’s zeal represents righteous indignation, pointing to the prophets and the saints’ boldness in defense of truth (Jer. 20:9). Sometimes, reform and admonition come from those who seem least likely."
    },
    {
      "pk": 1803206,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 6,
      "text": "Elihu the son of Barachel the Buzite spoke out and said: “I am young in years, and you are old; therefore I was timid and afraid to declare my opinion to you.",
      "links": "<a href='/AIV/18/32/4'>Job 32:4</a>",
      "comment": "Elihu’s humility, and awareness of his own youth, recalls the humble yet bold witness required of God’s servants (1 Tim. 4:12)."
    },
    {
      "pk": 1803207,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 7,
      "text": "I said, ‘Days should speak, and many years should teach wisdom.’",
      "links": "<a href='/AIV/18/12/12'>Job 12:12</a>",
      "comment": "Traditionally, age is linked with wisdom, indicating the importance of tradition and the value of passed-down teaching (Deut. 32:7). But God’s Spirit may raise up the humble, emphasizing the virtue of humility in hearing God’s voice."
    },
    {
      "pk": 1803208,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 8,
      "text": "But it is the spirit in a man, the breath of the Almighty, that gives them understanding.",
      "links": "<a href='/AIV/18/33/4'>Job 33:4</a>; <a href='/AIV/18/32/18'>Job 32:18</a>; <a href='/AIV/19/119/99'>Ps. 119:99</a>",
      "comment": "True understanding is ultimately a gift from God’s Spirit (Isa. 11:2). This points beyond mere human effort and anticipates the gifting of the Holy Spirit to all believers (John 16:13)."
    },
    {
      "pk": 1803209,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 9,
      "text": "It is not the great who are wise, nor do the aged understand justice.",
      "links": "<a href='/AIV/19/119/100'>Ps. 119:100</a>",
      "comment": "Here, Elihu highlights human limitations. Divine wisdom sometimes upends human expectations, as when God chooses the lowly (Luke 1:52)."
    },
    {
      "pk": 1803210,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 10,
      "text": "Therefore I say, ‘Listen to me; I will also declare my opinion.’",
      "links": "",
      "comment": "Inspired by the Spirit, even the young may speak truth with authority—a reminder that God often works through those open to His promptings."
    },
    {
      "pk": 1803211,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 11,
      "text": "Look, I waited for your words; I listened to your reasonings, while you searched out what to say.",
      "links": "",
      "comment": "Elihu respectfully listened first, suggesting that genuine dialogue and patience are necessary for discernment."
    },
    {
      "pk": 1803212,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 12,
      "text": "I gave you my attention, but there was not one of you who convinced Job or answered his words.",
      "links": "<a href='/AIV/18/6/25'>Job 6:25</a>",
      "comment": "Their inability to answer Job completely points to the limitations of unaided reason in deep questions of suffering, reinforcing the need for revealed wisdom."
    },
    {
      "pk": 1803213,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 13,
      "text": "Beware lest you say, ‘We have found wisdom; God may vanquish him, not a man.’",
      "links": "",
      "comment": "Elihu warns against pride in self-sufficiency, pointing to the need for humility before God’s revelations and judgments. Only God is ultimately wise."
    },
    {
      "pk": 1803214,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 14,
      "text": "He has not directed his words against me, and I will not answer him with your arguments.",
      "links": "",
      "comment": "Elihu indicates he will approach Job differently—open to God’s Spirit, not bound by previous human arguments. There is a model here of ecclesial renewal that is neither innovation nor mere repetition."
    },
    {
      "pk": 1803215,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 15,
      "text": "They are dismayed; they answer no more; words have deserted them.",
      "links": "",
      "comment": "The end of human ability to answer reveals the need for God’s intervention—God’s grace perfects and completes what nature cannot."
    },
    {
      "pk": 1803216,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 16,
      "text": "Should I wait, because they do not speak, because they stand there and answer no more?",
      "links": "",
      "comment": "Elihu sees a purpose in this silence—a readiness to hear a fresh word, echoing moments throughout Scripture where new revelation follows stillness (1 Kings 19:12)."
    },
    {
      "pk": 1803217,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 17,
      "text": "I also will answer my part; I too will declare my opinion.",
      "links": "",
      "comment": "Elihu’s willingness to speak up shows spiritual courage. The body of Christ is built as each member fulfills their calling."
    },
    {
      "pk": 1803218,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 18,
      "text": "For I am full of words; the spirit within me compels me.",
      "links": "<a href='/AIV/18/32/8'>Job 32:8</a>",
      "comment": "Elihu claims divine inspiration, paralleling prophetic calls like Jeremiah’s (Jer. 20:9). God’s Spirit moves individuals to speak for the good of the community."
    },
    {
      "pk": 1803219,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 19,
      "text": "Look, my heart is like wine that has no vent; like new wineskins, it is about to burst.",
      "links": "<a href='/AIV/19/39/3'>Ps. 39:3</a>; <a href='/AIV/40/9/17'>Matt. 9:17</a>",
      "comment": "The image of wine parallels the inner compulsion of God’s message. Echoes of this appear in Jesus’ teaching on wineskins (Matt. 9:17), revealing God’s truth often requires new forms for new times."
    },
    {
      "pk": 1803220,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 20,
      "text": "I must speak and find relief; I must open my lips and answer.",
      "links": "",
      "comment": "Authentic words inspired by God bring relief and truth, not only for the speaker but for listeners (cf. Acts 2:4)."
    },
    {
      "pk": 1803221,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 21,
      "text": "I will not show partiality to anyone, nor will I flatter any man.",
      "links": "<a href='/AIV/20/24/23'>Prov. 24:23</a>; <a href='/AIV/59/2/9'>James 2:9</a>",
      "comment": "True judgment requires impartiality. This consistent scriptural theme points to God’s justice rightly applied through His chosen instruments."
    },
    {
      "pk": 1803222,
      "translation": "AIV",
      "book": 18,
      "chapter": 32,
      "verse": 22,
      "text": "For I do not know how to flatter, or my Maker would soon take me away.",
      "links": "<a href='/AIV/18/27/8'>Job 27:8</a>",
      "comment": "Faithfulness to God’s word is key; Elihu would rather risk human disapproval than divine judgment—anticipating the call to authentic, spirit-led ministry (Gal. 1:10)."
    }
  ],
  "translatedAt": "2025-12-23T05:29:07.225Z"
}