{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 14,
  "verses": [
    {
      "pk": 201401,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 1,
      "text": "Man, born of woman, is of few days, and full of trouble.",
      "links": "<a href='/AIV/90/39/5'>Ps. 39:5</a>; <a href='/AIV/23/40/6'>Isa. 40:6</a>",
      "comment": "Job opens by noting human mortality and suffering, themes echoed throughout Scripture. This sets the stage for his reflection on life’s brevity and hardship (cf. Psalm 39:4–6)."
    },
    {
      "pk": 201402,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 2,
      "text": "He comes up like a flower, and withers; he flees like a shadow, and does not remain.",
      "links": "<a href='/AIV/19/103/15-16'>Ps. 103:15–16</a>; <a href='/AIV/60/1/24'>1 Pet. 1:24</a>",
      "comment": "The fleeting nature of human life is compared to a flower and a shadow. The New Testament draws on similar imagery, stressing the need for hope beyond this world."
    },
    {
      "pk": 201403,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 3,
      "text": "Do You open Your eyes on such a one and bring me into judgment with You?",
      "links": "<a href='/AIV/18/7/17-18'>Job 7:17–18</a>; <a href='/AIV/19/8/4'>Ps. 8:4</a>",
      "comment": "Job is astonished that God pays attention to frail humanity and questions why God would bring him into judgment, anticipating themes of divine justice and mercy."
    },
    {
      "pk": 201404,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 4,
      "text": "Who can bring a clean thing out of an unclean? No one.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>; <a href='/AIV/45/3/10-12'>Rom. 3:10–12</a>",
      "comment": "This verse captures the idea of inherent human sinfulness, a theme foundational for the doctrine of original sin and the need for redemption (cf. Romans 3:23)."
    },
    {
      "pk": 201405,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 5,
      "text": "Since his days are determined, the number of his months is with You, and You have set his limits that he cannot pass.",
      "links": "<a href='/AIV/19/139/16'>Ps. 139:16</a>; <a href='/AIV/18/7/1'>Job 7:1</a>",
      "comment": "God's sovereignty over the span of human life is emphasized here, reflecting God's providence and governance over creation."
    },
    {
      "pk": 201406,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 6,
      "text": "Turn from him, that he may rest, till he fulfills his day like a hired hand.",
      "links": "<a href='/AIV/19/39/13'>Ps. 39:13</a>",
      "comment": "Job pleads for respite, recognizing human labor and toil. He hints at longing for rest which prefigures the ultimate rest promised by God (see Hebrews 4:9)."
    },
    {
      "pk": 201407,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 7,
      "text": "For there is hope for a tree, if it is cut down, it will sprout again, and its shoot will not cease.",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/42/23/31'>Luke 23:31</a>",
      "comment": "The hope that a tree may live again contrasts with human mortality. This imagery alludes to the 'shoot from Jesse's stump' (Isaiah 11:1), ultimately fulfilled in Christ."
    },
    {
      "pk": 201408,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 8,
      "text": "Though its root grows old in the earth, and its stump dies in the ground,",
      "links": "<a href='/AIV/26/17/22-24'>Ezek. 17:22–24</a>",
      "comment": "This underlines the concept of renewal and potential for restoration—even after apparent death, connecting to prophetic imagery of new life."
    },
    {
      "pk": 201409,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 9,
      "text": "yet at the scent of water it will bud and put out branches like a young plant.",
      "links": "<a href='/AIV/29/2/25'>Joel 2:25</a>",
      "comment": "Water is often a symbol for spiritual life (cf. John 4:14). The miracle of new life from death anticipates a deeper resurrection hope."
    },
    {
      "pk": 201410,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 10,
      "text": "But a man dies and is laid low; man breathes his last, and where is he?",
      "links": "<a href='/AIV/19/89/48'>Ps. 89:48</a>",
      "comment": "Job questions humanity’s destiny after death. This echoes a yearning for resurrection and points forward to fuller revelation of life after death."
    },
    {
      "pk": 201411,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 11,
      "text": "As waters evaporate from a lake, and a river dries up,",
      "links": "<a href='/AIV/20/20/5'>Prov. 20:5</a>",
      "comment": "Job compares death’s finality to dried-up waters—a recurring biblical symbol for passing away and the hope for restoration from even utter loss."
    },
    {
      "pk": 201412,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 12,
      "text": "so man lies down and does not rise; till the heavens are no more, they will not awake or be roused from their sleep.",
      "links": "<a href='/AIV/19/13/3'>Ps. 13:3</a>; <a href='/AIV/27/12/2'>Dan. 12:2</a>",
      "comment": "Reference to 'sleep' as death becomes foundational in later resurrection teachings (Daniel 12:2, John 11:11)."
    },
    {
      "pk": 201413,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 13,
      "text": "Oh, that You would hide me in Sheol, that You would conceal me until Your wrath turns away, that You would set a time and remember me!",
      "links": "<a href='/AIV/26/37/12'>Ezek. 37:12</a>; <a href='/AIV/45/5/9'>Rom. 5:9</a>",
      "comment": "Job desires refuge from God’s judgment. The theme of intercession and waiting for deliverance points to hope beyond death and ultimate vindication."
    },
    {
      "pk": 201414,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 14,
      "text": "If a man dies, will he live again? All the days of my service I would wait, till my renewal would come.",
      "links": "<a href='/AIV/43/11/25-26'>John 11:25–26</a>",
      "comment": "Here, Job explicitly asks about life after death. The idea of 'renewal' anticipates the New Testament’s promise of resurrection, realized in Christ."
    },
    {
      "pk": 201415,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 15,
      "text": "You would call, and I would answer You; You would long for the work of Your hands.",
      "links": "<a href='/AIV/19/17/15'>Ps. 17:15</a>",
      "comment": "Job senses that God deeply values humanity, longing for restored fellowship—a theme fulfilled in Christ’s invitation to communion with God."
    },
    {
      "pk": 201416,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 16,
      "text": "For then You would number my steps, You would not keep watch over my sin.",
      "links": "<a href='/AIV/19/130/3-4'>Ps. 130:3–4</a>",
      "comment": "God’s mercy and forgiveness are implied; the hope that sins will not be counted foreshadows deeper doctrines of grace and reconciliation."
    },
    {
      "pk": 201417,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 17,
      "text": "My transgression would be sealed up in a bag, and You would cover over my iniquity.",
      "links": "<a href='/AIV/19/32/1-2'>Ps. 32:1–2</a>; <a href='/AIV/45/4/7-8'>Rom. 4:7–8</a>",
      "comment": "Imagery of sin being concealed connects to the biblical teaching on forgiveness and atonement, fulfilled perfectly in the sacrificial work of Christ."
    },
    {
      "pk": 201418,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 18,
      "text": "But the mountain falls and crumbles away, and the rock is removed from its place;",
      "links": "<a href='/AIV/18/19/10'>Job 19:10</a>",
      "comment": "Even the greatest things in creation pass away, a reminder of the frailty of all created things compared with the eternal purposes of God."
    },
    {
      "pk": 201419,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 19,
      "text": "the waters wear away the stones; the torrents wash away the soil of the earth—so You destroy the hope of man.",
      "links": "<a href='/AIV/19/90/5-6'>Ps. 90:5–6</a>",
      "comment": "Nature’s processes image the slow but certain end of life; apart from divine intervention, human hope naturally perishes."
    },
    {
      "pk": 201420,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 20,
      "text": "You overpower him forever, and he passes; You change his face and send him away.",
      "links": "<a href='/AIV/18/9/5'>Job 9:5</a>",
      "comment": "Life’s temporary nature and God’s control over death are stressed. The language hints at both judgment and the possibility of transformation."
    },
    {
      "pk": 201421,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 21,
      "text": "His sons come to honor, but he does not know it; they are brought low, but he perceives it not.",
      "links": "<a href='/AIV/18/21/21'>Job 21:21</a>",
      "comment": "Job notes that the dead are unaware of earthly events, indicating mystery about the afterlife but open to further revelation on postmortem existence."
    },
    {
      "pk": 201422,
      "translation": "AIV",
      "book": 18,
      "chapter": 14,
      "verse": 22,
      "text": "He feels only the pain of his own body, and he mourns only for himself.",
      "links": "",
      "comment": "Job ends with the reality of personal suffering. The longing for meaning and hope amid suffering finds ultimate answer in Christ’s redemptive work and the promise of resurrection."
    }
  ],
  "translatedAt": "2025-12-23T05:20:52.214Z"
}