{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 28,
  "verses": [
    {
      "pk": 5028001,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 1,
      "text": "Surely there is a mine for silver, and a place where gold is refined.",
      "links": "<a href='/AIV/18/28/11'>Job 28:11</a>; <a href='/AIV/20/2/4'>Prov. 2:4</a>",
      "comment": "Job begins a poetic meditation contrasting the search for precious metals with the search for wisdom. The phrasing highlights mankind's ingenuity and industriousness in seeking earthly treasures."
    },
    {
      "pk": 5028002,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 2,
      "text": "Iron is taken out of the earth, and copper is smelted from the stone.",
      "links": "<a href='/AIV/5/8/9'>Deut. 8:9</a>",
      "comment": "The imagery points to the creative uses of the earth by humanity, foreshadowing the deeper search for that which cannot be mined: wisdom."
    },
    {
      "pk": 5028003,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 3,
      "text": "Man puts an end to darkness and searches out the farthest limits for ore in deep darkness and shadow.",
      "links": "<a href='/AIV/18/12/22'>Job 12:22</a>",
      "comment": "The description of overcoming darkness through effort and exploration subtly hints at humanity’s spiritual quest for truth beyond physical limits."
    },
    {
      "pk": 5028004,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 4,
      "text": "He breaks open a shaft away from where people live. They are forgotten by those who walk above; they hang far away, suspended as they swing to and fro.",
      "links": "<a href='/AIV/18/41/6'>Job 41:6</a>",
      "comment": "This poetic line depicts the dangers and isolation of miners. It foreshadows, metaphorically, the spiritual journey requiring dedication and sometimes isolation."
    },
    {
      "pk": 5028005,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 5,
      "text": "The earth, from which food comes forth, is transformed below as if by fire.",
      "links": "<a href='/AIV/1/4/12'>Gen. 4:12</a>",
      "comment": "A contrast appears: on the surface the earth provides, but below it holds hidden treasures, suggesting the need to seek deeper meaning beneath outward appearances."
    },
    {
      "pk": 5028006,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 6,
      "text": "Its stones are the place of sapphires, and it has dust of gold.",
      "links": "<a href='/AIV/2/28/18'>Exod. 28:18</a>; <a href='/AIV/66/21/19'>Rev. 21:19</a>",
      "comment": "The mention of sapphires and gold links with the building materials of holy places (see Rev. 21:19), deepening the spiritual typology pointing to heavenly treasures."
    },
    {
      "pk": 5028007,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 7,
      "text": "That path no bird of prey knows, nor has the falcon's eye seen it.",
      "links": "<a href='/AIV/24/8/7'>Jer. 8:7</a>",
      "comment": "Job underscores the hiddenness of wisdom, unseen even by the most perceptive of creatures. True wisdom is not accessible by natural means alone."
    },
    {
      "pk": 5028008,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 8,
      "text": "The proud beasts have not walked that path, nor has the lion passed over it.",
      "links": "<a href='/AIV/19/91/13'>Ps. 91:13</a>",
      "comment": "Even the strongest in creation have not uncovered this path — the search for wisdom requires humility and divine guidance."
    },
    {
      "pk": 5028009,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 9,
      "text": "Man stretches his hand against the flinty rock and overturns the mountains at their roots.",
      "links": "<a href='/AIV/19/114/4'>Ps. 114:4</a>",
      "comment": "Man’s ability to shape creation reflects the image of God in humans (Gen. 1:26–28), yet there is a greater reality—wisdom—beyond human grasping."
    },
    {
      "pk": 5028010,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 10,
      "text": "He cuts out channels through the rocks, and his eye sees every precious thing.",
      "links": "<a href='/AIV/18/29/6'>Job 29:6</a>",
      "comment": "The mastery over nature here is total—yet even knowing all earthly treasures does not give ultimate knowledge or meaning."
    },
    {
      "pk": 5028011,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 11,
      "text": "He dams up the sources of the streams so that hidden things come to light.",
      "links": "<a href='/AIV/18/12/22'>Job 12:22</a>",
      "comment": "Bringing hidden things to light alludes to God’s revelation, a key theme throughout Scripture (Matt. 10:26; 1 Cor. 2:10)."
    },
    {
      "pk": 5028012,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 12,
      "text": "But where can wisdom be found? And where is the place of understanding?",
      "links": "<a href='/AIV/20/8/1'>Prov. 8:1</a>",
      "comment": "The central question arises: after all mankind’s searching, true wisdom remains hidden. This echoes Prov. 8, where Wisdom is personified and speaks with divine authority."
    },
    {
      "pk": 5028013,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 13,
      "text": "Man does not know its value, nor is it found in the land of the living.",
      "links": "<a href='/AIV/19/27/13'>Ps. 27:13</a>; <a href='/AIV/20/3/15'>Prov. 3:15</a>",
      "comment": "Wisdom transcends earthly commodities. Its ultimate source is supernatural, hinting at the need for grace and revelation."
    },
    {
      "pk": 5028014,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 14,
      "text": "The deep says, 'It is not in me,' and the sea says, 'It is not with me.'",
      "links": "<a href='/AIV/19/77/19'>Ps. 77:19</a>",
      "comment": "Neither the depths nor the vastness of the sea possess wisdom; it is not part of the created order but comes from outside it."
    },
    {
      "pk": 5028015,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 15,
      "text": "It cannot be bought with the finest gold, nor can its price be weighed in silver.",
      "links": "<a href='/AIV/19/49/7-8'>Ps. 49:7-8</a>; <a href='/AIV/20/8/10-11'>Prov. 8:10-11</a>",
      "comment": "Wisdom’s worth surpasses any material things. Spiritual realities are always beyond price (see Matt. 13:44-46 for Jesus’ parables about treasure)."
    },
    {
      "pk": 5028016,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 16,
      "text": "It cannot be valued in gold of Ophir, in precious onyx, or sapphire.",
      "links": "<a href='/AIV/2/28/9'>Exod. 28:9</a>",
      "comment": "Ophir was famous for its exceptional gold. The text emphasizes that no gem, even used in the temple, compares to God’s wisdom."
    },
    {
      "pk": 5028017,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 17,
      "text": "Neither gold nor crystal can equal it, nor can it be exchanged for jewelry of fine gold.",
      "links": "<a href='/AIV/20/3/15'>Prov. 3:15</a>",
      "comment": "Material riches, no matter how pure, cannot be exchanged for true understanding—echoing wisdom’s surpassing worth in Proverbs."
    },
    {
      "pk": 5028018,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 18,
      "text": "No mention shall be made of coral or of quartz; the price of wisdom is above pearls.",
      "links": "<a href='/AIV/40/13/45-46'>Matt. 13:45-46</a>",
      "comment": "Jesus uses the image of a 'pearl of great price' to express the kingdom of heaven’s value, reflecting Job’s ancient insight."
    },
    {
      "pk": 5028019,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 19,
      "text": "The topaz of Ethiopia cannot compare with it; it cannot be valued in pure gold.",
      "links": "<a href='/AIV/2/28/17'>Exod. 28:17</a>",
      "comment": "Topaz and pure gold, though beautiful and valuable, are worthless compared to wisdom—another allusion to treasures used in worship and sanctuaries."
    },
    {
      "pk": 5028020,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 20,
      "text": "From where, then, does wisdom come? And where is the place of understanding?",
      "links": "<a href='/AIV/18/28/12'>Job 28:12</a>",
      "comment": "The repeated question highlights human limitation—a theme culminating in recognizing a divine source for wisdom."
    },
    {
      "pk": 5028021,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 21,
      "text": "It is hidden from the eyes of every living thing and concealed from the birds of the air.",
      "links": "<a href='/AIV/18/28/7'>Job 28:7</a>",
      "comment": "Wisdom’s mysteriousness points to its sacredness—God must reveal it to those who seek with humility."
    },
    {
      "pk": 5028022,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 22,
      "text": "Destruction and Death say, 'We have heard a report of it with our ears.'",
      "links": "<a href='/AIV/19/88/10-12'>Ps. 88:10-12</a>",
      "comment": "Even the places of the dead only know of wisdom by rumor, not possession, hinting that life’s ultimate meaning is found in communion with God, not in death."
    },
    {
      "pk": 5028023,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 23,
      "text": "God understands the way to it, and he knows its place.",
      "links": "<a href='/AIV/20/2/6'>Prov. 2:6</a>; <a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "The source of all wisdom is God alone. This anticipates New Testament revelation that in Christ are hidden all the treasures of wisdom and knowledge (Col. 2:3)."
    },
    {
      "pk": 5028024,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 24,
      "text": "For he looks to the ends of the earth and sees everything under the heavens.",
      "links": "<a href='/AIV/19/33/13'>Ps. 33:13-15</a>",
      "comment": "This verse describes God's omniscience and sovereignty, providing assurance that divine wisdom orders creation."
    },
    {
      "pk": 5028025,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 25,
      "text": "When he gave the wind its weight, and apportioned the waters by measure,",
      "links": "<a href='/AIV/1/1/6-10'>Gen. 1:6-10</a>",
      "comment": "God’s role as Creator emphasizes that wisdom is woven into the fabric of the cosmos, available only through divine self-disclosure."
    },
    {
      "pk": 5028026,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 26,
      "text": "when he made a decree for the rain and a path for the thunderstorm,",
      "links": "<a href='/AIV/18/37/16'>Job 37:16</a>",
      "comment": "The ordering of nature reflects God’s wisdom and authority over creation (see also Wis. 8:1)."
    },
    {
      "pk": 5028027,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 27,
      "text": "then he saw it and declared it; he established it and searched it out.",
      "links": "<a href='/AIV/20/8/22-31'>Prov. 8:22-31</a>",
      "comment": "Wisdom is both established and revealed by God, preexisting creation, echoing the personification of Wisdom in Proverbs 8—a figure interpreted by many early Christians as a foreshadowing of Christ."
    },
    {
      "pk": 5028028,
      "translation": "AIV",
      "book": 18,
      "chapter": 28,
      "verse": 28,
      "text": "And he said to mankind, 'Behold, the fear of the Lord—that is wisdom, and to turn away from evil is understanding.'",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>; <a href='/AIV/20/1/7'>Prov. 1:7</a>; <a href='/AIV/20/9/10'>Prov. 9:10</a>",
      "comment": "Job concludes that wisdom is found in reverence for God and rejection of evil. This connects to the biblical tradition (Psalm 111:10) and the call to holiness—foundation to union with God. In New Testament terms, true wisdom is ultimately revealed in Jesus, who is the Way, the Truth, and the Life (John 14:6)."
    }
  ],
  "translatedAt": "2025-12-23T05:26:42.910Z"
}