{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 33,
  "verses": [
    {
      "pk": 3303301,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 1,
      "text": "But now, Job, listen to my words; pay attention to all I say.",
      "links": "<a href='/AIV/18/13/17'>Job 13:17</a>",
      "comment": "Elihu appeals to Job personally, inviting him to listen. This signals a transition to a new speaker who claims special insight."
    },
    {
      "pk": 3303302,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 2,
      "text": "See now, I open my mouth; my tongue in my mouth speaks.",
      "links": "",
      "comment": "Elihu asserts his intention to speak clearly and truthfully, showing confidence in his role as mediator."
    },
    {
      "pk": 3303303,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 3,
      "text": "My words come from an upright heart; my lips sincerely speak what I know.",
      "links": "",
      "comment": "The theme of sincerity and integrity echoes the biblical virtue of speaking truth from the heart (cf. Psalm 15:2)."
    },
    {
      "pk": 3303304,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 4,
      "text": "The Spirit of God has made me, and the breath of the Almighty gives me life.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/18/32/8'>Job 32:8</a>",
      "comment": "Elihu credits his existence and insight to the Spirit of God—the reference to the 'breath' connects to creation, highlighting dependence on God’s inspiration."
    },
    {
      "pk": 3303305,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 5,
      "text": "If you can, answer me; set your words in order before me; stand up.",
      "links": "",
      "comment": "A courtroom motif: Elihu invites Job to defend himself like one presenting a case before a judge, evocative of approaching God with respect."
    },
    {
      "pk": 3303306,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 6,
      "text": "Look, I am like you before God; I too was formed from clay.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/18/10/9'>Job 10:9</a>",
      "comment": "Elihu reminds Job of their shared humanity, both having a common Creator—hinting at the theme of solidarity among believers."
    },
    {
      "pk": 3303307,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 7,
      "text": "No fear of me should terrify you, nor should my hand be heavy on you.",
      "links": "",
      "comment": "Elihu offers reassurance, contrasting human counsel with the awe-inspiring presence of God."
    },
    {
      "pk": 3303308,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 8,
      "text": "Surely you have spoken in my hearing, and I have heard the sound of your words:",
      "links": "",
      "comment": "He quotes Job, preparing to respond directly. Faithful listening is a prerequisite for true counsel (cf. James 1:19)."
    },
    {
      "pk": 3303309,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 9,
      "text": "\"I am pure, without guilt; I am clean, and there is no wrongdoing in me.",
      "links": "<a href='/AIV/18/9/21'>Job 9:21</a>; <a href='/AIV/18/13/18'>Job 13:18</a>",
      "comment": "Elihu paraphrases Job’s claims, demonstrating that self-righteousness is under scrutiny."
    },
    {
      "pk": 3303310,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 10,
      "text": "Yet God finds reasons against me and counts me as his enemy;",
      "links": "<a href='/AIV/18/13/24'>Job 13:24</a>",
      "comment": "Job’s perceived alienation from God echoes the human sense of separation due to suffering, pointing toward the need for reconciliation."
    },
    {
      "pk": 3303311,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 11,
      "text": "He puts my feet in the stocks and watches all my paths.\"",
      "links": "<a href='/AIV/18/13/27'>Job 13:27</a>",
      "comment": "Imagery of bondage and watchful surveillance—Job feels imprisoned by God’s scrutiny."
    },
    {
      "pk": 3303312,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 12,
      "text": "\"But I tell you, in this you are not right, for God is greater than a human being.",
      "links": "<a href='/AIV/18/11/7-9'>Job 11:7-9</a>",
      "comment": "Elihu challenges Job’s presumption, emphasizing God's transcendent ways—this anticipates Romans 9:20, where Paul asks, 'Who are you, O man, to answer back to God?'"
    },
    {
      "pk": 3303313,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 13,
      "text": "Why do you complain against him that he does not give an account of all his doings?",
      "links": "",
      "comment": "Elihu rebukes Job for demanding justification from God, which subtly reflects the call to humility before divine mystery."
    },
    {
      "pk": 3303314,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 14,
      "text": "For God speaks in one way, and in another, though people do not perceive it.",
      "links": "",
      "comment": "This reveals the idea of God's multi-faceted revelation (cf. Hebrews 1:1)—God reaches us in various ways, often unrecognized."
    },
    {
      "pk": 3303315,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 15,
      "text": "In a dream, in a vision of the night, when deep sleep falls on people, as they slumber on their beds,",
      "links": "<a href='/AIV/1/20/3'>Gen. 20:3</a>; <a href='/AIV/4/12/6'>Num. 12:6</a>",
      "comment": "Dreams and visions are recognized as legitimate means of divine communication (see Joel 2:28; Acts 2:17)."
    },
    {
      "pk": 3303316,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 16,
      "text": "then he opens their ears and terrifies them with warnings,",
      "links": "",
      "comment": "God’s revelation often comes to awaken or warn—this prepares the heart for repentance (see Jonah 3:5-10)."
    },
    {
      "pk": 3303317,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 17,
      "text": "to turn a man from wrongdoing and keep him from pride,",
      "links": "",
      "comment": "Divine correction is meant for salvation, not condemnation. This foreshadows God's discipline of those He loves (see Hebrews 12:6)."
    },
    {
      "pk": 3303318,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 18,
      "text": "to preserve his soul from the pit, his life from perishing by the sword.",
      "links": "<a href='/AIV/18/17/16'>Job 17:16</a>",
      "comment": "The 'pit' is often an image of Sheol, the abode of the dead. God’s correction is life-saving."
    },
    {
      "pk": 3303319,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 19,
      "text": "Man is also disciplined with pain on his bed, with constant distress in his bones,",
      "links": "<a href='/AIV/18/30/17'>Job 30:17</a>",
      "comment": "Physical suffering as divine discipline anticipates the redemptive value of suffering seen in the cross (cf. 2 Cor 4:17)."
    },
    {
      "pk": 3303320,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 20,
      "text": "so that his life loathes bread, and his soul despises the choicest food.",
      "links": "",
      "comment": "Suffering can cause detachment from earthly pleasures, which spiritually prepares the soul for deeper conversion."
    },
    {
      "pk": 3303321,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 21,
      "text": "His flesh wastes away, so it cannot be seen, and his bones, once hidden, now stick out.",
      "links": "",
      "comment": "A vivid description of severe illness—alluding to the frailty and mortality of man."
    },
    {
      "pk": 3303322,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 22,
      "text": "His soul draws near the pit, and his life to those who bring death.",
      "links": "",
      "comment": "Approaching death is seen as nearing Sheol. The need for redemption becomes clear here."
    },
    {
      "pk": 3303323,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 23,
      "text": "If there is a messenger for him, a mediator, one among a thousand, to show a man what is right for him,",
      "links": "<a href='/AIV/1/16/7-14'>Gen. 16:7-14</a>; <a href='/AIV/18/9/33'>Job 9:33</a>",
      "comment": "The concept of a 'mediator' points ahead to the New Testament’s high priestly ministry of Christ, the one true Mediator between God and man (1 Tim 2:5)."
    },
    {
      "pk": 3303324,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 24,
      "text": "and he is gracious to him and says, 'Deliver him from going down to the pit; I have found a ransom,'",
      "links": "<a href='/AIV/18/36/18'>Job 36:18</a>",
      "comment": "The term 'ransom' (Hebrew 'kofer') evokes sacrificial language, prefiguring the redemptive work fulfilled in Christ’s sacrifice (Mark 10:45)."
    },
    {
      "pk": 3303325,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 25,
      "text": "then his flesh shall become fresher than in youth; he shall return to the days of his youthful strength.",
      "links": "<a href='/AIV/18/42/10'>Job 42:10</a>",
      "comment": "Restoration follows redemption—this has spiritual parallels in the life of grace and ultimate resurrection."
    },
    {
      "pk": 3303326,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 26,
      "text": "He prays to God, and He accepts him; he sees His face with a shout of joy, and God restores his righteousness to him.",
      "links": "<a href='/AIV/18/42/8-9'>Job 42:8-9</a>",
      "comment": "God’s acceptance is seen through prayer and restoration—anticipating New Testament reconciliation through repentance and faith (James 5:16; Luke 15:21-24)."
    },
    {
      "pk": 3303327,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 27,
      "text": "He sings before men and says, 'I have sinned and perverted what was right, and it was not repaid to me.'",
      "links": "<a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "Open confession leads to forgiveness; this is at the heart of true repentance (cf. Psalm 32:5; 1 John 1:9)."
    },
    {
      "pk": 3303328,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 28,
      "text": "He has redeemed my soul from going down to the pit, and my life shall see the light.",
      "links": "<a href='/AIV/18/33/18'>Job 33:18</a>",
      "comment": "A clear anticipation of the hope of resurrection—seeing the light (cf. John 8:12), a biblical image of salvation."
    },
    {
      "pk": 3303329,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 29,
      "text": "Behold, God does all these things, twice, three times, with a man,",
      "links": "",
      "comment": "God’s persistent mercy is highlighted, emphasizing repeated opportunities for conversion."
    },
    {
      "pk": 3303330,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 30,
      "text": "to bring back his soul from the pit, that he may be enlightened with the light of life.",
      "links": "<a href='/AIV/19/56/13'>Ps. 56:13</a>",
      "comment": "A strong expression of God’s desire to save, foreshadowing the Christian understanding of salvation and new life in Christ (cf. John 1:4, John 8:12)."
    },
    {
      "pk": 3303331,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 31,
      "text": "Pay attention, Job, listen to me; be silent, and I will speak.",
      "links": "",
      "comment": "Elihu urges Job to listen—reception and obedience to wisdom are recurring biblical themes (cf. Proverbs 2:2)."
    },
    {
      "pk": 3303332,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 32,
      "text": "If you have anything to say, answer me; speak, for I desire to justify you.",
      "links": "<a href='/AIV/18/9/2-3'>Job 9:2-3</a>",
      "comment": "The desire for justification foreshadows the New Testament emphasis on justification before God. There is an implicit invitation to reconciliation."
    },
    {
      "pk": 3303333,
      "translation": "AIV",
      "book": 18,
      "chapter": 33,
      "verse": 33,
      "text": "If not, listen to me; be silent, and I will teach you wisdom.",
      "links": "<a href='/AIV/18/32/6'>Job 32:6</a>; <a href='/AIV/20/2/2'>Prov. 2:2</a>",
      "comment": "The closing call to learn wisdom echoes biblical tradition, in which true wisdom is ultimately found in God’s self-revelation and instruction."
    }
  ],
  "translatedAt": "2025-12-23T05:29:37.431Z"
}