{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 21,
  "verses": [
    {
      "pk": 2102101,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "<a href='/AIV/18/20/1'>Job 20:1</a>",
      "comment": "Job responds to Zophar's previous argument. The dialogue format continues, highlighting Job's desire to be heard and understood."
    },
    {
      "pk": 2102102,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 2,
      "text": "\"Listen carefully to my words, and let this be the comfort you give me.",
      "links": "<a href='/AIV/18/16/2'>Job 16:2</a>",
      "comment": "Job urges his friends to comfort him by listening, suggesting that true consolation begins with attentive presence—a principle reflected in many spiritual traditions."
    },
    {
      "pk": 2102103,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 3,
      "text": "Bear with me while I speak—and after I have spoken, you may mock.",
      "links": "<a href='/AIV/18/16/3'>Job 16:3</a>",
      "comment": "Job seeks fairness—his friends should withhold judgement until they've heard him out. This pattern of dialogue shows that true wisdom requires patient listening."
    },
    {
      "pk": 2102104,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 4,
      "text": "Is my complaint directed to man? And if so, why should I not be impatient?",
      "links": "<a href='/AIV/18/10/1'>Job 10:1</a>",
      "comment": "Job reminds them his real complaint is with God, not men. The nature of suffering and prayer aligns with the willingness to bring deep distress directly before God."
    },
    {
      "pk": 2102105,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 5,
      "text": "Look at me and be appalled, and lay your hand over your mouth.",
      "links": "<a href='/AIV/18/29/9-10'>Job 29:9–10</a>",
      "comment": "Job asks his friends to pause and witness his suffering in silence. Silence can be a sign of reverence and humility before profound sorrow (<a href='/AIV/18/2/13'>Job 2:13</a>)."
    },
    {
      "pk": 2102106,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 6,
      "text": "When I think about it, I am terrified, and trembling seizes my flesh.",
      "links": "<a href='/AIV/18/23/15'>Job 23:15</a>",
      "comment": "Job's reflection on suffering causes him deep fear. The text underscores human limitation before divine mystery—a theme fulfilled in Christ's trembling in Gethsemane (<a href='/ESV/42/22/44'>Luke 22:44</a>)."
    },
    {
      "pk": 2102107,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 7,
      "text": "Why do the wicked live, reach old age, and grow mighty in power?",
      "links": "<a href='/AIV/19/73/3-5'>Ps. 73:3–5</a>; <a href='/AIV/24/12/1-2'>Jer. 12:1–2</a>",
      "comment": "Job asks one of the Old Testament's core questions: Why do the wicked prosper? See also Psalm 73’s similar lament."
    },
    {
      "pk": 2102108,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 8,
      "text": "Their offspring are established with them, and their descendants before their eyes.",
      "links": "<a href='/AIV/18/5/25'>Job 5:25</a>",
      "comment": "Contrary to his friends’ views, Job observes that even the families of the wicked flourish in this life. This challenges a simplistic retribution theology."
    },
    {
      "pk": 2102109,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 9,
      "text": "Their houses are safe from fear, and no rod of God is upon them.",
      "links": "<a href='/AIV/18/15/21'>Job 15:21</a>",
      "comment": "Often, judgment is not immediately visible. Job acknowledges that divine patience allows even the wicked to enjoy earthly security for a time."
    },
    {
      "pk": 2102110,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 10,
      "text": "Their bull breeds without fail; their cow calves and does not miscarry.",
      "links": "<a href='/AIV/18/39/1-4'>Job 39:1–4</a>",
      "comment": "The prosperity of the wicked seems all-encompassing, even in their livestock. The text contrasts this with the blessings promised to the righteous elsewhere."
    },
    {
      "pk": 2102111,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 11,
      "text": "They send out their little ones like a flock, and their children skip about.",
      "links": "<a href='/AIV/19/17/14'>Ps. 17:14</a>",
      "comment": "Job notices the carefree joy of the children of the wicked. Temporal happiness does not always reflect one’s spiritual standing before God."
    },
    {
      "pk": 2102112,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 12,
      "text": "They sing to the tambourine and lyre and rejoice to the sound of the pipe.",
      "links": "<a href='/AIV/19/150/3-5'>Ps. 150:3–5</a>",
      "comment": "Music and joy are characteristic of their lives, showing that worldly happiness can exist apart from visible faith. True joy, however, comes only through union with God."
    },
    {
      "pk": 2102113,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 13,
      "text": "They spend their days in prosperity and go down to the grave in peace.",
      "links": "<a href='/AIV/18/3/13'>Job 3:13</a>",
      "comment": "Job notes that the wicked often die without apparent suffering. The idea hints at a hidden reality beyond earthly appearances—final justice at the end."
    },
    {
      "pk": 2102114,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 14,
      "text": "They say to God, ‘Depart from us! We do not desire to know your ways.’",
      "links": "<a href='/AIV/18/22/17'>Job 22:17</a>",
      "comment": "The wicked consciously reject God’s guidance. Human freedom is affirmed here, as well as the reality of those who turn away from the Creator."
    },
    {
      "pk": 2102115,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 15,
      "text": "Who is the Almighty, that we should serve him? And what profit do we gain by praying to him?",
      "links": "<a href='/AIV/2/5/2'>Exod. 5:2</a>; <a href='/AIV/18/34/9'>Job 34:9</a>",
      "comment": "Their words echo Pharaoh in Exodus. Such arrogance shows the seriousness of rejecting God, a theme answered by Christ’s humble obedience (Philippians 2:6–8)."
    },
    {
      "pk": 2102116,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 16,
      "text": "Behold, is not their prosperity in their own hands? The counsel of the wicked is far from me.",
      "links": "<a href='/AIV/18/22/18'>Job 22:18</a>",
      "comment": "Job distances himself from wickedness, even as he acknowledges their apparent freedom. The verse questions whether worldly prosperity is self-made or permitted by God’s providence."
    },
    {
      "pk": 2102117,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 17,
      "text": "How often is the lamp of the wicked put out, or does disaster come upon them, or does God distribute pain in his anger?",
      "links": "<a href='/AIV/18/18/5-6'>Job 18:5–6</a>; <a href='/AIV/19/37/9-10'>Ps. 37:9–10</a>",
      "comment": "Job questions his friends’ claims of immediate judgment. Often in Scripture, justice is delayed, which prepares the way for hope in final vindication."
    },
    {
      "pk": 2102118,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 18,
      "text": "Are they as straw before the wind, or as chaff that the storm carries away?",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/40/3/12'>Matt. 3:12</a>",
      "comment": "This imagery is answered by later wisdom literature and by Christ, who describes final judgment where the wicked are ultimately separated like chaff."
    },
    {
      "pk": 2102119,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 19,
      "text": "You say, ‘God stores up their punishment for their children.’ Let him repay them, that they may know it.",
      "links": "<a href='/AIV/2/20/5'>Exod. 20:5</a>",
      "comment": "Job critiques the idea that children suffer for their father’s sins (see Ezek. 18:20). True justice requires the individual to face the consequences of their deeds."
    },
    {
      "pk": 2102120,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 20,
      "text": "Let their own eyes see their destruction, and let them drink of the wrath of the Almighty.",
      "links": "<a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>",
      "comment": "The image of drinking the cup of wrath occurs throughout the Bible, and is ultimately fulfilled in the New Testament with Christ accepting the cup in our place (<a href='/ESV/42/22/42'>Luke 22:42</a>)."
    },
    {
      "pk": 2102121,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 21,
      "text": "For what do they care for their household after them, when the number of their months is cut off?",
      "links": "<a href='/AIV/19/39/4'>Ps. 39:4</a>",
      "comment": "Life’s brevity is a central theme; Job asks why the wicked would care once dead. The fleetingness of life points to the hope of something eternal."
    },
    {
      "pk": 2102122,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 22,
      "text": "Will anyone teach God knowledge, since he judges those who are on high?",
      "links": "<a href='/AIV/23/40/13-14'>Isa. 40:13–14</a>; <a href='/AIV/45/11/34'>Rom. 11:34</a>",
      "comment": "This verse declares God's wisdom and authority over all. Only God can judge justly, a reminder for humility in the face of divine mystery."
    },
    {
      "pk": 2102123,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 23,
      "text": "One man dies in full vigor, wholly at ease and prosperous,",
      "links": "<a href='/AIV/18/3/13-15'>Job 3:13–15</a>",
      "comment": "Job notes the contrast in human experiences at death—some die with peace and prosperity, regardless of their righteousness."
    },
    {
      "pk": 2102124,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 24,
      "text": "his body full of fat and the marrow of his bones moist,",
      "links": "<a href='/AIV/18/20/11'>Job 20:11</a>",
      "comment": "“Fat” and “moist marrow” symbolize vitality and blessing. Earthly prosperity is not always a sign of God’s favor."
    },
    {
      "pk": 2102125,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 25,
      "text": "while another man dies in bitterness of soul and never tastes of prosperity.",
      "links": "<a href='/AIV/18/3/20'>Job 3:20</a>",
      "comment": "Not all suffering is evidence of guilt, supporting Job’s central argument. The variety of life’s ends points to God’s inscrutable wisdom."
    },
    {
      "pk": 2102126,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 26,
      "text": "They lie down alike in the dust, and worms cover them.",
      "links": "<a href='/AIV/18/17/13-16'>Job 17:13–16</a>",
      "comment": "Common destiny in death—rich and poor, righteous and wicked—foreshadows later biblical reflection on the resurrection and ultimate justice."
    },
    {
      "pk": 2102127,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 27,
      "text": "\"Behold, I know your thoughts and the schemes you would wrong me with.",
      "links": "",
      "comment": "Job sees through his friends' reasoning. True friendship and consolation are found in compassion, not simply theological explanation."
    },
    {
      "pk": 2102128,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 28,
      "text": "For you say, ‘Where is the house of the noble? Where is the tent, the dwelling of the wicked?’",
      "links": "<a href='/AIV/18/8/22'>Job 8:22</a>",
      "comment": "Job’s friends argue that the wicked’s houses are destroyed, but Job challenges this, noting many appear to prosper. This prepares for later revelation about God’s ultimate justice."
    },
    {
      "pk": 2102129,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 29,
      "text": "Have you not asked those who travel the roads, and do you not accept their testimony?",
      "links": "",
      "comment": "Job appeals to travelers and experience for perspective. It suggests that God’s ways may not always be grasped through immediate observation."
    },
    {
      "pk": 2102130,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 30,
      "text": "That the evil man is spared in the day of calamity, that he is rescued in the day of wrath?",
      "links": "<a href='/AIV/18/24/1'>Job 24:1</a>",
      "comment": "The prosperity of the wicked is observed worldwide, challenging an easy belief in retribution. Later Scripture clarifies final judgment is reserved for the Day of the Lord."
    },
    {
      "pk": 2102131,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 31,
      "text": "Who will confront him to his face, or repay him for what he has done?",
      "links": "<a href='/AIV/18/34/33'>Job 34:33</a>",
      "comment": "Justice is not always immediate or visible. True recompense lies with God alone."
    },
    {
      "pk": 2102132,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 32,
      "text": "He is carried to the grave, and watch is kept over his tomb.",
      "links": "<a href='/AIV/19/49/16-17'>Ps. 49:16–17</a>",
      "comment": "Earthly honors in burial do not reflect ultimate standing before God. This alludes to the ongoing tension between appearance and reality."
    },
    {
      "pk": 2102133,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 33,
      "text": "The clods of the valley are sweet to him; all mankind will follow after him, and countless have gone before him.",
      "links": "",
      "comment": "Death unites all people in one fate. This foreshadows biblical teaching on resurrection and eternal life, realized in Christ’s victory over death (<a href='/AIV/46/15/54-57'>1 Cor. 15:54–57</a>)."
    },
    {
      "pk": 2102134,
      "translation": "AIV",
      "book": 18,
      "chapter": 21,
      "verse": 34,
      "text": "How then will you comfort me with empty words? There is nothing left of your answers but falsehood.\"",
      "links": "<a href='/AIV/18/13/4'>Job 13:4</a>",
      "comment": "Job sums up his friends’ arguments as vain. Authentic comfort comes not from formulaic answers, but from trust in God’s mysterious providence—fully revealed in the redemptive suffering of Christ."
    }
  ],
  "translatedAt": "2025-12-23T05:24:01.018Z"
}