{
  "book": 22,
  "bookName": "Job",
  "bookAbbreviation": "Job",
  "chapter": 2,
  "verses": [
    {
      "pk": 22002001,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 1,
      "text": "Again, there was a day when the sons of God came to present themselves before the LORD, and Satan also came among them to present himself before the LORD.",
      "links": "<a href='/AIV/22/1/6'>Job 1:6</a>; <a href='/AIV/19/82/1'>Ps. 82:1</a>",
      "comment": "The phrase 'sons of God' likely refers to angelic beings. This scene is parallel to Job 1:6 and emphasizes a heavenly council. The LORD's sovereignty is established over all creation, including adversarial spirits."
    },
    {
      "pk": 22002002,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 2,
      "text": "And the LORD said to Satan, 'Where have you come from?' Then Satan answered the LORD and said, 'From wandering throughout the earth, and walking up and down in it.'",
      "links": "<a href='/AIV/22/1/7'>Job 1:7</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "This dialogue mirrors Job 1:7. Satan roams the earth, echoing later descriptions of his seeking whom to devour (cf. 1 Pet. 5:8), underscoring the reality of spiritual warfare."
    },
    {
      "pk": 22002003,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 3,
      "text": "And the LORD said to Satan, 'Have you considered my servant Job? For there is no one like him on the earth, a man perfect and upright, who fears God and turns away from evil. He still holds fast his integrity, even though you incited me against him to destroy him without reason.'",
      "links": "<a href='/AIV/22/1/8'>Job 1:8</a>; <a href='/AIV/22/1/12'>Job 1:12</a>",
      "comment": "God repeats Job's exceptional character, noting his faithfulness despite suffering. 'Perfect and upright' can be understood as spiritual wholeness, hinting at the importance of perseverance under trial."
    },
    {
      "pk": 22002004,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 4,
      "text": "Satan answered the LORD and said, 'Skin for skin! All that a man has he will give for his life.'",
      "links": "<a href='/AIV/22/1/11'>Job 1:11</a>",
      "comment": "The phrase 'skin for skin' is enigmatic; it suggests people will give up anything to save themselves. This challenges true altruism and self-sacrifice, setting up a test of Job's integrity."
    },
    {
      "pk": 22002005,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 5,
      "text": "But stretch out your hand now, and touch his bone and his flesh, and he will surely curse you to your face.'",
      "links": "<a href='/AIV/22/1/11'>Job 1:11</a>",
      "comment": "Satan proposes a deeper trial, seeking permission to afflict Job physically. This reveals the problem of suffering in the life of the righteous and anticipates themes of redemptive suffering found later in Scripture."
    },
    {
      "pk": 22002006,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 6,
      "text": "And the LORD said to Satan, 'Behold, he is in your hand, only spare his life.'",
      "links": "<a href='/AIV/19/34/19-20'>Ps. 34:19-20</a>; <a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "God grants Satan limited authority, showing divine sovereignty even over suffering. There are boundaries set; God does not allow Job’s life to be taken, reflecting His providence and mercy."
    },
    {
      "pk": 22002007,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 7,
      "text": "So Satan went out from the presence of the LORD and struck Job with painful sores, from the sole of his foot to the crown of his head.",
      "links": "<a href='/AIV/22/7/5'>Job 7:5</a>; <a href='/AIV/19/38/3-7'>Ps. 38:3-7</a>",
      "comment": "Job is afflicted with intense physical suffering, which often symbolizes extreme tribulation. His whole body is affected, paralleling descriptions of suffering in Psalms and anticipating the suffering of the righteous servant (cf. Isa. 53)."
    },
    {
      "pk": 22002008,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 8,
      "text": "And he took a broken piece of pottery with which to scrape himself as he sat among the ashes.",
      "links": "<a href='/AIV/22/42/6'>Job 42:6</a>; <a href='/AIV/23/61/3'>Isa. 61:3</a>",
      "comment": "Sitting in ashes is a traditional sign of mourning and humility, seen elsewhere in Scripture as a gesture of penitence and supplication before God."
    },
    {
      "pk": 22002009,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 9,
      "text": "Then his wife said to him, 'Are you still holding fast to your integrity? Curse God and die!'",
      "links": "<a href='/AIV/22/27/5'>Job 27:5'>Job 27:5</a>; <a href='/AIV/40/19/6'>Matt. 19:6</a>",
      "comment": "Job's wife tempts him to abandon his faith and virtue. Her words contrast with Job’s determined righteousness, inviting reflection on perseverance and marital fidelity under trial (cf. Matt. 19:6)."
    },
    {
      "pk": 22002010,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 10,
      "text": "But he said to her, 'You speak as one of the foolish women would speak. Shall we accept good from God, and not also accept hardship?' In all this, Job did not sin with his lips.",
      "links": "<a href='/AIV/22/1/22'>Job 1:22</a>; <a href='/AIV/45/8/17-18'>Rom. 8:17-18</a>",
      "comment": "Job asserts that both blessings and suffering come from God and must be accepted with trust. This foreshadows later New Testament teachings on sharing in Christ’s sufferings (cf. Rom. 8:17-18), highlighting obedience and surrender to God’s will."
    },
    {
      "pk": 22002011,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 11,
      "text": "Now when Job's three friends heard of all this evil that had come upon him, each came from his own place—Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite. They agreed to come to show him sympathy and comfort him.",
      "links": "<a href='/AIV/22/42/7'>Job 42:7</a>; <a href='/AIV/45/12/15'>Rom. 12:15</a>",
      "comment": "Job’s friends respond to his suffering by coming together, a model of communal compassion found in later teachings (cf. Rom. 12:15). Their later dialogues reveal the limits of human wisdom, inviting trust in God’s fuller revelation."
    },
    {
      "pk": 22002012,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 12,
      "text": "When they saw him from a distance, they did not recognize him; and they raised their voices and wept. Each tore his robe and threw dust in the air over their heads.",
      "links": "<a href='/AIV/22/1/20'>Job 1:20</a>; <a href='/AIV/24/25/34'>Jer. 25:34</a>",
      "comment": "The mourning rites—tearing robes and casting dust—demonstrate grief and solidarity. This external sign of sorrow reflects the depth of Job’s suffering and the community's response to tragedy."
    },
    {
      "pk": 22002013,
      "translation": "AIV",
      "book": 22,
      "bookName": "Job",
      "bookAbbreviation": "Job",
      "chapter": 2,
      "verse": 13,
      "text": "So they sat with him on the ground seven days and seven nights, and no one spoke a word to him, for they saw that his suffering was very great.",
      "links": "<a href='/AIV/22/10/2'>Job 10:2</a>; <a href='/AIV/19/39/2'>Ps. 39:2</a>",
      "comment": "The friends’ silence was an act of respect, acknowledging suffering beyond words. The number seven implies fullness or completeness, linking to sacred traditions and practices of communal prayer and waiting (cf. Ps. 39:2)."
    }
  ],
  "translatedAt": "2025-12-24T05:40:11.846Z"
}