{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 39,
  "verses": [
    {
      "pk": 1839001,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 1,
      "text": "Do you know when the wild mountain goats give birth? Do you observe the birth pangs of the doe?",
      "links": "<a href='/ESV/19/104/18'>Ps. 104:18</a>; <a href='/AIV/18/38/41'>Job 38:41</a>",
      "comment": "God continues questioning Job about the mysteries of creation, highlighting the hiddenness of God's providence, not only in grand things but also in the details of nature. This echoes the idea that God's wisdom surpasses human understanding and subtly points to divine oversight, reminiscent of <a href='/AIV/19/147/9'>Ps. 147:9</a>."
    },
    {
      "pk": 1839002,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 2,
      "text": "Can you count the months that they fulfill? Or do you know the time when they bear young?",
      "links": "<a href='/AIV/18/39/1'>Job 39:1</a>",
      "comment": "This continues the theme of God's secret knowledge of life processes. The verse calls to mind God's foreknowledge and sustaining care, inviting a trust in the unseen workings of God's plan."
    },
    {
      "pk": 1839003,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 3,
      "text": "They crouch, bring forth their young, and deliver their offspring.",
      "links": "<a href='/AIV/18/39/1'>Job 39:1</a>; <a href='/AIV/19/29/9'>Ps. 29:9</a>",
      "comment": "God's intimate knowledge of animal birth underlines the idea of natural law and order, hinting at creation's obedience to divine decree. This sets a foundation for later reflection on the sanctity of life and order."
    },
    {
      "pk": 1839004,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 4,
      "text": "Their young grow strong, they thrive in the open; they go out and do not return to them.",
      "links": "<a href='/AIV/19/104/21'>Ps. 104:21</a>",
      "comment": "The independence of young creatures is part of God's design. Spiritually, this can be seen as a parallel to the faithful being sent out into the world, sustained by God's providence (cf. <a href='/AIV/42/10/3'>Luke 10:3</a>)."
    },
    {
      "pk": 1839005,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 5,
      "text": "Who has set the wild donkey free? Who has loosed the bonds of the swift donkey,",
      "links": "<a href='/AIV/18/6/5'>Job 6:5</a>; <a href='/AIV/19/104/11'>Ps. 104:11</a>",
      "comment": "The wild donkey, symbolizing freedom, cannot be tamed by man. God's prerogatives in creation invite reflection on the limits of human authority and echo spiritual liberty under God's greater authority."
    },
    {
      "pk": 1839006,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 6,
      "text": "to whom I have given the wilderness as his home, and the salt land as his dwelling place?",
      "links": "<a href='/AIV/19/107/34'>Ps. 107:34</a>",
      "comment": "God provides each creature their proper place. This affirms divine order and hints at a theology that sees God's hand in all locations and vocations, even those that seem desolate."
    },
    {
      "pk": 1839007,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 7,
      "text": "He laughs at the commotion of the city; he does not hear the shouts of the driver.",
      "links": "<a href='/AIV/18/39/5'>Job 39:5</a>",
      "comment": "The wild donkey’s independence from civilization highlights God's design for different roles and places in creation, suggesting a spiritual freedom unbound by worldly constraints."
    },
    {
      "pk": 1839008,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 8,
      "text": "He searches the mountains for his pasture, and every green thing he seeks.",
      "links": "<a href='/AIV/19/104/14'>Ps. 104:14</a>",
      "comment": "Even wild animals depend daily on God for sustenance, paralleling Jesus' teaching about God’s care for all living things (<a href='/AIV/40/6/26'>Matt. 6:26</a>)."
    },
    {
      "pk": 1839009,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 9,
      "text": "Will the wild ox consent to serve you? Will he spend the night at your manger?",
      "links": "<a href='/AIV/18/39/12'>Job 39:12</a>; <a href='/AIV/19/22/21'>Ps. 22:21</a>",
      "comment": "God’s rhetorical question about the wild ox suggests man's limitations in taming creation; a subtle echo of God's sovereign authority. The word 'manger' here can also subtly connect to nativity imagery, a pointer toward Christ's humility."
    },
    {
      "pk": 1839010,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 10,
      "text": "Can you bind him in the furrow with ropes, or will he harrow the valleys after you?",
      "links": "<a href='/AIV/18/39/9'>Job 39:9</a>",
      "comment": "This verse underlines human inability to command certain powers of creation, pointing out that stewardship is different from sovereignty — a theme seen in Genesis (<a href='/AIV/1/1/28'>Gen. 1:28</a>)."
    },
    {
      "pk": 1839011,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 11,
      "text": "Will you trust him because his strength is great, and will you leave your work to him?",
      "links": "<a href='/AIV/18/39/9'>Job 39:9</a>",
      "comment": "Man is not able to delegate labor to the untamed wild. The wild ox stands as a symbol for uncontrolled powers — a motif for the need of grace above human strength."
    },
    {
      "pk": 1839012,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 12,
      "text": "Will you rely on him to bring in your grain and gather it to your threshing floor?",
      "links": "<a href='/AIV/18/39/11'>Job 39:11</a>; <a href='/AIV/19/65/9'>Ps. 65:9</a>",
      "comment": "Harvest imagery always carries spiritual weight; it evokes themes of divine provision, and the ultimate harvest by God alluded to in <a href='/AIV/40/13/39'>Matthew 13:39</a>."
    },
    {
      "pk": 1839013,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 13,
      "text": "The wings of the ostrich flap joyfully— but are her feathers and plumage like those of the stork?",
      "links": "<a href='/AIV/18/39/18'>Job 39:18</a>; <a href='/AIV/19/104/17'>Ps. 104:17</a>",
      "comment": "God creates variety in the animal kingdom, each with its own set of strengths and weaknesses. Joy in creation reflects the Creator's glory."
    },
    {
      "pk": 1839014,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 14,
      "text": "She leaves her eggs on the ground, and lets them warm in the dust,",
      "links": "<a href='/AIV/18/39/16'>Job 39:16</a>",
      "comment": "The ostrich is depicted as careless compared to other birds, yet her young often survive, showing the mysterious ways of providence outside human calculation."
    },
    {
      "pk": 1839015,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 15,
      "text": "forgetting that a foot may crush them, or a wild animal may trample them.",
      "links": "<a href='/AIV/18/39/14'>Job 39:14</a>",
      "comment": "This is an example of apparent folly in nature that yet is not wholly destructive, reflecting that God's care is beyond our understanding."
    },
    {
      "pk": 1839016,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 16,
      "text": "She deals harshly with her young, as if they were not hers; though her labor is in vain, she is unconcerned,",
      "links": "<a href='/AIV/18/39/13'>Job 39:13</a>",
      "comment": "The indifference of the ostrich raises questions about parental care, contrasting with God's own patience and intervention (cf. <a href='/AIV/19/103/13'>Ps. 103:13</a>)."
    },
    {
      "pk": 1839017,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 17,
      "text": "for God has denied her wisdom and has not given her understanding.",
      "links": "<a href='/AIV/18/39/14'>Job 39:14</a>",
      "comment": "God's sovereignty is emphasized—wisdom is from God alone. This supports a theology that upholds grace as the origin of wisdom and understanding."
    },
    {
      "pk": 1839018,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 18,
      "text": "Yet when she runs, she laughs at horse and rider.",
      "links": "<a href='/AIV/18/39/13'>Job 39:13</a>; <a href='/AIV/19/147/10'>Ps. 147:10</a>",
      "comment": "Despite her lack of wisdom, the ostrich excels in speed—a lesson that God distributes His gifts in varying measure. This supports the idea of the body of Christ being composed of many members with diverse gifts (<a href='/AIV/46/12/14'>1 Cor. 12:14</a>)."
    },
    {
      "pk": 1839019,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 19,
      "text": "Do you give the horse his strength? Do you clothe his neck with a mane?",
      "links": "<a href='/AIV/19/147/10'>Ps. 147:10</a>",
      "comment": "The strength and majesty of the horse are attributed directly to the Creator, illustrating God's authority over power and beauty."
    },
    {
      "pk": 1839020,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 20,
      "text": "Do you make him leap like a locust? His majestic snorting is terrifying.",
      "links": "<a href='/AIV/18/39/19'>Job 39:19</a>",
      "comment": "The horse’s power is awe-inspiring, evoking God’s justice and might—traits often typologically connected with Christ as conqueror in Revelation (<a href='/AIV/66/19/11'>Rev. 19:11</a>)."
    },
    {
      "pk": 1839021,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 21,
      "text": "He paws fiercely in the valley, and rejoices in his strength; he charges into the battle.",
      "links": "<a href='/AIV/19/147/10'>Ps. 147:10</a>",
      "comment": "The warhorse’s fearlessness hints at both human and spiritual battles. Its courage reflects virtues prized in spiritual warfare (cf. <a href='/AIV/49/6/11'>Eph. 6:11</a>)."
    },
    {
      "pk": 1839022,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 22,
      "text": "He laughs at fear and is not frightened; he does not turn back from the sword.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "This fearlessness points to trust and fortitude against evil, paralleling the spiritual steadfastness encouraged throughout Scripture."
    },
    {
      "pk": 1839023,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 23,
      "text": "The quiver rattles against him, the flashing spear and javelin.",
      "links": "<a href='/AIV/19/18/34'>Ps. 18:34</a>",
      "comment": "Battle imagery recalls deeper spiritual struggles, anticipating motifs of the Church as both suffering and militant in the journey toward the Kingdom."
    },
    {
      "pk": 1839024,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 24,
      "text": "With fierce excitement he devours the ground; he cannot stand still when the trumpet sounds.",
      "links": "<a href='/AIV/18/39/20'>Job 39:20</a>",
      "comment": "The horse’s eagerness for battle evokes zeal, an important spiritual virtue. The trumpet may symbolically hint toward eschatological themes (cf. <a href='/AIV/46/15/52'>1 Cor. 15:52</a>)."
    },
    {
      "pk": 1839025,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 25,
      "text": "As the trumpet sounds, he says, 'Aha!' He smells the battle from afar, the thunder of captains and the shouting.",
      "links": "<a href='/AIV/18/39/24'>Job 39:24</a>",
      "comment": "There is delight in service, even amidst conflict, suggestive of the notion that suffering can be united to a greater spiritual purpose, as exemplified by Christ."
    },
    {
      "pk": 1839026,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 26,
      "text": "Is it by your wisdom that the hawk soars, and spreads his wings toward the south?",
      "links": "<a href='/AIV/19/84/3'>Ps. 84:3</a>",
      "comment": "Migration patterns point to divine guidance and providence. This can be interpreted spiritually as guidance of the soul by divine wisdom."
    },
    {
      "pk": 1839027,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 27,
      "text": "Does the eagle rise at your command, and build his nest on high?",
      "links": "<a href='/AIV/19/103/5'>Ps. 103:5</a>; <a href='/AIV/23/40/31'>Isa. 40:31</a>",
      "comment": "The eagle is often symbolically linked with spiritual ascent and renewal, such as in <a href='/AIV/23/40/31'>Isaiah 40:31</a>, prefiguring resurrection themes."
    },
    {
      "pk": 1839028,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 28,
      "text": "He dwells on the rock and makes his home on the crag and stronghold.",
      "links": "<a href='/AIV/19/104/18'>Ps. 104:18</a>",
      "comment": "The eagle’s dwelling upon the rock presents a subtle typological hint to spiritual security in Christ, identified as the rock in <a href='/AIV/40/16/18'>Matthew 16:18</a>."
    },
    {
      "pk": 1839029,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 29,
      "text": "From there he spies out his prey; his eyes behold it from afar.",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>",
      "comment": "The eagle's vision may allude to spiritual insight, reminiscent of Saint Paul's prayers for increasing the eyes of the heart (<a href='/AIV/49/1/18'>Eph. 1:18</a>)."
    },
    {
      "pk": 1839030,
      "translation": "AIV",
      "book": 18,
      "chapter": 39,
      "verse": 30,
      "text": "His young ones feast on blood; where the slain are, there he is.",
      "links": "<a href='/AIV/40/24/28'>Matt. 24:28</a>",
      "comment": "This verse’s ending parallels Christ’s own words in <a href='/AIV/40/24/28'>Matthew 24:28</a> regarding judgment and the gathering of the faithful, suggesting a typological link between Old and New Testament eschatology. The feeding imagery also prefigures deeper eucharistic themes found in Christian tradition."
    }
  ],
  "translatedAt": "2025-12-23T05:32:37.992Z"
}