{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 6,
  "verses": [
    {
      "pk": 5010601,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 1,
      "text": "Then Job answered and said:",
      "links": "",
      "comment": "This verse opens Job’s response to Eliphaz’s earlier speech, marking a pivotal point in the dialogue cycle. Compare with Job 4:1."
    },
    {
      "pk": 5010602,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 2,
      "text": "Oh, that my grief were truly weighed, and all my misery laid together in the balances!",
      "links": "<a href='/AIV/19/38/4'>Ps. 38:4</a>",
      "comment": "Job desires that his suffering be measured accurately—an appeal for understanding. The balance imagery recalls divine justice."
    },
    {
      "pk": 5010603,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 3,
      "text": "For it would be heavier than the sand of the sea; that is why my words are so rash.",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>",
      "comment": "Job describes overwhelming suffering, which justifies his strong speech. The language echoes psalms of lament."
    },
    {
      "pk": 5010604,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 4,
      "text": "For the arrows of the Almighty are within me, their poison drinks up my spirit; God’s terrors line up against me.",
      "links": "<a href='/AIV/19/38/2'>Ps. 38:2</a>; <a href='/AIV/18/16/13'>Job 16:13</a>",
      "comment": "Job attributes his torment directly to God, stressing divine sovereignty over suffering (see Psalm 38:2 for similar imagery)."
    },
    {
      "pk": 5010605,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 5,
      "text": "Does the wild donkey bray when it has grass, or does the ox low over its fodder?",
      "links": "<a href='/AIV/18/11/12'>Job 11:12</a>",
      "comment": "Nature illustration: creatures cry only when lacking sustenance. Job compares his own complaint to legitimate suffering."
    },
    {
      "pk": 5010606,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 6,
      "text": "Can flavorless food be eaten without salt, or is there any taste in the juice of mallow?",
      "links": "",
      "comment": "Job uses a metaphor for the blandness of his life’s joys—nothing pleasant remains."
    },
    {
      "pk": 5010607,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 7,
      "text": "My appetite refuses to touch them; they are repulsive to me, like sickening food.",
      "links": "",
      "comment": "He finds even basic sustenance revolting, underscoring deep emotional and physical distress."
    },
    {
      "pk": 5010608,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 8,
      "text": "Oh, that my request might be granted, and that God would fulfill my hope!",
      "links": "",
      "comment": "Job expresses a longing for relief, yet ironically points to God as the only one who can grant it."
    },
    {
      "pk": 5010609,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 9,
      "text": "That God would be willing to crush me, that He would let loose His hand and cut me off!",
      "links": "<a href='/AIV/18/3/21'>Job 3:21</a>",
      "comment": "Job asks for death as a form of mercy—a theme of despair recurring throughout the book."
    },
    {
      "pk": 5010610,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 10,
      "text": "This would still be my comfort—though in pain I would leap for joy, if I did not deny the words of the Holy One.",
      "links": "<a href='/AIV/22/7/7'>Mic. 7:7</a>",
      "comment": "His faithfulness, even amidst suffering, is cause for hope. Note the perseverance amidst trial reminiscent of later faith heroes."
    },
    {
      "pk": 5010611,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 11,
      "text": "What strength do I have, that I should keep hoping? What is my future, that I should be patient?",
      "links": "<a href='/AIV/19/39/4'>Ps. 39:4</a>",
      "comment": "Job’s rhetorical question shows human frailty—anticipating themes of radical dependence on God."
    },
    {
      "pk": 5010612,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 12,
      "text": "Is my strength the strength of stones, or is my flesh made of bronze?",
      "links": "",
      "comment": "Job contrasts human weakness with unyielding materials—a reminder we are not self-sufficient."
    },
    {
      "pk": 5010613,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 13,
      "text": "Is it not that I have no help within me, and wisdom is driven from me?",
      "links": "",
      "comment": "Job recognizes his limits—a precursor to later New Testament themes of grace and reliance (e.g., 2 Corinthians 12:9)."
    },
    {
      "pk": 5010614,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 14,
      "text": "To him who withholds kindness from a friend, he forsakes the fear of the Almighty.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/20/17/17'>Prov. 17:17</a>",
      "comment": "Here, Job highlights the moral obligation to show mercy—a principle deeply embedded in Scripture’s teaching on charity and brotherhood."
    },
    {
      "pk": 5010615,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 15,
      "text": "My brothers have acted deceitfully, like a seasonal river, like streams that disappear.",
      "links": "<a href='/AIV/19/55/13'>Ps. 55:13</a>",
      "comment": "Using nature imagery, Job laments unreliable friends—compare with biblical calls for steadfast fellowship."
    },
    {
      "pk": 5010616,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 16,
      "text": "When they flow dark with ice and snow covers them,",
      "links": "",
      "comment": "His friends appear promising in good times, symbolized by water supply during winter—a metaphor for false hope."
    },
    {
      "pk": 5010617,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 17,
      "text": "But when the heat comes, they vanish; when it is hot, they disappear from their place.",
      "links": "",
      "comment": "Seasons change—worldly security is fleeting. This anticipates Jesus’ teaching on building life on solid foundations (cf. Matthew 7:24-27)."
    },
    {
      "pk": 5010618,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 18,
      "text": "The caravans turn aside from their path; they go up into the wasteland and perish.",
      "links": "",
      "comment": "Imagery of travelers wandering in disappointment reinforces how unreliable counsel leads astray."
    },
    {
      "pk": 5010619,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 19,
      "text": "The caravans of Tema look for them, the travelers of Sheba hope for them.",
      "links": "<a href='/AIV/01/25/15'>Gen. 25:15</a>",
      "comment": "References to Tema and Sheba place the account in the historical context of Arabian trade routes."
    },
    {
      "pk": 5010620,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 20,
      "text": "They are disappointed because they were confident; when they arrive, they are let down.",
      "links": "",
      "comment": "Worldly hope fails—Job’s lament subtly points toward the necessity of hope founded on God."
    },
    {
      "pk": 5010621,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 21,
      "text": "So you have become nothing to me; you see my calamity and are afraid.",
      "links": "",
      "comment": "Job accuses his friends of abandoning him in crisis, foreshadowing Christ’s experience of betrayal (cf. Matthew 26:56)."
    },
    {
      "pk": 5010622,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 22,
      "text": "Did I ever demand, ‘Give to me,’ or, ‘Pay a ransom for me from your wealth’?",
      "links": "",
      "comment": "He clarifies he made no unreasonable demands, affirming personal integrity."
    },
    {
      "pk": 5010623,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 23,
      "text": "Or, ‘Deliver me from the adversary’s hand,’ or, ‘Redeem me from the hand of the ruthless’?",
      "links": "<a href='/AIV/18/19/25'>Job 19:25</a>",
      "comment": "The language of ransom and redemption points ahead to New Testament themes (cf. Job 19:25, anticipating Christ the Redeemer)."
    },
    {
      "pk": 5010624,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 24,
      "text": "Teach me, and I will be silent; make me understand how I have erred.",
      "links": "<a href='/AIV/19/119/33'>Ps. 119:33</a>",
      "comment": "Job humbly requests correction rooted in goodness—a principle of spiritual transformation found throughout the Bible."
    },
    {
      "pk": 5010625,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 25,
      "text": "How forceful are honest words! But what does your arguing prove?",
      "links": "",
      "comment": "Truth, not accusation, leads to conversion—echoes New Testament stress on speaking the truth in love (Ephesians 4:15)."
    },
    {
      "pk": 5010626,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 26,
      "text": "Do you intend to rebuke my words, when the speech of a desperate man is just wind?",
      "links": "",
      "comment": "Displays the importance of understanding context and emotion in correction—a biblical principle in pastoral care."
    },
    {
      "pk": 5010627,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 27,
      "text": "You would even cast lots for orphans and bargain over your friend.",
      "links": "<a href='/AIV/19/22/18'>Ps. 22:18</a>",
      "comment": "Job highlights social injustice, reflecting themes of God’s concern for the vulnerable (see Psalm 22:18 and James 1:27)."
    },
    {
      "pk": 5010628,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 28,
      "text": "Now be so kind as to look at me, for I would not lie to your face.",
      "links": "",
      "comment": "This plea for honest engagement reinforces relational integrity as a virtue in biblical community."
    },
    {
      "pk": 5010629,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 29,
      "text": "Turn back, let there be no injustice; yes, turn back—my righteousness is at stake.",
      "links": "",
      "comment": "Job’s appeal emphasizes the priority of justice and the defense of personal righteousness—a major biblical concern."
    },
    {
      "pk": 5010630,
      "translation": "AIV",
      "book": 18,
      "chapter": 6,
      "verse": 30,
      "text": "Is there wickedness on my tongue? Cannot my palate discern disaster?",
      "links": "<a href='/AIV/18/27/4'>Job 27:4</a>",
      "comment": "Job closes his speech affirming his innocence—a foreshadowing of Christ, who suffered though innocent. This forms part of the biblical pattern where God ultimately vindicates His righteous servants. The plea to discern truth parallels New Testament calls to spiritual discernment (cf. 1 John 4:1)."
    }
  ],
  "translatedAt": "2025-12-23T05:17:35.293Z"
}