{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 1,
  "verses": [
    {
      "pk": 18001001,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 1,
      "text": "There was a man in the land of Uz whose name was Job; that man was blameless and upright, fearing God and turning away from evil.",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>; <a href='/AIV/20/3/7'>Prov. 3:7</a>",
      "comment": "The description of Job highlights both his moral integrity and his reverence for God. The term 'blameless and upright' echoes OT descriptions of God’s faithful servants, anticipating the call to a life of holiness seen in the NT (cf. Matthew 5:48)."
    },
    {
      "pk": 18001002,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 2,
      "text": "Seven sons and three daughters were born to him.",
      "links": "<a href='/AIV/18/42/13'>Job 42:13</a>",
      "comment": "Job’s ten children are mentioned, indicating fullness and blessing; the theme is revisited at the book’s conclusion, signifying restoration."
    },
    {
      "pk": 18001003,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 3,
      "text": "His possessions included seven thousand sheep, three thousand camels, five hundred pairs of oxen, and five hundred female donkeys, as well as a very large household. He was the greatest of all the people of the East.",
      "links": "<a href='/AIV/18/29/9-10'>Job 29:9-10</a>; <a href='/AIV/18/42/12'>Job 42:12</a>",
      "comment": "Job’s wealth sets the stage for the magnitude of his later loss. The enumeration of possessions recalls the way ancient blessings were measured in material abundance. (See Deut. 28:11)"
    },
    {
      "pk": 18001004,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 4,
      "text": "His sons would have feasts in their houses, each on his appointed day, and they would invite their three sisters to eat and drink with them.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "The family unity and celebration point to harmony among Job’s children, a sign of peace and order."
    },
    {
      "pk": 18001005,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 5,
      "text": "When the days of feasting had finished, Job would send for them and sanctify them. He would rise early in the morning and offer burnt offerings for each of them, reasoning, 'Perhaps my children have sinned and cursed God in their hearts.' Job did this continually.",
      "links": "<a href='/AIV/19/51/16-17'>Ps. 51:16-17</a>; <a href='/AIV/18/42/8'>Job 42:8</a>",
      "comment": "Job’s regular intercession for his children is a powerful image of spiritual mediation, foreshadowing the role of priestly intercession. This practice is also reminiscent of Abraham’s intercession (Gen. 18:22-33) and points to a deeper spiritual reality where worship and sacrifice are means of reconciliation, a theme fulfilled perfectly in Christ’s atoning sacrifice."
    },
    {
      "pk": 18001006,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 6,
      "text": "Now there came a day when the sons of God came to present themselves before the LORD, and Satan also came among them.",
      "links": "<a href='/AIV/19/82/1'>Ps. 82:1</a>; <a href='/AIV/01/6/2'>Gen. 6:2</a>",
      "comment": "‘Sons of God’ most likely refers to angelic beings gathered before God’s throne (cf. 1 Kings 22:19). Satan’s presence reveals the reality of spiritual opposition in the heavenly court."
    },
    {
      "pk": 18001007,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 7,
      "text": "The LORD said to Satan, 'From where have you come?' Satan answered the LORD, 'From roaming the earth and walking around on it.'",
      "links": "<a href='/AIV/20/28/15'>Prov. 28:15</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "Satan’s roaming reflects his role as adversary (cf. 1 Peter 5:8); the dialogue shows God’s sovereignty and the inability of evil to operate outside God’s allowance."
    },
    {
      "pk": 18001008,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 8,
      "text": "Then the LORD said to Satan, 'Have you considered My servant Job? There is no one like him on earth, a blameless and upright man, fearing God and turning away from evil.'",
      "links": "<a href='/AIV/18/2/3'>Job 2:3</a>; <a href='/AIV/01/6/9'>Gen. 6:9</a>",
      "comment": "God’s testimony about Job underscores the possibility of true holiness and perseverance in righteousness by grace, confirmed by God Himself (cf. Luke 1:6 regarding Zechariah and Elizabeth)."
    },
    {
      "pk": 18001009,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 9,
      "text": "Satan replied to the LORD, 'Does Job fear God for nothing?'",
      "links": "<a href='/AIV/19/73/13'>Ps. 73:13</a>",
      "comment": "Satan’s question introduces the theme of disinterested righteousness: Does faithfulness depend on earthly reward?"
    },
    {
      "pk": 18001010,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 10,
      "text": "'Have You not put a hedge around him and his house and all that he has, on every side? You have blessed the work of his hands, and his possessions have increased in the land.'",
      "links": "<a href='/AIV/19/91/10'>Ps. 91:10</a>",
      "comment": "The ‘hedge’ recalls God’s protective care over His faithful. Satan points to the visible signs of providence as the reason for Job’s faith—a concept answered later by Job’s perseverance."
    },
    {
      "pk": 18001011,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 11,
      "text": "'But stretch out Your hand and touch all that he has, and surely he will curse You to Your face.'",
      "links": "<a href='/AIV/18/2/5'>Job 2:5</a>; <a href='/AIV/18/19/21'>Job 19:21</a>",
      "comment": "Satan claims that Job’s faith is shallow, dependent on blessings. This sets up the main test of the book."
    },
    {
      "pk": 18001012,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 12,
      "text": "The LORD said to Satan, 'Behold, all that he has is in your power; only do not lay a hand on him himself.' So Satan went out from the presence of the LORD.",
      "links": "<a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "God’s permission shows that Satan’s power is limited; suffering is never random but permitted within divine boundaries, a theme which becomes clear in the NT teaching on suffering’s purpose (Romans 8:28)."
    },
    {
      "pk": 18001013,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 13,
      "text": "Now on the day when his sons and daughters were eating and drinking wine in the eldest brother’s house,",
      "links": "<a href='/AIV/18/1/4'>Job 1:4</a>",
      "comment": "The feasting links to Job’s earlier days of intercession, bringing the calamity into sharp contrast."
    },
    {
      "pk": 18001014,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 14,
      "text": "A messenger came to Job and said, 'The oxen were plowing and the donkeys were feeding beside them,",
      "links": "<a href='/AIV/18/1/3'>Job 1:3</a>",
      "comment": "Accurate depiction of typical ancient agricultural practices."
    },
    {
      "pk": 18001015,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 15,
      "text": "'when the Sabeans attacked and took them. They struck down the servants with the edge of the sword, and I alone have escaped to tell you.'",
      "links": "<a href='/AIV/01/10/7'>Gen. 10:7</a>",
      "comment": "The Sabeans were known for their raids, reinforcing the historical setting (see Gen. 10:7)."
    },
    {
      "pk": 18001016,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 16,
      "text": "While he was still speaking, another came and said, 'The fire of God fell from heaven and burned up the sheep and the servants, and I alone have escaped to tell you.'",
      "links": "<a href='/AIV/01/19/24'>Gen. 19:24</a>",
      "comment": "‘Fire of God’ speaks both to possible supernatural affliction and natural disaster. In Scripture, fire is used for both judgment and purification (see Lev. 10:2; 1 Pet. 1:7)."
    },
    {
      "pk": 18001017,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 17,
      "text": "While he was still speaking, another came and said, 'The Chaldeans formed three bands, attacked the camels and took them, and struck down the servants with the edge of the sword, and I alone have escaped to tell you.'",
      "links": "<a href='/AIV/01/11/28'>Gen. 11:28</a>",
      "comment": "Historical context: Chaldeans were fierce nomads well known in the ancient Near East (Gen. 11:28)."
    },
    {
      "pk": 18001018,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 18,
      "text": "While he was still speaking, another came and said, 'Your sons and daughters were eating and drinking wine in their eldest brother’s house,",
      "links": "<a href='/AIV/18/1/4'>Job 1:4</a>",
      "comment": "Repetition highlights the brevity of Job’s downfall, layering tragedy upon tragedy."
    },
    {
      "pk": 18001019,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 19,
      "text": "'when suddenly a great wind came from across the wilderness and struck the four corners of the house. It fell on the young people, and they died, and I alone have escaped to tell you.'",
      "links": "<a href='/AIV/19/147/18'>Ps. 147:18</a>; <a href='/AIV/42/8/23'>Luke 8:23</a>",
      "comment": "Disasters from nature further emphasize the scope of suffering; in biblical tradition, God’s sovereignty is shown even through such occurrences. (Mark 4:39)"
    },
    {
      "pk": 18001020,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 20,
      "text": "Then Job arose, tore his robe, shaved his head, and fell to the ground and worshiped.",
      "links": "<a href='/AIV/06/7/6'>Josh. 7:6</a>; <a href='/AIV/18/2/13'>Job 2:13</a>",
      "comment": "Signs of mourning—rending garments and shaving head—are customary, but Job responds with worship. Physical expressions of grief and worship are often intertwined in Scripture, paralleling themes of sacrificial offering (see Joel 2:13)."
    },
    {
      "pk": 18001021,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 21,
      "text": "He said, 'Naked I came from my mother’s womb, and naked I shall return there. The LORD gave, and the LORD has taken away; blessed be the name of the LORD.'",
      "links": "<a href='/AIV/19/113/2'>Ps. 113:2</a>; <a href='/AIV/20/27/20'>Prov. 27:20</a>",
      "comment": "Job’s worship in loss models profound submission and humility, themes expanded in Christ’s suffering (Phil. 2:8). His blessing of God’s name underlines the principle that God is worthy of worship independently of our circumstances."
    },
    {
      "pk": 18001022,
      "translation": "AIV",
      "book": 18,
      "chapter": 1,
      "verse": 22,
      "text": "In all this Job did not sin, nor did he charge God with wrongdoing.",
      "links": "<a href='/AIV/59/5/11'>James 5:11</a>; <a href='/AIV/18/2/10'>Job 2:10</a>",
      "comment": "Job is presented as innocent in his response to suffering, reflecting perseverance praised in James 5:11. This integrity will be tested further, setting the stage for the deeper questions of justice and faith found throughout Scripture. Job’s refusal to ‘charge God’ subtly points to trust—even when reason is exhausted—a theme central to spiritual formation and to many lives of the saints."
    }
  ],
  "translatedAt": "2025-12-23T05:15:40.852Z"
}