{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 37,
  "verses": [
    {
      "pk": 3803701,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 1,
      "text": "At this, my heart trembles and leaps out of its place.",
      "links": "<a href='/AIV/19/77/18'>Ps. 77:18</a>",
      "comment": "Elihu speaks with awe at God's works in nature, introducing a meditation on divine majesty."
    },
    {
      "pk": 3803702,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 2,
      "text": "Listen closely to the thunder of His voice and the rumbling that comes from His mouth.",
      "links": "<a href='/AIV/19/29/3'>Ps. 29:3</a>",
      "comment": "The thunder is presented as a direct expression of God’s power. Thunder as the 'voice of God' is a persistent biblical theme."
    },
    {
      "pk": 3803703,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 3,
      "text": "He sends it out under the whole heaven, and His lightning to the ends of the earth.",
      "links": "<a href='/AIV/19/97/4'>Ps. 97:4</a>; <a href='/AIV/40/24/27'>Matt. 24:27</a>",
      "comment": "God’s rule and activity are sovereign over all the earth—the imagery anticipates universal judgment and power."
    },
    {
      "pk": 3803704,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 4,
      "text": "After it, His voice roars; He thunders with His majestic voice, and He does not restrain the lightnings when His voice is heard.",
      "links": "<a href='/AIV/19/18/13'>Ps. 18:13</a>",
      "comment": "Lightning and thunder act together as signs of His authority. The persistence of thunder after lightning is emphasized."
    },
    {
      "pk": 3803705,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 5,
      "text": "God thunders wondrously with His voice; He does great things that we cannot understand.",
      "links": "<a href='/AIV/19/65/6'>Ps. 65:6</a>; <a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "God’s works are mysterious and surpass human understanding, reflecting the theme of divine incomprehensibility."
    },
    {
      "pk": 3803706,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 6,
      "text": "For He says to the snow, 'Fall on the earth,' likewise to the downpour, His mighty rain.",
      "links": "<a href='/AIV/19/147/16'>Ps. 147:16</a>",
      "comment": "Creation obeys the direct command of God, showing His providence and intimate governance of natural events."
    },
    {
      "pk": 3803707,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 7,
      "text": "He seals up the hand of every man, so that all men He has made may know it.",
      "links": "<a href='/AIV/19/104/23'>Ps. 104:23</a>",
      "comment": "God restrains human activity by weather, compelling all people to recognize His power."
    },
    {
      "pk": 3803708,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 8,
      "text": "Then the beasts go into their lairs, and remain in their dens.",
      "links": "<a href='/AIV/19/104/22'>Ps. 104:22'>Ps. 104:22</a>",
      "comment": "Human and animal life both respond to divine actions in nature—the harmony of creation with God's will is evident."
    },
    {
      "pk": 3803709,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 9,
      "text": "From its chamber comes the whirlwind, and cold from the scattering winds of the north.",
      "links": "<a href='/AIV/24/1/13'>Jer. 1:13</a>",
      "comment": "Natural phenomena such as storms originate under God's command, further displaying His sovereignty."
    },
    {
      "pk": 3803710,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 10,
      "text": "By the breath of God ice is given, and the broad waters are frozen tight.",
      "links": "<a href='/AIV/19/147/17'>Ps. 147:17</a>",
      "comment": "'Breath of God' signals both creation and ongoing sustenance (<a href='/AIV/01/2/7'>Gen. 2:7</a>), connecting to the Spirit’s work."
    },
    {
      "pk": 3803711,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 11,
      "text": "He loads the thick clouds with moisture; He scatters His lightning through the clouds.",
      "links": "<a href='/AIV/19/135/7'>Ps. 135:7</a>",
      "comment": "God’s control of clouds and lightning shows mastery over what is often seen as unpredictable or chaotic."
    },
    {
      "pk": 3803712,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 12,
      "text": "They turn around and around by His guidance, to accomplish all that He commands them on the face of the habitable world.",
      "links": "<a href='/AIV/19/148/8'>Ps. 148:8</a>",
      "comment": "Creation is utterly subject to God’s command, which subtly points toward the order and tradition established by God in authentic worship."
    },
    {
      "pk": 3803713,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 13,
      "text": "Whether for correction, or for His land, or for love, He causes it to happen.",
      "links": "<a href='/AIV/05/11/17'>Deut. 11:17</a>; <a href='/AIV/19/136/25'>Ps. 136:25</a>",
      "comment": "God uses nature for discipline, provision, and mercy. This hints at both retributive and benevolent aspects of providence."
    },
    {
      "pk": 3803714,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 14,
      "text": "Hear this, Job; pause and consider the wondrous works of God.",
      "links": "<a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "Contemplation of God’s works, not just knowledge, is essential—a reminder of the importance of meditative prayer and reflection."
    },
    {
      "pk": 3803715,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 15,
      "text": "Do you know how God lays His command upon the clouds, and causes the lightning of His cloud to shine?",
      "links": "<a href='/AIV/24/10/13'>Jer. 10:13</a>",
      "comment": "A transition: God’s wisdom and knowledge are far above human understanding."
    },
    {
      "pk": 3803716,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 16,
      "text": "Do you know the balancing of the clouds, the wondrous works of Him who is perfect in knowledge?",
      "links": "<a href='/AIV/18/36/4'>Job 36:4</a>",
      "comment": "The phrase 'perfect in knowledge' foreshadows the fullness of truth entrusted to God's people through divine revelation."
    },
    {
      "pk": 3803717,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 17,
      "text": "You whose garments are hot when the earth is still because of the south wind—",
      "links": "",
      "comment": "The heat here refers to the oppressive weather, again demonstrating things outside men's control but under God’s hand."
    },
    {
      "pk": 3803718,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 18,
      "text": "Can you, like Him, spread out the skies, hard as a cast metal mirror?",
      "links": "<a href='/AIV/01/1/6'>Gen. 1:6</a>",
      "comment": "Reference to the firmament in creation—a parallel between heaven as fashioned and enduring, under God’s authority."
    },
    {
      "pk": 3803719,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 19,
      "text": "Teach us what we should say to Him; we cannot draw up our case because of darkness.",
      "links": "",
      "comment": "Human limitation in speech and knowledge before God points to the necessity of a mediator in relating to God (cf. Job 9:33)."
    },
    {
      "pk": 3803720,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 20,
      "text": "Shall it be told Him that I would speak? Should a man wish that he were swallowed up?",
      "links": "",
      "comment": "Approaching God presumptuously is dangerous; humility and reverence are required."
    },
    {
      "pk": 3803721,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 21,
      "text": "Now, men do not see the light, bright though it is in the skies, until the wind passes and clears them.",
      "links": "",
      "comment": "Divine revelation is often obscured by human limitations; there is a need for illumination, similar to the role of grace and the Spirit in understanding truth."
    },
    {
      "pk": 3803722,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 22,
      "text": "Out of the north comes golden splendor; God is clothed with awesome majesty.",
      "links": "<a href='/AIV/19/104/1-2'>Ps. 104:1-2</a>",
      "comment": "The imagery of light, splendor, and majesty links to the manifestations of God’s glory throughout Scripture (cf. Exod. 24:17)."
    },
    {
      "pk": 3803723,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 23,
      "text": "The Almighty—we cannot find Him; He is great in power and justice, and abundant in righteousness; He will not oppress.",
      "links": "<a href='/AIV/18/9/10'>Job 9:10</a>; <a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "God’s justice is perfect and merciful, and His transcendence does not imply absence but hiddenness, anticipating the revelation in Christ."
    },
    {
      "pk": 3803724,
      "translation": "AIV",
      "book": 18,
      "chapter": 37,
      "verse": 24,
      "text": "Therefore men fear Him; He shows no partiality to those who are wise in their own hearts.",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>; <a href='/AIV/20/3/7'>Prov. 3:7</a>",
      "comment": "The root of faith is holy fear and humility before God. This verse highlights the insufficiency of individual wisdom outside God’s established order, and prefigures Christ’s teaching that the humble will be exalted."
    }
  ],
  "translatedAt": "2025-12-23T05:31:35.271Z"
}