{
  "book": "Job",
  "bookAbbreviation": "Job",
  "chapter": 7,
  "verses": [
    {
      "pk": 2007001,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 1,
      "text": "Does not humanity have hard service on earth, and are not their days like those of a hired laborer?",
      "links": "<a href='/ESV/14/15/14'>2 Chron. 15:14</a>; <a href='/ESV/18/14/1'>Job 14:1</a>",
      "comment": "Job compares human life to that of a hired man, marked by toil and suffering, showing the universality of human struggle—a theme echoed in Ecclesiastes 1:2-3."
    },
    {
      "pk": 2007002,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 2,
      "text": "Like a slave longing for the shade, and like a hired servant waiting for his wages,",
      "links": "<a href='/ESV/40/20/1-2'>Matt. 20:1-2</a>",
      "comment": "The longing for rest and reward prefigures the hope for eternal rest and the fulfillment found in Christ (cf. Heb. 4:9-10)."
    },
    {
      "pk": 2007003,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 3,
      "text": "So I am allotted months of emptiness, and nights of misery are assigned to me.",
      "links": "<a href='/ESV/18/29/2'>Job 29:2</a>",
      "comment": "Job’s lament highlights the experience of suffering over a prolonged period, a common experience for those enduring trial."
    },
    {
      "pk": 2007004,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 4,
      "text": "When I lie down I say, 'When shall I arise?' But the night drags on, and I am full of restlessness until dawn.",
      "links": "<a href='/ESV/18/13/28'>Job 13:28</a>; <a href='/ESV/19/6/6'>Ps. 6:6</a>",
      "comment": "Recalls Psalm 6:6, expressing despair and sleeplessness in the midst of suffering—a universal cry of the human heart."
    },
    {
      "pk": 2007005,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 5,
      "text": "My flesh is clothed with worms and scabs; my skin is broken and festering.",
      "links": "<a href='/ESV/18/2/7-8'>Job 2:7-8</a>",
      "comment": "Describes Job's physical affliction, underlining the reality of bodily suffering and the limits of human strength."
    },
    {
      "pk": 2007006,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 6,
      "text": "My days are swifter than a weaver’s shuttle and come to an end without hope.",
      "links": "<a href='/ESV/18/9/25'>Job 9:25</a>; <a href='/ESV/19/39/5'>Ps. 39:5</a>",
      "comment": "Job’s view of life’s brevity and seeming hopelessness is shared by the psalmist (Ps. 39:5), foreshadowing the longing for redemption."
    },
    {
      "pk": 2007007,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 7,
      "text": "Remember that my life is a mere breath; my eye will never again see good.",
      "links": "<a href='/ESV/18/14/1-2'>Job 14:1-2</a>; <a href='/ESV/19/78/39'>Ps. 78:39</a>",
      "comment": "Affirms human frailty, echoing themes of fleeting life and mortality found throughout Scripture (see Ps. 39:5, Jas. 4:14)."
    },
    {
      "pk": 2007008,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 8,
      "text": "The eye of him who sees me will see me no longer; while your eyes are on me, I shall no longer be.",
      "links": "<a href='/ESV/18/8/18'>Job 8:18</a>",
      "comment": "This expresses Job’s sense of impending death; he sees himself as disappearing from the notice of man and God."
    },
    {
      "pk": 2007009,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 9,
      "text": "As a cloud fades and vanishes, so he who goes down to the grave does not come up;",
      "links": "<a href='/ESV/18/10/21'>Job 10:21</a>; <a href='/ESV/19/103/16'>Ps. 103:16</a>",
      "comment": "Job’s comparison of human life to a vanishing cloud is repeated in Psalm 103:16, emphasizing the transient nature of existence."
    },
    {
      "pk": 2007010,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 10,
      "text": "he returns no more to his house, nor does his place know him anymore.",
      "links": "<a href='/ESV/18/20/9'>Job 20:9</a>",
      "comment": "Reinforces the finality of death and separation from earthly life, a theme developed further in Ecclesiastes 9:5."
    },
    {
      "pk": 2007011,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 11,
      "text": "Therefore I will not restrain my mouth; I will speak in the anguish of my spirit; I will complain in the bitterness of my soul.",
      "links": "<a href='/ESV/18/10/1'>Job 10:1</a>",
      "comment": "Job’s honesty in prayer anticipates the anguish of Jesus in Gethsemane (Matt. 26:38), showing the value in expressing sorrow before God."
    },
    {
      "pk": 2007012,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 12,
      "text": "Am I the sea, or a sea monster, that you set a guard over me?",
      "links": "<a href='/ESV/19/104/25-26'>Ps. 104:25–26</a>; <a href='/ESV/18/38/8'>Job 38:8</a>",
      "comment": "Job uses mythological language to question God’s treatment, anticipating God’s response in chapters 38–41. The sea often symbolizes chaos God must restrain."
    },
    {
      "pk": 2007013,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 13,
      "text": "When I say, 'My bed will comfort me, my couch will ease my complaint,'",
      "links": "<a href='/ESV/18/30/28'>Job 30:28</a>",
      "comment": "Even the hope of rest is denied Job, foreshadowing the spiritual reality that true rest is ultimately found in God (see Matt. 11:28)."
    },
    {
      "pk": 2007014,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 14,
      "text": "you frighten me with dreams and terrify me with visions,",
      "links": "<a href='/ESV/18/4/13'>Job 4:13</a>",
      "comment": "This verse resonates with the experience of spiritual trial, where even sleep is restless—a precursor to New Testament struggles with spiritual darkness."
    },
    {
      "pk": 2007015,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 15,
      "text": "so that I choose strangling and death rather than my bones.",
      "links": "<a href='/ESV/18/6/9'>Job 6:9</a>",
      "comment": "Job’s desperation articulates a longing for escape; still, such suffering can prepare the heart for surrender and hope in resurrection (see 2 Cor. 1:9)."
    },
    {
      "pk": 2007016,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 16,
      "text": "I loathe my life; I would not live forever. Leave me alone, for my days are but a breath.",
      "links": "<a href='/ESV/18/9/21'>Job 9:21</a>; <a href='/ESV/19/39/5'>Ps. 39:5</a>",
      "comment": "Echoes the realization of life’s brevity and the insufficiency of earthly existence—a longing ultimately fulfilled in the life to come."
    },
    {
      "pk": 2007017,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 17,
      "text": "What is man, that you make so much of him, and that you set your heart on him,",
      "links": "<a href='/ESV/19/8/4-5'>Ps. 8:4-5</a>; <a href='/ESV/58/2/6'>Heb. 2:6</a>",
      "comment": "Job’s question is answered more fully in the incarnation, when God’s love for mankind is revealed in Christ (Heb. 2:6–9)."
    },
    {
      "pk": 2007018,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 18,
      "text": "visit him every morning and test him every moment?",
      "links": "<a href='/ESV/18/14/3'>Job 14:3</a>",
      "comment": "God’s attentiveness can feel like scrutiny, yet in the fullness of revelation, God’s discipline is understood as loving formation for eternal life (Heb. 12:7)."
    },
    {
      "pk": 2007019,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 19,
      "text": "How long will you not look away from me, nor leave me alone till I swallow my spit?",
      "links": "<a href='/ESV/19/39/13'>Ps. 39:13</a>",
      "comment": "Job’s plea for relief is echoed by many saints who endure trial, but those who persevere are assured of reward (Jas. 1:12)."
    },
    {
      "pk": 2007020,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 20,
      "text": "If I have sinned, what have I done to you, O watcher of men? Why have you made me your target? Have I become a burden to you?",
      "links": "<a href='/ESV/18/10/14'>Job 10:14</a>",
      "comment": "Job’s questioning brings up the problem of suffering and divine justice. The ultimate answer is found in the mystery of Christ’s suffering for our sake (1 Pet. 2:24)."
    },
    {
      "pk": 2007021,
      "translation": "AIV",
      "book": 18,
      "chapter": 7,
      "verse": 21,
      "text": "Why do you not pardon my transgression and take away my iniquity? For now I shall sleep in the dust; you will seek me, but I shall not be.",
      "links": "<a href='/ESV/19/32/1'>Ps. 32:1</a>; <a href='/ESV/19/130/4'>Ps. 130:4</a>",
      "comment": "Here, Job longs for both forgiveness and reconciliation—answered in the ministry of Jesus, who brings true pardon and resurrection hope (Mark 2:10, John 11:25–26)."
    }
  ],
  "translatedAt": "2025-12-23T05:17:57.252Z"
}