{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 9,
  "verses": [
    {
      "pk": 3940091,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 1,
      "text": "The burden of the word of the LORD is against the land of Hadrach, and will rest upon Damascus. For the eyes of the LORD are on all mankind, especially on all the tribes of Israel.",
      "links": "<a href='/AIV/23/17/1'>Isa. 17:1</a>; <a href='/AIV/24/49/23'>Jer. 49:23</a>",
      "comment": "This prophecy, or 'burden,' begins with Hadrach and Damascus, signaling judgment and God's sovereign oversight of all nations, yet with a special focus on Israel. The mention of God's eyes recalls His knowledge and providence (see 2 Chr. 16:9)."
    },
    {
      "pk": 3940092,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 2,
      "text": "And also upon Hamath, which borders on it, and Tyre and Sidon, though they are very wise.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>; <a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "The cities mentioned here were centers of commerce and wisdom. Their inclusion highlights that no amount of human wisdom or prosperity stands against God’s justice."
    },
    {
      "pk": 3940093,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 3,
      "text": "Tyre built herself a fortress, and piled up silver like dust, and gold like the mud of the streets.",
      "links": "<a href='/AIV/26/28/4'>Ezek. 28:4-5</a>",
      "comment": "Tyre's riches and fortifications are described with hyperbole. Jesus later warned that wealth is no protection against judgment (Luke 12:20). These images also prefigure worldly resistance to God's kingdom."
    },
    {
      "pk": 3940094,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 4,
      "text": "But behold, the Lord will dispossess her, and strike down her power in the sea, and she herself will be consumed by fire.",
      "links": "<a href='/AIV/26/26/3'>Ezek. 26:3-4</a>",
      "comment": "Tyre’s destruction was fulfilled by Alexander the Great and is interpreted as a sign of divine sovereignty. God's judgment extends to all proud, self-reliant cities."
    },
    {
      "pk": 3940095,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 5,
      "text": "Ashkelon will see it and be afraid; Gaza will writhe in great pain, and Ekron too, for her hope will wither away. The king will perish from Gaza, and Ashkelon will be uninhabited.",
      "links": "<a href='/AIV/24/47/5'>Jer. 47:5</a>; <a href='/AIV/30/1/8'>Amos 1:8</a>",
      "comment": "The Philistine cities' terror and desolation reflect the fate of those who oppose God’s people. The 'king perishes' hints at the loss of all earthly security."
    },
    {
      "pk": 3940096,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 6,
      "text": "A mixed people will dwell in Ashdod, and I will cut off the pride of the Philistines.",
      "links": "<a href='/AIV/36/2/4'>Zeph. 2:4-5</a>",
      "comment": "The new population foreshadows the inclusion of Gentiles in salvation, a theme fulfilled in the New Testament as the gospel reaches all nations (Acts 10:34-35)."
    },
    {
      "pk": 3940097,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 7,
      "text": "I will remove their blood from their mouth, and their detestable things from between their teeth. Then they too will be a remnant for our God; they will become like a clan in Judah, and Ekron will be like the Jebusites.",
      "links": "<a href='/AIV/23/19/25'>Isa. 19:25</a>; <a href='/AIV/19/87/4'>Ps. 87:4</a>",
      "comment": "This predicts ritual purification and the spiritual inclusion of former enemies. The Jebusites became part of Israel’s people (see 2 Sam. 24:16). This verse points to the unity of all nations in God’s house, realized in the Church."
    },
    {
      "pk": 3940098,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 8,
      "text": "Then I will encamp at my house as a guard, so that none shall pass through or return. No oppressor shall overrun them anymore, for now I see with my own eyes.",
      "links": "<a href='/AIV/02/12/13'>Exod. 12:13</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "God's presence as a protector anticipates the safeguarding of His people. The imagery is both literal (during the return from exile) and spiritual, evoking the security found in the true assembly of the faithful."
    },
    {
      "pk": 3940099,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 9,
      "text": "Rejoice greatly, daughter of Zion! Shout aloud, daughter of Jerusalem! Behold, your king is coming to you; righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey.",
      "links": "<a href='/AIV/40/21/5'>Matt. 21:5</a>; <a href='/AIV/43/12/14-15'>John 12:14-15</a>",
      "comment": "This vivid prophecy is fulfilled in Jesus’ triumphal entry into Jerusalem (see above links). His humility and peacefulness define the Messianic king, who saves not by violence, but through gentle authority and righteousness. See also Isa. 62:11."
    },
    {
      "pk": 3940100,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 10,
      "text": "I will cut off the chariot from Ephraim and the war horse from Jerusalem; and the battle bow shall be broken. He will speak peace to the nations; his dominion will extend from sea to sea, and from the River to the ends of the earth.",
      "links": "<a href='/AIV/19/72/8'>Ps. 72:8</a>; <a href='/AIV/23/2/4'>Isa. 2:4</a>",
      "comment": "Here the Messiah brings lasting peace. The language of universal dominion points beyond earthly kingdoms to a spiritual reign over all nations, fulfilled through Christ’s Church and the spread of the gospel."
    },
    {
      "pk": 3940101,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 11,
      "text": "As for you also, because of the blood of my covenant with you, I will set your prisoners free from the waterless pit.",
      "links": "<a href='/AIV/02/24/8'>Exod. 24:8</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "The 'blood of my covenant' echoes Passover and is fulfilled in Jesus' words at the Last Supper, showing the continuity between Old and New Covenants. The liberation from the pit can be seen as prefiguring spiritual deliverance."
    },
    {
      "pk": 3940102,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 12,
      "text": "Return to your stronghold, O prisoners of hope; today I declare that I will restore to you double.",
      "links": "<a href='/AIV/23/61/7'>Isa. 61:7</a>",
      "comment": "God promises abundant restoration to the faithful. This is both a comfort to post-exilic Israel and an image of the superabundant grace provided through Jesus (see John 10:10)."
    },
    {
      "pk": 3940103,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 13,
      "text": "For I have bent Judah as my bow; I have made Ephraim its arrow. I will stir up your sons, O Zion, against your sons, O Greece, and wield you like a warrior’s sword.",
      "links": "<a href='/AIV/19/110/2'>Ps. 110:2</a>; <a href='/AIV/27/8/21'>Dan. 8:21</a>",
      "comment": "This verse anticipates struggles with Greek powers (fulfilled in the Maccabean period). Spiritually, the Church’s endurance against hostile forces continues this imagery."
    },
    {
      "pk": 3940104,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 14,
      "text": "Then the LORD will appear over them, and his arrow will go forth like lightning. The Lord GOD will blow the trumpet and march out in the whirlwinds of the south.",
      "links": "<a href='/AIV/02/19/16'>Exod. 19:16</a>; <a href='/AIV/19/18/14'>Ps. 18:14</a>",
      "comment": "God's presence and intervention are described with awe-inspiring imagery, recalling God’s manifestations at Sinai. The blowing of the trumpet parallels themes in final judgment (1 Thess. 4:16)."
    },
    {
      "pk": 3940105,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 15,
      "text": "The LORD of hosts will protect them; they will devour and trample the sling stones. They will drink and be noisy as with wine, and be filled like a bowl, like the corners of the altar.",
      "links": "<a href='/AIV/03/8/15'>Lev. 8:15</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "The overflowing bowl and altar allude to sacrificial worship, implying deeper spiritual communion. The imagery of 'devouring enemies' is figurative of victory, not literal violence."
    },
    {
      "pk": 3940106,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 16,
      "text": "On that day the LORD their God will save them as the flock of his people; for like jewels of a crown, they shall shine in his land.",
      "links": "<a href='/AIV/23/62/3'>Isa. 62:3</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "God’s people are compared to valuable jewels, emphasizing their dignity and worth. The flock motif points to the shepherd imagery Jesus later uses (John 10:11), prefiguring the unity and glory of the redeemed community."
    },
    {
      "pk": 3940107,
      "translation": "AIV",
      "book": 38,
      "chapter": 9,
      "verse": 17,
      "text": "How great is his goodness, and how great his beauty! Grain will make the young men flourish, and new wine the young women.",
      "links": "<a href='/AIV/19/65/11'>Ps. 65:11</a>; <a href='/AIV/24/31/12'>Jer. 31:12</a>",
      "comment": "The closing verse highlights the joy and abundance promised to God’s people. Physical blessings also symbolize spiritual nourishment provided through Christ. The interconnectedness of joy and sacramental signs is an enduring theme."
    }
  ],
  "translatedAt": "2025-12-23T07:40:05.054Z"
}