{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 5,
  "verses": [
    {
      "pk": 2050501,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 1,
      "text": "Then I turned and raised my eyes, and I saw a flying scroll.",
      "links": "<a href='/AIV/38/1/18'>Zech. 1:18</a>; <a href='/AIV/34/3/8'>Nah. 3:8</a>",
      "comment": "Zechariah lifts his eyes and sees a new vision, introducing imagery that symbolizes God's message and judgment."
    },
    {
      "pk": 2050502,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 2,
      "text": "And he said to me, 'What do you see?' I answered, 'I see a flying scroll; its length is twenty cubits, and its width ten cubits.'",
      "links": "<a href='/AIV/11/6/3'>1 Kgs. 6:3</a>",
      "comment": "The dimensions match the porch of Solomon's temple (see 1 Kgs. 6:3), suggesting this scroll's message relates to the temple and the people’s worship."
    },
    {
      "pk": 2050503,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 3,
      "text": "Then he said to me, 'This is the curse that goes out over the face of the whole land, for everyone who steals shall be purged away according to what is written on one side, and everyone who swears falsely shall be purged away according to what is written on the other side.'",
      "links": "<a href='/AIV/2/20/15'>Exod. 20:15-16</a>; <a href='/AIV/3/19/12'>Lev. 19:12</a>",
      "comment": "The scroll represents God’s judgment and the law; stealing (the eighth commandment) and false swearing (the third commandment) cover both social sins and unfaithfulness against God."
    },
    {
      "pk": 2050504,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 4,
      "text": "'I will send it out,' declares the LORD of hosts, 'and it shall enter the house of the thief and the house of the one who swears falsely by My name, and it shall remain in his house and consume it, both its timber and its stones.'",
      "links": "<a href='/AIV/3/14/34-35'>Lev. 14:34–35</a>",
      "comment": "God's judgment is thorough and unavoidable. The idea of the curse consuming the house recalls judgments upon defilement and sin. Here is a foreshadowing of the comprehensive nature of God’s justice."
    },
    {
      "pk": 2050505,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 5,
      "text": "Then the angel who spoke with me came forward and said to me, 'Lift up your eyes and see what this is that goes out.'",
      "links": "<a href='/AIV/38/4/1'>Zech. 4:1</a>",
      "comment": "Another vision is introduced—a common feature in Zechariah, where successive visions build an unfolding message of both warning and hope."
    },
    {
      "pk": 2050506,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 6,
      "text": "I said, 'What is it?' He said, 'This is the measuring basket that is going out.' And he said, 'This is their iniquity in all the land.'",
      "links": "<a href='/AIV/40/23/32'>Matt. 23:32</a>; <a href='/AIV/38/1/6'>Zech. 1:6</a>",
      "comment": "The 'measuring basket' (Heb. ephah) symbolizes iniquity being measured and revealed. This speaks to God's precision in dealing with sin and wickedness among His people."
    },
    {
      "pk": 2050507,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 7,
      "text": "And behold, a lead cover was lifted, and there was a woman sitting in the basket.",
      "links": "<a href='/AIV/20/9/13-18'>Prov. 9:13–18</a>",
      "comment": "The woman represents personified wickedness, contained and restrained. The use of feminine imagery for evil is notable, reflecting ancient wisdom literature."
    },
    {
      "pk": 2050508,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 8,
      "text": "And he said, 'This is Wickedness.' And he cast her back into the basket, and he put the lead cover on its opening.",
      "links": "<a href='/AIV/19/38/4'>Ps. 38:4</a>",
      "comment": "Sin is both exposed and then locked away—emphasizing both the reality of evil among the people and God’s intention to contain and ultimately remove it."
    },
    {
      "pk": 2050509,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 9,
      "text": "Then I lifted my eyes and saw, and there were two women coming with the wind in their wings—they had wings like the wings of a stork. And they lifted up the basket between earth and heaven.",
      "links": "<a href='/AIV/19/104/3'>Ps. 104:3</a>; <a href='/AIV/26/10/1'>Ezek. 10:1</a>",
      "comment": "Storks were considered unclean (Lev. 11:19). The women with wings convey that wickedness is being carried away, removed from the midst of God’s people—a strong visual of purification. The elevation between earth and heaven symbolizes a decisive transition."
    },
    {
      "pk": 2050510,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 10,
      "text": "So I said to the angel who spoke with me, 'Where are they taking the basket?'",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>",
      "comment": "Zechariah’s question anticipates God's intent to not merely contain, but expel evil. The prophet's engagement encourages us to seek understanding of God's actions."
    },
    {
      "pk": 2050511,
      "translation": "AIV",
      "book": 38,
      "chapter": 5,
      "verse": 11,
      "text": "He said to me, 'To the land of Shinar, to build a house for it. And when it is prepared, they will set the basket there on its base.'",
      "links": "<a href='/AIV/1/10/10'>Gen. 10:10</a>; <a href='/AIV/1/11/2'>Gen. 11:2</a>; <a href='/AIV/27/1/2'>Dan. 1:2</a>",
      "comment": "Shinar (Babylon) is symbolic of humanity’s rebellion against God (Gen. 11:2). Wickedness is sent away to its own place, prefiguring final judgment and purification of the faithful. This foreshadows God’s definitive victory over evil, ultimately accomplished through the Messiah. For believers, this points to the promise of a purified people—echoing the scriptural theme of the Church as holy and set apart."
    }
  ],
  "translatedAt": "2025-12-23T07:38:27.389Z"
}