{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 1,
  "verses": [
    {
      "pk": 45001001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 1,
      "text": "In the eighth month, in the second year of Darius, the word of the Lord came to Zechariah son of Berechiah, son of Iddo, the prophet:",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/12/25/25'>2 Chr. 25:25</a>",
      "comment": "Zechariah’s prophetic ministry begins during the reign of Darius, connecting to the post-exilic return and restoration context, also found in Haggai. The genealogy highlights continuity and legitimacy in the prophetic office."
    },
    {
      "pk": 45001002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 2,
      "text": "The Lord was very angry with your ancestors.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/23/1/4'>Isa. 1:4</a>",
      "comment": "Zechariah recalls divine wrath against prior generations, a theme echoing Jeremiah and Isaiah. God’s justice requires repentance and humility from the people."
    },
    {
      "pk": 45001003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 3,
      "text": "Therefore say to them, ‘This is what the Lord of hosts says: Return to me, declares the Lord of hosts, and I will return to you, says the Lord of hosts.’",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/19/80/3'>Ps. 80:3</a>; <a href='/AIV/38/7/18'>Mal. 3:7</a>",
      "comment": "The repeated appeal to ‘the Lord of hosts’ emphasizes God’s sovereignty. The promise to ‘return’ mirrors covenant faithfulness and the importance of genuine conversion, prefiguring themes of repentance found in the ministry of Christ."
    },
    {
      "pk": 45001004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 4,
      "text": "Do not be like your ancestors, to whom the earlier prophets proclaimed, ‘This is what the Lord of hosts says: Turn from your evil ways and from your evil deeds.’ But they did not listen or pay attention to me, declares the Lord.",
      "links": "<a href='/AIV/24/7/25'>Jer. 7:25-26</a>; <a href='/AIV/14/36/16'>2 Chr. 36:16</a>",
      "comment": "The failure of past generations to heed the prophets’ call is a warning. The necessity of obedience and listening to God’s messengers forms a pattern that anticipates the authority and teaching office established in the New Testament."
    },
    {
      "pk": 45001005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 5,
      "text": "Your ancestors—where are they? And the prophets, do they live forever?",
      "links": "<a href='/AIV/18/14/10'>Job 14:10</a>; <a href='/AIV/19/39/5'>Ps. 39:5</a>",
      "comment": "A reminder of human mortality: even the prophets die, but God's word abides. This subtly points to a hopeful expectation of a lasting message, which reaches fullness in the ministry of Christ."
    },
    {
      "pk": 45001006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 6,
      "text": "But did not my words and my statutes, which I commanded my servants the prophets, overtake your ancestors? Then they repented and said, ‘The Lord of hosts has dealt with us according to our ways and deeds, just as he decided to do.’",
      "links": "<a href='/AIV/04/14/35'>Num. 14:35</a>; <a href='/AIV/25/2/17'>Lam. 2:17</a>",
      "comment": "God’s word is inevitably fulfilled. The people acknowledge the justice of their fate, foreshadowing the need for repentance and submission to divine authority."
    },
    {
      "pk": 45001007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 7,
      "text": "On the twenty-fourth day of the eleventh month, which is the month of Shebat, in the second year of Darius, the word of the Lord came to Zechariah son of Berechiah, son of Iddo, the prophet:",
      "links": "<a href='/AIV/45/1/1'>Zech. 1:1</a>; <a href='/AIV/16/1/1'>Neh. 1:1</a>",
      "comment": "Precise dating highlights reliability. Detailed context links to post-exilic restoration, establishing the prophet’s authority and the authenticity of divine revelation."
    },
    {
      "pk": 45001008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 8,
      "text": "During the night I saw a vision: a man riding a red horse stood among the myrtle trees in the valley; behind him were red, brown, and white horses.",
      "links": "<a href='/AIV/38/6/2-3'>Zech. 6:2-3</a>; <a href='/AIV/26/1/10'>Ezek. 1:10</a>",
      "comment": "The vision introduces symbolic imagery. The man on the red horse is later interpreted as an angelic messenger, yet tradition often sees messianic overtones, anticipating the role of divine mediation between heaven and earth."
    },
    {
      "pk": 45001009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 9,
      "text": "I asked, ‘My lord, what are these?’ So the angel who spoke with me said, ‘I will show you what they are.’",
      "links": "<a href='/AIV/26/37/3'>Ezek. 37:3</a>; <a href='/AIV/45/1/19'>Zech. 1:19</a>",
      "comment": "Zechariah’s humility—asking for understanding—shows how revelation requires divine interpretation. The mediation of angels points to a continuing tradition of heavenly messengers guiding God’s people."
    },
    {
      "pk": 45001010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 10,
      "text": "And the man standing among the myrtle trees answered, ‘These are the ones whom the Lord has sent to patrol the earth.’",
      "links": "<a href='/AIV/18/1/7'>Job 1:7</a>; <a href='/AIV/38/6/5-7'>Zech. 6:5-7</a>",
      "comment": "Divine oversight and vigilance are stressed through the act of patrolling. This evokes God’s providence and government over creation—recalling the ordered structure of the heavenly court."
    },
    {
      "pk": 45001011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 11,
      "text": "And they answered the angel of the Lord who stood among the myrtle trees, ‘We have patrolled the earth, and behold, all the earth is at peace and rest.’",
      "links": "<a href='/AIV/18/1/7'>Job 1:7</a>; <a href='/AIV/38/6/8'>Zech. 6:8</a>",
      "comment": "The earth’s peace is not necessarily a sign of blessing, as the following verses clarify; rather, it may indicate a lull before divine intervention. The ‘angel of the Lord’ imagery carries strong christological resonance for later interpreters."
    },
    {
      "pk": 45001012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 12,
      "text": "Then the angel of the Lord said, ‘O Lord of hosts, how long will you have no mercy on Jerusalem and the cities of Judah, against which you have been angry these seventy years?’",
      "links": "<a href='/AIV/24/25/11'>Jer. 25:11</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "Seventy years refers to the period of exile. The angel’s intercession for God’s mercy foreshadows Christ’s perfect mediation, emphasizing the importance of advocacy and intercessory prayer in the spiritual life."
    },
    {
      "pk": 45001013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 13,
      "text": "And the Lord answered the angel who spoke with me with gracious and comforting words.",
      "links": "<a href='/AIV/23/40/1'>Isa. 40:1</a>; <a href='/AIV/19/85/8'>Ps. 85:8</a>",
      "comment": "Divine response comes as comfort and grace, marking a major turning point for post-exilic Israel and pointing toward God’s ultimate desire to console and restore His people."
    },
    {
      "pk": 45001014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 14,
      "text": "So the angel who spoke with me said to me, ‘Cry out, saying, This is what the Lord of hosts says: I am exceedingly jealous for Jerusalem and Zion.’",
      "links": "<a href='/AIV/02/20/5'>Exod. 20:5</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "God’s ‘jealousy’ reflects His zealous protection and love for the covenant people and place, emphasizing His unique relationship with Jerusalem and the future centrality of it in salvation history."
    },
    {
      "pk": 45001015,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 15,
      "text": "But I am deeply angry with the nations that are at ease; for while I was only slightly angry, they furthered the disaster.",
      "links": "<a href='/AIV/19/123/4'>Ps. 123:4</a>; <a href='/AIV/23/47/6'>Isa. 47:6</a>",
      "comment": "God’s judgment upon the nations comes because they abused their role in His discipline of Israel, pointing toward the moral accountability of all peoples and the broader plan of universal justice."
    },
    {
      "pk": 45001016,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 16,
      "text": "Therefore, this is what the Lord says: I have returned to Jerusalem with mercy; my house will be built in it, declares the Lord of hosts, and a measuring line will be stretched out over Jerusalem.",
      "links": "<a href='/AIV/37/1/8'>Hag. 1:8</a>; <a href='/AIV/19/102/13'>Ps. 102:13</a>",
      "comment": "The promise of rebuilding God’s house in Jerusalem foreshadows the enduring presence of divine worship and the establishment of a visible worshipping community, aligned with the theology of God’s dwelling with His people."
    },
    {
      "pk": 45001017,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 17,
      "text": "Cry out again, saying, This is what the Lord of hosts says: My cities will again overflow with prosperity; the Lord will again comfort Zion and will again choose Jerusalem.",
      "links": "<a href='/AIV/23/51/3'>Isa. 51:3</a>; <a href='/AIV/19/87/2'>Ps. 87:2</a>",
      "comment": "Restoration and divine election of Jerusalem signal a renewal of the covenant. Overflows of prosperity and comfort suggest both material and spiritual renewal, mirroring the concept of an enduring spiritual city."
    },
    {
      "pk": 45001018,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 18,
      "text": "Then I looked up and saw four horns.",
      "links": "<a href='/AIV/27/7/7'>Dan. 7:7</a>; <a href='/AIV/45/2/1'>Zech. 2:1</a>",
      "comment": "Horns symbolize strength and the power of adversaries—common in prophetic imagery. Four often represents completeness, suggesting a global scope of opposition."
    },
    {
      "pk": 45001019,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 19,
      "text": "I asked the angel who spoke with me, ‘What are these?’ And he replied, ‘These are the horns that have scattered Judah, Israel, and Jerusalem.’",
      "links": "<a href='/AIV/24/50/17'>Jer. 50:17</a>; <a href='/AIV/27/8/20-22'>Dan. 8:20-22</a>",
      "comment": "The horns refer to powers that oppressed and scattered God's people. Identifying God’s enemies points to the ongoing struggle between good and evil, with an expectation of divine vindication."
    },
    {
      "pk": 45001020,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 20,
      "text": "Then the Lord showed me four craftsmen.",
      "links": "<a href='/AIV/11/7/14'>1 Kgs. 7:14</a>; <a href='/AIV/45/2/3'>Zech. 2:3</a>",
      "comment": "The four craftsmen are understood as agents of divine judgment and restoration—bringing healing and countering evil, prefiguring the notion of divinely appointed workers who build up God’s kingdom."
    },
    {
      "pk": 45001021,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 1,
      "verse": 21,
      "text": "I asked, ‘What are these coming to do?’ He answered, ‘These are the horns that scattered Judah so no one could raise his head. But these craftsmen have come to terrify them and throw down the horns of the nations who lifted their horn against the land of Judah to scatter it.’",
      "links": "<a href='/AIV/45/1/19'>Zech. 1:19</a>; <a href='/AIV/19/75/10'>Ps. 75:10</a>",
      "comment": "Divine justice is accomplished through human agents—restoring, healing, and defending God’s people. This prepares for a pattern of providential leadership and authority in the life of the worshipping community."
    }
  ],
  "translatedAt": "2025-12-24T09:54:53.341Z"
}