{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 9,
  "verses": [
    {
      "pk": 45009001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 1,
      "text": "The oracle of the word of the LORD against the land of Hadrach, and Damascus its resting place—for the eyes of mankind, and of all the tribes of Israel, are toward the LORD—",
      "links": "<a href='/AIV/23/17/1'>Isa. 17:1</a>; <a href='/AIV/19/33/13-15'>Ps. 33:13-15</a>",
      "comment": "Hadrach was a region in northern Syria. This verse establishes God's sovereignty not only over Israel, but also over its neighbors. All nations are under God's gaze and judgment, reminding us that God's plan is universal (see also Isa. 49:6)."
    },
    {
      "pk": 45009002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 2,
      "text": "and also against Hamath, which borders on it, Tyre and Sidon, though they are very wise.",
      "links": "<a href='/AIV/23/23/1-4'>Isa. 23:1-4</a>; <a href='/AIV/26/27/8'>Ezek. 27:8</a>",
      "comment": "Hamath, Tyre, and Sidon were wealthy, culturally influential cities. Yet wisdom or wealth is powerless against the LORD's will (see 1 Cor. 1:19)."
    },
    {
      "pk": 45009003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 3,
      "text": "Tyre has built herself a stronghold and heaped up silver like dust, and gold like the mud of the streets.",
      "links": "<a href='/AIV/26/28/4-5'>Ezek. 28:4-5</a>; <a href='/AIV/20/18/11'>Prov. 18:11</a>",
      "comment": "Tyre's famed fortifications and wealth cannot protect her from divine judgment. Earthly security without trust in God is ultimately futile."
    },
    {
      "pk": 45009004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 4,
      "text": "But the Lord will dispossess her and strike her wealth into the sea, and she herself will be devoured by fire.",
      "links": "<a href='/AIV/26/27/32-36'>Ezek. 27:32-36</a>; <a href='/AIV/29/3/7'>Joel 3:7</a>",
      "comment": "Historically, Alexander the Great destroyed Tyre and cast its riches into the sea. This shows God's word is fulfilled even through human events, prefiguring His victorious rule."
    },
    {
      "pk": 45009005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 5,
      "text": "Ashkelon will see it and be afraid; Gaza too, and will writhe in great pain; Ekron also, because her hope has been confounded; the king will perish from Gaza, and Ashkelon will be uninhabited.",
      "links": "<a href='/AIV/24/47/5'>Jer. 47:5</a>; <a href='/AIV/30/1/8'>Amos 1:8</a>",
      "comment": "The Philistine cities thought themselves secure, but they too would face God’s judgment. This recalls God's repeated assertion that He alone is King."
    },
    {
      "pk": 45009006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 6,
      "text": "A mixed people will dwell in Ashdod, and I will cut off the pride of Philistia.",
      "links": "<a href='/AIV/26/30/24'>Ezek. 30:24</a>; <a href='/AIV/23/14/1'>Isa. 14:1</a>",
      "comment": "\"A mixed people\" suggests foreigners replacing native Philistines—a sign of God's complete overthrow of their pride."
    },
    {
      "pk": 45009007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 7,
      "text": "I will remove their blood from their mouths, and their abominations from between their teeth; then those who remain will belong to our God and be like a clan in Judah, and Ekron will be like a Jebusite.",
      "links": "<a href='/AIV/23/19/24-25'>Isa. 19:24-25</a>; <a href='/AIV/44/15/16-18'>Acts 15:16-18</a>",
      "comment": "The image of removing blood and abominations refers to cleansing from idolatrous practices. Some Philistines will be counted among God's people, foreshadowing the inclusion of the Gentiles (see Eph. 2:13-19)."
    },
    {
      "pk": 45009008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 8,
      "text": "But I will encamp at my house as a guard, so that none shall oppress them any more; for now I watch with my own eyes.",
      "links": "<a href='/AIV/02/12/42'>Ex. 12:42</a>; <a href='/AIV/23/31/5'>Isa. 31:5</a>",
      "comment": "God personally promises protection over His house—interpreted as the Temple and His people. This anticipates God's special and abiding presence with His people (see Matt. 28:20)."
    },
    {
      "pk": 45009009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 9,
      "text": "Rejoice greatly, daughter of Zion! Shout, daughter of Jerusalem! Behold, your king is coming to you; he is righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey.",
      "links": "<a href='/AIV/40/21/5'>Matt. 21:5</a>; <a href='/AIV/41/11/7-10'>Mark 11:7-10</a>; <a href='/AIV/43/12/15'>John 12:15</a>",
      "comment": "This is a key prophecy fulfilled by Jesus' triumphal entry into Jerusalem (see Matt. 21:5). The king comes humbly, prefiguring Christ, who comes as the true and righteous King, yet with meekness. The donkey imagery points to a peaceful Messiah, distinguishing his kingdom from worldly power."
    },
    {
      "pk": 45009010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 10,
      "text": "I will remove the chariot from Ephraim and the war horse from Jerusalem. The battle bow will be cut off, and he will proclaim peace to the nations; his rule will extend from sea to sea, and from the River to the ends of the earth.",
      "links": "<a href='/AIV/19/72/8'>Ps. 72:8</a>; <a href='/AIV/23/9/7'>Isa. 9:7</a>; <a href='/AIV/49/2/14-17'>Eph. 2:14-17</a>",
      "comment": "This king's reign is universal and brings true peace, echoing messianic prophecies (Ps. 72:8). Spiritually, this describes the peace Christ brings to all peoples, fulfilling God’s plan for unity."
    },
    {
      "pk": 45009011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 11,
      "text": "As for you also, because of the blood of your covenant, I will set your prisoners free from the waterless pit.",
      "links": "<a href='/AIV/02/24/8'>Ex. 24:8</a>; <a href='/AIV/58/13/20'>Heb. 13:20</a>; <a href='/AIV/42/22/20'>Luke 22:20</a>",
      "comment": "\"Blood of your covenant\" connects to sacrificial themes and prefigures the new covenant Christ establishes by his blood (Luke 22:20; Heb. 13:20). Setting prisoners free references spiritual liberation from sin and death."
    },
    {
      "pk": 45009012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 12,
      "text": "Return to your stronghold, O prisoners of hope! Today I declare that I will restore to you double.",
      "links": "<a href='/AIV/23/61/7'>Isa. 61:7</a>; <a href='/AIV/19/146/7'>Ps. 146:7</a>",
      "comment": "Those who hope in God’s promises are assured of restoration and reward. The 'double' blessing evokes God’s superabundant grace, calling the faithful back to the secure place of His presence."
    },
    {
      "pk": 45009013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 13,
      "text": "For I have bent Judah as my bow; I have made Ephraim its arrow. I will stir up your sons, O Zion, against your sons, O Greece, and I will wield you like a warrior’s sword.",
      "links": "<a href='/AIV/27/8/21'>Dan. 8:21</a>; <a href='/AIV/19/45/3-5'>Ps. 45:3-5</a>",
      "comment": "Prophetically, this refers to the coming conflict between God’s people and Greece (as seen in the Maccabean era, see Dan. 8:21). Ultimately points to God using His people as instruments of His victory."
    },
    {
      "pk": 45009014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 14,
      "text": "Then the LORD will appear over them; his arrow will go forth like lightning; the Lord GOD will blow the trumpet and march with the storms of the south.",
      "links": "<a href='/AIV/19/18/14'>Ps. 18:14</a>; <a href='/AIV/34/1/3-6'>Nah. 1:3-6</a>",
      "comment": "God's personal intervention is portrayed in epic imagery, as at Sinai. This points to the eschatological hope of God's final, visible triumph."
    },
    {
      "pk": 45009015,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 15,
      "text": "The LORD of hosts will defend them; they will devour and trample the sling stones; they will drink and make loud noise as with wine; they will be full like a bowl, drenched like the corners of the altar.",
      "links": "<a href='/AIV/19/110/5-7'>Ps. 110:5-7</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "Imagery of consuming and drinking alludes to victory, joy, and sacrificial worship. The references to the altar recall the centrality of the worship at the temple, central to God’s plan to draw all nations."
    },
    {
      "pk": 45009016,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 16,
      "text": "On that day the LORD their God will save them, as the flock of his people; for like jewels in a crown they will shine on his land.",
      "links": "<a href='/AIV/23/62/3-4'>Isa. 62:3-4</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "Salvation is pictured as God shepherding His people and making them precious. The crowning shines with hope for final glorification in God’s kingdom, Christ Himself as the Good Shepherd (John 10:11)."
    },
    {
      "pk": 45009017,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 9,
      "verse": 17,
      "text": "How great is his goodness, and how great is his beauty! Grain will make the young men flourish, and new wine the young women.",
      "links": "<a href='/AIV/23/25/6'>Isa. 25:6</a>; <a href='/AIV/19/65/11-13'>Ps. 65:11-13</a>",
      "comment": "Zechariah closes with joy over God’s overflowing goodness, using images of abundance and blessing. This blessing is both physical and spiritual, anticipating the ultimate fulfillment in the messianic banquet the Lord will provide (see Matt. 26:29; Rev. 19:9)."
    }
  ],
  "translatedAt": "2025-12-24T09:57:45.678Z"
}