{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 2,
  "verses": [
    {
      "pk": 1943001,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 1,
      "text": "Then I lifted up my eyes and looked, and behold, a man with a measuring line in his hand.",
      "links": "<a href='/AIV/26/40/3'>Ezek. 40:3</a>; <a href='/AIV/66/11/1'>Rev. 11:1</a>",
      "comment": "The vision of the man with a measuring line symbolizes the divine intention to measure and establish Jerusalem. The act of measuring indicates both judgment and restoration, echoing similar prophetic imagery."
    },
    {
      "pk": 1943002,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 2,
      "text": "And I said, 'Where are you going?' And he said to me, 'To measure Jerusalem, to see its width and its length.'",
      "links": "<a href='/AIV/24/31/39-40'>Jer. 31:39-40</a>; <a href='/AIV/66/21/15'>Rev. 21:15</a>",
      "comment": "The measuring of Jerusalem underscores the divine plan for restoration and protection, referring to the city’s ultimate spiritual significance."
    },
    {
      "pk": 1943003,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 3,
      "text": "And behold, the angel who talked with me went out, and another angel went out to meet him.",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>",
      "comment": "Two angels are present, suggesting the importance of divine messengers in communicating God’s will and in the unfolding of His plan for the people."
    },
    {
      "pk": 1943004,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 4,
      "text": "And he said to him, 'Run, speak to that young man, saying, Jerusalem will be inhabited as villages without walls because of the multitude of people and livestock in it.'",
      "links": "<a href='/AIV/38/8/4-5'>Zech. 8:4-5</a>; <a href='/AIV/23/49/19-20'>Isa. 49:19-20</a>",
      "comment": "This points to a future where God's people will dwell securely and abundantly, naturally prefiguring the expansive nature of the messianic kingdom."
    },
    {
      "pk": 1943005,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 5,
      "text": "'And I will be to her,' declares the LORD, 'a wall of fire all around, and I will be the glory in her midst.'",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>; <a href='/AIV/23/4/5'>Isa. 4:5</a>; <a href='/AIV/66/21/23'>Rev. 21:23</a>",
      "comment": "God promises to be the protector and the presence for His people, substituting physical walls with His own glory, alluding both to the Exodus and to the indwelling of God's presence among His people—a type fulfilled in Christ’s incarnation and the ongoing presence of God among believers."
    },
    {
      "pk": 1943006,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 6,
      "text": "'Up! Up! Flee from the land of the north,' declares the LORD, 'for I have spread you abroad as the four winds of heaven,' declares the LORD.",
      "links": "<a href='/AIV/24/3/18'>Jer. 3:18</a>; <a href='/AIV/38/6/5'>Zech. 6:5</a>",
      "comment": "God urges the return of His scattered people, signaling both a historic and eschatological gathering—anticipating the gathering together of God’s family in a spiritual sense."
    },
    {
      "pk": 1943007,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 7,
      "text": "Up, escape to Zion, you who dwell with the daughter of Babylon!",
      "links": "<a href='/AIV/13/36/23'>2 Chr. 36:23</a>; <a href='/AIV/19/137/1'>Ps. 137:1</a>",
      "comment": "Zion symbolizes both the physical city and the spiritual assembly of God’s people. The call to flee Babylon also foreshadows the need for separation from worldly captivity to join the redeemed community."
    },
    {
      "pk": 1943008,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 8,
      "text": "For thus says the LORD of hosts: After his glory sent me to the nations who plundered you, for he who touches you touches the apple of his eye:",
      "links": "<a href='/AIV/05/32/10'>Deut. 32:10</a>; <a href='/AIV/19/17/8'>Ps. 17:8</a>",
      "comment": "God expresses the special status and protection granted to His people, who are deeply precious to Him. The phrase ‘the apple of his eye’ emphasizes God’s intimate care, and 'after his glory sent me' suggests a divine mission, connected to messianic interpretations."
    },
    {
      "pk": 1943009,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 9,
      "text": "Behold, I will shake my hand over them, and they will become plunder for their own servants. Then you will know that the LORD of hosts has sent me.",
      "links": "<a href='/AIV/23/14/2'>Isa. 14:2</a>; <a href='/AIV/24/30/16'>Jer. 30:16</a>",
      "comment": "Divine justice will reverse the fortunes of Israel's oppressors. The repeated phrase 'the LORD of hosts has sent me' is significant, implying an agent who speaks with divine authority, a hint at a mysterious mediator later clarified in the person of the Messiah."
    },
    {
      "pk": 1943010,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 10,
      "text": "Sing and rejoice, O daughter of Zion, for behold, I am coming and I will dwell in your midst, declares the LORD.",
      "links": "<a href='/AIV/38/8/3'>Zech. 8:3</a>; <a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "This prophecy is fulfilled in the coming of the Messiah, God himself dwelling among His people (cf. John 1:14, 'the Word became flesh and dwelt among us')."
    },
    {
      "pk": 1943011,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 11,
      "text": "And many nations will join themselves to the LORD in that day and shall be my people. And I will dwell in your midst, and you shall know that the LORD of hosts has sent me to you.",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6-7</a>; <a href='/AIV/44/15/14-17'>Acts 15:14-17</a>",
      "comment": "This verse looks forward to the inclusion of Gentiles into God's people—a defining mark of the New Covenant and universal assembly of believers (cf. Acts 15:14-17). God’s indwelling among His united people is central to salvation history."
    },
    {
      "pk": 1943012,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 12,
      "text": "And the LORD will inherit Judah as his portion in the holy land, and will again choose Jerusalem.",
      "links": "<a href='/AIV/05/32/9'>Deut. 32:9</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "God’s continued election of Jerusalem and Judah highlights His unbreakable covenant and the distinct role of a chosen community set apart for His dwelling and purposes."
    },
    {
      "pk": 1943013,
      "translation": "AIV",
      "book": 38,
      "chapter": 2,
      "verse": 13,
      "text": "Be silent, all flesh, before the LORD, for he has roused himself from his holy dwelling.",
      "links": "<a href='/AIV/19/76/8-9'>Ps. 76:8-9</a>; <a href='/AIV/23/18/4'>Isa. 18:4</a>",
      "comment": "Reverence is commanded for God, who now acts decisively from His holy presence. This awe-filled silence before God’s initiative echoes scenes of divine revelation and is a frequent biblical response when God draws near."
    }
  ],
  "translatedAt": "2025-12-23T07:37:39.170Z"
}