{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 3,
  "verses": [
    {
      "pk": 178030,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 1,
      "text": "Then he showed me Joshua the high priest standing before the angel of the LORD, and Satan standing at his right hand to accuse him.",
      "links": "<a href='/AIV/18/1/6-12'>Job 1:6-12</a>; <a href='/AIV/66/12/10'>Rev. 12:10</a>",
      "comment": "The vision begins with Joshua the high priest representing the people of Israel, standing before God's angel. Satan (the accuser) appears, highlighting his role as the adversary, a theme running throughout Scripture. Compare to Satan’s accusation in Job as well as Revelation 12 which identifies the accuser of the brethren."
    },
    {
      "pk": 178031,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 2,
      "text": "And the LORD said to Satan, 'The LORD rebuke you, Satan! The LORD, who has chosen Jerusalem, rebuke you! Is not this man a brand plucked from the fire?'",
      "links": "<a href='/AIV/65/1/9'>Jude 1:9</a>; <a href='/AIV/23/4/3'>Isa. 4:3</a>",
      "comment": "The LORD Himself rebukes Satan, asserting His sovereign choice of Jerusalem. The phrase 'brand plucked from the fire' signals rescue from judgment—a motif echoed in the New Testament (Jude 1:23). Note the authority with which the LORD addresses Satan, reminiscent of Christ’s authority in rebuking evil spirits."
    },
    {
      "pk": 178032,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 3,
      "text": "Now Joshua was standing before the angel, clothed with filthy garments.",
      "links": "<a href='/AIV/23/64/6'>Isa. 64:6</a>; <a href='/AIV/66/7/14'>Rev. 7:14</a>",
      "comment": "Joshua’s garments symbolize moral and ritual uncleanness (cf. Isaiah 64:6). The 'filthy garments' set the stage for a change initiated by God's grace, anticipating the theme of being washed and made pure, later fulfilled in Christ."
    },
    {
      "pk": 178033,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 4,
      "text": "And the angel said to those standing before him, 'Remove the filthy garments from him.' And to him he said, 'Behold, I have taken away your iniquity from you, and I will clothe you with pure garments.'",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/66/19/8'>Rev. 19:8</a>",
      "comment": "The change of garments signifies forgiveness and purity given by God—not earned by the high priest himself. The imagery of pure clothing is used elsewhere for those justified and sanctified (Isaiah 61:10, Revelation 19:8). There is a foreshadowing here of spiritual cleansing and God’s role in effecting it through His mediators."
    },
    {
      "pk": 178034,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 5,
      "text": "And I said, 'Let them put a clean turban on his head.' So they put a clean turban on his head and clothed him with garments, while the angel of the LORD stood by.",
      "links": "<a href='/AIV/2/28/4'>Ex. 28:4</a>; <a href='/AIV/2/39/28-31'>Ex. 39:28-31</a>",
      "comment": "The turban was a symbol of the high priest’s office and purity (Ex. 28:36-38). Joshua’s restoration is public and ceremonial, pointing to the importance of visible signs in worship and spiritual life. Observe how spiritual realities are confirmed with outward rituals."
    },
    {
      "pk": 178035,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 6,
      "text": "And the angel of the LORD solemnly instructed Joshua,",
      "links": "",
      "comment": "The scene shifts from action to instruction—the high priest must now obey the message given. The angel functions as a divine messenger, an intermediary, underscoring the notion of God’s instructions being transmitted through appointed sources."
    },
    {
      "pk": 178036,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 7,
      "text": "'Thus says the LORD of hosts: If you will walk in My ways and keep My charge, then you shall govern My house and guard My courts, and I will give you a place to walk among those who are standing here.'",
      "links": "<a href='/AIV/26/44/15-16'>Ezek. 44:15-16</a>; <a href='/AIV/19/84/10'>Ps. 84:10</a>",
      "comment": "Divine blessing is contingent on faithful obedience. The promise includes authority and access to God’s presence—a concept echoed in the priesthood of all believers, but also retaining a special role for the divinely-appointed leadership."
    },
    {
      "pk": 178037,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 8,
      "text": "'Hear now, O Joshua the high priest, you and your companions who sit before you, for they are men of symbol; for behold, I am bringing forth My servant, the Branch.'",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/24/23/5'>Jer. 23:5</a>",
      "comment": "Joshua and the priests are signs pointing to a future reality—the coming 'Branch', a title for the Messiah, often interpreted as Jesus (Isaiah 11:1, Jeremiah 23:5). The Old Testament offices and symbols prefigure Christ, and by extension, the ongoing work He entrusts to His servants."
    },
    {
      "pk": 178038,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 9,
      "text": "For behold, the stone that I have set before Joshua—on one stone are seven eyes. Behold, I will engrave its inscription, declares the LORD of hosts, and I will remove the iniquity of this land in a single day.",
      "links": "<a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/66/5/6'>Rev. 5:6</a>",
      "comment": "The 'stone' with seven eyes represents fullness, watchfulness, and divine insight. Removal of iniquity 'in a single day' points toward a decisive act of atonement, fulfilled in Christ’s sacrifice. The symbolic significance of stone and cleansing resonates with later New Testament allusions to Christ as the cornerstone and perfect priest."
    },
    {
      "pk": 178039,
      "translation": "AIV",
      "book": 38,
      "chapter": 3,
      "verse": 10,
      "text": "'In that day,' declares the LORD of hosts, 'everyone will invite his neighbor under his vine and under his fig tree.'",
      "links": "<a href='/AIV/11/4/25'>1 Kgs. 4:25</a>; <a href='/AIV/33/4/4'>Mic. 4:4</a>",
      "comment": "Peace and security are shown by the imagery of sitting under one’s vine and fig tree. This recalls the era of Solomon and is a prophetic picture of the coming Kingdom, where God’s salvation brings rest, unity, and abundance. The unity of God’s people and the fruitfulness of the community are central."
    }
  ],
  "translatedAt": "2025-12-23T07:37:56.640Z"
}