{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 13,
  "verses": [
    {
      "pk": 21313001,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 1,
      "text": "On that day a fountain will be opened for the house of David and for the inhabitants of Jerusalem, to cleanse them from sin and impurity.",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>; <a href='/AIV/23/1/16'>Isa. 1:16</a>; <a href='/AIV/43/19/34'>John 19:34</a>",
      "comment": "The 'fountain' symbolizes a future time of cleansing, understood in Christian tradition as a prophecy pointing to the cleansing power of Christ's sacrifice (John 19:34, where water and blood flow from Christ's side). This connects to the theme of purification, linking Old Testament sacrificial imagery to New Testament fulfillment."
    },
    {
      "pk": 21313002,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 2,
      "text": "\"On that day,\" declares the Lord of hosts, \"I will cut off the names of the idols from the land, so that they will be remembered no more. I will also remove from the land both the prophets and the spirit of impurity.",
      "links": "<a href='/AIV/24/10/11'>Jer. 10:11</a>; <a href='/AIV/26/36/25'>Ezek. 36:25</a>",
      "comment": "Here, false worship and spiritual deception will be eradicated by God's action. The mention of removing prophets refers to false prophets leading people astray. This points to the complete renewal and sanctification that God brings to His people, prefiguring the sanctifying work of Christ and the outpouring of the Holy Spirit."
    },
    {
      "pk": 21313003,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 3,
      "text": "If anyone still prophesies, his father and mother who bore him will say to him, 'You must not live, for you speak lies in the name of the Lord.' And his father and mother who bore him will pierce him through when he prophesies.",
      "links": "<a href='/AIV/05/13/6-11'>Deut. 13:6-11</a>; <a href='/AIV/26/14/10'>Ezek. 14:10</a>",
      "comment": "This harsh language shows the seriousness of God's opposition to false prophecy. The family is depicted as strictly upholding the truth of God. Spiritually, it demonstrates the radical response expected towards anything that distorts the faith, paralleling Jesus’ call to prioritize loyalty to God above all else (see Mt 10:37)."
    },
    {
      "pk": 21313004,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 4,
      "text": "On that day every prophet will be ashamed of his vision when he prophesies; he will no longer put on a hairy cloak to deceive.",
      "links": "<a href='/AIV/12/1/8'>2 Kings 1:8</a>; <a href='/AIV/40/7/15'>Matt. 7:15</a>",
      "comment": "The 'hairy cloak' refers to the traditional garb of prophets, here being worn for deception. True prophecy is distinguished from false by humility and fidelity to God. In the New Testament, discernment between genuine and counterfeit prophets is emphasized (Matt 7:15)."
    },
    {
      "pk": 21313005,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 5,
      "text": "He will say, 'I am not a prophet; I am a tiller of the soil, for I have been a servant of the land since my youth.'",
      "links": "<a href='/AIV/30/7/14'>Amos 7:14</a>",
      "comment": "The false prophet, confronted, denies his former claims and asserts an ordinary occupation. This highlights God’s decisive rejection of false ministry, and the honor due to authentic vocation. It also alludes to the humility and everyday life elevated in God’s plan."
    },
    {
      "pk": 21313006,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 6,
      "text": "If someone asks him, 'What are these wounds on your chest?' he will answer, 'The wounds I received in the house of my friends.'",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/40/26/67'>Matt. 26:67</a>",
      "comment": "This verse is interpreted by many Christians as a veiled reference to the suffering Messiah, betrayed by his own people (see Ps 41:9; fulfilled in Matt 26:67). It points to wounds not from enemies but from those close, a theme fulfilled at the passion of Christ."
    },
    {
      "pk": 21313007,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 7,
      "text": "\"Awake, O sword, against my shepherd, against the man who is my companion,\" declares the Lord of hosts. \"Strike the shepherd, and the sheep will be scattered; I will turn my hand against the little ones.\"",
      "links": "<a href='/AIV/40/26/31'>Matt. 26:31</a>; <a href='/AIV/41/14/27'>Mark 14:27</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "Christ Himself cites this verse in Matthew 26:31, applying it to His passion, where the apostles are scattered (Mark 14:27). The 'shepherd' is a clear Messianic reference, and the 'sheep' signify Christ's followers. This shows both literal fulfillment and a spiritual reality: God's people participate in the suffering and restoration of the Shepherd."
    },
    {
      "pk": 21313008,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 8,
      "text": "In the whole land,\" declares the Lord, \"two-thirds will be cut off and perish, but one-third will be left in it.",
      "links": "<a href='/AIV/26/5/12'>Ezek. 5:12</a>; <a href='/AIV/45/11/5'>Rom. 11:5</a>",
      "comment": "The imagery of a remnant, a faithful third preserved, resonates throughout Scripture (see Ezek 5:12; Rom 11:5). It underscores God's insistence on faithfulness in the midst of judgment, and prefigures the faithful community continued in the Church."
    },
    {
      "pk": 21313009,
      "translation": "AIV",
      "book": 38,
      "chapter": 13,
      "verse": 9,
      "text": "I will bring the third part through the fire; I will refine them as silver is refined, and test them as gold is tested. They will call on My name, and I will answer them. I will say, 'They are My people,' and they will say, 'The Lord is my God.'\"",
      "links": "<a href='/AIV/23/48/10'>Isa. 48:10</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>; <a href='/AIV/28/2/23'>Hos. 2:23</a>",
      "comment": "The purifying fire is a recurring biblical theme (Isa 48:10; 1 Pet 1:7). The covenantal language, 'They are My people,' recalls the deep relationship God desires. The sifting and refinement are not only historical but sacramental, pointing ahead to the means by which God perfects His people in faith, hope, and love, especially through trials and the sacramental life."
    }
  ],
  "translatedAt": "2025-12-23T07:41:15.150Z"
}