{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 1,
  "verses": [
    {
      "pk": 290101,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 1,
      "text": "In the eighth month, in the second year of Darius, the word of the LORD came to Zechariah son of Berechiah, son of Iddo, the prophet, saying:",
      "links": "<a href='/AIV/15/4/24'>Ezra 4:24</a>; <a href='/AIV/37/1/1'>Haggai 1:1</a>",
      "comment": "This verse sets the historical context in the reign of Darius I (circa 520 BC), situating Zechariah alongside Haggai encouraging the rebuilding of the temple."
    },
    {
      "pk": 290102,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 2,
      "text": "The LORD was extremely angry with your ancestors.",
      "links": "<a href='/AIV/24/7/25-26'>Jer. 7:25-26</a>; <a href='/AIV/36/1/6'>Zeph. 1:6</a>",
      "comment": "God’s anger refers to the persistent disobedience and idolatry of the people before the exile."
    },
    {
      "pk": 290103,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 3,
      "text": "Therefore say to them, ‘This is what the LORD of armies says: Return to Me,’ declares the LORD of armies, ‘and I will return to you,’ says the LORD of armies.",
      "links": "<a href='/AIV/39/3/7'>Malachi 3:7</a>; <a href='/AIV/23/55/7'>Isaiah 55:7</a>",
      "comment": "A key promise: God desires restored relationship. Returning is both an individual and communal call to repentance, echoing themes of reconciliation found throughout Scripture."
    },
    {
      "pk": 290104,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 4,
      "text": "Do not be like your ancestors, to whom the former prophets proclaimed, ‘This is what the LORD of armies says: Turn from your evil ways and from your evil deeds.’ But they did not listen or pay attention to Me, declares the LORD.",
      "links": "<a href='/AIV/24/25/4-7'>Jer. 25:4-7</a>; <a href='/AIV/26/18/30'>Ezekiel 18:30</a>",
      "comment": "A reminder not to repeat the stubbornness of previous generations, highlighting the importance of obedient response to God’s word."
    },
    {
      "pk": 290105,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 5,
      "text": "Where are your ancestors now? And the prophets, do they live forever?",
      "links": "<a href='/AIV/19/90/3-6'>Psalm 90:3-6</a>; <a href='/AIV/21/1/4'>Ecclesiastes 1:4</a>",
      "comment": "A sobering reality: human life is fleeting, but God’s message endures."
    },
    {
      "pk": 290106,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 6,
      "text": "But did not My words and My statutes, which I commanded My servants the prophets, overtake your ancestors? So they repented and said, ‘The LORD of armies has dealt with us according to our ways and our deeds, just as He determined.’",
      "links": "<a href='/AIV/24/44/23'>Jeremiah 44:23</a>",
      "comment": "God's justice is inevitable; His word always accomplishes His intent. Repentance follows when recognizing God’s righteous dealings."
    },
    {
      "pk": 290107,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 7,
      "text": "On the twenty-fourth day of the eleventh month, the month of Shebat, in the second year of Darius, the word of the LORD came to Zechariah son of Berechiah, son of Iddo, the prophet:",
      "links": "<a href='/AIV/38/1/1'>Zechariah 1:1</a>",
      "comment": "This marks a specific date (February 15, 519 BC), indicating the importance of prophetic revelation in time."
    },
    {
      "pk": 290108,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 8,
      "text": "I had a vision in the night, and behold, a man was riding a red horse and stood among the myrtle trees in the hollow. Behind him were red, sorrel, and white horses.",
      "links": "<a href='/AIV/38/6/1-8'>Zechariah 6:1-8</a>; <a href='/AIV/26/1/10'>Ezekiel 1:10</a>",
      "comment": "Prophetic symbolism: horses often represent God’s agents throughout the earth. The colors likely signify vigilance, judgment, and peace."
    },
    {
      "pk": 290109,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 9,
      "text": "Then I asked, ‘My lord, what are these?’ And the angel who spoke with me said, ‘I will show you what they are.’",
      "links": "<a href='/AIV/38/4/4'>Zechariah 4:4</a>",
      "comment": "Zechariah’s dialogue with the interpreting angel models the humility of seeking understanding in God’s mysteries."
    },
    {
      "pk": 290110,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 10,
      "text": "And the man standing among the myrtle trees answered, ‘These are the ones whom the LORD has sent to walk throughout the earth.’",
      "links": "<a href='/AIV/38/6/5-7'>Zechariah 6:5-7</a>; <a href='/AIV/18/1/7'>Job 1:7</a>",
      "comment": "These messengers (possibly angels) symbolize God's omniscient oversight throughout the world, an idea further developed in later prophetic visions."
    },
    {
      "pk": 290111,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 11,
      "text": "And they reported to the angel of the LORD who stood among the myrtle trees, ‘We have patrolled the earth, and behold, all the earth is at rest and quiet.’",
      "links": "<a href='/AIV/24/47/6'>Jeremiah 47:6</a>; <a href='/AIV/38/6/7'>Zechariah 6:7</a>",
      "comment": "Earthly peace may not always align with God’s purposes; here, Israel is oppressed despite the calm elsewhere."
    },
    {
      "pk": 290112,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 12,
      "text": "Then the angel of the LORD said, ‘O LORD of armies, how long will You have no mercy on Jerusalem and the cities of Judah, against which You have been angry these seventy years?’",
      "links": "<a href='/AIV/24/25/11-12'>Jeremiah 25:11-12</a>; <a href='/AIV/19/79/5'>Psalm 79:5</a>",
      "comment": "The seventy years refers to the exile predicted by Jeremiah. The angel’s intercession highlights the heavenly intercession for God’s people."
    },
    {
      "pk": 290113,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 13,
      "text": "And the LORD answered the angel who spoke with me with good and comforting words.",
      "links": "<a href='/AIV/23/40/1-2'>Isaiah 40:1-2</a>",
      "comment": "God’s reply reassures restoration and mercy, fulfilling His promise of comfort to His people after judgment."
    },
    {
      "pk": 290114,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 14,
      "text": "So the angel who spoke with me said to me, ‘Proclaim, saying: “This is what the LORD of armies says: I am exceedingly jealous for Jerusalem and for Zion.”’",
      "links": "<a href='/AIV/32/2/18'>Joel 2:18</a>; <a href='/AIV/26/39/25'>Ezekiel 39:25</a>",
      "comment": "God’s intense zeal for His people points to His special love and care for them—an anticipation of the enduring community chosen by God."
    },
    {
      "pk": 290115,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 15,
      "text": "And I am greatly angry with the nations who are at ease; for while I was only slightly angry, they added to the calamity.",
      "links": "<a href='/AIV/23/47/6'>Isaiah 47:6</a>; <a href='/AIV/19/123/3-4'>Psalm 123:3-4</a>",
      "comment": "The nations exceeded their bounds in afflicting Israel, showing God’s justice against those who oppress His people."
    },
    {
      "pk": 290116,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 16,
      "text": "Therefore, this is what the LORD says: ‘I will return to Jerusalem with mercy. My house shall be built in it, declares the LORD of armies, and a measuring line shall be stretched out over Jerusalem.’",
      "links": "<a href='/AIV/37/2/18-19'>Haggai 2:18-19</a>; <a href='/AIV/26/40/3'>Ezekiel 40:3</a>",
      "comment": "Promise of restoration and rebuilding the temple. Symbolically, the reestablishment of worship is central to God’s plan—foreshadowing the New Testament emphasis on the perpetual worship community (see <a href='/AIV/40/16/18'>Matthew 16:18</a>)."
    },
    {
      "pk": 290117,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 17,
      "text": "‘Proclaim again, saying: “This is what the LORD of armies says: My cities shall again overflow with prosperity, and the LORD will again comfort Zion and will again choose Jerusalem.”’",
      "links": "<a href='/AIV/23/51/3'>Isaiah 51:3</a>; <a href='/AIV/19/102/13-16'>Psalm 102:13-16</a>",
      "comment": "A promise not just of material restoration, but of God's election (choice) of Jerusalem—echoing themes of divine selection and comfort. Interpretations see a spiritual fulfillment in the continued gathering of a unified people of God."
    },
    {
      "pk": 290118,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 18,
      "text": "Then I looked up and saw four horns.",
      "links": "<a href='/AIV/27/7/7'>Daniel 7:7</a>; <a href='/AIV/38/2/1'>Zechariah 2:1</a>",
      "comment": "Horns symbolize power and kingdoms that oppress Israel. Similar imagery occurs in Daniel’s visions."
    },
    {
      "pk": 290119,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 19,
      "text": "I asked the angel who was speaking with me, ‘What are these?’ And he answered me, ‘These are the horns that scattered Judah, Israel, and Jerusalem.’",
      "links": "<a href='/AIV/38/1/21'>Zechariah 1:21</a>; <a href='/AIV/27/8/20-22'>Daniel 8:20-22</a>",
      "comment": "Refers to world powers who dispersed God’s people: commonly interpreted as Babylon, Persia, Greece, and Rome."
    },
    {
      "pk": 290120,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 20,
      "text": "Then the LORD showed me four craftsmen.",
      "links": "<a href='/AIV/38/1/21'>Zechariah 1:21</a>",
      "comment": "Craftsmen are agents of God’s justice, sent to overthrow the oppressive horns. Points towards God’s sovereign intervention through chosen instruments."
    },
    {
      "pk": 290121,
      "translation": "AIV",
      "book": 38,
      "chapter": 1,
      "verse": 21,
      "text": "And I said, ‘What are these coming to do?’ He answered, ‘These are coming to terrify them, to throw down the horns of the nations that lifted up their horn against the land of Judah to scatter it.’",
      "links": "<a href='/AIV/19/75/10'>Psalm 75:10</a>; <a href='/AIV/27/2/44'>Daniel 2:44</a>",
      "comment": "God’s chosen instruments oppose the forces scattering His people. The gradual triumph of God’s plan unfolds through divinely appointed agents. The repeated affirmation of restoration and judgment hints at both physical and spiritual renewal, anticipating the ultimate unification of God’s people under His Messiah (<a href='/AIV/42/1/68-75'>Luke 1:68-75</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:37:17.346Z"
}