{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 10,
  "verses": [
    {
      "pk": 950100,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 1,
      "text": "Ask the LORD for rain in the time of the spring rain—He is the one who makes storm clouds, who gives showers of rain, and plants in the field to everyone.",
      "links": "<a href='/AIV/19/135/7'>Ps. 135:7</a>; <a href='/AIV/18/38/25-28'>Job 38:25-28</a>",
      "comment": "This verse stresses God's sovereignty in providing daily needs, especially rain for crops. Trusting God’s providence is central to true worship. The call to prayer here not only demonstrates God's responsiveness, but subtly aligns with trusting mediators, as seen in spiritual traditions that emphasize intercessory prayer."
    },
    {
      "pk": 950101,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 2,
      "text": "For the household idols speak deceit, and the diviners see lies; they tell false dreams and give empty comfort. So the people wander like sheep; they are afflicted because there is no shepherd.",
      "links": "<a href='/AIV/26/34/5'>Ezek. 34:5</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "False religion cannot provide true guidance. The reference to sheep without a shepherd is picked up by Jesus in the New Testament, emphasizing His role as the Good Shepherd. This also hints at the need for spiritual authority and unity under a divinely appointed leader."
    },
    {
      "pk": 950102,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 3,
      "text": "My anger is kindled against the shepherds, and I will punish the leaders. For the LORD of hosts cares for His flock, the house of Judah, and will make them like His majestic horse in battle.",
      "links": "<a href='/AIV/26/34/10'>Ezek. 34:10</a>; <a href='/AIV/38/9/13-16'>Zech. 9:13-16</a>",
      "comment": "God holds leaders accountable, and replaces faithless shepherds with His own guidance. This foreshadows the gathering of all believers under one authority established by God, reinforcing the importance of sacramental leadership."
    },
    {
      "pk": 950103,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 4,
      "text": "From Judah will come the cornerstone, from him the tent peg, from him the bow of battle, from him every ruler together.",
      "links": "<a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>; <a href='/AIV/60/2/6'>1 Pet. 2:6</a>",
      "comment": "The cornerstone is a messianic prophecy pointing to Christ (see Psalm 118 and later gospel references). The tent peg and battle bow imagery speak to authority and strength, which later are seen fulfilled in Jesus and His establishment of the unified Church."
    },
    {
      "pk": 950104,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 5,
      "text": "Together they shall be like mighty men, trampling down enemies in the streets of battle; they shall fight because the LORD is with them, and they will put to shame the riders on horses.",
      "links": "<a href='/AIV/19/118/10-12'>Ps. 118:10-12</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "God empowers His people to triumph. Spiritual warfare and victory are achieved through God's presence rather than human strength, prefiguring the Church’s spiritual victories through divine grace."
    },
    {
      "pk": 950105,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 6,
      "text": "I will strengthen the house of Judah, and save the house of Joseph. I will bring them back because I have compassion on them; and they shall be as though I had not rejected them, for I am the LORD their God and I will answer them.",
      "links": "<a href='/AIV/24/30/3'>Jer. 30:3</a>; <a href='/AIV/45/11/26'>Rom. 11:26</a>",
      "comment": "Reunification and restoration point to God’s mercy, a theme fulfilled spiritually when all believers are united. This prefigures both the restoration of Israel and the spiritual ingathering of all believers into one body."
    },
    {
      "pk": 950106,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 7,
      "text": "Ephraim shall become like a warrior, and their hearts shall rejoice as with wine; their children shall see and rejoice, their hearts shall exult in the LORD.",
      "links": "<a href='/AIV/19/16/9'>Ps. 16:9</a>; <a href='/AIV/23/35/10'>Isa. 35:10</a>",
      "comment": "Joy and strength in the Lord echo the gift of spiritual gladness. The reference to wine may remind readers of the New Covenant, as seen in Jesus’ use of wine at the Last Supper, spiritually nourishing His followers."
    },
    {
      "pk": 950107,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 8,
      "text": "I will whistle for them and gather them in, for I have redeemed them; and they shall be as numerous as they were before.",
      "links": "<a href='/AIV/23/43/5-6'>Isa. 43:5-6</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "Redemption language affirms God’s initiative in salvation and gathering His people—a theme fulfilled perfectly in Christ, who draws and gathers all into spiritual unity."
    },
    {
      "pk": 950108,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 9,
      "text": "Though I scatter them among the peoples, yet in distant lands they shall remember Me; and they shall survive with their children and return.",
      "links": "<a href='/AIV/24/31/10'>Jer. 31:10</a>; <a href='/AIV/26/11/16-17'>Ezek. 11:16-17</a>",
      "comment": "Even in dispersion, God’s presence is constant. The promise of return embraces both physical restoration and spiritual homecoming—pointing also to the enduring nature of faith, tradition, and sacramental life even when separated physically."
    },
    {
      "pk": 950109,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 10,
      "text": "I will bring them home from the land of Egypt and gather them from Assyria; I will bring them into the land of Gilead and Lebanon, and there will not be enough room for them.",
      "links": "<a href='/AIV/24/23/8'>Jer. 23:8</a>; <a href='/AIV/28/11/11'>Hos. 11:11</a>",
      "comment": "The grand ingathering from all nations hints at the universal call to salvation and belonging, just as the Church welcomes people from all backgrounds, fulfilling the prophecy of the nations being joined together under God."
    },
    {
      "pk": 950110,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 11,
      "text": "He shall pass through the sea of trouble and strike the waves of the sea; all the depths of the Nile shall dry up; the pride of Assyria will be humbled, and the scepter of Egypt will depart.",
      "links": "<a href='/AIV/02/14/21'>Ex. 14:21</a>; <a href='/AIV/23/19/5'>Isa. 19:5</a>",
      "comment": "Echoes of the Exodus signify God’s saving power and mastery over nations and obstacles, showing how deliverance is wrought through divine intervention—a theme later fulfilled by Christ, who conquers spiritual enemies."
    },
    {
      "pk": 950111,
      "translation": "AIV",
      "book": 38,
      "chapter": 10,
      "verse": 12,
      "text": "I will strengthen them in the LORD, and in His Name they shall walk, declares the LORD.",
      "links": "<a href='/AIV/23/40/31'>Isa. 40:31</a>; <a href='/AIV/19/89/16'>Ps. 89:16</a>",
      "comment": "Strength and identity come from abiding in God's Name—a key Old and New Testament theme. Walking in the Lord points to a sacramental and communal life, culminating ultimately in fellowship, worship and unity through both faith and practice."
    }
  ],
  "translatedAt": "2025-12-23T07:40:19.811Z"
}