{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 7,
  "verses": [
    {
      "pk": 1945700,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 1,
      "text": "In the fourth year of King Darius, the word of the LORD came to Zechariah, on the fourth day of the ninth month, which is Chislev.",
      "links": "<a href='/AIV/15/6/1'>Ezra 6:1</a>; <a href='/AIV/38/1/1'>Zech. 1:1</a>",
      "comment": "Zechariah precisely dates his prophecy, underscoring its historical authenticity and rootedness. The reference to King Darius connects with return-from-exile events described in Ezra."
    },
    {
      "pk": 1945701,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 2,
      "text": "The people of Bethel had sent Sharezer and Regem-Melech and their men to seek the favor of the LORD,",
      "links": "<a href='/AIV/38/8/18-19'>Zech. 8:18–19</a>",
      "comment": "Bethel, once a site of rival worship, is here depicted seeking the true God at the restored Temple. The act of seeking divine favor hints at the importance of intercessory prayer and approaching God through appointed ministers."
    },
    {
      "pk": 1945702,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 3,
      "text": "saying to the priests who were in the house of the LORD of Hosts, and to the prophets, 'Should I weep and fast in the fifth month, as I have done for so many years?'",
      "links": "<a href='/AIV/24/52/12-14'>Jer. 52:12–14</a>; <a href='/AIV/38/8/19'>Zech. 8:19</a>",
      "comment": "They ask about continuing a traditional fast commemorating Jerusalem's destruction. Notably, their inquiry is directed to both priests and prophets, affirming the continuing role of priestly authority and prophetic guidance within the community."
    },
    {
      "pk": 1945703,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 4,
      "text": "Then the word of the LORD of Hosts came to me:",
      "links": "<a href='/AIV/38/7/8'>Zech. 7:8</a>",
      "comment": "This phrase signals a direct, divinely inspired message, reinforcing Zechariah's prophetic authenticity. Compare with previous revelations in this book."
    },
    {
      "pk": 1945704,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 5,
      "text": "Speak to all the people of the land and to the priests, saying, 'When you fasted and mourned in the fifth and seventh months, for seventy years, did you really fast for me? For me?'",
      "links": "<a href='/AIV/23/58/3-6'>Isa. 58:3–6</a>; <a href='/AIV/38/1/12'>Zech. 1:12</a>",
      "comment": "This verse exposes the danger of empty ritual. The repetition, 'for me? For me?' emphasizes God's desire for sincere worship over mere external observance. See Isaiah 58 for a parallel critique."
    },
    {
      "pk": 1945705,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 6,
      "text": "And when you eat and when you drink, are you not eating and drinking for yourselves?",
      "links": "<a href='/AIV/46/11/20-22'>1 Cor. 11:20–22</a>",
      "comment": "Self-indulgent worship is condemned. The problem is not merely ritual, but a lack of interior transformation – something echoed in Paul’s instructions about worthy participation in sacred meals."
    },
    {
      "pk": 1945706,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 7,
      "text": "Are these not the words that the LORD proclaimed by the former prophets, when Jerusalem was inhabited and prosperous, with her surrounding cities, and the Negev and the lowland were inhabited?'",
      "links": "<a href='/AIV/24/7/5-7'>Jer. 7:5–7</a>; <a href='/AIV/23/1/10-17'>Isa. 1:10–17</a>",
      "comment": "God recalls prior prophetic warnings, suggesting a continuity of teaching and revelation across generations. Spiritual fruitfulness arises from obedience, not mere location or ritual."
    },
    {
      "pk": 1945707,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 8,
      "text": "Then the word of the LORD came to Zechariah, saying:",
      "links": "<a href='/AIV/38/7/4'>Zech. 7:4</a>",
      "comment": "A second oracle follows, showing how God continues to instruct his people in stages, through chosen messengers."
    },
    {
      "pk": 1945708,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 9,
      "text": "Thus says the LORD of Hosts: 'Judge truly, show mercy and compassion to each other;",
      "links": "<a href='/AIV/33/6/8'>Mic. 6:8</a>; <a href='/AIV/23/58/6-7'>Isa. 58:6–7</a>",
      "comment": "God’s repeated call is for justice and mercy, echoing Micah 6:8 and the moral core of the law. True worship involves both inner and outward transformation, as supported by the entirety of salvation history."
    },
    {
      "pk": 1945709,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 10,
      "text": "Do not oppress the widow, the orphan, the foreigner, or the poor, and do not plot evil against one another in your hearts.'",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/05/10/18'>Deut. 10:18</a>; <a href='/AIV/59/1/27'>Jas. 1:27</a>",
      "comment": "God’s concern for the vulnerable is constant, showing a continuity of revelation that the faith expresses in its teachings on charity and social justice. ‘Heart’ focus prefigures the interior renewal completed in Christ."
    },
    {
      "pk": 1945710,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 11,
      "text": "But they refused to pay attention, and stubbornly turned their backs and stopped their ears from hearing.",
      "links": "<a href='/AIV/02/32/9'>Ex. 32:9</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "This vivid imagery illustrates the danger of obstinacy before God's voice. Compare to Stephen's charge to the religious leaders in Acts, showing the persistence of spiritual resistance."
    },
    {
      "pk": 1945711,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 12,
      "text": "They made their hearts as hard as diamond, so as not to hear the law and the words that the LORD of Hosts had sent by his Spirit through the former prophets. Therefore great wrath came from the LORD of Hosts.",
      "links": "<a href='/AIV/26/3/7-9'>Ezek. 3:7–9</a>; <a href='/AIV/38/1/6'>Zech. 1:6</a>",
      "comment": "‘His Spirit through the former prophets’ highlights divine inspiration. Hardness of heart against God’s revealed law invites justice, further illustrating the necessity of docility before authentic teaching."
    },
    {
      "pk": 1945712,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 13,
      "text": "So just as he called and they would not listen, so they called and I would not listen,' says the LORD of Hosts.",
      "links": "<a href='/AIV/19/18/41'>Ps. 18:41</a>; <a href='/AIV/20/1/24-28'>Prov. 1:24–28</a>",
      "comment": "Divine response matches human rejection. God’s relational covenant requires free response; when refused, even prayer loses its efficacy—anticipating the New Testament's teachings on faith and obedience."
    },
    {
      "pk": 1945713,
      "translation": "AIV",
      "book": 38,
      "chapter": 7,
      "verse": 14,
      "text": "I scattered them with a whirlwind among all the nations that they did not know. The land was left desolate behind them so that no one passed through or returned; thus they made the pleasant land a ruin.",
      "links": "<a href='/AIV/26/12/15'>Ezek. 12:15</a>; <a href='/AIV/05/28/64'>Deut. 28:64</a>",
      "comment": "God’s judgment results in exile and desolation, as predicted for covenant disobedience. This prepares for restoration through new obedience and the coming of the Messiah. Spiritually, it calls attention to the effects of separation from grace and the mercy available upon true return."
    }
  ],
  "translatedAt": "2025-12-23T07:39:04.163Z"
}