{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 12,
  "verses": [
    {
      "pk": 6012001,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 1,
      "text": "The declaration of the word of the Lord concerning Israel: The Lord, who stretches out the heavens, lays the foundation of the earth, and forms the spirit of man within him, speaks.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/01/2/7'>Gen. 2:7</a>",
      "comment": "God is introduced as Creator and Sustainer, echoing Genesis 1:1 and 2:7. This establishes His authority to speak concerning Israel and man."
    },
    {
      "pk": 6012002,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 2,
      "text": "See, I am making Jerusalem a cup of trembling for all the surrounding peoples. When the siege comes against Jerusalem, it will also be against Judah.",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/26/23/33'>Ezek. 23:33</a>",
      "comment": "Jerusalem is depicted as a source of judgment for its enemies, reminiscent of the cup imagery in Isaiah and Ezekiel, which often symbolizes divine wrath."
    },
    {
      "pk": 6012003,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 3,
      "text": "On that day, I will make Jerusalem a heavy stone for all peoples. All who try to lift it will injure themselves. And all the nations of the earth will gather against it.",
      "links": "<a href='/AIV/19/2/2-3'>Ps. 2:2–3</a>; <a href='/AIV/38/14/2'>Zech. 14:2</a>",
      "comment": "This prophecy finds parallels in Psalm 2, which speaks of nations conspiring against God's chosen; Zechariah points to a climactic event involving all nations."
    },
    {
      "pk": 6012004,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 4,
      "text": "On that day, says the Lord, I will strike every horse in confusion and every rider with madness. But on the house of Judah, I will keep my eyes open, and I will strike every horse of the peoples with blindness.",
      "links": "<a href='/AIV/02/14/24-25'>Ex. 14:24–25</a>",
      "comment": "The Lord's intervention recalls how He protected Israel during the Exodus and confused their enemies, signifying active divine protection."
    },
    {
      "pk": 6012005,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 5,
      "text": "Then the leaders of Judah will say in their hearts, ‘The people of Jerusalem are my strength, through the Lord of hosts, their God.’",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "Judah’s leaders recognize that strength comes not from themselves, but from God dwelling among His people—echoing Psalm 46:1’s affirmation of God as refuge."
    },
    {
      "pk": 6012006,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 6,
      "text": "On that day I will make the leaders of Judah like a blazing pot among wood, like a flaming torch among sheaves. And they will devour all the surrounding peoples, to the right and left, while Jerusalem will again be inhabited where it stands.",
      "links": "<a href='/AIV/07/15/4-5'>Judg. 15:4–5</a>; <a href='/AIV/23/10/17'>Isa. 10:17</a>",
      "comment": "The imagery of fire consuming sheaves evokes Samson and Isaiah, signifying powerful victory for God's people fueled by His own presence."
    },
    {
      "pk": 6012007,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 7,
      "text": "The Lord will save the tents of Judah first, so that the honor of the house of David and of Jerusalem’s inhabitants may not be greater than that of Judah.",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>; <a href='/AIV/19/132/11'>Ps. 132:11</a>",
      "comment": "God’s saving order gives dignity to all, and establishes the primacy of David’s line for messianic fulfillment (cf. Zech 9:9, Ps 132:11), signifying an ordered structure of God's people."
    },
    {
      "pk": 6012008,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 8,
      "text": "On that day the Lord will defend the people of Jerusalem, and the weakest among them will be like David, and the house of David will be like God, like the messenger of the Lord before them.",
      "links": "<a href='/AIV/10/8/6'>2 Sam. 8:6</a>; <a href='/AIV/02/23/20'>Ex. 23:20</a>",
      "comment": "The reference to the house of David being 'like God' and 'the angel of the Lord' is uniquely high and points to a messianic expectation, possibly fulfilled in Christ."
    },
    {
      "pk": 6012009,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 9,
      "text": "On that day, I will seek to destroy all the nations that attack Jerusalem.",
      "links": "<a href='/AIV/38/14/2-3'>Zech. 14:2–3</a>",
      "comment": "God’s judgment against attacking nations links to Zechariah 14 and serves as assurance of final victory for His people."
    },
    {
      "pk": 6012010,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 10,
      "text": "Then I will pour out a spirit of grace and supplication on the house of David and the inhabitants of Jerusalem. They will look on me, whom they have pierced, and mourn for him as one mourns for an only son; they will weep bitterly for him, as for a firstborn.",
      "links": "<a href='/AIV/43/19/37'>John 19:37</a>; <a href='/AIV/04/20/16'>Num. 20:16</a>; <a href='/AIV/23/53/5'>Isa. 53:5</a>",
      "comment": "This profound prophecy is cited in John 19:37 and is strongly messianic. 'Pierced' points directly to the crucifixion of Jesus, foreshadowing both physical and spiritual mourning for the Messiah—hinting at both physical suffering and a need for repentance and connection with the suffering one."
    },
    {
      "pk": 6012011,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 11,
      "text": "On that day there will be great mourning in Jerusalem, like the mourning for Hadad-rimmon in the plain of Megiddo.",
      "links": "<a href='/AIV/12/23/29'>2 Chr. 35:24–25</a>; <a href='/AIV/19/116/15'>Ps. 116:15</a>",
      "comment": "The mourning recalls King Josiah’s death (2 Chr. 35), symbolizing deep grief for a righteous leader and paralleling mourning for the suffering servant."
    },
    {
      "pk": 6012012,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 12,
      "text": "And the land will mourn, each family by itself: the family of the house of David by itself, and their wives by themselves; the family of the house of Nathan by itself, and their wives by themselves;",
      "links": "<a href='/AIV/10/5/14'>2 Sam. 5:14</a>; <a href='/AIV/42/3/31'>Luke 3:31</a>",
      "comment": "The listing of specific families (David and Nathan) links both the royal line and prophetic heritage, with emphasis on personal and communal repentance."
    },
    {
      "pk": 6012013,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 13,
      "text": "the family of the house of Levi by itself, and their wives by themselves; the family of the Shimeites by itself, and their wives by themselves;",
      "links": "<a href='/AIV/04/3/17'>Num. 3:17</a>; <a href='/AIV/04/3/21'>Num. 3:21</a>",
      "comment": "Levi represents priestly mediation, and the Shimeites priestly service. The individual mourning points to the necessity of both priest and lay repentance—hinting at an ordered, communal and liturgical spirituality."
    },
    {
      "pk": 6012014,
      "translation": "AIV",
      "book": 38,
      "chapter": 12,
      "verse": 14,
      "text": "all the families that remain, each family by itself, and their wives by themselves.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Universal mourning and repentance are portrayed, underscoring the need for heartfelt contrition and open acknowledgment of sin, a theme carried through Scripture and fulfilled in the need for spiritual renewal."
    }
  ],
  "translatedAt": "2025-12-23T07:40:57.984Z"
}