{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 12,
  "verses": [
    {
      "pk": 45012001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 1,
      "text": "The oracle of the word of the Lord about Israel: Thus says the Lord, who stretches out the heavens, lays the foundation of the earth, and forms the spirit of man within him:",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/23/42/5'>Isa. 42:5</a>; <a href='/AIV/18/33/4'>Job 33:4</a>",
      "comment": "This introduction emphasizes God's sovereignty as Creator of all things, including the spirit of humanity itself. The phrasing closely follows the Hebrew, setting the stage for the divine revelation to Israel. Note the personal involvement of God in both cosmic creation and the spirit within man, a subtle foreshadowing of later teachings about the indwelling of the Spirit (see <a href='/AIV/43/14/17'>John 14:17</a>)."
    },
    {
      "pk": 45012002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 2,
      "text": "Behold, I am making Jerusalem a cup of staggering for all the surrounding peoples. And it will be against Judah also, during the siege against Jerusalem.",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/19/75/8'>Ps. 75:8</a>",
      "comment": "Jerusalem is portrayed as both a source of judgment and confusion for the nations, using the image of a 'cup of staggering' (drunkenness), echoing Isaiah and Psalms. This looks ahead to God's mysterious plan for salvation, where the very place of judgment becomes the place of redemption (<a href='/AIV/40/27/33'>Matt. 27:33</a> - Calvary as the place of the cross)."
    },
    {
      "pk": 45012003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 3,
      "text": "On that day I will make Jerusalem a heavy stone for all the peoples. All who try to lift it will surely hurt themselves. And all the nations of the earth will gather against it.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/66/16/14'>Rev. 16:14</a>",
      "comment": "Jerusalem as an immovable stone represents both its chosen status and the futility of opposing God's plan. 'All the nations' echoes apocalyptic images found in Revelation, pointing to ongoing conflict but ultimately, the vindication of the city where God has chosen to dwell among His people."
    },
    {
      "pk": 45012004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 4,
      "text": "On that day, declares the Lord, I will strike every horse with panic and its rider with madness. But on the house of Judah I will open my eyes, while I strike every horse of the peoples with blindness.",
      "links": "<a href='/AIV/28/1/7'>Hos. 1:7</a>",
      "comment": "'Horse' and 'rider' represent military power. God both confounds the enemies and protects Judah, an act of spiritual deliverance and providence. The phrase 'I will open my eyes' signals God's special protection and guidance for His people, reinforcing the theme of divine election and watchfulness."
    },
    {
      "pk": 45012005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 5,
      "text": "Then the clans of Judah will say in their hearts, 'The people of Jerusalem are my strength in the Lord of hosts, their God.'",
      "links": "<a href='/AIV/19/84/7'>Ps. 84:7</a>; <a href='/AIV/24/50/34'>Jer. 50:34</a>",
      "comment": "The unity between Judah and Jerusalem under God is emphasized. Strength comes not from human might but from the Lord's presence among His chosen people—a truth fulfilled through Christ and in His gathered people."
    },
    {
      "pk": 45012006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 6,
      "text": "On that day I will make the clans of Judah like a firepot in a woodpile, and like a flaming torch among sheaves. They will devour to the right and to the left all the surrounding peoples, while Jerusalem will again be inhabited in her own place, in Jerusalem.",
      "links": "<a href='/AIV/23/10/17'>Isa. 10:17</a>",
      "comment": "The imagery of fire conveys judgment and purification. Jerusalem is promised restoration and continuance at its proper location, prefiguring the Church established to abide securely by God's decree (<a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 45012007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 7,
      "text": "And the Lord will save the tents of Judah first, so that the glory of the house of David and the glory of the inhabitants of Jerusalem may not be greater than that of Judah.",
      "links": "<a href='/AIV/36/3/19'>Zeph. 3:19</a>",
      "comment": "God's salvation comes first to the humble and lowly ('tents'), not just the royal or prominent. This foreshadows the reversal of expectations in the New Covenant, where humility is exalted (<a href='/AIV/42/1/52'>Luke 1:52-53</a> - Magnificat)."
    },
    {
      "pk": 45012008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 8,
      "text": "On that day the Lord will defend the inhabitants of Jerusalem, so that the weakest among them on that day will be like David, and the house of David will be like God, like the angel of the Lord going before them.",
      "links": "<a href='/AIV/2/14/19'>Ex. 14:19</a>; <a href='/AIV/9/15/9'>1 Sam. 15:9</a>",
      "comment": "The promise that God's people will be empowered—'the weakest like David'—finds ultimate fulfillment in the outpouring of the Holy Spirit at Pentecost (<a href='/AIV/44/2/4'>Acts 2:4</a>). The reference to the house of David 'like the angel of the Lord' connects to the Messianic expectation of a King who mediates God's presence."
    },
    {
      "pk": 45012009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 9,
      "text": "And on that day I will set out to destroy all the nations that come against Jerusalem.",
      "links": "<a href='/AIV/26/38/22'>Ezek. 38:22</a>; <a href='/AIV/66/19/19'>Rev. 19:19-21</a>",
      "comment": "God's final victory over the nations who oppose His chosen city points to the eschatological hope of God's ultimate justice, as developed more fully in the apocalypse of John."
    },
    {
      "pk": 45012010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 10,
      "text": "And I will pour out on the house of David and the inhabitants of Jerusalem a spirit of grace and supplication, so that they will look upon me, on him whom they have pierced. They will mourn for him as one mourns for an only son, and weep bitterly over him as one weeps for a firstborn.",
      "links": "<a href='/AIV/43/19/37'>John 19:37</a>; <a href='/AIV/66/1/7'>Rev. 1:7</a>",
      "comment": "This verse is directly quoted in the New Testament as prophecy fulfilled in the crucifixion of Christ, who is the 'one they have pierced.' The outpouring of the Spirit leads to deep repentance—a pattern foundational for sacramental life and sincere conversion. The mourning for an only son reflects the unique, irreplaceable role of the Messiah."
    },
    {
      "pk": 45012011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 11,
      "text": "On that day the mourning in Jerusalem will be as great as the mourning for Hadad-rimmon in the plain of Megiddo.",
      "links": "<a href='/AIV/12/23/29'>2 Kings 23:29</a>",
      "comment": "The mourning at Megiddo recalls the death of King Josiah, a righteous leader, evoking the nation's grief at the loss of the promised deliverer. This sets the pattern for collective repentance, which prepares the way for restoration."
    },
    {
      "pk": 45012012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 12,
      "text": "The land will mourn, each family by itself: the family of the house of David by itself, and their wives by themselves; the family of the house of Nathan by itself, and their wives by themselves;",
      "links": "<a href='/AIV/10/5/14'>2 Sam. 5:14</a>; <a href='/AIV/42/3/31'>Luke 3:31</a>",
      "comment": "True repentance is personal and communal, not only national. Mention of the houses of David and Nathan ties both royal and prophetic lines—seen in Christ's genealogies (cf. <a href='/AIV/40/1/6'>Matt. 1:6</a>; <a href='/AIV/42/3/31'>Luke 3:31</a>)."
    },
    {
      "pk": 45012013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 13,
      "text": "the family of the house of Levi by itself, and their wives by themselves; the family of the Shimeites by itself, and their wives by themselves;",
      "links": "<a href='/AIV/4/3/17-18'>Num. 3:17-18</a>",
      "comment": "Priestly families are called to repentance, suggesting a necessary purification of both spiritual and civic leadership, anticipating the priesthood's fulfillment in the priestly ministry of Jesus (<a href='/AIV/58/4/14-16'>Heb. 4:14-16</a>)."
    },
    {
      "pk": 45012014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 12,
      "verse": 14,
      "text": "and all the rest of the families, each by itself, and their wives by themselves.",
      "links": "",
      "comment": "Universal mourning and repentance concludes the chapter, indicating the totality of God's call to conversion—every family, every person. The phrase sets up the promise of cleansing to follow in chapter 13, pointing toward a future when all God's people are purified, as St. Paul speaks of the Church as the Bride of Christ (<a href='/AIV/49/5/25-27'>Eph. 5:25-27</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:59:02.576Z"
}