{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 7,
  "verses": [
    {
      "pk": 45007001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 1,
      "text": "In the fourth year of King Darius, the word of the Lord came to Zechariah on the fourth day of the ninth month, which is Kislev.",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/45/1/1'>Zech. 1:1</a>",
      "comment": "This verse sets the precise historical context: Zechariah receives God’s word during the reign of Darius, emphasizing the continuity of prophetic revelation after the exile."
    },
    {
      "pk": 45007002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 2,
      "text": "Now the people of Bethel had sent Sharezer and Regem-Melech and their men to plead for the Lord’s favor,",
      "links": "<a href='/AIV/45/8/21'>Zech. 8:21</a>; <a href='/AIV/43/11/52'>Jn. 11:52</a>",
      "comment": "The sending of representatives to seek God's favor implies the value placed on intercession and communal prayer, pointing forward to later developments in corporate worship and seeking of God’s guidance."
    },
    {
      "pk": 45007003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 3,
      "text": "asking the priests of the house of the Lord of hosts and the prophets, 'Should I mourn and fast in the fifth month, as I have done for so many years?'",
      "links": "<a href='/AIV/24/52/12'>Jer. 52:12-13</a>; <a href='/AIV/38/58/3-5'>Isa. 58:3-5</a>",
      "comment": "The question about fasting shows concern for proper worship. Involving both priests and prophets reflects a structure of spiritual authority and discernment, anticipating the continued importance of sacred tradition."
    },
    {
      "pk": 45007004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 4,
      "text": "Then the word of the Lord of hosts came to me, saying:",
      "links": "<a href='/AIV/45/1/1'>Zech. 1:1</a>",
      "comment": "Zechariah receives direct revelation, affirming the ongoing role of prophets in God’s guidance. The phrase 'Lord of hosts' underlines God’s sovereignty over all creation."
    },
    {
      "pk": 45007005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 5,
      "text": "'Say to all the people of the land and to the priests, “When you fasted and mourned in the fifth and in the seventh month, these seventy years, was it truly for Me that you fasted?",
      "links": "<a href='/AIV/24/52/12'>Jer. 52:12</a>; <a href='/AIV/23/1/11-17'>Isa. 1:11-17</a>",
      "comment": "God questions the sincerity of their fasting, emphasizing that outward rituals are empty without inner devotion. The mention of 'seventy years' refers to the Babylonian exile (see <a href='/AIV/24/25/11-12'>Jer. 25:11-12</a>), foregrounding the importance of penitence and authentic worship."
    },
    {
      "pk": 45007006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 6,
      "text": "And when you ate and drank, were you not eating and drinking for yourselves?",
      "links": "<a href='/AIV/23/58/3-5'>Isa. 58:3-5</a>; <a href='/AIV/46/11/20-22'>1 Cor. 11:20-22</a>",
      "comment": "God makes clear that mere participation in religious activities is not enough if done selfishly. This foreshadows later teachings on the necessity of worshipping in spirit and truth (<a href='/AIV/43/4/23-24'>Jn. 4:23-24</a>)."
    },
    {
      "pk": 45007007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 7,
      "text": "Are these not the words which the Lord proclaimed through the former prophets, when Jerusalem was inhabited and prosperous, and its towns around her, and the Negev and the Shephelah were inhabited?'”",
      "links": "<a href='/AIV/23/1/10-17'>Isa. 1:10-17</a>; <a href='/AIV/24/7/5-7'>Jer. 7:5-7</a>",
      "comment": "God references past prophetic calls for true justice and mercy, not just ritual, grounding present obedience in the enduring tradition of faith. This connects to the continuity of divine revelation throughout both Old and New Testaments."
    },
    {
      "pk": 45007008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 8,
      "text": "And the word of the Lord came to Zechariah, saying:",
      "links": "<a href='/AIV/45/1/1'>Zech. 1:1</a>",
      "comment": "Another direct message from God further reinforces Zechariah’s authority as a true prophet, echoing the prophetic tradition."
    },
    {
      "pk": 45007009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 9,
      "text": "Thus says the Lord of hosts: 'Act with true justice, show kindness and mercy to one another;",
      "links": "<a href='/AIV/33/6/8'>Mic. 6:8</a>; <a href='/AIV/23/58/6-7'>Isa. 58:6-7</a>",
      "comment": "The Lord emphasizes justice, kindness, and mercy as fundamental. This anticipates Jesus’ later summation of the law (see <a href='/AIV/40/22/37-40'>Matt. 22:37-40</a>) and the call to love God and neighbor."
    },
    {
      "pk": 45007010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 10,
      "text": "and do not oppress the widow, the orphan, the foreigner, or the poor. Do not plot evil in your hearts against one another.'",
      "links": "<a href='/AIV/24/7/6'>Jer. 7:6</a>; <a href='/AIV/19/82/3'>Ps. 82:3</a>",
      "comment": "True religion requires just action, not just ritual. The repeated concern for society’s vulnerable is echoed consistently from Moses to the prophets, and notably continues in New Testament teaching (see <a href='/AIV/59/1/27'>Jas. 1:27</a>)."
    },
    {
      "pk": 45007011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 11,
      "text": "But they refused to pay attention and stubbornly turned their backs; they stopped up their ears so they would not hear.",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/44/7/51-52'>Acts 7:51-52</a>",
      "comment": "Israel’s past rebellion is described as hardheartedness and refusal to listen. This has spiritual implications about the necessity of yielding the heart and mind to God’s word, a principle essential in a living faith community."
    },
    {
      "pk": 45007012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 12,
      "text": "They made their hearts as hard as stone, so they could not hear the law or the words that the Lord of hosts had sent by his Spirit through the former prophets. Therefore great wrath came from the Lord of hosts.",
      "links": "<a href='/AIV/26/11/19'>Ezek. 11:19</a>; <a href='/AIV/58/3/7'>Heb. 3:7-8</a>",
      "comment": "A hardened heart resists the Spirit’s work. Notice ‘by his Spirit through the former prophets’—highlighting the Spirit’s ongoing role in transmitting divine truth, an important thread throughout all of God’s covenant dealings."
    },
    {
      "pk": 45007013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 13,
      "text": "'So just as I called and they would not listen, so they called, and I would not listen,' says the Lord of hosts.",
      "links": "<a href='/AIV/20/1/24-28'>Prov. 1:24-28</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "God’s discipline follows on their repeated refusal to listen: divine justice responds to the hardness of the heart. This principle is echoed in the New Testament parables about hearing and responding to the Word (cf. <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>)."
    },
    {
      "pk": 45007014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 7,
      "verse": 14,
      "text": "I scattered them with a whirlwind among all the nations they had not known. So the land was left desolate behind them, with no one going or returning, and they made the pleasant land a waste.”",
      "links": "<a href='/AIV/05/28/64'>Deut. 28:64</a>; <a href='/AIV/26/12/15'>Ezek. 12:15</a>",
      "comment": "This verse refers to God’s judgment in the exile as the direct result of persistent disobedience. The scattering among the nations connects with both literal history and a spiritual lesson: God’s people are called to faithfulness, kept in unity by the Spirit and truth."
    }
  ],
  "translatedAt": "2025-12-24T09:56:55.595Z"
}