{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 11,
  "verses": [
    {
      "pk": 2031101,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 1,
      "text": "Open your doors, Lebanon, so that fire may consume your cedars.",
      "links": "<a href='/AIV/23/2/13'>Isa. 2:13</a>; <a href='/AIV/26/17/3'>Ezek. 17:3</a>",
      "comment": "The opening command signals judgment upon Lebanon, represented by its famed cedar trees. Cedars often symbolize strength and pride, making this a call of divine judgment on the nations and their rulers."
    },
    {
      "pk": 2031102,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 2,
      "text": "Wail, cypress, for the cedar has fallen, because the glorious trees have been destroyed! Wail, oaks of Bashan, for the dense forest has been laid low.",
      "links": "<a href='/AIV/23/10/34'>Isa. 10:34</a>; <a href='/AIV/23/14/8'>Isa. 14:8</a>",
      "comment": "The destruction spreads from the mighty cedar to the cypress and oaks, signifying how judgment impacts all levels of society and leadership. Bashan was known for its strong trees, paralleling strong nations or leaders being humbled."
    },
    {
      "pk": 2031103,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 3,
      "text": "Hear the wail of the shepherds, for their glory is ruined. Hear the roar of young lions, for the thickets of the Jordan are devastated.",
      "links": "<a href='/AIV/24/25/36'>Jer. 25:36</a>; <a href='/AIV/24/49/19'>Jer. 49:19</a>",
      "comment": "Shepherds represent leaders of the people, and lions symbolize power and rulership. Their lament at the loss points to the consequences of poor stewardship and neglect of God's flock, a recurring theme in scripture."
    },
    {
      "pk": 2031104,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 4,
      "text": "Thus says the LORD my God: Shepherd the flock doomed for slaughter.",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/38/10/2'>Zech. 10:2</a>",
      "comment": "God commands Zechariah to take on the role of shepherd to a doomed flock, foreshadowing the rejected leadership culminating in the rejection of Christ the Good Shepherd (see <a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 2031105,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 5,
      "text": "Those who buy them slaughter them and go unpunished, and those who sell them say, 'Blessed be the LORD, for I have become rich!' Their own shepherds have no mercy on them.",
      "links": "<a href='/AIV/26/34/3'>Ezek. 34:3</a>; <a href='/AIV/24/12/1'>Jer. 12:1</a>",
      "comment": "The corrupt shepherds and merchants exploit the flock, revealing the spiritual bankruptcy of Israel's leaders. This anticipates Christ’s condemnation of such false shepherds (<a href='/AIV/40/23/13-36'>Matt. 23:13–36</a>)."
    },
    {
      "pk": 2031106,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 6,
      "text": "For I will no longer have pity on the inhabitants of the land, declares the LORD. Indeed, I will hand everyone over to his neighbor and to his king; they will strike the land, and I will not rescue them from their hands.",
      "links": "<a href='/AIV/24/13/14'>Jer. 13:14</a>; <a href='/AIV/26/7/4'>Ezek. 7:4</a>",
      "comment": "This is a pronouncement of the lifting of divine protection, resulting in internal chaos and oppression, as seen in the later Jewish wars and destruction of Jerusalem."
    },
    {
      "pk": 2031107,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 7,
      "text": "So I became the shepherd of the flock doomed for slaughter, especially the oppressed of the flock. I took two staffs; one I called Favor, and the other I called Union. I shepherded the flock.",
      "links": "<a href='/AIV/38/10/2'>Zech. 10:2</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "'Favor' and 'Union' represent God's grace and the unity of His people. Zechariah’s action as shepherd symbolically prefigures the true Shepherd’s redemptive mission and the later division among God's people."
    },
    {
      "pk": 2031108,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 8,
      "text": "In one month I destroyed the three shepherds, but my soul became impatient with them, and their souls also loathed me.",
      "links": "<a href='/AIV/26/34/7-10'>Ezek. 34:7–10</a>",
      "comment": "The 'three shepherds' may refer to different leadership groups (kings, priests, prophets). Their removal expresses the termination of corrupt leadership, paralleling Christ’s confrontations with religious authorities."
    },
    {
      "pk": 2031109,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 9,
      "text": "So I said, 'I will not shepherd you. What dies, let it die; what is destroyed, let it be destroyed; and let those who are left eat one another’s flesh.'",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>; <a href='/AIV/26/5/10'>Ezek. 5:10</a>",
      "comment": "The statement of abandoning the flock is both literal and prophetic, pointing to the consequences of rejecting God and the devastation in Jerusalem during siege (<a href='/AIV/25/4/10'>Lam. 4:10</a>)."
    },
    {
      "pk": 2031110,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 10,
      "text": "Then I took my staff Favor and broke it, annulling the covenant I had made with all the peoples.",
      "links": "<a href='/AIV/19/89/39'>Ps. 89:39</a>; <a href='/AIV/24/31/32'>Jer. 31:32</a>",
      "comment": "Breaking the staff 'Favor' represents the end of God’s protection and the old covenant, prefiguring a new and everlasting covenant established in Christ (<a href='/AIV/40/26/28'>Matt. 26:28</a>)."
    },
    {
      "pk": 2031111,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 11,
      "text": "So it was annulled that day, and the oppressed of the flock who were watching me knew that it was the word of the LORD.",
      "links": "<a href='/AIV/38/4/9'>Zech. 4:9</a>",
      "comment": "Those truly attentive recognized God's prophetic action in Zechariah. This foreshadows a remnant who are receptive to God's word, anticipating the faith and recognition of the faithful in the new covenant."
    },
    {
      "pk": 2031112,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 12,
      "text": "Then I said to them, 'If it seems good to you, give me my wages; but if not, keep them.' So they weighed out thirty pieces of silver as my wages.",
      "links": "<a href='/AIV/40/26/15'>Matt. 26:15</a>; <a href='/AIV/02/21/32'>Ex. 21:32</a>",
      "comment": "Thirty pieces of silver was the price of a slave, linking this with the betrayal of Christ by Judas (<a href='/AIV/40/27/3-10'>Matt. 27:3–10</a>). The symbolism highlights rejection of God's shepherd and fulfillment of messianic prophecy."
    },
    {
      "pk": 2031113,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 13,
      "text": "Then the LORD said to me, 'Throw it to the potter'—the magnificent price at which I was valued by them. So I took the thirty pieces of silver and threw them into the house of the LORD, to the potter.",
      "links": "<a href='/AIV/40/27/5-10'>Matt. 27:5–10</a>",
      "comment": "This action is directly referenced in Matthew regarding Judas. The potter, representing re-creation and sovereignty, alludes to God’s authority even over betrayal and rejection, shaping redemption from sin."
    },
    {
      "pk": 2031114,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 14,
      "text": "Then I broke my second staff, Union, annulling the brotherhood between Judah and Israel.",
      "links": "<a href='/AIV/11/12/16-24'>1 Kings 12:16–24</a>; <a href='/AIV/26/37/15-22'>Ezek. 37:15–22</a>",
      "comment": "Breaking 'Union' dissolves national unity, reflecting the divisions that plagued God's people. Spiritually, this anticipates God's design to reunite all through Christ and the one church established in Him."
    },
    {
      "pk": 2031115,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 15,
      "text": "And the LORD said to me, 'Take once more the equipment of a foolish shepherd.'",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>; <a href='/AIV/24/23/1-2'>Jer. 23:1–2</a>",
      "comment": "Zechariah is commanded to act out the part of a foolish shepherd, contrasting God’s true leadership with failed human leaders. This sets up messianic expectations of perfect guidance for the flock."
    },
    {
      "pk": 2031116,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 16,
      "text": "For behold, I am raising up a shepherd in the land who will not care for those who are perishing, nor seek the young, nor heal the injured, nor nourish the healthy, but will eat the flesh of the fat sheep and tear off their hooves.",
      "links": "<a href='/AIV/26/34/4'>Ezek. 34:4</a>",
      "comment": "Describes the coming of false shepherds who prey on God’s people. This parallels later spiritual leadership failures and underscores the need for the divinely appointed shepherd who cares sacrificially for his flock."
    },
    {
      "pk": 2031117,
      "translation": "AIV",
      "book": 38,
      "chapter": 11,
      "verse": 17,
      "text": "Woe to the worthless shepherd who abandons the flock! May the sword strike his arm and his right eye. His arm will become withered, and his right eye completely blinded.",
      "links": "<a href='/AIV/26/34/10'>Ezek. 34:10</a>; <a href='/AIV/19/37/17'>Ps. 37:17</a>",
      "comment": "The final curse shows judgment upon those who fail to truly shepherd God’s people, a warning about spiritual accountability. The imagery of withered strength and blindness parallels the spiritual consequences of rejecting God's true leadership through his chosen shepherd."
    }
  ],
  "translatedAt": "2025-12-23T07:40:39.059Z"
}