{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 8,
  "verses": [
    {
      "pk": 2008001,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 1,
      "text": "Then the word of the LORD of hosts came to me, saying:",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>",
      "comment": "God is again the initiator, speaking through His prophet. The repeated title 'LORD of hosts' emphasizes God's sovereign rule over all heavenly and earthly armies, highlighting His authority in restoring His people."
    },
    {
      "pk": 2008002,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 2,
      "text": "Thus says the LORD of hosts: I am greatly jealous for Zion, yes, I am burning with great fury for her.",
      "links": "<a href='/AIV/26/36/5'>Ezek. 36:5</a>; <a href='/AIV/38/1/14'>Zech. 1:14</a>",
      "comment": "God's jealousy speaks of His passionate covenant love, both longing for and protecting His people. This divine jealousy is a sign of steadfast love rather than human envy."
    },
    {
      "pk": 2008003,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 3,
      "text": "Thus says the LORD: I will return to Zion and dwell in the midst of Jerusalem. Jerusalem shall be called the City of Truth, and the mountain of the LORD of hosts, the Holy Mountain.",
      "links": "<a href='/AIV/36/3/15-17'>Zeph. 3:15–17</a>; <a href='/AIV/23/2/2-3'>Isa. 2:2–3</a>",
      "comment": "'I will return' points to God's real, enduring presence among His people, fulfilled spiritually in Christ and His Church (see John 1:14). The 'City of Truth' foreshadows the future new Jerusalem (Rev. 21:2), a place where God's truth dwells in fullness."
    },
    {
      "pk": 2008004,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 4,
      "text": "Thus says the LORD of hosts: Old men and old women shall again sit in the streets of Jerusalem, each with staff in hand because of their many days.",
      "links": "<a href='/AIV/23/65/20'>Isa. 65:20</a>",
      "comment": "This passage promises a reversal of Jerusalem's devastation, restoring peace and longevity. The image of old people in the streets is a symbol of complete security and blessing."
    },
    {
      "pk": 2008005,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 5,
      "text": "And the city streets shall be filled with boys and girls playing.",
      "links": "<a href='/AIV/24/30/18-19'>Jer. 30:18–19</a>",
      "comment": "Children playing in the streets reinforces the picture of restoration and peace, as secure communities allow the young and old to thrive freely. This foretells the fullness of life in God's kingdom."
    },
    {
      "pk": 2008006,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 6,
      "text": "Thus says the LORD of hosts: If this seems marvelous in the eyes of the remnant of this people in these days, should it also seem marvelous in My eyes? declares the LORD of hosts.",
      "links": "<a href='/AIV/10/7/19'>2 Sam. 7:19</a>",
      "comment": "God contrasts human limitation with His own power; what seems impossible to man is not impossible for God (see Matt. 19:26). God's plan for restoration surpasses human expectation."
    },
    {
      "pk": 2008007,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 7,
      "text": "Thus says the LORD of hosts: Behold, I will rescue My people from the east and from the west country.",
      "links": "<a href='/AIV/23/43/5-6'>Isa. 43:5–6</a>; <a href='/AIV/24/16/14-16'>Jer. 16:14–16</a>",
      "comment": "God's promise to gather His people from all points of the compass looks forward to the inclusion of all nations, fulfilled ultimately in the worldwide Church (see Luke 13:29)."
    },
    {
      "pk": 2008008,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 8,
      "text": "I will bring them and they shall dwell in the midst of Jerusalem. They shall be My people, and I will be their God, in faithfulness and righteousness.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>",
      "comment": "This verse repeats covenant language—God binds Himself to His people in faithfulness and righteousness. The ultimate fulfillment is in Christ, who brings Jew and Gentile together in one Body (Eph. 2:13–16)."
    },
    {
      "pk": 2008009,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 9,
      "text": "Thus says the LORD of hosts: Let your hands be strong, you who in these days hear these words from the mouths of the prophets who were present when the foundation of the house of the LORD of hosts was laid, that the temple might be built.",
      "links": "<a href='/AIV/37/2/4'>Hag. 2:4</a>; <a href='/AIV/38/4/6-9'>Zech. 4:6–9</a>",
      "comment": "An exhortation to perseverance in rebuilding the temple. Obedience to God's word—through the prophets—brings spiritual blessing and establishes the presence of God among His people, both physically with the temple and spiritually with His Church."
    },
    {
      "pk": 2008010,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 10,
      "text": "For before those days there was no wage for man nor was there any wage for beast; neither was there any peace from the adversary for whoever went out or came in, for I set every man one against another.",
      "links": "<a href='/AIV/15/4/4-5'>Ezra 4:4–5</a>; <a href='/AIV/37/1/6'>Hag. 1:6</a>",
      "comment": "This recalls the difficulties before the temple rebuild, both economic hardship and social turmoil—a result of turning away from God. God Himself allowed these troubles as a correction, demonstrating that blessing follows obedience."
    },
    {
      "pk": 2008011,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 11,
      "text": "But now I will not deal with the remnant of this people as in the former days, declares the LORD of hosts.",
      "links": "<a href='/AIV/23/65/18-19'>Isa. 65:18–19</a>",
      "comment": "A turning point: God’s relationship transitions from discipline to restoration, echoing the theme of new beginnings that will reach their fullness in the new covenant."
    },
    {
      "pk": 2008012,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 12,
      "text": "For there shall be peace: the vine shall yield its fruit, the land shall give its produce, and the heavens shall give their dew; and I will cause the remnant of this people to possess all these things.",
      "links": "<a href='/AIV/03/26/4'>Lev. 26:4</a>; <a href='/AIV/19/67/6'>Ps. 67:6</a>",
      "comment": "Peace and agricultural blessing are classic signs of God's favor, reflecting the blessings promised for covenant faithfulness in Deuteronomy 28. These material blessings also point to the spiritual abundance found in God's kingdom."
    },
    {
      "pk": 2008013,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 13,
      "text": "And it will come to pass that just as you were a curse among the nations, O house of Judah and house of Israel, so I will save you, and you shall become a blessing. Do not be afraid; let your hands be strong.",
      "links": "<a href='/AIV/01/12/2-3'>Gen. 12:2–3</a>; <a href='/AIV/23/19/24'>Isa. 19:24</a>",
      "comment": "God reverses Israel’s shame and scattering, making them a source of blessing to the nations, which finds ultimate expression in the coming of Christ and the spread of the Gospel (see Gal. 3:8–14)."
    },
    {
      "pk": 2008014,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 14,
      "text": "For thus says the LORD of hosts: Just as I purposed to bring disaster to you when your fathers provoked Me to wrath, says the LORD of hosts, and I did not relent,",
      "links": "<a href='/AIV/24/4/28'>Jer. 4:28</a>",
      "comment": "God’s faithfulness is found in both judgment and mercy. His resolve to discipline is matched by His resolve to restore, reflecting His unchanging nature."
    },
    {
      "pk": 2008015,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 15,
      "text": "so now I have resolved again in these days to do good to Jerusalem and to the house of Judah. Do not be afraid.",
      "links": "<a href='/AIV/23/40/1-2'>Isa. 40:1–2</a>",
      "comment": "After judgment comes God's purpose to do good, reinforcing the enduring hope for God’s people. Their restoration is dependent on God's faithfulness."
    },
    {
      "pk": 2008016,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 16,
      "text": "These are the things you must do: Speak the truth to one another; judge with truth and peaceful justice in your gates.",
      "links": "<a href='/AIV/03/19/11-18'>Lev. 19:11–18</a>; <a href='/AIV/49/4/25'>Eph. 4:25</a>",
      "comment": "God’s blessings call for moral response. Truthfulness and justice in the community are essential virtues, repeatedly emphasized throughout Scripture."
    },
    {
      "pk": 2008017,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 17,
      "text": "Do not plot evil in your hearts against your neighbor, and do not love a false oath, for all these are things that I hate, declares the LORD.",
      "links": "<a href='/AIV/19/15/2-3'>Ps. 15:2–3</a>; <a href='/AIV/40/5/33-37'>Matt. 5:33–37</a>",
      "comment": "God’s moral law is rooted in the heart’s intent, not merely outward conformity. Justice and honesty are required for true covenant life, later echoed in the teachings of Christ."
    },
    {
      "pk": 2008018,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 18,
      "text": "And the word of the LORD of hosts came to me, saying:",
      "links": "<a href='/AIV/38/8/1'>Zech. 8:1</a>",
      "comment": "Another prophetic word signals a new section of oracles, emphasizing God’s continued communication and direction."
    },
    {
      "pk": 2008019,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 19,
      "text": "Thus says the LORD of hosts: The fasts of the fourth, fifth, seventh, and tenth months shall become times of joy, gladness, and cheerful feasts for the house of Judah. Therefore love truth and peace.",
      "links": "<a href='/AIV/38/7/3-5'>Zech. 7:3–5</a>; <a href='/AIV/19/30/11'>Ps. 30:11</a>",
      "comment": "Penitential fasts remembering past tragedies will be transformed into joyful feasts, signifying God’s saving work. This prefigures the sacramental celebration of redemption and the gathering of God's redeemed people."
    },
    {
      "pk": 2008020,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 20,
      "text": "Thus says the LORD of hosts: Peoples shall yet come, even the inhabitants of many cities;",
      "links": "<a href='/AIV/23/2/3'>Isa. 2:3</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "The prophecy broadens, predicting a time when many nations will be drawn to the worship of the one true God. This foretells the Church’s universality and mission."
    },
    {
      "pk": 2008021,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 21,
      "text": "and the inhabitants of one city shall go to another, saying, 'Let us go at once to seek the favor of the LORD and to seek the LORD of hosts; I myself will go also.'",
      "links": "<a href='/AIV/19/122/1'>Ps. 122:1</a>",
      "comment": "There is a call to communal worship and evangelistic zeal—a spontaneous and wide response to God’s invitation. The universality here foreshadows the call for all to join in the worship of God."
    },
    {
      "pk": 2008022,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 22,
      "text": "Many peoples and strong nations shall come to seek the LORD of hosts in Jerusalem and to entreat the LORD’s favor.",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6–7</a>; <a href='/AIV/44/2/5-11'>Acts 2:5–11</a>",
      "comment": "Jerusalem becomes a focal point for God’s blessings among the nations, fulfilled spiritually as all nations are invited to the new Jerusalem—the Church, the Body of Christ (see Heb. 12:22–24)."
    },
    {
      "pk": 2008023,
      "translation": "AIV",
      "book": 38,
      "chapter": 8,
      "verse": 23,
      "text": "Thus says the LORD of hosts: In those days ten men from every language of the nations shall take firm hold of the robe of a Jew, saying, 'Let us go with you, for we have heard that God is with you.'",
      "links": "<a href='/AIV/23/2/3'>Isa. 2:3</a>; <a href='/AIV/41/5/27-28'>Mark 5:27–28</a>",
      "comment": "The image of Gentiles grasping the robe of a Jew is fulfilled as all nations are drawn to God's one chosen people through Christ—a prophecy of the worldwide unity under the one Church, guided by spiritual successors of the apostles."
    }
  ],
  "translatedAt": "2025-12-23T07:39:38.561Z"
}