{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 6,
  "verses": [
    {
      "pk": 396001,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 1,
      "text": "Then I looked up again and saw four chariots coming out from between two mountains, and the mountains were made of bronze.",
      "links": "<a href='/AIV/27/2/38'>Dan. 2:38</a>; <a href='/AIV/38/1/8'>Zech. 1:8-10</a>",
      "comment": "The four chariots symbolize heavenly powers or divine agents sent to execute God’s judgment and providence. The bronze mountains reflect unshakable strength and steadfastness. See also Daniel’s vision of kingdoms."
    },
    {
      "pk": 396002,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 2,
      "text": "The first chariot had red horses, the second chariot black horses,",
      "links": "<a href='/AIV/38/1/8'>Zech. 1:8</a>; <a href='/AIV/66/6/4'>Rev. 6:4-5</a>",
      "comment": "The colored horses link to Zechariah 1:8 and Revelation 6, representing divine missions—war, death, and authority—acting at God’s command."
    },
    {
      "pk": 396003,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 3,
      "text": "the third chariot white horses, and the fourth chariot dappled strong horses.",
      "links": "<a href='/AIV/66/6/2'>Rev. 6:2</a>",
      "comment": "White represents victory and purity, while dappled indicates a mix of judgment and mercy. The symbolism ties to the four horsemen of the Apocalypse, foreshadowing themes of judgment and salvation."
    },
    {
      "pk": 396004,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 4,
      "text": "Then I asked the angel who was speaking with me, 'What are these, my lord?'",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>",
      "comment": "Zechariah seeks interpretation, echoing the pattern of other prophetic visions, emphasizing the need for spiritual guidance to comprehend God’s mysteries."
    },
    {
      "pk": 396005,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 5,
      "text": "The angel replied, 'These are the four spirits of heaven, who go out from standing before the Lord of all the earth.'",
      "links": "<a href='/AIV/38/4/10'>Zech. 4:10</a>; <a href='/AIV/18/1/6'>Job 1:6</a>",
      "comment": "\"Spirits of heaven\" signifies angelic beings or divine forces. Serving before the Lord echoes liturgical imagery, connecting heaven’s worship with God’s sovereign action in the world."
    },
    {
      "pk": 396006,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 6,
      "text": "The chariot with the black horses goes toward the north country, the white go after them, and the dappled go toward the south country.",
      "links": "<a href='/AIV/24/1/14-15'>Jer. 1:14-15</a>",
      "comment": "The horses’ directions correspond with regions of Israel’s foes (Babylon to the north, Egypt to the south), indicating God’s universal judgment and care."
    },
    {
      "pk": 396007,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 7,
      "text": "When the strong horses went out, they were eager to patrol the earth, and He said, 'Go, patrol the earth!' So they patrolled the earth.",
      "links": "<a href='/AIV/38/1/10-11'>Zech. 1:10-11</a>",
      "comment": "The divine agents’ eagerness shows their obedience and the immediacy of God’s work in history. All creation is under divine watchfulness."
    },
    {
      "pk": 396008,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 8,
      "text": "Then He called to me, 'See, those who go to the north country have brought my Spirit rest upon the north country.'",
      "links": "<a href='/AIV/23/30/15'>Isa. 30:15</a>",
      "comment": "God’s Spirit bringing rest indicates both judgment is accomplished (Babylon punished) and restoration for Israel. The work of the Spirit is central to renewal—foreshadowing Pentecost."
    },
    {
      "pk": 396009,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 9,
      "text": "The word of the Lord came to me, saying,",
      "links": "",
      "comment": "A new oracle begins, marking a transition to a symbolic action involving the crowning of Joshua."
    },
    {
      "pk": 396010,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 10,
      "text": "‘Take from the exiles Heldai, Tobijah, and Jedaiah, who have come from Babylon. Go the same day and enter the house of Josiah son of Zephaniah.’",
      "links": "<a href='/AIV/38/6/14'>Zech. 6:14</a>",
      "comment": "The exiles' gifts mirror the role of the faithful remnant in God’s plan, prefiguring the Gentiles’ offering in the new covenant era."
    },
    {
      "pk": 396011,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 11,
      "text": "Take silver and gold, and make a crown, and set it on the head of Joshua son of Jehozadak, the high priest.",
      "links": "<a href='/AIV/38/3/1'>Zech. 3:1</a>; <a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Crowning the priest unites priestly and kingly roles, anticipating a Messiah who is both King and Priest (see Hebrews 7:17, Psalm 110:4); a strong foreshadowing of Christ’s dual office."
    },
    {
      "pk": 396012,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 12,
      "text": "Say to him, ‘This is what the Lord of armies says: Behold, a man whose name is Branch, and he shall branch out from his place, and he will build the temple of the Lord.’",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/24/23/5'>Jer. 23:5</a>; <a href='/AIV/38/3/8'>Zech. 3:8</a>",
      "comment": "The 'Branch' is a messianic title (cf. Isa. 11:1, Jer. 23:5), pointing forward to Christ as the new temple-builder and fulfillment of all prophecy (John 2:21)."
    },
    {
      "pk": 396013,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 13,
      "text": "He shall build the temple of the Lord, and will bear royal honor, and will sit and rule on his throne. There will also be a priest on his throne, and the two of them will be at peace with each other.’",
      "links": "<a href='/AIV/19/110/1-4'>Ps. 110:1-4</a>; <a href='/AIV/58/7/24-27'>Heb. 7:24-27</a>",
      "comment": "Messiah’s union of priestly and kingly roles is fulfilled in Jesus (cf. Heb. 7). The peace between priest and king models the unity of worship and authority in God's kingdom."
    },
    {
      "pk": 396014,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 14,
      "text": "The crown will be in the temple of the Lord as a memorial to Heldai, Tobijah, Jedaiah, and Hen son of Zephaniah.",
      "links": "<a href='/AIV/2/28/12'>Ex. 28:12</a>",
      "comment": "The crown as a memorial establishes continuity and tradition in worship—reminders of God’s promises and the faithfulness of His people."
    },
    {
      "pk": 396015,
      "translation": "AIV",
      "book": 38,
      "chapter": 6,
      "verse": 15,
      "text": "Those who are far away will come and help to build the temple of the Lord. Then you will know that the Lord of armies has sent me to you. This will happen if you fully obey the voice of the Lord your God.'",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6-7</a>; <a href='/AIV/49/2/11-22'>Eph. 2:11-22</a>",
      "comment": "Foreigners aiding in temple-building prefigures the universal gathering of people into the household of God (Eph. 2:19-22). Obedience remains essential for participation in God’s plan."
    }
  ],
  "translatedAt": "2025-12-23T07:38:45.673Z"
}