{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 10,
  "verses": [
    {
      "pk": 45010001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 1,
      "text": "Ask the LORD for rain in the time of the spring rain. The LORD makes the storm clouds, and he gives them showers of rain and plants in the field for everyone.",
      "links": "<a href='/AIV/19/147/8'>Ps. 147:8</a>; <a href='/AIV/24/5/24'>Jer. 5:24</a>; <a href='/AIV/28/6/3'>Hos. 6:3</a>",
      "comment": "This verse underscores God's continual providence and faithfulness. The spring rain is necessary for the harvest, symbolizing how God's grace provides for the needs of His people. There is also a spiritual sense, pointing to the 'later rain' of the Holy Spirit (cf. <a href='/AIV/44/2/17'>Acts 2:17</a>), fulfilling ancient prophecy in the New Covenant era."
    },
    {
      "pk": 45010002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 2,
      "text": "For the household idols speak falsehood, and the diviners see lies; they tell empty dreams and give comfort in vain. Therefore the people wander like sheep; they are oppressed because there is no shepherd.",
      "links": "<a href='/AIV/23/44/25'>Isa. 44:25</a>; <a href='/AIV/26/34/5'>Ezek. 34:5</a>; <a href='/AIV/43/10/12'>John 10:12</a>",
      "comment": "The condemnation of idolatry and false divination highlights the necessity of true spiritual leadership—prefiguring the need for Christ, the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>). Spiritually, true guidance comes through God's appointed leaders, not human inventions."
    },
    {
      "pk": 45010003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 3,
      "text": "My anger burns against the shepherds, and I will punish the leaders. For the LORD of Armies will care for his flock, the house of Judah, and will make them like his majestic horse in battle.",
      "links": "<a href='/AIV/26/34/10'>Ezek. 34:10</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "This rebuke of false shepherds echoes the warnings in Ezekiel. The Lord himself promises to shepherd His people, showing God's direct intervention. Spiritually, this points forward to God's own Son establishing leadership for His united people."
    },
    {
      "pk": 45010004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 4,
      "text": "From him will come the cornerstone, the tent peg, from him the battle bow; from him every ruler will go out together.",
      "links": "<a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>; <a href='/AIV/44/4/11'>Acts 4:11</a>",
      "comment": "The cornerstone is a messianic prophecy fulfilled in Christ (cf. <a href='/AIV/60/2/6'>1 Pet. 2:6</a>). He is the foundation and support of God's people, around whom all authority and guidance are centered. Early Christian writers use this image for the unity and visible structure of the Church."
    },
    {
      "pk": 45010005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 5,
      "text": "They will be like mighty men in battle, trampling their enemies in the mud of the streets. They will fight because the LORD is with them, and the riders on horses will be put to shame.",
      "links": "<a href='/AIV/06/6/12'>Judg. 6:12</a>; <a href='/AIV/23/41/10'>Isa. 41:10</a>",
      "comment": "God's people will have victory and strength, not through their own power, but by the Lord's presence. This is both a historic promise and an image of the victory of God's people united in faith and guided by a divine leader."
    },
    {
      "pk": 45010006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 6,
      "text": "I will strengthen the house of Judah, and I will save the house of Joseph. I will bring them back because I have compassion on them, and they will be as though I had not rejected them; for I am the LORD their God, and I will answer them.",
      "links": "<a href='/AIV/24/31/18'>Jer. 31:18</a>; <a href='/AIV/28/1/7'>Hos. 1:7</a>",
      "comment": "This restoration includes all Israel, both Judah and Joseph (Ephraim), prefiguring the unity of God's people. The promise finds ultimate fulfillment in the reunification of all believers, foreshadowing the gathering under one Shepherd."
    },
    {
      "pk": 45010007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 7,
      "text": "Those of Ephraim will become like mighty men, and their hearts will rejoice as with wine. Their children will see it and rejoice; their hearts will exult in the LORD.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/36/3/17'>Zeph. 3:17</a>",
      "comment": "Ephraim, once divided, is restored to joy and strength, showing God's power to reunite and gladden the hearts of his people and their children—a recurring Biblical theme of covenantal blessing across generations."
    },
    {
      "pk": 45010008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 8,
      "text": "I will whistle for them and gather them in, for I have redeemed them; and they will be as numerous as they once were.",
      "links": "<a href='/AIV/23/5/26'>Isa. 5:26</a>; <a href='/AIV/24/32/37'>Jer. 32:37</a>",
      "comment": "God's gathering of His people (a theme seen in the prophets) foreshadows the redemption and gathering in Christ. This points to the Church as the assembly of the redeemed, called by God into unity."
    },
    {
      "pk": 45010009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 9,
      "text": "Though I scatter them among the nations, they will remember me in distant countries, and they will live with their children, and they will return.",
      "links": "<a href='/AIV/05/30/3'>Deut. 30:3</a>; <a href='/AIV/24/50/4-5'>Jer. 50:4-5</a>",
      "comment": "God promises to preserve the faith of His people even in scattering, and brings them back together. There is a spiritual sense of being gathered from exile into the fullness of faith and worship."
    },
    {
      "pk": 45010010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 10,
      "text": "I will bring them back from the land of Egypt and gather them from Assyria. I will bring them to the land of Gilead and Lebanon, until there is no room for them.",
      "links": "<a href='/AIV/23/11/11'>Isa. 11:11</a>; <a href='/AIV/28/11/11'>Hos. 11:11</a>",
      "comment": "Egypt and Assyria symbolize all lands of exile; the prophecy points to a future, abundant restoration. The overflowing numbers suggest the vastness of those who will be called into God's people."
    },
    {
      "pk": 45010011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 11,
      "text": "He will pass through the sea of distress and strike the waves of the sea; all the depths of the Nile will dry up. The pride of Assyria will be brought down, and the scepter of Egypt will depart.",
      "links": "<a href='/AIV/02/14/21'>Ex. 14:21</a>; <a href='/AIV/19/106/9'>Ps. 106:9</a>",
      "comment": "God echoes the Exodus—saving and delivering His people. The defeat of hostile nations foreshadows final victory over spiritual enemies, and God's people passing safely through trials."
    },
    {
      "pk": 45010012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 10,
      "verse": 12,
      "text": "I will make them strong in the LORD, and they shall walk in his name, declares the LORD.",
      "links": "<a href='/AIV/33/4/5'>Mic. 4:5</a>; <a href='/AIV/51/2/6'>Col. 2:6</a>",
      "comment": "The culmination is God's people living and persevering in His name—strong, faithful, and united. Walking in God's name has implications for both worship and daily life, signifying a visible, unified faith community."
    }
  ],
  "translatedAt": "2025-12-24T09:58:08.752Z"
}