{
  "book": 45,
  "bookName": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 4,
  "verses": [
    {
      "pk": 45004001,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 1,
      "text": "Then the angel who spoke with me returned and woke me up, as one who is wakened from sleep.",
      "links": "<a href='/AIV/38/1/19'>Zech. 1:19</a>; <a href='/AIV/26/2/2'>Ezek. 2:2</a>",
      "comment": "Zechariah is described as being awakened, possibly symbolizing spiritual awakening and readiness to receive divine revelation. This forms a parallel to other prophetic encounters such as Ezekiel's calling."
    },
    {
      "pk": 45004002,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 2,
      "text": "He said to me, 'What do you see?' And I said, 'I see a lampstand all of gold, with a bowl on top of it, and seven lamps on it, with seven pipes to the seven lamps that are on top of it.'",
      "links": "<a href='/AIV/02/25/31'>Ex. 25:31</a>; <a href='/AIV/66/1/12'>Rev. 1:12</a>",
      "comment": "The golden lampstand echoes the menorah in the Tabernacle, representing God's presence and guidance. The number seven often signifies completeness and divine perfection, later referenced in Revelation as symbolizing the seven churches (Rev. 1:12)."
    },
    {
      "pk": 45004003,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 3,
      "text": "And there are two olive trees by it, one on the right side of the bowl and the other on its left.",
      "links": "<a href='/AIV/66/11/4'>Rev. 11:4</a>; <a href='/AIV/45/11/17'>Rom. 11:17</a>",
      "comment": "The two olive trees anticipate further prophecy about anointed ones and sources of oil for the lamps. In Christian readings, these point to the faithful witnesses and the flow of divine grace, reminiscent of the imagery in Revelation 11."
    },
    {
      "pk": 45004004,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 4,
      "text": "So I asked the angel who spoke with me, 'What are these, my lord?'",
      "links": "<a href='/AIV/38/1/9'>Zech. 1:9</a>; <a href='/AIV/24/1/11'>Jer. 1:11</a>",
      "comment": "Zechariah's question shows the openness of the prophet to divine mysteries, similar to other prophetic dialogues (see Jeremiah 1:11)."
    },
    {
      "pk": 45004005,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 5,
      "text": "Then the angel who spoke with me answered, 'Do you not know what these are?' And I said, 'No, my lord.'",
      "links": "<a href='/AIV/66/7/13'>Rev. 7:13</a>",
      "comment": "A repeating pattern of inquiry and response, emphasizing the need for divinely given understanding, as in Revelation's angelic explanations."
    },
    {
      "pk": 45004006,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 6,
      "text": "So he said to me, 'This is the word of the LORD to Zerubbabel: Not by might, nor by power, but by my Spirit, says the LORD of hosts.'",
      "links": "<a href='/AIV/07/7/2'>Judg. 7:2</a>; <a href='/AIV/44/1/8'>Acts 1:8</a>",
      "comment": "The verse teaches that God’s work is accomplished not by human strength, but by His Spirit—a key theme fulfilled in Acts 1:8, as the apostles are empowered by the Holy Spirit. Also, parallels in Judges 7:2 highlight dependence on God."
    },
    {
      "pk": 45004007,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 7,
      "text": "'Who are you, O great mountain? Before Zerubbabel you shall become a plain. And he shall bring forth the top stone with shouts of 'Grace, grace to it!''",
      "links": "<a href='/AIV/23/40/4'>Isa. 40:4</a>; <a href='/AIV/19/118/22'>Ps. 118:22</a>",
      "comment": "The great mountain, symbolizing opposition or obstacle, will be flattened, signifying divine intervention. The 'top stone' points forward to the Messianic fulfillment, connecting with Jesus as the cornerstone in Psalm 118:22."
    },
    {
      "pk": 45004008,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 8,
      "text": "Then the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/38/1/1'>Zech. 1:1</a>",
      "comment": "A formula signaling direct divine speech, establishing the authority and prophetic authenticity of Zechariah's vision."
    },
    {
      "pk": 45004009,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 9,
      "text": "'The hands of Zerubbabel have laid the foundation of this house. His hands shall also finish it. Then you will know that the LORD of hosts has sent me to you.'",
      "links": "<a href='/AIV/15/3/10'>Ezra 3:10</a>; <a href='/AIV/43/2/19'>John 2:19</a>",
      "comment": "Zerubbabel is assured completion of the temple, emphasizing God's faithfulness. This foreshadows Christ's promise to build the spiritual house (see John 2:19)."
    },
    {
      "pk": 45004010,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 10,
      "text": "'For who has despised the day of small things? For these will rejoice when they see the plumb line in the hand of Zerubbabel. These seven are the eyes of the LORD, which range through the whole earth.'",
      "links": "<a href='/AIV/38/3/9'>Zech. 3:9</a>; <a href='/AIV/20/15/3'>Prov. 15:3</a>; <a href='/AIV/66/5/6'>Rev. 5:6</a>",
      "comment": "This reassures that God's work, even when small, leads to rejoicing. The 'seven eyes' connect to spiritual vision and omniscience, with prophetic echoes in Revelation 5:6, where the Lamb is described as having seven eyes, symbolizing fullness of divine spirit."
    },
    {
      "pk": 45004011,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 11,
      "text": "Then I asked him, 'What are these two olive trees, on the right side and the left side of the lampstand?'",
      "links": "<a href='/AIV/38/4/3'>Zech. 4:3</a>; <a href='/AIV/66/11/4'>Rev. 11:4</a>",
      "comment": "Zechariah repeats his inquiry, emphasizing the importance of the olive trees. Their symbolism points towards anointed ones that will play roles in God’s plan of salvation history."
    },
    {
      "pk": 45004012,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 12,
      "text": "Again I asked him, 'What are these two olive branches, which pour out golden oil through two golden pipes?'",
      "links": "<a href='/AIV/38/4/3'>Zech. 4:3</a>; <a href='/AIV/19/52/8'>Ps. 52:8</a>",
      "comment": "The olive branches supply oil, symbolizing the continual flow of God’s grace and the Spirit, linking to the tree imagery in Psalms and spiritual sustenance necessary for God's people."
    },
    {
      "pk": 45004013,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 13,
      "text": "He replied, 'Do you not know what these are?' And I said, 'No, my lord.'",
      "links": "<a href='/AIV/38/4/5'>Zech. 4:5</a>",
      "comment": "This exchange re-emphasizes the mystery of the vision, and the necessity of divine interpretation for sacred truths."
    },
    {
      "pk": 45004014,
      "translation": "AIV",
      "book": 45,
      "bookName": "Zechariah",
      "bookAbbreviation": "Zech",
      "chapter": 4,
      "verse": 14,
      "text": "Then he said, 'These are the two anointed ones who stand by the Lord of all the earth.'",
      "links": "<a href='/AIV/66/11/4'>Rev. 11:4</a>; <a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "The two anointed ones traditionally refer to Zerubbabel and Joshua, but spiritually symbolize divinely authorized leaders and witnesses, a theme reflected in Revelation 11. This foreshadows the greater reality of spiritual anointing and apostolic authority, connecting the sacred leadership across salvation history."
    }
  ],
  "translatedAt": "2025-12-24T09:55:44.994Z"
}