{
  "book": "Zechariah",
  "bookAbbreviation": "Zech",
  "chapter": 4,
  "verses": [
    {
      "pk": 3404001,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 1,
      "text": "The angel who talked with me came again and woke me, as a man who is awakened from his sleep.",
      "links": "<a href='/AIV/38/1/9-14'>Zech. 1:9–14</a>; <a href='/AIV/26/3/14'>Ezek. 3:14</a>",
      "comment": "The angel acts as a guide and teacher, similar to the function of an authoritative tradition in explaining divine revelation."
    },
    {
      "pk": 3404002,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 2,
      "text": "And he said to me, 'What do you see?' I said, 'I see, and behold, a lampstand all of gold, with a bowl on its top, and seven lamps on it, with seven spouts for the lamps that are on top of it.'",
      "links": "<a href='/AIV/02/25/31-40'>Exod. 25:31–40</a>; <a href='/AIV/66/1/12'>Rev. 1:12</a>",
      "comment": "The golden lampstand points to the sanctuary and light-bearing role of God's people (see also Rev. 1:12). The 'lampstand' later becomes a symbol of the church as the light of the world."
    },
    {
      "pk": 3404003,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 3,
      "text": "And there are two olive trees by it, one on the right of the bowl and one on its left.",
      "links": "<a href='/AIV/66/11/4'>Rev. 11:4</a>",
      "comment": "The two olive trees represent living sources that sustain the lampstand, prefiguring the ongoing spiritual leadership established by God."
    },
    {
      "pk": 3404004,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 4,
      "text": "And I spoke and said to the angel who talked with me, 'What are these, my lord?'",
      "links": "",
      "comment": "Zechariah’s question highlights the mystery of God’s plan, which requires authoritative interpretation."
    },
    {
      "pk": 3404005,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 5,
      "text": "Then the angel who talked with me answered and said to me, 'Do you not know what these are?' And I said, 'No, my lord.'",
      "links": "",
      "comment": "The repetition emphasizes reliance on revealed, rather than private, interpretation—revealing the importance of guided instruction."
    },
    {
      "pk": 3404006,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 6,
      "text": "Then he said to me, 'This is the word of the LORD to Zerubbabel: Not by might, nor by power, but by my Spirit, says the LORD of armies.'",
      "links": "<a href='/AIV/26/37/14'>Ezek. 37:14</a>; <a href='/AIV/05/8/17-18'>Deut. 8:17–18</a>",
      "comment": "God accomplishes his will through the Spirit, not human effort—hinting at the Spirit’s supernatural work in establishing God’s new people (see Acts 2)."
    },
    {
      "pk": 3404007,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 7,
      "text": "'What are you, O great mountain? Before Zerubbabel you shall become a plain. And he shall bring forward the top stone amid shouts of “Grace, grace to it!”'",
      "links": "<a href='/AIV/40/21/21'>Matt. 21:21</a>",
      "comment": "The mountain, symbolizing obstacles, is leveled for God’s servant. The ‘top stone’ (capstone) prefigures the completion—echoed in Christ as the Cornerstone (Eph. 2:20)."
    },
    {
      "pk": 3404008,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 8,
      "text": "Moreover, the word of the LORD came to me, saying,",
      "links": "",
      "comment": "The prophet receives direct revelation, continuing the theme of God’s authoritative message."
    },
    {
      "pk": 3404009,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 9,
      "text": "'The hands of Zerubbabel have laid the foundation of this house; his hands shall also finish it. Then you will know that the LORD of armies has sent me to you.'",
      "links": "<a href='/AIV/16/6/15'>Neh. 6:15</a>",
      "comment": "The focus on a visible building prefigures the enduring foundation and visible structure of God’s people on earth."
    },
    {
      "pk": 3404010,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 10,
      "text": "'For who has despised the day of small things? These seven will rejoice when they see the plumb line in the hand of Zerubbabel. These are the eyes of the LORD, which range through all the earth.'",
      "links": "<a href='/AIV/38/3/9'>Zech. 3:9</a>; <a href='/AIV/20/15/3'>Prov. 15:3</a>; <a href='/AIV/66/5/6'>Rev. 5:6</a>",
      "comment": "God works through humble beginnings. The ‘seven eyes’ show divine fullness and omniscience—see Rev. 5:6."
    },
    {
      "pk": 3404011,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 11,
      "text": "Then I spoke and said to him, 'What are these two olive trees on the right and the left of the lampstand?'",
      "links": "",
      "comment": "The repetition shows Zechariah’s desire for understanding, paralleling the need for teaching authority in the interpretation of divine mysteries."
    },
    {
      "pk": 3404012,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 12,
      "text": "And I spoke again, and said to him, 'What are these two branches of the olive trees, which through the two golden pipes pour out the golden oil?'",
      "links": "",
      "comment": "The golden oil points to a sacramental source of divine grace, continuously supplied to maintain God’s light in the world."
    },
    {
      "pk": 3404013,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 13,
      "text": "He answered, 'Do you not know what these are?' And I said, 'No, my lord.'",
      "links": "",
      "comment": "Again, the text underscores the necessity of being taught, rather than relying solely on individual judgment."
    },
    {
      "pk": 3404014,
      "translation": "AIV",
      "book": 38,
      "chapter": 4,
      "verse": 14,
      "text": "And he said, 'These are the two anointed ones who stand by the Lord of all the earth.'",
      "links": "<a href='/AIV/66/11/3-4'>Rev. 11:3–4</a>",
      "comment": "Traditionally, these are interpreted as the priestly and royal authorities, foreshadowing offices that point to Christ’s dual role as King and High Priest (see Heb. 4:14; Rev. 11:4). This unity of leadership emphasizes the visible order and sacramental ministry that continues God’s presence among His people."
    }
  ],
  "translatedAt": "2025-12-23T07:38:11.094Z"
}