{
  "book": 55,
  "bookName": "Galatians",
  "bookAbbreviation": "Gal",
  "chapter": 3,
  "verses": [
    {
      "pk": 55003001,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 1,
      "text": "Foolish Galatians! Who has bewitched you, before whose eyes Jesus Christ was publicly portrayed as crucified?",
      "links": "<a href='/AIV/45/6/6'>Rom. 6:6</a>; <a href='/AIV/47/4/4'>2 Cor. 4:4</a>",
      "comment": "Paul uses sharp language to show the severity of abandoning the gospel for legalism. The crucifixion is set as the foundation of faith. 'Publicly portrayed' implies the centrality of Christ's sacrifice, pointing to both a literal event and its continued presentation in the life of believers (cf. <a href='/AIV/46/11/26'>1 Cor. 11:26</a>)."
    },
    {
      "pk": 55003002,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 2,
      "text": "I want to learn only this from you: Did you receive the Spirit by works of the Law or by hearing with faith?",
      "links": "<a href='/AIV/45/10/17'>Rom. 10:17</a>; <a href='/AIV/44/10/44-47'>Acts 10:44-47</a>",
      "comment": "Paul contrasts the works of the Law with faith that comes by hearing—this alludes to the necessity of God's grace working through external means. Hearing and faith, often through authoritative teaching, are established as the way the Spirit is received (cf. <a href='/AIV/43/20/22'>John 20:22</a>)."
    },
    {
      "pk": 55003003,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 3,
      "text": "Are you so foolish? Having begun by the Spirit, are you now being made perfect by the flesh?",
      "links": "<a href='/AIV/50/1/6'>Phil. 1:6</a>; <a href='/AIV/45/8/9'>Rom. 8:9</a>",
      "comment": "Paul calls out the illogic of starting salvation through faith and grace, but trying to finish by mere human effort. Spiritual growth must continue by the Spirit's power, not just human strength or rituals."
    },
    {
      "pk": 55003004,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 4,
      "text": "Did you experience so much in vain—if indeed it was in vain?",
      "links": "<a href='/AIV/46/15/2'>1 Cor. 15:2</a>",
      "comment": "The Galatians had suffered for organization with Christ—Paul urges them not to let that be for nothing, echoing perseverance in faith. Endurance is closely tied to true discipleship."
    },
    {
      "pk": 55003005,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 5,
      "text": "So then, does He who supplies the Spirit to you and works miracles among you do so by works of the Law, or by hearing with faith?",
      "links": "<a href='/AIV/46/12/10'>1 Cor. 12:10</a>; <a href='/AIV/44/14/3'>Acts 14:3</a>",
      "comment": "God's distribution of the Spirit and miracles is not because of legal observance but faith-filled hearing. This highlights the role of supernatural gifts and their ongoing presence in the believing community."
    },
    {
      "pk": 55003006,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 6,
      "text": "Just as Abraham believed God, and it was credited to him as righteousness—",
      "links": "<a href='/AIV/01/15/6'>Gen. 15:6</a>; <a href='/AIV/45/4/3'>Rom. 4:3</a>",
      "comment": "Paul cites Abraham to show that even the patriarch's justification came not through works but believing faith. This sets the pattern for all who would belong to God’s covenant community."
    },
    {
      "pk": 55003007,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 7,
      "text": "So then, understand that those who have faith, these are the sons of Abraham.",
      "links": "<a href='/AIV/43/8/39'>John 8:39</a>; <a href='/AIV/45/9/8'>Rom. 9:8</a>",
      "comment": "Being Abraham’s children depends on faith, not ethnicity or works. The formation of God’s people transcends bloodlines, pointing forward to all nations being joined together in one household of faith."
    },
    {
      "pk": 55003008,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 8,
      "text": "Scripture, foreseeing that God would justify the Gentiles by faith, proclaimed the gospel beforehand to Abraham: 'In you all the nations will be blessed.'",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/01/18/18'>Gen. 18:18</a>",
      "comment": "Paul affirms the unity of the Old and New Testaments, with the universal blessing through Abraham anticipated and fulfilled in Christ, gathering all nations into the divine family through faith. (See also <a href='/AIV/45/4/16-17'>Rom. 4:16-17</a>)."
    },
    {
      "pk": 55003009,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 9,
      "text": "So then, those who have faith are blessed with Abraham, the man of faith.",
      "links": "<a href='/AIV/45/4/24'>Rom. 4:24</a>",
      "comment": "Sharing in Abraham’s blessing comes through the same faith, not through external adherence to law. The true inheritance comes by spiritual kinship."
    },
    {
      "pk": 55003010,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 10,
      "text": "For all who rely on works of the Law are under a curse, for it is written, 'Cursed is everyone who does not continue in all things written in the book of the Law, to do them.'",
      "links": "<a href='/AIV/05/27/26'>Deut. 27:26</a>; <a href='/AIV/59/2/10'>Jas. 2:10</a>",
      "comment": "Quoting Deuteronomy, Paul states that attempting justification by law brings curse, because complete obedience is impossible. This underscores the need for grace through faith in Christ."
    },
    {
      "pk": 55003011,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 11,
      "text": "Now it is clear that no one is justified before God by the Law, for 'The righteous shall live by faith.'",
      "links": "<a href='/AIV/35/2/4'>Hab. 2:4</a>; <a href='/AIV/45/1/17'>Rom. 1:17</a>",
      "comment": "Faith, not works, is the way to justification—Paul continues the strong emphasis on divine initiative and reveals that the Law pointed beyond itself to the need for a living, trusting relationship with God."
    },
    {
      "pk": 55003012,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 12,
      "text": "But the Law is not based on faith; rather, 'The one who does them will live by them.'",
      "links": "<a href='/AIV/03/18/5'>Lev. 18:5</a>; <a href='/AIV/45/10/5'>Rom. 10:5</a>",
      "comment": "Law operates differently—requiring perfect obedience—while faith brings grace and life through Christ. Paul shows both the Law’s standards and its limitations."
    },
    {
      "pk": 55003013,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 13,
      "text": "Christ redeemed us from the curse of the Law, having become a curse for us—for it is written, 'Cursed is everyone who hangs on a tree.'",
      "links": "<a href='/AIV/05/21/23'>Deut. 21:23</a>; <a href='/AIV/60/2/24'>1 Pet. 2:24</a>",
      "comment": "Paul references the Old Testament penalty for one hung on a tree, interpreting Jesus’s death as redemptive substitution. This points to both the effectiveness and completeness of Christ’s sacrifice. High Christology is visible here—Jesus is both the curse-bearer and the redeemer."
    },
    {
      "pk": 55003014,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 14,
      "text": "So that in Christ Jesus the blessing of Abraham might come to the Gentiles, so that we might receive the promise of the Spirit through faith.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/44/2/39'>Acts 2:39</a>",
      "comment": "The promise to Abraham is fulfilled and expanded through Jesus, encompassing all nations and granting the Spirit through faith. Pentecost (<a href='/AIV/44/2/1-4'>Acts 2:1-4</a>) furthers this motif of the universal gift of God's presence."
    },
    {
      "pk": 55003015,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 15,
      "text": "Brothers, let me give an example from everyday life: Even a man-made covenant, once confirmed, cannot be set aside or added to.",
      "links": "<a href='/AIV/58/6/17'>Heb. 6:17</a>",
      "comment": "Paul appeals to legal custom to show that God’s promise, once given, stands unaltered. This underlines the reliability of God’s covenant as superior to the Law."
    },
    {
      "pk": 55003016,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 16,
      "text": "Now the promises were spoken to Abraham and to his seed. It does not say 'and to seeds,' as of many, but as of one, 'and to your seed,' who is Christ.",
      "links": "<a href='/AIV/01/22/18'>Gen. 22:18</a>; <a href='/AIV/48/3/19'>Gal. 3:19</a>",
      "comment": "Paul interprets the singular 'seed' as referring to Christ, indicating the promise is fulfilled in one descendent—Jesus. This connects Old Testament prophecy to the person of Christ as the head and representative of the covenant people."
    },
    {
      "pk": 55003017,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 17,
      "text": "This is what I mean: The Law, which came four hundred thirty years later, does not annul a covenant previously ratified by God, so as to nullify the promise.",
      "links": "<a href='/AIV/02/12/40'>Exod. 12:40</a>",
      "comment": "The Law, coming after the promise, cannot override or replace it. The permanence of God’s promise is established, and the Law serves a subordinate purpose."
    },
    {
      "pk": 55003018,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 18,
      "text": "For if the inheritance depends on the Law, it no longer depends on a promise; but God graciously gave it to Abraham through a promise.",
      "links": "<a href='/AIV/45/4/14'>Rom. 4:14</a>",
      "comment": "Inheritance by promise emphasizes grace, showing that faith predates and supersedes the Law. This ensures unity and continuity in God’s plan."
    },
    {
      "pk": 55003019,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 19,
      "text": "Why then was the Law given? It was added because of transgressions, until the Seed to whom the promise referred had come, appointed through angels by the hand of a mediator.",
      "links": "<a href='/AIV/02/20/19'>Exod. 20:19</a>; <a href='/AIV/44/7/53'>Acts 7:53</a>",
      "comment": "The Law was given to highlight sin and guide until Christ (the Seed) arrived. Delivered 'through angels' and with a mediator evokes the importance of intercession and the role of intermediaries in divine economy."
    },
    {
      "pk": 55003020,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 20,
      "text": "Now a mediator involves more than one party, but God is one.",
      "links": "<a href='/AIV/05/5/5'>Deut. 5:5</a>",
      "comment": "Paul draws a distinction between the Law, which required a mediator, and God’s promise, which He enacts personally. The unity and initiative of God’s promise is timeless."
    },
    {
      "pk": 55003021,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 21,
      "text": "Is the Law then against the promises of God? Certainly not! For if a law had been given that could impart life, then righteousness would truly be by the Law.",
      "links": "<a href='/AIV/45/7/7'>Rom. 7:7</a>",
      "comment": "The Law does not oppose the promises; rather, it could never impart life. Life and righteousness come through promise and faith in Christ."
    },
    {
      "pk": 55003022,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 22,
      "text": "But Scripture has imprisoned everything under sin, so that the promise might be given to those who believe through faith in Jesus Christ.",
      "links": "<a href='/AIV/45/3/9'>Rom. 3:9</a>; <a href='/AIV/45/11/32'>Rom. 11:32</a>",
      "comment": "Scripture reveals universal sinfulness, so that salvation would come solely by faith in Jesus. This underscores all humanity’s need for grace in Christ."
    },
    {
      "pk": 55003023,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 23,
      "text": "But before faith came, we were held captive under the Law, locked up until the faith that was to come would be revealed.",
      "links": "<a href='/AIV/45/7/6'>Rom. 7:6</a>",
      "comment": "Law prepared the way but could only confine—it could not liberate. The coming of faith refers to the Messiah, bringing freedom and a new covenant."
    },
    {
      "pk": 55003024,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 24,
      "text": "So then, the Law was our guardian until Christ came, so that we might be justified by faith.",
      "links": "<a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "The guardian (Greek: paidagogos) watched over Israel until Christ, who fulfills the Law. Justification comes through Christ now, not through observance of rules."
    },
    {
      "pk": 55003025,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 25,
      "text": "But now that faith has come, we are no longer under a guardian.",
      "links": "<a href='/AIV/43/1/17'>John 1:17</a>",
      "comment": "Faith in Christ means entry into maturity and full sonship with God, rather than reliance on preparatory structures."
    },
    {
      "pk": 55003026,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 26,
      "text": "For you are all sons of God through faith in Christ Jesus.",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/45/8/15'>Rom. 8:15</a>",
      "comment": "Sonship is now by faith in Jesus, and includes all who are joined to Christ—emphasizing adoption into one family. This also implies a united and visible church under Christ as head."
    },
    {
      "pk": 55003027,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 27,
      "text": "For all of you who were baptized into Christ have clothed yourselves with Christ.",
      "links": "<a href='/AIV/45/6/3-4'>Rom. 6:3-4</a>; <a href='/AIV/51/2/12'>Col. 2:12</a>",
      "comment": "Baptism is described as the means of union with Christ, with a spiritual reality effected by a visible act. The idea of being clothed with Christ points to transformation and identity in Him. Baptismal regeneration and the necessity of sacraments for incorporation into Christ are alluded to here."
    },
    {
      "pk": 55003028,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 28,
      "text": "There is neither Jew nor Greek, there is neither slave nor free, there is no male and female, for you are all one in Christ Jesus.",
      "links": "<a href='/AIV/45/10/12'>Rom. 10:12</a>; <a href='/AIV/51/3/11'>Col. 3:11</a>",
      "comment": "Unity in Christ transcends all social or ethnic barriers; corporate unity is fundamental to the Church, the Body of Christ, manifesting spiritual and visible communion."
    },
    {
      "pk": 55003029,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 3,
      "verse": 29,
      "text": "And if you belong to Christ, then you are Abraham’s offspring, heirs according to promise.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/48/4/7'>Gal. 4:7</a>",
      "comment": "Participation in Christ means inclusion in the covenant family and inheritance. This highlights the fulfillment of God’s plan from Abraham, through Christ, to His chosen people—joined in promise, faith, and visible unity."
    }
  ],
  "translatedAt": "2025-12-24T11:59:18.079Z"
}