{
  "book": 55,
  "bookName": "Galatians",
  "bookAbbreviation": "Gal",
  "chapter": 4,
  "verses": [
    {
      "pk": 55004001,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 1,
      "text": "I say that as long as the heir is a child, he is no different from a slave, though he is master of everything.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/55/3/26'>Gal. 3:26</a>",
      "comment": "Paul uses a family analogy to illustrate the believer's status under the law before faith in Christ. The heir's rights are delayed, hinting at the transition from law to grace."
    },
    {
      "pk": 55004002,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 2,
      "text": "But he is under guardians and managers until the time set by his father.",
      "links": "<a href='/AIV/55/3/24'>Gal. 3:24</a>",
      "comment": "This verse emphasizes spiritual guidance—before maturity, there is a need for guardianship, as found under the old law. The 'set time' points forward to Christ’s coming as determined by the Father’s will."
    },
    {
      "pk": 55004003,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 3,
      "text": "So also, when we were children, we were enslaved under the elementary principles of the world.",
      "links": "<a href='/AIV/51/2/8'>Col. 2:8</a>; <a href='/AIV/55/4/9'>Gal. 4:9</a>",
      "comment": "Paul refers to spiritual immaturity. 'Elementary principles' include basic religious regulations and worldly practices, not just Mosaic law. Spiritual growth requires leaving behind old forms."
    },
    {
      "pk": 55004004,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 4,
      "text": "But when the fullness of time came, God sent forth His Son, born of a woman, born under the law,",
      "links": "<a href='/AIV/40/1/23'>Matt. 1:23</a>; <a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/42/2/7'>Luke 2:7</a>",
      "comment": "The 'fullness of time' shows God's sovereignty. 'Born of a woman' highlights true humanity and fulfillment of prophecy (<a href='/AIV/23/7/14'>Isa. 7:14</a>). 'Born under the law' points to Jesus’ perfect obedience, which believers are invited to share through union with Him."
    },
    {
      "pk": 55004005,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 5,
      "text": "to redeem those under the law, so that we might receive adoption as sons.",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/43/1/12'>John 1:12</a>",
      "comment": "Christ's redemption brings about divine adoption. Believers not only receive freedom, but also sonship, echoing the familial and communal aspect of faith."
    },
    {
      "pk": 55004006,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 6,
      "text": "And because you are sons, God has sent the Spirit of His Son into our hearts, crying, 'Abba, Father!'",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/41/14/36'>Mark 14:36</a>",
      "comment": "'Abba' is an intimate address—believers are drawn into deep familial relationship through the Spirit. Highlights the indwelling of the Spirit and the communal cry of God's children."
    },
    {
      "pk": 55004007,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 7,
      "text": "So you are no longer a slave but a son, and if a son, then an heir through God.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/55/3/29'>Gal. 3:29</a>",
      "comment": "The transformation from slavery to inheritance underlines the believer’s entry into God’s household, with attendant rights and spiritual promises."
    },
    {
      "pk": 55004008,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 8,
      "text": "Formerly, when you did not know God, you were enslaved to those who are by nature not gods.",
      "links": "<a href='/AIV/44/17/23'>Acts 17:23</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Paul references idolatry and spiritual bondage, demonstrating the emptiness of worshiping false gods. True freedom is found only in knowing the living God."
    },
    {
      "pk": 55004009,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 9,
      "text": "But now that you have come to know God, or rather are known by God, how can you turn back again to the weak and worthless elementary principles of the world, whose slaves you want to be once more?",
      "links": "<a href='/AIV/55/4/3'>Gal. 4:3</a>; <a href='/AIV/51/2/20'>Col. 2:20</a>",
      "comment": "Paul stresses that relational knowledge of God is more significant than merely human effort. Returning to old rituals or legalisms is a regression from the fullness in Christ."
    },
    {
      "pk": 55004010,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 10,
      "text": "You observe days and months and seasons and years;",
      "links": "<a href='/AIV/51/2/16'>Col. 2:16</a>; <a href='/AIV/03/23/4'>Lev. 23:4</a>",
      "comment": "Paul warns against legalistic observance of festivals, which undermines the freedom purchased by Christ. These practices have value when spiritually fulfilled, not merely external."
    },
    {
      "pk": 55004011,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 11,
      "text": "I fear for you, that perhaps I have labored over you in vain.",
      "links": "<a href='/AIV/47/6/1'>2 Cor. 6:1</a>",
      "comment": "Paul’s pastoral concern reflects the seriousness of turning from the gospel. Apostolic authority seeks to establish communities that persevere in the fullness of faith."
    },
    {
      "pk": 55004012,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 12,
      "text": "Brothers, I beg you, become like me, for I became as you are. You did me no wrong.",
      "links": "<a href='/AIV/46/11/1'>1 Cor. 11:1</a>; <a href='/AIV/55/2/20'>Gal. 2:20</a>",
      "comment": "Paul calls for imitation of his Christ-centered life. The willingness to identify with the community in humility is a mark of true spiritual leadership."
    },
    {
      "pk": 55004013,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 13,
      "text": "You know that it was because of an illness that I first preached the gospel to you.",
      "links": "<a href='/AIV/47/12/7'>2 Cor. 12:7-10</a>",
      "comment": "Paul’s weakness becomes an occasion for God’s power and the spread of the gospel, reflecting the spiritual principle that God works through humble circumstance."
    },
    {
      "pk": 55004014,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 14,
      "text": "And though my condition was a trial to you, you did not despise or reject me, but received me as an angel of God, as Christ Jesus himself.",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>; <a href='/AIV/58/13/2'>Heb. 13:2</a>",
      "comment": "Their reception of Paul is exemplary, modeling Christian hospitality and reverence for those who bear Christ’s message. Welcoming apostolic messengers reflects readiness for grace."
    },
    {
      "pk": 55004015,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 15,
      "text": "What has become of your blessedness? For I bear you witness that, if possible, you would have plucked out your eyes and given them to me.",
      "links": "<a href='/AIV/47/8/7'>2 Cor. 8:7</a>",
      "comment": "This strong affection reflects the deep ties within the spiritual family. Paul appeals to their earlier devotion, a reminder of the unity that marks genuine Christian faith."
    },
    {
      "pk": 55004016,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 16,
      "text": "Have I then become your enemy by telling you the truth?",
      "links": "<a href='/AIV/43/8/40'>John 8:40</a>; <a href='/AIV/20/27/5'>Prov. 27:5-6</a>",
      "comment": "Godly rebuke, even when it stings, is for the sake of spiritual growth. Paul contrasts friendship with harsh honesty when rooted in love, encouraging openness to correction."
    },
    {
      "pk": 55004017,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 17,
      "text": "They are zealous to win you over, but not for good. They want to shut you out, so that you may be zealous for them.",
      "links": "<a href='/AIV/47/11/13'>2 Cor. 11:13-15</a>",
      "comment": "Paul warns about false teachers and divisive tactics. The genuine faith community seeks your good, not manipulation, emphasizing the importance of authentic spiritual unity."
    },
    {
      "pk": 55004018,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 18,
      "text": "It is good to be zealously sought after, provided it is for what is good, and always—not only when I am present with you.",
      "links": "<a href='/AIV/55/5/22'>Gal. 5:22</a>; <a href='/AIV/45/12/11'>Rom. 12:11</a>",
      "comment": "True zeal is for goodness and perseveres in presence and absence, reflecting the fruit of the Spirit and lasting virtue."
    },
    {
      "pk": 55004019,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 19,
      "text": "My children, with whom I am again in labor pains until Christ is formed in you—",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/55/2/20'>Gal. 2:20</a>",
      "comment": "Paul uses parental imagery to describe spiritual formation. The aim is full conformity to Christ—both individually and communally, sanctification is the goal."
    },
    {
      "pk": 55004020,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 20,
      "text": "I wish I could be present with you now and change my tone, for I am confused about you.",
      "links": "<a href='/AIV/47/1/23'>2 Cor. 1:23'>",
      "comment": "Paul’s desire for personal presence shows pastoral concern, reflecting the spiritual value of face-to-face guidance and correction within the faith community."
    },
    {
      "pk": 55004021,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 21,
      "text": "Tell me, you who want to be under the law, do you not listen to the law?",
      "links": "<a href='/AIV/45/2/23'>Rom. 2:23</a>; <a href='/AIV/43/5/39'>John 5:39</a>",
      "comment": "Paul challenges those who favor legalism to truly examine the meaning of the law. He invites deeper study of Scripture to find its ultimate purpose in Christ."
    },
    {
      "pk": 55004022,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 22,
      "text": "For it is written that Abraham had two sons, one by the slave woman and one by the free woman.",
      "links": "<a href='/AIV/01/16/15'>Gen. 16:15</a>; <a href='/AIV/01/21/2'>Gen. 21:2</a>",
      "comment": "References to Abraham’s sons establish biblical precedent. The children represent two covenants, hinting at both history and spiritual reality."
    },
    {
      "pk": 55004023,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 23,
      "text": "But the son by the slave woman was born according to the flesh, while the son by the free woman was born through promise.",
      "links": "<a href='/AIV/01/16/15'>Gen. 16:15</a>; <a href='/AIV/01/21/2'>Gen. 21:2</a>",
      "comment": "Paul distinguishes works of the flesh from works of promise. The promise fulfilled points to God’s sovereignty and grace, preparing believers for spiritual fulfillment."
    },
    {
      "pk": 55004024,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 24,
      "text": "These things are an allegory. For these women are two covenants: one from Mount Sinai, bearing children into slavery—this is Hagar.",
      "links": "<a href='/AIV/02/19/3'>Ex. 19:3-25</a>; <a href='/AIV/55/2/2'>Gal. 2:2</a>",
      "comment": "Paul draws out the spiritual meaning of historical events. The law’s covenant enslaves, but the new covenant frees. This allegory supports continuous spiritual interpretation in scripture."
    },
    {
      "pk": 55004025,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 25,
      "text": "Now Hagar is Mount Sinai in Arabia; she corresponds to the present Jerusalem, for she is in slavery with her children.",
      "links": "<a href='/AIV/11/8/21'>1 Kings 8:21</a>; <a href='/AIV/43/8/34'>John 8:34</a>",
      "comment": "Earthly Jerusalem is contrasted with heavenly Jerusalem. Paul connects historical fact with spiritual meaning, encouraging believers to seek fulfillment beyond external observance."
    },
    {
      "pk": 55004026,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 26,
      "text": "But the Jerusalem above is free, and she is our mother.",
      "links": "<a href='/AIV/66/21/2'>Rev. 21:2</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "Heavenly Jerusalem transcends earthly limitations. The church is described in maternal terms, embracing believers into a spiritual, sacramental reality as children of promise."
    },
    {
      "pk": 55004027,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 27,
      "text": "For it is written, 'Rejoice, barren woman who does not bear children! Break forth and shout, you who are not in labor! For the children of the desolate woman are more than of her who has a husband.'",
      "links": "<a href='/AIV/23/54/1'>Isa. 54:1</a>",
      "comment": "Paul quotes Isaiah, showing prophetic fulfillment in the church as spiritual Israel—those seemingly desolate now abound in spiritual offspring due to God’s grace."
    },
    {
      "pk": 55004028,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 28,
      "text": "Now you, brothers, like Isaac, are children of promise.",
      "links": "<a href='/AIV/01/21/3'>Gen. 21:3</a>; <a href='/AIV/55/3/29'>Gal. 3:29</a>",
      "comment": "All believers participate in the inheritance promised to Abraham, underlining the unity and familial nature of faith, rooted not in rule-keeping but divine promise."
    },
    {
      "pk": 55004029,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 29,
      "text": "But just as he who was born according to the flesh persecuted him who was born according to the Spirit, so it is now also.",
      "links": "<a href='/AIV/01/21/9'>Gen. 21:9</a>; <a href='/AIV/40/5/10'>Matt. 5:10</a>",
      "comment": "Conflict between those of the flesh and those of the Spirit continues. Perseverance in spiritual truth marks the true inheritors of God’s promises."
    },
    {
      "pk": 55004030,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 30,
      "text": "But what does the scripture say? 'Cast out the slave woman and her son, for the son of the slave woman shall not inherit with the son of the free woman.'",
      "links": "<a href='/AIV/01/21/10'>Gen. 21:10</a>",
      "comment": "Scripture decisively favors the path of promise—spiritual inheritance outweighs natural descent or legal observance, emphasizing grace and the call to deeper spiritual communion."
    },
    {
      "pk": 55004031,
      "translation": "AIV",
      "book": 55,
      "bookName": "Galatians",
      "bookAbbreviation": "Gal",
      "chapter": 4,
      "verse": 31,
      "text": "So then, brothers, we are not children of the slave woman but of the free woman.",
      "links": "<a href='/AIV/55/4/26'>Gal. 4:26</a>; <a href='/AIV/43/8/36'>John 8:36</a>",
      "comment": "Final emphasis: believers are born into freedom by divine promise. This calls for living out the fullness of faith, seeking the spiritual unity and sacramental life provided by Christ."
    }
  ],
  "translatedAt": "2025-12-24T11:59:52.484Z"
}