{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 18,
  "verses": [
    {
      "pk": 27018001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 1,
      "text": "But your holy ones had unshaken light; the Egyptians, who heard their voices but could not see their forms, considered them blessed because they were not suffering as they were.",
      "links": "<a href='/AIV/2/10/23'>Exod. 10:23</a>; <a href='/AIV/19/97/11'>Psalm 97:11</a>",
      "comment": "The 'holy ones' refers to the Israelites preserved in light during Egypt’s plague of darkness (Exod. 10:23). The contrast with the Egyptians emphasizes God's favor toward His chosen people."
    },
    {
      "pk": 27018002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 2,
      "text": "They gave thanks that, although they had been harmed, they were now unharmed, and asked for the grace to be spared as a mark of kindness, because they were enemies previously.",
      "links": "<a href='/AIV/2/12/31-32'>Exod. 12:31-32</a>",
      "comment": "This verse recalls the Israelites’ shift from suffering to deliverance, highlighting thanksgiving and the concept of divine mercy. The reference to being former enemies can be understood spiritually, as reconciliation with God."
    },
    {
      "pk": 27018003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 3,
      "text": "You gave them a pillar of blazing fire as a guide on their unknown journey, a harmless sun for their glorious wandering.",
      "links": "<a href='/AIV/2/13/21-22'>Exod. 13:21-22</a>; <a href='/AIV/19/78/14'>Ps. 78:14</a>",
      "comment": "The pillar of fire symbolizes God’s enduring guidance and presence. The motif of 'fire to guide safely' anticipates the New Testament idea of Christ leading his people (John 8:12)."
    },
    {
      "pk": 27018004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 4,
      "text": "The Egyptians deserved to suffer darkness, for they had imprisoned your children, through whom the imperishable light of the Law was to be given to the world.",
      "links": "<a href='/AIV/2/1/13-14'>Exod. 1:13-14</a>; <a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "Egypt’s punishment correlates with their treatment of Israel, the 'bearers of the Law.' The text subtly foreshadows how salvation and divine Revelation are mediated to the world through a chosen people (cf. Rom. 9:4–5)."
    },
    {
      "pk": 27018005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 5,
      "text": "When they resolved to kill infants of the holy people, one child who had been exposed and rescued was to be their destroyer; but you, in punishment, took away their multitude of children and destroyed them together in a mighty water.",
      "links": "<a href='/AIV/2/1/22'>Exod. 1:22</a>; <a href='/AIV/2/14/28'>Exod. 14:28</a>",
      "comment": "Moses, once threatened with death as an infant, becomes the agent of the Egyptians’ downfall. The motif of water recalls both the Red Sea and Baptism as deliverance."
    },
    {
      "pk": 27018006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 6,
      "text": "That night of deliverance was made known beforehand to our ancestors, so that, having understood the oaths in which they trusted, they might take courage.",
      "links": "<a href='/AIV/2/12/12-14'>Exod. 12:12-14</a>; <a href='/AIV/1/15/13-15'>Gen. 15:13-15</a>",
      "comment": "The foretelling of Passover gave the Israelites confidence in God’s promises. Christologically, the Passover prefigures the ultimate deliverance through Christ (cf. 1 Cor. 5:7)."
    },
    {
      "pk": 27018007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 7,
      "text": "Your people joyfully expected the salvation of the righteous and the destruction of their enemies,",
      "links": "<a href='/AIV/19/97/11'>Ps. 97:11</a>; <a href='/AIV/2/12/42'>Exod. 12:42</a>",
      "comment": "The dual outcomes of salvation and judgment reflect the theme of divine justice. This hope of deliverance shapes Christian eschatology (cf. 2 Thess. 1:6–7)."
    },
    {
      "pk": 27018008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 8,
      "text": "for by the same act that punished our adversaries, you glorified us, whom you had called.",
      "links": "<a href='/AIV/2/14/30-31'>Exod. 14:30-31</a>; <a href='/AIV/45/8/30'>Rom. 8:30</a>",
      "comment": "God’s single act brings both redemption and judgment—an echo of Christ’s Cross, which is both salvation for believers and judgment of unbelief (John 3:18)."
    },
    {
      "pk": 27018009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 9,
      "text": "For our ancestors performed the rites of sacrifice secretly and established with one accord this divine law—that the holy ones should share equally in the same good and in danger; and they sang together the ancient hymns of praise.",
      "links": "<a href='/AIV/2/12/21-28'>Exod. 12:21-28</a>; <a href='/AIV/2/15/1-2'>Exod. 15:1-2</a>",
      "comment": "The secret Passover rites and unified worship point to communal liturgy and the importance of the sacrificial meal, foreshadowing later Christian eucharistic practice."
    },
    {
      "pk": 27018010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 10,
      "text": "The discordant cries of their enemies echoed as the voices of those weeping for dead children mingled with lamentation for the destruction of their servants.",
      "links": "<a href='/AIV/2/12/30'>Exod. 12:30</a>",
      "comment": "Egypt’s mourning contrasts sharply with Israel’s joy, drawing attention to the results of opposition to God’s plan. The shared suffering of Israel’s enemies serves as a warning (cf. Rom. 11:22)."
    },
    {
      "pk": 27018011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 11,
      "text": "Punished with the same fate, master and servant alike perished; both were struck down together by a singular death.",
      "links": "<a href='/AIV/2/12/29'>Exod. 12:29</a>",
      "comment": "No social status shielded the Egyptians from judgment. The impartiality of divine justice is underscored."
    },
    {
      "pk": 27018012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 12,
      "text": "Their dead lay everywhere, side by side; parents and children. In a brief moment, countless lives were destroyed.",
      "links": "<a href='/AIV/2/12/29-30'>Exod. 12:29-30</a>",
      "comment": "The swiftness and thoroughness of judgment serve as both narrative and moral warning, highlighting God’s power."
    },
    {
      "pk": 27018013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 13,
      "text": "All who survived did not believe these things, since all their magic arts failed; but at the destruction of the firstborn, they acknowledged that your people were God’s children.",
      "links": "<a href='/AIV/2/8/18-19'>Exod. 8:18-19</a>; <a href='/AIV/2/9/11'>Exod. 9:11</a>",
      "comment": "Even Egypt's magicians came to recognize God’s power, supporting the idea that human means cannot oppose or replicate divine work."
    },
    {
      "pk": 27018014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 14,
      "text": "For while gentle silence enveloped all things and night was midway through its swift course,",
      "links": "<a href='/AIV/2/12/29'>Exod. 12:29</a>",
      "comment": "The imagery of silence and midnight deepens the solemnity of God’s action. Early Christian writers used this passage to foreshadow Christ’s Incarnation—God acting in hiddenness (cf. Luke 2:6-7)."
    },
    {
      "pk": 27018015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 15,
      "text": "your all-powerful word leapt from heaven, from the royal throne, a warrior carrying your firm command as a sharp sword,",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "‘Word’ (Logos) carries high Christological meaning—God’s will and presence effectuating judgment. The Fathers see here a type of the pre-incarnate Christ acting in history (cf. John 1:1-14)."
    },
    {
      "pk": 27018016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 16,
      "text": "standing and filling everything with death, it touched heaven while standing on earth.",
      "links": "<a href='/AIV/19/77/20'>Ps. 77:20</a>; <a href='/AIV/2/12/29'>Exod. 12:29</a>",
      "comment": "The activity of the 'Word' spans heaven and earth, signifying divine mastery over creation. This blend of transcendence and immanence anticipates fuller New Testament revelation."
    },
    {
      "pk": 27018017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 17,
      "text": "Then, sudden visions of terrible dreams troubled them, and unlooked-for fears assailed them.",
      "links": "<a href='/AIV/2/12/30'>Exod. 12:30</a>",
      "comment": "Pharaoh's court is struck not only physically but psychologically, warning against spiritual blindness and hardness of heart."
    },
    {
      "pk": 27018018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 18,
      "text": "One fell here, another there, half-dead, disclosing the reason of their death. For the dreams that troubled them made them know why they were perishing,",
      "links": "<a href='/AIV/2/12/29-30'>Exod. 12:29-30</a>",
      "comment": "Divine judgment is accompanied by revelation; those afflicted understood the cause, which implies the educative nature of God’s discipline."
    },
    {
      "pk": 27018019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 19,
      "text": "so that they perished not without having suffered in advance by their own terrors.",
      "links": "<a href='/AIV/19/73/18-19'>Ps. 73:18-19</a>",
      "comment": "The Egyptians’ internal suffering is seen as just retribution, and it complements the physical plague."
    },
    {
      "pk": 27018020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 20,
      "text": "But against your holy ones, not even the forces of death could prevail, for a deadly plague struck the multitude in the desert, yet your anger did not last long.",
      "links": "<a href='/AIV/4/16/46-48'>Num. 16:46-48</a>; <a href='/AIV/2/8/22'>Exod. 8:22</a>",
      "comment": "Here the contrast is between the holy and the wicked. Israel is not free from discipline (cf. Num. 16:46–48), but God’s mercy tempers his justice."
    },
    {
      "pk": 27018021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 21,
      "text": "For a blameless man hastened to be their champion, wielding the weapons of his priestly ministry—prayer and incense—he stood between the dead and the living and halted the wrath, bringing disaster to an end.",
      "links": "<a href='/AIV/4/16/46-48'>Num. 16:46-48</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "Aaron’s priestly intervention points to the mediating role of the priesthood and sacrifice, a type fulfilled in the eternal mediation of Christ (cf. Heb. 7:25)."
    },
    {
      "pk": 27018022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 22,
      "text": "He overcame the wrath, not by physical strength or weapons, but by submitting to the One who punishes and thus reminded the people through signs of what had occurred because of their words.",
      "links": "<a href='/AIV/4/17/12-13'>Num. 17:12-13</a>",
      "comment": "This highlights the power of intercession and spiritual means over violence—strongly emphasizing the efficacy of the sacred ministry and sacramental signs."
    },
    {
      "pk": 27018023,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 23,
      "text": "For they fell together around him, but he stood firm, holding back the anger and cutting off the way to the living.",
      "links": "<a href='/AIV/4/16/48'>Num. 16:48</a>",
      "comment": "The priest, standing between life and death, illustrates the timeless role of the mediator. This hints at the perpetual priesthood, which continues as an intercessory office."
    },
    {
      "pk": 27018024,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 24,
      "text": "For he wore on his robe the full array of the sacred symbols, glorious honors engraved on the four rows of stones, and your majestic glory upon his diadem.",
      "links": "<a href='/AIV/2/28/6-21'>Exod. 28:6-21</a>",
      "comment": "Aaron’s priestly vestments symbolize his consecration and represent the whole people before God. This anticipates the continuity of ordained priesthood and visible liturgy."
    },
    {
      "pk": 27018025,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 18,
      "verse": 25,
      "text": "To these the destroyer yielded, he was afraid; for only one experience of divine anger was enough.",
      "links": "<a href='/AIV/4/16/48'>Num. 16:48</a>; <a href='/AIV/2/12/23'>Exod. 12:23</a>",
      "comment": "The 'destroyer,' restrained by the sanctified minister, points to the victory of intercession and authority established by divine ordination. Ultimately, this prefigures the victory over death through Christ."
    }
  ],
  "translatedAt": "2025-12-24T07:22:37.522Z"
}