{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 10,
  "verses": [
    {
      "pk": 27010001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 1,
      "text": "Wisdom protected the father of all people, who was first created alone, and delivered him from his own fall.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/1/3/20-24'>Gen. 3:20-24</a>",
      "comment": "This verse identifies Adam, preserved by Wisdom even after his transgression. The theme of Wisdom preserving humanity echoes throughout salvation history and prefigures the saving work accomplished in Christ. Note the subtle implication that Wisdom acts as a mediating principle, reminiscent of how in Christian doctrine the Word is the agent of creation (John 1:1-3)."
    },
    {
      "pk": 27010002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 2,
      "text": "Wisdom gave him power to rule over all things.",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/19/8/6'>Ps. 8:6</a>",
      "comment": "Adam's original dominion echoes the commissioning found in Genesis 1. The restoration of that lost authority is later accomplished through Christ, the New Adam (Rom. 5:14)."
    },
    {
      "pk": 27010003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 3,
      "text": "But when an unrighteous man departed from her in anger, he perished in his fury through the murder of his brother.",
      "links": "<a href='/AIV/1/4/8'>Gen. 4:8</a>; <a href='/AIV/62/3/15'>1 John 3:15</a>",
      "comment": "Cain's rejection of Wisdom leads to death and violence. The spiritual meaning includes a warning against envy and pride, indicating humanity's need for reconciliation and grace."
    },
    {
      "pk": 27010004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 4,
      "text": "When the earth was flooded because of wickedness, Wisdom again saved it by guiding the righteous man in a weak piece of wood.",
      "links": "<a href='/AIV/1/7/23'>Gen. 7:23</a>; <a href='/AIV/60/3/20'>1 Pet. 3:20</a>",
      "comment": "This refers to Noah, who survives the flood by obedience and is saved through the ark. The ark prefigures the means of salvation through water (cf. Baptism, 1 Pet. 3:21)."
    },
    {
      "pk": 27010005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 5,
      "text": "Wisdom also, when nations were confused in their wicked plots, discerned the just man and preserved him blameless before God, and kept him strong in his compassion for his child.",
      "links": "<a href='/AIV/1/11/7-9'>Gen. 11:7-9</a>; <a href='/AIV/1/22/2'>Gen. 22:2</a>",
      "comment": "Interpreters often see this as alluding to Abraham—protected amidst the confusion at Babel and later in the testing of his faith regarding Isaac. The spiritual sense shows God’s guidance for those who remain open to His will and promises."
    },
    {
      "pk": 27010006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 6,
      "text": "Wisdom rescued a righteous man fleeing the fire that fell on the Five Cities.",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/61/2/7'>2 Pet. 2:7</a>",
      "comment": "This is Lot, delivered from Sodom and Gomorrah. The passage spotlights God’s mercy toward the faithful remnant, as later fulfilled in spiritual deliverance offered in Christ."
    },
    {
      "pk": 27010007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 7,
      "text": "Evidence of their wickedness still remains: a smoking wasteland, plants bearing fruit that never ripen, and a standing pillar of salt to remind the unbelieving soul.",
      "links": "<a href='/AIV/1/19/26'>Gen. 19:26</a>",
      "comment": "Lot's wife, turned to salt and the ruins of Sodom, are enduring witnesses to the consequences of sin. The passage holds a literal and symbolic meaning, urging forsaking vice and inclining toward God’s righteousness."
    },
    {
      "pk": 27010008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 8,
      "text": "For disregarding Wisdom, they not only were harmed by not knowing what is good, but also left a memorial of their foolishness for generations, so that what they did was not hidden.",
      "links": "<a href='/AIV/20/3/13-18'>Prov. 3:13-18</a>",
      "comment": "This sums up the moral lesson: the result of despising Wisdom is not only personal ruin but public infamy. The wisdom tradition here acts as a continual warning, foreshadowing the call to conversion."
    },
    {
      "pk": 27010009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 9,
      "text": "But Wisdom rescued righteous men from danger.",
      "links": "<a href='/AIV/1/19/16'>Gen. 19:16</a>; <a href='/AIV/19/34/19'>Ps. 34:19</a>",
      "comment": "The safety of the righteous is a recurring promise, often spiritually interpreted as God’s unwavering protection of those who remain faithful to Him."
    },
    {
      "pk": 27010010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 10,
      "text": "Wisdom guided a righteous man on straight paths, showed him the kingdom of God, and gave him knowledge of holy things; she prospered him in his labor and increased the fruit of his toil.",
      "links": "<a href='/AIV/1/28/13'>Gen. 28:13</a>; <a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "Traditionally understood to be Jacob, who is guided by Wisdom. The 'knowledge of holy things' foreshadows deeper revelation given through Christ and the Apostles. The spiritual interpretation includes how one’s faithful labor is blessed by God."
    },
    {
      "pk": 27010011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 11,
      "text": "When others turned against him out of envy, Wisdom stood by him and made him rich.",
      "links": "<a href='/AIV/1/30/43'>Gen. 30:43</a>; <a href='/AIV/1/37/11'>Gen. 37:11</a>",
      "comment": "This likely refers to Jacob and Joseph, both envied by their kin, but protected and prospered by divine Providence. This hints at God's loyalty to His chosen through adversity."
    },
    {
      "pk": 27010012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 12,
      "text": "She defended him from his enemies, kept him safe from those who sought his life, and gave him the victory in a hard contest, so that he might know that wisdom is more powerful than anything.",
      "links": "<a href='/AIV/1/39/2'>Gen. 39:2</a>; <a href='/AIV/19/118/6'>Ps. 118:6</a>",
      "comment": "Joseph’s trials in Egypt are the context; Wisdom’s support positions divine favor even above human opposition, prefiguring the ultimate victory of Christ over sin and death."
    },
    {
      "pk": 27010013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 13,
      "text": "She did not abandon the righteous man when he was sold, but delivered him from sin.",
      "links": "<a href='/AIV/1/37/28'>Gen. 37:28</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "Joseph, sold by his brothers, is a type of Christ betrayed. Wisdom delivering him points to God’s mysterious plan, bringing good from evil."
    },
    {
      "pk": 27010014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 14,
      "text": "She went down with him into the dungeon, and did not leave him in chains until she brought him the scepter of a kingdom and authority over those who oppressed him; she showed those who accused him to be liars, and granted him everlasting honor.",
      "links": "<a href='/AIV/1/41/14-40'>Gen. 41:14-40</a>",
      "comment": "Joseph’s rise from prison to power prefigures resurrection motifs. Wisdom's presence even in the depths anticipates God’s vindication of the faithful, seen most fully in the Resurrection of Christ."
    },
    {
      "pk": 27010015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 15,
      "text": "Wisdom delivered a holy people and a blameless seed from their oppressors.",
      "links": "<a href='/AIV/2/12/51'>Exod. 12:51</a>; <a href='/AIV/19/78/52'>Ps. 78:52</a>",
      "comment": "This refers to the Exodus. The 'blameless seed' can also be seen as foreshadowing the Incarnation, Christ as the true Holy Seed who liberates God’s people."
    },
    {
      "pk": 27010016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 16,
      "text": "She entered the soul of a servant of the Lord, and withstood awful kings with wonders and signs.",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10</a>; <a href='/AIV/2/7/20'>Exod. 7:20</a>; <a href='/AIV/44/7/36'>Acts 7:36</a>",
      "comment": "Moses, animated by Wisdom, works wonders before Pharaoh. This highlights the mediatory role of Wisdom in the manifestation of God’s power through chosen servants."
    },
    {
      "pk": 27010017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 17,
      "text": "She rewarded the holy people for their hardships, guided them on a wondrous path, and became a shelter for them by day, a star by night.",
      "links": "<a href='/AIV/2/13/21-22'>Exod. 13:21-22</a>; <a href='/AIV/19/105/39'>Ps. 105:39</a>",
      "comment": "Wisdom’s guiding presence in the pillar of cloud and fire further anticipates the perpetual and visible guidance provided to God’s people. This guidance continues through the history of salvation."
    },
    {
      "pk": 27010018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 18,
      "text": "She brought them through the Red Sea and led them through deep waters;",
      "links": "<a href='/AIV/2/14/21-22'>Exod. 14:21-22</a>; <a href='/AIV/19/106/9'>Ps. 106:9</a>",
      "comment": "Wisdom manifests God’s salvation in history. The crossing of the sea is a type of Baptism, the definitive sign of liberation and entry into covenant—all Christians partake in this mystery sacramentally."
    },
    {
      "pk": 27010019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 19,
      "text": "She drowned their enemies and brought up the people from the depths of the sea.",
      "links": "<a href='/AIV/2/14/27-28'>Exod. 14:27-28</a>; <a href='/AIV/19/136/15'>Ps. 136:15</a>",
      "comment": "The destruction of Pharaoh’s army is a sign of definitive victory. These events are both historical and spiritual—demonstrating God’s triumph over evil and the security of those united to Him."
    },
    {
      "pk": 27010020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 20,
      "text": "Therefore, the righteous plundered the ungodly, and sang hymns to Your holy name, O Lord, and together praised Your protecting hand.",
      "links": "<a href='/AIV/2/15/1'>Exod. 15:1</a>; <a href='/AIV/19/105/43'>Ps. 105:43</a>",
      "comment": "The response of joy and communal worship among God's people highlights the importance of public and united praise. This event prefigures the practice of liturgical worship as a response to divine deliverance."
    },
    {
      "pk": 27010021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 10,
      "verse": 21,
      "text": "For Wisdom opened the mouths of the speechless and made tongues of infants eloquent.",
      "links": "<a href='/AIV/19/8/2'>Ps. 8:2</a>; <a href='/AIV/42/21/15'>Luke 21:15</a>",
      "comment": "As in the Psalms and teachings of Jesus, God empowers the humble with the ability to praise and proclaim His works. The spiritual meaning points to the grace that equips believers—even the weakest—to bear witness. This subtly suggests the importance of childlike faith and of the supernatural gifts imparted in the life of the Church."
    }
  ],
  "translatedAt": "2025-12-24T07:18:51.231Z"
}