{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 19,
  "verses": [
    {
      "pk": 1934190,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 1,
      "text": "But as for the ungodly, wrath came upon them without mercy to the end. For God knew beforehand what they would do:",
      "links": "<a href='/AIV/44/12/22'>Wis. 12:22</a>; <a href='/AIV/20/1/7-8'>Prov. 1:7-8</a>",
      "comment": "This introduces the final judgment upon the Egyptians and shows God's perfect foreknowledge (cf. Romans 8:29). This is a reflection of divine justice prepared and executed with omniscient wisdom."
    },
    {
      "pk": 1934191,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 2,
      "text": "That even after allowing them to depart and sending them quickly away, they would change their minds and pursue them.",
      "links": "<a href='/AIV/2/14/5'>Exod. 14:5</a>",
      "comment": "This verse alludes to Pharaoh's hardened heart and the Egyptian pursuit of Israel after the Exodus. God's providence is shown in foreseeing their rebellion against His command."
    },
    {
      "pk": 1934192,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 3,
      "text": "For while they were still mourning and lamenting at the graves of their dead, they took up another plan of foolishness and pursued those whom they had begged to leave as refugees.",
      "links": "<a href='/AIV/2/12/30'>Exod. 12:30</a>; <a href='/AIV/2/14/6-9'>Exod. 14:6-9</a>",
      "comment": "The Egyptians’ sorrow over their loss quickly gave way to pride and aggression. This demonstrates how sin blinds the heart, leading to repeated folly."
    },
    {
      "pk": 1934193,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 4,
      "text": "For destiny led them to this end, that they might fulfill the things already determined, and that through their suffering, Your people might not lack experience.",
      "links": "<a href='/AIV/2/9/16'>Exod. 9:16</a>; <a href='/AIV/12/18/31'>1 Kings 18:31</a>",
      "comment": "The idea of ‘destiny’ reflects God’s sovereignty guiding history (Proverbs 16:4). The faithful are instructed through trials—foreshadowing purification through suffering (cf. James 1:2-4)."
    },
    {
      "pk": 1934194,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 5,
      "text": "But Your people experienced a miraculous journey, for those whom You called departed safely, while their enemies saw strange deaths.",
      "links": "<a href='/AIV/2/14/29-30'>Exod. 14:29-30</a>; <a href='/AIV/6/4/23'>Josh. 4:23</a>",
      "comment": "The Israelites’ passage through the Red Sea is described as miraculous, a direct act of divine providence. This event typologically points to Christian baptism as a passage from death to life (cf. 1 Peter 3:20-21)."
    },
    {
      "pk": 1934195,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 6,
      "text": "The whole creation was fashioned again in its own nature, obeying Your commands, that Your children might be preserved unharmed.",
      "links": "<a href='/AIV/2/14/21-22'>Exod. 14:21-22</a>; <a href='/AIV/19/114/3-7'>Ps. 114:3-7</a>",
      "comment": "Nature itself is subject to the Creator, responding to His will. This signifies the power of the supernatural over the natural—a frequent theme prefiguring Christ’s miracles (cf. Mark 4:39-41)."
    },
    {
      "pk": 1934196,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 7,
      "text": "Cloud was seen shielding the camp, and dry land appeared where water had been. The Red Sea became a way without hindrance, and turbulent waves became a plain.",
      "links": "<a href='/AIV/2/14/19-22'>Exod. 14:19-22</a>; <a href='/AIV/19/78/13'>Ps. 78:13</a>",
      "comment": "The cloud and the dry land are classic Exodus symbols, representing divine protection and deliverance—a motif repeated in Christ leading His people (cf. 1 Corinthians 10:1-2)."
    },
    {
      "pk": 1934197,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 8,
      "text": "Through this, Your whole nation passed, protected by Your hand, seeing wonders and marvelous signs.",
      "links": "<a href='/AIV/2/14/30-31'>Exod. 14:30-31</a>; <a href='/AIV/19/106/7-8'>Ps. 106:7-8</a>",
      "comment": "Israel’s experience illustrates God’s power to preserve and save. These ‘marvelous signs’ foreshadow the sacraments by which believers receive grace and protection."
    },
    {
      "pk": 1934198,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 9,
      "text": "For they grazed like horses and leaped about like lambs, glorifying You, O Lord, who had delivered them.",
      "links": "<a href='/AIV/19/114/4'>Ps. 114:4</a>; <a href='/AIV/29/2/22'>Joel 2:22</a>",
      "comment": "The joyful imagery reflects God’s restoration after deliverance. Lambs symbolize purity and innocence—a theme carried into the New Testament where Christ is the Lamb of God (John 1:29)."
    },
    {
      "pk": 1934199,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 10,
      "text": "For they still remembered the things that happened while in exile, how the earth produced insects instead of fish, and, in place of animals, a sudden river brought forth a multitude of frogs.",
      "links": "<a href='/AIV/2/8/3-6'>Exod. 8:3-6</a>; <a href='/AIV/2/7/17-21'>Exod. 7:17-21</a>",
      "comment": "Recalling the Egyptian plagues, these memories serve as a reminder of God’s judgment and mercy. The supernatural events highlight His sovereignty over creation."
    },
    {
      "pk": 1934200,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 11,
      "text": "And instead of punishment for their food, in the desire to satisfy their craving, You gave Your people quails for sustenance.",
      "links": "<a href='/AIV/2/16/13'>Exod. 16:13</a>; <a href='/AIV/19/105/40'>Ps. 105:40</a>",
      "comment": "Quails provided in the wilderness (Exod. 16:13) are a meal by divine provision, prefiguring God’s abundant care for His people—a theme fulfilled in the heavenly banquet (cf. Luke 22:16-19)."
    },
    {
      "pk": 1934201,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 12,
      "text": "They were punished for their own cravings, but Your people received food of angels without any labor, sent down from heaven.",
      "links": "<a href='/AIV/2/16/14-15'>Exod. 16:14-15</a>; <a href='/AIV/19/78/24-25'>Ps. 78:24-25</a>",
      "comment": "The ‘food of angels’ is manna—a symbol of divine sustenance. This anticipates the ‘bread from heaven’—Jesus’ own teaching about Himself (John 6:31-33), suggesting the centrality of eucharistic grace."
    },
    {
      "pk": 1934202,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 13,
      "text": "And You did not disappoint their craving, but did so for their enemies, that they were consumed by hunger.",
      "links": "<a href='/AIV/2/12/33-36'>Exod. 12:33-36</a>; <a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "The sharp contrast between God’s provision for His people and judgment upon His enemies displays divine impartiality and justice—themes developed in Christ’s teaching about the sheep and goats (Matthew 25:31-46)."
    },
    {
      "pk": 1934203,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 14,
      "text": "For even when the Egyptians saw the Israelites feasting, they were tormented by hunger, because what they hungered for they could not receive.",
      "links": "<a href='/AIV/2/10/7'>Exod. 10:7</a>; <a href='/AIV/19/78/50'>Ps. 78:50</a>",
      "comment": "This highlights the reversal: blessing given to the faithful, deprivation to the unrighteous. God’s justice is comprehensive and restorative for His chosen."
    },
    {
      "pk": 1934204,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 15,
      "text": "While the Israelites drank abundantly from miraculous water, their enemies suffered thirst and deprivation.",
      "links": "<a href='/AIV/2/17/6'>Exod. 17:6</a>; <a href='/AIV/19/78/15-16'>Ps. 78:15-16</a>",
      "comment": "The water from the rock foreshadows Christ as the source of living water (John 4:10-14; 1 Cor. 10:4), further reinforcing how God’s grace meets both temporal and spiritual needs."
    },
    {
      "pk": 1934205,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 16,
      "text": "For when they attempted to kill the children, You gave them abundant water unexpectedly.",
      "links": "<a href='/AIV/2/1/22'>Exod. 1:22</a>; <a href='/AIV/2/17/6'>Exod. 17:6</a>",
      "comment": "God’s justice is evident as He responds directly to the evil intentions of the Egyptians with miraculous provision for His people. This anticipates Christ’s protection of the innocent (cf. Matt. 2:13-15)."
    },
    {
      "pk": 1934206,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 17,
      "text": "But they were shown how their thirst was to be punished, and how Your people had to face their enemies mercifully.",
      "links": "<a href='/AIV/2/14/30'>Exod. 14:30</a>; <a href='/AIV/19/107/35-36'>Ps. 107:35-36</a>",
      "comment": "The text draws attention to the lesson of mercy in the midst of judgment. God's people are to be examples of mercy, reflecting His nature as revealed in the fullness of Christ’s teaching (Luke 6:36)."
    },
    {
      "pk": 1934207,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 18,
      "text": "For when a heavy cloud overshadowed the camp and dry land appeared where there was water, so that through the Red Sea, the whole nation crossed on foot, seeing the wonders of God;",
      "links": "<a href='/AIV/2/14/20-22'>Exod. 14:20-22</a>; <a href='/AIV/19/66/6'>Ps. 66:6</a>",
      "comment": "The crossing of the Red Sea is foundational—themes of deliverance, new birth, and divine guidance all come together. It hints at the sacramental reality of being saved through water (1 Peter 3:20-21)."
    },
    {
      "pk": 1934208,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 19,
      "text": "They sang hymns to Your name, and with one accord, praised Your hand which had defended them.",
      "links": "<a href='/AIV/2/15/1-21'>Exod. 15:1-21</a>; <a href='/AIV/19/106/12'>Ps. 106:12</a>",
      "comment": "Thanksgiving after deliverance: singing hymns in unity recalls liturgical praise. Note the spiritual lesson—corporate worship is a response to divine salvation."
    },
    {
      "pk": 1934209,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 20,
      "text": "For the Lord destroyed with one blow those who had shown injustice, yet provided for Your people through their wanderings like a shepherd with His flock.",
      "links": "<a href='/AIV/2/15/7'>Exod. 15:7</a>; <a href='/AIV/19/78/52'>Ps. 78:52</a>",
      "comment": "God’s shepherd-like care alongside decisive judgment displays His dual attributes of mercy and justice—key themes in understanding God’s governance and Christ’s own mission."
    },
    {
      "pk": 1934210,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 21,
      "text": "They passed through a desert with no obstacles, and their enemies, weighted down by dead bodies covered by the deep, looked like castaway refuse.",
      "links": "<a href='/AIV/2/14/24-28'>Exod. 14:24-28</a>",
      "comment": "The image of the drowned Egyptians recalls the finality of God’s judgment, whereas God’s people walk unhindered—a literal and spiritual truth about following divine guidance."
    },
    {
      "pk": 1934211,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 22,
      "text": "Above all, they saw a new kind of birds, when, at their desire, quails appeared to satisfy their hunger.",
      "links": "<a href='/AIV/2/16/13'>Exod. 16:13</a>; <a href='/AIV/19/78/27'>Ps. 78:27</a>",
      "comment": "God’s miraculous provision continues, underscoring the theme of supernatural nourishment. The pattern of God providing both physical and spiritual sustenance suggests both temporal and eternal blessings are united in the fullness of faith."
    }
  ],
  "translatedAt": "2025-12-23T09:49:57.608Z"
}