{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 9,
  "verses": [
    {
      "pk": 27009001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 1,
      "text": "God of my ancestors and Lord of mercy, who made all things by your word,",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "This verse sets the tone by emphasizing God as Creator, making all things through His Word. Here, 'Word' prefigures the Logos, Christ, as seen in John 1:1-3, which is a traditional interpretation in early Christianity. The invocation to the God of 'ancestors' highlights the continuity of faith from Abraham onwards."
    },
    {
      "pk": 27009002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 2,
      "text": "and by your wisdom you formed humankind to rule over the creatures you have made,",
      "links": "<a href='/AIV/01/1/26-28'>Gen. 1:26-28</a>; <a href='/AIV/19/8/6-8'>Ps. 8:6-8</a>",
      "comment": "Wisdom is presented as God's instrument in creating and ordering humanity, pointing toward the role of divine wisdom in governance and stewardship of creation."
    },
    {
      "pk": 27009003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 3,
      "text": "so that they might govern the world in holiness and righteousness, and pass judgment in uprightness of heart.",
      "links": "<a href='/AIV/19/72/1-2'>Ps. 72:1-2</a>; <a href='/AIV/20/8/15-16'>Prov. 8:15-16</a>",
      "comment": "Governing the world in holiness signals a call not just for external rule but for inner righteousness, linking to themes developed by Solomon and later by Christ as the fulfillment of the perfect, wise king."
    },
    {
      "pk": 27009004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 4,
      "text": "Give me wisdom, who stands by your throne, and do not reject me from among your servants.",
      "links": "<a href='/AIV/11/3/7-9'>1 Kgs. 3:7-9</a>; <a href='/AIV/20/8/30'>Prov. 8:30</a>",
      "comment": "Solomon prays for wisdom as a gift directly from God. Spiritually, wisdom is depicted as a person who stands with God—a reference picked up in the personification of wisdom in Proverbs and the New Testament's application to Christ."
    },
    {
      "pk": 27009005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 5,
      "text": "For I am your servant and the son of your maidservant, a weak and short-lived man, with little understanding of justice and laws.",
      "links": "<a href='/AIV/19/116/16'>Ps. 116:16</a>; <a href='/AIV/11/3/7'>1 Kgs. 3:7</a>",
      "comment": "Humility and reliance on God are emphasized by Solomon's self-understanding. His description as 'son of your maidservant' alludes to the tradition of prayerful mothers and their importance in salvation history (see Hannah or Mary)."
    },
    {
      "pk": 27009006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 6,
      "text": "Even if someone is considered perfect among the sons of men, without the wisdom that comes from you, they will be considered nothing.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>; <a href='/AIV/20/3/7'>Prov. 3:7</a>; <a href='/AIV/46/1/19-20'>1 Cor. 1:19-20</a>",
      "comment": "True wisdom and greatness come only from God. The verse anticipates New Testament teaching on grace and the inadequacy of human effort without divine help (cf. 1 Cor 1:19-20)."
    },
    {
      "pk": 27009007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 7,
      "text": "You have chosen me to be king over your people and judge of your sons and daughters.",
      "links": "<a href='/AIV/11/3/7'>1 Kgs. 3:7</a>; <a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "Solomon recognizes his role as divinely appointed king and judge. This foreshadows the messianic king who will judge all nations."
    },
    {
      "pk": 27009008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 8,
      "text": "You commanded me to build a temple on your holy mountain, and an altar in the city where you have set your dwelling, a copy of the holy tabernacle which you prepared from the beginning.",
      "links": "<a href='/AIV/02/25/8-9'>Ex. 25:8-9</a>; <a href='/AIV/11/6/1-2'>1 Kgs. 6:1-2</a>; <a href='/AIV/58/8/5'>Heb. 8:5</a>",
      "comment": "The temple is presented as a copy of the heavenly reality. This anticipates New Testament themes of earthly worship mirroring heavenly worship, and Christ as the true temple (see Heb. 8:5, John 2:19)."
    },
    {
      "pk": 27009009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 9,
      "text": "With you is wisdom, who knows your works and was present when you made the world; who understands what is pleasing in your eyes and what is conformable to your commands.",
      "links": "<a href='/AIV/20/8/22-31'>Prov. 8:22-31</a>; <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "Wisdom as a personal presence with God from creation forward points to deeper themes in New Testament Christology about the Son sharing in God’s creative work."
    },
    {
      "pk": 27009010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 10,
      "text": "Send her out from your holy heavens, and from your glorious throne, that she may be with me and work with me, so that I may know what is pleasing to you.",
      "links": "<a href='/AIV/20/2/6'>Prov. 2:6</a>; <a href='/AIV/43/16/13'>John 16:13</a>",
      "comment": "The descent of Wisdom from heaven can be a spiritual foreshadowing of the sending of the Holy Spirit and the Incarnation of the Word who reveals the will of the Father perfectly."
    },
    {
      "pk": 27009011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 11,
      "text": "For she knows and understands all things, and she will guide me wisely in my actions and guard me with her glory.",
      "links": "<a href='/AIV/20/4/6-8'>Prov. 4:6-8</a>",
      "comment": "Wisdom is personified as a guide and protector. This anticipated future spiritual guidance, fulfilled ultimately in the New Covenant by the indwelling presence of God."
    },
    {
      "pk": 27009012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 12,
      "text": "Then my works will be pleasing to you; I will judge your people with justice, and I will be worthy of the throne of my father.",
      "links": "<a href='/AIV/11/3/28'>1 Kgs. 3:28</a>; <a href='/AIV/19/72/2'>Ps. 72:2</a>",
      "comment": "Wisdom qualifies one for rightful leadership. The verse subtly suggests that proper authority and judgment come only through divine empowerment."
    },
    {
      "pk": 27009013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 13,
      "text": "For what human being can know the counsel of God, or who can comprehend what the Lord wills?",
      "links": "<a href='/AIV/23/55/8-9'>Isa. 55:8-9</a>; <a href='/AIV/45/11/34'>Rom. 11:34</a>",
      "comment": "Recognizing the immense gap between God’s wisdom and human understanding points to humanity's need for revelation and guidance from God."
    },
    {
      "pk": 27009014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 14,
      "text": "For the reasoning of mortals is timid, and our schemes are uncertain;",
      "links": "<a href='/AIV/24/17/9'>Jer. 17:9</a>; <a href='/AIV/46/13/12'>1 Cor. 13:12</a>",
      "comment": "This demonstrates the limitations of human reason, which needs to be elevated by divine wisdom, highlighting the importance of supernatural illumination."
    },
    {
      "pk": 27009015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 15,
      "text": "for the corruptible body burdens the soul, and the earthly tent weighs down the mind with many cares.",
      "links": "<a href='/AIV/47/5/1-4'>2 Cor. 5:1-4</a>; <a href='/AIV/45/8/23'>Rom. 8:23</a>",
      "comment": "The body as a burden is a theme developed in Paul’s writings. It indicates human frailty and the hope for transformation and redemption."
    },
    {
      "pk": 27009016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 16,
      "text": "We struggle to understand even what is on earth, and we find the things at hand hard to grasp; but who has ever searched out what is in heaven?",
      "links": "<a href='/AIV/19/131/1'>Ps. 131:1</a>; <a href='/AIV/43/3/12'>John 3:12</a>",
      "comment": "This verse recognizes that divine truth greatly surpasses human ability, and anticipates the teaching of Jesus who reveals heavenly mysteries (John 3:12)."
    },
    {
      "pk": 27009017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 17,
      "text": "Who has known your counsel, unless you have given wisdom and sent your Holy Spirit from on high?",
      "links": "<a href='/AIV/23/40/13'>Isa. 40:13</a>; <a href='/AIV/43/14/26'>John 14:26</a>",
      "comment": "The Spirit from on high foreshadows the Holy Spirit’s descent at Pentecost who leads into all truth. The reference defends the divine source of true wisdom and the necessity of supernatural revelation."
    },
    {
      "pk": 27009018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 9,
      "verse": 18,
      "text": "So the paths of those on earth were made straight, and people were taught what pleases you and were saved by wisdom.",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/20/3/13-18'>Prov. 3:13-18</a>; <a href='/AIV/46/1/30'>1 Cor. 1:30</a>",
      "comment": "Divine wisdom instructs and leads humans to salvation. The New Testament sees Christ as the embodiment of God’s wisdom who perfects and reveals the straight path to the Father (1 Cor. 1:30)."
    }
  ],
  "translatedAt": "2025-12-24T07:18:24.102Z"
}