{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 16,
  "verses": [
    {
      "pk": 27016001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 1,
      "text": "For this reason, they were rightly punished by similar creatures, and tormented by a multitude of animals.",
      "links": "<a href='/AIV/02/8/16'>Exod. 8:16</a>; <a href='/AIV/02/9/8-11'>Exod. 9:8-11</a>",
      "comment": "Refers to the plagues of Egypt, where God used animals and insects as instruments of judgment. Demonstrates both God's justice and irony by punishing with similar means."
    },
    {
      "pk": 27016002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 2,
      "text": "But instead of being punished, your people received kindness. You prepared for them quails as food, a rare treat for their hunger.",
      "links": "<a href='/AIV/02/16/13'>Exod. 16:13</a>; <a href='/AIV/19/78/27-29'>Ps. 78:27-29</a>",
      "comment": "God's mercy towards His people is contrasted with His justice towards the Egyptians. Shows God's unique provision for His chosen people, prefiguring how grace comes through belonging to the one true assembly."
    },
    {
      "pk": 27016003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 3,
      "text": "To satisfy their hard desire for food, the wicked suffered even the needful appetite; but your people, after a short experience of hardship, received a new form of food.",
      "links": "<a href='/AIV/02/16/2-4'>Exod. 16:2-4</a>",
      "comment": "He contrasts the impatience of the Israelites with the suffering of the Egyptians. The 'new form of food' refers to manna, which has deep spiritual significance as a type of the bread from heaven (see John 6)."
    },
    {
      "pk": 27016004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 4,
      "text": "Indeed, it was necessary that the enemies' craving be unstoppable, so they would recognize the punishment sent to them. But even these short deprivations showed your people how you save them.",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>",
      "comment": "God uses adversity to reveal both justice to the wicked and mercy to His people. The discipline of Israel becomes a means of salvation."
    },
    {
      "pk": 27016005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 5,
      "text": "Even when fierce and deadly beasts attacked them, and they perished from venomous serpents, your anger did not persist forever.",
      "links": "<a href='/AIV/04/21/6'>Num. 21:6</a>",
      "comment": "References the episode of the fiery serpents. Demonstrates the temporary nature of God's punishment compared to His lasting mercy."
    },
    {
      "pk": 27016006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 6,
      "text": "As a warning, they were troubled for a short time, so they would have a sign of salvation, to remind them of your commandment's word.",
      "links": "<a href='/AIV/04/21/8-9'>Num. 21:8-9</a>; <a href='/AIV/43/3/14-15'>John 3:14-15</a>",
      "comment": "Mirrors the episode of the bronze serpent, which Jesus referenced about Himself. The sign points to salvation coming through a visible act linked to faith."
    },
    {
      "pk": 27016007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 7,
      "text": "Whoever turned to it was saved, not by what he saw, but by you, the Savior of all.",
      "links": "<a href='/AIV/43/3/14-16'>John 3:14-16</a>",
      "comment": "The bronze serpent was not an idol, but a means God appointed, highlighting the value of visible signs as instruments through which God works salvation—a pattern fulfilled in Christ and the sacraments."
    },
    {
      "pk": 27016008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 8,
      "text": "By this also, you convinced our enemies that you are the one who delivers from every evil.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "God's saving action is a testimony not only to His people, but a witness even to His adversaries of God's exclusive power to save."
    },
    {
      "pk": 27016009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 9,
      "text": "But the biting of locusts and flies killed them, and no remedy was found for their life, because they deserved to be punished by such things.",
      "links": "<a href='/AIV/02/8/16-24'>Exod. 8:16-24</a>",
      "comment": "Directly parallels the Egyptian plagues, revealing the appropriateness of the punishment to their sin."
    },
    {
      "pk": 27016010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 10,
      "text": "But your children were not conquered by the teeth of venomous dragons, for your mercy came and healed them.",
      "links": "<a href='/AIV/04/21/6-9'>Num. 21:6-9</a>",
      "comment": "A clear comparison between punishment and mercy. Healing is linked to obedience and God’s appointed means."
    },
    {
      "pk": 27016011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 11,
      "text": "They were reminded by your rebuke and quickly saved, so that they would not sink into deep forgetfulness nor remain distant from your kindness.",
      "links": "<a href='/AIV/05/8/5'>Deut. 8:5</a>",
      "comment": "Shows the discipline of the Lord is medicinal, intended to return the people to His grace."
    },
    {
      "pk": 27016012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 12,
      "text": "No herb nor ointment healed them, but your word, O Lord, which heals all things.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/40/8/8'>Matt. 8:8</a>",
      "comment": "Emphasizes the primacy of God's Word in healing, prefiguring how Christ heals by His word and presence, even in and above physical means."
    },
    {
      "pk": 27016013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 13,
      "text": "For you have power over life and death; you lead down to the gates of Hades and bring up again.",
      "links": "<a href='/AIV/32/2/6'>Jonah 2:6</a>; <a href='/AIV/45/4/17'>Rom. 4:17</a>",
      "comment": "Demonstrates God’s absolute authority over life and death, prefiguring the resurrection (see also 1 Sam. 2:6)."
    },
    {
      "pk": 27016014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 14,
      "text": "A man, by his wickedness, can kill, but he cannot bring back the departed spirit nor free a soul held in the underworld.",
      "links": "<a href='/AIV/18/10/21-22'>Job 10:21-22</a>",
      "comment": "No human person can achieve what only God does—bring back the dead. Suggests only God's unique authority to forgive and restore from death."
    },
    {
      "pk": 27016015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 15,
      "text": "It is impossible for a man to escape your hand.",
      "links": "<a href='/AIV/18/10/7'>Job 10:7</a>",
      "comment": "God's sovereignty is over all, and none can escape His just judgment or His mercy."
    },
    {
      "pk": 27016016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 16,
      "text": "The ungodly, refusing to know you, were scourged by the strength of your arm, chased by strange rains, hail, and relentless storms, and finally consumed by fire.",
      "links": "<a href='/AIV/02/9/23-24'>Exod. 9:23-24</a>",
      "comment": "Describes the accumulation of plagues as punishment for persistent rejection of God. This also has spiritual significance as a warning against hardened hearts."
    },
    {
      "pk": 27016017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 17,
      "text": "Most remarkably, in water, which extinguishes everything, the fire burned more fiercely, for the world is the defender of the righteous.",
      "links": "<a href='/AIV/02/9/23-24'>Exod. 9:23-24</a>",
      "comment": "References the miraculous nature of the plagues—fire burned in hail without being put out. Shows God’s ability to overturn natural laws for the sake of His people."
    },
    {
      "pk": 27016018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 18,
      "text": "At one moment, the fire subdued in order not to burn the wild animals sent against the wicked, and so they would see and know your judgment. At another, it blazed fiercely, consuming everything around.",
      "links": "<a href='/AIV/19/148/8'>Ps. 148:8</a>",
      "comment": "Miraculous control of elemental forces demonstrates God's specific and tailored judgment and mercy."
    },
    {
      "pk": 27016019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 19,
      "text": "The flames, in their rage, even outshone the brightness of the light, but did not consume even the smallest animals sent against them.",
      "links": "<a href='/AIV/02/9/23-26'>Exod. 9:23-26</a>",
      "comment": "Refers to the selective nature of destruction in the plagues, illustrating God’s precise justice and mercy."
    },
    {
      "pk": 27016020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 20,
      "text": "Instead, you gave your people heavenly bread without labor, prepared from heaven—bread that had all delight and satisfied every taste.",
      "links": "<a href='/AIV/02/16/15'>Exod. 16:15</a>; <a href='/AIV/43/6/31-35'>John 6:31-35</a>",
      "comment": "The manna is described as supernatural, foreshadowing the true bread from heaven in Christ (Eucharistic imagery)."
    },
    {
      "pk": 27016021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 21,
      "text": "Your gift, manifesting your sweetness toward your children, changed to exactly what each eater wished, accommodating every taste.",
      "links": "<a href='/AIV/19/78/24-25'>Ps. 78:24-25</a>",
      "comment": "Emphasizes the personal aspect of God's provision and the spiritual reality hiding under a material form."
    },
    {
      "pk": 27016022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 22,
      "text": "Snow and ice endured the fire without melting, so that they might know after the fruit of their persecutions, the enemies would be destroyed by fire, while for your people, it even forgot its own power, so that the righteous might be refreshed.",
      "links": "<a href='/AIV/19/105/32'>Ps. 105:32</a>",
      "comment": "Miracles in nature serve as spiritual lessons: God protects and refreshes His people while enemies are judged."
    },
    {
      "pk": 27016023,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 23,
      "text": "Sometimes the flame was subdued so animals would not burn, sent to punish the wicked. At other times, it blazed fiercely, consuming all the produce of the wicked.",
      "links": "",
      "comment": "God’s control of even the flame demonstrates His power. Judgment and mercy are both at His disposal."
    },
    {
      "pk": 27016024,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 24,
      "text": "For creation, serving you its Creator, intensifies itself to punish the unjust and relaxes its power to benefit those who trust in you.",
      "links": "<a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "Even nature is subject to God's will, bringing justice or mercy as He directs."
    },
    {
      "pk": 27016025,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 25,
      "text": "For this reason, the same creation, at your command, serving both as a fierce avenger against the wicked and as a gentle benefactor to those who trust in you.",
      "links": "<a href='/AIV/19/148/8'>Ps. 148:8</a>",
      "comment": "God’s providence is universal. Nature responds differently to righteousness and wickedness."
    },
    {
      "pk": 27016026,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 26,
      "text": "Therefore, by tasting, your people learned that man does not live by bread alone, but by every word that comes from the mouth of God.",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>; <a href='/AIV/40/4/4'>Matt. 4:4</a>",
      "comment": "This key verse is quoted by Jesus in His temptation. Shows the deeper, spiritual nourishment only God gives, and the necessity to trust His word."
    },
    {
      "pk": 27016027,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 27,
      "text": "What did not destroy them when heated by fire, melted when simply warmed by a passing sunbeam.",
      "links": "<a href='/AIV/02/16/21'>Exod. 16:21</a>",
      "comment": "References manna melting in the sun. Even the smallest things obey God’s will and teach spiritual lessons."
    },
    {
      "pk": 27016028,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 28,
      "text": "Let men know that we must rise before the sun to give you thanks, and meet you at the dawning light of day.",
      "links": "<a href='/AIV/19/5/3'>Ps. 5:3</a>",
      "comment": "Calls for active, regular, and communal worship, prefiguring the daily rhythm of prayer among God's people."
    },
    {
      "pk": 27016029,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 16,
      "verse": 29,
      "text": "But the hope of the ungodly is like frost that melts away under the early morning sun, for it is useless—just as water evaporates.",
      "links": "<a href='/AIV/19/37/2'>Ps. 37:2</a>",
      "comment": "A final contrast: the foundation of the righteous is solid, but the enemies of God have no lasting hope."
    }
  ],
  "translatedAt": "2025-12-24T07:21:45.816Z"
}