{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 9,
  "verses": [
    {
      "pk": 4926601,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 1,
      "text": "God of my ancestors, Lord of mercy, you who made all things by your word,",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>, <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "The reference to God creating by His word connects to the Logos in John 1, highlighting the role of divine wisdom in creation."
    },
    {
      "pk": 4926602,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 2,
      "text": "and by your wisdom have formed humankind to rule over the creatures you have made,",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/8/2/6'>Prov. 2:6</a>",
      "comment": "This verse echoes Genesis, showing humanity's stewardship of creation. Wisdom here is personified, a theme that develops further in the New Testament."
    },
    {
      "pk": 4926603,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 3,
      "text": "and to govern the world in holiness and righteousness, and to pass judgment with uprightness of heart;",
      "links": "<a href='/AIV/19/72/1-2'>Ps. 72:1-2</a>; <a href='/AIV/20/20/7'>Prov. 20:7</a>",
      "comment": "Proper governance is rooted in divine wisdom, leading to holiness and justice—anticipating Christ's perfect kingship."
    },
    {
      "pk": 4926604,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 4,
      "text": "give me Wisdom, who stands by your throne, and do not exclude me from the number of your children.",
      "links": "<a href='/AIV/20/8/22-31'>Prov. 8:22-31</a>; <a href='/AIV/40/11/19'>Matt. 11:19</a>",
      "comment": "Wisdom is depicted as a person at God's side, linking to the Logos (Word) concept in early Christian thought and the person of Christ."
    },
    {
      "pk": 4926605,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 5,
      "text": "For I am your servant and the son of your maidservant, a man who is weak and short-lived, with little understanding of judgment and laws.",
      "links": "<a href='/AIV/19/86/16'>Ps. 86:16</a>; <a href='/AIV/18/14/1-2'>Job 14:1-2</a>",
      "comment": "The humility of the speaker acknowledges human frailty and dependence on divine guidance, a theme fulfilled in Christ’s submission."
    },
    {
      "pk": 4926606,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 6,
      "text": "For if anyone among men be perfect, yet lacking the Wisdom that comes from you, he shall be regarded as nothing.",
      "links": "<a href='/AIV/20/3/19'>Prov. 3:19</a>; <a href='/AIV/46/1/20-25'>1 Cor. 1:20-25</a>",
      "comment": "Perfect human wisdom is insufficient without God’s wisdom, alluding to the folly of Greek wisdom without Christ."
    },
    {
      "pk": 4926607,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 7,
      "text": "You have chosen me to be king over your people and judge of your sons and daughters,",
      "links": "<a href='/AIV/11/3/7-9'>1 Kings 3:7-9</a>",
      "comment": "Solomon is the speaker, echoing his prayer for wisdom to rule, which foreshadows the wisdom Christ embodies as King."
    },
    {
      "pk": 4926608,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 8,
      "text": "and have commanded me to build a temple on your holy mountain and an altar in the city of your dwelling—a copy of the holy tent you had prepared from the beginning.",
      "links": "<a href='/AIV/2/25/9'>Exod. 25:9</a>; <a href='/AIV/11/6/1'>1 Kings 6:1</a>; <a href='/AIV/58/8/5'>Heb. 8:5</a>",
      "comment": "The earthly temple is patterned after a heavenly reality, which the New Testament reveals is fulfilled in Christ (Heb. 8:5)."
    },
    {
      "pk": 4926609,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 9,
      "text": "With you is Wisdom, who knows your works and was present when you made the world; she understands what is pleasing in your eyes and what is right according to your commandments.",
      "links": "<a href='/AIV/20/8/22-30'>Prov. 8:22-30</a>; <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "Divine Wisdom's personhood and preexistence foreshadow New Testament teachings about Christ as the Wisdom and Word of God."
    },
    {
      "pk": 4926610,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 10,
      "text": "Send her out from the holy heavens, and from the throne of your glory, that she may labor with me and teach me what you are pleased with.",
      "links": "<a href='/AIV/20/2/6'>Prov. 2:6</a>; <a href='/AIV/43/14/26'>John 14:26</a>",
      "comment": "The request for wisdom links to the sending of the Holy Spirit as Teacher in John 14."
    },
    {
      "pk": 4926611,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 11,
      "text": "For she knows and understands all things, and she will guide me wisely in my actions and guard me with her glory.",
      "links": "<a href='/AIV/19/23/3'>Ps. 23:3</a>",
      "comment": "Divine Wisdom gives not only insight but direction and protection, paralleling the guidance of God’s Spirit in the believer’s life."
    },
    {
      "pk": 4926612,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 12,
      "text": "Then my works will be acceptable, and I will judge your people justly, and be worthy of my father’s throne.",
      "links": "<a href='/AIV/19/51/19'>Ps. 51:19</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "Human works gain acceptance through divine wisdom—anticipating the need for God’s grace and guidance to act justly."
    },
    {
      "pk": 4926613,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 13,
      "text": "For what man can know the counsel of God? Or who can understand what the Lord wills?",
      "links": "<a href='/AIV/23/40/13'>Isa. 40:13</a>; <a href='/AIV/45/11/34'>Rom. 11:34</a>",
      "comment": "God’s thoughts are beyond full human understanding, a theme Paul repeats in Romans."
    },
    {
      "pk": 4926614,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 14,
      "text": "For the plans of mortals are uncertain, and our reasonings are unstable;",
      "links": "<a href='/AIV/20/16/9'>Prov. 16:9</a>",
      "comment": "Points to human limitation and the necessity of relying on God’s wisdom rather than merely human intellect."
    },
    {
      "pk": 4926615,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 15,
      "text": "for a perishable body burdens the soul, and this earthly tent weighs down the searching mind.",
      "links": "<a href='/AIV/47/5/1-4'>2 Cor. 5:1-4</a>",
      "comment": "Reflects human weakness and mortality. The language of the 'tent' is echoed in the New Testament teaching about the resurrection body."
    },
    {
      "pk": 4926616,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 16,
      "text": "We struggle to know what is on earth, and to understand what is at hand is labor; but who has traced out what is in the heavens?",
      "links": "<a href='/AIV/40/16/2-3'>Matt. 16:2-3</a>",
      "comment": "This verse shows the limits of human perception, highlighting the value of divine revelation."
    },
    {
      "pk": 4926617,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 17,
      "text": "And who could have learned your counsel, unless you had given Wisdom and sent your holy spirit from on high?",
      "links": "<a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/44/2/17'>Acts 2:17</a>",
      "comment": "Divine wisdom and the giving of the Holy Spirit are necessary for understanding, a concept developed fully in the New Testament (Acts 2)."
    },
    {
      "pk": 4926618,
      "translation": "AIV",
      "book": 44,
      "chapter": 9,
      "verse": 18,
      "text": "Thus the paths of those on earth are set right, and people are taught what pleases you. By Wisdom they are saved.",
      "links": "<a href='/AIV/19/25/8-9'>Ps. 25:8-9</a>; <a href='/AIV/46/1/24'>1 Cor. 1:24</a>",
      "comment": "Salvation and true knowledge come through divine Wisdom, who is ultimately revealed in Christ (1 Cor. 1:24). There is a strong tradition of interpreting Wisdom as both the personification of God’s power and a type of the Incarnate Word."
    }
  ],
  "translatedAt": "2025-12-23T09:45:20.713Z"
}