{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 17,
  "verses": [
    {
      "pk": 27017001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 1,
      "text": "Great are your judgments and impossible to describe, therefore souls without discipline go astray.",
      "links": "<a href='/AIV/19/36/6'>Ps. 36:6</a>; <a href='/AIV/19/147/5'>Ps. 147:5</a>",
      "comment": "The verse emphasizes God’s unfathomable wisdom and the necessity of moral discipline, echoing the Psalms’ theme of God’s inscrutable ways. This sets the tone for the chapter’s meditation on divine justice."
    },
    {
      "pk": 27017002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 2,
      "text": "For when lawless people thought they could rule the holy nation, they were imprisoned by shadows and darkness, chained to fear and barred from your righteous light.",
      "links": "<a href='/AIV/02/10/22'>Ex. 10:22</a>; <a href='/AIV/19/107/10'>Ps. 107:10</a>",
      "comment": "This references the darkness that fell over Egypt (see Exodus) as a result of oppression, symbolizing spiritual blindness that comes from rejecting God’s order. The mention of 'holy nation' connects to Israel’s election and to the church as God’s people (cf. 1 Peter 2:9)."
    },
    {
      "pk": 27017003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 3,
      "text": "They thought to be unseen in their secret sins, veiled by forgetfulness, but they were scattered and struck with sudden terror, shaken and confounded by unseen powers.",
      "links": "<a href='/AIV/19/90/8'>Ps. 90:8</a>; <a href='/AIV/42/12/2'>Lk. 12:2</a>",
      "comment": "Highlights the universality of God's knowledge, reminding that no sin escapes His notice. This anticipates Christ’s teaching that all will be revealed (Luke 12:2), inviting reflection on confession and interior conversion."
    },
    {
      "pk": 27017004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 4,
      "text": "For the darkness that surrounded them was not ordinary, but a heavy night that came from under the earth, covering them as they tried to escape truth.",
      "links": "<a href='/AIV/02/10/21'>Ex. 10:21</a>; <a href='/AIV/19/139/12'>Ps. 139:12</a>",
      "comment": "The darkness is described as supernatural and judging, beyond human control. This echoes Old Testament plagues and the persistent motif that God’s light exposes and rescues from darkness."
    },
    {
      "pk": 27017005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 5,
      "text": "No power of fire could bring them light, and even bright stars failed to shine; only a dreadful, blazing apparition appeared to them instead.",
      "links": "<a href='/AIV/02/10/23'>Ex. 10:23</a>",
      "comment": "All natural means of light are useless before God’s judgment, reinforcing His sovereignty over creation. The false light appears as a warning against idols and self-sufficiency."
    },
    {
      "pk": 27017006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 6,
      "text": "They were terrified by mere sounds, and by the silence they were haunted and imagined evils greater than reality.",
      "links": "<a href='/AIV/02/10/22-23'>Ex. 10:22-23</a>; <a href='/AIV/19/73/19'>Ps. 73:19</a>",
      "comment": "Fear produced by conscience and abandonment by God is often greater than external threats. This illustrates the effect of separation from grace."
    },
    {
      "pk": 27017007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 7,
      "text": "No power of magic or wise counsel could relieve them, but fear came, a judgment that mocked their boastful wisdom.",
      "links": "<a href='/AIV/02/07/11'>Ex. 7:11</a>; <a href='/AIV/23/44/25'>Isa. 44:25</a>",
      "comment": "Rebukes reliance on magic and pagan wisdom, as God’s judgment surpasses any created remedy. Implies the necessity for humble reliance on divine revelation and mediation."
    },
    {
      "pk": 27017008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 8,
      "text": "Those who claim to banish fear and confusion themselves were struck with terror, failing to see the true reason for their affliction.",
      "links": "<a href='/AIV/23/47/12-13'>Isa. 47:12-13</a>",
      "comment": "This exposes the limits of human power and the futility of superstition, reinforcing dependence on the one true God for spiritual protection."
    },
    {
      "pk": 27017009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 9,
      "text": "Even if nothing frightening appeared, being left alone gave them the sense that unseen dangers threatened them; filled with dread, they fled from mere wind or the sound of a bird fluttering among branches.",
      "links": "<a href='/AIV/19/53/5'>Ps. 53:5</a>",
      "comment": "Shows how guilt and separation from truth produce paranoia, a spiritual reality brought out by an empty conscience."
    },
    {
      "pk": 27017010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 10,
      "text": "The hissing of snakes or beasts roaring echoed in their ears, and they fell into panic, fearing death above all else.",
      "links": "<a href='/AIV/19/91/5-6'>Ps. 91:5-6</a>",
      "comment": "Echoes Psalm 91, where trust in God dispels fear. Here, lack of faith leads only to terror, highlighting the peace that comes from a righteous relationship with God."
    },
    {
      "pk": 27017011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 11,
      "text": "Wickedness is cowardly and condemned by its own evidence; disturbed conscience always expects punishment.",
      "links": "<a href='/AIV/01/04/13-14'>Gen. 4:13-14</a>; <a href='/AIV/19/32/4'>Ps. 32:4</a>",
      "comment": "Draws upon Cain’s distress after sinning (Genesis 4), explaining how guilt leads to fear. Suggests that freedom from fear comes through mercy and reconciliation."
    },
    {
      "pk": 27017012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 12,
      "text": "Fear has no real substance except the surrender of help from reason; when hope is turned aside from within, the mind is overcome by the expectant torment.",
      "links": "<a href='/AIV/19/94/19'>Ps. 94:19</a>",
      "comment": "Connects loss of reason to loss of hope, a spiritual reminder to maintain order and faith in the midst of trials. Suffering is most acute when man loses sight of God’s providence."
    },
    {
      "pk": 27017013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 13,
      "text": "In night’s darkest hour, powerless to resist, they saw visions that terrified them and were paralyzed by fear.",
      "links": "<a href='/AIV/19/77/4'>Ps. 77:4</a>",
      "comment": "Night, in biblical imagery, is a time of trial and temptation, but also purgation. Here, their experience is reminiscent of God’s purifying presence."
    },
    {
      "pk": 27017014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 14,
      "text": "No matter where they hid, the forces that held them captive followed; all kinds of strange sounds haunted them, and ghosts appeared with faces gloomy and grim.",
      "links": "<a href='/AIV/02/11/6'>Ex. 11:6</a>",
      "comment": "References the plague of Egypt and the presence of death, showing the inescapability of divine retribution for hardened hearts."
    },
    {
      "pk": 27017015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 15,
      "text": "No fire’s strength could give them light, nor the stars’ brilliance brighten the night; only a pale, dim glow appeared, like the foretaste of doom.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>",
      "comment": "An image of judgment, aligning with prophetic scenes of darkness that signal God’s intervention and the need for repentance and conversion."
    },
    {
      "pk": 27017016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 16,
      "text": "In terror, they kept falling and believing themselves to be at death’s door, even when nothing harmed them physically.",
      "links": "<a href='/AIV/19/38/6'>Ps. 38:6</a>",
      "comment": "Brings out the psychological affliction caused by sin, showing that distance from God affects both body and soul."
    },
    {
      "pk": 27017017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 17,
      "text": "Even if they fell asleep, troubled dreams terrified them, and they were cast into confusion, fearing things far greater than the reality.",
      "links": "<a href='/AIV/27/4/5'>Dan. 4:5</a>; <a href='/AIV/18/7/14'>Job 7:14</a>",
      "comment": "Dreams and nightmares under judgment recall Daniel and Job, where God uses interior distress to awaken repentance."
    },
    {
      "pk": 27017018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 18,
      "text": "Thus, they could not escape fear, for overshadowed by helplessness, and with breath approaching death, they believed themselves lost.",
      "links": "<a href='/AIV/23/57/20'>Isa. 57:20</a>",
      "comment": "Describes the despair that results from separation from God's grace. This calls to mind the peace given to the righteous (cf. Isaiah 57:21), available through faith and sacramental life."
    },
    {
      "pk": 27017019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 19,
      "text": "For wickedness, when condemned by its own witness, is always afraid, and accuses itself, weighed down by a troubled conscience.",
      "links": "<a href='/AIV/19/32/3-5'>Ps. 32:3-5</a>; <a href='/AIV/62/3/20'>1 Jn. 3:20</a>",
      "comment": "Links to the need for true contrition and a clear conscience, as affirmed by John: 'If our hearts condemn us.' The Bible urges entrance into true peace through repentance and reconciliation."
    },
    {
      "pk": 27017020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 20,
      "text": "For fear is nothing but surrender of the help that comes from reason, and when hope within is taken away, the mind is overcome by the expectation of suffering.",
      "links": "<a href='/AIV/19/42/11'>Ps. 42:11</a>",
      "comment": "Repeats from verse 12, emphasizing the spiritual consequences of hopelessness. This points toward the value of faith and the peace brought through sacramental grace and prayer."
    },
    {
      "pk": 27017021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 17,
      "verse": 21,
      "text": "Thus, while heaven’s power remained calm, and the stars moved steadily through their paths, the darkness held them captive, showing that faithfulness to the higher order brings peace while rebellion invites chaos.",
      "links": "<a href='/AIV/01/01/14-18'>Gen. 1:14-18</a>; <a href='/AIV/19/19/1-6'>Ps. 19:1-6</a>",
      "comment": "Contrasts the order of creation with the confusion wrought by sin. The constancy of the heavens is a symbol of the peace given to those who live within God’s covenant—a subtle reminder of the preservation offered through apostolic continuity and obedience to divine authority."
    }
  ],
  "translatedAt": "2025-12-24T07:22:06.804Z"
}