{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 18,
  "verses": [
    {
      "pk": 3401801,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 1,
      "text": "But for your holy ones, there was a very great light. Their enemies heard their voices but did not see them. They called them blessed because they had not suffered the same evils.",
      "links": "<a href='/AIV/2/10/23'>Ex. 10:23</a>; <a href='/AIV/19/97/11'>Ps. 97:11</a>",
      "comment": "This verse mirrors the Exodus account, emphasizing God's unique protection over his people. The contrast between darkness and light recalls God's separation and guidance of Israel (Ex. 10:23)."
    },
    {
      "pk": 3401802,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 2,
      "text": "Instead, they were harmed by darkness, while you gave your people a pillar of fire to guide them on a journey they did not know.",
      "links": "<a href='/AIV/2/13/21'>Ex. 13:21</a>; <a href='/AIV/19/78/14'>Ps. 78:14</a>",
      "comment": "The pillar of fire represents God's continual presence, paralleling the Holy Spirit's role in guiding the faithful (cf. John 14:16–17)."
    },
    {
      "pk": 3401803,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 3,
      "text": "They deserved to lose the light and be imprisoned by darkness, those who had held your children captive. Through whom the light of the law would be given to the world.",
      "links": "<a href='/AIV/2/14/20'>Ex. 14:20</a>; <a href='/AIV/19/78/50'>Ps. 78:50</a>",
      "comment": "This foreshadows the arrival of Christ, the true Light, through Israel (John 1:9), and alludes to the greater salvation found in the law and its fulfillment."
    },
    {
      "pk": 3401804,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 4,
      "text": "When they decided to kill the infants of your holy ones, you delivered them. You took away one and saved another. And you destroyed multitudes together in mighty water.",
      "links": "<a href='/AIV/2/1/22'>Ex. 1:22</a>; <a href='/AIV/2/14/28'>Ex. 14:28</a>",
      "comment": "The sparing of Moses prefigures deliverance in baptism (1 Pet. 3:20–21). The passage echoes the pattern of salvation and judgment."
    },
    {
      "pk": 3401805,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 5,
      "text": "That night was made known beforehand to our ancestors, so that, knowing the oaths they trusted in, they would have courage.",
      "links": "<a href='/AIV/2/12/21-28'>Ex. 12:21–28</a>",
      "comment": "Refers to the Passover, a sign of both physical and spiritual deliverance, later fulfilled in Christ’s sacrifice (1 Cor. 5:7–8)."
    },
    {
      "pk": 3401806,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 6,
      "text": "Your people received the salvation of the righteous and the destruction of their enemies together.",
      "links": "<a href='/AIV/2/14/30'>Ex. 14:30</a>; <a href='/AIV/19/136/15'>Ps. 136:15</a>",
      "comment": "Salvation and judgment are intertwined—a theme culminating in the final judgment and reward of the faithful (Matt. 25:31–34,41)."
    },
    {
      "pk": 3401807,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 7,
      "text": "With what they had been punished, they honored your people, for you called them to yourself.",
      "links": "<a href='/AIV/2/12/35-36'>Ex. 12:35–36</a>; <a href='/AIV/1/15/13-14'>Gen. 15:13–14</a>",
      "comment": "The reversal of fortunes highlights divine justice and the calling into covenant relationship—pointing to the universal call to holiness (Rom. 8:28–30)."
    },
    {
      "pk": 3401808,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 8,
      "text": "For during that secret night, our ancestors kept watch, confident in the promise they trusted in.",
      "links": "<a href='/AIV/2/12/42'>Ex. 12:42</a>; <a href='/AIV/19/130/6'>Ps. 130:6</a>",
      "comment": "Night as a time of vigil prefigures the Christian tradition of keeping watch for the Lord’s coming (Mark 13:35–37)."
    },
    {
      "pk": 3401809,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 9,
      "text": "They sang the praises of their ancestors, and with one mind gave thanks, because salvation was sure and the destruction of their enemies was nearby.",
      "links": "<a href='/AIV/2/15/1-2'>Ex. 15:1–2</a>; <a href='/AIV/19/106/12'>Ps. 106:12</a>",
      "comment": "The unity of worship and thanksgiving anticipates the Church’s united liturgy—praising God for deliverance (Acts 2:42,46)."
    },
    {
      "pk": 3401810,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 10,
      "text": "For the cries of the enemies echoed, and the lamenting of those mourning their children spread throughout the camp.",
      "links": "<a href='/AIV/2/12/30'>Ex. 12:30</a>",
      "comment": "The judgment on Egypt’s firstborn is a symbol of sin’s consequences—reminding us of the seriousness of rejecting God (Rom. 6:23)."
    },
    {
      "pk": 3401811,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 11,
      "text": "Both the servant and the master were punished in the same way, and the common man and the king suffered equally.",
      "links": "<a href='/AIV/2/12/29'>Ex. 12:29</a>",
      "comment": "God’s justice is impartial (Acts 10:34; Rom. 2:11), showing all stand equal before the Lord."
    },
    {
      "pk": 3401812,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 12,
      "text": "Together they died, and countless dead were found, for not enough living were left to bury them. For in a single moment, their most precious ones were destroyed.",
      "links": "<a href='/AIV/2/12/30'>Ex. 12:30</a>; <a href='/AIV/23/37/36'>Isa. 37:36</a>",
      "comment": "Parallels to mass judgments in Israel’s history stress the gravity of rebellion against God—foreshadowing final judgment (Rev. 20:12–15)."
    },
    {
      "pk": 3401813,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 13,
      "text": "Those who had not believed anything beforehand, after the destruction, acknowledged at the end that this nation was God’s son.",
      "links": "<a href='/AIV/2/4/22'>Ex. 4:22</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "Israel’s identity as God’s son points ahead to the New Testament affirmation of Jesus as the unique Son (Matt. 3:17), and believers as adopted sons (Rom. 8:15)."
    },
    {
      "pk": 3401814,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 14,
      "text": "When calm stillness encompassed everything, and the night was at its deepest, your all-powerful word leaped down from heaven’s throne into the midst of a doomed land.",
      "links": "<a href='/AIV/2/12/29'>Ex. 12:29</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "God’s Word coming down is a direct foreshadow of the Incarnation (John 1:14). In both judgment and salvation, the Divine Word accomplishes God’s purpose."
    },
    {
      "pk": 3401815,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 15,
      "text": "Carrying a sharp sword, your unchanging command, he stood and filled everything with death, standing on earth and touching heaven.",
      "links": "<a href='/AIV/66/1/16'>Rev. 1:16</a>; <a href='/AIV/19/149/6'>Ps. 149:6</a>",
      "comment": "The ‘sharp sword’ is symbolic of the living and active word of God (Heb. 4:12, Rev. 1:16), a source of both judgment and salvation."
    },
    {
      "pk": 3401816,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 16,
      "text": "Sudden terrors troubled them, and they were thrown down unexpectedly. Fearful visions appeared, and their hearts failed, as your judgments fell.",
      "links": "<a href='/AIV/2/12/29'>Ex. 12:29</a>; <a href='/AIV/19/73/19'>Ps. 73:19</a>",
      "comment": "The theme of divine justice reminds readers not only of accountability, but also the need for readiness and faithfulness (Matt. 24:44)."
    },
    {
      "pk": 3401817,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 17,
      "text": "Wherever one lay dead, half-dead bodies were revealed. Their dreams warned them of why they were being punished.",
      "links": "<a href='/AIV/1/41/8'>Gen. 41:8</a>; <a href='/AIV/2/12/30'>Ex. 12:30</a>",
      "comment": "Even dreams and visions served God’s purpose—anticipating New Testament teaching on God speaking through many ways (Acts 2:17; Heb. 1:1–2)."
    },
    {
      "pk": 3401818,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 18,
      "text": "So that they might not die without knowing why they suffered, fearful visions showed them beforehand why they were being punished.",
      "links": "<a href='/AIV/1/20/3'>Gen. 20:3</a>",
      "comment": "This underlines God’s mercy, even in judgment—He reveals rather than leaving people in ignorance (1 Tim. 2:4)."
    },
    {
      "pk": 3401819,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 19,
      "text": "Tests of wrath also struck the living. They were disturbed by these fears, and judgment came upon them, for a sudden and unexpected terror had fallen on them.",
      "links": "<a href='/AIV/2/12/31-34'>Ex. 12:31–34</a>",
      "comment": "The ‘terror’ echoes the Passover night, and the fear of judgment highlights the need for ongoing repentance and humble trust in God’s mercy."
    },
    {
      "pk": 3401820,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 20,
      "text": "Then the destruction of the firstborn was announced, and they each vowed to plead for mercy, because they had not believed with faith and now suffered destruction.",
      "links": "<a href='/AIV/2/12/29'>Ex. 12:29</a>",
      "comment": "Their desperation and plea for mercy parallels the need for repentance before God’s final judgment (Luke 13:3; Acts 2:38)."
    },
    {
      "pk": 3401821,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 21,
      "text": "But your blameless servant hurried to shield them, carrying the intercessory prayer and the atoning sacrificial incense. He stood firm, and the plague was stopped, showing that your service has power.",
      "links": "<a href='/AIV/4/16/46-48'>Num. 16:46–48</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "The mediation and atoning role prefigures Christ’s unique high priestly mediation (Heb. 7:25), pointing to an ongoing ministry of intercession."
    },
    {
      "pk": 3401822,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 22,
      "text": "He resisted wrath and set an end to it, by reminding them of the sworn promises made to their ancestors.",
      "links": "<a href='/AIV/4/16/46-50'>Num. 16:46–50</a>; <a href='/AIV/1/22/17-18'>Gen. 22:17–18</a>",
      "comment": "Remembrance of God’s promises is foundational to faith and worship, and the efficacy of priestly intercession—reflecting faith’s continuity across generations."
    },
    {
      "pk": 3401823,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 23,
      "text": "He faced the wrath, not with physical strength or weapons, but with the word, and he brought to remembrance the oaths and covenants made with their ancestors, calming the wrath.",
      "links": "<a href='/AIV/2/32/11-14'>Ex. 32:11–14</a>; <a href='/AIV/1/17/7'>Gen. 17:7</a>",
      "comment": "Highlights the power and necessity of intercession for God’s people (cf. 1 Tim. 2:1–2), and the role of faithfulness to covenant."
    },
    {
      "pk": 3401824,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 24,
      "text": "For on his robe was the whole world, and on the four rows of precious stones were the glorious names of your glorious ones. The Majesty was set upon his diadem.",
      "links": "<a href='/AIV/2/28/15-21'>Ex. 28:15–21</a>; <a href='/AIV/2/28/36-38'>Ex. 28:36–38</a>",
      "comment": "The description of the high priest’s vestments shows a worldwide mediation and anticipates Christ’s priestly role, uniting humanity to God through a continuing ministry."
    },
    {
      "pk": 3401825,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 25,
      "text": "A destroyer yielded to these symbols, and was afraid; for only a taste of the wrath was enough.",
      "links": "<a href='/AIV/4/16/48'>Num. 16:48</a>",
      "comment": "The symbols and mediation show God’s appointed means of grace, foreshadowing sacraments and visible signs through which divine power is made present (see John 6:53–58; James 5:14–16)."
    }
  ],
  "translatedAt": "2025-12-23T09:49:34.903Z"
}