{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 13,
  "verses": [
    {
      "pk": 13901301,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 1,
      "text": "Certainly, all those who do not know God are vain by nature, and from the good things that are seen, they were not able to understand Him who is, nor recognize the craftsman from His works.",
      "links": "<a href='/AIV/19/14/1'>Psalm 14:1</a>; <a href='/AIV/45/1/19-20'>Romans 1:19–20</a>",
      "comment": "Here, the text notes the folly of those who fail to recognize God's existence through creation, echoing Paul's arguments in Romans. The emphasis on recognizing the Creator from creation aligns with traditional Christian natural theology."
    },
    {
      "pk": 13901302,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 2,
      "text": "But they supposed that fire or wind or swift air or the circle of stars or turbulent water or the lights of heaven were gods that rule the world.",
      "links": "<a href='/AIV/23/44/17'>Isaiah 44:17</a>",
      "comment": "The author criticizes idolatry and the mistaken worship of created things, a theme found throughout the Old Testament. The listing of elements highlights worship gone astray."
    },
    {
      "pk": 13901303,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 3,
      "text": "If by the beauty of these things people were led to believe them to be gods, let them know how much more excellent is their Lord, for the origin of beauty created them.",
      "links": "<a href='/AIV/19/96/5'>Psalm 96:5</a>",
      "comment": "This verse echoes the idea that all beauty and goodness points beyond itself to its divine Source—a classic example of how creation leads to contemplation of the Creator."
    },
    {
      "pk": 13901304,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 4,
      "text": "But even then, they are not excused, for if they were able to know so much that they could study the world, how did they not more quickly find its Master?",
      "links": "<a href='/AIV/45/1/21'>Romans 1:21</a>",
      "comment": "The text underlines human responsibility to seek God diligently. Even knowledge of the creation should move one to seek its Author, highlighting the universal call to know the truth."
    },
    {
      "pk": 13901305,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 5,
      "text": "For through the greatness and beauty of created things, the Creator is contemplated by analogy.",
      "links": "<a href='/AIV/19/19/1'>Psalm 19:1</a>; <a href='/AIV/45/1/20'>Romans 1:20</a>",
      "comment": "Here we see the principle that creation reveals aspects of God’s nature—his greatness, wisdom, and glory."
    },
    {
      "pk": 13901306,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 6,
      "text": "Yet these people deserve only mild rebuke, for perhaps they go astray while seeking God and earnestly wanting to find Him.",
      "links": "<a href='/AIV/44/17/27'>Acts 17:27</a>",
      "comment": "This verse shows compassion for sincere seekers, recognizing human yearning for the divine while gently correcting their error. It mirrors Paul's words about seeking God in hope."
    },
    {
      "pk": 13901307,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 7,
      "text": "Living among His works, they strive to recognize Him, but are drawn away by the appearance of what they see, for the things seen are beautiful.",
      "links": "<a href='/AIV/19/8/3'>Psalm 8:3</a>",
      "comment": "This highlights both the attraction of the visible world and the challenge to lift one's eyes toward the invisible God behind creation."
    },
    {
      "pk": 13901308,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 8,
      "text": "But again, they are not to be excused.",
      "links": "",
      "comment": "The text repeats human accountability in finding God, even amidst genuine seeking."
    },
    {
      "pk": 13901309,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 9,
      "text": "For if they had the ability to know so much that they could investigate the world, how is it that they failed to find its Lord?",
      "links": "<a href='/AIV/45/2/1'>Romans 2:1</a>",
      "comment": "This rhetorical question exposes the inconsistency of human intellect when divorced from worship and ultimate truth."
    },
    {
      "pk": 13901310,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 10,
      "text": "But far worse are those who place hopes in lifeless things, fashioning images of gods from gold and silver, or from human skill in shaping figures.",
      "links": "<a href='/AIV/23/44/9-20'>Isaiah 44:9–20</a>; <a href='/AIV/19/135/15-18'>Psalm 135:15–18</a>",
      "comment": "This verse draws from classic biblical condemnations of idolatry. Notice the difference between mere mistaken seekers and those actively promoting idolatrous practices."
    },
    {
      "pk": 13901311,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 11,
      "text": "Just as a craftsman saws a suitable tree, strips all its bark with skill, and shapes it in elegant form for daily use.",
      "links": "<a href='/AIV/23/44/13'>Isaiah 44:13</a>",
      "comment": "The imagery recalls woodworkers making idols, emphasizing the absurdity of worshipping objects made by human hands."
    },
    {
      "pk": 13901312,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 12,
      "text": "Then he uses the scraps to cook his food and eat his fill;",
      "links": "<a href='/AIV/23/44/15-17'>Isaiah 44:15–17</a>",
      "comment": "The text shows the practical use of creation, contrasted with the foolishness of idol-making. The intent is to demonstrate the irrationality of fashioning gods from leftover wood."
    },
    {
      "pk": 13901313,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 13,
      "text": "yet with the remainder, which serves no purpose, he carves a likeness of a worthless idol, lips laced with paint, eyes colored with red, and beautifies it to look like a person.",
      "links": "",
      "comment": "This specific detail underscores the human tendency to create gods in one's own image, reversing the true order where humanity is made in God's image."
    },
    {
      "pk": 13901314,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 14,
      "text": "He secures it in the wall, fixes it with iron nails, so it will not fall.",
      "links": "<a href='/AIV/23/41/7'>Isaiah 41:7</a>",
      "comment": "This further emphasizes idolatry’s impotence: gods that must be propped up by human help are not true gods."
    },
    {
      "pk": 13901315,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 15,
      "text": "He prepares it, knowing it cannot move; yet he prays to it for possessions, for health, and seeks life from something dead.",
      "links": "<a href='/AIV/19/115/4-7'>Psalm 115:4–7</a>",
      "comment": "This is an ironic and tragic depiction of misplaced worship, consistent with scriptural arguments against idolatry."
    },
    {
      "pk": 13901316,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 16,
      "text": "He calls upon a fragile thing for help, entreats a lifeless object for rescue, prays for success to something that is powerless.",
      "links": "<a href='/AIV/23/46/7'>Isaiah 46:7</a>",
      "comment": "This is a continued lament about the folly of trusting in idols, compared to God who is living and powerful."
    },
    {
      "pk": 13901317,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 17,
      "text": "For his prayer is to what is dead, and it is the hands of men that have shaped it. He asks about things he cannot see from someone who cannot see.",
      "links": "",
      "comment": "This sharp critique highlights the emptiness of idolatry—seeking guidance from mute and blind objects."
    },
    {
      "pk": 13901318,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 18,
      "text": "He seeks protection from something that cannot protect itself—neither its life nor his own; and he prays for healing from something that is unable to heal.",
      "links": "",
      "comment": "The inability of idols to save is a repeated theme throughout both Scriptures and traditional Christian thought."
    },
    {
      "pk": 13901319,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 19,
      "text": "So it is for those who make them, and those who trust in them.",
      "links": "<a href='/AIV/19/135/18'>Psalm 135:18</a>",
      "comment": "The final verse serves as a warning: those who place their faith in idols share in their ultimate futility. On a deeper level, it points subtly toward the greater call to worship with reverence and faith, and to seek the true God above all things—a call foundational to the faith and tradition handed down through the generations."
    }
  ],
  "translatedAt": "2025-12-23T09:46:51.442Z"
}