{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 12,
  "verses": [
    {
      "pk": 2312001,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 1,
      "text": "Your immortal Spirit is in all things.",
      "links": "<a href='/AIV/18/34/14-15'>Job 34:14-15</a>; <a href='/AIV/19/104/29-30'>Ps. 104:29-30</a>",
      "comment": "This verse reflects on God's Spirit permeating all creation, echoing themes found in Job and Psalms, where creation depends on God’s sustaining breath."
    },
    {
      "pk": 2312002,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 2,
      "text": "Therefore, You correct little by little those who stray, and remind them of their sins so they may turn away from evil and trust in You, Lord.",
      "links": "<a href='/AIV/19/25/8-9'>Ps. 25:8-9</a>; <a href='/AIV/23/30/18-19'>Isa. 30:18-19</a>",
      "comment": "The verse highlights the patience and mercy of God in correction, inviting sinners to repentance—a recurring biblical theme. God's gradual correction reveals His desire for all to be saved."
    },
    {
      "pk": 2312003,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 3,
      "text": "You hated those who dwelled in Your holy land because of the detestable acts they did.",
      "links": "<a href='/AIV/03/18/24-27'>Lev. 18:24-27</a>; <a href='/AIV/19/106/34-38'>Ps. 106:34-38</a>",
      "comment": "Here, the inhabitants of the land are condemned for their abominations, paralleling God’s judgment on the Canaanites in the Torah and Psalm 106."
    },
    {
      "pk": 2312004,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 4,
      "text": "These ancient men practiced sorcery and unholy rites—merciless child sacrifices and orgies of secret rituals.",
      "links": "<a href='/AIV/03/18/21'>Lev. 18:21</a>; <a href='/AIV/19/106/37-38'>Ps. 106:37-38</a>",
      "comment": "A vivid condemnation of pagan practices, consistent with Leviticus and Psalms. The passage underlines the seriousness with which God views worship and purity."
    },
    {
      "pk": 2312005,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 5,
      "text": "They ruthlessly killed children and feasted on human flesh and blood, participating in a secret cult.",
      "links": "<a href='/AIV/19/106/35-38'>Ps. 106:35-38</a>",
      "comment": "Emphasizes the horror of idolatrous sacrifices and cults, reinforcing the spiritual dangers of straying from God’s law."
    },
    {
      "pk": 2312006,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 6,
      "text": "You determined to destroy those murderers of innocent souls, the parents who slew helpless souls and sacrificed them in their worship.",
      "links": "<a href='/AIV/03/20/1-5'>Lev. 20:1-5</a>; <a href='/AIV/12/21/6'>2 Kings 21:6</a>",
      "comment": "God’s righteous judgment falls on those who commit atrocities, reaffirming the value of innocent life and divine justice."
    },
    {
      "pk": 2312007,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 7,
      "text": "You willed to destroy their land, which You esteemed above all for the hospitality had shown toward Your people.",
      "links": "<a href='/AIV/01/15/18-21'>Gen. 15:18-21</a>",
      "comment": "References the land given to Abraham and the special role of the Promised Land, invoking a sense of divine election and purpose."
    },
    {
      "pk": 2312008,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 8,
      "text": "Yet You did not punish them instantly but gave them time and space to repent, even though they were full of wickedness.",
      "links": "<a href='/AIV/26/18/23'>Ezek. 18:23</a>; <a href='/AIV/02/34/6'>Ex. 34:6</a>",
      "comment": "God’s patience is highlighted, echoing His merciful attributes. Even sinners are granted time to repent, emphasizing His love and hope for conversion."
    },
    {
      "pk": 2312009,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 9,
      "text": "For Your power is so unchallenged, that You can judge with gentleness and rule with great patience over all.",
      "links": "<a href='/AIV/19/86/15'>Ps. 86:15</a>; <a href='/AIV/45/2/4'>Rom. 2:4</a>",
      "comment": "God’s sovereignty enables mercy, showing His authority is never threatened and His gentleness stems from strength."
    },
    {
      "pk": 2312010,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 10,
      "text": "You instruct Your people so that the just may love mankind, and grant repentance in hope, not in condemnation.",
      "links": "<a href='/AIV/45/2/4'>Rom. 2:4</a>; <a href='/AIV/61/3/9'>2 Pet. 3:9</a>",
      "comment": "A call to imitate God’s love and mercy, inviting believers to offer hope and reconciliation rather than anger—a spiritual principle for life in Christ."
    },
    {
      "pk": 2312011,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 11,
      "text": "Through Your discipline, even those who rebel may learn, reminding us that with one word You could have condemned them forever.",
      "links": "<a href='/AIV/01/1/3'>Gen. 1:3</a>; <a href='/AIV/40/8/8-10'>Matt. 8:8-10</a>",
      "comment": "Shows God’s discipline is meant for conversion, not destruction, reflecting divine restraint and grace. The power in God’s word is also linked to Christ’s authority."
    },
    {
      "pk": 2312012,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 12,
      "text": "For who can say to You, ‘What have You done?’ Or who stands against Your judgment?",
      "links": "<a href='/AIV/18/9/12'>Job 9:12</a>; <a href='/AIV/45/9/20-21'>Rom. 9:20-21</a>",
      "comment": "Affirms God’s absolute sovereignty—no one can question His purposes or justice."
    },
    {
      "pk": 2312013,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 13,
      "text": "There is no god besides You who should take care of all things. You demonstrate that Your justice is not partial.",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>; <a href='/AIV/41/12/32'>Mark 12:32</a>",
      "comment": "Declares monotheism and God’s impartial justice, anticipating Christ’s teachings on the one true God."
    },
    {
      "pk": 2312014,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 14,
      "text": "No king or ruler can challenge You, or demand an account for those You have punished.",
      "links": "<a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>",
      "comment": "God stands above all earthly authority, a reminder of divine judgement superseding human justice."
    },
    {
      "pk": 2312015,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 15,
      "text": "Since You are righteous, You rule all things righteously. It would be unjust for anyone to challenge Your justice.",
      "links": "<a href='/AIV/05/32/4'>Deut. 32:4</a>",
      "comment": "Reinforces that God’s judgments are always fair, consistent with the witness of the Law and prophets."
    },
    {
      "pk": 2312016,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 16,
      "text": "For Your power is the source of justice, and You judge us all with care and patience.",
      "links": "<a href='/AIV/19/103/8-10'>Ps. 103:8-10</a>",
      "comment": "Underscores God’s patient and providential care in dealing with His creation, hinting at the loving judgment promised in Christ."
    },
    {
      "pk": 2312017,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 17,
      "text": "Though You are mighty, You judge with great mercy, and You command us to act uprightly and hope for Your forgiveness.",
      "links": "<a href='/AIV/19/130/4'>Ps. 130:4</a>; <a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>",
      "comment": "God’s expectation of our uprightness paired with His mercy prefigures Christ's message of forgiveness and reconciliation."
    },
    {
      "pk": 2312018,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 18,
      "text": "Your patience teaches Your people that the righteous must be kind, and You have shown Your sons that mercy should not be denied.",
      "links": "<a href='/AIV/19/25/6'>Ps. 25:6</a>; <a href='/AIV/40/5/7'>Matt. 5:7</a>",
      "comment": "This verse links God's mercy with our call to imitate it, a foundational moral principle. Christ later urges His followers to embrace mercy."
    },
    {
      "pk": 2312019,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 19,
      "text": "You taught Your people, by such deeds, that the righteous must be compassionate, and you gave Your children hope of repentance for their sins.",
      "links": "<a href='/AIV/41/2/17'>Mark 2:17</a>; <a href='/AIV/61/3/9'>2 Pet. 3:9</a>",
      "comment": "God's actions instruct His people in compassion and continually hold out the possibility of repentance, anticipating the full forgiveness offered in Christ."
    },
    {
      "pk": 2312020,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 20,
      "text": "Even the enemies of Your people, You punished with great care and for their benefit, granting them room to repent from their wickedness.",
      "links": "<a href='/AIV/26/33/11'>Ezek. 33:11</a>",
      "comment": "God’s justice is always entwined with mercy, offering time for change—an essential principle throughout the Scriptures and emphasized by Christ’s teaching."
    },
    {
      "pk": 2312021,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 21,
      "text": "But even if they did not heed Your warnings, knowing they were born with a corrupt nature, You did not destroy them instantly, but gave them many opportunities to turn back.",
      "links": "<a href='/AIV/19/78/38-39'>Ps. 78:38-39</a>",
      "comment": "Emphasizes God’s extraordinary patience, providing repeated chances for conversion—highlighting original sin and the necessity of ongoing repentance."
    },
    {
      "pk": 2312022,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 22,
      "text": "If You patiently correct Your own sons and daughters, You rebuke and discipline foreigners even more carefully. In this way, Your people reflect on Your goodness and wait for mercy upon themselves.",
      "links": "<a href='/AIV/58/12/6-7'>Heb. 12:6-7</a>; <a href='/AIV/20/3/12'>Prov. 3:12</a>",
      "comment": "The discipline of God is both proof of His love and a call for reflection and repentance, anticipating Christ’s exhortations to forgiveness and mercy."
    },
    {
      "pk": 2312023,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 23,
      "text": "You punished them who lived unrighteously in their ancestral ways, yet You gave them space to abandon their evildoing.",
      "links": "<a href='/AIV/26/18/21-23'>Ezek. 18:21-23</a>",
      "comment": "God’s judgments are intended for repentance, not mere retribution, stressing an invitation for conversion by grace."
    },
    {
      "pk": 2312024,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 24,
      "text": "For You knew they were deeply corrupt, born of wickedness, and could not turn from it, unless compelled by Your grace.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>",
      "comment": "Affirms the doctrine of original sin and the necessity of grace for conversion, which later gains fuller understanding in the teachings of Christ and the apostles."
    },
    {
      "pk": 2312025,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 25,
      "text": "They believed falsely and lived lives of vanity, so You gently corrected them, reminding them who You are—the supreme Lord.",
      "links": "<a href='/AIV/19/94/10-11'>Ps. 94:10-11</a>",
      "comment": "God’s corrections direct people back to true faith, challenging idolatry and reminding all of His sovereign lordship, a theme fulfilled in the revelation of Christ."
    },
    {
      "pk": 2312026,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 26,
      "text": "For this reason, You punished them who lived unrighteously with their own abominations.",
      "links": "<a href='/AIV/03/18/25'>Lev. 18:25</a>",
      "comment": "Divine justice operates through allowing the consequences of sin to fall on the wicked, matching the Torah’s teaching."
    },
    {
      "pk": 2312027,
      "translation": "AIV",
      "book": 44,
      "chapter": 12,
      "verse": 27,
      "text": "Yet, for those who turn from evil, You show great kindness, for You are the Lord, loving all that You have made.",
      "links": "<a href='/AIV/19/145/13'>Ps. 145:13</a>; <a href='/AIV/43/3/16-17'>John 3:16-17</a>",
      "comment": "Ends with affirmation of God’s love for His creation and mercy for all who repent—an anticipation of the fullness of forgiveness and mercy brought by Christ."
    }
  ],
  "translatedAt": "2025-12-23T09:46:32.095Z"
}