{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 7,
  "verses": [
    {
      "pk": 90070001,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 1,
      "text": "I too am a mortal, the same as all others, a descendant of the first-formed, created from earth.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>",
      "comment": "The speaker is King Solomon, stressing that wisdom does not come from special birth but from God. Connects to Adam’s creation, showing universal human nature."
    },
    {
      "pk": 90070002,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 2,
      "text": "In the womb of a mother I was molded into flesh, during ten months in blood, from seed by man and the pleasure that attends sleep.",
      "links": "<a href='/AIV/18/10/9-12'>Job 10:9-12</a>",
      "comment": "Underscores the natural and humble process of human birth, emphasizing that wisdom is not inherited by genealogy."
    },
    {
      "pk": 90070003,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 3,
      "text": "When I was born, I too inhaled the common air and fell upon the earth, first crying like all newborns.",
      "links": "<a href='/AIV/19/22/9-10'>Ps. 22:9-10</a>",
      "comment": "Common birth shared with all humanity, affirming every person’s equal access to wisdom by God’s grace."
    },
    {
      "pk": 90070004,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 4,
      "text": "I was nursed in swaddling clothes and cared for with worry.",
      "links": "",
      "comment": "Contrast between human vulnerability and the divine gift of wisdom that elevates man."
    },
    {
      "pk": 90070005,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 5,
      "text": "No king began life differently; all have one entrance into life and one exit.",
      "links": "<a href='/AIV/21/5/15'>Eccl. 5:15</a>",
      "comment": "Unifying human experience; wisdom’s source is divine, not hereditary or based on social status."
    },
    {
      "pk": 90070006,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 6,
      "text": "Therefore, I prayed, and understanding was given to me; I called upon God, and the spirit of wisdom came to me.",
      "links": "<a href='/AIV/59/1/5'>James 1:5</a>",
      "comment": "Prayer is key to receiving wisdom—a theme fulfilled in the New Testament when believers ask for divine wisdom."
    },
    {
      "pk": 90070007,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 7,
      "text": "I valued her above scepters and thrones, and I counted riches as nothing beside her.",
      "links": "<a href='/AIV/20/8/10-11'>Prov. 8:10-11</a>",
      "comment": "Wisdom is personified as a woman, foreshadowing the New Testament’s emphasis on Christ as true wisdom (see <a href='/AIV/46/1/30'>1 Cor. 1:30</a>)."
    },
    {
      "pk": 90070008,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 8,
      "text": "Neither compared I her to precious stones, because all gold beside her is a little sand, and silver shall be counted as clay before her.",
      "links": "<a href='/AIV/18/28/15-19'>Job 28:15-19</a>",
      "comment": "Earthly treasures pale in comparison to wisdom. Reflects teachings of Jesus about choosing the kingdom above material wealth."
    },
    {
      "pk": 90070009,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 9,
      "text": "I loved her more than health and beauty, and I chose to have her instead of light, because her radiance never fades.",
      "links": "<a href='/AIV/62/8/12'>John 8:12</a>",
      "comment": "The never-fading light of wisdom suggests divine light—fulfilled in Christ as the true light of the world."
    },
    {
      "pk": 90070010,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 10,
      "text": "All good things came to me together with her, and countless riches through her hands.",
      "links": "<a href='/AIV/20/3/16'>Prov. 3:16</a>",
      "comment": "All true blessings are given through wisdom. The theme of participation in God’s gifts points towards receiving spiritual graces."
    },
    {
      "pk": 90070011,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 11,
      "text": "I rejoiced in them all, because wisdom leads them; though I did not know that she was the mother of these.",
      "links": "",
      "comment": "Wisdom is the source of all good, with a maternal image hinting at wisdom’s nurturing and generative role."
    },
    {
      "pk": 90070012,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 12,
      "text": "What I learned without guile, I share without grudging; I do not hide her riches.",
      "links": "<a href='/AIV/40/5/15'>Matt. 5:15</a>",
      "comment": "Wisdom is meant to be shared, resonating with Jesus’ command to generously share spiritual gifts."
    },
    {
      "pk": 90070013,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 13,
      "text": "For wisdom is an inexhaustible treasure to people; those who acquire her become friends of God, praised by his gifts through instruction.",
      "links": "<a href='/AIV/19/25/14'>Ps. 25:14</a>",
      "comment": "Wisdom brings friendship with God, anticipating New Testament language of sharing in God’s nature and becoming children of God."
    },
    {
      "pk": 90070014,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 14,
      "text": "God has granted me the knowledge to speak justly. Wisdom flows from him, and he teaches us what is upright.",
      "links": "<a href='/AIV/19/51/15'>Ps. 51:15</a>",
      "comment": "Divinely granted speech—echoes prophetic inspiration and apostolic teaching authority."
    },
    {
      "pk": 90070015,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 15,
      "text": "For wisdom knows both the past and future; she interprets signs and wonders, and the turning of seasons and times.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "Wisdom’s comprehensive knowledge overlaps with the Omniscience of God; all understanding flows from Him."
    },
    {
      "pk": 90070016,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 16,
      "text": "She knows the beginning and end of times, and the changes in customs and speech.",
      "links": "",
      "comment": "Echoes biblical themes of wisdom overseeing all history—prefigures Christ as Alpha and Omega."
    },
    {
      "pk": 90070017,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 17,
      "text": "She can recount hidden things and foretell what is to come; she understands words, solutions, and riddles.",
      "links": "<a href='/AIV/20/1/6'>Prov. 1:6</a>",
      "comment": "Wisdom is able to penetrate mysteries—a role later fulfilled in Christ revealing the mysteries of God’s plan."
    },
    {
      "pk": 90070018,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 18,
      "text": "She has mastery over signs and wonders, the ordering of times and seasons.",
      "links": "<a href='/AIV/1/1/14'>Gen. 1:14</a>",
      "comment": "Wisdom’s oversight of creation—even over seasons—shows her foundational role in the cosmos."
    },
    {
      "pk": 90070019,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 19,
      "text": "She understands what is good and what is evil, the course of events, human passions, and the secrets of hearts.",
      "links": "<a href='/AIV/19/7/9'>Ps. 7:9</a>",
      "comment": "Wisdom searches hearts—a divine attribute pointing towards Jesus’ insight into man’s interior."
    },
    {
      "pk": 90070020,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 20,
      "text": "She possesses all knowledge—whether of crafts and sciences, or forces and powers.",
      "links": "",
      "comment": "God is the source of all true knowledge, theological and scientific—no contradiction."
    },
    {
      "pk": 90070021,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 21,
      "text": "All that is secret or manifest I learned, for wisdom, the fashioner of all things, taught me.",
      "links": "<a href='/AIV/43/1/3'>John 1:3</a>",
      "comment": "Wisdom characterized as co-creator—clear prefiguration of the Word through whom all things were made."
    },
    {
      "pk": 90070022,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 22,
      "text": "For in wisdom there is a spirit that is intelligent, holy, unique, manifold, subtle, active, clear, undefiled, distinct, loving what is good, keen, unhindered, benevolent, steadfast, unassailable,",
      "links": "",
      "comment": "List of wisdom’s attributes, many shared with the Holy Spirit, prefiguring the fullness of God's gift to the Church."
    },
    {
      "pk": 90070023,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 23,
      "text": "All-powerful, all-seeing, all-penetrating spirits that moves through all pure and subtle things.",
      "links": "<a href='/AIV/19/139/7-10'>Ps. 139:7-10</a>",
      "comment": "Wisdom’s pervasive presence and power, reflecting God’s omnipresence."
    },
    {
      "pk": 90070024,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 24,
      "text": "For wisdom is more mobile than any movement; she passes through and penetrates all things by her purity.",
      "links": "",
      "comment": "Her ‘mobility’ suggests the workings of the Spirit, moving wherever God wills."
    },
    {
      "pk": 90070025,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 25,
      "text": "For she is the breath of the power of God and a pure outpouring of the glory of the Almighty; therefore nothing defiled enters into her.",
      "links": "<a href='/AIV/43/20/22'>John 20:22</a>",
      "comment": "Wisdom as ‘breath’ points to the doctrine of the Holy Spirit proceeding from the Father, essential to the fullness of the Church."
    },
    {
      "pk": 90070026,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 26,
      "text": "For she is the radiance of eternal light, a spotless mirror of God’s working, and an image of his goodness.",
      "links": "<a href='/AIV/58/1/3'>Heb. 1:3</a>",
      "comment": "Wisdom as ‘radiance’ and ‘image’ directly parallels the description of Christ as the exact imprint of God’s nature, supporting the teaching of Christ’s divinity."
    },
    {
      "pk": 90070027,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 27,
      "text": "Though one, she can do all things; remaining in herself, she renews all things. She passes into holy souls in every generation, making them friends of God and prophets.",
      "links": "<a href='/AIV/43/14/17'>John 14:17</a>; <a href='/AIV/46/12/4-11'>1 Cor. 12:4-11</a>",
      "comment": "Shows wisdom’s continuous operation in believers, empowering and sanctifying them—consistent with doctrines on grace working through the Church in every age."
    },
    {
      "pk": 90070028,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 28,
      "text": "God loves nothing except one who lives with wisdom.",
      "links": "",
      "comment": "A loving relationship is established through possession of wisdom, echoing the union with Christ that is the heart of Christian life."
    },
    {
      "pk": 90070029,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 29,
      "text": "She is more beautiful than the sun, and surpasses every constellation; compared with light, she is found superior.",
      "links": "<a href='/AIV/62/1/4-5'>John 1:4-5</a>",
      "comment": "The supremacy of wisdom above created light hints at the divinity of Christ, as ‘true light’ in the New Testament."
    },
    {
      "pk": 90070030,
      "translation": "AIV",
      "book": 51,
      "chapter": 7,
      "verse": 30,
      "text": "For night overcomes light, but evil will not prevail against wisdom.",
      "links": "<a href='/AIV/43/1/5'>John 1:5</a>",
      "comment": "Wisdom’s victory over evil prefigures the ultimate triumph of Christ over the darkness of sin and death."
    }
  ],
  "translatedAt": "2025-12-23T09:44:41.021Z"
}