{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 11,
  "verses": [
    {
      "pk": 2001101,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 1,
      "text": "In your wisdom, you made all things, and by your word, O Lord, you have power over all.",
      "links": "<a href='/AIV/1/1/1'>Gen 1:1</a>; <a href='/AIV/19/33/6'>Ps 33:6</a>",
      "comment": "This verse echoes the idea of God's creative Word, foreshadowing the truth revealed in John 1:1 where the Word is Christ. The verse confirms God's absolute authority over creation and its order."
    },
    {
      "pk": 2001102,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 2,
      "text": "For even if you willed it, you could have destroyed them with a single breath, but in your mercy, you spared them, sending wasps ahead as soldiers to punish them little by little.",
      "links": "<a href='/AIV/2/23/28'>Exod 23:28</a>",
      "comment": "God's measured justice and patience are evident here. The 'wasps' refer to God's subtle punishments rather than total destruction—a theme reinforced in Exodus 23:28."
    },
    {
      "pk": 2001103,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 3,
      "text": "Not that you could not deliver the wicked over to righteous men in a single battle, or destroy them at once by savage beasts or a stern command.",
      "links": "<a href='/AIV/1/19/20'>Gen 19:24-25</a>",
      "comment": "This verse highlights that God's restraint is deliberate, choosing mercy and the path of conversion rather than overwhelming force. This patience of God is also seen in 2 Peter 3:9."
    },
    {
      "pk": 2001104,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 4,
      "text": "But by judging them little by little, you gave them time to repent, though you were not unaware that their nature was evil, and their wickedness ingrained.",
      "links": "<a href='/AIV/1/6/5'>Gen 6:5</a>; <a href='/AIV/2/34/6'>Exod 34:6</a>",
      "comment": "Here we see a clear revelation of God's mercy, giving room for repentance, foreshadowing the teachings of Jesus on forgiveness and patient love (Luke 13:6-9)."
    },
    {
      "pk": 2001105,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 5,
      "text": "For they were cursed from the start; neither through fear of you did they truly honor your ways.",
      "links": "<a href='/AIV/19/78/10'>Ps 78:10</a>",
      "comment": "God distinguishes between empty fear and sincere reverence. True faith entails more than outer obedience; it desires inner transformation, consistent with later New Testament teachings (Romans 2:29)."
    },
    {
      "pk": 2001106,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 6,
      "text": "Yet, as children you punished them, reminding them with gentle correction, as a parent disciplines a child, hoping for their repentance.",
      "links": "<a href='/AIV/20/3/12'>Prov 3:12</a>; <a href='/AIV/58/12/5-7'>Heb 12:5-7</a>",
      "comment": "God’s discipline is purposeful and aims for restoration, not just justice—a theme echoed in Hebrews 12:5-11 about the discipline of the Lord’s children."
    },
    {
      "pk": 2001107,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 7,
      "text": "But for your people, even when you punished them, you showed them great kindness, for you had sent them a glorious light to lead them forward, even amidst their suffering.",
      "links": "<a href='/AIV/2/13/21'>Exod 13:21</a>; <a href='/AIV/19/78/14'>Ps 78:14</a>",
      "comment": "God’s mercy toward his own points to election and providence. The guiding ‘light’ anticipates the Light of Christ (John 8:12)."
    },
    {
      "pk": 2001108,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 8,
      "text": "In return for the harm they did to your children and for the slaughter of infants, you gave them abundant water in an unexpected way.",
      "links": "<a href='/AIV/2/17/6'>Exod 17:6</a>; <a href='/AIV/19/78/15-16'>Ps 78:15-16</a>",
      "comment": "The miraculous water foreshadows the grace that flows from Christ, as ‘living water’ (John 4:10), especially in situations where human hope seems impossible."
    },
    {
      "pk": 2001109,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 9,
      "text": "You showed by this that you judge our enemies with mercy and patience, as you call us to consider your goodness in hope for repentance.",
      "links": "<a href='/AIV/45/2/4'>Rom 2:4</a>",
      "comment": "This demonstrates a theology of hope linked to God’s patience, inviting all people to repentance and transformation."
    },
    {
      "pk": 2001110,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 10,
      "text": "For while they suffered justly, having turned against you, you gave your people reason for hope, showing them how their adversaries were punished.",
      "links": "<a href='/AIV/19/78/50-51'>Ps 78:50-51</a>",
      "comment": "Deliverance is both judgment for the wicked and hope for God’s faithful, reinforcing both justice and mercy."
    },
    {
      "pk": 2001111,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 11,
      "text": "For when our enemies drank the same water that brought relief to your people, they suffered, being destroyed by the same thing from which your own were blessed.",
      "links": "<a href='/AIV/2/7/17-21'>Exod 7:17-21</a>",
      "comment": "God’s providence can use the same element for blessing and for judgment. This concept foreshadows baptism, which both delivers from sin but judges unbelief (cf. 1 Peter 3:21)."
    },
    {
      "pk": 2001112,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 12,
      "text": "For instead of flowing rivers, they found the water foul, an example of your judgment that exposes the evil in the hearts of men.",
      "links": "<a href='/AIV/2/7/20-21'>Exod 7:20-21</a>",
      "comment": "Just as the Nile became blood for Egypt, God makes visible the consequences of sin. This is a call to spiritual vigilance."
    },
    {
      "pk": 2001113,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 13,
      "text": "But even in their punishment, you did not answer them with anger, but showed them mercy so they might reflect and change their hearts.",
      "links": "<a href='/AIV/19/86/15'>Ps 86:15</a>",
      "comment": "Even in judgment, God's desire is not destruction but reform—a recurring theme throughout salvation history."
    },
    {
      "pk": 2001114,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 14,
      "text": "They learned from their suffering—when punishment fell on them, they recognized whom they had rejected as true Lord.",
      "links": "<a href='/AIV/2/9/27'>Exod 9:27</a>",
      "comment": "Often suffering makes truth evident. This is a call to humility and recognition of God's sovereignty."
    },
    {
      "pk": 2001115,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 15,
      "text": "The one whom they had before derided, now, in their need, they begged for help—all because they had received clear proof of your power.",
      "links": "<a href='/AIV/2/10/16-17'>Exod 10:16-17</a>",
      "comment": "God uses deliverance and hardship alike to draw all people toward faith and reliance on Him."
    },
    {
      "pk": 2001116,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 16,
      "text": "But, even in their folly and rebellion, you showed patience, giving them opportunity after opportunity to turn back to you.",
      "links": "<a href='/AIV/26/33/11'>Ezek 33:11</a>",
      "comment": "God desires even the wicked to turn and live; this reflects the richness of divine forbearance."
    },
    {
      "pk": 2001117,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 17,
      "text": "For you, the Source of life, have in your hand all manner of creation—the four elements—and you can transform them as you will.",
      "links": "<a href='/AIV/1/1/2'>Gen 1:2</a>; <a href='/AIV/19/104/30'>Ps 104:30</a>",
      "comment": "God’s sovereignty over the elements affirms His creative power. Early church fathers saw here a foundation for the possibility of miracles and sacramental signs."
    },
    {
      "pk": 2001118,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 18,
      "text": "You can make what is without form take shape, and the invisible be made visible, according to your will.",
      "links": "<a href='/AIV/1/1/3'>Gen 1:3</a>; <a href='/AIV/58/11/3'>Heb 11:3</a>",
      "comment": "Creation from nothing (creatio ex nihilo) is professed here—God’s word brings forth reality, underscoring the supernatural nature of divine action."
    },
    {
      "pk": 2001119,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 19,
      "text": "For your power is unlimited, and you can use even slight things to humble the proud and mighty.",
      "links": "<a href='/AIV/9/17/45-47'>1 Sam 17:45-47</a>; <a href='/AIV/46/1/27'>1 Cor 1:27</a>",
      "comment": "God often uses humble or weak means to accomplish His wise purposes—foreshadowing how Christ redeems through apparent weakness (cf. 2 Cor. 12:9)."
    },
    {
      "pk": 2001120,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 20,
      "text": "For the breath of your command can disperse them as with a word, or be consumed by your wrath, just as it pleases you.",
      "links": "<a href='/AIV/19/33/6'>Ps 33:6</a>; <a href='/AIV/23/11/4'>Isa 11:4</a>",
      "comment": "Divine command is all-powerful, linking back to the authority of God’s Word, which carries through Scripture to Christ (see Heb. 1:3)."
    },
    {
      "pk": 2001121,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 21,
      "text": "For your Spirit is in all things, and you uphold all who are devoted to you.",
      "links": "<a href='/AIV/19/139/7'>Ps 139:7</a>; <a href='/AIV/58/1/3'>Heb 1:3</a>",
      "comment": "The sustaining Spirit of God foreshadows the ongoing work of the Holy Spirit in believers (cf. John 14:16-17)."
    },
    {
      "pk": 2001122,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 22,
      "text": "For even the whole world before you is as a grain of sand on the scales, or a drop of dew in the morning mist.",
      "links": "<a href='/AIV/23/40/15'>Isa 40:15</a>",
      "comment": "This verse highlights God’s transcendence and the humility humans should have before the Creator."
    },
    {
      "pk": 2001123,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 23,
      "text": "Yet you are merciful to all, because you can do all things; you overlook the sins of men, so that they may repent.",
      "links": "<a href='/AIV/2/34/6'>Exod 34:6</a>; <a href='/AIV/55/2/25'>2 Tim 2:25</a>",
      "comment": "God’s patience is unparalleled, always leaving room for conversion and renewal."
    },
    {
      "pk": 2001124,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 24,
      "text": "For you love all things that exist, and hate nothing you have made; for you would not have made anything if you hated it.",
      "links": "<a href='/AIV/1/1/31'>Gen 1:31</a>",
      "comment": "Affirms the goodness of all creation; evil is a perversion of the good, not a competing principle. This forms the basis of sacramental theology, affirming that matter can be used for divine purposes."
    },
    {
      "pk": 2001125,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 25,
      "text": "How could a thing remain, unless you willed it? Or be preserved if not called forth by you?",
      "links": "<a href='/AIV/19/104/29-30'>Ps 104:29-30</a>",
      "comment": "God’s ongoing will sustains all that exists—hinting at the idea that creation depends constantly on God, an important theme for understanding providence and mystery."
    },
    {
      "pk": 2001126,
      "translation": "AIV",
      "book": 45,
      "chapter": 11,
      "verse": 26,
      "text": "You spare all things, for they are yours, O Lord who loves life.",
      "links": "<a href='/AIV/19/145/9'>Ps 145:9</a>; <a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "God’s love for life itself drives his patience and mercy. This prepares for the full revelation of God's love in Jesus Christ’s incarnation and sacrifice."
    }
  ],
  "translatedAt": "2025-12-23T09:46:07.512Z"
}