{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 6,
  "verses": [
    {
      "pk": 5636100,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 1,
      "text": "Listen therefore, O kings, and understand; learn, you rulers of the ends of the earth.",
      "links": "<a href='/AIV/19/2/10'>Psalm 2:10</a>; <a href='/AIV/20/8/15-16'>Proverbs 8:15-16</a>",
      "comment": "This verse calls leaders to humility and attentive wisdom, similar to how Proverbs emphasizes the foundation of true authority."
    },
    {
      "pk": 5636101,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 2,
      "text": "Give ear, you who rule multitudes and take pride in many nations.",
      "links": "<a href='/AIV/19/82/1-2'>Psalm 82:1-2</a>",
      "comment": "God holds rulers accountable, echoing the theme of divine judgment on leaders in Psalm 82."
    },
    {
      "pk": 5636102,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 3,
      "text": "Because your authority was given by the Lord, and your power by the Most High, who will examine your works and search out your intentions.",
      "links": "<a href='/AIV/27/2/37-38'>Daniel 2:37-38</a>; <a href='/AIV/19/139/1-2'>Psalm 139:1-2</a>",
      "comment": "Human authority is only temporary and stems from God's sovereignty. God will judge not just outward actions but even the secret motivations of the heart."
    },
    {
      "pk": 5636103,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 4,
      "text": "For though you were ministers of his kingdom, you did not judge uprightly, nor keep the law, nor walk according to God’s will.",
      "links": "<a href='/AIV/23/10/1-2'>Isaiah 10:1-2</a>; <a href='/AIV/19/82/2-4'>Psalm 82:2-4</a>",
      "comment": "Echoes the call for just judgment by earthly rulers, ultimately fulfilled by the future Messiah who judges righteously."
    },
    {
      "pk": 5636104,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 5,
      "text": "He will come upon you terribly and swiftly, because judgment is severe on those in high position.",
      "links": "<a href='/AIV/19/76/12'>Psalm 76:12</a>; <a href='/AIV/42/12/48'>Luke 12:48</a>",
      "comment": "Judgment is stricter for spiritual leaders and rulers (cf. Luke 12:48: 'To whom much is given, much is required')."
    },
    {
      "pk": 5636105,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 6,
      "text": "For the least may be forgiven in mercy, but the mighty will be powerfully tested.",
      "links": "<a href='/AIV/19/18/27'>Psalm 18:27</a>; <a href='/AIV/42/12/48'>Luke 12:48</a>",
      "comment": "Those entrusted with more responsibility receive stricter judgment, a principle Jesus reiterates in the Gospels."
    },
    {
      "pk": 5636106,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 7,
      "text": "For the Lord of all will not show partiality, nor will he fear greatness; for he made both great and small, and cares for all alike.",
      "links": "<a href='/AIV/14/19/7'>2 Chronicles 19:7</a>; <a href='/AIV/44/10/34-35'>Acts 10:34-35</a>",
      "comment": "God's impartial justice is highlighted, later reaffirmed by Peter in Acts 10:34-35 ('God shows no partiality')."
    },
    {
      "pk": 5636107,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 8,
      "text": "But for the mighty, a severe examination awaits.",
      "links": "<a href='/AIV/42/12/48'>Luke 12:48</a>",
      "comment": "A reminder that accountability is higher for those in authority in both Old and New Covenants."
    },
    {
      "pk": 5636108,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 9,
      "text": "To you, therefore, O monarchs, my words are directed, so that you may learn wisdom and not fall away.",
      "links": "<a href='/AIV/20/1/7'>Proverbs 1:7</a>",
      "comment": "Wisdom is the sure foundation for those in authority to stay faithful."
    },
    {
      "pk": 5636109,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 10,
      "text": "For those who keep the holy things in holiness will be made holy, and those who are taught them will find a defense.",
      "links": "<a href='/AIV/19/18/25'>Psalm 18:25</a>; <a href='/AIV/46/1/30'>1 Corinthians 1:30</a>",
      "comment": "The principle of sanctification is connected to faithfulness to holy teachings, foreshadowing New Testament callings to holiness."
    },
    {
      "pk": 5636110,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 11,
      "text": "Desire my words; yearn for them, and you will be instructed.",
      "links": "<a href='/AIV/19/119/97'>Psalm 119:97</a>; <a href='/AIV/20/2/2-5'>Proverbs 2:2-5</a>",
      "comment": "A call to love wisdom mirrors the Psalmist’s zeal for God’s law."
    },
    {
      "pk": 5636111,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 12,
      "text": "Wisdom is radiant and unfading, easily perceived by those who love her, and found by those who seek her.",
      "links": "<a href='/AIV/20/8/17'>Proverbs 8:17</a>; <a href='/AIV/40/7/7'>Matthew 7:7</a>",
      "comment": "Wisdom’s accessibility echoes Jesus’ promise: 'Seek, and you will find.' In Christian reading, wisdom is ultimately fulfilled in Christ, 'the wisdom of God.'"
    },
    {
      "pk": 5636112,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 13,
      "text": "She hastens to make herself known to those who desire her.",
      "links": "<a href='/AIV/20/3/18'>Proverbs 3:18</a>",
      "comment": "Wisdom’s eagerness highlights God’s initiative in drawing seekers to Himself."
    },
    {
      "pk": 5636113,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 14,
      "text": "He who rises early to seek her will have no difficulty, for he will find her sitting at his door.",
      "links": "<a href='/AIV/19/5/3'>Psalm 5:3</a>; <a href='/AIV/20/8/34'>Proverbs 8:34</a>",
      "comment": "Encourages early and diligent pursuit of wisdom as the beginning of understanding."
    },
    {
      "pk": 5636114,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 15,
      "text": "To meditate on her is perfect understanding, and he who stays awake for her will soon be free from care.",
      "links": "<a href='/AIV/19/1/2'>Psalm 1:2</a>",
      "comment": "Meditation on wisdom is equated with spiritual peace—the spiritual practice of dwelling on God’s instruction is a classic path to freedom from anxiety."
    },
    {
      "pk": 5636115,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 16,
      "text": "For she herself goes about seeking those worthy of her, and graciously appears to them on their paths, and meets them in every thought.",
      "links": "<a href='/AIV/20/8/1-4'>Proverbs 8:1-4</a>",
      "comment": "Wisdom is portrayed as more than abstract: she actively seeks out the worthy, a strong hint of God’s grace drawing people to Himself."
    },
    {
      "pk": 5636116,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 17,
      "text": "The beginning of desire for wisdom is a sincere will for instruction; concern for instruction is love for her;",
      "links": "<a href='/AIV/20/1/7'>Proverbs 1:7</a>",
      "comment": "True wisdom begins in a heart open to receiving teaching, reflecting the 'fear of the Lord' as the start of wisdom."
    },
    {
      "pk": 5636117,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 18,
      "text": "Love for her means keeping her laws; obeying her laws is assurance of immortality;",
      "links": "<a href='/AIV/19/119/44'>Psalm 119:44</a>; <a href='/AIV/40/19/17'>Matthew 19:17</a>",
      "comment": "The connection between love of wisdom, keeping commandments, and immortality points to perfection through obedience—a key scriptural theme later fulfilled in Christ’s obedience (see Matthew 19)."
    },
    {
      "pk": 5636118,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 19,
      "text": "And immortality brings one near to God;",
      "links": "<a href='/AIV/45/2/7'>Romans 2:7</a>; <a href='/AIV/43/17/3'>John 17:3</a>",
      "comment": "Eternal life is found in union with God, a central Christian hope (cf. John 17:3)."
    },
    {
      "pk": 5636119,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 20,
      "text": "Thus, the desire for wisdom leads to a kingdom.",
      "links": "<a href='/AIV/40/6/33'>Matthew 6:33</a>",
      "comment": "Those who seek wisdom are promised the kingdom—an echo of 'seek first the kingdom of God.' The verse suggests God’s reign is tied to wisdom and righteous desire."
    },
    {
      "pk": 5636120,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 21,
      "text": "So if you delight in thrones and scepters, O rulers of the peoples, honor wisdom, so that you may reign forever.",
      "links": "<a href='/AIV/19/110/1-2'>Psalm 110:1-2</a>",
      "comment": "Eternal reign is granted not by mere power, but through the pursuit of wisdom—a foreshadowing of Christ’s eternal kingship and the saints' participation in His reign."
    },
    {
      "pk": 5636121,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 22,
      "text": "I will tell you what wisdom is and how she came to be. I will not hide mysteries from you, but will trace her out from the beginning of creation, and make knowledge of her clear; I will not pass by the truth.",
      "links": "<a href='/AIV/20/8/22-31'>Proverbs 8:22-31</a>",
      "comment": "Introduces a deep revelation about wisdom’s origin, echoing Proverbs 8’s personification and pre-existence of wisdom—seen as a foreshadowing of Christ, the eternal Word (cf. John 1:1-3)."
    },
    {
      "pk": 5636122,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 23,
      "text": "Nor will I travel in the company of consuming envy, for envy has nothing in common with wisdom.",
      "links": "<a href='/AIV/20/14/30'>Proverbs 14:30</a>; <a href='/AIV/59/3/14-17'>James 3:14-17</a>",
      "comment": "Highlights a moral difference between wisdom and envy—an echo of James's contrast between heavenly wisdom and bitter jealousy."
    },
    {
      "pk": 5636123,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 24,
      "text": "A multitude of the wise is the salvation of the world, and a sensible king is the stability of a people.",
      "links": "<a href='/AIV/20/11/14'>Proverbs 11:14</a>; <a href='/AIV/20/29/4'>Proverbs 29:4</a>",
      "comment": "Scripture teaches that salvation and peace come through wise leaders—a principle manifested most fully in Christ as the King who saves His people through perfect wisdom."
    },
    {
      "pk": 5636124,
      "translation": "AIV",
      "book": 45,
      "chapter": 6,
      "verse": 25,
      "text": "Therefore accept instruction from my words, and you will profit.",
      "links": "<a href='/AIV/20/4/13'>Proverbs 4:13</a>",
      "comment": "The book ends this chapter by urging the listener to receive wisdom’s instruction for true profit—echoing Jesus’s teaching that true treasure is found in the kingdom, not in worldly riches."
    }
  ],
  "translatedAt": "2025-12-23T09:44:19.386Z"
}