{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 5,
  "verses": [
    {
      "pk": 3001501,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 1,
      "text": "Then the righteous will stand with great confidence in the presence of those who oppressed them, and those who made light of their labors.",
      "links": "<a href='/AIV/19/1/5'>Ps. 1:5</a>; <a href='/AIV/40/25/32'>Matt. 25:32</a>",
      "comment": "The scene evokes a final judgment, where the righteous are publicly vindicated. Compare with Psalm 1:5 and Matthew 25:32, where the wicked cannot stand at the judgment."
    },
    {
      "pk": 3001502,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 2,
      "text": "When these see them, they will be shaken with terrible fear, and will be amazed at the unexpected salvation of the righteous.",
      "links": "<a href='/AIV/66/6/15-17'>Rev. 6:15–17</a>",
      "comment": "The final victory of the righteous is startling to the wicked. This echoes themes in Revelation’s vision of judgment and reversal."
    },
    {
      "pk": 3001503,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 3,
      "text": "They will speak to one another in anguish of spirit, and in the bitterness of distress they will say:",
      "links": "<a href='/AIV/19/112/10'>Ps. 112:10</a>; <a href='/AIV/42/13/28'>Luke 13:28</a>",
      "comment": "The reaction of the wicked is intense regret and pain, paralleling the weeping and gnashing of teeth described by Jesus in Luke 13:28."
    },
    {
      "pk": 3001504,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 4,
      "text": "‘These are the ones we once mocked and looked down upon; fools that we were! We considered their lives madness, and their end as without honor.",
      "links": "<a href='/AIV/19/22/6-8'>Ps. 22:6–8</a>; <a href='/AIV/23/53/3-4'>Isa. 53:3–4</a>",
      "comment": "The language recalls the prophecy of the Suffering Servant in Isaiah 53:3-4, applied traditionally to Jesus, whose apparent defeat was misjudged by his enemies."
    },
    {
      "pk": 3001505,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 5,
      "text": "How is it that they are now counted among the children of God, and their lot is among the holy?",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/62/3/1-2'>1 John 3:1–2</a>",
      "comment": "A remarkable foreshadowing of New Testament teaching, especially John 1:12, that believers become children of God—both in status and inheritance."
    },
    {
      "pk": 3001506,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 6,
      "text": "So, it was we who went astray from the way of truth, and the light of righteousness did not shine upon us, nor did the sun rise for us.",
      "links": "<a href='/AIV/19/36/9'>Ps. 36:9</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Jesus’ claim, ‘I am the light of the world’ (John 8:12), is anticipated here. The righteous walk in divine light, which the wicked reject."
    },
    {
      "pk": 3001507,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 7,
      "text": "We took our fill of the paths of lawlessness and destruction, and traveled through deserts where no road exists; but the way of the Lord we did not know.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/40/7/13-14'>Matt. 7:13–14</a>",
      "comment": "The contrasting paths—wicked and righteous—are a theme from Psalm 1 and Jesus’ teaching about the broad and narrow ways (Matt. 7:13–14)."
    },
    {
      "pk": 3001508,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 8,
      "text": "What did our pride profit us? What good did wealth and boasting bring us?",
      "links": "<a href='/AIV/19/49/6-12'>Ps. 49:6–12</a>; <a href='/AIV/59/1/10-11'>James 1:10–11</a>",
      "comment": "True wisdom shows earthly riches are ultimately vain; see James 1:10–11 and Psalm 49."
    },
    {
      "pk": 3001509,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 9,
      "text": "All these things have passed away like a shadow, like a fleeting rumor,",
      "links": "<a href='/AIV/19/144/4'>Ps. 144:4</a>; <a href='/AIV/21/6/12'>Eccl. 6:12</a>",
      "comment": "Life’s brevity is a common biblical theme—cf. Psalm 144:4 and Ecclesiastes 6:12."
    },
    {
      "pk": 3001510,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 10,
      "text": "like a ship passing through the waves: when it has passed, no trace of it can be found, nor any sign of its path in the water;",
      "links": "<a href='/AIV/18/9/25-26'>Job 9:25–26</a>",
      "comment": "Imagery emphasizes the transience and impermanence of earthly life, similar to Job 9:25–26."
    },
    {
      "pk": 3001511,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 11,
      "text": "or as, when a bird flies through the air, there is no sign of its way to be found; the light air, lashed by the beating of its wings and divided by its rushing flight, closes and leaves no trace of where it passed;",
      "links": "",
      "comment": "Further images drive home the point: life’s deeds can seem quickly erased, leaving behind no lasting trace without righteousness."
    },
    {
      "pk": 3001512,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 12,
      "text": "or as, when an arrow is shot at a target, the pierced air quickly closes up, so that no one knows its path.",
      "links": "",
      "comment": "The metaphor highlights the ephemeral impact of earthly actions not grounded in God's enduring will."
    },
    {
      "pk": 3001513,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 13,
      "text": "So it is with us: as soon as we were born, we ceased to be; we had no sign of virtue to show, but were consumed in our wickedness.",
      "links": "<a href='/AIV/14/21/20'>2 Chr. 21:20</a>",
      "comment": "A refrain of the futility of earthly life detached from virtue, and a hint toward the importance of a God-given righteousness."
    },
    {
      "pk": 3001514,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 14,
      "text": "Yes, the hope of the ungodly is like chaff carried by the wind, like a light mist driven away by a storm; it disappears like smoke by the wind, and is scattered like foam by a passing breeze.",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/19/37/20'>Ps. 37:20</a>",
      "comment": "Connects to Psalm 1:4's chaff and other psalms about the vanishing of the wicked (Ps. 37:20)."
    },
    {
      "pk": 3001515,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 15,
      "text": "But the righteous live forever; their reward is with the Lord, and the Most High cares for them.",
      "links": "<a href='/AIV/19/49/15'>Ps. 49:15</a>; <a href='/AIV/40/25/46'>Matt. 25:46</a>",
      "comment": "Foreshadows the explicit promise of eternal life as later unfolded in the Gospels—Matt. 25:46 and John 10:28."
    },
    {
      "pk": 3001516,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 16,
      "text": "Therefore they will receive a glorious crown from the hand of the Lord, for with His right hand He will cover them, and with His arm He will shield them.",
      "links": "<a href='/AIV/19/140/7'>Ps. 140:7</a>; <a href='/AIV/59/1/12'>James 1:12</a>; <a href='/AIV/66/2/10'>Rev. 2:10</a>",
      "comment": "The imagery of a crown of life (James 1:12; Rev. 2:10) points to the reward for perseverance in faith and virtue."
    },
    {
      "pk": 3001517,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 17,
      "text": "He will take His zeal as armor and will arm creation to punish His enemies;",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Imagery of God putting on armor is seen in Isaiah 59:17, reflecting divine justice. There’s a theme of cosmic participation in God’s final judgment."
    },
    {
      "pk": 3001518,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 18,
      "text": "He will put on righteousness as a breastplate, and wear impartial justice as a helmet;",
      "links": "<a href='/AIV/49/6/14-17'>Eph. 6:14–17</a>; <a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Imagery shared with the 'armor of God' in Ephesians 6 reinforces the theme that righteousness and justice are God’s true weapons."
    },
    {
      "pk": 3001519,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 19,
      "text": "He will take holiness as an invincible shield,",
      "links": "",
      "comment": "Underscores that holiness is not only defensive but invincible—a spiritual armor for those united to God."
    },
    {
      "pk": 3001520,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 20,
      "text": "and sharpen wrath as a sword, and the world will join Him to fight against the senseless.",
      "links": "",
      "comment": "Creation itself becomes an instrument of divine justice, a theme that appears in New Testament judgment scenes as well."
    },
    {
      "pk": 3001521,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 21,
      "text": "Flashes of lightning will dart in unison; they will leap from the clouds as from a well-drawn bow,",
      "links": "",
      "comment": "Natural forces are depicted as obedient to God, enacting His will with precision and unity."
    },
    {
      "pk": 3001522,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 22,
      "text": "an aim will be made at targets; hailstones full of fury will be thrown down from the clouds. The waters of the sea will rage against them, and rivers will overwhelm them without mercy.",
      "links": "<a href='/AIV/19/18/12-14'>Ps. 18:12–14</a>",
      "comment": "Imagery of hailstones and floods calls to mind the deliverance psalms (Ps. 18:12–14) and God’s might over nature as part of divine justice."
    },
    {
      "pk": 3001523,
      "translation": "AIV",
      "book": 17,
      "chapter": 5,
      "verse": 23,
      "text": "A mighty wind will rise and blow them away like chaff. So lawlessness will lay the whole earth to waste, and evil will overturn the thrones of rulers.",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/19/107/25'>Ps. 107:25</a>; <a href='/AIV/27/2/44'>Dan. 2:44</a>",
      "comment": "A final note that divine judgment is total: the wicked are overthrown, while God establishes righteous rule—prefiguring the Kingdom prophesied in Daniel 2:44. The imagery also echoes the fate of the chaff in Psalm 1:4."
    }
  ],
  "translatedAt": "2025-12-23T09:43:53.063Z"
}