{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 16,
  "verses": [
    {
      "pk": 5016001,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 1,
      "text": "Therefore by the same means by which You punished their enemies, You also showed kindness to Your own people.",
      "links": "<a href='/AIV/44/11/17-23'>Wis. 11:17–23</a>",
      "comment": "This verse sets up the contrast between God's justice and mercy, themes that echo throughout both Old and New Testaments. God's consistent character is shown in both punishment and salvation (cf. Rom. 11:22)."
    },
    {
      "pk": 5016002,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 2,
      "text": "Instead of punishment, You gave them the food of angels, and You sent them from heaven bread already prepared, providing every delight and satisfying every taste.",
      "links": "<a href='/AIV/02/16/4'>Ex. 16:4</a>; <a href='/AIV/19/78/24-25'>Ps. 78:24-25</a>; <a href='/AIV/43/6/31-35'>John 6:31-35</a>",
      "comment": "The 'food of angels' most directly refers to the manna in the wilderness, which also prefigures Christ as the true Bread from heaven (see John 6:31-35)."
    },
    {
      "pk": 5016003,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 3,
      "text": "For the substance which You gave showed Your sweetness toward Your children. It changed into whatever flavor each one desired, to meet each person's need.",
      "links": "<a href='/AIV/44/11/22'>Wis. 11:22</a>; <a href='/AIV/02/16/31'>Ex. 16:31</a>",
      "comment": "This highlights God's personal care for His people, adapting His gifts to their needs. There's a spiritual sense that God's grace meets each person's heart individually."
    },
    {
      "pk": 5016004,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 4,
      "text": "But to remind them of how their enemies were being tormented by the lack of food, Your own people were provided abundantly, while those others were suffering.",
      "links": "<a href='/AIV/02/12/29-36'>Ex. 12:29-36</a>; <a href='/AIV/02/14/24-28'>Ex. 14:24-28</a>",
      "comment": "God's provision for His people is set in contrast to the deprivation suffered by their enemies, emphasizing His special care and the consequences of opposing Him."
    },
    {
      "pk": 5016005,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 5,
      "text": "When the cruel enemies suffered hunger, even while wild animals came against them, Your people continued to rejoice with abundant food.",
      "links": "<a href='/AIV/44/11/17-18'>Wis. 11:17-18</a>",
      "comment": "The Lord's faithfulness in providing sustenance, even in adversity, prefigures His promise to never leave or forsake His people (Heb. 13:5)."
    },
    {
      "pk": 5016006,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 6,
      "text": "For those enemies, to warn them for a short time, they saw terrifying beasts, but Your people received a sign of salvation to remind them of the law You gave.",
      "links": "<a href='/AIV/04/21/6-9'>Num. 21:6-9</a>; <a href='/AIV/43/3/14'>John 3:14</a>",
      "comment": "The 'sign of salvation' refers to the bronze serpent (Num 21), a prefiguration of Christ on the cross (John 3:14)."
    },
    {
      "pk": 5016007,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 7,
      "text": "For anyone who turned to look at it was healed, not by what they saw, but by You, the Savior of all.",
      "links": "<a href='/AIV/04/21/8-9'>Num. 21:8-9</a>; <a href='/AIV/43/3/14-15'>John 3:14-15</a>",
      "comment": "The healing comes ultimately from God, not from the symbol—just as grace operates through sacraments outwardly, yet it is God's power that saves (see John 3:14-15)."
    },
    {
      "pk": 5016008,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 8,
      "text": "In this way, You showed to our enemies that it is You who rescues from every evil, and not any work of human hands.",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>",
      "comment": "God alone is the deliverer. Human effort is not sufficient for salvation, emphasizing the need for faith and trust in divine action."
    },
    {
      "pk": 5016009,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 9,
      "text": "Still, they were killed by the stings of locusts and flies, and no remedy could be found for them, for they deserved to be punished by such things.",
      "links": "<a href='/AIV/02/8/20-24'>Ex. 8:20-24</a>; <a href='/AIV/02/10/12-15'>Ex. 10:12-15</a>",
      "comment": "The plagues of Egypt are recalled here. The absence of a remedy highlights the seriousness of judgment for persistent disobedience."
    },
    {
      "pk": 5016010,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 10,
      "text": "But for Your people, even the bites of poisonous serpents could not defeat them, for Your mercy came to their aid and healed them.",
      "links": "<a href='/AIV/04/21/6-9'>Num. 21:6-9</a>",
      "comment": "God's mercy is shown as superior to judgment, anticipating the healing power found in Christ."
    },
    {
      "pk": 5016011,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 11,
      "text": "They were reminded by Your words and were quickly delivered. Lest they fall into deep forgetfulness, they were warned for a short time, so that they would not be continually cut off.",
      "links": "<a href='/AIV/19/78/34-39'>Ps. 78:34-39</a>",
      "comment": "A reminder that suffering can be a form of correction drawing people back to God. God's discipline is motivated by love (cf. Heb. 12:6)."
    },
    {
      "pk": 5016012,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 12,
      "text": "For neither herb nor ointment healed them, but Your word, Lord, which heals all things.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/40/8/8'>Matt. 8:8</a>",
      "comment": "The Lord's word is effective in itself, foreshadowing the healing and saving power of Christ, the ultimate Word of God (John 1:14)."
    },
    {
      "pk": 5016013,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 13,
      "text": "For You have power over life and death; You lead down to the gates of Hades and bring back up again.",
      "links": "<a href='/AIV/09/2/6'>1 Sam. 2:6</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "God's sovereignty over death anticipates Christ's victory over the grave (cf. Rev. 1:18), supporting hope in the resurrection."
    },
    {
      "pk": 5016014,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 14,
      "text": "A man, in his wickedness, may kill, but he cannot bring back the spirit once it has left, nor can he save a soul from death.",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>; <a href='/AIV/19/49/7-9'>Ps. 49:7-9</a>",
      "comment": "This verse emphasizes the limits of human power, in contrast to God's authority over life and death. Human salvation must depend on the divine."
    },
    {
      "pk": 5016015,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 15,
      "text": "It is impossible to escape Your hand.",
      "links": "<a href='/AIV/01/16/13'>Gen. 16:13</a>; <a href='/AIV/19/139/7-12'>Ps. 139:7-12</a>",
      "comment": "This echoes the biblical teaching on God's omnipresence and sovereignty."
    },
    {
      "pk": 5016016,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 16,
      "text": "For the ungodly, refusing to know You, were scourged by the strength of Your arm, pursued by strange rains, hail, relentless storms, and fire consuming all around them.",
      "links": "<a href='/AIV/02/9/23-24'>Ex. 9:23-24</a>; <a href='/AIV/19/18/12-14'>Ps. 18:12-14</a>",
      "comment": "God's judgment, here described by reference to the plagues of Egypt, serves as a sign that refusing to acknowledge Him has consequences."
    },
    {
      "pk": 5016017,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 17,
      "text": "The most marvelous thing was that in the water, which quenches all, the fire grew stronger; for the world defends the righteous.",
      "links": "<a href='/AIV/02/9/23-26'>Ex. 9:23-26</a>; <a href='/AIV/27/3/19-27'>Dan. 3:19-27</a>",
      "comment": "Nature itself responds to God's will, revealing His power over creation—as in the miracles of Elijah and the three men in the fiery furnace (Daniel 3)."
    },
    {
      "pk": 5016018,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 18,
      "text": "At one time, the flame was calmed so that it would not consume the living creatures sent against the ungodly, but that they might see and know they were pursued by the judgment of God.",
      "links": "<a href='/AIV/44/11/17-19'>Wis. 11:17-19</a>",
      "comment": "God's control over creation is exercised justly—either restraining or unleashing nature as a sign and judgment."
    },
    {
      "pk": 5016019,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 19,
      "text": "At another time, even in the midst of water, the fire burned with greater power, to destroy the produce of wicked land.",
      "links": "<a href='/AIV/02/9/23-25'>Ex. 9:23-25</a>",
      "comment": "God's judgments defy natural expectations, showing divine sovereignty."
    },
    {
      "pk": 5016020,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 20,
      "text": "Instead, You fed Your people with the bread of angels and sent them from heaven, without labor, bread ready to eat, providing every delight and suited to every taste.",
      "links": "<a href='/AIV/44/16/2'>Wis. 16:2</a>; <a href='/AIV/19/78/24-25'>Ps. 78:24-25</a>; <a href='/AIV/43/6/51'>John 6:51</a>",
      "comment": "Repetition of the theme of manna—foreshadowing the Eucharist, the true heavenly bread Jesus offers (John 6:51)."
    },
    {
      "pk": 5016021,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 21,
      "text": "The food revealed Your sweetness to Your children, changing into whatever each one needed, satisfying everyone's desire.",
      "links": "<a href='/AIV/02/16/31'>Ex. 16:31</a>; <a href='/AIV/44/16/3'>Wis. 16:3</a>",
      "comment": "Highlights the adaptability of God's grace to the needs of each person. Spiritually, this points to God's abundant and personal care."
    },
    {
      "pk": 5016022,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 22,
      "text": "Snow and ice endured fire without melting, to show that they could destroy the crops of the enemies, but they nourished Your people's harvest.",
      "links": "<a href='/AIV/19/147/17-18'>Ps. 147:17-18</a>; <a href='/AIV/02/9/23-25'>Ex. 9:23-25</a>",
      "comment": "Once again, nature serves God's providence and distinguishes between the righteous and the wicked."
    },
    {
      "pk": 5016023,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 23,
      "text": "In every way, fire grew stronger in water and water forgot its power to put out fire. For the world fights for the righteous.",
      "links": "<a href='/AIV/44/16/17'>Wis. 16:17</a>; <a href='/AIV/27/3/19-27'>Dan. 3:19-27</a>",
      "comment": "Nature itself takes the side of the just, symbolizing God's intervention on their behalf."
    },
    {
      "pk": 5016024,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 24,
      "text": "At another time, the flame was subdued so that it would not burn the animals sent against the ungodly, so they would realize that they were being pursued by God's judgment.",
      "links": "<a href='/AIV/44/16/18'>Wis. 16:18</a>",
      "comment": "Judgment is shown not merely as punishment but as a means for reflection and potential repentance."
    },
    {
      "pk": 5016025,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 25,
      "text": "For creation, serving You, its Maker, strives to punish the unjust and relents to benefit those who trust in You.",
      "links": "<a href='/AIV/19/104/14-15'>Ps. 104:14-15</a>; <a href='/AIV/45/8/28-30'>Rom. 8:28-30</a>",
      "comment": "Shows God's providence at work in all creation, a theme found throughout Scripture (see Matt. 6:26)."
    },
    {
      "pk": 5016026,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 26,
      "text": "Therefore, even then it adapted to Your command, so that Your children whom You love might be preserved unharmed, and show that creation exists to serve You, its Maker.",
      "links": "<a href='/AIV/19/148/5-6'>Ps. 148:5-6</a>; <a href='/AIV/44/11/24'>Wis. 11:24</a>",
      "comment": "Creation responds to God's will for the benefit of His people, reinforcing the biblical doctrine of God’s love for His people."
    },
    {
      "pk": 5016027,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 27,
      "text": "So that Your children, Lord, might recognize that it is not the various kinds of fruits that nourish a person, but it is Your word that preserves those who trust in You.",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>; <a href='/AIV/40/4/4'>Matt. 4:4</a>",
      "comment": "Echoes the teaching that 'man does not live by bread alone but by every word from the mouth of God,' connecting this text closely with Christ's own teachings."
    },
    {
      "pk": 5016028,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 28,
      "text": "For what was unable to be destroyed by fire, when merely warmed by a ray of sunlight, melted away so that all might know it is necessary to come before the sun to give You thanks, and to rise up early to praise You.",
      "links": "<a href='/AIV/19/92/1-2'>Ps. 92:1-2</a>; <a href='/AIV/19/63/1'>Ps. 63:1</a>",
      "comment": "Acknowledges gratitude and worship as proper responses to God’s providential care, continuing a theme of thanksgiving in the Psalms."
    },
    {
      "pk": 5016029,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 29,
      "text": "For the hope of the ungodly is like frost that disappears with the morning sun; but Your righteous people are not overcome, for You shield them at all times.",
      "links": "<a href='/AIV/19/37/20'>Ps. 37:20</a>; <a href='/AIV/19/91/2-4'>Ps. 91:2-4</a>",
      "comment": "This closing verse contrasts the fleeting hope of those who reject God with the enduring protection for those who trust in Him. The text thus encourages heartfelt perseverance in faith and the worship of God through every season."
    }
  ],
  "translatedAt": "2025-12-23T09:48:26.151Z"
}