{
  "book": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 14,
  "verses": [
    {
      "pk": 2142001,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 1,
      "text": "Again, another evil, it is the wood, which is worthless, from which a small plank is carved and shaped by human hands, then being covered with paint and made to look like the image of a man.",
      "links": "<a href='/AIV/23/44/9'>Isa. 44:9-20</a>",
      "comment": "This verse continues the theme from previous chapters, exposing the folly of idolatry by describing the human origin and manipulation of false gods. See also Isa. 44 for a prophetic parallel."
    },
    {
      "pk": 2142002,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 2,
      "text": "Someone whose life is only a short time carves it; with his own hands, he forms it, and then with red paint colors its surface.",
      "links": "<a href='/AIV/24/10/3-5'>Jer. 10:3-5</a>",
      "comment": "The text points to the frailty of humans who craft images as gods, emphasizing their mortality compared to eternal divinity."
    },
    {
      "pk": 2142003,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 3,
      "text": "With what he has left from his work, he fashions a god that is like himself, as if it were a useless thing, though he himself was only made from dust.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "References to humans being created from dust contrast starkly with the arrogance of making images to worship."
    },
    {
      "pk": 2142004,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 4,
      "text": "His life soon will be taken in debt, and his soul is only borrowed; yet, he has carved an image with his own hands.",
      "links": "<a href='/AIV/15/9/6'>Ezra 9:6</a>",
      "comment": "Emphasis on human mortality and judgment foreshadows the temporary nature of idolatry."
    },
    {
      "pk": 2142005,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 5,
      "text": "Still, he strives to make his lifeless work like himself, yet he esteems it above himself, worships it, and prays to it for his life and children and health.",
      "links": "<a href='/AIV/19/135/15-18'>Ps. 135:15-18</a>",
      "comment": "Repeated warnings against idolatry highlight the blindness of those who trust in the works of their hands."
    },
    {
      "pk": 2142006,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 6,
      "text": "But he has no shame that he prays for his soul to a lifeless, weak thing, nor for his life to the dead.",
      "links": "<a href='/AIV/23/46/6-7'>Isa. 46:6-7</a>",
      "comment": "The folly of asking for life or blessings from dead objects underscores the futility of misplaced devotion."
    },
    {
      "pk": 2142007,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 7,
      "text": "He calls for help from the weakest thing, but his hands are more useful than what he prays to.",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>",
      "comment": "Highlights the irony that the maker is stronger than the idol he makes, exposing the irrationality of such worship."
    },
    {
      "pk": 2142008,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 8,
      "text": "He asks for life from the dead, for help from what is unliving, for safety from something more powerless than himself.",
      "links": "",
      "comment": "This verse accentuates the self-defeating logic of depending on created objects for deliverance."
    },
    {
      "pk": 2142009,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 9,
      "text": "For he knows better—his soul is weak and easily led astray; so he worships wrongly.",
      "links": "<a href='/AIV/45/1/21-23'>Rom. 1:21-23</a>",
      "comment": "A New Testament parallel (Rom. 1) similarly exposes the heart’s tendency to exchange Creator for creature."
    },
    {
      "pk": 2142010,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 10,
      "text": "But most evil are those who despise the Lord, for such are tormented for their contempt.",
      "links": "<a href='/AIV/19/5/10'>Ps. 5:10</a>",
      "comment": "The severity of rejection of God is stressed, with spiritual consequences."
    },
    {
      "pk": 2142011,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 11,
      "text": "For among them, idolatry began with pride, when men tried to please rulers with images, and made sacred mysteries by commands.",
      "links": "<a href='/AIV/2/20/4'>Exod. 20:4</a>",
      "comment": "The origins of idol worship are traced to human pride and flattery, a warning against corrupting pure worship."
    },
    {
      "pk": 2142012,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 12,
      "text": "Thus, the celebration of likenesses became law among them; and by human commands, graven images were worshipped.",
      "links": "<a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "Reflects human traditions usurping the authority and worship owed to God alone."
    },
    {
      "pk": 2142013,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 13,
      "text": "Those who lived far away could not honor ruler and king in person, so they made images to be objects of devotion, received as a law among those who could not see them.",
      "links": "",
      "comment": "Spectacle and tangible images arose to replace authentic spiritual relationship."
    },
    {
      "pk": 2142014,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 14,
      "text": "As the artist sought to please those in authority, his craftsmanship exalted beyond measure, leading the ignorant into greater error.",
      "links": "",
      "comment": "Human skill and artistry became instruments of temptation, rather than worship."
    },
    {
      "pk": 2142015,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 15,
      "text": "People drew others by the outward beauty of the work, and those unaware believed what was dead to be worthy of worship.",
      "links": "",
      "comment": "Again reminds us that outward appearances can mislead, if not grounded in truth."
    },
    {
      "pk": 2142016,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 16,
      "text": "In this way, human ambition became the trap for the world; as people, enslaved by misfortune or by the power of rulers, gave a name to stones and wood that should never be shared.",
      "links": "",
      "comment": "Note on naming: assigning divinity to what is not divine is condemned throughout Scripture."
    },
    {
      "pk": 2142017,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 17,
      "text": "It was not enough to be wrong about God, but in their ignorance they call such great evils 'peace.'",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>",
      "comment": "Calling evil good is a warning from the prophets; spiritual discernment is necessary."
    },
    {
      "pk": 2142018,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 18,
      "text": "For while they celebrate with child-murder and secret mysteries, and wild convulsions in strange rituals,",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>",
      "comment": "Worship distorted into superstition often led to immorality and even human sacrifice."
    },
    {
      "pk": 2142019,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 19,
      "text": "They no longer guard the purity of life or marriage, but one person kills another by treachery or grieves him by adultery.",
      "links": "<a href='/AIV/2/20/14'>Exod. 20:14</a>; <a href='/AIV/2/20/13'>Exod. 20:13</a>",
      "comment": "Violations of life and marriage connect to the rejection of God's law."
    },
    {
      "pk": 2142020,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 20,
      "text": "Everywhere, a mixture of blood and deceit, theft and corruption, unfaithfulness and disorder, perjury and confusion over what is good.",
      "links": "<a href='/AIV/28/4/2'>Hos. 4:2</a>",
      "comment": "Spiritual error leads to social decay; faith shapes deeds."
    },
    {
      "pk": 2142021,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 21,
      "text": "For the worship of idols without a name is the beginning and cause and end of all evil.",
      "links": "",
      "comment": "Idolatry is portrayed as the primal spiritual problem, underlying all sin (cf. Rom. 1)."
    },
    {
      "pk": 2142022,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 22,
      "text": "For either they are mad with joy, or tell falsehoods, or live unrighteously, or swiftly forswear themselves.",
      "links": "",
      "comment": "Misplaced worship leads to both moral and doctrinal confusion."
    },
    {
      "pk": 2142023,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 23,
      "text": "For as they trust in lifeless idols, they expect no harm when they swear falsely.",
      "links": "",
      "comment": "Belief, or lack thereof, in a living God can lead either to conscience or disregard for truth."
    },
    {
      "pk": 2142024,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 24,
      "text": "But justice will overtake both those who sin and those who swear falsely, because both will be punished for their lawlessness.",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>",
      "comment": "God's justice is impartial and certain."
    },
    {
      "pk": 2142025,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 25,
      "text": "For it is not the power of what they swear by, but the penalty deserved by those who sin—justice always watches over the consequences of the unrighteous.",
      "links": "",
      "comment": "Emphasis on divine oversight; reminds the reader of God's omniscience and just governance."
    },
    {
      "pk": 2142026,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 26,
      "text": "But upon the unjust will come punishment through their own wickedness; for they rebelled, not only in their ignorance of the true God, but by adding further scorn to their idolatry.",
      "links": "",
      "comment": "False worship leads not only to ignorance but to further sin, deepening separation from God."
    },
    {
      "pk": 2142027,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 27,
      "text": "For the worship of idols without a name is the root of all evil, both for those who worship and for those they call gods.",
      "links": "<a href='/AIV/54/6/10'>1 Tim. 6:10</a>",
      "comment": "Ambiguous idols cannot replace the living God who alone deserves worship."
    },
    {
      "pk": 2142028,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 28,
      "text": "For as they become mad in delight, or make false prophecies, or live corruptly, or quickly perjure themselves,",
      "links": "",
      "comment": "Restates how idol worship leads to moral and ethical collapse."
    },
    {
      "pk": 2142029,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 29,
      "text": "They put all their trust, even their souls’ oaths, in lifeless idols; and, despising justice, they expect no consequences.",
      "links": "",
      "comment": "Idols can neither enforce nor inspire true righteousness."
    },
    {
      "pk": 2142030,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 30,
      "text": "But in both these cases, punishment comes upon them: because they acted wrongly by giving honor to lifeless objects, and wrongly by despising justice. For justice pursues them even when they don't expect it.",
      "links": "",
      "comment": "The certainty of accountability before God is underlined."
    },
    {
      "pk": 2142031,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 31,
      "text": "But it is not by the things by which they swear that they will be punished, but by the penalty reserved for sinners, so that the power of God is always shown.",
      "links": "<a href='/AIV/19/50/21'>Ps. 50:21</a>",
      "comment": "All sin is exposed to God's judgment and all glory is due to His justice; serves as a reminder to seek the true knowledge and worship of God through what He has revealed rather than human invention. This chapter calls the reader toward pure and undefiled worship and reverence that God desires, which includes more than mere external avoidance of idols but also a rightly ordered heart, a theme central to the life of faith."
    }
  ],
  "translatedAt": "2025-12-23T09:47:26.949Z"
}