{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 7,
  "verses": [
    {
      "pk": 27007001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 1,
      "text": "I too am a mortal man, like all others, a descendant of him who was first formed from the earth.",
      "links": "<a href='/AIV/01/2/7'>Gen 2:7</a>; <a href='/AIV/18/33/6'>Job 33:6</a>",
      "comment": "Solomon affirms his common humanity, grounding wisdom in our shared human nature. See the humility of great biblical leaders connecting to Adam, highlighting the dignity and limitations of humankind."
    },
    {
      "pk": 27007002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 2,
      "text": "And in my mother's womb I was made flesh in the course of ten months, being compacted in blood, from the seed of a man and the pleasure that comes with marriage.",
      "links": "<a href='/AIV/19/51/5'>Ps 51:5</a>",
      "comment": "The process of conception is attributed to both natural and marital means, implying the goodness of marriage and procreation, which echoes consistent biblical teaching on the sanctity of the family unit."
    },
    {
      "pk": 27007003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 3,
      "text": "When I was born, I was exposed to the common air, and I fell upon the earth, and the first sound I made was my crying, just like everyone else.",
      "links": "<a href='/AIV/18/5/7'>Job 5:7</a>",
      "comment": "This verse emphasizes the shared vulnerability and dependence of all humans at birth, reinforcing the universal need for guidance and wisdom."
    },
    {
      "pk": 27007004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 4,
      "text": "I was swaddled in cloths and cared for with every attention.",
      "links": "",
      "comment": "Reflects the humble beginnings of everyone, even rulers. This foreshadows the humble birth of Jesus, whose infancy narratives stress both humility and dignity (see <a href='/AIV/42/2/12'>Luke 2:12</a>)."
    },
    {
      "pk": 27007005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 5,
      "text": "For no king began life differently, nor any ruler; we all have one entrance into life and the same departure.",
      "links": "<a href='/AIV/21/3/20'>Eccl 3:20</a>; <a href='/AIV/18/1/21'>Job 1:21</a>",
      "comment": "Affirms the equality of all before God, regardless of status. This universal human condition is echoed in teachings on original sin, highlighting the need for redemption."
    },
    {
      "pk": 27007006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 6,
      "text": "Therefore I prayed, and understanding was given to me; I called, and the spirit of wisdom came to me.",
      "links": "<a href='/AIV/11/3/9-12'>1 Kings 3:9-12</a>; <a href='/AIV/59/1/5'>James 1:5</a>",
      "comment": "Wisdom is depicted as a gift from God received through humble prayer, rather than human achievement, emphasizing the importance of grace in spiritual growth."
    },
    {
      "pk": 27007007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 7,
      "text": "I preferred her to scepters and thrones, and I counted riches as nothing compared to her.",
      "links": "<a href='/AIV/20/8/10-11'>Prov 8:10-11</a>",
      "comment": "Solomon values wisdom above all material and political power. This echoes Christ’s teaching (e.g., <a href='/AIV/40/6/33'>Matt 6:33</a>), prioritizing the Kingdom of God over earthly treasures."
    },
    {
      "pk": 27007008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 8,
      "text": "I esteemed no precious stone equal to her, for all gold beside her is as little sand, and silver is to be accounted as clay in her sight.",
      "links": "<a href='/AIV/18/28/15-19'>Job 28:15-19</a>",
      "comment": "Riches and even the finest goods are devalued next to wisdom, presenting wisdom as the supreme good—the attitude Jesus exhibits in <a href='/AIV/41/10/21'>Mark 10:21</a>."
    },
    {
      "pk": 27007009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 9,
      "text": "I loved her more than health and beauty, and I chose to have her above light, because her radiance is never extinguished.",
      "links": "<a href='/AIV/20/3/13-18'>Prov 3:13-18</a>",
      "comment": "Wisdom is described in exalted terms, with a life-giving, light-bearing quality. This has parallels in how Christ is the true light (see <a href='/AIV/43/1/9'>John 1:9</a>)."
    },
    {
      "pk": 27007010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 10,
      "text": "All good things came to me along with her, and in her hands uncountable riches.",
      "links": "<a href='/AIV/20/8/18-21'>Prov 8:18-21</a>",
      "comment": "Here wisdom is personified as the source of all blessings. There is a spiritual principle: seek God’s wisdom, and all other things fall into place (see <a href='/AIV/40/6/33'>Matt 6:33</a>)."
    },
    {
      "pk": 27007011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 11,
      "text": "I rejoiced in all these things, because wisdom goes before them all. I did not know that she was their mother.",
      "links": "<a href='/AIV/20/8/22'>Prov 8:22</a>",
      "comment": "Wisdom is seen as the mother of all good things—a poetic vision reminding us of Lady Wisdom, foreshadowing the role of pure and holy mediators in God’s plan."
    },
    {
      "pk": 27007012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 12,
      "text": "What I learned without guile, I share without envy; I do not withhold her riches.",
      "links": "<a href='/AIV/60/4/10'>1 Pet 4:10</a>",
      "comment": "The sharing of wisdom reflects the principle of stewardship: that spiritual and material goods are to be used to serve others, not selfishly hoarded."
    },
    {
      "pk": 27007013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 13,
      "text": "For wisdom is an inexhaustible treasure for men, and those who obtain it become friends of God, commended for the gifts learned from instruction.",
      "links": "<a href='/AIV/01/18/17'>Gen 18:17</a>; <a href='/AIV/43/15/14-15'>John 15:14-15</a>",
      "comment": "Being called a 'friend of God' is a high honor in Scripture (see Abraham and the disciples). Notice the importance of proper instruction—hinting at the value of learned tradition and living guidance within the faith."
    },
    {
      "pk": 27007014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 14,
      "text": "God gives wisdom to those who love it, and searches for them to fill them with it.",
      "links": "<a href='/AIV/19/111/10'>Ps 111:10</a>; <a href='/AIV/20/8/17'>Prov 8:17</a>",
      "comment": "God graciously seeks out those who desire wisdom. This echoes the grace-filled initiative of God in coming to us, as fully revealed in the Incarnation."
    },
    {
      "pk": 27007015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 15,
      "text": "May God grant me to speak with insight and to think worthy thoughts, for he is the guide of wisdom and directs the wise.",
      "links": "<a href='/AIV/19/19/14'>Ps 19:14</a>",
      "comment": "The prayer acknowledges God as the origin and guide of all true wisdom. The request for worthy thoughts ties to prayerful meditation on divine truth."
    },
    {
      "pk": 27007016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 16,
      "text": "For both we and our words are in his hand, as are all understanding and skill in every craft.",
      "links": "<a href='/AIV/18/12/10'>Job 12:10</a>",
      "comment": "Acknowledges God’s intimate providence over every aspect of life, connecting to the biblical theme that all our gifts and abilities flow from God's sovereignty."
    },
    {
      "pk": 27007017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 17,
      "text": "For he gave me sure knowledge of things that exist: the structure of the world and the activity of the elements,",
      "links": "<a href='/AIV/01/1/1-31'>Gen 1:1-31</a>",
      "comment": "Wisdom encompasses both spiritual and scientific understanding. The union of faith and reason, so highly prized in the Christian tradition, is subtly prefigured here."
    },
    {
      "pk": 27007018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 18,
      "text": "the beginning and the end and the middle of times, the alternations of the solstices and the changes of seasons,",
      "links": "<a href='/AIV/01/8/22'>Gen 8:22</a>; <a href='/AIV/21/3/1'>Eccl 3:1</a>",
      "comment": "God’s wisdom covers all natural phenomena, reflecting God's design in the order of creation—which is ultimately directed toward the fulfillment of God's redemptive plan."
    },
    {
      "pk": 27007019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 19,
      "text": "the cycles of the year and the positions of the stars,",
      "links": "<a href='/AIV/01/1/14'>Gen 1:14</a>",
      "comment": "Ancient wisdom integrates spiritual understanding with scientific knowledge, anticipating a worldview where faith and science operate in harmony."
    },
    {
      "pk": 27007020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 20,
      "text": "the natures of animals and the instincts of wild beasts, the powers of spirits and the thoughts of men, the varieties of plants and the virtues of roots—",
      "links": "<a href='/AIV/01/2/19-20'>Gen 2:19-20</a>",
      "comment": "God’s wisdom grants insight into the diversity of the created world, both visible and invisible. Note here a reference to spirits—reminding us the spiritual realm is as real as the material world."
    },
    {
      "pk": 27007021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 21,
      "text": "I learned both what is hidden and what is manifest, for wisdom, who crafts all things, taught me.",
      "links": "<a href='/AIV/20/3/19-20'>Prov 3:19-20</a>",
      "comment": "Wisdom is declared to be the maker of all things—hinting at an almost personal force, preparing the way for the fuller New Testament revelation of Christ as the Logos through whom all things were made (see <a href='/AIV/43/1/3'>John 1:3</a>)."
    },
    {
      "pk": 27007022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 22,
      "text": "For in her is a spirit intelligent, holy, unique, manifold, subtle, lively, clear, undefiled, distinct, invulnerable, loving what is good, sharp, irresistible,",
      "links": "<a href='/AIV/20/8/12-14'>Prov 8:12-14</a>",
      "comment": "Wisdom is described with divine and personal attributes, some overlapping with the Holy Spirit. The unity, purity, and perfection ascribed to Wisdom reinforce her heavenly origin."
    },
    {
      "pk": 27007023,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 23,
      "text": "unhindered, all-powerful, all-seeing, and pervading all spirits that are intelligent, pure, and exceedingly subtle.",
      "links": "<a href='/AIV/19/139/7-10'>Ps 139:7-10</a>",
      "comment": "Attributes of omniscience and omnipresence are connected with wisdom, similar to qualities often linked with the divine nature, bridging our understanding of how God works within creation."
    },
    {
      "pk": 27007024,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 24,
      "text": "For wisdom is more mobile than any motion; because of her purity, she penetrates and pervades all things.",
      "links": "",
      "comment": "Implying an active presence of divine wisdom in all aspects of existence, this sets the stage for the theology of grace permeating every part of life."
    },
    {
      "pk": 27007025,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 25,
      "text": "For she is the breath of the power of God, and a pure emanation of the glory of the Almighty; so nothing defiled enters into her.",
      "links": "<a href='/AIV/01/2/7'>Gen 2:7</a>; <a href='/AIV/43/20/22'>John 20:22</a>",
      "comment": "Wisdom is described as proceeding from God, pure and holy—paralleling language later used of the Holy Spirit. 'Nothing defiled' hints at the need for spiritual purity to receive God’s gifts."
    },
    {
      "pk": 27007026,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 26,
      "text": "For she is a reflection of eternal light, a spotless mirror of the working of God, and an image of his goodness.",
      "links": "<a href='/AIV/58/1/3'>Heb 1:3</a>; <a href='/AIV/47/4/4'>2 Cor 4:4</a>",
      "comment": "The unique language of Wisdom being an 'image of God’s goodness' foreshadows how Christ is described in the New Testament as the perfect image of the invisible God."
    },
    {
      "pk": 27007027,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 27,
      "text": "Although she is one, she can do all things, and while remaining in herself, she renews all things. In every generation she passes into holy souls and makes them friends of God, and prophets.",
      "links": "<a href='/AIV/20/1/23'>Prov 1:23</a>; <a href='/AIV/60/1/10-12'>1 Pet 1:10-12</a>",
      "comment": "Hints at the ongoing inspiration and sanctification given to God’s people—a spiritual lineage of holiness and prophecy formed in every age."
    },
    {
      "pk": 27007028,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 28,
      "text": "For God loves no one except the one who lives with wisdom.",
      "links": "<a href='/AIV/19/1/1-2'>Ps 1:1-2</a>",
      "comment": "Love is linked to living wisely: those who possess wisdom are assured of God’s unique favor. True faith involves faithfully clinging to wisdom and growing in sanctity."
    },
    {
      "pk": 27007029,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 29,
      "text": "She is more radiant than the sun, and excels every constellation in the sky; compared to light, she is found more radiant,",
      "links": "<a href='/AIV/20/4/18'>Prov 4:18</a>",
      "comment": "Wisdom surpasses all created lights—a theme that reaches its climax in the Gospel, where Christ calls himself the 'light of the world' (<a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 27007030,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 7,
      "verse": 30,
      "text": "for night succeeds light, but evil does not overcome wisdom.",
      "links": "<a href='/AIV/43/1/5'>John 1:5</a>",
      "comment": "Light may fade, but wisdom endures—just as evil cannot conquer divine truth. A spiritual reading points to the ultimate triumph of God’s Word and Wisdom—fulfilled ultimately in Christ, who is the eternal Light."
    }
  ],
  "translatedAt": "2025-12-24T07:17:27.743Z"
}