{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 13,
  "verses": [
    {
      "pk": 27013001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 1,
      "text": "For all people who are ignorant of God are foolish by nature, and from the good things that are seen they did not recognize the One who is, nor did they recognize the Artisan from His works.",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>; <a href='/AIV/45/1/19-20'>Rom. 1:19-20</a>",
      "comment": "This verse critiques those who, while observing the beauty and order of creation, fail to trace it back to the Creator. Paul echoes similar reasoning in Romans 1:19-20, arguing that God's existence is made known through His works. Here, Wisdom emphasizes the knowability of God via natural revelation—a foundation for recognizing deeper truths about the divine order."
    },
    {
      "pk": 27013002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 2,
      "text": "Instead, they supposed that fire or wind or swift air, the circle of stars, raging water, or the lights of heaven were the gods that rule the world.",
      "links": "<a href='/AIV/05/4/19'>Deut. 4:19</a>; <a href='/AIV/23/44/17'>Isa. 44:17</a>",
      "comment": "Here, the text addresses the common ancient tendency for people to worship the elements of the natural world. The passage underscores the difference between the created order and its Creator—hinting that worship rightfully belongs only to the One who made all these things."
    },
    {
      "pk": 27013003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 3,
      "text": "If, awe-struck by their beauty, they took them to be gods, let them understand how much greater is the Lord of these, for the Originator of beauty fashioned them.",
      "links": "<a href='/AIV/01/1/31'>Gen. 1:31</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "The writer appeals to the beauty perceived in creation to draw minds toward God. Not only does this honor the Creator, but it also calls people beyond natural beauty to supernatural truth—anticipating Christian doctrines where creation points to the divine."
    },
    {
      "pk": 27013004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 4,
      "text": "For if people were amazed at their power and energy, let them understand from these just how much mightier is the One who made them.",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>",
      "comment": "Admiration for the sky, stars, or forces of nature ought to be a steppingstone to contemplating God's sovereign power. Such reasoning walks step-by-step from the visible to the invisible, laying early groundwork for the theological practice of seeing traces of God (vestigia Dei) in creation."
    },
    {
      "pk": 27013005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 5,
      "text": "For from the greatness and beauty of created things, in corresponding reflection, the Maker is seen by understanding.",
      "links": "<a href='/AIV/45/1/20'>Rom. 1:20</a>; <a href='/AIV/19/8/3'>Ps. 8:3</a>",
      "comment": "This verse affirms that nature provides an analogy by which we apprehend God's attributes through human reason—building a case for the harmony between faith and reason in discovering divine truth."
    },
    {
      "pk": 27013006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 6,
      "text": "Yet, even so, these people are little to blame, for perhaps they go astray while seeking God and wanting to find Him.",
      "links": "<a href='/AIV/44/17/27'>Acts 17:27</a>",
      "comment": "Gentler than other condemnations, this verse acknowledges the sincere longing and effort to seek the divine in creation. Paul similarly notes this God-seeking impulse in Acts 17—a point favoring the view that honest seeking of truth is honored by God."
    },
    {
      "pk": 27013007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 7,
      "text": "For as they live among His works, they keep searching, and are drawn to what they see, for what they see is beautiful.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>",
      "comment": "The heart’s attraction to beauty is affirmed as a path towards seeking God. True spirituality appreciates the goodness of material creation as signposts pointing to its Author—hinting that creation, while not sufficient, is an authentic means for encountering divine mystery."
    },
    {
      "pk": 27013008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 8,
      "text": "But still, they are not excused;",
      "links": "<a href='/AIV/45/1/20'>Rom. 1:20</a>",
      "comment": "This sets proper limits: even sincere error cannot fully excuse people for failing to move from creature to Creator. Echoing Paul, the natural law gives knowledge that makes humanity morally accountable."
    },
    {
      "pk": 27013009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 9,
      "text": "For if they were able to know so much that they could examine the world, how did they not more quickly find the Lord of all?",
      "links": "<a href='/AIV/19/94/9-10'>Ps. 94:9-10</a>",
      "comment": "Intellectual achievement is not enough apart from humility before God. The verse calls for wisdom that not only examines but seeks the Author behind all things—an allegory also for recognizing a fuller revelation beyond philosophy or science alone."
    },
    {
      "pk": 27013010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 10,
      "text": "But they are even more foolish, and more miserable are those who put their hopes in lifeless things—who call the things made by human hands 'gods', whether idols of gold and silver, images of animals, or a useless stone made long ago by someone's hand.",
      "links": "<a href='/AIV/02/20/4'>Ex. 20:4</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Beyond natural religion, the text now points to outright idolatry—worship of images and artifacts. The condemnation aligns with the strong biblical tradition against idol worship, and implicitly points toward authentic worship centered on what God has established."
    },
    {
      "pk": 27013011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 11,
      "text": "A woodworker takes a piece of suitable wood, carefully peels off the bark, and skillfully crafts it for practical use, making a vessel for everyday life.",
      "links": "<a href='/AIV/23/44/13'>Isa. 44:13</a>",
      "comment": "Idol-making is described in detail, highlighting the essential ordinariness and artificiality of objects chosen for worship. There's a subtle warning against confusing what is fashioned by human hands with the true God."
    },
    {
      "pk": 27013012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 12,
      "text": "But the leftovers from this work—the pieces that are good for nothing—he uses to cook his food and satisfy his hunger.",
      "links": "<a href='/AIV/23/44/15-16'>Isa. 44:15-16</a>",
      "comment": "The weakness and utility of the idol's material is mocked: the same wood used for an idol is also used for cooking—exposing the foolishness of giving divine honor to common objects."
    },
    {
      "pk": 27013013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 13,
      "text": "Then, from what is left over—a chunk that is good for nothing, gnarled and twisted—he carves with the skill left in him a useless image shaped like a human being.",
      "links": "<a href='/AIV/23/44/17'>Isa. 44:17</a>",
      "comment": "The futility intensifies: a lifeless idol in human form springs from the scrap wood. This is in contrast to mankind, who is made in God’s image (Gen. 1:27) rather than God being made in man’s image—reinforcing the doctrine of God's transcendence."
    },
    {
      "pk": 27013014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 14,
      "text": "He places it in his home, nails it down so it won’t fall, and prays to it, asking about his possessions, marriage, and children, not feeling any shame in speaking to a lifeless thing.",
      "links": "<a href='/AIV/23/44/17-20'>Isa. 44:17-20</a>",
      "comment": "The tragic irony is underlined—idolaters seek guidance and blessing from mute, motionless tools. True revelation, in contrast, comes from God's living word and from those means God Himself established for His people—hinting at the need for authentic, living intermediaries appointed by God."
    },
    {
      "pk": 27013015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 15,
      "text": "For health, he calls upon what is weak; for life, he prays to what is dead; for help, he begs something utterly powerless.",
      "links": "<a href='/AIV/23/44/9-10'>Isa. 44:9-10</a>",
      "comment": "This mocks reliance on “powerless” intermediaries, contrasting the impotence of idols with the power of the living God. It reminds readers of the futility of seeking salvation, health, or hope apart from God—inviting trust in God's appointed ways of grace and mediation."
    },
    {
      "pk": 27013016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 16,
      "text": "He prays for a prosperous journey to something that cannot walk a step; for profit and success in business and work, to something with no hands at all.",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>",
      "comment": "Again, the point is driven home: idols are powerless to aid in life’s real needs. Christian tradition affirms that God, not any created thing, guides and provides—preparing the way for the mystery that the invisible God would one day be revealed in human form (John 1:14)."
    },
    {
      "pk": 27013017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 17,
      "text": "He prays for strength to an object made with his own two hands, earnestly pleading for life to a dead thing, asking for help from something utterly unhelpful.",
      "links": "<a href='/AIV/23/44/17'>Isa. 44:17</a>",
      "comment": "By portraying the idolater pleading with his creation, the author highlights the absurdity of ignoring the true source of help. This forms a background for biblical teaching that prayer and intercession, rightly understood, are only effective when directed toward God or through those God has truly commissioned."
    },
    {
      "pk": 27013018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 18,
      "text": "He asks about the future from something absolutely powerless and about a journey from something that cannot move. He pleads for gain from something that cannot give, and for a good outcome from what is completely powerless.",
      "links": "<a href='/AIV/19/135/15-18'>Ps. 135:15-18</a>",
      "comment": "The futility of trusting anything less than God for guidance, blessing, or provision—reinforcing that only God knows the future and can affect real good. This passage is a call not only to reject false worship, but to trust in the forms of worship and mediation that God Himself authorizes."
    },
    {
      "pk": 27013019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 13,
      "verse": 19,
      "text": "For recovery of health, he appeals to something weak; for life, he prays to something dead; for help, he implores what is completely useless for work, for a good journey he turns to something that cannot walk, and for profit and success in business, and for finding success in his work, he asks help from something with no power in its hands.",
      "links": "<a href='/AIV/19/135/18'>Ps. 135:18</a>",
      "comment": "This concluding verse reemphasizes the futility of idolatry and the error of trusting in anything created rather than the Creator. The text subtly encourages the reader to direct hope and petitions only to the living God, and by implication, through the means and order He has graciously instituted in His wisdom."
    }
  ],
  "translatedAt": "2025-12-24T07:20:17.009Z"
}