{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 12,
  "verses": [
    {
      "pk": 27012001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 1,
      "text": "Your imperishable spirit is in all things.",
      "links": "<a href='/AIV/19/139/7-10'>Ps. 139:7-10</a>; <a href='/AIV/18/34/14-15'>Job 34:14-15</a>",
      "comment": "The wisdom literature here testifies to the omnipresence of God's Spirit. This affirms both the sustaining power of the Spirit in creation and the intimate involvement of God in the world. See also Genesis 1:2 for the Spirit’s role in creation."
    },
    {
      "pk": 27012002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 2,
      "text": "Therefore, you correct little by little those who go astray, and you remind them and warn them of the things through which they sin, so that leaving evil behind they may believe in you, O Lord.",
      "links": "<a href='/AIV/20/3/11-12'>Prov. 3:11-12</a>; <a href='/AIV/43/16/8'>John 16:8</a>",
      "comment": "God’s patience and gradual correction exemplify divine mercy and desire for repentance rather than destruction. Spiritual interpretation: God’s ongoing call to conversion reflects His continuing concern for the salvation of all (see 2 Peter 3:9)."
    },
    {
      "pk": 27012003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 3,
      "text": "For you hated the ancient inhabitants of your holy land,",
      "links": "<a href='/AIV/01/15/16'>Gen. 15:16</a>; <a href='/AIV/02/34/11'>Ex. 34:11'</a>",
      "comment": "The ‘holy land’ here refers to the promised land given to Israel. Divine hatred is an expression of God’s opposition to persistent and grave evil, not an emotion as humans experience; see Psalm 5:4-6."
    },
    {
      "pk": 27012004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 4,
      "text": "because they practiced detestable acts: sorcery and unholy rites,",
      "links": "<a href='/AIV/03/18/21-30'>Lev. 18:21-30</a>; <a href='/AIV/05/18/9-14'>Deut. 18:9-14</a>",
      "comment": "Sorcery and unholy rites were condemned throughout scripture, showing God’s rejection of pagan practices. Literal and spiritual interpretation: idolatry corrupts the true worship due to God alone (see Romans 1:21-25)."
    },
    {
      "pk": 27012005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 5,
      "text": "they mercilessly killed children and consumed human flesh and blood as a feast initiated by a cult.",
      "links": "<a href='/AIV/19/106/37-38'>Ps. 106:37-38</a>; <a href='/AIV/24/19/4-5'>Jer. 19:4-5</a>",
      "comment": "This passage denounces the extreme depravity of ancient idolatrous cults, which included child sacrifice. The condemnation sets the ground for understanding the contrast with the sacredness of life and faith in the God of Israel."
    },
    {
      "pk": 27012006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 6,
      "text": "These initiates were parents who murdered helpless souls; you willed to destroy them by the hands of our ancestors,",
      "links": "<a href='/AIV/06/6/16-21'>Josh. 6:16-21</a>; <a href='/AIV/01/15/16'>Gen. 15:16</a>",
      "comment": "God’s judgment through Israel revealed divine justice against persistent, grievous evil. This acts as a warning regarding the consequences of unrepented sin and the protection of the vulnerable."
    },
    {
      "pk": 27012007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 7,
      "text": "so that the land most precious in your sight might receive a worthy population of God’s children.",
      "links": "<a href='/AIV/05/7/6'>Deut. 7:6</a>; <a href='/AIV/01/17/8'>Gen. 17:8</a>",
      "comment": "The land is set apart for a holy purpose and population. Spiritually, it foreshadows the promise of a holy people gathered together in unity and faith."
    },
    {
      "pk": 27012008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 8,
      "text": "Yet showing mercy even to these, you sent wasps ahead of your army so that they might be destroyed little by little.",
      "links": "<a href='/AIV/02/23/28'>Ex. 23:28</a>; <a href='/AIV/06/24/12'>Josh. 24:12</a>",
      "comment": "Rather than immediate annihilation, God chose progressive means, allowing repentance. The wasps are symbolic of divine intervention in the conquest and judgment."
    },
    {
      "pk": 27012009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 9,
      "text": "It was not because you could not subdue them with one blow, or deliver the wicked over to the righteous in battle;",
      "links": "<a href='/AIV/19/135/10-12'>Ps. 135:10-12</a>; <a href='/AIV/07/7/2'>Judg. 7:2</a>",
      "comment": "Expresses God’s sovereignty—He is fully able to act decisively, yet chooses mercy and gradual correction."
    },
    {
      "pk": 27012010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 10,
      "text": "But judging them little by little, you gave them opportunity to repent, though you knew their nature was evil, their malice ingrained, and their will never changing;",
      "links": "<a href='/AIV/26/33/11'>Ezek. 33:11</a>; <a href='/AIV/61/3/9'>2 Pet. 3:9</a>",
      "comment": "Divine patience aims at conversion, even for those with hearts set on evil. Literal and allegorical: God’s approach gives us a model for patience and for hope in conversion."
    },
    {
      "pk": 27012011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 11,
      "text": "for they were accursed from the beginning, neither to be feared nor pardoned.",
      "links": "<a href='/AIV/01/9/6'>Gen. 9:6</a>; <a href='/AIV/03/20/23'>Lev. 20:23</a>",
      "comment": "The curse is a result of entrenched opposition to God’s goodness. It is not arbitrary, but a consequence of persistent rejection of divine mercy."
    },
    {
      "pk": 27012012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 12,
      "text": "For who will say to you, 'What have you done?' Or who will resist your judgment? Who will rebuke you for the destruction of nations you created?",
      "links": "<a href='/AIV/18/9/12'>Job 9:12</a>; <a href='/AIV/45/9/19-21'>Rom. 9:19-21</a>",
      "comment": "Highlights God’s absolute sovereignty and justice. No one can question the judgments of God. Cross reference Romans 9, where Paul uses similar language."
    },
    {
      "pk": 27012013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 13,
      "text": "For there is no god besides you who cares for all, to whom you must prove your judgments.",
      "links": "<a href='/AIV/05/4/35'>Deut. 4:35</a>; <a href='/AIV/23/45/5'>Isa. 45:5</a>",
      "comment": "Affirmation of monotheism and God’s unique care for all creation. He alone is the Judge, answerable to none."
    },
    {
      "pk": 27012014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 14,
      "text": "No king or ruler can stand against you on behalf of those whom you have punished.",
      "links": "<a href='/AIV/27/4/34-35'>Dan. 4:34-35</a>",
      "comment": "God’s authority surpasses all earthly powers. Kings and rulers cannot intercede against God’s justice."
    },
    {
      "pk": 27012015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 15,
      "text": "You are righteous and rule all things justly; you would not condemn anyone unjustly, nor grant freedom to any who has not merited it.",
      "links": "<a href='/AIV/19/11/7'>Ps. 11:7</a>; <a href='/AIV/45/2/5-8'>Rom. 2:5-8</a>",
      "comment": "The justice of God is highlighted, refusing arbitrary condemnation and showing that true freedom comes through merited grace. Spiritual: God’s justice is always linked to mercy."
    },
    {
      "pk": 27012016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 16,
      "text": "For your strength is the source of justice, and because you are Master of all, you are merciful to all.",
      "links": "<a href='/AIV/19/103/8-13'>Ps. 103:8-13</a>; <a href='/AIV/40/9/36'>Matt. 9:36</a>",
      "comment": "God’s mercy is connected to His strength, and ultimate authority is expressed in ultimate forgiveness. Christological implication: Jesus as Lord shows mercy by forgiving sins (see Mark 2:5–12)."
    },
    {
      "pk": 27012017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 17,
      "text": "You show your might when people doubt the completeness of your power, and you rebuke the boldness of those who know yet still disregard you.",
      "links": "<a href='/AIV/01/18/14'>Gen. 18:14</a>; <a href='/AIV/19/78/19-22'>Ps. 78:19-22</a>",
      "comment": "God’s revelation of power often comes in response to doubt and rebellion. Literally: Those who disregard God face His discipline; spiritually, the mighty works provide a call to reverence."
    },
    {
      "pk": 27012018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 18,
      "text": "But ruling us with serenity, you give us great ground for hope: for you judge with moderation, and govern us with much patience.",
      "links": "<a href='/AIV/19/130/7'>Ps. 130:7</a>; <a href='/AIV/54/2/4'>1 Tim. 2:4</a>",
      "comment": "God’s wisdom is shown as patient and moderate, inviting us always to hope for mercy and conversion. Spiritual interpretation: This models the path of repentance and trust in God’s kindness."
    },
    {
      "pk": 27012019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 19,
      "text": "By such deeds you have taught your people that those who are righteous should be kind, and you have given your children the blessed hope that repentance will be granted.",
      "links": "<a href='/AIV/20/21/21'>Prov. 21:21</a>; <a href='/AIV/61/3/9'>2 Pet. 3:9</a>",
      "comment": "The link between righteousness and kindness is emphasized. The hope in repentance points to a tradition of reconciliation and forgiveness, later key in New Testament teaching (see 1 John 1:9)."
    },
    {
      "pk": 27012020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 20,
      "text": "For even those enemies of your people who were worthy of death, you provided room for repentance, granting forgiveness though their deeds offended you.",
      "links": "<a href='/AIV/42/23/34'>Luke 23:34</a>; <a href='/AIV/45/5/8'>Rom. 5:8</a>",
      "comment": "God offers repentance and forgiveness even to the gravest of sinners. Christological link: Jesus prays for His persecutors on the cross, embodying divine mercy (see Luke 23:34)."
    },
    {
      "pk": 27012021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 21,
      "text": "With how much more careful judgment did you not punish your own children, to whom you gave covenants and sacred promises?",
      "links": "<a href='/AIV/01/17/1-8'>Gen. 17:1-8</a>; <a href='/AIV/19/105/8-11'>Ps. 105:8-11</a>",
      "comment": "God’s children are those in covenant relationship. His discipline of them reflects greater concern and love. This motif underlies New Testament teachings on spiritual chastisement (see Hebrews 12:5–8)."
    },
    {
      "pk": 27012022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 22,
      "text": "Thus, when you judge us, you discipline us, so that we may reflect on your goodness when we are judged; and in showing mercy to others, we may hope for mercy ourselves.",
      "links": "<a href='/AIV/40/5/7'>Matt. 5:7</a>; <a href='/AIV/19/94/12'>Ps. 94:12</a>",
      "comment": "God’s discipline is a sign of His love, intended to bring believers to conversion and deeper goodness. Jesus teaches the merciful will receive mercy (see Matthew 5:7)."
    },
    {
      "pk": 27012023,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 23,
      "text": "Therefore you also punished the former occupants of the holy land with great care,",
      "links": "<a href='/AIV/05/7/1-4'>Deut. 7:1-4</a>",
      "comment": "Even God’s judgments on idolaters are deliberate and meant to bring reflection, not only destruction. The idea of ‘great care’ shows God’s desire for restoration over condemnation."
    },
    {
      "pk": 27012024,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 24,
      "text": "for though they practiced hatred toward outsiders, worshiped strange powers, and performed deeds of impiety, you did not destroy them quickly, but gave them time and place to turn away from their wrongs.",
      "links": "<a href='/AIV/05/18/9-14'>Deut. 18:9-14</a>; <a href='/AIV/24/18/7-8'>Jer. 18:7-8</a>",
      "comment": "God’s patience stands in sharp contrast to the harshness of human judgment; His waiting opens the door to repentance. Spiritual interpretation: The mercy shown here presages Jesus’s teachings on forgiveness."
    },
    {
      "pk": 27012025,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 25,
      "text": "Yet, being prisoners of wickedness, they thought lightly even of your warnings and mocked at what was right. Thus, their fatal error was set, as children lacking reason.",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/45/1/21-22'>Rom. 1:21-22</a>",
      "comment": "Persistent sin results in rejecting God’s word and wisdom. Allegorically, humanity’s spiritual blindness and hard-heartedness require divine intervention (see Romans 1)."
    },
    {
      "pk": 27012026,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 26,
      "text": "As you punished them for childish reasoning, you sent terrifying judgment on those who failed to heed correction.",
      "links": "<a href='/AIV/23/66/4'>Isa. 66:4</a>; <a href='/AIV/40/11/21-24'>Matt. 11:21-24</a>",
      "comment": "There is a cost to rejecting God’s correction. God’s judgment is a last resort after persistent hard-heartedness. Spiritual: Jesus likewise warned about ignoring the calls to repentance."
    },
    {
      "pk": 27012027,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 12,
      "verse": 27,
      "text": "But if these did not themselves perish in anger, they learned that your people were indeed favored; for after they experienced punishment, they sought the same mercy previously scorned.",
      "links": "<a href='/AIV/19/106/44-46'>Ps. 106:44-46</a>; <a href='/AIV/42/15/17-24'>Luke 15:17-24</a>",
      "comment": "God’s merciful discipline caused some to seek the forgiveness they once rejected. The narrative closes affirming divine preference and mercy over the chosen people, yet always with the universal call to repent and return."
    }
  ],
  "translatedAt": "2025-12-24T07:19:48.266Z"
}