{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 19,
  "verses": [
    {
      "pk": 27019001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 1,
      "text": "But the wicked were merciless until the very end, for God knew beforehand even their future actions.",
      "links": "<a href='/AIV/02/14/4'>Ex. 14:4</a>; <a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Here, the text emphasizes God's foreknowledge, a key attribute also seen in Psalm 94:11. The persistence of the wicked's hard hearts points to the justice of their ultimate punishment."
    },
    {
      "pk": 27019002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 2,
      "text": "When they allowed Your people to depart and hurried them away, they quickly changed their minds and pursued them.",
      "links": "<a href='/AIV/02/14/5-9'>Ex. 14:5-9</a>",
      "comment": "This recalls Pharaoh's swift reversal after letting Israel go, demonstrating the instability of those opposed to God's will. The Exodus imagery is a prefiguration of liberation from sin."
    },
    {
      "pk": 27019003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 3,
      "text": "Indeed, while they were still mourning at the graves and lamenting the burial of the dead, they undertook another foolish plan—driven by madness, they pursued as fugitives those whom they had begged to leave.",
      "links": "<a href='/AIV/02/12/30-34'>Ex. 12:30-34</a>",
      "comment": "The verse highlights their irrational behavior, caused by stubbornness and spiritual blindness. This illustrates the dangers of continually rejecting God's invitations to conversion."
    },
    {
      "pk": 27019004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 4,
      "text": "For compulsion led them to this fate, and they were dragged into it against their will by the power of Your hand.",
      "links": "<a href='/AIV/02/9/16'>Ex. 9:16</a>",
      "comment": "God's sovereignty is underlined, as even the intentions of the wicked are used to fulfill divine purpose. This shows how God's providence governs history."
    },
    {
      "pk": 27019005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 5,
      "text": "So, what they had refused to do out of reason, they were compelled to do by necessity, to show that evil is worthy of persecution, and those You condemn are bound inevitably to it.",
      "links": "<a href='/AIV/02/14/17-18'>Ex. 14:17-18</a>",
      "comment": "Their forced pursuit reflects divine justice: refusing free cooperation leads to judgment. There is a spiritual lesson about the importance of responding freely to God's grace."
    },
    {
      "pk": 27019006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 6,
      "text": "For the whole creation, in its own nature, was fashioned anew, obeying Your commands, so that Your servants could be unharmed.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/19/114/3-7'>Ps. 114:3-7</a>",
      "comment": "Creation responds to God’s command for the sake of His chosen. This echoes the miraculous events at the Red Sea and prefigures Christ’s authority over creation (compare Mark 4:39)."
    },
    {
      "pk": 27019007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 7,
      "text": "A cloud overshadowed the camp, and dry land appeared where before was water; a safe road opened amid the waves, and a green plain sprang out from the surging sea.",
      "links": "<a href='/AIV/02/13/21-22'>Ex. 13:21-22</a>; <a href='/AIV/19/77/19-20'>Ps. 77:19-20</a>",
      "comment": "This poetic retelling of the crossing of the Red Sea accentuates the miraculous care for God’s people—a prefiguration of baptism, passing safely from death to new life."
    },
    {
      "pk": 27019008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 8,
      "text": "Through which an entire nation passed, protected by Your hand, seeing marvelous wonders.",
      "links": "<a href='/AIV/02/14/29-31'>Ex. 14:29-31</a>",
      "comment": "The nation represents the whole people of God, not just individuals, highlighting the communal aspect of salvation—a theme foundational to a visible, organized church."
    },
    {
      "pk": 27019009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 9,
      "text": "They were nourished like horses in a pasture, leaped like lambs, giving You praise, O Lord, their Deliverer.",
      "links": "<a href='/AIV/19/114/1-2'>Ps. 114:1-2</a>",
      "comment": "Images of pasture and joy tie to the biblical shepherd imagery and Christ as the Good Shepherd (John 10:11), fostering unity and not isolated individualism."
    },
    {
      "pk": 27019010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 10,
      "text": "For they still remembered what had happened during their stay: how the earth itself gave birth to swarms of insects instead of cattle, and how the river spewed forth multitudes of frogs instead of fish.",
      "links": "<a href='/AIV/02/8/5-6'>Ex. 8:5-6</a>; <a href='/AIV/02/8/17-18'>Ex. 8:17-18</a>",
      "comment": "A reference to the plagues of Egypt, showing God’s power over nature and judgment on idolatry. The miraculous transformations indicate divine authority over all creation."
    },
    {
      "pk": 27019011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 11,
      "text": "Later, they saw a new kind of bird, when, led by desire, birds rose up out of the sea to meet their need.",
      "links": "<a href='/AIV/02/16/13'>Ex. 16:13</a>; <a href='/AIV/19/78/27-28'>Ps. 78:27-28</a>",
      "comment": "God provides miraculously in the wilderness, foreshadowing the Eucharist, where bread from heaven sustains the faithful (see John 6:31-35)."
    },
    {
      "pk": 27019012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 12,
      "text": "They were gladdened by the gift of food, while the wicked, oppressed by hunger and thirst, felt shame for their arrogance.",
      "links": "<a href='/AIV/02/16/2-3'>Ex. 16:2-3</a>",
      "comment": "Physical nourishment is used as a sign of God’s spiritual provision, and the punishment of the arrogant warns against spiritual pride."
    },
    {
      "pk": 27019013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 13,
      "text": "For after they had shown hostility to strangers, those same foreigners they had welcomed with festivities, the Egyptians caused the Israelites to suffer with terrible labors.",
      "links": "<a href='/AIV/02/1/8-14'>Ex. 1:8-14</a>; <a href='/AIV/01/47/5-6'>Gen. 47:5-6</a>",
      "comment": "Reminds us of the need to show hospitality and just treatment toward the sojourner, which later carries deep spiritual meaning in welcoming and forming newcomers into the faith community."
    },
    {
      "pk": 27019014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 14,
      "text": "And in return for their previous hospitality, they forced them into slavery and gave them bitter treatment.",
      "links": "<a href='/AIV/02/1/13-14'>Ex. 1:13-14</a>",
      "comment": "The reversal is a warning against ingratitude and injustice—a recurring biblical theme. The faithful, even in hardship, are ultimately vindicated."
    },
    {
      "pk": 27019015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 15,
      "text": "Still, they punished them more cruelly, whom they had previously celebrated as friends.",
      "links": "<a href='/AIV/01/47/11-12'>Gen. 47:11-12</a>",
      "comment": "This sharp contrast underscores the unpredictable nature of worldly favor, driving home the importance of faithfulness to God’s covenant, which cannot be broken."
    },
    {
      "pk": 27019016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 16,
      "text": "But the fate of the others was even more strange, for they, who had welcomed strangers with feasts, later enslaved their guests.",
      "links": "<a href='/AIV/01/47/1-6'>Gen. 47:1-6</a>",
      "comment": "Hospitality and its neglect have deep consequences in salvation history (see Hebrews 13:2). Christians are called to unity and charity in the household of faith."
    },
    {
      "pk": 27019017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 17,
      "text": "But those whom they had received with rejoicing, and who now shared the same rights with them, they afflicted with terrible sufferings.",
      "links": "<a href='/AIV/01/47/27'>Gen. 47:27</a>",
      "comment": "The shared rights reflect early images of the one people of God. This unity foreshadows the universal scope of the Church, where all are called together in Christ (see Gal. 3:28)."
    },
    {
      "pk": 27019018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 18,
      "text": "So creation, serving You its Maker, takes new shapes to punish the unjust and to show kindness to those who trust in You.",
      "links": "<a href='/AIV/19/105/30-31'>Ps. 105:30-31</a>",
      "comment": "Creation as a servant of God is a consistent theme throughout Scripture. The blessings given to the just and punishment of the unjust anticipate ultimate vindication at the final judgment."
    },
    {
      "pk": 27019019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 19,
      "text": "At one time fire grew stronger in water and water forgot its normal powers, so as to destroy enemies and deliver Your own people.",
      "links": "<a href='/AIV/02/14/24-28'>Ex. 14:24-28</a>",
      "comment": "Nature itself is transformed in obedience to God’s saving plan. Such miraculous episodes foreshadow Christ’s miracles over nature, pointing to His divinity."
    },
    {
      "pk": 27019020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 20,
      "text": "Flame did not consume the flesh of perishable creatures, nor melt the heavenly food that easily dissolves like frost.",
      "links": "<a href='/AIV/02/16/14-15'>Ex. 16:14-15</a>",
      "comment": "A miraculous reversal, further portraying God as the Lord of creation and prefiguring greater spiritual sacraments yet to come—such as the Bread of Life."
    },
    {
      "pk": 27019021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 21,
      "text": "For in every way, O Lord, You have magnified and glorified Your people, not neglecting to help them at any time or in any place.",
      "links": "<a href='/AIV/19/136/24'>Ps. 136:24</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s abiding presence foreshadows the permanent guidance given to the faithful throughout history (see Matt. 28:20—‘I am with you always’)."
    },
    {
      "pk": 27019022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 22,
      "text": "For in every way, O Lord, You have exalted and glorified Your people, and You have not neglected those who are with You at any time or place.",
      "links": "<a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "The promise of God never abandoning His people anticipates Christ’s promise to build and preserve His Church (see Matt. 16:18; 28:20). This endures as a sign of divine faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T07:23:05.420Z"
}