{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 15,
  "verses": [
    {
      "pk": 27015001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 1,
      "text": "But you, our Lord God, are gracious and true, patient, and rule all things in mercy.",
      "links": "<a href='/AIV/19/86/15'>Ps. 86:15</a>; <a href='/AIV/23/30/18'>Isa. 30:18</a>",
      "comment": "The description of God's attributes here—grace, truth, patience, and merciful rule—are consistent with many Old Testament depictions, highlighting His enduring qualities. The language affirms God's sovereign kingship, a sign of His authority over creation and judgment."
    },
    {
      "pk": 27015002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 2,
      "text": "Even if we sin, we belong to you, for we acknowledge your power, but we will not sin, knowing that we are counted as yours.",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>; <a href='/AIV/62/1/9'>1 John 1:9</a>",
      "comment": "The idea that people are God's possession is central in biblical theology, indicating a relationship rooted in ownership and covenant. The text expresses both humility in recognizing sin and fidelity to God, themes echoed throughout Scripture and reinforced in Christian spiritual practice."
    },
    {
      "pk": 27015003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 3,
      "text": "Knowing you is perfect righteousness, and knowing your power is the root of immortality.",
      "links": "<a href='/AIV/43/17/3'>John 17:3</a>; <a href='/AIV/19/36/9'>Ps. 36:9</a>",
      "comment": "To know God is to possess true righteousness and eternal life. This foreshadows New Testament teaching (John 17:3), where eternal life is found in knowing the Father through the Son. The verse points subtly towards the need for ongoing relationship with God, not just intellectual assent."
    },
    {
      "pk": 27015004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 4,
      "text": "For we were led astray by human inventions, by the worthless works of human skill and imagination.",
      "links": "<a href='/AIV/45/1/21-23'>Rom. 1:21-23</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Sinful human creativity often turns to idolatry and false worship. Cross-references reinforce that idolatry is not just the making of statues, but the misplaced works of human effort apart from God, distorting the relationship He desires."
    },
    {
      "pk": 27015005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 5,
      "text": "They were fascinated by the sight of lifeless forms made of clay, images made by artists’ hands, even desiring the likeness of something dead.",
      "links": "<a href='/AIV/19/135/15-18'>Ps. 135:15-18</a>; <a href='/AIV/02/20/4'>Ex. 20:4</a>",
      "comment": "Here, the folly of idolatry is emphasized—admiring lifeless objects instead of the living God. The physical nature of worship is critiqued, subtly showing that genuine faith involves more than external appearances."
    },
    {
      "pk": 27015006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 6,
      "text": "Lovers of evil things, and those deserving such hopes, both make them and desire them.",
      "links": "<a href='/AIV/28/8/4'>Hos. 8:4</a>; <a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "Both the creators and devotees of idols are rebuked. The passage highlights the spiritual danger in setting hope on created things rather than the Creator."
    },
    {
      "pk": 27015007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 7,
      "text": "For a potter laboring with soft clay forms each object for our use, but from the same clay he shapes both vessels for clean purposes and others for common or dishonorable use. Yet, the potter decides the use of each.",
      "links": "<a href='/AIV/45/9/21'>Rom. 9:21</a>; <a href='/AIV/23/29/16'>Isa. 29:16</a>",
      "comment": "This metaphor of the potter and clay is used elsewhere (Isaiah, Romans) to demonstrate God’s sovereignty in creating and assigning each person's purpose. It also implies a hierarchy of holiness and commonality among people."
    },
    {
      "pk": 27015008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 8,
      "text": "But what is the result? The potter foolishly makes a god from the same clay as his own hands, even though shortly after, he himself will die.",
      "links": "<a href='/AIV/23/44/12-17'>Isa. 44:12-17</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "This exposes the futility and mortality of humans fashioning idols. The contrast between human weakness and the supposed power of idols is meant to direct attention back to reliance on the True God."
    },
    {
      "pk": 27015009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 9,
      "text": "He tries to compete with goldsmiths and silversmiths, and he imitates those who work with copper, esteeming his handiwork as more precious, even as he strives to make worthless gods.",
      "links": "<a href='/AIV/23/46/6-7'>Isa. 46:6-7</a>",
      "comment": "This verse underscores rivalry among idol-makers, pointing out the pride and futility in competing over false images, reflecting the sin of seeking validation apart from God."
    },
    {
      "pk": 27015010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 10,
      "text": "His heart is ashes, his hope is cheaper than dirt, and his life is less valuable than his clay-making.",
      "links": "<a href='/AIV/23/44/20'>Isa. 44:20</a>; <a href='/AIV/19/62/9'>Ps. 62:9</a>",
      "comment": "The imagery is vivid, showing the spiritual emptiness and degradation that accompany idolatry. The verse reinforces themes of humility and the need for authentic worship."
    },
    {
      "pk": 27015011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 11,
      "text": "Because he does not know the One who made him, who gave him a living soul and breathed into him a vital spirit.",
      "links": "<a href='/AIV/01/2/7'>Gen. 2:7</a>; <a href='/AIV/18/33/4'>Job 33:4</a>",
      "comment": "The verse references the creation narrative, affirming God as the source of life and soul. It hints towards the necessity of true spiritual knowledge, and subtly suggests a spiritual inheritance passed on through Divine intervention."
    },
    {
      "pk": 27015012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 12,
      "text": "But he considers our life a game, and our existence a time to make money, saying, ‘One must get every gain, even by evil means.’",
      "links": "<a href='/AIV/19/39/6'>Ps. 39:6</a>; <a href='/AIV/42/16/8-9'>Luke 16:8-9</a>",
      "comment": "Earthly life is reduced to material ambition; this cautions against spiritual apathy and the prioritization of wealth above holiness. This theme is echoed in the teachings of Jesus on storing up treasures in heaven."
    },
    {
      "pk": 27015013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 13,
      "text": "For more than all others he knows that he sins, since out of earthy matter he crafts futile gods.",
      "links": "<a href='/AIV/23/45/20'>Isa. 45:20</a>; <a href='/AIV/45/1/32'>Rom. 1:32</a>",
      "comment": "The text holds idol-makers especially accountable, since their sin is deliberate and self-aware. Sin is not merely ignorance but a conscious turning away from the Creator."
    },
    {
      "pk": 27015014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 14,
      "text": "But the most foolish are those who live in exile, oppressing others and making idols of all manner of animals—even the wild beasts, and more grotesque creatures—likening gods to these senseless forms.",
      "links": "<a href='/AIV/45/1/23'>Rom. 1:23</a>; <a href='/AIV/19/106/36-38'>Ps. 106:36-38</a>",
      "comment": "The passage reflects the absurdity of idolatry—worshiping even detestable or monstrous things. This also echoes Old Testament prohibitions on worshipping animals, underlying the necessity for a pure and uncorrupted worship."
    },
    {
      "pk": 27015015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 15,
      "text": "These idols have no breath, they cannot see, hear, nor walk—made by human hands, they are empty images, incapable of any good.",
      "links": "<a href='/AIV/19/115/5-7'>Ps. 115:5-7</a>; <a href='/AIV/23/46/7'>Isa. 46:7</a>",
      "comment": "A direct attack on the impotence of idols, echoing psalms and prophets. The passage calls readers to recognize the transcendence and power of the living God."
    },
    {
      "pk": 27015016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 16,
      "text": "People make them, and those who receive their spirit briefly borrow flesh; but no human is able to make a god like himself.",
      "links": "<a href='/AIV/01/1/26-27'>Gen. 1:26-27</a>; <a href='/AIV/45/1/23'>Rom. 1:23</a>",
      "comment": "Although man is made in God's image, he cannot reverse the creative process and make gods. This is a subtle affirmation of mankind's creatureliness and the Divine uniqueness."
    },
    {
      "pk": 27015017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 17,
      "text": "Since he is mortal, his hands only produce what is temporary; he is better than the objects he worships, since he has life, but they have never had any.",
      "links": "<a href='/AIV/19/135/18'>Ps. 135:18</a>; <a href='/AIV/23/46/7'>Isa. 46:7</a>",
      "comment": "Humans are elevated above idols by virtue of possessing life; thus, worshiping lifeless things is illogical and self-degrading, subtly calling for a spirituality that both affirms the dignity of man and the glory of God."
    },
    {
      "pk": 27015018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 18,
      "text": "Still, they worship even the most hateful of animals which are, by their nature, ignorant.",
      "links": "<a href='/AIV/19/106/35-37'>Ps. 106:35-37</a>; <a href='/AIV/23/44/19'>Isa. 44:19</a>",
      "comment": "The utter spiritual blindness highlighted here points toward the necessity of true revelation. Worship must be rightly ordered and directed, preparing readers for understanding the incarnational mystery revealed later."
    },
    {
      "pk": 27015019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 15,
      "verse": 19,
      "text": "They compare these irrational beasts to the most beautiful animals, attributing divine powers to things that are beyond even recognition; a shameful deception and lack of discernment.",
      "links": "<a href='/AIV/45/1/23'>Rom. 1:23</a>; <a href='/AIV/23/40/18-20'>Isa. 40:18-20</a>",
      "comment": "The chapter concludes rebuking idolatrous confusion of creation and Creator, pointing towards the principle of rightly ordered worship and an invitation to embrace the fullness of revelation and discernment available in God's true worship."
    }
  ],
  "translatedAt": "2025-12-24T07:21:14.229Z"
}