{
  "book": 31,
  "bookName": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 2,
  "verses": [
    {
      "pk": 31002001,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 1,
      "text": "How the Lord in his anger has covered the daughter of Zion with a cloud! He has thrown down the splendor of Israel from heaven to earth; he has not remembered his footstool on the day of his wrath.",
      "links": "<a href='/AIV/19/99/5'>Ps. 99:5</a>; <a href='/AIV/23/64/11'>Isa. 64:11</a>; <a href='/AIV/11/8/7'>1 Kings 8:7</a>",
      "comment": "The 'footstool' refers to the temple, God's dwelling among his people. God hiding his face draws on the cloud motif, recalling the cloud at Sinai (Exod. 19:9). The visible presence of God is withdrawn due to wrath over sin. This prefigures how Christ, the new Temple (John 2:21), takes upon himself divine wrath to restore communion."
    },
    {
      "pk": 31002002,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 2,
      "text": "The Lord has swallowed up, without pity, all the dwellings of Jacob; in his wrath he has broken down the strongholds of the daughter of Judah. He has brought down to the ground and shamed the kingdom and its rulers.",
      "links": "<a href='/AIV/23/5/25'>Isa. 5:25</a>; <a href='/AIV/24/9/19'>Jer. 9:19</a>",
      "comment": "The emphasis on 'without pity' highlights the seriousness of sin; yet God’s discipline is restorative, foreshadowing the future reestablishment of the kingdom through the Messiah. Historically, this refers to the Babylonian conquest, but spiritually, the downfall prepares for renewal."
    },
    {
      "pk": 31002003,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 3,
      "text": "He has cut down in fierce anger all the might of Israel; he has withdrawn his right hand from before the enemy, and he has burned in Jacob like a flaming fire, consuming everything around.",
      "links": "<a href='/AIV/19/74/11'>Ps. 74:11</a>; <a href='/AIV/02/13/15'>Exod. 13:15</a>",
      "comment": "The 'right hand' often symbolizes God’s saving power. Here, God refrains from intervening, allowing judgment to purify his people — a mysterious aspect of divine justice. This anticipates salvation ultimately coming from God’s own right hand: Christ (Acts 2:33)."
    },
    {
      "pk": 31002004,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 4,
      "text": "He has bent his bow like an enemy, with his right hand set as a foe; he has slain all who were pleasing to the eye. In the tent of the daughter of Zion he has poured out his fury like fire.",
      "links": "<a href='/AIV/24/21/5'>Jer. 21:5</a>; <a href='/AIV/19/11/6'>Ps. 11:6</a>",
      "comment": "God’s posture as an enemy emphasizes the horror of separation from him. The destruction within Zion’s tent prefigures the need for a new sanctuary and new covenant (Luke 22:20). The language also recalls the fire of Pentecost, signifying both judgment and the Spirit’s purifying presence."
    },
    {
      "pk": 31002005,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 5,
      "text": "The Lord has become like an enemy; he has swallowed up Israel. He has swallowed up all its palaces and destroyed its strongholds, and has multiplied mourning and lamentation for the daughter of Judah.",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>; <a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "‘Like an enemy’—this is poetic, not literal; God’s purpose always remains fatherly. Mourning and lament foreshadow the sorrow before joy, which Christ refers to concerning his passion and resurrection (John 16:20)."
    },
    {
      "pk": 31002006,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 6,
      "text": "He has laid waste his booth like a garden, he has destroyed his place of meeting. The Lord has made Zion forget the appointed feast and Sabbath, and in his fierce anger has rejected king and priest.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/03/23/38'>Lev. 23:38</a>",
      "comment": "The loss of feast and Sabbath shows the centrality of temple worship. The rejection of both king and priest anticipates the future hope for a new, perfect Priest-King, fulfilled in Christ (Heb. 7:26-28), and foreshadows how Christ institutes new worship."
    },
    {
      "pk": 31002007,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 7,
      "text": "The Lord has rejected his altar and abandoned his sanctuary; he has delivered into the hand of the enemy the walls of her palaces. They have raised a shout in the house of the Lord as on the day of an appointed feast.",
      "links": "<a href='/AIV/12/25/9'>2 Kings 25:9</a>; <a href='/AIV/19/74/3-7'>Ps. 74:3-7</a>",
      "comment": "God lets his own temple be defiled, highlighting how mere ritual without obedience is empty (see Isa. 1:11-17). The repeated mention of sanctuary underscores the need for pure worship and deeper communion with God, which Christ makes possible for all believers (John 4:23-24)."
    },
    {
      "pk": 31002008,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 8,
      "text": "The Lord determined to destroy the wall of the daughter of Zion. He stretched out the measuring line and did not restrain his hand from destroying. He caused rampart and wall to mourn; together they languish.",
      "links": "<a href='/AIV/23/34/11'>Isa. 34:11</a>; <a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "The ‘measuring line’ signals deliberate action, a planned judgment. Yet elsewhere, the same language is used of restoring and rebuilding Jerusalem (Zech. 2:1-5), hinting at God’s redemptive plans even in judgment."
    },
    {
      "pk": 31002009,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 9,
      "text": "Her gates have sunk into the ground; he has ruined and broken her bars. Her king and princes are among the nations. The law is no more, and her prophets find no vision from the Lord.",
      "links": "<a href='/AIV/24/18/17'>Jer. 18:17</a>; <a href='/AIV/26/7/26'>Ezek. 7:26</a>",
      "comment": "With king and prophets silenced, Israel is spiritually destitute. Yet this emptiness creates longing for the True King and Prophet, Jesus. The silence is broken in the fullness of time (Gal. 4:4)."
    },
    {
      "pk": 31002010,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 10,
      "text": "The elders of the daughter of Zion sit silently on the ground; they throw dust on their heads and clothe themselves with sackcloth. The young women of Jerusalem bow their heads to the ground.",
      "links": "<a href='/AIV/18/2/12'>Job 2:12</a>; <a href='/AIV/06/7/6'>Josh. 7:6</a>",
      "comment": "Mourning is communal, involving leaders and youth, showing how sin affects the whole people. Spiritual solidarity in grief prepares the way for solidarity in hope, fulfilled in the Church as a united body."
    },
    {
      "pk": 31002011,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 11,
      "text": "My eyes are spent with weeping; my stomach churns; my heart is poured out on the ground because of the destruction of the daughter of my people, because infants and babies faint in the streets of the city.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>; <a href='/AIV/19/119/136'>Ps. 119:136</a>",
      "comment": "The prophet’s personal lament mirrors Christ’s compassion, weeping over Jerusalem (Luke 19:41). This points to the role of intercessors and leaders who share in their people's suffering—not just as figures of speech, but real participation in redemptive suffering."
    },
    {
      "pk": 31002012,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 12,
      "text": "They cry to their mothers, 'Where is bread and wine?' as they faint like the wounded in the streets of the city, as their life is poured out in their mothers' arms.",
      "links": "<a href='/AIV/24/44/18'>Jer. 44:18</a>; <a href='/AIV/19/78/25'>Ps. 78:25</a>",
      "comment": "The request for bread and wine tragically foreshadows the later promise Jesus makes to give true bread and wine that bring eternal life (John 6:35, 53-56). Physical hunger symbolizes spiritual longing fulfilled only in Christ."
    },
    {
      "pk": 31002013,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 13,
      "text": "What can I say to you? What can I compare to you, daughter of Jerusalem? What can I liken to you, that I may comfort you, virgin daughter of Zion? For your ruin is as vast as the sea; who can heal you?",
      "links": "<a href='/AIV/24/10/19'>Jer. 10:19</a>; <a href='/AIV/27/9/12'>Dan. 9:12</a>",
      "comment": "The rhetorical question ‘who can heal you?’ anticipates the messianic hope of the one who will heal the brokenhearted (Isa. 61:1-2, fulfilled in Luke 4:18-21). Jerusalem's uniqueness prefigures Mary as the Virgin Daughter of Zion, who bears the Healer."
    },
    {
      "pk": 31002014,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 14,
      "text": "Your prophets have seen for you false and deceptive visions; they have not uncovered your iniquity to restore your fortunes but have seen for you oracles that are false and misleading.",
      "links": "<a href='/AIV/24/23/16'>Jer. 23:16</a>; <a href='/AIV/26/13/3'>Ezek. 13:3</a>",
      "comment": "True prophets call to repentance and reveal the need for atonement. The exposure of sin is the first step toward redemption—a pattern continued in the apostolic teaching and the sacramental life."
    },
    {
      "pk": 31002015,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 15,
      "text": "All who pass by clap their hands at you; they hiss and shake their heads at the daughter of Jerusalem: 'Is this the city that was called the perfection of beauty, the joy of all the earth?'",
      "links": "<a href='/AIV/19/48/2'>Ps. 48:2</a>; <a href='/AIV/25/4/2'>Lam. 4:2</a>",
      "comment": "Jerusalem’s humiliation, once ‘the perfection of beauty,’ prepares for a greater glorification in the future—fulfilled in the New Jerusalem (Rev. 21:2), when God redeems and restores his people."
    },
    {
      "pk": 31002016,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 16,
      "text": "All your enemies open their mouths wide against you; they hiss and gnash their teeth. They say: 'We have swallowed her up! This is the day we have waited for; we have seen it, we have lived to see it.'",
      "links": "<a href='/AIV/19/35/21'>Ps. 35:21</a>; <a href='/AIV/18/16/9'>Job 16:9</a>",
      "comment": "Though enemies rejoice at her fall, God allows temporary defeat only for greater victory and vindication—foreshadowing how Christ’s crucifixion was turned to triumph through the resurrection (Col. 2:15)."
    },
    {
      "pk": 31002017,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 17,
      "text": "The Lord has done what he planned; he has fulfilled his word that he commanded long ago. He has overthrown without pity, and has made the enemy rejoice over you and has exalted the power of your adversaries.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>; <a href='/AIV/05/28/63'>Deut. 28:63</a>",
      "comment": "God’s faithfulness to his word—both in judgment and in mercy—reminds us his promises (even of discipline) are certain. The ultimate promise is restoration through Christ, the perfect fulfillment of God’s word (2 Cor. 1:20)."
    },
    {
      "pk": 31002018,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 18,
      "text": "Their hearts cried out to the Lord: 'O wall of the daughter of Zion, let your tears run down like a river day and night; give yourself no relief, let your eyes have no rest.'",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/19/80/5'>Ps. 80:5</a>",
      "comment": "The call for unceasing lament echoes the persistent intercession found in Scripture (1 Thess. 5:17). Devotion to prayer, especially in times of darkness, is a mark of spiritual maturity in the faithful community."
    },
    {
      "pk": 31002019,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 19,
      "text": "Arise, cry out in the night, at the beginning of the watches! Pour out your heart like water before the presence of the Lord. Lift your hands to him for the lives of your children, who faint for hunger at the head of every street.",
      "links": "<a href='/AIV/19/62/8'>Ps. 62:8</a>; <a href='/AIV/19/28/2'>Ps. 28:2</a>",
      "comment": "‘Pour out your heart... lift your hands’ points to the physical expression of prayer. The instruction to intercede for the children underlines the communal nature of prayer, which later becomes a foundational characteristic of the Church gathered for worship and intercession."
    },
    {
      "pk": 31002020,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 20,
      "text": "Look, O Lord, and see! Whom have you ever treated like this? Should women eat the fruit of their womb, the children they have cared for? Should priest and prophet be killed in the sanctuary of the Lord?",
      "links": "<a href='/AIV/05/28/53'>Deut. 28:53</a>; <a href='/AIV/12/25/18'>2 Kings 25:18</a>",
      "comment": "The horror here is ultimate spiritual and physical desolation; yet, even from such depths, the cry returns to God. The mention of priest and prophet being slain suggests a collapse of mediation, remedy restored in the perfect Priest and Prophet, Christ, whose self-offering brings new life."
    },
    {
      "pk": 31002021,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 21,
      "text": "Young and old lie on the ground in the streets; my young women and my young men have fallen by the sword. You have killed them in the day of your anger, slaughtering without pity.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>; <a href='/AIV/24/6/11'>Jer. 6:11</a>",
      "comment": "The devastation is total, showing the consequences of covenant unfaithfulness. Both physical and spiritual death reign, pointing to humanity's need for salvation through a new covenant that truly brings unity and peace."
    },
    {
      "pk": 31002022,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 2,
      "verse": 22,
      "text": "You have summoned as if to a festival day terrors on every side, and on the day of the Lord’s anger no one escaped or survived; those I nurtured and raised my enemy has destroyed.",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/24/6/25'>Jer. 6:25</a>",
      "comment": "The perversion of the festival day into a day of terror contrasts with the promise of the true Feast when God will gather all his people in joy (Isa. 25:6-8, Rev. 19:9). The theme of raising up a new people through tribulation is fulfilled in the gathering of the Church into unity and victory through Christ."
    }
  ],
  "translatedAt": "2025-12-24T08:52:44.765Z"
}