{
  "book": 54,
  "bookName": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 9,
  "verses": [
    {
      "pk": 54009001,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 1,
      "text": "Now concerning the ministry to the saints, it is unnecessary for me to write further to you.",
      "links": "<a href='/AIV/45/15/25-27'>Rom. 15:25-27</a>; <a href='/AIV/46/16/1'>1 Cor. 16:1</a>",
      "comment": "Paul refers to the collection for believers in Jerusalem. This reflects early Christian concern for unity and charity among believers, setting a foundation for apostolic cooperation and tangible expressions of the faith."
    },
    {
      "pk": 54009002,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 2,
      "text": "For I know your eagerness, about which I boast on your behalf to those in Macedonia, saying that Achaia has been ready since last year, and your zeal has inspired most of them.",
      "links": "<a href='/AIV/47/8/24'>2 Cor. 8:24</a>; <a href='/AIV/52/1/7'>1 Thess. 1:7</a>",
      "comment": "Paul highlights the example of the believers’ readiness, emphasizing the idea of holy competition in charity. Their model inspired others. This hints at a spiritual communion and interconnectedness typical in apostolic teaching."
    },
    {
      "pk": 54009003,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 3,
      "text": "But I am sending the brothers so that our boasting about you in this matter may not be empty, and that you may be prepared, just as I said you would be.",
      "links": "<a href='/AIV/47/8/17-18'>2 Cor. 8:17-18</a>",
      "comment": "Paul sends trusted men to ensure their promise is fulfilled. This establishes accountability and order, displaying a principle of apostolic oversight resembling early church structures."
    },
    {
      "pk": 54009004,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 4,
      "text": "Otherwise, if any Macedonians come with me and find you unprepared, we—not to mention you—would be embarrassed by this confidence.",
      "links": "<a href='/AIV/47/8/24'>2 Cor. 8:24</a>",
      "comment": "A sense of public witness is at stake. Paul’s concern highlights the value of consistency between what is confessed and what is practiced, a central theme in authentic Christian living."
    },
    {
      "pk": 54009005,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 5,
      "text": "So I thought it necessary to urge the brothers to go ahead and arrange in advance your promised gift, so that it would be ready as a genuine blessing and not as something grudgingly given.",
      "links": "<a href='/AIV/47/8/20'>2 Cor. 8:20</a>; <a href='/AIV/45/12/8'>Rom. 12:8</a>",
      "comment": "Genuine giving, springing from the heart, is distinguished from reluctant duty. Early Christian practice stresses interior disposition over external acts, suggesting true charity is a spiritual gift empowered by grace."
    },
    {
      "pk": 54009006,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 6,
      "text": "Remember this: whoever sows sparingly will also reap sparingly, and whoever sows bountifully will also reap bountifully.",
      "links": "<a href='/AIV/48/6/7'>Gal. 6:7</a>; <a href='/AIV/20/11/24'>Prov. 11:24</a>",
      "comment": "The principle of spiritual reciprocity mirrors teachings in both Old and New Testaments. Giving yields blessings, reinforcing the theology of merit and spiritual reward found throughout scripture."
    },
    {
      "pk": 54009007,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 7,
      "text": "Each one should give as he has determined in his heart—not reluctantly or under compulsion, for God loves a cheerful giver.",
      "links": "<a href='/AIV/05/15/10'>Deut. 15:10</a>; <a href='/AIV/13/29/17'>1 Chr. 29:17</a>",
      "comment": "The teaching recognizes free will in giving, but sees generosity as a spiritual virtue. Cheerfulness in the act of charity is a sign of authentic inward transformation by grace."
    },
    {
      "pk": 54009008,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 8,
      "text": "And God is able to make every grace overflow to you, so that in every way, always having enough, you may abound in every good work.",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>; <a href='/AIV/40/6/32-33'>Matt. 6:32-33</a>",
      "comment": "Paul links generosity with the abundance of grace, suggesting spiritual and material benefits stem from divine providence. Note the idea that grace empowers good works, which is a key theme in apostolic tradition."
    },
    {
      "pk": 54009009,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 9,
      "text": "As it is written, 'He has scattered, he has given to the poor; his righteousness endures forever.'",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>",
      "comment": "Paul quotes the Old Testament to show that generosity leads to lasting righteousness. This righteousness is not merely imputed but displayed in renewed living, a union between faith and action."
    },
    {
      "pk": 54009010,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 10,
      "text": "Now he who supplies seed to the sower and bread for food will also supply and multiply your seed and increase the harvest of your righteousness.",
      "links": "<a href='/AIV/23/55/10'>Isa. 55:10</a>",
      "comment": "God’s providence sustains and multiplies both material and spiritual resources. The notion of the harvest of righteousness implies ongoing sanctification and fruitfulness as a result of grace working in the believer."
    },
    {
      "pk": 54009011,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 11,
      "text": "You will be enriched in every way for all generosity, which through us will produce thanksgiving to God.",
      "links": "<a href='/AIV/47/1/11'>2 Cor. 1:11</a>; <a href='/AIV/51/1/12'>Col. 1:12</a>",
      "comment": "See how Paul connects material abundance to thankfulness, fostering a culture of gratitude and worship. The apostolic ministry acts as a conduit for these spiritual benefits, underscoring the importance of ordained leadership."
    },
    {
      "pk": 54009012,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 12,
      "text": "Because the ministry of this service is not only supplying the needs of the saints, but is also overflowing in many thanksgivings to God.",
      "links": "<a href='/AIV/44/11/29'>Acts 11:29</a>; <a href='/AIV/19/50/23'>Ps. 50:23</a>",
      "comment": "Material generosity leads to spiritual benefit, and worship. Paul links physical charity to spiritual worship—a holistic view that fulfills both old and new covenant expectations."
    },
    {
      "pk": 54009013,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 13,
      "text": "By the proof given by this ministry, they will glorify God for your obedience to the confession of the gospel of Christ and for your generosity in sharing with them and with everyone else.",
      "links": "<a href='/AIV/47/8/19'>2 Cor. 8:19</a>; <a href='/AIV/60/4/11'>1 Pet. 4:11</a>",
      "comment": "Not only faith, but obedience and practical charity mark a true disciple. This signals an organic connection between creed and practice, continuity with the ethos of the apostolic community."
    },
    {
      "pk": 54009014,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 14,
      "text": "And by their prayer for you, which arises out of their deep affection for you because of the surpassing grace of God given to you.",
      "links": "<a href='/AIV/51/1/4'>Col. 1:4</a>; <a href='/AIV/60/1/22'>1 Pet. 1:22</a>",
      "comment": "Unity in prayer and love among believers is seen as a fruit of divine grace. The spiritual bonds of affection and intercession point to a deeper sacramental reality within the church community."
    },
    {
      "pk": 54009015,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 9,
      "verse": 15,
      "text": "Thanks be to God for his indescribable gift!",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/45/6/23'>Rom. 6:23</a>",
      "comment": "The ‘indescribable gift’ points to Christ, the supreme revelation of God’s love and grace. The response is sustained thanksgiving—a foretaste of eternal worship, especially in the sacramental life of the church."
    }
  ],
  "translatedAt": "2025-12-24T11:56:07.307Z"
}