{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 12,
  "verses": [
    {
      "pk": 2024052001,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 1,
      "text": "It is necessary to boast, though it does not benefit, but I will go on to visions and revelations from the Lord.",
      "links": "<a href='/AIV/44/10/10-17'>Acts 10:10-17</a>; <a href='/AIV/47/5/13'>2 Cor. 5:13</a>",
      "comment": "Paul reluctantly boasts to counter critics, yet emphasizes that spiritual experiences, such as visions, come from God, not personal merit."
    },
    {
      "pk": 2024052002,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 2,
      "text": "I know a man in Christ who fourteen years ago—whether in the body I do not know, or out of the body I do not know, God knows—was caught up to the third heaven.",
      "links": "<a href='/AIV/44/22/17'>Acts 22:17</a>; <a href='/AIV/66/4/1'>Rev. 4:1</a>",
      "comment": "Paul speaks in the third person out of humility. The 'third heaven' is understood as the immediate presence of God, implying levels of spiritual reality."
    },
    {
      "pk": 2024052003,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 3,
      "text": "And I know that this man—whether in the body or apart from the body I do not know, God knows—",
      "links": "<a href='/AIV/47/12/2'>2 Cor. 12:2</a>",
      "comment": "This repetition shows Paul's uncertainty about the nature of spiritual visions, indicating the transcendence of such experiences."
    },
    {
      "pk": 2024052004,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 4,
      "text": "was caught up into Paradise and heard inexpressible words, which it is not permitted for a man to speak.",
      "links": "<a href='/AIV/42/23/43'>Luke 23:43</a>; <a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "The reference to 'Paradise' echoes Jewish and early Christian beliefs about the afterlife. Paul’s humility in not revealing the revelation’s content hints at the sacredness and mystique of divine experiences."
    },
    {
      "pk": 2024052005,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 5,
      "text": "On behalf of such a man I will boast, but on my own behalf I will not boast, except in my weaknesses.",
      "links": "<a href='/AIV/47/11/30'>2 Cor. 11:30</a>; <a href='/AIV/47/13/4'>2 Cor. 13:4</a>",
      "comment": "Paul insists that true Christian glory is found not in spiritual experiences, but in weakness, humility, and dependence on Christ."
    },
    {
      "pk": 2024052006,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 6,
      "text": "For if I should desire to boast, I would not be foolish, for I would be speaking the truth. But I refrain, so that no one will think more of me than what he sees in me or hears from me.",
      "links": "<a href='/AIV/47/10/8'>2 Cor. 10:8</a>; <a href='/AIV/48/6/14'>Gal. 6:14</a>",
      "comment": "Paul’s self-restraint here shows the virtue of humility, avoiding spiritual pride—an essential teaching for authentic church leadership."
    },
    {
      "pk": 2024052007,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 7,
      "text": "So that I would not become conceited because of these surpassingly great revelations, a thorn was given to me in the flesh, a messenger of Satan to torment me, so that I would not be exalted above measure.",
      "links": "<a href='/AIV/18/2/6'>Job 2:6</a>; <a href='/AIV/48/4/13-14'>Gal. 4:13-14</a>",
      "comment": "The ‘thorn in the flesh’ is a mysterious phrase that may refer to a physical ailment or persistent temptation, intended by God to preserve humility. Compare to Old Testament examples of suffering serving a greater purpose (Job)."
    },
    {
      "pk": 2024052008,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 8,
      "text": "Three times I pleaded with the Lord about this, that it might leave me.",
      "links": "<a href='/AIV/40/26/44'>Matt. 26:44</a>; <a href='/AIV/47/1/11'>2 Cor. 1:11</a>",
      "comment": "Paul’s repeated prayer mirrors Christ’s prayer in Gethsemane. Not all prayers for relief are answered affirmatively, teaching believers perseverance and trust."
    },
    {
      "pk": 2024052009,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 9,
      "text": "But he said to me, \"My grace is sufficient for you, for my power is perfected in weakness.\" Therefore, I will most gladly boast all the more in my weaknesses, so that the power of Christ may rest upon me.",
      "links": "<a href='/AIV/50/4/13'>Phil. 4:13</a>; <a href='/AIV/47/4/7'>2 Cor. 4:7</a>",
      "comment": "This is the central theological point: God’s grace sustains, and Christ’s power is revealed through human weakness. This idea has been central across Christian spirituality—linking Christ’s humility in the Incarnation with the believer’s life."
    },
    {
      "pk": 2024052010,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 10,
      "text": "Therefore, I am content with weaknesses, insults, hardships, persecutions, and difficulties, for Christ’s sake. For when I am weak, then I am strong.",
      "links": "<a href='/AIV/40/5/10-12'>Matt. 5:10-12</a>; <a href='/AIV/47/4/8-10'>2 Cor. 4:8-10</a>",
      "comment": "Paul lists the sufferings endured in union with Christ. This echoes Jesus’ teaching on the blessédness of enduring hardship for righteousness’ sake."
    },
    {
      "pk": 2024052011,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 11,
      "text": "I have become foolish; you forced me. For I ought to have been commended by you, for in nothing was I inferior to the 'super-apostles,' even though I am nothing.",
      "links": "<a href='/AIV/47/11/5'>2 Cor. 11:5</a>; <a href='/AIV/47/10/12'>2 Cor. 10:12</a>",
      "comment": "'Super-apostles' refers sarcastically to those who boasted of their authority. Paul models apostolic humility and service—a necessary trait for all future leaders of the Church."
    },
    {
      "pk": 2024052012,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 12,
      "text": "The signs of a true apostle were performed among you with all endurance, by signs, wonders, and mighty deeds.",
      "links": "<a href='/AIV/44/2/43'>Acts 2:43</a>; <a href='/AIV/45/15/18-19'>Rom. 15:18-19</a>",
      "comment": "Miraculous signs authenticated Paul’s apostolic authority, continuing Christ’s ministry through the Church."
    },
    {
      "pk": 2024052013,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 13,
      "text": "In what way were you less favored than the other churches, except that I myself was not a burden to you? Forgive me this injustice!",
      "links": "<a href='/AIV/47/11/7-9'>2 Cor. 11:7-9</a>",
      "comment": "Paul’s refusal to accept support from the Corinthians was unusual. His sarcasm underscores his love and impartiality as a shepherd of the universal Church."
    },
    {
      "pk": 2024052014,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 14,
      "text": "See, for the third time I am ready to come to you, and I will not be a burden, for I seek not what is yours, but you. For children are not obligated to save up for their parents, but parents for their children.",
      "links": "<a href='/AIV/47/13/1'>2 Cor. 13:1</a>; <a href='/AIV/49/4/28'>Eph. 4:28</a>",
      "comment": "Paul emphasizes true pastoral care—shepherds sacrificing themselves for their flock, not exploiting them."
    },
    {
      "pk": 2024052015,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 15,
      "text": "And I will most gladly spend and be expended for your souls. If I love you more, am I to be loved less?",
      "links": "<a href='/AIV/47/6/11-13'>2 Cor. 6:11-13</a>",
      "comment": "Spiritual leadership requires self-sacrificial love. Paul’s willingness to give himself completely foreshadows Christ and the apostolic model for ministry."
    },
    {
      "pk": 2024052016,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 16,
      "text": "But let it be so; I did not burden you. Yet, being crafty, I caught you by deceit!",
      "links": "<a href='/AIV/47/7/2'>2 Cor. 7:2</a>",
      "comment": "Paul’s irony here addresses critics who accused him of manipulation. Yet, his transparent motives underscore the purity required of true ministry."
    },
    {
      "pk": 2024052017,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 17,
      "text": "Did I take advantage of you through any of those whom I sent to you?",
      "links": "<a href='/AIV/47/8/20-22'>2 Cor. 8:20-22</a>",
      "comment": "Paul appeals to his record and the honesty of his fellow laborers, establishing credibility for apostolic leaders and their successors."
    },
    {
      "pk": 2024052018,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 18,
      "text": "I urged Titus to go, and I sent the brother with him. Did Titus take advantage of you? Did we not walk in the same spirit? Did we not walk in the same steps?",
      "links": "<a href='/AIV/47/8/6'>2 Cor. 8:6</a>",
      "comment": "The unity of purpose between Paul and his co-workers echoes apostolic succession, and the importance of continuity in true teaching."
    },
    {
      "pk": 2024052019,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 19,
      "text": "Have you been thinking all along that we are defending ourselves to you? Before God, in Christ, we are speaking; and all, beloved, for your upbuilding.",
      "links": "<a href='/AIV/47/2/17'>2 Cor. 2:17</a>; <a href='/AIV/49/4/12'>Eph. 4:12</a>",
      "comment": "Paul’s defense is ultimately about building up the Church in truth and love, not defending his ego—a mark of an authentic shepherd."
    },
    {
      "pk": 2024052020,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 20,
      "text": "For I fear that, when I come, I may not find you as I wish, and that you may not find me as you wish—that perhaps there may be strife, jealousy, outbursts of anger, selfish ambition, slander, gossip, arrogance, and disorder.",
      "links": "<a href='/AIV/48/5/19-21'>Gal. 5:19-21</a>; <a href='/AIV/59/3/16'>James 3:16</a>",
      "comment": "Paul’s pastoral concern is for the spiritual health and unity of the community, highlighting the seriousness of discord in the Church."
    },
    {
      "pk": 2024052021,
      "translation": "AIV",
      "book": 47,
      "chapter": 12,
      "verse": 21,
      "text": "I fear that when I come again, my God may humble me before you, and I may have to mourn over many who have sinned earlier and have not repented of impurity, sexual immorality, and sensuality that they have practiced.",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>; <a href='/AIV/49/5/5'>Eph. 5:5</a>",
      "comment": "Paul warns that persistent sin in the Church leads to sorrow and humility for its leaders. True repentance and holiness are necessary for full communion in the body of Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:50:13.119Z"
}