{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 1,
  "verses": [
    {
      "pk": 2002001,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the will of God, and Timothy our brother, to the church of God that is in Corinth, together with all the saints who are in the whole region of Achaia:",
      "links": "<a href='/AIV/44/18/1'>Acts 18:1</a>; <a href='/AIV/47/8/1'>2 Cor. 8:1</a>",
      "comment": "Paul greets the church at Corinth, highlighting his apostleship as not self-appointed, but by God's will. 'Saints' refers to all the faithful, underscoring a visible, united fellowship of believers."
    },
    {
      "pk": 2002002,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 2,
      "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/54/1/2'>1 Tim. 1:2</a>",
      "comment": "This greeting, often used by Paul, reflects both the Hebrew blessing of peace (shalom) and the Greek blessing of grace. It recognizes Jesus as fully divine and as the source of peace."
    },
    {
      "pk": 2002003,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 3,
      "text": "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all comfort,",
      "links": "<a href='/AIV/49/1/3'>Eph. 1:3</a>; <a href='/AIV/19/86/15'>Ps. 86:15</a>",
      "comment": "Paul begins with praise, highlighting God as merciful and comforting, echoing Old Testament descriptions (see Psalm 86:15)."
    },
    {
      "pk": 2002004,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 4,
      "text": "who comforts us in all our troubles, so that we may be able to comfort those who are in any trouble, with the comfort with which we ourselves are comforted by God.",
      "links": "<a href='/AIV/23/40/1'>Isa. 40:1</a>; <a href='/AIV/47/7/6'>2 Cor. 7:6</a>",
      "comment": "Comfort received from God is meant to be passed on, suggesting the importance of mediation and the communion of believers."
    },
    {
      "pk": 2002005,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 5,
      "text": "For just as the sufferings of Christ abound for us, so through Christ our comfort also abounds.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/47/4/10'>2 Cor. 4:10</a>",
      "comment": "Sharing in Christ’s sufferings is presented as integral to Christian life, pointing to the spiritual value of suffering united with Christ (see Romans 8:17)."
    },
    {
      "pk": 2002006,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 6,
      "text": "If we are troubled, it is for your comfort and salvation; if we are comforted, it is for your comfort, which you experience when you patiently endure the same sufferings that we also suffer.",
      "links": "<a href='/AIV/47/4/12'>2 Cor. 4:12</a>",
      "comment": "Paul links suffering with the salvation and growth of others, emphasizing the united nature of the Church and redemptive suffering."
    },
    {
      "pk": 2002007,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 7,
      "text": "Our hope for you is firm, because we know that as you share in our sufferings, so also you will share in our comfort.",
      "links": "<a href='/AIV/47/7/7'>2 Cor. 7:7</a>",
      "comment": "There is an assurance of mutual participation (koinonia) in both suffering and consolation—idea of the mystical body of Christ."
    },
    {
      "pk": 2002008,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 8,
      "text": "For we do not want you to be unaware, brothers, about the trouble we faced in the province of Asia: we were burdened far beyond our strength, so that we despaired even of life itself.",
      "links": "<a href='/AIV/44/19/23'>Acts 19:23</a>",
      "comment": "Paul references severe trials, likely in Ephesus, demonstrating the depth of apostolic suffering and reliance on God."
    },
    {
      "pk": 2002009,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 9,
      "text": "Indeed, we felt that we had received the sentence of death, so that we would not trust in ourselves but in God who raises the dead.",
      "links": "<a href='/AIV/10/22/5'>2 Sam. 22:5</a>; <a href='/AIV/47/4/14'>2 Cor. 4:14</a>",
      "comment": "Paul emphasizes dependence on God even in despair, recalling the power of God’s resurrection (see 2 Cor. 4:14)."
    },
    {
      "pk": 2002010,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 10,
      "text": "He delivered us from such deadly peril, and He will deliver us again. On Him we have set our hope that He will keep delivering us,",
      "links": "<a href='/AIV/55/4/18'>2 Tim. 4:18</a>",
      "comment": "Paul sees God’s saving acts as ongoing, instilling trust for both present and future."
    },
    {
      "pk": 2002011,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 11,
      "text": "while you also help us by your prayers, so that many will give thanks on our behalf for the blessing granted to us through the prayers of many.",
      "links": "<a href='/AIV/50/1/19'>Phil. 1:19</a>; <a href='/AIV/59/5/16'>Jam. 5:16</a>",
      "comment": "Paul underscores the power and necessity of intercessory prayer, recognizing joint participation in God’s blessings."
    },
    {
      "pk": 2002012,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 12,
      "text": "For our boast is this: the testimony of our conscience, that we behaved in the world with simplicity and godly sincerity, not by earthly wisdom but by the grace of God, and especially so toward you.",
      "links": "<a href='/AIV/44/23/1'>Acts 23:1</a>; <a href='/AIV/46/2/4'>1 Cor. 2:4</a>",
      "comment": "Paul appeals to a clear conscience before God, relying not on worldly wisdom but on divine grace."
    },
    {
      "pk": 2002013,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 13,
      "text": "For we are not writing anything to you except what you can read and understand. And I hope you will fully understand,",
      "links": "<a href='/AIV/48/1/20'>Gal. 1:20</a>; <a href='/AIV/47/2/17'>2 Cor. 2:17</a>",
      "comment": "Paul emphasizes transparency and clarity in his communication, contrasting this with false teachers."
    },
    {
      "pk": 2002014,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 14,
      "text": "just as you have partially understood us—that on the day of our Lord Jesus, you will boast of us, just as we will boast of you.",
      "links": "<a href='/AIV/46/1/8'>1 Cor. 1:8</a>; <a href='/AIV/47/5/10'>2 Cor. 5:10</a>",
      "comment": "Reference to ‘the day of our Lord Jesus’ highlights the expectation of final judgment. There is an anticipation of mutual glory in Christ."
    },
    {
      "pk": 2002015,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 15,
      "text": "Because I was sure of this, I planned to come to you first, so that you might have a second benefit,",
      "links": "<a href='/AIV/46/16/5'>1 Cor. 16:5</a>",
      "comment": "Paul intended to visit the Corinthians again, indicating the importance of direct pastoral care."
    },
    {
      "pk": 2002016,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 16,
      "text": "and through you to travel to Macedonia, and from Macedonia to come back to you, and have you send me on my way to Judea.",
      "links": "<a href='/AIV/44/20/1-3'>Acts 20:1–3</a>",
      "comment": "Paul’s itinerary underscores the early Church's connectedness and the role of local congregations in supporting apostolic work."
    },
    {
      "pk": 2002017,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 17,
      "text": "Was I vacillating when I planned this? Or do I make my plans in a worldly way, so that I say 'Yes, yes' and 'No, no' at the same time?",
      "links": "<a href='/AIV/40/5/37'>Matt. 5:37</a>",
      "comment": "Paul defends his integrity, echoing Jesus’ teaching about letting one’s word be true (see Matthew 5:37)."
    },
    {
      "pk": 2002018,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 18,
      "text": "But as God is faithful, our word to you has not been 'Yes and No.'",
      "links": "<a href='/AIV/58/10/23'>Heb. 10:23</a>",
      "comment": "Paul appeals to God’s own faithfulness as the measure of his apostolic consistency."
    },
    {
      "pk": 2002019,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 19,
      "text": "For the Son of God, Jesus Christ, whom we proclaimed among you—Silvanus and Timothy and I—was not 'Yes and No,' but in him it is always 'Yes.'",
      "links": "<a href='/AIV/43/1/17'>John 1:17</a>; <a href='/AIV/45/15/8'>Rom. 15:8</a>",
      "comment": "Christ is the unwavering fulfillment of all God’s promises (cf. John 1:17), and apostolic proclamation is meant to reflect His truth."
    },
    {
      "pk": 2002020,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 20,
      "text": "For all the promises of God find their 'Yes' in Him. That is why through Him we also utter 'Amen' to God for His glory.",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>; <a href='/AIV/45/15/8-9'>Rom. 15:8-9</a>",
      "comment": "'Amen' signals liturgical agreement. The fulfillment of divine promise in Christ draws on Old Testament prophecy, which finds its realization in Jesus."
    },
    {
      "pk": 2002021,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 21,
      "text": "Now it is God who establishes us with you in Christ, and has anointed us,",
      "links": "<a href='/AIV/62/2/27'>1 John 2:27</a>; <a href='/AIV/19/133/2'>Ps. 133:2</a>",
      "comment": "Paul emphasizes God’s action in confirming believers and notes anointing—the OT sign of being set apart—which now points to the new covenant reality."
    },
    {
      "pk": 2002022,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 22,
      "text": "and who has also put his seal on us and given us the Spirit in our hearts as a guarantee.",
      "links": "<a href='/AIV/49/1/13-14'>Eph. 1:13–14</a>; <a href='/AIV/47/5/5'>2 Cor. 5:5</a>",
      "comment": "The seal and gift of the Spirit signify a real transformation and pledge of future inheritance—aligning with the idea of sacraments as efficacious signs."
    },
    {
      "pk": 2002023,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 23,
      "text": "But I call God as witness against my soul—it was to spare you that I did not come again to Corinth.",
      "links": "<a href='/AIV/47/2/1'>2 Cor. 2:1</a>",
      "comment": "Paul’s change of plans was out of pastoral care, not fickleness, showing the shepherd’s concern for the flock."
    },
    {
      "pk": 2002024,
      "translation": "AIV",
      "book": 47,
      "chapter": 1,
      "verse": 24,
      "text": "Not that we lord it over your faith, but we work with you for your joy, for by faith you stand firm.",
      "links": "<a href='/AIV/60/5/3'>1 Pet. 5:3</a>",
      "comment": "Paul’s apostolic authority is exercised in service for the people’s joy and steadfastness, not domination. There is a real, visible leadership, but always at the service of faith."
    }
  ],
  "translatedAt": "2025-12-23T03:46:04.693Z"
}