{
  "book": 54,
  "bookName": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 10,
  "verses": [
    {
      "pk": 54010001,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 1,
      "text": "Now I, Paul, appeal to you by the meekness and gentleness of Christ—I who am humble when face to face with you, but bold toward you when away.",
      "links": "<a href='/AIV/40/11/29'>Matt. 11:29</a>; <a href='/AIV/47/13/10'>2 Cor. 13:10</a>",
      "comment": "Paul references Christ’s humility as a model. The mention of meekness echoes Christ's own self-description (Matt. 11:29). The apostle’s humility is not weakness but reflects Christ’s example; the spiritual leader acts in the spirit of Christ, emphasizing both gentleness and rightful apostolic authority."
    },
    {
      "pk": 54010002,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 2,
      "text": "I beg you that when I am present, I may not have to be bold with the confidence with which I intend to act against some who think we walk according to the flesh.",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>; <a href='/AIV/47/1/17'>2 Cor. 1:17</a>",
      "comment": "Paul hopes he won't need to exercise strict discipline but is prepared for it. The distinction between living according to the flesh or the spirit will echo throughout Christian ethical teaching. Paul’s authority is both spiritual and disciplinary."
    },
    {
      "pk": 54010003,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 3,
      "text": "For though we live in the flesh, we do not wage war according to the flesh.",
      "links": "<a href='/AIV/49/6/12'>Eph. 6:12</a>; <a href='/AIV/45/7/5'>Rom. 7:5</a>",
      "comment": "Here ‘the flesh’ refers to human weakness or sinful nature (Rom. 7:5). Christian engagement in the world is fought with spiritual, not worldly, weapons (Eph. 6:12). The spiritual reading points Christians toward a warfare that is internal and spiritual—reinforcing the need for spiritual discipline and virtue."
    },
    {
      "pk": 54010004,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 4,
      "text": "For the weapons of our warfare are not of the flesh but have divine power to destroy strongholds.",
      "links": "<a href='/AIV/49/6/13-17'>Eph. 6:13-17</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "Paul emphasizes that spiritual battles require spiritual armor and tools (Eph. 6), not physical force. ‘Strongholds’ can refer to sinful patterns or false arguments. This underlines the traditional emphasis on spiritual disciplines (prayer, sacraments, virtue) empowered by God, not merely human effort."
    },
    {
      "pk": 54010005,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 5,
      "text": "We tear down arguments and every proud thing raised against the knowledge of God, and we take every thought captive to obey Christ.",
      "links": "<a href='/AIV/51/2/8'>Col. 2:8</a>; <a href='/AIV/45/1/21'>Rom. 1:21</a>",
      "comment": "Paul asserts the supremacy of Christ in both thought and practice. Capturing thoughts refers to deep inner conversion and intellectual submission to Christ’s authority. Christian life involves obedience that is both internal and rational—a faith that seeks understanding."
    },
    {
      "pk": 54010006,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 6,
      "text": "And we are ready to punish every disobedience, once your obedience is complete.",
      "links": "<a href='/AIV/47/2/9'>2 Cor. 2:9</a>; <a href='/AIV/47/7/15'>2 Cor. 7:15</a>",
      "comment": "Paul awaits full obedience in the community before enforcing discipline. The order and authority implied here supports a structured spiritual leadership with the power to correct, showing the church’s shepherding role over believers."
    },
    {
      "pk": 54010007,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 7,
      "text": "Look at what is before your eyes. If anyone is confident that he belongs to Christ, let him remind himself that just as he belongs to Christ, so do we.",
      "links": "<a href='/AIV/47/11/23'>2 Cor. 11:23</a>; <a href='/AIV/46/1/12'>1 Cor. 1:12</a>",
      "comment": "Paul challenges those claiming exclusive rights to Christ. Belonging to Christ also means recognition of the apostolic witness and unity, reflecting the visible communion of the church."
    },
    {
      "pk": 54010008,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 8,
      "text": "For even if I boast somewhat freely about our authority—which the Lord gave for building you up and not for tearing you down—I will not be ashamed.",
      "links": "<a href='/AIV/47/13/10'>2 Cor. 13:10</a>; <a href='/AIV/49/4/12'>Eph. 4:12</a>",
      "comment": "Apostolic authority is given by God for edification, not harm—a principle of servant-leadership. The building up of the community recalls the stewardship and sacramental character of leadership among the apostles."
    },
    {
      "pk": 54010009,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 9,
      "text": "I do not want to appear to be frightening you with my letters.",
      "links": "<a href='/AIV/47/7/8'>2 Cor. 7:8</a>",
      "comment": "Paul assures the church that his stern letters aren’t meant to intimidate, but to guide. His authority is tempered by pastoral concern."
    },
    {
      "pk": 54010010,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 10,
      "text": "For they say, 'His letters are weighty and strong, but his bodily presence is weak, and his speech is of no account.'",
      "links": "<a href='/AIV/47/12/7'>2 Cor. 12:7</a>",
      "comment": "Paul’s critics highlight the contrast between his strong writing and apparently unimpressive presence. Such criticism reveals the tendency to judge leadership by outward standards rather than spiritual substance."
    },
    {
      "pk": 54010011,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 11,
      "text": "Let such a person understand that what we say by letter when absent, we do also when present.",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>",
      "comment": "Paul insists his authority and message are consistent in person or by letter—a mark of integrity in spiritual leadership."
    },
    {
      "pk": 54010012,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 12,
      "text": "For we do not dare to classify or compare ourselves with some who commend themselves. But when they measure themselves by one another and compare themselves with one another, they are without understanding.",
      "links": "<a href='/AIV/50/2/3'>Phil. 2:3</a>; <a href='/AIV/56/3/2'>Titus 3:2</a>",
      "comment": "Self-commendation and rivalry run counter to true spiritual wisdom. Paul underscores humility and unity over self-promotion—virtues essential to early church life."
    },
    {
      "pk": 54010013,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 13,
      "text": "But we will not boast beyond limits, but only within the field of influence God assigned to us, to reach even you.",
      "links": "<a href='/AIV/47/3/5'>2 Cor. 3:5</a>",
      "comment": "Paul recognizes a divinely-given sphere of ministry. Humble acceptance of one’s calling preserves unity and order, themes crucial for the structured mission of the apostles."
    },
    {
      "pk": 54010014,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 14,
      "text": "For we are not overextending ourselves, as though we did not reach you. For we were the first to come all the way to you with the gospel of Christ.",
      "links": "<a href='/AIV/44/18/1'>Acts 18:1</a>",
      "comment": "Paul points to his original mission to Corinth. The apostolic role includes pioneering evangelistic outreach—a foundational authority in the faith handed on from the apostles."
    },
    {
      "pk": 54010015,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 15,
      "text": "We do not boast beyond limit in the labors of others. But our hope is that as your faith increases, our area of ministry among you may be greatly enlarged,",
      "links": "<a href='/AIV/47/3/1-2'>2 Cor. 3:1-2</a>",
      "comment": "Paul does not claim credit for others’ work; instead, he looks for the natural growth of the church under apostolic guidance. As faith grows, so does the mission. Spiritual authority and pastoral care are tied to the faith of the community."
    },
    {
      "pk": 54010016,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 16,
      "text": "so that we may preach the gospel in lands beyond you, without boasting of work already done in someone else’s area of ministry.",
      "links": "<a href='/AIV/45/15/20'>Rom. 15:20</a>",
      "comment": "Paul’s vision is outward, aiming to preach where Christ is not yet known. This reflects the missionary character of the apostolic church, expanding through legitimate authority and without rivalry."
    },
    {
      "pk": 54010017,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 17,
      "text": "But, 'Let the one who boasts, boast in the Lord.'",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "This is a call to theological humility, quoting Jeremiah. All Christian accomplishment comes from God’s grace, not human merit—pointing to the grace-centered life of the church."
    },
    {
      "pk": 54010018,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 10,
      "verse": 18,
      "text": "For it is not the one who commends himself who is approved, but the one whom the Lord commends.",
      "links": "<a href='/AIV/42/18/14'>Luke 18:14</a>; <a href='/AIV/47/5/9'>2 Cor. 5:9</a>",
      "comment": "True approval is from God, not self-commendation. Humility and service, rather than self-promotion, are at the heart of spiritual leadership. The passage highlights the visible, divinely-sanctioned authority that marks the structure of the apostolic church."
    }
  ],
  "translatedAt": "2025-12-24T11:56:32.700Z"
}