{
  "book": 54,
  "bookName": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 3,
  "verses": [
    {
      "pk": 54003001,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 1,
      "text": "Are we beginning to recommend ourselves again? Or do we, like some, need letters of recommendation to you or from you?",
      "links": "<a href='/AIV/47/5/12'>2 Cor. 5:12</a>; <a href='/AIV/44/9/2'>Acts 9:2</a>",
      "comment": "Paul opens by addressing concerns about his authority as an apostle. Letters of recommendation were common for traveling teachers; Paul subtly distinguishes his gospel as divinely validated."
    },
    {
      "pk": 54003002,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 2,
      "text": "You yourselves are our letter, written in our hearts, known and read by everyone.",
      "links": "<a href='/AIV/52/1/8'>1 Thess. 1:8</a>; <a href='/AIV/46/9/2'>1 Cor. 9:2</a>",
      "comment": "The transformed lives of the Corinthians are proof of God’s work through Paul, demonstrating the power of authentic apostolic ministry—one that is visible and experienced in the community."
    },
    {
      "pk": 54003003,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 3,
      "text": "It is clear that you are a letter from Christ delivered by us, written not with ink, but with the Spirit of the living God, not on tablets of stone but on tablets of human hearts.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/26/36/26'>Ezek. 36:26</a>; <a href='/AIV/02/24/12'>Ex. 24:12</a>",
      "comment": "Paul contrasts the Old Covenant (written on stone) with the New Covenant (written on hearts), referencing <a href='/AIV/24/31/33'>Jeremiah 31:33</a>. This highlights the Spirit's ongoing, internal work—a spiritual transformation that embodies the fulfillment of biblical prophecy."
    },
    {
      "pk": 54003004,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 4,
      "text": "Such confidence we have through Christ before God.",
      "links": "<a href='/AIV/58/4/16'>Heb. 4:16</a>; <a href='/AIV/50/3/3-4'>Phil. 3:3–4</a>",
      "comment": "Paul’s assurance is not from himself, but from Christ, who mediates our relationship with God—a subtle reference to the necessity of mediation even in the New Covenant."
    },
    {
      "pk": 54003005,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 5,
      "text": "Not that we are sufficient in ourselves to consider anything as coming from ourselves, but our sufficiency is from God.",
      "links": "<a href='/AIV/43/15/5'>John 15:5</a>; <a href='/AIV/50/2/13'>Phil. 2:13</a>",
      "comment": "Paul humbly acknowledges that the ability for true ministry comes from God, not human effort—echoing dependence on divine grace, a crucial principle for authentic leadership and service."
    },
    {
      "pk": 54003006,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 6,
      "text": "He has made us competent as ministers of a new covenant—not of the letter, but of the Spirit; for the letter kills, but the Spirit gives life.",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>; <a href='/AIV/45/7/6'>Rom. 7:6</a>",
      "comment": "Paul describes the apostles as servants of the new covenant promised in the prophets (<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>). The contrast between 'letter' and 'Spirit' reveals the new life made possible in the sacramental order Christ established."
    },
    {
      "pk": 54003007,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 7,
      "text": "Now if the ministry of death, engraved in letters on stone, came with glory, so that the Israelites could not gaze at Moses' face because of its glory, fading as it was,",
      "links": "<a href='/AIV/02/34/29-35'>Ex. 34:29-35</a>; <a href='/AIV/58/3/3'>Heb. 3:3</a>",
      "comment": "Paul calls the Old Covenant 'the ministry of death,' not to denigrate it, but to show its temporary nature and prepare for the greater glory of the new way revealed in Christ."
    },
    {
      "pk": 54003008,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 8,
      "text": "will not the ministry of the Spirit be even more glorious?",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>; <a href='/AIV/45/8/2'>Rom. 8:2</a>",
      "comment": "The new ministry, characterized by the Spirit, surpasses the old not only in glory but in life-giving power. The role of the Spirit here points toward ongoing, living guidance in the Church."
    },
    {
      "pk": 54003009,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 9,
      "text": "For if there was glory in the ministry of condemnation, how much more does the ministry of righteousness overflow in glory!",
      "links": "<a href='/AIV/45/1/16-17'>Rom. 1:16-17</a>",
      "comment": "The new covenant brings not condemnation but righteousness through the work of Christ. Paul’s language highlights the abundance of grace and glory now available."
    },
    {
      "pk": 54003010,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 10,
      "text": "Indeed, in this respect, what had glory now has no glory at all, compared to the surpassing glory.",
      "links": "<a href='/AIV/50/3/8'>Phil. 3:8</a>",
      "comment": "Paul’s emphasis on the ‘surpassing glory’ of the new covenant underscores how Christ fulfills and transforms the old, bringing it to perfection."
    },
    {
      "pk": 54003011,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 11,
      "text": "For if what was fading away came with glory, how much greater is the glory of what remains!",
      "links": "<a href='/AIV/58/8/6'>Heb. 8:6</a>; <a href='/AIV/49/3/21'>Eph. 3:21</a>",
      "comment": "The permanency of the new covenant is affirmed; its glory does not fade. Implied here is an enduring and visible community of faith continuing in Christ's new order."
    },
    {
      "pk": 54003012,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 12,
      "text": "Having such a hope, we speak with great boldness,",
      "links": "<a href='/AIV/44/4/13'>Acts 4:13</a>",
      "comment": "This boldness stems from hope rooted in the enduring reality of the new covenant’s presence and efficacy."
    },
    {
      "pk": 54003013,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 13,
      "text": "not like Moses, who would put a veil over his face so that the Israelites would not gaze at the end of what was fading away.",
      "links": "<a href='/AIV/02/34/33-35'>Ex. 34:33-35</a>",
      "comment": "Paul recalls Moses veiling his face after encountering God's glory, symbolizing the transition from the old, fading order to the clear revelation in Christ."
    },
    {
      "pk": 54003014,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 14,
      "text": "But their minds were hardened. For to this day, the same veil remains at the reading of the old covenant; it has not been lifted, because only in Christ is it removed.",
      "links": "<a href='/AIV/45/11/25'>Rom. 11:25</a>; <a href='/AIV/42/24/45'>Luke 24:45</a>",
      "comment": "The veiled understanding refers to spiritual blindness that persists until one turns to Christ, the fulfillment of the law and prophets. There is a spiritual veil that is lifted only through a living relationship with Jesus, who brings fullness of revelation."
    },
    {
      "pk": 54003015,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 15,
      "text": "Even today, whenever Moses is read, a veil lies over their hearts.",
      "links": "<a href='/AIV/45/10/4'>Rom. 10:4</a>",
      "comment": "Despite the regular reading of Scripture, understanding remains veiled without Christ. This also points to the necessity of tradition and Spirit-led interpretation within the community."
    },
    {
      "pk": 54003016,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 16,
      "text": "But whenever anyone turns to the Lord, the veil is taken away.",
      "links": "<a href='/AIV/02/34/34'>Ex. 34:34</a>; <a href='/AIV/43/8/32'>John 8:32</a>",
      "comment": "Coming to Christ brings true understanding; the heart is unveiled, and the mysteries of salvation are revealed more fully. This is seen both individually and communally."
    },
    {
      "pk": 54003017,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 17,
      "text": "Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom.",
      "links": "<a href='/AIV/43/4/24'>John 4:24</a>; <a href='/AIV/48/5/1'>Gal. 5:1</a>",
      "comment": "Paul speaks of the close unity between the Lord and the Spirit, emphasizing the liberating presence of God among His people. This hints at a deep, ongoing relationship mediated by the living Spirit."
    },
    {
      "pk": 54003018,
      "translation": "AIV",
      "book": 54,
      "bookName": "2 Corinthians",
      "bookAbbreviation": "2Cor",
      "chapter": 3,
      "verse": 18,
      "text": "And we all, with unveiled faces, beholding the glory of the Lord, are being transformed into the same image from glory to glory, just as from the Lord, who is the Spirit.",
      "links": "<a href='/AIV/19/34/5'>Ps. 34:5</a>; <a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/51/3/10'>Col. 3:10</a>",
      "comment": "Believers are sanctified and transformed—both now and continually—into Christ’s likeness through God’s ongoing work. This process of being changed 'from glory to glory' reflects deep spiritual growth united with the living Lord, and points to an ever-deepening union with Christ through the sacraments and communal life. The emphasis on both communal transformation and mediation through the Spirit hints at the apostolic continuity and living tradition entrusted to the whole Church."
    }
  ],
  "translatedAt": "2025-12-24T11:53:55.183Z"
}