{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 5,
  "verses": [
    {
      "pk": 2105001,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 1,
      "text": "For we know that if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens.",
      "links": "<a href='/AIV/58/11/10'>Heb. 11:10</a>; <a href='/AIV/43/14/2'>John 14:2</a>",
      "comment": "Paul uses the imagery of a tent to describe our mortal bodies, contrasting them with the permanent heavenly dwelling prepared by God. This points to the eternal hope held by believers—see Hebrews 11:10 and John 14:2 for the theme of God's prepared dwelling. The metaphor hints at the resurrection of the body and the permanence of our future life, a doctrine deeply rooted in apostolic tradition."
    },
    {
      "pk": 2105002,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 2,
      "text": "For in this tent we groan, longing to be clothed with our heavenly dwelling.",
      "links": "<a href='/AIV/45/8/23'>Romans 8:23</a>",
      "comment": "Paul's language conveys the Christian's yearning for transformation and resurrection, paralleling Romans 8:23. The desire for being 'clothed' evokes the notion of putting on immortality, not merely shedding mortal life."
    },
    {
      "pk": 2105003,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 3,
      "text": "If indeed, after being clothed, we will not be found naked.",
      "links": "<a href='/AIV/01/3/10'>Genesis 3:10</a>; <a href='/AIV/66/3/17'>Revelation 3:17</a>",
      "comment": "Here, 'nakedness' metaphorically stands for vulnerability or shame, echoing Genesis 3:10 and Revelation 3:17. Paul suggests that the heavenly garment provided by God restores innocence lost at the Fall—a link to the hope of redemption."
    },
    {
      "pk": 2105004,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 4,
      "text": "For while we are in this tent, we groan, burdened—not that we wish to be unclothed, but to be clothed, so that what is mortal may be swallowed up by life.",
      "links": "<a href='/AIV/46/15/54'>1 Corinthians 15:54</a>",
      "comment": "Paul distinguishes between mere escape from the body and the greater hope of resurrection. The 'swallowing up' of mortality by life directly echoes 1 Corinthians 15:54 and the biblical promise of immortality overcoming mortality."
    },
    {
      "pk": 2105005,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 5,
      "text": "Now the one who has prepared us for this very thing is God, who has given us the Spirit as a guarantee.",
      "links": "<a href='/AIV/49/1/13-14'>Ephesians 1:13-14</a>; <a href='/AIV/47/1/22'>2 Corinthians 1:22</a>",
      "comment": "God's gift of the Holy Spirit as a 'guarantee' or 'down payment' confirms our future inheritance. Ephesians 1:13-14 and 2 Corinthians 1:22 reinforce this teaching, showing the Spirit's role in sanctification—an ongoing process in Christian life pointing to ultimate salvation."
    },
    {
      "pk": 2105006,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 6,
      "text": "So we are always confident, and know that while we are at home in the body we are away from the Lord.",
      "links": "<a href='/AIV/58/13/14'>Hebrews 13:14</a>",
      "comment": "Paul contrasts our present bodily existence with the full communion with Christ promised after death. This separation is temporal, pointing to the goal of every Christian—the hope of union with Christ."
    },
    {
      "pk": 2105007,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 7,
      "text": "For we walk by faith, not by sight.",
      "links": "<a href='/AIV/58/11/1'>Hebrews 11:1</a>",
      "comment": "A key principle of Christian living: relying on faith in God's promises over visible circumstances. Hebrews 11:1 expands this idea—faith apprehends realities not yet seen."
    },
    {
      "pk": 2105008,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 8,
      "text": "We are confident, and would rather be away from the body and at home with the Lord.",
      "links": "<a href='/AIV/50/1/23'>Philippians 1:23</a>",
      "comment": "Paul affirms preference for being with Christ after death, echoing Philippians 1:23. This underlines the Christian teaching of the soul’s conscious existence with the Lord after departing this life."
    },
    {
      "pk": 2105009,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 9,
      "text": "So whether we are at home or away, we make it our aim to please him.",
      "links": "<a href='/AIV/51/1/10'>Colossians 1:10</a>",
      "comment": "Paul emphasizes life’s purpose: to please God both in this life and after. Colossians 1:10 reinforces that pleasing God is tied to our walk and growth in holiness—a lifelong pursuit for believers."
    },
    {
      "pk": 2105010,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 10,
      "text": "For we must all appear before the judgment seat of Christ, so that each one may receive what is due for what he has done in the body, whether good or evil.",
      "links": "<a href='/AIV/40/16/27'>Matthew 16:27</a>; <a href='/AIV/45/14/10'>Romans 14:10</a>; <a href='/AIV/66/22/12'>Revelation 22:12</a>",
      "comment": "Paul teaches the universal judgment where our works as believers are evaluated. Matthew 16:27, Romans 14:10, and Revelation 22:12 confirm this doctrine. The focus on works suggests the importance of living out faith (see James 2:17), pointing to a holistic understanding of salvation that encompasses both faith and good works."
    },
    {
      "pk": 2105011,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 11,
      "text": "Therefore, knowing the fear of the Lord, we persuade others. But what we are is clear to God, and I hope it is clear to your conscience as well.",
      "links": "<a href='/AIV/20/1/7'>Proverbs 1:7</a>; <a href='/AIV/47/4/2'>2 Corinthians 4:2</a>",
      "comment": "Paul’s ministry is motivated by reverence for God and transparency. The link to Proverbs 1:7 establishes the beginning of wisdom as the fear of the Lord. The open conscience and integrity points to authentic ministry, a mark of apostolic succession and faithful witness."
    },
    {
      "pk": 2105012,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 12,
      "text": "We are not commending ourselves to you again, but giving you reason to boast about us, so you may be able to answer those who boast in outward appearance and not in the heart.",
      "links": "<a href='/AIV/09/16/7'>1 Samuel 16:7</a>",
      "comment": "Paul contrasts external achievements with internal sincerity. 1 Samuel 16:7 affirms God looks at the heart, not appearance—a principle guiding the selection and authenticity of true shepherds among God's people."
    },
    {
      "pk": 2105013,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 13,
      "text": "For if we are out of our mind, it is for God; if we are in our right mind, it is for you.",
      "links": "<a href='/AIV/44/26/24'>Acts 26:24</a>",
      "comment": "Paul references accusations of madness encountered during his ministry—see Acts 26:24—explaining that true zeal for God's work may seem irrational to outsiders, but is rooted in love and service."
    },
    {
      "pk": 2105014,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 14,
      "text": "For the love of Christ compels us, because we have concluded this: that one has died for all, therefore all have died.",
      "links": "<a href='/AIV/45/5/15'>Romans 5:15</a>; <a href='/AIV/43/11/50'>John 11:50</a>",
      "comment": "Paul affirms the universality of Christ's atoning sacrifice, echoing Romans 5:15 and John 11:50. This underpins the doctrine that Christ’s love energizes apostolic ministry, and the one sacrifice brings new life to all—a central tenet of Christian belief."
    },
    {
      "pk": 2105015,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 15,
      "text": "And he died for all, so that those who live might no longer live for themselves, but for him who died and was raised for them.",
      "links": "<a href='/AIV/45/14/7-9'>Romans 14:7-9</a>; <a href='/AIV/46/6/20'>1 Corinthians 6:20</a>",
      "comment": "The passage highlights the transformative nature of Christ's death and resurrection. Believers are called to live for Christ, not themselves, a theme developed in Romans 14:7-9 and 1 Corinthians 6:20. This self-giving echoes the total consecration found in early Christian discipleship."
    },
    {
      "pk": 2105016,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 16,
      "text": "From now on, therefore, we regard no one according to the flesh. Even though we once regarded Christ according to the flesh, we do so no longer.",
      "links": "<a href='/AIV/43/20/28'>John 20:28</a>",
      "comment": "Paul’s perspective is fundamentally spiritual, not worldly. The reference to Christ shows a shift from a merely human assessment to recognizing his divinity—see John 20:28, 'My Lord and my God.' This reinforces a high christology and the spiritual transformation that comes through faith."
    },
    {
      "pk": 2105017,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 17,
      "text": "Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.",
      "links": "<a href='/AIV/23/43/19'>Isaiah 43:19</a>; <a href='/AIV/48/6/15'>Galatians 6:15</a>",
      "comment": "Paul announces the radical renewal in Christ, fulfilling the prophecy of Isaiah 43:19 and restated in Galatians 6:15. 'New creation' implies a real, ontological change, rooted in sacramental union with Christ, not merely an external change of behavior."
    },
    {
      "pk": 2105018,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 18,
      "text": "All this is from God, who reconciled us to himself through Christ, and has given us the ministry of reconciliation:",
      "links": "<a href='/AIV/45/5/10-11'>Romans 5:10-11</a>",
      "comment": "God initiates reconciliation with humanity through Christ, making believers ministers of this reconciliation (Romans 5:10-11). This passage points towards the role of the Church and its apostles in mediating God's grace and forgiveness to the world."
    },
    {
      "pk": 2105019,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 19,
      "text": "That is, in Christ God was reconciling the world to himself, not counting people’s trespasses against them, and entrusting to us the message of reconciliation.",
      "links": "<a href='/AIV/42/7/47'>Luke 7:47</a>; <a href='/AIV/47/13/10'>2 Corinthians 13:10</a>",
      "comment": "Paul clarifies that reconciliation is the central work of Christ, with the apostles entrusted as messengers. See Luke 7:47 for Christ’s authority to forgive sins, demonstrating the divine power at work in the ministry of reconciliation. The exercise of forgiveness through human instruments hints at the ongoing presence of Christ’s authority in the community."
    },
    {
      "pk": 2105020,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 20,
      "text": "Therefore, we are ambassadors for Christ, God making his appeal through us. We entreat you on behalf of Christ: be reconciled to God.",
      "links": "<a href='/AIV/51/3/17'>Colossians 3:17</a>",
      "comment": "The apostolic mission is described as representing Christ himself, with divine authority to call people to reconciliation. Colossians 3:17 affirms doing all things under Christ’s name—a responsibility held by those set apart and ordained for ministry. Such authority and mediation are pivotal to understanding how Christ continues his work through appointed ambassadors."
    },
    {
      "pk": 2105021,
      "translation": "AIV",
      "book": 47,
      "chapter": 5,
      "verse": 21,
      "text": "For our sake, he made him who knew no sin to be sin, so that in him we might become the righteousness of God.",
      "links": "<a href='/AIV/23/53/6'>Isaiah 53:6</a>; <a href='/AIV/60/2/24'>1 Peter 2:24</a>",
      "comment": "Paul proclaims the profound mystery of substitutionary atonement, as foretold in Isaiah 53:6 and clarified by 1 Peter 2:24. Through Christ, believers participate in God’s righteousness—not merely declared righteous, but actually transformed, reflecting both justification and ongoing sanctification."
    }
  ],
  "translatedAt": "2025-12-23T03:47:26.819Z"
}