{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 4,
  "verses": [
    {
      "pk": 2404001,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 1,
      "text": "Therefore, having this ministry by the mercy of God, we do not lose heart.",
      "links": "<a href='/AIV/47/3/6'>2 Cor. 3:6</a>; <a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "Paul reminds us that his ministry is a gift of God's mercy, not earned, which emphasizes the necessity of divine grace in any spiritual service. The steadfastness here hints at perseverance amidst difficulty, echoed throughout scripture."
    },
    {
      "pk": 2404002,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 2,
      "text": "But we have renounced shameful, hidden things— not walking in cunning nor corrupting the word of God, but by the open statement of the truth we commend ourselves to everyone's conscience before God.",
      "links": "<a href='/AIV/47/2/17'>2 Cor. 2:17</a>; <a href='/AIV/47/6/7'>2 Cor. 6:7</a>; <a href='/AIV/49/4/25'>Eph. 4:25</a>",
      "comment": "Paul contrasts authentic ministry with deception and dishonesty. This underscores the value of transparency and truth in teaching God's word—significant for church leadership and the responsibility to present the gospel without manipulation."
    },
    {
      "pk": 2404003,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 3,
      "text": "And even if our gospel is veiled, it is veiled to those who are perishing.",
      "links": "<a href='/AIV/47/3/14'>2 Cor. 3:14</a>; <a href='/AIV/47/2/15'>2 Cor. 2:15'>2 Cor. 2:15</a>; <a href='/AIV/40/13/15'>Matt. 13:15</a>",
      "comment": "This relates directly to spiritual blindness, distinguishing between those open to God's revelation and those hardened in unbelief. Paul delicately affirms the reality that faith itself is a gift, not just intellectual assent."
    },
    {
      "pk": 2404004,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 4,
      "text": "In their case, the god of this world has blinded the minds of the unbelievers, so that they would not see the light of the gospel of the glory of Christ, who is the image of God.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/51/1/15'>Col. 1:15</a>; <a href='/AIV/40/4/8-9'>Matt. 4:8–9</a>",
      "comment": "The reference to Christ as the image of God powerfully emphasizes His divinity (see Col. 1:15). The spiritual battle is evident—human nature alone cannot overcome this blindness; divine grace is required for true enlightenment."
    },
    {
      "pk": 2404005,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 5,
      "text": "For we do not preach ourselves, but Jesus Christ as Lord, and ourselves as your servants for Jesus’ sake.",
      "links": "<a href='/AIV/46/1/23'>1 Cor. 1:23</a>; <a href='/AIV/42/6/46'>Luke 6:46</a>",
      "comment": "Paul denies self-promotion and instead lifts up Christ as Lord, affirming the necessity of humility and service. The title 'Lord' used for Jesus here testifies to His divinity and supreme authority."
    },
    {
      "pk": 2404006,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 6,
      "text": "For God, who said, 'Let light shine out of darkness,' has shone in our hearts to give the light of the knowledge of God's glory in the face of Jesus Christ.",
      "links": "<a href='/AIV/1/1/3'>Gen. 1:3</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "Echoing Genesis, Paul links physical creation to spiritual renewal. The glory seen in Jesus’ face indicates the divine presence fully revealed in Christ—the deepest knowledge of God is found through Him."
    },
    {
      "pk": 2404007,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 7,
      "text": "But we have this treasure in clay jars, so that the surpassing power may be from God and not from us.",
      "links": "<a href='/AIV/47/5/1'>2 Cor. 5:1</a>; <a href='/AIV/23/64/8'>Isa. 64:8</a>",
      "comment": "Clay jars symbolize human fragility and mortality—suggesting a paradox: divine power displayed through weak vessels. This accentuates both the humility required for ministry and the miraculous work of God’s grace, which preserves and sanctifies imperfect instruments."
    },
    {
      "pk": 2404008,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 8,
      "text": "We are afflicted in every way, but not crushed; perplexed, but not driven to despair;",
      "links": "<a href='/AIV/47/7/5'>2 Cor. 7:5</a>; <a href='/AIV/53/1/6'>1 Thess. 1:6</a>",
      "comment": "Paul describes the suffering endured for Christ. Endurance through affliction—without despair—highlights faith's transformative, persevering power, and connects with Christ's own suffering."
    },
    {
      "pk": 2404009,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 9,
      "text": "persecuted, but not abandoned; struck down, but not destroyed;",
      "links": "<a href='/AIV/47/11/23-27'>2 Cor. 11:23–27</a>; <a href='/AIV/19/37/24'>Ps. 37:24</a>",
      "comment": "More than survival, the promise is of divine presence in every trial. The assurance here is spiritual—God never abandons His people, especially in service to the gospel."
    },
    {
      "pk": 2404010,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 10,
      "text": "always carrying everywhere the death of Jesus in our bodies, so that the life of Jesus may also be revealed in our bodies.",
      "links": "<a href='/AIV/47/1/5'>2 Cor. 1:5</a>; <a href='/AIV/45/6/4-5'>Rom. 6:4–5</a>",
      "comment": "This verse reveals a profound mystery: union with Christ's sufferings is part of Christian life. Bearing His death leads to manifesting His life—a theme central to Christian spirituality."
    },
    {
      "pk": 2404011,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 11,
      "text": "For we, who live, are always being delivered unto death for Jesus’ sake, so that the life of Jesus may be shown in our mortal flesh.",
      "links": "<a href='/AIV/47/1/9'>2 Cor. 1:9</a>; <a href='/AIV/50/3/10'>Phil. 3:10</a>",
      "comment": "Paul’s suffering is purposeful: continual dying to self enables the divine life to be evident. This sacrificial aspect points toward the mystery of sanctification and Christian witness."
    },
    {
      "pk": 2404012,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 12,
      "text": "So then, death is at work in us, but life in you.",
      "links": "<a href='/AIV/47/13/4'>2 Cor. 13:4</a>",
      "comment": "Paul serves through self-sacrificing love—the pattern of Christ—where apostolic suffering serves to bring spiritual life to others, showing the connection between leadership and sacrificial service."
    },
    {
      "pk": 2404013,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 13,
      "text": "Since we have the same spirit of faith, according to what is written, 'I believed, and so I spoke,' we also believe, and so we speak;",
      "links": "<a href='/AIV/19/116/10'>Ps. 116:10</a>",
      "comment": "Paul draws from Psalm 116, connecting Old Testament faith to present proclamation. Speaking out of belief is expected of witnesses to Christ, grounding faith in the continuity of scripture."
    },
    {
      "pk": 2404014,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 14,
      "text": "knowing that He who raised the Lord Jesus will raise us also with Jesus and will bring us together with you into His presence.",
      "links": "<a href='/AIV/45/8/11'>Rom. 8:11</a>; <a href='/AIV/46/15/20'>1 Cor. 15:20</a>",
      "comment": "Assurance of bodily resurrection is given, rooted in Christ's own resurrection. The phrasing here supports a future communal gathering into God's presence, implying togetherness and the ongoing life of the church into eternity."
    },
    {
      "pk": 2404015,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 15,
      "text": "For all things are for your sake, so that grace, having spread to more people, may increase thanksgiving to the glory of God.",
      "links": "<a href='/AIV/47/1/6'>2 Cor. 1:6</a>; <a href='/AIV/47/9/11'>2 Cor. 9:11</a>",
      "comment": "Paul's mission works for the blessing of others. The increase of grace and thanksgiving hints at an ever-expanding impact of divine work—through the church and sacraments."
    },
    {
      "pk": 2404016,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 16,
      "text": "Therefore we do not lose heart. Though our outer self is wasting away, our inner self is being renewed day by day.",
      "links": "<a href='/AIV/51/3/10'>Col. 3:10</a>; <a href='/AIV/50/1/6'>Phil. 1:6</a>",
      "comment": "Spiritual renewal is continual, even as physical decline occurs. This illuminates the reality of ongoing sanctification through grace, drawing a clear distinction between temporal suffering and eternal progress in holiness."
    },
    {
      "pk": 2404017,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 17,
      "text": "For this light and momentary trouble is preparing for us an eternal weight of glory beyond all comparison.",
      "links": "<a href='/AIV/45/8/18'>Rom. 8:18</a>; <a href='/AIV/60/5/10'>1 Pet. 5:10</a>",
      "comment": "Paul teaches that present suffering achieves a greater, eternal result, highlighting the connection between earthly trials and future glory. This supports traditional spiritual interpretations of suffering as redemptive."
    },
    {
      "pk": 2404018,
      "translation": "AIV",
      "book": 47,
      "chapter": 4,
      "verse": 18,
      "text": "as we look not at what is seen, but at what is unseen. For what is seen is temporary, but what is unseen is eternal.",
      "links": "<a href='/AIV/58/11/1'>Heb. 11:1</a>; <a href='/AIV/47/5/7'>2 Cor. 5:7</a>",
      "comment": "The final verse asserts the primacy of eternal realities over visible ones. Faith focuses our hearts on the unseen, pointing toward a sacramental worldview and depth of spiritual life oriented toward eternal truth."
    }
  ],
  "translatedAt": "2025-12-23T03:47:04.728Z"
}