{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 2,
  "verses": [
    {
      "pk": 400201,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 1,
      "text": "For I decided that I would not come to you again in sorrow.",
      "links": "<a href='/AIV/47/1/23'>2 Cor. 1:23</a>",
      "comment": "Paul chooses not to visit the church if it would cause them grief. He prioritizes their spiritual well-being over his own desires. This demonstrates pastoral sensitivity and the importance of church unity."
    },
    {
      "pk": 400202,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 2,
      "text": "For if I make you grieve, who is left to make me glad except the one I have grieved?",
      "links": "<a href='/AIV/47/7/9'>2 Cor. 7:9</a>; <a href='/AIV/47/1/14'>2 Cor. 1:14</a>",
      "comment": "Paul’s relationship with the believers is deeply interconnected with their emotional and spiritual states, highlighting the importance of reconciliation in the Body of Christ."
    },
    {
      "pk": 400203,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 3,
      "text": "I wrote to you as I did, so that when I came I would not have sorrow from those who ought to make me rejoice, knowing that my joy depends on each one of you.",
      "links": "<a href='/AIV/47/7/8-9'>2 Cor. 7:8–9</a>",
      "comment": "Paul refers to a previous letter sent to correct the church. His joy and theirs are mutual, pointing toward the profound unity intended among believers (see John 17:21)."
    },
    {
      "pk": 400204,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 4,
      "text": "For I wrote to you out of much affliction and anguish of heart, with many tears, not to make you grieve, but to make clear the depth of my love for you.",
      "links": "<a href='/AIV/47/7/8-12'>2 Cor. 7:8–12</a>",
      "comment": "Paul’s motivations for discipline are rooted in love, not harshness. Genuine correction is always ultimately for restoration and deepening of communal bonds."
    },
    {
      "pk": 400205,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 5,
      "text": "But if anyone has caused grief, he has not grieved me alone, but in some measure—to not put it too severely—all of you.",
      "links": "<a href='/AIV/47/7/12'>2 Cor. 7:12</a>; <a href='/AIV/46/5/1-5'>1 Cor. 5:1–5</a>",
      "comment": "Sin affects the whole community. The church’s intertwining is echoed in 1 Cor. 12:26, emphasizing corporal spiritual responsibility."
    },
    {
      "pk": 400206,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 6,
      "text": "For such a person, this punishment by the majority is sufficient.",
      "links": "<a href='/AIV/46/5/3-5'>1 Cor. 5:3–5</a>",
      "comment": "Disciplinary action was taken by the congregation, showing the role of formal correction and restoration. This points to early practices of reconciliation and visible church authority."
    },
    {
      "pk": 400207,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 7,
      "text": "So now you should rather forgive and comfort him, so that he may not be overwhelmed by excessive sorrow.",
      "links": "<a href='/AIV/47/7/8-9'>2 Cor. 7:8–9</a>; <a href='/AIV/40/18/21-22'>Matt. 18:21–22</a>",
      "comment": "The call to forgiveness shows mercy following proper discipline. Compare Jesus’ teaching on forgiveness—restoration always follows true repentance."
    },
    {
      "pk": 400208,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 8,
      "text": "Therefore I urge you to reaffirm your love for him.",
      "links": "<a href='/AIV/47/7/15'>2 Cor. 7:15</a>",
      "comment": "Restoration and love are central to church discipline. The church acts almost sacramentally in restoring the penitent to fellowship, reminiscent of Christ’s commission to forgive."
    },
    {
      "pk": 400209,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 9,
      "text": "For this is why I wrote, so that I might test you and know whether you are obedient in everything.",
      "links": "<a href='/AIV/46/5/1-5'>1 Cor. 5:1–5</a>; <a href='/AIV/47/7/15'>2 Cor. 7:15</a>",
      "comment": "Paul tests the church’s obedience, showing the apostolic authority over doctrine and community life. Faithfulness includes submission to spiritual authority."
    },
    {
      "pk": 400210,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 10,
      "text": "Anyone whom you forgive, I also forgive. Indeed, what I have forgiven—if I have forgiven anything—I have done so for your sake in the presence of Christ.",
      "links": "<a href='/AIV/47/5/20'>2 Cor. 5:20</a>; <a href='/AIV/20/28/13'>Prov. 28:13</a>",
      "comment": "Forgiveness by the church is ratified by the apostle, showing the complementarity of local and apostolic authority. This hints toward the sacramental understanding of reconciliation."
    },
    {
      "pk": 400211,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 11,
      "text": "So that we would not be taken advantage of by Satan, for we are not ignorant of his schemes.",
      "links": "<a href='/AIV/49/6/11'>Eph. 6:11</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "Unforgiveness gives Satan a foothold. Spiritual warfare is tied to unity and proper discipline in the church."
    },
    {
      "pk": 400212,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 12,
      "text": "When I came to Troas to preach the gospel of Christ, and a door was opened for me in the Lord,",
      "links": "<a href='/AIV/16/2/12'>Acts 16:7–8</a>; <a href='/AIV/46/16/9'>1 Cor. 16:9</a>",
      "comment": "‘Open door’ is a common biblical idiom for opportunity provided by God. Paul’s mission is guided by divine providence."
    },
    {
      "pk": 400213,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 13,
      "text": "I had no rest in my spirit, because I did not find Titus my brother there. So I took leave of them and went on to Macedonia.",
      "links": "<a href='/AIV/47/7/6'>2 Cor. 7:6</a>; <a href='/AIV/16/20/1'>Acts 20:1</a>",
      "comment": "Paul’s concern for Titus reflects apostolic fellowship. The movement between cities demonstrates early Christian missionary flexibility."
    },
    {
      "pk": 400214,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 14,
      "text": "But thanks be to God, who always leads us in triumphal procession in Christ, and manifests through us the aroma of the knowledge of him in every place.",
      "links": "<a href='/AIV/51/2/15'>Col. 2:15</a>; <a href='/AIV/49/5/2'>Eph. 5:2</a>",
      "comment": "Victory in Christ is likened to a Roman triumph. The ‘aroma’ recalls Old Testament sacrifices (Lev. 1:9), foreshadowing how the Church spiritually continues Christ’s offering."
    },
    {
      "pk": 400215,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 15,
      "text": "For we are the fragrance of Christ to God among those who are being saved and among those who are perishing:",
      "links": "<a href='/AIV/49/5/2'>Eph. 5:2</a>; <a href='/AIV/62/2/2'>1 John 2:2</a>",
      "comment": "The Church mediates Christ’s presence as a pleasing offering, resonating with the notion of spiritual sacrifices (Rom. 12:1, 1 Pet. 2:5)."
    },
    {
      "pk": 400216,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 16,
      "text": "To one, a scent from death leading to death; but to another, a scent from life leading to life. And who is sufficient for these things?",
      "links": "<a href='/AIV/46/1/18'>1 Cor. 1:18</a>; <a href='/AIV/47/3/5'>2 Cor. 3:5</a>",
      "comment": "The message of Christ divides—accepted, it gives life; rejected, it hardens. Human insufficiency for this ministry points to the divine empowerment required for true witness."
    },
    {
      "pk": 400217,
      "translation": "AIV",
      "book": 47,
      "chapter": 2,
      "verse": 17,
      "text": "For we are not like so many, peddling the word of God for profit; but as men of sincerity, as sent from God, we speak before God in Christ.",
      "links": "<a href='/AIV/52/2/3-5'>1 Thess. 2:3–5</a>; <a href='/AIV/47/4/2'>2 Cor. 4:2</a>",
      "comment": "Ministry must be sincere and uncommercialized, indicative of the spiritual authority which flows from authentic apostolic succession. Integrity is key to genuine proclamation of the faith."
    }
  ],
  "translatedAt": "2025-12-23T03:46:20.617Z"
}