{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 11,
  "verses": [
    {
      "pk": 2111011,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 1,
      "text": "I wish you would bear with me in a little foolishness. But indeed, please do bear with me.",
      "links": "<a href='/AIV/47/12/11'>2 Cor. 12:11</a>",
      "comment": "Paul asks for patience as he makes his defense, using irony to address criticism about boasting. This sets the tone for his apologetic approach."
    },
    {
      "pk": 2111012,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 2,
      "text": "For I am jealous for you with godly jealousy, for I betrothed you to one husband, to present you as a pure virgin to Christ.",
      "links": "<a href='/AIV/49/5/27'>Eph. 5:27</a>; <a href='/AIV/28/2/19-20'>Hos. 2:19-20</a>",
      "comment": "Paul compares his care for the church to that of a spiritual marriage, highlighting the intimacy of the relationship between Christ and the Church. The imagery has deep roots in OT prophecy (see Hosea) and supports the doctrine of the Church as the bride of Christ."
    },
    {
      "pk": 2111013,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 3,
      "text": "But I am afraid that, just as the serpent deceived Eve by his cunning, your minds may be led astray from the simplicity and purity that are in Christ.",
      "links": "<a href='/AIV/1/3/1-6'>Gen. 3:1-6</a>; <a href='/AIV/55/4/4'>2 Tim. 4:4</a>",
      "comment": "References to Genesis 3 highlight the reality of spiritual deception and the need to remain steadfast to the faith handed down by the apostles."
    },
    {
      "pk": 2111014,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 4,
      "text": "For if someone comes and proclaims another Jesus than the one we preached, or if you receive a different spirit, or a different gospel than what you accepted, you easily put up with it.",
      "links": "<a href='/AIV/48/1/6-7'>Gal. 1:6-7</a>",
      "comment": "Paul warns against false teachings, emphasizing the importance of doctrinal consistency and apostolic tradition."
    },
    {
      "pk": 2111015,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 5,
      "text": "For I consider myself in no way inferior to those so-called 'super-apostles.'",
      "links": "<a href='/AIV/47/12/11'>2 Cor. 12:11</a>",
      "comment": "'Super-apostles' is Paul's term for false teachers who boasted of superior authority. He defends the legitimacy and continuity of his apostolic office."
    },
    {
      "pk": 2111016,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 6,
      "text": "But even if I am unskilled in speech, I am not so in knowledge; indeed, in every way we have made this clear to you in all things.",
      "links": "<a href='/AIV/47/10/10'>2 Cor. 10:10</a>",
      "comment": "Paul's humility regarding his preaching style points to the primacy of apostolic teaching and knowledge over personal charisma."
    },
    {
      "pk": 2111017,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 7,
      "text": "Or did I sin by humbling myself so that you might be exalted, because I preached the gospel of God to you free of charge?",
      "links": "<a href='/AIV/47/12/13'>2 Cor. 12:13</a>; <a href='/AIV/46/9/18'>1 Cor. 9:18</a>",
      "comment": "Paul refused payment for his ministry, a practice sometimes misunderstood by the Corinthians. This reinforces the concept of self-sacrificial, servant leadership."
    },
    {
      "pk": 2111018,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 8,
      "text": "I robbed other churches, taking support from them to serve you.",
      "links": "<a href='/AIV/50/4/15'>Phil. 4:15</a>",
      "comment": "Paul uses irony to show his willingness to accept aid from some communities to bring the gospel to others, foreshadowing practices in later church missions."
    },
    {
      "pk": 2111019,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 9,
      "text": "And when I was with you and lacked, I was not a burden to anyone, for the brothers who came from Macedonia supplied my needs; so I kept myself from being a burden to you, and will continue to do so.",
      "links": "<a href='/AIV/50/4/10'>Phil. 4:10</a>",
      "comment": "Assistance from other believers highlights the interconnectedness and spiritual solidarity within the church body."
    },
    {
      "pk": 2111020,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 10,
      "text": "As the truth of Christ is in me, no one in the regions of Achaia will stop me from boasting about this.",
      "links": "<a href='/AIV/47/1/1'>2 Cor. 1:1</a>",
      "comment": "Paul’s confidence stems from his union with Christ, enabling him to speak boldly. Achaia refers to the region including Corinth, affirming his specific address."
    },
    {
      "pk": 2111021,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 11,
      "text": "Why? Because I do not love you? God knows I do!",
      "links": "<a href='/AIV/47/6/11'>2 Cor. 6:11</a>",
      "comment": "Paul appeals to God as witness to his genuine pastoral love for the Corinthians."
    },
    {
      "pk": 2111022,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 12,
      "text": "But what I do, I will continue to do, so that I can cut off the opportunity from those who desire it, so that in what they boast, they may be found just as we are.",
      "links": "<a href='/AIV/47/12/13'>2 Cor. 12:13</a>",
      "comment": "Paul intends to undermine false teachers by equating his own actions with theirs, demonstrating his commitment to truth."
    },
    {
      "pk": 2111023,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 13,
      "text": "For such people are false apostles, deceitful workers, disguising themselves as apostles of Christ.",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/48/2/4'>Gal. 2:4</a>",
      "comment": "Paul directly refers to false teachers as impostors, linking back to Jesus' warnings against false prophets. The Church stands vigilant to guard apostolic teaching."
    },
    {
      "pk": 2111024,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 14,
      "text": "And no wonder, for even Satan disguises himself as an angel of light.",
      "links": "<a href='/AIV/1/3/1-6'>Gen. 3:1-6</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "Paul emphasizes spiritual discernment, highlighting how deception can be subtle and attractive, echoing the warning from Genesis and Revelation."
    },
    {
      "pk": 2111025,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 15,
      "text": "So it is no surprise if his servants disguise themselves as servants of righteousness. Their end will be according to their works.",
      "links": "<a href='/AIV/40/13/30'>Matt. 13:30</a>",
      "comment": "Judgment according to deeds aligns with biblical teachings of righteousness and ultimate justice."
    },
    {
      "pk": 2111026,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 16,
      "text": "I repeat, let no one think me foolish. But even if you do, receive me as you would a fool, so that I too may boast a little.",
      "links": "<a href='/AIV/47/11/1'>2 Cor. 11:1</a>",
      "comment": "Paul's rhetorical approach exposes the folly in human boasting, inviting the audience to look deeper at his true motivation."
    },
    {
      "pk": 2111027,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 17,
      "text": "What I am saying with this boastful confidence, I say not as the Lord would, but as in foolishness, in this self-assuredness.",
      "links": "<a href='/AIV/47/10/8'>2 Cor. 10:8</a>",
      "comment": "Paul distinguishes between divine and human standards of boasting, underlining humility as a virtue."
    },
    {
      "pk": 2111028,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 18,
      "text": "Since many boast according to the flesh, I too will boast.",
      "links": "<a href='/AIV/47/12/1'>2 Cor. 12:1</a>",
      "comment": "Paul meets false boasting with holy irony but later points to true boasting being found in Christ alone."
    },
    {
      "pk": 2111029,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 19,
      "text": "For you gladly bear with fools, since you are so wise!",
      "links": "<a href='/AIV/47/11/1'>2 Cor. 11:1</a>",
      "comment": "Paul challenges the Corinthians' self-perceived wisdom, drawing attention to the difference between worldly and spiritual wisdom."
    },
    {
      "pk": 2111030,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 20,
      "text": "For you endure it if someone enslaves you, or devours you, or takes advantage of you, or puts on airs, or strikes you in the face.",
      "links": "<a href='/AIV/48/4/9'>Gal. 4:9</a>",
      "comment": "The abuses listed show how easily communities can be led astray without discernment and faithful leadership."
    },
    {
      "pk": 2111031,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 21,
      "text": "To my shame, I must say that we were too weak for that! But whatever anyone else dares to boast of—I'll speak in foolishness—I dare to boast of that, too.",
      "links": "<a href='/AIV/47/12/5'>2 Cor. 12:5</a>",
      "comment": "Paul contrasts his own humility with the arrogant behavior of the false apostles, demonstrating the spiritual strength found in humility."
    },
    {
      "pk": 2111032,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 22,
      "text": "Are they Hebrews? So am I. Are they Israelites? So am I. Are they descendants of Abraham? So am I.",
      "links": "<a href='/AIV/50/3/5'>Phil. 3:5</a>; <a href='/AIV/45/11/1'>Rom. 11:1</a>",
      "comment": "Paul underlines his shared heritage, establishing authority not only as apostle but as one deeply rooted in the history of God’s people."
    },
    {
      "pk": 2111033,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 23,
      "text": "Are they servants of Christ?—I speak as if insane—I am more so: with far greater labors, far more imprisonments, beaten many times, often near death.",
      "links": "<a href='/AIV/47/6/4-5'>2 Cor. 6:4-5</a>; <a href='/AIV/44/16/23'>Acts 16:23</a>",
      "comment": "The apostolic ministry is marked by suffering and endurance, signs of true apostleship, and not worldly power."
    },
    {
      "pk": 2111034,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 24,
      "text": "Five times I received from the Jews forty lashes minus one.",
      "links": "<a href='/AIV/5/25/3'>Deut. 25:3</a>",
      "comment": "Referencing Deut. 25:3, this shows Paul's literal fulfillment of suffering for the gospel."
    },
    {
      "pk": 2111035,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 25,
      "text": "Three times I was beaten with rods. Once I was stoned. Three times I was shipwrecked; a night and a day I was adrift at sea.",
      "links": "<a href='/AIV/44/14/19'>Acts 14:19</a>; <a href='/AIV/44/16/22'>Acts 16:22</a>",
      "comment": "Paul’s account serves as testimony to persistence and faith, reminiscent of Old Testament prophets facing suffering yet persevering in divine mission."
    },
    {
      "pk": 2111036,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 26,
      "text": "I have been in frequent journeys, in dangers from rivers, dangers from robbers, dangers from my own people, dangers from gentiles, dangers in city, dangers in wilderness, dangers at sea, dangers among false brothers.",
      "links": "<a href='/AIV/47/4/8-9'>2 Cor. 4:8-9</a>",
      "comment": "The repetition of ‘dangers’ shows continual threats, yet Paul remains steadfast through divine strength, paralleling OT accounts of suffering."
    },
    {
      "pk": 2111037,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 27,
      "text": "In toil and hardship, often without sleep, in hunger and thirst, often without food, in cold and without clothing.",
      "links": "<a href='/AIV/47/6/5'>2 Cor. 6:5</a>",
      "comment": "The apostolic calling involves physical deprivation, pointing to the mystery of suffering for Christ as spiritual purification."
    },
    {
      "pk": 2111038,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 28,
      "text": "And, apart from other things, there is the daily pressure on me of concern for all the churches.",
      "links": "<a href='/AIV/47/2/4'>2 Cor. 2:4</a>; <a href='/AIV/51/2/1'>Col. 2:1</a>",
      "comment": "Paul's pastoral burden for all Christian communities underscores the role of unity and spiritual oversight, a key to stable doctrine and practice."
    },
    {
      "pk": 2111039,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 29,
      "text": "Who is weak, and I am not weak? Who is made to fall, and I do not burn with concern?",
      "links": "<a href='/AIV/46/8/13'>1 Cor. 8:13</a>",
      "comment": "Empathy and shared suffering are marks of true apostolic leadership, representing Christ’s own compassion for His flock."
    },
    {
      "pk": 2111040,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 30,
      "text": "If I must boast, I will boast of the things that show my weakness.",
      "links": "<a href='/AIV/47/12/9'>2 Cor. 12:9</a>",
      "comment": "Paul's theology of weakness echoes the paradox of Christ's power in suffering, teaching humility and reliance on divine grace."
    },
    {
      "pk": 2111041,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 31,
      "text": "The God and Father of the Lord Jesus, who is blessed forever, knows that I am not lying.",
      "links": "<a href='/AIV/45/9/5'>Rom. 9:5</a>; <a href='/AIV/54/6/16'>1 Tim. 6:16</a>",
      "comment": "The affirmation of the Father and the Lord Jesus points to a high Christology and unity within the Godhead."
    },
    {
      "pk": 2111042,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 32,
      "text": "In Damascus, the governor under King Aretas was guarding the city of Damascus to seize me,",
      "links": "<a href='/AIV/44/9/24'>Acts 9:24</a>",
      "comment": "Historical note on Paul's persecution after conversion, reinforcing the reality of trials faced in the apostolic mission."
    },
    {
      "pk": 2111043,
      "translation": "AIV",
      "book": 47,
      "chapter": 11,
      "verse": 33,
      "text": "but I was let down in a basket through a window in the wall and escaped from his hands.",
      "links": "<a href='/AIV/44/9/25'>Acts 9:25</a>",
      "comment": "Paul's escape in Damascus mirrors the physical and spiritual deliverance God provides to those engaged in His work."
    }
  ],
  "translatedAt": "2025-12-23T03:49:43.593Z"
}