{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 3,
  "verses": [
    {
      "pk": 2203101,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 1,
      "text": "Are we beginning to commend ourselves again? Or do we need, as some do, letters of recommendation to you, or from you?",
      "links": "<a href='/AIV/47/5/12'>2 Cor. 5:12</a>; <a href='/AIV/1/16/3'>1 Cor. 16:3</a>",
      "comment": "Here Paul is emphasizing that his authority and ministry are not based on human approval or letters of recommendation, but on spiritual truth. Cross-reference with 2 Cor. 5:12, where he again discusses commendation."
    },
    {
      "pk": 2203102,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 2,
      "text": "You yourselves are our letter, written on our hearts, known and read by everyone.",
      "links": "<a href='/AIV/47/1/24'>2 Cor. 1:24</a>; <a href='/AIV/46/9/2'>1 Cor. 9:2</a>",
      "comment": "Paul's spiritual relationship with the Corinthians serves as his proof of authentic ministry. Their faith is the result of God's work through him. The image of a letter written on the heart has Old Testament roots (Jer. 31:33)."
    },
    {
      "pk": 2203103,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 3,
      "text": "It is clear that you are a letter from Christ, delivered by us, not written with ink but with the Spirit of the living God, not on tablets of stone but on tablets of human hearts.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/2/24/12'>Ex. 24:12</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "This verse draws a clear contrast between the old covenant (tablets of stone, Exodus 24:12) and the new (hearts, Jeremiah 31:33). The mention of the Spirit as the writer emphasizes the inward transformation brought by Christ through the Spirit, pointing toward the sacramental realities of the new covenant."
    },
    {
      "pk": 2203104,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 4,
      "text": "Such confidence we have through Christ before God.",
      "links": "<a href='/AIV/49/3/12'>Eph. 3:12</a>; <a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "Paul’s confidence is not self-derived, but relies entirely upon Christ. This also highlights the priestly and mediating role of Christ on our behalf (Hebrews 4:16)."
    },
    {
      "pk": 2203105,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 5,
      "text": "Not that we are sufficient in ourselves to claim anything as coming from us, but our sufficiency is from God.",
      "links": "<a href='/AIV/47/4/7'>2 Cor. 4:7</a>; <a href='/AIV/50/4/13'>Phil. 4:13</a>",
      "comment": "Paul makes clear that true ministry depends on God's grace, not human power. This dependence is a hallmark of true Christian ministry."
    },
    {
      "pk": 2203106,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 6,
      "text": "He has made us qualified as ministers of a new covenant, not of the letter but of the Spirit. For the letter kills, but the Spirit gives life.",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31–34</a>; <a href='/AIV/48/3/21'>Gal. 3:21</a>; <a href='/AIV/45/7/6'>Rom. 7:6</a>",
      "comment": "The new covenant is a reality with both spiritual and institutional dimensions. Paul contrasts the mere written law with the life-giving Spirit, referencing Jeremiah 31:31–34. Understanding ‘the letter’ as the Mosaic Law’s outward demands, and ‘the Spirit’ as inner transformation, draws on both literal and spiritual readings of the text."
    },
    {
      "pk": 2203107,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 7,
      "text": "Now if the ministry of death, carved in letters on stone, came with glory, so that the people of Israel could not gaze at Moses' face because of its glory, which was fading,",
      "links": "<a href='/AIV/2/34/29-30'>Ex. 34:29–30</a>; <a href='/AIV/45/7/10'>Rom. 7:10</a>",
      "comment": "Paul describes the old covenant (the Law) as glorious but transient and unable to bring lasting life, recalling Exodus 34:29–30. He is not dismissing the Law, but showing its fulfillment in the new reality."
    },
    {
      "pk": 2203108,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 8,
      "text": "how much more will the ministry of the Spirit have even more glory?",
      "links": "<a href='/AIV/47/3/11'>2 Cor. 3:11</a>; <a href='/AIV/45/8/2'>Rom. 8:2</a>",
      "comment": "Paul argues that the new covenant ministry, empowered by the Spirit, is even more glorious than that of Moses. This hints at a new, enduring form of worship and grace."
    },
    {
      "pk": 2203109,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 9,
      "text": "For if there was glory in the ministry of condemnation, the ministry of righteousness must far exceed it in glory.",
      "links": "<a href='/AIV/47/3/7'>2 Cor. 3:7</a>; <a href='/AIV/45/3/21-22'>Rom. 3:21–22</a>",
      "comment": "The old covenant revealed sin and led to condemnation, but the new covenant makes people righteous through Christ (Romans 3:21–22). This points out both the greater glory and the transformative power of new covenant sacraments and means of grace."
    },
    {
      "pk": 2203110,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 10,
      "text": "Indeed, what once had glory now has no glory at all because of the glory that surpasses it.",
      "links": "<a href='/AIV/50/3/8'>Phil. 3:8</a>",
      "comment": "Paul uses strong comparative language to show how much greater the new covenant is. The 'surpassing glory' relates to the enduring nature of grace given through Christ."
    },
    {
      "pk": 2203111,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 11,
      "text": "For if what was fading away came with glory, how much more will what remains be glorious?",
      "links": "<a href='/AIV/58/8/6'>Heb. 8:6</a>",
      "comment": "Paul refers to the permanence of the new covenant in contrast to the fading nature of the Sinai covenant. Hebrews 8:6 is a direct cross-reference, highlighting the establishment of a superior ministry."
    },
    {
      "pk": 2203112,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 12,
      "text": "Since we have such a hope, we are very bold,",
      "links": "<a href='/AIV/47/7/4'>2 Cor. 7:4</a>",
      "comment": "Paul explains that the hope from the new covenant empowers him and all Christians to speak and act with confidence and boldness."
    },
    {
      "pk": 2203113,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 13,
      "text": "not like Moses, who would put a veil over his face so that the people of Israel might not see the end of what was fading away.",
      "links": "<a href='/AIV/2/34/33-35'>Ex. 34:33–35</a>",
      "comment": "Paul recalls Moses' veil (Exodus 34:33–35) as a sign that the old covenant’s glory was temporary and concealed. This foreshadows the openness and clarity of the new covenant."
    },
    {
      "pk": 2203114,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 14,
      "text": "But their minds were hardened. For to this day, the same veil remains when the old covenant is read, because only in Christ is it taken away.",
      "links": "<a href='/AIV/45/11/7-10'>Rom. 11:7–10</a>; <a href='/AIV/40/13/15'>Matt. 13:15</a>",
      "comment": "This speaks of the spiritual blindness that results from clinging to the law apart from Christ. The veil is removed in Christ alone, indicating both the necessity of faith and the ongoing work of interpretation and tradition through the Church."
    },
    {
      "pk": 2203115,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 15,
      "text": "Indeed, to this day, whenever Moses is read, a veil lies over their hearts.",
      "links": "<a href='/AIV/43/5/39'>John 5:39</a>",
      "comment": "Paul laments that without Christ, the deeper meaning of Moses remains hidden. This shows the importance of Christ as the interpretive key to all of Scripture."
    },
    {
      "pk": 2203116,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 16,
      "text": "But when one turns to the Lord, the veil is removed.",
      "links": "<a href='/AIV/2/34/34'>Ex. 34:34</a>; <a href='/AIV/45/10/4'>Rom. 10:4</a>",
      "comment": "Echoing Exodus 34:34, Paul teaches that true understanding comes through turning to the Lord, which implies repentance and incorporation into the full faith of the new covenant."
    },
    {
      "pk": 2203117,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 17,
      "text": "Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom.",
      "links": "<a href='/AIV/43/4/24'>John 4:24</a>; <a href='/AIV/48/5/1'>Gal. 5:1</a>",
      "comment": "Paul connects the Lord (Christ) with the Holy Spirit, teaching the unity of the divine persons. 'Freedom' means the liberation from sin and death as well as the new openness to approach and commune with God."
    },
    {
      "pk": 2203118,
      "translation": "AIV",
      "book": 47,
      "chapter": 3,
      "verse": 18,
      "text": "And we all, with unveiled face, beholding the glory of the Lord, are being transformed into the same image from glory to glory, just as from the Lord, who is the Spirit.",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "Christians, through ongoing transformation by the Spirit, grow more and more into the likeness of Christ. This is not only an individual process but happens through participation in communal worship, sacraments, and the life of the Church. The transformation is both present and points ahead to the final vision of God."
    }
  ],
  "translatedAt": "2025-12-23T03:46:46.586Z"
}