{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 8,
  "verses": [
    {
      "pk": 2024800,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 1,
      "text": "Now, brothers, we want you to know about the grace of God that has been given among the churches of Macedonia.",
      "links": "<a href='/AIV/44/16/9'>Acts 16:9</a>; <a href='/AIV/50/1/29'>Phil. 1:29</a>",
      "comment": "Paul begins by highlighting the Macedonian churches' example of God's grace at work, setting up a model for others to follow. Note how 'grace' here includes not only salvation but the power to live generously (see 1 Cor. 15:10)."
    },
    {
      "pk": 2024801,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 2,
      "text": "For in a severe test of trouble, their abundant joy and their deep poverty overflowed in rich generosity.",
      "links": "<a href='/AIV/50/4/11-13'>Phil. 4:11-13</a>; <a href='/AIV/44/17/1-9'>Acts 17:1-9</a>",
      "comment": "Paul emphasizes that even in hardship, real joy produces sacrificial giving. Their generosity stands as a living witness to supernatural unity and charity."
    },
    {
      "pk": 2024802,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 3,
      "text": "For I testify that they gave according to their ability, and beyond their ability, of their own free will.",
      "links": "<a href='/AIV/47/9/7'>2 Cor. 9:7</a>",
      "comment": "Their giving wasn't forced, emphasizing free, willing cooperation with the Spirit. This models true stewardship—something that hints at the wisdom of giving as an act of worship."
    },
    {
      "pk": 2024803,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 4,
      "text": "Begging us earnestly for the favor of having a share in serving the saints.",
      "links": "<a href='/AIV/45/15/25-27'>Rom. 15:25-27</a>",
      "comment": "The Macedonians urgently sought the privilege to serve, revealing a passionate commitment to the wider body of believers—underscoring the interconnectedness of local and universal church charity."
    },
    {
      "pk": 2024804,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 5,
      "text": "And not as we expected, but they gave themselves first to the Lord and then by the will of God to us.",
      "links": "<a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "First comes self-surrender to the Lord, and then to the apostles' authority. This order points to the ideal pattern of spiritual obedience and service. See how obedience to Christ naturally leads to cooperation with Church leaders."
    },
    {
      "pk": 2024805,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 6,
      "text": "So we urged Titus, that just as he had begun, he would also complete this act of grace among you.",
      "links": "<a href='/AIV/47/12/18'>2 Cor. 12:18</a>",
      "comment": "Paul assigns Titus, a delegate, to help perfect their collection. This stresses apostolic oversight and transmission of authority in the early Church."
    },
    {
      "pk": 2024806,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 7,
      "text": "But as you abound in everything—in faith, in speech, in knowledge, in all diligence, and in your love for us—see that you excel in this grace also.",
      "links": "<a href='/AIV/46/1/5'>1 Cor. 1:5</a>; <a href='/AIV/47/9/8'>2 Cor. 9:8</a>",
      "comment": "Spiritual maturity is holistic, including love, faith, and generosity. Excelling in giving is as vital as spiritual gifts."
    },
    {
      "pk": 2024807,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 8,
      "text": "I say this not as a command, but to test the genuineness of your love by comparison with the earnestness of others.",
      "links": "<a href='/AIV/46/7/6'>1 Cor. 7:6</a>",
      "comment": "Paul encourages voluntary generosity rather than compulsion, but still appeals to the necessity of real love being shown through sacrificial deeds."
    },
    {
      "pk": 2024808,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 9,
      "text": "For you know the grace of our Lord Jesus Christ, that though He was rich, yet for your sake He became poor, so that through His poverty you might become rich.",
      "links": "<a href='/AIV/50/2/6-8'>Phil. 2:6-8</a>; <a href='/AIV/19/40/17'>Ps. 40:17</a>",
      "comment": "Christ's incarnation is the ultimate example: He humbled Himself to lift us. This is both literal (Jesus' earthly poverty) and spiritual (His divinity taking on flesh for salvation)."
    },
    {
      "pk": 2024809,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 10,
      "text": "And in this matter I give my opinion: this benefits you, who were the first not only to do this but also to desire to do it a year ago.",
      "links": "<a href='/AIV/47/9/2'>2 Cor. 9:2</a>",
      "comment": "Paul reminds them of their prior commitment, linking good intent with the call to fulfill promises—a theme throughout both testaments (see Ps. 50:14)."
    },
    {
      "pk": 2024810,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 11,
      "text": "Now finish doing it as well, so that your readiness in desiring it may be matched by your completing it out of what you have.",
      "links": "<a href='/AIV/49/6/6-8'>Gal. 6:6-8</a>",
      "comment": "A heart for good works is not enough—completion matters. Authentic faith involves both word and deed."
    },
    {
      "pk": 2024811,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 12,
      "text": "For if the readiness is there, the gift is acceptable according to what a person has, not according to what he does not have.",
      "links": "<a href='/AIV/41/12/43-44'>Mark 12:43-44</a>",
      "comment": "Paul echoes the teaching of Jesus about the widow's offering—the value of a gift is in the willingness and sacrifice, not the amount."
    },
    {
      "pk": 2024812,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 13,
      "text": "For I do not mean that others should be eased and you burdened, but that there might be fairness.",
      "links": "<a href='/AIV/2/16/18'>Exod. 16:18</a>",
      "comment": "Paul's vision is for equity in the Church, reflecting the principle of shared resources found in God's provision for Israel in the wilderness."
    },
    {
      "pk": 2024813,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 14,
      "text": "At this present time your abundance will supply their need, so that their abundance may supply your need, that there may be equality.",
      "links": "<a href='/AIV/44/2/44-45'>Acts 2:44-45</a>",
      "comment": "Mutual care among believers is foundational, prefiguring the unity and charity practiced in the early Church."
    },
    {
      "pk": 2024814,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 15,
      "text": "As it is written, 'Whoever gathered much had nothing left over, and whoever gathered little had no lack.'",
      "links": "<a href='/AIV/2/16/18'>Exod. 16:18</a>",
      "comment": "Paul alludes to the manna in the wilderness (Exod. 16:18), revealing the longstanding biblical principle of God providing through shared resources."
    },
    {
      "pk": 2024815,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 16,
      "text": "But thanks be to God, who put the same earnest care for you into the heart of Titus.",
      "links": "<a href='/AIV/47/7/15'>2 Cor. 7:15</a>",
      "comment": "God works in hearts, inspiring leaders with authentic care for the flock. Titus models true pastoral devotion."
    },
    {
      "pk": 2024816,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 17,
      "text": "For he not only accepted our request but, being very earnest, he went to you of his own accord.",
      "links": "<a href='/AIV/46/16/10'>1 Cor. 16:10</a>",
      "comment": "Titus's initiative reveals willing service to the apostolic mission—a trait commended throughout the pastoral epistles."
    },
    {
      "pk": 2024817,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 18,
      "text": "With him we are sending the brother who is praised among all the churches for the gospel.",
      "links": "<a href='/AIV/47/12/18'>2 Cor. 12:18</a>",
      "comment": "The unnamed 'brother' (possibly Luke or another co-worker) represents trustworthy witnesses and a team ministry typical in the apostolic era."
    },
    {
      "pk": 2024818,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 19,
      "text": "And not only that, but he has also been appointed by the churches to travel with us as we carry out this act of grace that is being administered by us for the glory of the Lord Himself and to show our readiness.",
      "links": "<a href='/AIV/46/16/3-4'>1 Cor. 16:3-4</a>",
      "comment": "The use of representatives ensures integrity and transparency in ministry support. This points to a visible unity and order."
    },
    {
      "pk": 2024819,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 20,
      "text": "We desire to avoid any criticism concerning how this generous gift is administered.",
      "links": "<a href='/AIV/47/6/3'>2 Cor. 6:3</a>",
      "comment": "Paul takes steps to prevent scandal, reminding leaders of the need for prudence in handling the Church's resources."
    },
    {
      "pk": 2024820,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 21,
      "text": "For we are taking pains to do what is right, not only before the Lord but also before men.",
      "links": "<a href='/AIV/45/12/17'>Rom. 12:17</a>",
      "comment": "Both public and private integrity are essential in ministry. The apostles seek to be blameless, echoing the high calling of Church leaders."
    },
    {
      "pk": 2024821,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 22,
      "text": "And with them we are sending our brother whom we have often found earnest in many matters, but who is now even more earnest because of his great confidence in you.",
      "links": "<a href='/AIV/50/2/20'>Phil. 2:20</a>",
      "comment": "Multiple messengers ensure good stewardship and accountability, sound principles for Church operation."
    },
    {
      "pk": 2024822,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 23,
      "text": "As for Titus, he is my partner and fellow worker for you; as for our brothers, they are messengers of the churches, the glory of Christ.",
      "links": "<a href='/AIV/50/2/25'>Phil. 2:25</a>",
      "comment": "'Messengers' here is 'apostoloi', meaning representatives sent by the Church—establishing the practice of Church authority sending official envoys."
    },
    {
      "pk": 2024823,
      "translation": "AIV",
      "book": 47,
      "chapter": 8,
      "verse": 24,
      "text": "Therefore show them before the churches the proof of your love and of our reason for boasting about you.",
      "links": "<a href='/AIV/47/7/14'>2 Cor. 7:14</a>",
      "comment": "The Corinthians are called to demonstrate their faith in tangible acts of charity. Love in action builds up the Church’s unity and testimony to the world."
    }
  ],
  "translatedAt": "2025-12-23T03:48:36.977Z"
}