{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 6,
  "verses": [
    {
      "pk": 2060301,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 1,
      "text": "Working together with Him, we urge you not to receive the grace of God in vain.",
      "links": "<a href='/AIV/23/49/8'>Isa. 49:8</a>; <a href='/AIV/47/5/20'>2 Cor. 5:20</a>",
      "comment": "Paul continues his appeal as an ambassador for Christ, emphasizing that God's offer of grace requires a response, not passive acceptance (cf. 2 Cor. 5:20). Cooperative work with God underlines the call to a communal and ongoing relationship, not just an individual one."
    },
    {
      "pk": 2060302,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 2,
      "text": "For He says, 'At a favorable time I listened to you, and in a day of salvation I helped you.' Behold, now is the favorable time; behold, now is the day of salvation.",
      "links": "<a href='/AIV/23/49/8'>Isa. 49:8</a>; <a href='/AIV/42/4/21'>Luke 4:21</a>",
      "comment": "Paul quotes Isaiah 49:8, applying it to the present era, showing that the promised time of salvation is fulfilled in Christ. Note the application of prophetic fulfillment and the urgency for ongoing conversion (cf. Luke 4:21)."
    },
    {
      "pk": 2060303,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 3,
      "text": "We give no obstacle in anything, so that our ministry will not be discredited.",
      "links": "<a href='/AIV/46/9/12'>1 Cor. 9:12</a>",
      "comment": "Paul stresses the importance of a blameless ministry, hinting at a model for leadership and apostolic succession, maintaining an unbroken witness and integrity."
    },
    {
      "pk": 2060304,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 4,
      "text": "But in everything we show ourselves as servants of God: in great endurance, in troubles, hardships, and distress,",
      "links": "<a href='/AIV/47/4/8'>2 Cor. 4:8</a>; <a href='/AIV/47/11/23-27'>2 Cor. 11:23–27</a>",
      "comment": "The marks of authentic ministry and service are highlighted, echoing Christ’s own suffering and faithfulness. There is an implicit call to persevere as a body, reflecting the model Christ gave."
    },
    {
      "pk": 2060305,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 5,
      "text": "in beatings, imprisonments, riots, labors, sleepless nights, and hunger;",
      "links": "<a href='/AIV/44/16/22-24'>Acts 16:22–24</a>",
      "comment": "Paul's suffering reflects the suffering-servant motif (see Isa. 53), connecting his apostolic ministry to Christ’s own life, further authenticating his authority and the suffering inherent to true leadership in the Church."
    },
    {
      "pk": 2060306,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 6,
      "text": "by purity, knowledge, patience, kindness, the Holy Spirit, and sincere love;",
      "links": "<a href='/AIV/48/5/22-23'>Gal. 5:22–23</a>",
      "comment": "These virtues are seen as fruits of the Spirit, indicative of true discipleship and the interior transformation that comes from grace. The communal aspect of actively living these virtues is highlighted throughout Scripture."
    },
    {
      "pk": 2060307,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 7,
      "text": "with the word of truth, by the power of God; through the weapons of righteousness for the right hand and the left;",
      "links": "<a href='/AIV/49/6/17'>Eph. 6:17</a>",
      "comment": "Use of ‘weapons’ refers to spiritual realities, echoing Ephesians 6 on the armor of God. Word and sacrament (spiritual means) are seen as central in the fight for holiness."
    },
    {
      "pk": 2060308,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 8,
      "text": "through glory and dishonor, slander and praise; regarded as deceivers, yet true;",
      "links": "<a href='/AIV/40/5/11'>Matt. 5:11</a>; <a href='/AIV/47/1/12'>2 Cor. 1:12</a>",
      "comment": "Disciples are called to endure misunderstandings and persecution, an echo of Jesus' own path—paradoxically honored and rejected. This double experience is characteristic of living the Gospel."
    },
    {
      "pk": 2060309,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 9,
      "text": "as unknown and yet well known, as dying and yet look, we live; as punished and yet not killed;",
      "links": "<a href='/AIV/47/4/10-11'>2 Cor. 4:10–11</a>",
      "comment": "The paradox of Christian identity—apparently insignificant, but truly known to God, mirroring Christ’s own self-emptying and resurrection. There’s a hidden power to the suffering of believers."
    },
    {
      "pk": 2060310,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 10,
      "text": "as sorrowful, yet always rejoicing; as poor, yet making many rich; as having nothing, yet possessing everything.",
      "links": "<a href='/AIV/40/5/3-12'>Matt. 5:3–12</a>; <a href='/AIV/50/4/11-13'>Phil. 4:11–13</a>",
      "comment": "Paul highlights Christian joy amidst suffering, reflecting Christ’s teachings in the Beatitudes. Spiritual riches come from communion in Christ."
    },
    {
      "pk": 2060311,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 11,
      "text": "We have spoken openly to you, Corinthians; our heart is wide open.",
      "links": "<a href='/AIV/47/7/3'>2 Cor. 7:3</a>",
      "comment": "Paul’s affection for the Corinthians models pastoral love and transparency that is to exist among Christian leaders and their flock."
    },
    {
      "pk": 2060312,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 12,
      "text": "You are not limited by us, but you are restrained in your own affections.",
      "links": "<a href='/AIV/48/4/12'>Gal. 4:12</a>",
      "comment": "Paul attributes any relational distance to the Corinthians’ own hearts, not to the leadership, subtly underscoring the need for openness and unity with those who guide the faithful."
    },
    {
      "pk": 2060313,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 13,
      "text": "In exchange—I speak as to children—open wide your hearts also.",
      "links": "<a href='/AIV/47/12/14'>2 Cor. 12:14</a>",
      "comment": "Paul’s fatherly exhortation imparts the importance of spiritual receptivity to both authority and tradition. Being ‘as children’ echoes Christ’s call to humility."
    },
    {
      "pk": 2060314,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 14,
      "text": "Do not be unequally yoked with unbelievers. For what partnership has righteousness with lawlessness? Or what fellowship has light with darkness?",
      "links": "<a href='/AIV/05/22/10'>Deut. 22:10</a>; <a href='/AIV/62/1/6'>1 John 1:6</a>",
      "comment": "The ‘yoke’ refers to deeper communion and shared spiritual life, not just ordinary interactions. The separation theme points to a call for holiness—life distinctly shaped by truth and light."
    },
    {
      "pk": 2060315,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 15,
      "text": "What harmony has Christ with Belial? Or what does a believer share with an unbeliever?",
      "links": "<a href='/AIV/09/2/12'>1 Sam. 2:12</a>; <a href='/AIV/62/2/15-17'>1 John 2:15–17</a>",
      "comment": "Linking Christ and ‘Belial’ (a name associated with evil), Paul sets a clear boundary for spiritual solidarity, highlighting the exclusive devotion expected of those in Christ."
    },
    {
      "pk": 2060316,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 16,
      "text": "And what agreement has the temple of God with idols? For we are the temple of the living God, just as God said: 'I will dwell among them and walk among them; and I will be their God, and they shall be My people.'",
      "links": "<a href='/AIV/03/26/12'>Lev. 26:12</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/46/3/16'>1 Cor. 3:16</a>",
      "comment": "Paul’s application of Old Testament temple imagery to the Church suggests a visible, united community indwelled by God Himself (cf. Lev. 26:12; Ezek. 37:27). The imagery goes beyond individual believers, showing the collective as the Temple."
    },
    {
      "pk": 2060317,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 17,
      "text": "Therefore, 'Come out from them and be separate,' says the Lord. 'Touch no unclean thing, and I will receive you.'",
      "links": "<a href='/AIV/23/52/11'>Isa. 52:11</a>; <a href='/AIV/24/51/45'>Jer. 51:45</a>",
      "comment": "Paul recalls the call to holiness from Isaiah and Jeremiah, which originally called Israel to separation. Now, he applies it to the Church, inviting believers to a distinct, consecrated identity."
    },
    {
      "pk": 2060318,
      "translation": "AIV",
      "book": 47,
      "chapter": 6,
      "verse": 18,
      "text": "'And I will be a father to you, and you shall be my sons and daughters,' says the Lord Almighty.",
      "links": "<a href='/AIV/10/7/14'>2 Sam. 7:14</a>; <a href='/AIV/28/1/10'>Hos. 1:10</a>; <a href='/AIV/43/1/12'>John 1:12</a>",
      "comment": "God’s adoption of believers fulfills the promise of intimate union begun in the old covenant (as in 2 Sam. 7:14 and Hos. 1:10), reaching its ultimate reality in Christ (cf. John 1:12). The familial bond governed by the Lord’s authority calls for communal unity under one spiritual father."
    }
  ],
  "translatedAt": "2025-12-23T03:47:49.391Z"
}