{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 10,
  "verses": [
    {
      "pk": 2201001,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 1,
      "text": "Now I, Paul, appeal to you by the gentleness and kindness of Christ—I, who am humble when face to face with you but bold toward you when away—",
      "links": "<a href='/AIV/56/3/2'>Titus 3:2</a>; <a href='/AIV/40/11/29'>Matt. 11:29</a>",
      "comment": "Paul humbly appeals to the Corinthians, reflecting the meekness of Christ (see Matt. 11:29). The contrast between his physical presence and written boldness highlights his reliance on spiritual authority rather than human strength."
    },
    {
      "pk": 2201002,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 2,
      "text": "I beg you that when I am present I may not have to be bold with the confidence with which I intend to act against those who think we walk according to the flesh.",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>",
      "comment": "Paul expresses hope for reconciliation, but affirms that proper authority may require correction. The reference to 'walking according to the flesh' alludes to divisions within the community."
    },
    {
      "pk": 2201003,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 3,
      "text": "For though we walk in the flesh, we do not make war according to the flesh.",
      "links": "<a href='/AIV/49/6/12'>Eph. 6:12</a>; <a href='/AIV/47/1/12'>2 Cor. 1:12</a>",
      "comment": "'Walk in the flesh' means living as humans, but Paul distinguishes spiritual warfare from mere human conflict (see Eph. 6:12). The church's spiritual battle is not fought with worldly weapons."
    },
    {
      "pk": 2201004,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 4,
      "text": "For the weapons of our warfare are not of the flesh but have divine power to destroy strongholds.",
      "links": "<a href='/AIV/49/6/13'>Eph. 6:13-17</a>",
      "comment": "The real power in Christian ministry comes from God, not human ingenuity. The reference to 'strongholds' suggests spiritual or ideological barriers opposed to the Gospel."
    },
    {
      "pk": 2201005,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 5,
      "text": "We destroy arguments and every proud obstacle raised against the knowledge of God, and take every thought captive to obey Christ.",
      "links": "<a href='/AIV/51/2/8'>Col. 2:8</a>; <a href='/AIV/50/4/7'>Phil. 4:7</a>",
      "comment": "Paul describes the mission of apostolic ministry—overcoming human pride and error with the truth of Christ. This emphasizes obedience, not just intellectual assent, highlighting spiritual formation."
    },
    {
      "pk": 2201006,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 6,
      "text": "And we are ready to punish all disobedience, once your obedience is complete.",
      "links": "<a href='/AIV/47/7/15'>2 Cor. 7:15</a>",
      "comment": "Paul speaks of church discipline as necessary to maintain purity and unity in the community, indicating a pastoral concern for spiritual order."
    },
    {
      "pk": 2201007,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 7,
      "text": "Look at what is before your eyes. If anyone is confident he belongs to Christ, let him remind himself just as he is Christ’s, so also are we.",
      "links": "<a href='/AIV/46/1/12'>1 Cor. 1:12</a>",
      "comment": "Some in Corinth questioned Paul's authority, but he affirms his legitimate apostolic role. True authority comes from being in union with Christ."
    },
    {
      "pk": 2201008,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 8,
      "text": "For even if I boast a little too much about our authority, which the Lord gave for building you up and not for tearing you down, I will not be ashamed.",
      "links": "<a href='/AIV/47/13/10'>2 Cor. 13:10</a>; <a href='/AIV/13/10/15'>Ezra 10:4</a>",
      "comment": "Church leadership exists for edification, not destruction. Paul’s authority is pastoral and constructive."
    },
    {
      "pk": 2201009,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 9,
      "text": "I do not want to seem as if I am frightening you with my letters.",
      "links": "<a href='/AIV/47/13/2'>2 Cor. 13:2</a>",
      "comment": "Paul clarifies his intent is not intimidation, but correction rooted in love and concern for the community."
    },
    {
      "pk": 2201010,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 10,
      "text": "For they say, 'His letters are weighty and strong, but his bodily presence is weak and his speech is of no account.'",
      "links": "<a href='/AIV/47/11/6'>2 Cor. 11:6</a>",
      "comment": "Paul acknowledges criticism of his personal style, showing that spiritual authority can operate independently of worldly charisma."
    },
    {
      "pk": 2201011,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 11,
      "text": "Let such a person consider that what we are in word by letters when absent, we are also in deed when present.",
      "links": "<a href='/AIV/46/4/19'>1 Cor. 4:19</a>",
      "comment": "Paul assures that his actions match his words, revealing the integrity expected of spiritual leaders."
    },
    {
      "pk": 2201012,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 12,
      "text": "We dare not classify or compare ourselves with some who commend themselves. But when they measure themselves by one another and compare themselves with one another, they are without understanding.",
      "links": "<a href='/AIV/47/3/1'>2 Cor. 3:1</a>; <a href='/AIV/47/5/12'>2 Cor. 5:12</a>",
      "comment": "Paul warns against self-commendation and rivalry, emphasizing that one’s calling and authority should come from God, not human approval."
    },
    {
      "pk": 2201013,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 13,
      "text": "But we will not boast beyond limits, but will boast only with regard to the area of influence God assigned to us, to reach even to you.",
      "links": "<a href='/AIV/47/13/10'>2 Cor. 13:10</a>",
      "comment": "Paul recognizes boundaries in ministry, indicating the importance of order and structure in the church’s mission (see 1 Cor. 12)."
    },
    {
      "pk": 2201014,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 14,
      "text": "For we are not overextending ourselves, as though we did not reach you. For we were the first to come all the way to you with the gospel of Christ.",
      "links": "<a href='/AIV/46/3/5'>1 Cor. 3:5-6</a>",
      "comment": "Paul emphasizes apostolic primacy in establishing churches, highlighting the role of the original messengers."
    },
    {
      "pk": 2201015,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 15,
      "text": "We do not boast beyond our limit in the labors of others. But our hope is that as your faith increases, our area of influence among you may be greatly enlarged,",
      "links": "<a href='/AIV/52/1/8'>1 Thess. 1:8</a>",
      "comment": "Paul expects the growth of faith to lead to greater ministry, showing the life of the Church expands organically as faith matures."
    },
    {
      "pk": 2201016,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 16,
      "text": "so that we may preach the gospel in lands beyond you, without boasting of work already done in someone else’s area of influence.",
      "links": "<a href='/AIV/45/15/20'>Rom. 15:20</a>",
      "comment": "Paul’s missionary impulse is to bring the Gospel where Christ is not yet named, in line with the Church's mission to evangelize all nations."
    },
    {
      "pk": 2201017,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 17,
      "text": "'Let the one who boasts, boast in the Lord.'",
      "links": "<a href='/AIV/24/9/24'>Jer. 9:24</a>; <a href='/AIV/46/1/31'>1 Cor. 1:31</a>",
      "comment": "Boasting is only appropriate in what the Lord does, not in human accomplishment. This reframes success and authority as gifts from God. See Jer. 9:24; 1 Cor. 1:31."
    },
    {
      "pk": 2201018,
      "translation": "AIV",
      "book": 47,
      "chapter": 10,
      "verse": 18,
      "text": "For it is not the one who commends himself who is approved, but the one whom the Lord commends.",
      "links": "<a href='/AIV/47/5/9-10'>2 Cor. 5:9-10</a>",
      "comment": "True approval comes from Christ, not self-promotion. This highlights the Church’s call to humility and accountability before the Lord."
    }
  ],
  "translatedAt": "2025-12-23T03:49:14.819Z"
}