{
  "book": "2 Corinthians",
  "bookAbbreviation": "2Cor",
  "chapter": 7,
  "verses": [
    {
      "pk": 2068701,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 1,
      "text": "Since we have these promises, beloved, let us cleanse ourselves from every defilement of flesh and spirit, perfecting holiness in the fear of God.",
      "links": "<a href='/AIV/47/6/16-18'>2 Cor. 6:16–18</a>; <a href='/AIV/19/24/3-4'>Ps. 24:3–4</a>; <a href='/AIV/60/1/15-16'>1 Pet. 1:15–16</a>",
      "comment": "Paul urges believers to pursue holiness, drawing on Old Testament imagery of purity (Ps. 24:3–4). The emphasis on perfection in holiness implies an ongoing process, connecting to traditions emphasizing sanctification through grace and cooperation with God."
    },
    {
      "pk": 2068702,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 2,
      "text": "Make room for us in your hearts. We have wronged no one, we have corrupted no one, we have taken advantage of no one.",
      "links": "<a href='/AIV/47/6/11-13'>2 Cor. 6:11–13</a>",
      "comment": "Paul reaffirms his integrity and apostolic ministry. Opening one's heart reflects unity and communion among believers, suggestive of apostolic authority and the need for reconciled relationships within the Church."
    },
    {
      "pk": 2068703,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 3,
      "text": "I do not say this to condemn you. For I have said before that you are in our hearts, to die together and to live together.",
      "links": "<a href='/AIV/47/6/11'>2 Cor. 6:11</a>; <a href='/AIV/50/1/7'>Phil. 1:7</a>",
      "comment": "Emphasizing deep spiritual fellowship, Paul speaks of a unity that persists through both hardship and blessing, reflecting the ideal of the Church as a spiritual family bound together even unto death."
    },
    {
      "pk": 2068704,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 4,
      "text": "Great is my confidence in you, great is my boasting about you. I am filled with comfort. In all our affliction, I am overflowing with joy.",
      "links": "<a href='/AIV/47/1/4-5'>2 Cor. 1:4–5</a>; <a href='/AIV/47/8/24'>2 Cor. 8:24</a>",
      "comment": "Paul's joy comes amidst suffering, pointing to the paradoxical nature of Christian life: suffering can deepen spiritual joy, as taught by Christ (Mt. 5:10–12). Comfort here hints at spiritual consolation through the Church community."
    },
    {
      "pk": 2068705,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 5,
      "text": "For even when we came into Macedonia, our bodies had no rest. We were afflicted in every way—conflicts on the outside, fears within.",
      "links": "<a href='/AIV/44/16/9-10'>Acts 16:9–10</a>; <a href='/AIV/47/2/13'>2 Cor. 2:13</a>",
      "comment": "Paul describes external and internal trials, reminding believers of the reality of living as disciples. Saints and apostles endured hardship but trusted God's providence in adversity."
    },
    {
      "pk": 2068706,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 6,
      "text": "But God, who comforts the downcast, comforted us by the coming of Titus.",
      "links": "<a href='/AIV/47/1/3-4'>2 Cor. 1:3–4</a>; <a href='/AIV/47/7/13'>2 Cor. 7:13</a>",
      "comment": "Divine consolation comes through God and through other believers, showing the Church as a vessel of comfort, and how God uses His people as instruments of grace."
    },
    {
      "pk": 2068707,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 7,
      "text": "And not only by his coming, but also by the comfort he had received from you. He told us of your longing, your mourning, your zeal for me, so that I rejoiced even more.",
      "links": "<a href='/AIV/47/2/13'>2 Cor. 2:13</a>; <a href='/AIV/47/7/13'>2 Cor. 7:13</a>",
      "comment": "Paul highlights the mutual encouragement within the Church. Spiritual restoration is not just personal but communal, a mark of Christian unity and reconciliation."
    },
    {
      "pk": 2068708,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 8,
      "text": "For even if I made you sorrowful with my letter, I do not regret it—though I did regret it, for I see that the letter produced sorrow, though only for a little while.",
      "links": "<a href='/AIV/47/2/4'>2 Cor. 2:4</a>; <a href='/AIV/47/7/9'>2 Cor. 7:9</a>",
      "comment": "Paul's earlier letter was stern but necessary for correction, showing that Church discipline, when rightly done, brings true repentance and healing."
    },
    {
      "pk": 2068709,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 9,
      "text": "Now I rejoice, not because you were made sorrowful, but because your sorrow led to repentance. For you felt godly sorrow, so that you suffered no loss through us.",
      "links": "<a href='/AIV/47/7/10-11'>2 Cor. 7:10–11</a>; <a href='/AIV/44/2/37-38'>Acts 2:37–38</a>",
      "comment": "Paul distinguishes godly sorrow (that leads to repentance) from worldly regret. Repentance as a transformative grace is a key theme, linking to the sacramental healing and interior conversion found in Church tradition."
    },
    {
      "pk": 2068710,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 10,
      "text": "For godly sorrow produces repentance leading to salvation, without regret, but worldly sorrow brings death.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/40/27/3-5'>Mt. 27:3–5</a>",
      "comment": "Repentance is essential for salvation—a recurring theme from the prophets (Ps. 51). Godly sorrow is distinct from mere regret; true repentance transforms and restores the believer."
    },
    {
      "pk": 2068711,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 11,
      "text": "For see what earnestness this godly sorrow has produced in you, what eagerness to clear yourselves, what indignation, what fear, what longing, what zeal, what punishment! In every way you have proved yourselves to be innocent in the matter.",
      "links": "<a href='/AIV/44/19/18-19'>Acts 19:18–19</a>; <a href='/AIV/47/2/6'>2 Cor. 2:6</a>",
      "comment": "True repentance produces visible fruits—zeal, longing, justice. Church teaching holds that authentic contrition leads not just to interior change but visible acts of reparation."
    },
    {
      "pk": 2068712,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 12,
      "text": "So although I wrote to you, it was not for the sake of the one who did wrong, nor for the one who suffered, but that your earnestness for us might be revealed in the sight of God.",
      "links": "<a href='/AIV/47/2/5-8'>2 Cor. 2:5–8</a>",
      "comment": "Paul's intention was restoration, not merely personal vindication but to show the Church's commitment to holiness and unity before God."
    },
    {
      "pk": 2068713,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 13,
      "text": "Therefore we are comforted. Besides our comfort, we rejoiced even more at the joy of Titus, because his spirit has been refreshed by all of you.",
      "links": "<a href='/AIV/47/7/6'>2 Cor. 7:6</a>; <a href='/AIV/47/7/7'>2 Cor. 7:7</a>",
      "comment": "Communal encouragement and restoration refreshes all involved, underscoring the importance of the Church’s unity and interdependence in spiritual renewal."
    },
    {
      "pk": 2068714,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 14,
      "text": "For if I have boasted to him about you, I was not put to shame. But as everything we said to you was true, so our boasting before Titus has proved true as well.",
      "links": "<a href='/AIV/47/8/24'>2 Cor. 8:24</a>; <a href='/AIV/47/1/18'>2 Cor. 1:18</a>",
      "comment": "Paul’s confidence in the Corinthians is vindicated, suggesting trust in the Church’s visible leadership and teaching authority."
    },
    {
      "pk": 2068715,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 15,
      "text": "And his affection for you is greater, as he remembers the obedience of you all—how you received him with fear and trembling.",
      "links": "<a href='/AIV/50/2/12'>Phil. 2:12</a>; <a href='/AIV/47/2/9'>2 Cor. 2:9</a>",
      "comment": "Obedience is highlighted as a virtue, echoing Old Testament reverence before God and pointing to a spiritual hierarchy and submission that are foundational in Christian tradition."
    },
    {
      "pk": 2068716,
      "translation": "AIV",
      "book": 47,
      "chapter": 7,
      "verse": 16,
      "text": "I rejoice because I have complete confidence in you.",
      "links": "<a href='/AIV/47/7/4'>2 Cor. 7:4</a>; <a href='/AIV/47/1/14'>2 Cor. 1:14</a>",
      "comment": "Paul’s relationship with the Corinthians closes in hope and assurance. The underlying implication is that Church unity, apostolic authority, and loving correction all serve the building up of the Body of Christ. This vision carries deep spiritual significance for how the Church functions both visibly and invisibly—under the guidance of apostolic leadership working for the sanctification of the faithful."
    }
  ],
  "translatedAt": "2025-12-23T03:48:07.047Z"
}