{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 1,
  "verses": [
    {
      "pk": 1000101,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 1,
      "text": "In the third year of the reign of Jehoiakim king of Judah, Nebuchadnezzar king of Babylon came to Jerusalem and besieged it.",
      "links": "<a href='/AIV/12/24/1-2'>2 Kings 24:1–2</a>; <a href='/AIV/25/1/1-2'>Lamentations 1:1–2</a>",
      "comment": "Historical backdrop: The siege marks the beginning of the Babylonian Exile, an event with far-reaching theological importance regarding divine judgment and providence."
    },
    {
      "pk": 1000102,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 2,
      "text": "And the Lord gave Jehoiakim king of Judah into his hand, along with some of the vessels of the house of God. He carried them to the land of Shinar, to the house of his god, and placed the vessels in the treasury of his god.",
      "links": "<a href='/AIV/11/8/10-11'>1 Kings 8:10–11</a>; <a href='/AIV/24/52/17-23'>Jeremiah 52:17–23</a>",
      "comment": "Note how God is sovereign over these events, allowing defeat for a greater purpose. The relocation of sacred vessels reinforces the theme of exile and eventual restoration (see Ezra 1:7)."
    },
    {
      "pk": 1000103,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 3,
      "text": "Then the king ordered Ashpenaz, chief of his officials, to bring certain of the Israelites from the royal family and nobility:",
      "links": "<a href='/AIV/24/39/3-6'>Jeremiah 39:3–6</a>",
      "comment": "The focus shifts to the faithful remnant among Israel, setting the pattern for later stories of perseverance in faith."
    },
    {
      "pk": 1000104,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 4,
      "text": "Young men without blemish, good-looking, showing aptitude for every kind of wisdom, knowledgeable, quick to understand, and able to serve in the king’s palace, whom he instructed to be taught in the literature and language of the Chaldeans.",
      "links": "<a href='/AIV/01/41/39-41'>Genesis 41:39–41</a>",
      "comment": "The selection criteria echo earlier biblical figures like Joseph, reflecting how God elevates those who are faithful and wise."
    },
    {
      "pk": 1000105,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 5,
      "text": "The king assigned them a daily portion of the king’s food and of the wine he drank. They were to be trained for three years, and at the end of that time, they would stand before the king.",
      "links": "<a href='/AIV/27/1/18'>Daniel 1:18</a>",
      "comment": "Three years signifies a period of preparation and testing. This motif recurs in biblical narratives, including the formation of disciples."
    },
    {
      "pk": 1000106,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 6,
      "text": "Among these were Daniel, Hananiah, Mishael, and Azariah, from the tribe of Judah.",
      "links": "<a href='/AIV/26/14/20'>Ezekiel 14:20</a>",
      "comment": "Names are important: Daniel and his companions would exemplify faithfulness. All from Judah, recalling messianic prophecies (Genesis 49:10)."
    },
    {
      "pk": 1000107,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 7,
      "text": "The chief official gave them new names: Daniel he named Belteshazzar, Hananiah he named Shadrach, Mishael he named Meshach, and Azariah he named Abednego.",
      "links": "<a href='/AIV/27/4/8'>Daniel 4:8</a>",
      "comment": "Changing names symbolized assimilation but God preserves their identity, a theme central to faithful perseverance under trial."
    },
    {
      "pk": 1000108,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 8,
      "text": "But Daniel resolved in his heart not to defile himself with the king’s food or the wine he drank. He sought permission from the chief official not to defile himself.",
      "links": "<a href='/AIV/03/11/44'>Leviticus 11:44</a>; <a href='/AIV/27/6/10'>Daniel 6:10</a>",
      "comment": "Daniel models holiness and fidelity; paralleling Old Testament calls to remain set apart, this anticipates later tradition of ascetic practices and fasting."
    },
    {
      "pk": 1000109,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 9,
      "text": "Now God granted Daniel kindness and favor from the chief official.",
      "links": "<a href='/AIV/01/39/21'>Genesis 39:21</a>",
      "comment": "As with Joseph, God is actively working behind the scenes, showing His providence guiding those who seek Him with a pure heart."
    },
    {
      "pk": 1000110,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 10,
      "text": "But the chief official said to Daniel, 'I fear my lord the king, who has assigned your food and drink. If he sees you looking less healthy than the other young men your age, you would endanger my head with the king.'",
      "links": "<a href='/AIV/01/40/2-3'>Genesis 40:2–3</a>",
      "comment": "The challenge is both physical and political, showing how fidelity may risk one’s own safety. Echoes appear again in martyr narratives."
    },
    {
      "pk": 1000111,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 11,
      "text": "Daniel then said to the steward whom the chief official had appointed over Daniel, Hananiah, Mishael, and Azariah:",
      "links": "<a href='/AIV/27/3/12-13'>Daniel 3:12–13</a>",
      "comment": "Daniel’s wisdom and humility set an example of respectful negotiation, combining faith and prudence."
    },
    {
      "pk": 1000112,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 12,
      "text": "'Please test your servants for ten days. Let us be given vegetables to eat and water to drink.'",
      "links": "<a href='/AIV/27/12/11'>Daniel 12:11</a>; <a href='/AIV/27/6/18-22'>Daniel 6:18–22</a>",
      "comment": "A test of ten days symbolizes completeness, and Daniel’s suggestion underscores reliance on God’s provision rather than royal privilege."
    },
    {
      "pk": 1000113,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 13,
      "text": "'Then compare our appearance with that of the young men who eat the king’s food, and deal with your servants according to what you see.'",
      "links": "<a href='/AIV/27/3/27'>Daniel 3:27</a>",
      "comment": "A demonstration of faith: Daniel trusts God to vindicate those who remain pure, prefiguring later stories of miraculous endurance."
    },
    {
      "pk": 1000114,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 14,
      "text": "So he agreed to test them for ten days.",
      "links": "<a href='/AIV/27/1/12'>Daniel 1:12</a>",
      "comment": "The steward's cooperation further reveals God's hidden hand in the affairs of the faithful."
    },
    {
      "pk": 1000115,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 15,
      "text": "At the end of ten days, their appearance was healthier and better nourished than all the young men who ate the king’s food.",
      "links": "<a href='/AIV/27/3/27'>Daniel 3:27</a>",
      "comment": "God’s blessing on their abstinence demonstrates supernatural intervention, confirming that divine law surpasses human custom."
    },
    {
      "pk": 1000116,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 16,
      "text": "So the steward took away their food and the wine they were to drink and gave them vegetables.",
      "links": "<a href='/AIV/27/1/12'>Daniel 1:12</a>",
      "comment": "Fidelity leads to sanctification and transformation, pointing forward to the spiritual discipline within Christian living."
    },
    {
      "pk": 1000117,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 17,
      "text": "As for these four young men, God gave them knowledge and skill in all learning and wisdom; and Daniel had understanding in all visions and dreams.",
      "links": "<a href='/AIV/27/2/19'>Daniel 2:19</a>; <a href='/AIV/01/41/15-16'>Genesis 41:15–16</a>",
      "comment": "Divine grace enables supernatural wisdom and discernment, foreshadowing the charismatic gifts poured out in the early church (see Acts 2:17)."
    },
    {
      "pk": 1000118,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 18,
      "text": "At the end of the time set by the king for the training, the chief official brought them in before Nebuchadnezzar.",
      "links": "<a href='/AIV/27/1/5'>Daniel 1:5</a>",
      "comment": "‘End of the days’ language often points typologically to future eschatological fulfillment."
    },
    {
      "pk": 1000119,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 19,
      "text": "The king spoke with them, and among them all, none was found equal to Daniel, Hananiah, Mishael, and Azariah. So they served before the king.",
      "links": "<a href='/AIV/27/6/3'>Daniel 6:3</a>",
      "comment": "God’s elevation of the faithful is a foretaste of the kingdom reality where humble servants are exalted (Matthew 23:12)."
    },
    {
      "pk": 1000120,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 20,
      "text": "And in every matter of wisdom and understanding about which the king questioned them, he found them ten times better than all the magicians and enchanters in his whole kingdom.",
      "links": "<a href='/AIV/01/41/39-40'>Genesis 41:39–40</a>; <a href='/AIV/27/2/48'>Daniel 2:48</a>",
      "comment": "The superiority of divine wisdom over pagan knowledge further confirms the importance of God-given gifts, anticipating the later veneration of saints and martyrs for their wisdom and miracles."
    },
    {
      "pk": 1000121,
      "translation": "AIV",
      "book": 27,
      "chapter": 1,
      "verse": 21,
      "text": "And Daniel remained there until the first year of King Cyrus.",
      "links": "<a href='/AIV/15/1/1-2'>Ezra 1:1–2</a>; <a href='/AIV/27/6/28'>Daniel 6:28</a>",
      "comment": "Daniel’s longevity reflects God’s enduring faithfulness. Daniel’s span from Nebuchadnezzar to Cyrus connects the restoration theme, which sets the stage for deliverance and the return foretold in the prophets. His steadfastness invites a spiritual reading about perseverance in faith, anticipation of Christ and the promises fulfilled in the church."
    }
  ],
  "translatedAt": "2025-12-23T07:12:29.390Z"
}