{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 11,
  "verses": [
    {
      "pk": 34011001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 1,
      "text": "In the first year of Darius the Mede, I stood to strengthen and support him.",
      "links": "<a href='/AIV/34/10/21'>Dan. 10:21</a>; <a href='/AIV/34/6/1'>Dan. 6:1'</a>",
      "comment": "Daniel continues the prophetic vision, locating these events within historical time. Gabriel is likely the speaker, showing angelic assistance in God's providence."
    },
    {
      "pk": 34011002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 2,
      "text": "Now I will tell you the truth: Three more kings will rise in Persia, then a fourth, much richer than all the others. When he has become strong through his wealth, he will stir up everyone against the kingdom of Greece.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1</a>; <a href='/AIV/15/4/5'>Ezra 4:5</a>",
      "comment": "This verse predicts the rise of Persian kings before Alexander’s conquest. The fourth king is thought to be Xerxes. The prophecy shows God's control over history."
    },
    {
      "pk": 34011003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 3,
      "text": "Then a mighty king will arise, ruling with great dominion and doing as he pleases.",
      "links": "<a href='/AIV/34/8/21'>Dan. 8:21</a>; <a href='/AIV/13/29/12'>1 Chron. 29:12</a>",
      "comment": "A clear reference to Alexander the Great, whose sudden rise and dominion were foretold. God's sovereignty is highlighted, as even world powers act within His design."
    },
    {
      "pk": 34011004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 4,
      "text": "But when he has risen, his kingdom will be broken and divided toward the four winds of heaven, not to his own descendants, and not with the same power he exercised. His kingdom will be torn up and given to others, not belonging to him.",
      "links": "<a href='/AIV/34/8/8'>Dan. 8:8</a>; <a href='/AIV/34/8/22'>Dan. 8:22</a>",
      "comment": "Alexander’s empire was divided after his death among his generals. Spiritual reading sees the four winds as a symbol of universal expansion but lack of true unity outside the divinely established kingdom."
    },
    {
      "pk": 34011005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 5,
      "text": "Then the king of the South will become strong, but one of his princes will become stronger than he and rule with great authority over a large domain.",
      "links": "<a href='/AIV/34/7/6'>Dan. 7:6</a>; <a href='/AIV/12/8/27'>2 Kings 8:27</a>",
      "comment": "Refers to the split of Alexander's empire, with Ptolemy ruling Egypt ('south'). The rivalry among the successors is symbolic of division among earthly kingdoms, contrasting with the unity of God's reign."
    },
    {
      "pk": 34011006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 6,
      "text": "After some years, they will make an alliance, and the daughter of the king of the South will go to the king of the North to make an agreement. But she will not keep her power, nor will he remain, nor his strength. She will be given up, along with her supporters, her child, and those who supported her.",
      "links": "<a href='/AIV/16/6/12'>Neh. 6:12</a>; <a href='/AIV/10/15/10'>2 Sam. 15:10</a>",
      "comment": "This refers to political marriages for alliance, which ultimately fail. Prophecy reveals the limits of human plans and alliances apart from God’s providential design."
    },
    {
      "pk": 34011007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 7,
      "text": "But from her family, one will arise and attack the army of the king of the North, entering his fortress, fighting against them and prevailing.",
      "links": "<a href='/AIV/34/9/26'>Dan. 9:26</a>",
      "comment": "A prophecy about the South regaining strength. The struggle between North and South symbolizes ongoing tension. It points towards the final need for a true and lasting kingdom."
    },
    {
      "pk": 34011008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 8,
      "text": "He will carry away their gods, molten images, and precious articles of silver and gold to Egypt. For some years, he will refrain from attacking the king of the North.",
      "links": "<a href='/AIV/2/12/35'>Ex. 12:35</a>; <a href='/AIV/23/45/20'>Isa. 45:20</a>",
      "comment": "The plundering of idols and treasures highlights the impotence of false gods. Christologically, this points to Christ’s triumph over idols and spiritual captivity."
    },
    {
      "pk": 34011009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 9,
      "text": "Then the king of the North will invade the kingdom of the South but return to his own land.",
      "links": "<a href='/AIV/12/8/29'>2 Kings 8:29</a>",
      "comment": "Despite repeated conflicts, no earthly king prevails for long. God’s sovereign governance is implicit, prefiguring the coming universal kingdom."
    },
    {
      "pk": 34011010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 10,
      "text": "His sons will prepare for war and assemble a larger army, which will continue to advance, overwhelming and passing through. Then they will return and wage war up to his fortress.",
      "links": "<a href='/AIV/34/7/25'>Dan. 7:25</a>",
      "comment": "The cycles of violence and war underscore humanity's need for redemption and the hope of a lasting peace foretold in messianic prophecy."
    },
    {
      "pk": 34011011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 11,
      "text": "Then the king of the South, moved with rage, will go out and fight the king of the North. The northern king’s large army will be handed over to him.",
      "links": "<a href='/AIV/34/8/7'>Dan. 8:7</a>",
      "comment": "Prophecy signals that even the largest armies are subject to God. While literal, this struggle points to spiritual battles and ultimate triumph through divine intervention."
    },
    {
      "pk": 34011012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 12,
      "text": "When the army is taken away, the king of the South will be proud, but even with tens of thousands defeated, he will not remain strong.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/19/33/16-17'>Ps. 33:16-17</a>",
      "comment": "Pride leads to downfall, echoing biblical warnings against relying on human strength. The spiritual message emphasizes humility before God's sovereign plan."
    },
    {
      "pk": 34011013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 13,
      "text": "For the king of the North will rise again with a greater army than before, and after some years he will advance with a vast force and much equipment.",
      "links": "<a href='/AIV/34/7/19'>Dan. 7:19</a>",
      "comment": "Recurring conflicts highlight the transience of earthly power. Scripture anticipates the establishment of an eternal kingdom, fulfilled in the Messiah."
    },
    {
      "pk": 34011014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 14,
      "text": "In those times, many will rise up against the king of the South. Violent men among your own people will rebel in fulfillment of this vision, but they will fail.",
      "links": "<a href='/AIV/34/8/10'>Dan. 8:10</a>; <a href='/AIV/24/5/31'>Jer. 5:31</a>",
      "comment": "The reference to 'your own people' points toward Jewish involvement in these struggles, showing God's word is fulfilled even through human failures."
    },
    {
      "pk": 34011015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 15,
      "text": "Then the king of the North will come, build up siege ramps, and capture a fortified city. The forces of the South will not withstand, nor even their select troops; they will have no strength.",
      "links": "<a href='/AIV/34/8/24'>Dan. 8:24</a>; <a href='/AIV/19/60/12'>Ps. 60:12</a>",
      "comment": "Despite military advantages, true victory is not secured by human might but relies on divine favor, echoing themes found throughout salvation history."
    },
    {
      "pk": 34011016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 16,
      "text": "He who comes against him will do as he pleases, and no one will be able to stand against him. He will stand in the beautiful land, with destruction in his hand.",
      "links": "<a href='/AIV/34/8/9'>Dan. 8:9</a>; <a href='/AIV/34/9/26'>Dan. 9:26</a>",
      "comment": "‘The beautiful land’ refers to Israel. The devastation symbolizes trials and persecution facing God’s people, yet prepares the way for eventual deliverance."
    },
    {
      "pk": 34011017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 17,
      "text": "He will resolve to come with the strength of his whole kingdom, offering an agreement. He will give him a daughter in marriage to destroy the kingdom, but it will not succeed or help him.",
      "links": "<a href='/AIV/18/5/13'>Job 5:13</a>; <a href='/AIV/19/33/10'>Ps. 33:10</a>",
      "comment": "Political intrigue and attempts to manipulate outcomes are ultimately thwarted. God alone directs history's arc toward Christ’s Kingdom."
    },
    {
      "pk": 34011018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 18,
      "text": "Then he will turn his attention to the coastlands and capture many. But a commander will put an end to his arrogance and return his reproach back upon him.",
      "links": "<a href='/AIV/34/7/8'>Dan. 7:8</a>; <a href='/AIV/19/2/5'>Ps. 2:5</a>",
      "comment": "God humiliates the proud and raises the humble—foreshadowing the reversal of fortunes brought by the Messiah."
    },
    {
      "pk": 34011019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 19,
      "text": "Then he will turn toward the fortresses of his own land, but will stumble and fall, and be seen no more.",
      "links": "<a href='/AIV/19/37/36'>Ps. 37:36</a>; <a href='/AIV/20/11/2'>Prov. 11:2</a>",
      "comment": "The fall of earthly potentates prepares readers to hope in a more lasting, spiritual kingdom, not established by human hands."
    },
    {
      "pk": 34011020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 20,
      "text": "One will arise in his place who will send out an oppressor through the glory of the kingdom, but within a few days he will be broken, though not in anger or in battle.",
      "links": "<a href='/AIV/34/8/25'>Dan. 8:25</a>",
      "comment": "Oppressors in God’s plan never last. Their quiet removal contrasts with violent ends, symbolizing an unseen but active divine judgment."
    },
    {
      "pk": 34011021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 21,
      "text": "A despicable person will stand in his place, who has not been given royal majesty. He will come in stealth and seize the kingdom through intrigue.",
      "links": "<a href='/AIV/34/7/8'>Dan. 7:8</a>; <a href='/AIV/2/49/21'>Gen. 49:21</a>",
      "comment": "A foreshadowing of antichrist figures—those who usurp without legitimate authority. This prepares for discussions on true apostolic succession and authority."
    },
    {
      "pk": 34011022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 22,
      "text": "Armies will be swept away before him and broken, even the prince of the covenant.",
      "links": "<a href='/AIV/34/9/27'>Dan. 9:27</a>; <a href='/AIV/28/6/7'>Hos. 6:7</a>",
      "comment": "Some see ‘prince of the covenant’ as the high priest—a sign of spiritual opposition. Typologically, this points forward to Christ, the true High Priest."
    },
    {
      "pk": 34011023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 23,
      "text": "From the moment he makes an alliance with him, he will act deceitfully; he will rise and become strong with a small number of people.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/20/12/20'>Prov. 12:20</a>",
      "comment": "Spiritual reading warns against placing hope in worldly alliances. God’s people must be led by truth, not cunning."
    },
    {
      "pk": 34011024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 24,
      "text": "Without warning, he will invade the richest parts of the province, doing what neither his fathers nor forefathers did—distributing plunder, loot, and wealth among them. He will plan attacks against fortresses, but only for a time.",
      "links": "<a href='/AIV/34/7/25'>Dan. 7:25</a>; <a href='/AIV/2/47/22'>Gen. 47:22</a>",
      "comment": "Short-lived prosperity gained through unjust means is a recurring biblical warning. Only the true King brings lasting blessing."
    },
    {
      "pk": 34011025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 25,
      "text": "He will stir up his power and courage against the king of the South with a large army; and the king of the South will wage war with an even larger and stronger army, but he will not succeed, for plots will be made against him.",
      "links": "<a href='/AIV/34/8/7'>Dan. 8:7</a>",
      "comment": "Even mighty efforts fail due to betrayal—a reminder that God alone is trustworthy, and faithfulness to His promises is vital."
    },
    {
      "pk": 34011026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 26,
      "text": "Those who eat his food will destroy him; his army will be swept away, and many will fall in battle.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/43/13/18'>John 13:18</a>",
      "comment": "The betrayal motif echoes Judas’s betrayal of Christ. God’s ultimate plan is not thwarted by human duplicity."
    },
    {
      "pk": 34011027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 27,
      "text": "Both kings, with evil hearts, will sit at the same table and lie to each other. But it will not prosper, for the end still comes at the appointed time.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/34/8/19'>Dan. 8:19</a>",
      "comment": "Despite surface-level alliances, God determines history’s outcome. The motif of the 'appointed time' mirrors themes later fulfilled in Christ’s coming."
    },
    {
      "pk": 34011028,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 28,
      "text": "Returning to his land with great wealth, his heart will be set against the holy covenant; he will take action and then return to his own land.",
      "links": "<a href='/AIV/34/9/27'>Dan. 9:27</a>; <a href='/AIV/19/74/2'>Ps. 74:2</a>",
      "comment": "Hostility against the covenant highlights perennial conflict between worldly power and divine promises, urging faithfulness to sacred tradition."
    },
    {
      "pk": 34011029,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 29,
      "text": "At the appointed time, he will again invade the South, but the outcome will not be as before.",
      "links": "<a href='/AIV/19/75/2'>Ps. 75:2</a>",
      "comment": "‘Appointed time’ links to divine providence—God’s sovereignty prevails when human power falters. Spiritual interpretation sees this as preparation for the fullness of time in the Messiah."
    },
    {
      "pk": 34011030,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 30,
      "text": "Ships of Kittim will come against him, and he will lose heart, turning back and venting his rage against the holy covenant. He will take action and show favor to those who forsake the holy covenant.",
      "links": "<a href='/AIV/4/24/24'>Num. 24:24</a>; <a href='/AIV/23/44/28'>Isa. 44:28</a>",
      "comment": "Kittim refers to western peoples (Romans/Greeks). Favoring the covenant-breakers prefigures persecution of the faithful—a recurrent theme before messianic vindication."
    },
    {
      "pk": 34011031,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 31,
      "text": "Forces sent by him will profane the temple fortress, remove the daily sacrifice, and set up the abomination that causes desolation.",
      "links": "<a href='/AIV/34/9/27'>Dan. 9:27</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "This prophecy is central for understanding spiritual warfare. Christ alludes to this in Matthew 24:15, pointing to the future restoration fulfilled in His sacrifice."
    },
    {
      "pk": 34011032,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 32,
      "text": "By smooth words, he will corrupt those who forsake the covenant, but the people who know their God will stand firm and take action.",
      "links": "<a href='/AIV/19/119/1'>Ps. 119:1</a>; <a href='/AIV/19/37/28'>Ps. 37:28</a>",
      "comment": "Faithfulness and steadfastness mark the remnant who truly trust God—a call to perseverance and fidelity to apostolic teaching."
    },
    {
      "pk": 34011033,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 33,
      "text": "Those wise among the people will instruct many, yet for some time they will fall by sword, flame, captivity, and plunder.",
      "links": "<a href='/AIV/19/78/2'>Ps. 78:2</a>; <a href='/AIV/40/10/22'>Matt. 10:22</a>",
      "comment": "Suffering for truth is anticipated and echoes Christ’s warning to His disciples. The wise transmit true doctrine amid persecution."
    },
    {
      "pk": 34011034,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 34,
      "text": "When they fall, they will receive some help, but many who join them will do so insincerely.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>",
      "comment": "True faithfulness is tested in times of trial. The reference to insincere followers hints at the importance of authentic conversion and sacramental perseverance."
    },
    {
      "pk": 34011035,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 35,
      "text": "Some of the wise will stumble, so they may be refined, purified, and made spotless until the time of the end, for it will still come at the appointed time.",
      "links": "<a href='/AIV/19/66/10'>Ps. 66:10</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>",
      "comment": "Suffering is a purifying gift. This language of refining hints at sacramental transformation and endurance until the final revelation."
    },
    {
      "pk": 34011036,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 36,
      "text": "Then the king will do as he pleases, exalting and magnifying himself above every god, and speaking astonishing things against the God of gods. He will prosper until the wrath is finished, for what is determined will be done.",
      "links": "<a href='/AIV/53/2/4'>2 Thess. 2:4</a>; <a href='/AIV/19/115/3'>Ps. 115:3</a>",
      "comment": "The self-exaltation prefigures antichrist figures. God's justice is assured—the ultimate defeat of evil is certain at the time appointed by God."
    },
    {
      "pk": 34011037,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 37,
      "text": "He will show no regard for the gods of his fathers, nor the desire of women, nor any god, but will exalt himself above all.",
      "links": "<a href='/AIV/19/10/3'>Ps. 10:3</a>; <a href='/AIV/53/2/4'>2 Thess. 2:4</a>",
      "comment": "This spiritual pride is interpreted as lawlessness, similar to the 'man of sin' described in 2 Thessalonians 2:4—urging vigilance and adherence to apostolic tradition."
    },
    {
      "pk": 34011038,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 38,
      "text": "Instead, he will honor the god of fortresses, a god unknown to his fathers, with gold, silver, precious stones, and expensive gifts.",
      "links": "<a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Idolatry in new forms arises where trust in God is lost. The invocation of gold and treasures is reminiscent of false worship, which the true faith eternally opposes."
    },
    {
      "pk": 34011039,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 39,
      "text": "He will defend a foreign god by those he acknowledges; he will honor and advance them with authority and divide the land for a price.",
      "links": "<a href='/AIV/19/82/6'>Ps. 82:6</a>",
      "comment": "Earthly authority can be misused to oppose God’s order. The division of land recalls warnings against injustice found throughout the Law and Prophets."
    },
    {
      "pk": 34011040,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 40,
      "text": "At the time of the end, the king of the South will attack him, but the king of the North will rush upon him with chariots, horsemen, and many ships. He will invade countries and sweep through like a flood.",
      "links": "<a href='/AIV/34/9/26'>Dan. 9:26</a>; <a href='/AIV/19/93/3'>Ps. 93:3</a>",
      "comment": "The concluding wars anticipate apocalyptic conflict, which finds its ultimate fulfillment and resolution in Christ’s victory."
    },
    {
      "pk": 34011041,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 41,
      "text": "He will invade the beautiful land, and many will fall, but these will escape from his hand: Edom, Moab, and the leaders of Ammon.",
      "links": "<a href='/AIV/23/11/14'>Isa. 11:14</a>",
      "comment": "Even in judgment, some are preserved. Edom, Moab, and Ammon escaping may symbolize mercy and the mysterious boundaries of divine election."
    },
    {
      "pk": 34011042,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 42,
      "text": "He will stretch out his hand against countries, and even Egypt will not escape.",
      "links": "<a href='/AIV/2/12/12'>Ex. 12:12</a>; <a href='/AIV/23/19/4'>Isa. 19:4</a>",
      "comment": "Universal reach of power shows the magnitude of the coming crisis—setting the stage for God to intervene with true salvation."
    },
    {
      "pk": 34011043,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 43,
      "text": "He will have control over the treasures of gold and silver, and over all the riches of Egypt, with Libyans and Cushites following at his heels.",
      "links": "<a href='/AIV/2/12/35'>Ex. 12:35</a>; <a href='/AIV/19/68/31'>Ps. 68:31</a>",
      "comment": "Material conquest cannot deliver peace; only spiritual fulfillment in the promised Kingdom brings lasting joy."
    },
    {
      "pk": 34011044,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 44,
      "text": "But reports from the east and north will trouble him, and he will go out with great fury to destroy and completely annihilate many.",
      "links": "<a href='/AIV/19/46/6'>Ps. 46:6</a>",
      "comment": "Evil’s last efforts ultimately collapse. Spiritual reading anticipates Christ’s triumph over all forces of destruction."
    },
    {
      "pk": 34011045,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 11,
      "verse": 45,
      "text": "He will pitch his royal tents between the seas and the holy mountain. Yet he will come to his end, and no one will help him.",
      "links": "<a href='/AIV/19/2/6'>Ps. 2:6</a>; <a href='/AIV/34/12/1'>Dan. 12:1</a>; <a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The final defeat of worldly powers is depicted. The ‘holy mountain’ recalls Zion, a sign of God’s eternal Kingdom and the promise of true worship, fulfilled in Christ and His sacramental presence among the faithful."
    }
  ],
  "translatedAt": "2025-12-24T09:34:14.249Z"
}