{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 6,
  "verses": [
    {
      "pk": 260601,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 1,
      "text": "It pleased Darius to set over the kingdom one hundred and twenty satraps, to rule over the whole kingdom;",
      "links": "<a href='/AIV/17/1/1'>Esther 1:1</a>",
      "comment": "Darius establishes a structured government after the fall of Babylon. Similar administrative structures appear elsewhere in Near Eastern history."
    },
    {
      "pk": 260602,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 2,
      "text": "And over them three high officials, of whom Daniel was one, so that these satraps would give account to them, so that the king might not suffer loss.",
      "links": "<a href='/AIV/27/2/48'>Dan. 2:48</a>",
      "comment": "Daniel's promotion is a result of his God-given wisdom. God elevates his people to positions of influence for His purposes."
    },
    {
      "pk": 260603,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 3,
      "text": "Then this Daniel distinguished himself above the other high officials and satraps, because an extraordinary spirit was in him; and the king planned to set him over the whole kingdom.",
      "links": "<a href='/AIV/27/5/12'>Dan. 5:12</a>",
      "comment": "An 'extraordinary spirit' echoes Daniel's spiritual gifts. Leadership grounded in God's Spirit remains an enduring theme. (See <a href='/AIV/27/1/17'>Dan. 1:17</a>.)"
    },
    {
      "pk": 260604,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 4,
      "text": "Then the high officials and the satraps sought to find a charge against Daniel with regard to the kingdom; but they could find no ground for complaint or corruption, for he was faithful, and no error or fault was found in him.",
      "links": "<a href='/AIV/27/3/8'>Dan. 3:8</a>; <a href='/AIV/27/5/6'>Dan. 5:6</a>",
      "comment": "Daniel is blameless before men, foreshadowing Christ’s own innocence before His accusers (cf. <a href='/AIV/42/23/4'>Luke 23:4</a>)."
    },
    {
      "pk": 260605,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 5,
      "text": "Then these men said, 'We will not find any grounds for complaint against this Daniel unless we find it in connection with the law of his God.'",
      "links": "<a href='/AIV/44/6/13'>Acts 6:13</a>",
      "comment": "Daniel’s fidelity to God's law provokes opposition, paralleling accusations against the saints in the New Testament."
    },
    {
      "pk": 260606,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 6,
      "text": "Then these high officials and satraps came together to the king and said to him, 'King Darius, live forever!'",
      "links": "<a href='/AIV/27/2/4'>Dan. 2:4</a>",
      "comment": "The formula ‘live forever’ is a typical greeting for Near Eastern monarchs, showing respect and allegiance."
    },
    {
      "pk": 260607,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 7,
      "text": "All the high officials of the kingdom, the prefects and the satraps, the counselors and the governors, have agreed that the king should establish a statute and enforce an injunction that whoever prays to any god or man for thirty days, except to you, O king, shall be cast into the den of lions.",
      "links": "<a href='/AIV/27/3/6'>Dan. 3:6</a>",
      "comment": "Much like the idol in Daniel 3, opponents create laws targeting faithfulness to God. The den of lions is an ultimate test of loyalty."
    },
    {
      "pk": 260608,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 8,
      "text": "Now, O king, establish the injunction and sign the document, so that it cannot be changed, according to the law of the Medes and Persians, which cannot be revoked.'",
      "links": "<a href='/AIV/17/1/19'>Esther 1:19</a>",
      "comment": "Laws of the Medes and Persians are binding, showing the supremacy of royal authority and the risk of inflexible decrees."
    },
    {
      "pk": 260609,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 9,
      "text": "Therefore King Darius signed the written injunction.",
      "links": "",
      "comment": "The king’s signature seals Daniel’s impending trial. This highlights the dangers of pride and political manipulation."
    },
    {
      "pk": 260610,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 10,
      "text": "Now when Daniel learned that the document had been signed, he went into his house, where he had windows in his upper room open toward Jerusalem; and three times a day he knelt and prayed, giving thanks before his God, just as he had done before.",
      "links": "<a href='/AIV/19/55/17'>Ps. 55:17</a>; <a href='/AIV/11/8/44'>1 Kings 8:44</a>",
      "comment": "Daniel’s prayer life demonstrates steadfast devotion and belief in God's faithfulness. Praying towards Jerusalem observes ancient tradition (<a href='/AIV/11/8/44'>1 Kings 8:44</a>). Set prayer times prefigure later structured Christian prayer customs."
    },
    {
      "pk": 260611,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 11,
      "text": "Then these men came as a group and found Daniel making petition and pleading before his God.",
      "links": "",
      "comment": "Daniel’s accusers act as witnesses, alluding to plots later seen against Christ (<a href='/AIV/40/26/60'>Matt. 26:60</a>)."
    },
    {
      "pk": 260612,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 12,
      "text": "They approached and spoke before the king about the king’s injunction: 'Did you not sign an injunction that anyone who makes petition to any god or man within thirty days, except to you, O king, shall be cast into the den of lions?' The king answered, 'The thing stands fast, according to the law of the Medes and Persians, which cannot be revoked.'",
      "links": "<a href='/AIV/27/6/8'>Dan. 6:8</a>",
      "comment": "The irreversibility of Persian law brings out the moral dilemma of justice versus mercy."
    },
    {
      "pk": 260613,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 13,
      "text": "Then they answered the king, 'Daniel, who is one of the exiles from Judah, does not pay attention to you, O king, or to the injunction you signed, but prays three times a day.'",
      "links": "<a href='/AIV/27/1/6'>Dan. 1:6</a>",
      "comment": "The accusers identify Daniel as an exile, emphasizing his steadfastness and devotion to God over man-made laws."
    },
    {
      "pk": 260614,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 14,
      "text": "Then, as soon as the king heard these words, he was greatly distressed and set his mind on rescuing Daniel, and until sunset he labored to deliver him.",
      "links": "",
      "comment": "Darius’s struggle shows genuine concern for Daniel. Earthly rulers are limited, pointing to the ultimate deliverance God alone provides."
    },
    {
      "pk": 260615,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 15,
      "text": "Then these men came as a group to the king and said to the king, 'Know, O king, that it is a law of the Medes and Persians that no injunction or statute which the king establishes may be changed.'",
      "links": "<a href='/AIV/27/6/8'>Dan. 6:8</a>",
      "comment": "The accusers’ persistence underlines the severity of Daniel’s predicament and the unyielding nature of earthly justice."
    },
    {
      "pk": 260616,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 16,
      "text": "Then the king gave the command, and Daniel was brought and cast into the den of lions. The king said to Daniel, 'Your God, whom you serve continually, he will deliver you.'",
      "links": "<a href='/AIV/27/3/17'>Dan. 3:17</a>",
      "comment": "Darius expresses faith that Daniel’s God can save him, reflecting increasing awareness of God among the nations."
    },
    {
      "pk": 260617,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 17,
      "text": "A stone was brought and laid over the mouth of the den, and the king sealed it with his own signet and the signet of his lords, so that nothing could be changed concerning Daniel.",
      "links": "<a href='/AIV/40/27/66'>Matt. 27:66</a>",
      "comment": "The stone and seal parallel Christ’s burial, suggesting a typology fulfilled in Jesus’ own death and resurrection."
    },
    {
      "pk": 260618,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 18,
      "text": "Then the king went to his palace and spent the night fasting, and no entertainment was brought before him, and his sleep fled from him.",
      "links": "",
      "comment": "Fasting and sleeplessness show Darius’s genuine desire and anxiety. Fasting is a traditional response to deep distress (<a href='/AIV/19/35/13'>Ps. 35:13</a>)."
    },
    {
      "pk": 260619,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 19,
      "text": "At the break of day the king arose and went in haste to the den of lions.",
      "links": "<a href='/AIV/41/16/2'>Mark 16:2</a>",
      "comment": "The morning visit recalls resurrection motifs, where deliverance occurs at dawn. Cf. the women visiting the empty tomb (<a href='/AIV/41/16/2'>Mark 16:2</a>)."
    },
    {
      "pk": 260620,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 20,
      "text": "When he came near to the den where Daniel was, he cried out in a voice of anguish. The king declared to Daniel, 'O Daniel, servant of the living God, has your God, whom you serve continually, been able to deliver you from the lions?'",
      "links": "<a href='/AIV/27/3/26'>Dan. 3:26</a>",
      "comment": "‘Servant of the living God’ signals faith in the uniqueness of Daniel’s God. The king acknowledges God’s power to save."
    },
    {
      "pk": 260621,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 21,
      "text": "Then Daniel said to the king, 'O king, live forever!'",
      "links": "<a href='/AIV/27/6/6'>Dan. 6:6</a>",
      "comment": "Daniel’s greeting is respectful, even after rescue. This models Christian humility before earthly authority (see <a href='/AIV/45/13/1'>Rom. 13:1</a>)."
    },
    {
      "pk": 260622,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 22,
      "text": "'My God sent his angel and shut the lions' mouths, and they have not harmed me, because I was found blameless before him; and also before you, O king, I have done no harm.'",
      "links": "<a href='/AIV/27/3/28'>Dan. 3:28</a>; <a href='/AIV/58/11/33'>Heb. 11:33</a>",
      "comment": "God’s angelic intervention mirrors earlier deliverances, and highlights the role of angelic mediation (cf. <a href='/AIV/27/3/28'>Dan. 3:28</a>). Angels are important in God’s providential care."
    },
    {
      "pk": 260623,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 23,
      "text": "Then the king was exceedingly glad and commanded that Daniel be taken up out of the den. So Daniel was taken up out of the den, and no kind of harm was found on him, because he had trusted in his God.",
      "links": "<a href='/AIV/27/3/27'>Dan. 3:27</a>",
      "comment": "Faithful trust leads to complete deliverance. The language mirrors that of Daniel’s friends in chapter 3, anticipating the rewards for the faithful."
    },
    {
      "pk": 260624,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 24,
      "text": "And the king commanded, and those men who had maliciously accused Daniel were brought and cast into the den of lions—they, their children, and their wives. And the lions overpowered them and broke all their bones in pieces before they reached the bottom of the den.",
      "links": "<a href='/AIV/27/3/22'>Dan. 3:22</a>",
      "comment": "Judgment falls upon the accusers. The corporate punishment is a stark Old Testament reality (see <a href='/AIV/06/7/24'>Josh. 7:24</a>)."
    },
    {
      "pk": 260625,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 25,
      "text": "Then King Darius wrote to all the peoples, nations, and languages that dwell in all the earth: 'Peace be multiplied to you.'",
      "links": "<a href='/AIV/27/4/1'>Dan. 4:1</a>",
      "comment": "Universal proclamation echoes earlier chapters, demonstrating the worldwide scope of God’s kingdom."
    },
    {
      "pk": 260626,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 26,
      "text": "'I make a decree, that in all my royal dominion people are to tremble and fear before the God of Daniel, for he is the living God, enduring forever; his kingdom will not be destroyed, and his dominion will never end.'",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/27/4/3'>Dan. 4:3</a>",
      "comment": "The eternal nature of God's kingdom is prophesied, connecting to Messianic kingship and Jesus’ everlasting reign (cf. <a href='/AIV/42/1/33'>Luke 1:33</a>)."
    },
    {
      "pk": 260627,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 27,
      "text": "'He delivers and rescues; he works signs and wonders in heaven and on earth, he who has delivered Daniel from the power of the lions.'",
      "links": "<a href='/AIV/27/3/29'>Dan. 3:29</a>; <a href='/AIV/10/6/22'>2 Sam. 6:22</a>",
      "comment": "God’s saving works prefigure the greater salvation to come through the Messiah, who will deliver from death."
    },
    {
      "pk": 260628,
      "translation": "AIV",
      "book": 27,
      "chapter": 6,
      "verse": 28,
      "text": "So this Daniel prospered during the reign of Darius and the reign of Cyrus the Persian.",
      "links": "<a href='/AIV/27/1/21'>Dan. 1:21</a>",
      "comment": "The endurance and prosperity of Daniel signal God's grace to the faithful. It hints at God’s continual presence guiding leaders of his people. Tradition sees Daniel as forerunner of those who intercede for the people of God, a theme fulfilled in Christ (cf. <a href='/AIV/58/7/25'>Heb. 7:25</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:16:07.518Z"
}