{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 12,
  "verses": [
    {
      "pk": 34012001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 1,
      "text": "At that time, Michael, the great prince who stands guard over the children of your people, will arise. And there will be a time of distress such as has not happened since the beginning of nations until that time. But at that time, all your people who are found written in the book shall be delivered.",
      "links": "<a href='/AIV/66/12/7'>Rev. 12:7</a>; <a href='/AIV/27/10/21'>Dan. 10:21</a>; <a href='/AIV/42/10/20'>Luke 10:20</a>",
      "comment": "Michael, often interpreted as the archangel, acts as protector and intercessor, anticipating themes of angelic mediation (see Rev. 12:7). The 'book' here foreshadows the Book of Life mentioned throughout Scripture (Rev. 20:12). Notice the link between deliverance and being 'written,' suggesting a covenantal community preserved through distress, a theme visible in Old and New Testaments and resonating with later understandings of spiritual protection through God's appointed guardians."
    },
    {
      "pk": 34012002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 2,
      "text": "Many of those who sleep in the dust of the earth will awake, some to everlasting life, and some to shame and everlasting contempt.",
      "links": "<a href='/AIV/40/25/46'>Matt. 25:46</a>; <a href='/AIV/43/5/28-29'>John 5:28-29</a>; <a href='/AIV/23/26/19'>Isa. 26:19</a>",
      "comment": "This explicit reference to resurrection marks a key point in biblical theology. Daniel reveals a two-fold destiny—everlasting life or everlasting contempt—pointing directly to future judgment and the immortality of the soul. This anticipates New Testament teachings of resurrection and judgment (John 5:28-29), supporting the view that salvation entails both faith and how one lives. The shared spiritual conviction is that God's justice is eternal and personal."
    },
    {
      "pk": 34012003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 3,
      "text": "Those who are wise will shine like the brightness of the sky, and those who lead many to righteousness, like the stars forever and ever.",
      "links": "<a href='/AIV/40/13/43'>Matt. 13:43</a>; <a href='/AIV/19/73/24'>Ps. 73:24</a>",
      "comment": "Portraying the faithful as radiant, Daniel draws a link to the glorification of the righteous. Jesus further references this motif in Matthew 13:43. Those who influence others toward righteousness take an active role in God's saving work, echoing the importance of teaching and spiritual leadership. The imagery of everlasting brilliance reveals the transcendent reward for souls that cooperate in divine truth."
    },
    {
      "pk": 34012004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 4,
      "text": "But you, Daniel, shut up the words and seal the book until the time of the end. Many will roam to and fro, and knowledge will increase.",
      "links": "<a href='/AIV/66/5/1'>Rev. 5:1</a>; <a href='/AIV/27/8/26'>Dan. 8:26</a>",
      "comment": "Daniel is instructed to preserve the prophecy for future generations, implying a gradual unfolding of understanding within the believing community. Sealed books often symbolize mysteries reserved for God’s appointed timing (Rev. 5:1). The idea that knowledge increases hints at continual growth and revelation, encouraging devotion to sacred study and openness to the deepening of faith over time."
    },
    {
      "pk": 34012005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 5,
      "text": "Then I, Daniel, looked, and there stood two others, one on this bank of the river and the other on that bank of the river.",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>; <a href='/AIV/66/22/1'>Rev. 22:1</a>",
      "comment": "Daniel’s vision features two figures by the river, reflecting the common biblical use of rivers as places of encounter with divine mysteries. This introduces themes of witness and revelation, reinforcing that heavenly realities are confirmed by multiple witnesses (see Rev. 22:1). The setting highlights sacred geography as symbolically important for receiving God’s message."
    },
    {
      "pk": 34012006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 6,
      "text": "One said to the man dressed in linen, who was above the waters of the river, 'How long will it be until the end of these wonders?'",
      "links": "<a href='/AIV/27/10/5'>Dan. 10:5</a>; <a href='/AIV/66/6/10'>Rev. 6:10</a>",
      "comment": "The question of 'How long?' appears throughout Scripture as humans seek to understand God’s plan (Rev. 6:10). The man in linen may symbolize a high priestly figure, alluding to intercessory roles and purity. These references underscore the expectation of fulfillment and the mystery of divine timing governing salvation history."
    },
    {
      "pk": 34012007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 7,
      "text": "I heard the man dressed in linen, who was above the waters of the river, as he raised his right hand and his left hand toward heaven and swore by Him who lives forever that it will be for a time, times, and half a time. And when the power of the holy people has been shattered, all these things will be accomplished.",
      "links": "<a href='/AIV/66/10/6'>Rev. 10:6</a>; <a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "'Time, times, and half a time' is an apocalyptic phrase, indicating a divinely appointed period of suffering before restoration. The raised hands invoke the solemnity of heavenly oaths, found in Rev. 10:6. The breaking and renewing of the holy people points to suffering preceding resurrection, a pattern later fulfilled in the Passion and the Church’s experience through history."
    },
    {
      "pk": 34012008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 8,
      "text": "I heard, but I did not understand. Then I said, 'My lord, what shall be the outcome of these things?'",
      "links": "<a href='/AIV/27/8/15'>Dan. 8:15</a>; <a href='/AIV/66/7/13-14'>Rev. 7:13-14</a>",
      "comment": "Daniel’s inability to fully grasp the vision highlights the limitations of human understanding yet encourages humility and continual seeking—traits for genuine discipleship. This echoes similar questions in Revelation, affirming that God’s revelation is gradual and participation in God's mysteries develops over time, not all at once."
    },
    {
      "pk": 34012009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 9,
      "text": "He said, 'Go your way, Daniel, for the words are closed up and sealed until the time of the end.'",
      "links": "<a href='/AIV/27/8/26'>Dan. 8:26</a>; <a href='/AIV/66/22/10'>Rev. 22:10</a>",
      "comment": "Daniel is told to accept the mystery and to trust in God’s timing—a notion foundational for perseverance and faith. Closed and sealed mysteries resonate with biblical themes of awaiting full revelation, which comes through fidelity to God, patient hope, and the community's ongoing journey."
    },
    {
      "pk": 34012010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 10,
      "text": "Many shall be purified, made white, and refined, but the wicked shall act wickedly. None of the wicked will understand, but those who are wise will understand.",
      "links": "<a href='/AIV/66/7/14'>Rev. 7:14</a>; <a href='/AIV/19/51/7'>Ps. 51:7</a>; <a href='/AIV/18/28/28'>Job 28:28</a>",
      "comment": "Purification, whiteness, and refining mirror sacramental images and spiritual formation—showing an ongoing process of sanctification and separation between the faithful and the unfaithful. The wise, open to grace and humility, perceive God’s ways, while the wicked remain blind, illustrating the difference between mere knowledge and spiritual understanding."
    },
    {
      "pk": 34012011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 11,
      "text": "From the time that the regular burnt offering is taken away and the abomination that causes desolation is set up, there will be one thousand two hundred ninety days.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "This verse links the interruption of worship with a period of tribulation, alluding to antichrist figures and events Jesus references in Matthew 24:15. The specific number of days invites careful reflection on prophecy, connecting liturgical worship, continuity of faith, and the mystery of adversities confronting God’s chosen community."
    },
    {
      "pk": 34012012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 12,
      "text": "Blessed is the one who waits and arrives at the one thousand three hundred thirty-five days.",
      "links": "<a href='/AIV/59/5/11'>James 5:11</a>",
      "comment": "Endurance in waiting is blessed, echoing biblical calls for perseverance (James 5:11). The designation of a second, longer period emphasizes divine timing and reward for those who remain faithful, underscoring the spiritual benefit of steadfastness and hope that God honors patient endurance."
    },
    {
      "pk": 34012013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 12,
      "verse": 13,
      "text": "But go your way until the end; you shall rest, and at the end of the days you will rise to receive your allotted inheritance.",
      "links": "<a href='/AIV/42/20/35-36'>Luke 20:35-36</a>; <a href='/AIV/11/2/10'>1 Kgs. 2:10</a>",
      "comment": "Daniel is promised personal resurrection and reward—a teaching that prefigures Christ’s own resurrection and the hope of resurrection for all the faithful (Luke 20:36). Rest is symbolic of death, but the promise of rising at the end reflects confidence in bodily resurrection, final justice, and participation in the fullness of the kingdom, which God prepares for His devoted people."
    }
  ],
  "translatedAt": "2025-12-24T09:34:33.948Z"
}