{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 3,
  "verses": [
    {
      "pk": 3003001,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 1,
      "text": "King Nebuchadnezzar made a golden image, whose height was sixty cubits and its width six cubits. He set it up in the plain of Dura in the province of Babylon.",
      "links": "<a href='/AIV/27/2/31'>Dan. 2:31</a>",
      "comment": "The image Nebuchadnezzar sets up reflects the dream in chapter 2. The location 'Dura' is not precisely known."
    },
    {
      "pk": 3003002,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 2,
      "text": "Then King Nebuchadnezzar sent to assemble the satraps, the prefects, the governors, the counselors, the treasurers, the judges, the magistrates, and all the officials of the provinces to come to the dedication of the image that King Nebuchadnezzar had set up.",
      "links": "",
      "comment": "A detailed listing of officials shows the universal summons and the importance of this state event."
    },
    {
      "pk": 3003003,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 3,
      "text": "So the satraps, the prefects, the governors, the counselors, the treasurers, the judges, the magistrates, and all the officials of the provinces gathered for the dedication of the image that King Nebuchadnezzar had set up. They stood before the image that Nebuchadnezzar had set up.",
      "links": "",
      "comment": "Repetition emphasizes the unity of rulers submitting to Nebuchadnezzar’s authority."
    },
    {
      "pk": 3003004,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 4,
      "text": "And the herald proclaimed loudly, 'You are commanded, O peoples, nations, and languages,",
      "links": "<a href='/AIV/27/6/25'>Dan. 6:25</a>",
      "comment": "The universal call includes all peoples, showing Babylon’s global power."
    },
    {
      "pk": 3003005,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 5,
      "text": "that when you hear the sound of the horn, flute, zither, lyre, harp, and all kinds of musical instruments, you are to fall down and worship the golden image that King Nebuchadnezzar has set up.",
      "links": "",
      "comment": "Music leads into worship, foreshadowing liturgical practices and the symbolism of communal worship."
    },
    {
      "pk": 3003006,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 6,
      "text": "Whoever does not fall down and worship shall immediately be thrown into a blazing furnace.",
      "links": "<a href='/AIV/27/6/7'>Dan. 6:7</a>",
      "comment": "The deadly penalty foreshadows martyrdom for integrity in faith."
    },
    {
      "pk": 3003007,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 7,
      "text": "Therefore, at the time when all the people heard the sound of the horn, flute, zither, lyre, harp, and all kinds of musical instruments, all the peoples, nations, and languages fell down and worshiped the golden image that King Nebuchadnezzar had set up.",
      "links": "",
      "comment": "A collective act under the king’s command, contrasting authentic worship of the true God."
    },
    {
      "pk": 3003008,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 8,
      "text": "Therefore, at that time certain Chaldeans came forward and accused the Jews.",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "Persecution arises for fidelity to God in a hostile culture."
    },
    {
      "pk": 3003009,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 9,
      "text": "They said to King Nebuchadnezzar, 'O king, live forever!",
      "links": "",
      "comment": "Common ancient greeting to acknowledge the king’s authority."
    },
    {
      "pk": 3003010,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 10,
      "text": "You, O king, have made a decree that everyone who hears the sound of the horn, flute, zither, lyre, harp, and all kinds of musical instruments must fall down and worship the golden image,",
      "links": "",
      "comment": "Accusers reinforce the king’s command to strengthen their case."
    },
    {
      "pk": 3003011,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 11,
      "text": "and whoever does not fall down and worship shall be cast into a blazing furnace.",
      "links": "",
      "comment": "Repeated emphasis on the death penalty for religious non-conformity."
    },
    {
      "pk": 3003012,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 12,
      "text": "There are certain Jews whom you have appointed over the affairs of the province of Babylon: Shadrach, Meshach, and Abednego. These men, O king, have not paid attention to you. They do not serve your gods or worship the golden image that you have set up.",
      "links": "<a href='/AIV/27/1/7'>Dan. 1:7</a>",
      "comment": "Their loyalty to God sets them apart, foreshadowing Christian witness against idolatry."
    },
    {
      "pk": 3003013,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 13,
      "text": "Then Nebuchadnezzar, in a furious rage, commanded that Shadrach, Meshach, and Abednego be brought. So they brought these men before the king.",
      "links": "",
      "comment": "The king’s anger is a test of faith for God’s people."
    },
    {
      "pk": 3003014,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 14,
      "text": "Nebuchadnezzar spoke and said to them, 'Is it true, Shadrach, Meshach, and Abednego, that you do not serve my gods or worship the golden image which I have set up?",
      "links": "",
      "comment": "Direct challenge to their faith, testing their allegiance."
    },
    {
      "pk": 3003015,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 15,
      "text": "Now if you are ready when you hear the sound of the horn, flute, zither, lyre, harp, and all kinds of musical instruments to fall down and worship the image I made, well and good. But if you do not worship, you shall immediately be cast into a blazing furnace. And who is the god who will deliver you out of my hands?",
      "links": "",
      "comment": "Nebuchadnezzar’s question is a challenge, referencing God’s superiority as answered in the following verses."
    },
    {
      "pk": 3003016,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 16,
      "text": "Shadrach, Meshach, and Abednego answered the king, 'O Nebuchadnezzar, we have no need to answer you in this matter.",
      "links": "",
      "comment": "Their confidence stems from faith, modeling trust in divine providence."
    },
    {
      "pk": 3003017,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 17,
      "text": "If this be so, our God whom we serve is able to deliver us from the blazing furnace, and He will deliver us out of your hand, O king.",
      "links": "<a href='/AIV/27/6/20'>Dan. 6:20</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "They affirm God’s sovereignty over earthly powers, reminiscent of later apostolic witness."
    },
    {
      "pk": 3003018,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 18,
      "text": "But if not, let it be known to you, O king, that we will not serve your gods or worship the golden image that you have set up.",
      "links": "<a href='/AIV/42/4/8'>Luke 4:8</a>",
      "comment": "The stance echoes steadfastness later seen in early Christian martyrs; faithfulness to God supersedes worldly authority."
    },
    {
      "pk": 3003019,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 19,
      "text": "Then Nebuchadnezzar was filled with fury, and the expression of his face changed against Shadrach, Meshach, and Abednego. He ordered the furnace be heated seven times more than usual.",
      "links": "<a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "The 'seven times' signifies completeness and extremity of the trial."
    },
    {
      "pk": 3003020,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 20,
      "text": "He commanded certain mighty men of his army to bind Shadrach, Meshach, and Abednego and throw them into the blazing furnace.",
      "links": "",
      "comment": "Use of the strongest men underscores the perceived threat the faithful men pose."
    },
    {
      "pk": 3003021,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 21,
      "text": "Then these men were bound, wearing their cloaks, tunics, hats, and other garments, and were thrown into the blazing furnace.",
      "links": "",
      "comment": "Details about their clothing serve to highlight the immediacy and severity of their fate."
    },
    {
      "pk": 3003022,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 22,
      "text": "Because the king’s command was urgent and the furnace exceedingly hot, the flame killed those men who carried up Shadrach, Meshach, and Abednego.",
      "links": "",
      "comment": "Divine protection contrasts with the destruction experienced by the executors."
    },
    {
      "pk": 3003023,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 23,
      "text": "And these three men, Shadrach, Meshach, and Abednego, fell bound into the blazing furnace.",
      "links": "",
      "comment": "Their binding and fall represent submission to God, not the king."
    },
    {
      "pk": 3003024,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 24,
      "text": "Then King Nebuchadnezzar was astonished, and rose up quickly. He said to his counselors, 'Did we not cast three men bound into the fire?' They answered the king, 'True, O king.'",
      "links": "",
      "comment": "A miraculous turn, fulfilling God’s power over nature and kings."
    },
    {
      "pk": 3003025,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 25,
      "text": "He answered, 'But I see four men unbound, walking in the midst of the fire, and they are not hurt; and the appearance of the fourth is like a son of the gods.'",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/46/3/12'>1 Cor. 3:12-15</a>",
      "comment": "Ancient tradition sees this fourth figure as an angel or divine messenger, prefiguring Christ’s presence with the faithful in suffering."
    },
    {
      "pk": 3003026,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 26,
      "text": "Then Nebuchadnezzar approached the door of the blazing furnace and called, 'Shadrach, Meshach, and Abednego, servants of the Most High God, come out, and come here!' So Shadrach, Meshach, and Abednego came out from the midst of the fire.",
      "links": "<a href='/AIV/27/6/20'>Dan. 6:20</a>",
      "comment": "‘Most High God’ is a title designating supremacy of Israel’s God above all others."
    },
    {
      "pk": 3003027,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 27,
      "text": "And the satraps, the prefects, the governors, and the king’s counselors gathered and saw that the fire had no power over their bodies. The hair of their heads was not singed, their clothes were untouched, and there was no smell of fire on them.",
      "links": "<a href='/AIV/27/6/23'>Dan. 6:23</a>",
      "comment": "Supernatural deliverance recalls other miraculous protections in Scripture."
    },
    {
      "pk": 3003028,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 28,
      "text": "Nebuchadnezzar said, 'Blessed be the God of Shadrach, Meshach, and Abednego, who sent His angel and delivered His servants who trusted in Him, who defied the king’s command and yielded up their bodies rather than serve or worship any god except their own God.'",
      "links": "<a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Self-offering to God prefigures the Christian call to sacrifice and obedience."
    },
    {
      "pk": 3003029,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 29,
      "text": "'Therefore I make a decree that any people, nation, or language who speaks anything against the God of Shadrach, Meshach, and Abednego shall be torn limb from limb, and their houses laid in ruins; for there is no other god who is able to deliver in this way.'",
      "links": "",
      "comment": "Public recognition that Israel’s God is unique in His power, foreshadowing evangelization of the nations."
    },
    {
      "pk": 3003030,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 30,
      "text": "Then the king promoted Shadrach, Meshach, and Abednego in the province of Babylon.",
      "links": "",
      "comment": "Their witness leads to elevation, hinting at divine reward for faithfulness."
    },
    {
      "pk": 3003031,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 31,
      "text": "And King Nebuchadnezzar said, 'Let all peoples, nations, and languages dwell in peace with one another!'",
      "links": "",
      "comment": "This addition, present in some ancient texts, points towards harmony among nations under God’s law."
    },
    {
      "pk": 3003032,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 32,
      "text": "'May your prosperity multiply.'",
      "links": "",
      "comment": "Nebuchadnezzar pronounces a blessing, reminiscent of peace and goodwill brought through God’s favor."
    },
    {
      "pk": 3003033,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 33,
      "text": "'It is my pleasure to declare the signs and wonders that the Most High God has done for me.'",
      "links": "<a href='/AIV/27/4/2'>Dan. 4:2</a>",
      "comment": "Sharing testimony of wonders is a theme echoed in the Psalms and apostles."
    },
    {
      "pk": 3003034,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 34,
      "text": "'How great are His signs, how mighty His wonders! His kingdom is an everlasting kingdom, and His dominion endures from generation to generation.'",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/19/145/13'>Ps. 145:13</a>",
      "comment": "Reference to God’s everlasting kingdom; Christians see this fulfilled in Christ’s reign."
    },
    {
      "pk": 3003035,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 35,
      "text": "Then Azariah stood and prayed in this way, while in the midst of the fire, opening his mouth, he said:",
      "links": "<a href='/AIV/27/3/23'>Dan. 3:23</a>",
      "comment": "The ‘Prayer of Azariah’ is part of the longer text found in Greek traditions, preserved in ancient witnesses."
    },
    {
      "pk": 3003036,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 36,
      "text": "'Blessed are You, O Lord, God of our ancestors, and worthily to be praised and glorified forever.'",
      "links": "<a href='/AIV/19/106/1'>Ps. 106:1</a>",
      "comment": "Liturgical language, expressing eternal praise, connects worship throughout generations."
    },
    {
      "pk": 3003037,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 37,
      "text": "'For You have handed us over to our enemies, lawless and hateful rulers, and to a king, the most wicked in all the earth.'",
      "links": "<a href='/AIV/16/9/37'>Neh. 9:37</a>",
      "comment": "Acknowledgement of divine justice in trial; repentance is fundamental in reconciliation."
    },
    {
      "pk": 3003038,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 38,
      "text": "'We cannot open our mouths, shame and disgrace have come upon Your servants and worshipers.'",
      "links": "<a href='/AIV/19/44/15'>Ps. 44:15</a>",
      "comment": "Confession of helplessness before God, displaying humility."
    },
    {
      "pk": 3003039,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 39,
      "text": "'Do not forsake us forever, for the sake of Your covenant, and do not withdraw Your mercy from us for the sake of Abraham, Your beloved, and for Your servant Isaac and Israel, Your holy one.'",
      "links": "<a href='/AIV/19/106/45'>Ps. 106:45</a>; <a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "Appeal to God’s covenant with the patriarchs, central in biblical theology."
    },
    {
      "pk": 3003040,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 40,
      "text": "'To whom You promised to multiply their descendants like the stars of the heavens and the sand on the seashore.'",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "God’s faithfulness to His people spans generations."
    },
    {
      "pk": 3003041,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 41,
      "text": "'For we, O Lord, have become fewer than all nations, brought low in all the earth because of our sins.'",
      "links": "",
      "comment": "Confession aligns with the biblical call to repentance."
    },
    {
      "pk": 3003042,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 42,
      "text": "'At this time, there is no prince nor prophet, no leader, no burnt offering nor sacrifice, no incense, no place to present offerings before You and to find mercy.'",
      "links": "<a href='/AIV/19/74/9'>Ps. 74:9</a>",
      "comment": "Longing for temple worship and sacrificial system shows the importance of liturgical life."
    },
    {
      "pk": 3003043,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 43,
      "text": "'Yet with a contrite heart and humble spirit, may we be accepted, as though it were with burnt offerings of rams and bulls, and thousands of fattened sheep.'",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Sacrifice of contrition is pleasing to God: the spiritual meaning foreshadowed in Christian repentance."
    },
    {
      "pk": 3003044,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 44,
      "text": "'Such may our offering be today before You, and may it please You; for there is no shame for those who trust in You.'",
      "links": "",
      "comment": "Faith and trust in God are the heart of true worship."
    },
    {
      "pk": 3003045,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 45,
      "text": "'Now we follow You wholeheartedly, we fear You and seek Your face.'",
      "links": "",
      "comment": "Wholehearted devotion is the ideal response to trial."
    },
    {
      "pk": 3003046,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 46,
      "text": "'Do not put us to shame, but deal with us in Your kindness and with Your great mercy.'",
      "links": "<a href='/AIV/19/25/6'>Ps. 25:6</a>",
      "comment": "Divine mercy is foundational in biblical faith."
    },
    {
      "pk": 3003047,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 47,
      "text": "'Deliver us according to Your wondrous works. Give glory to Your name, O Lord.'",
      "links": "<a href='/AIV/19/115/1'>Ps. 115:1</a>",
      "comment": "Deliverance brings glory to God’s name before all people."
    },
    {
      "pk": 3003048,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 48,
      "text": "'Let all those who harm Your servants be put to shame; let them be deprived of all power, might, and authority.'",
      "links": "",
      "comment": "Praying for justice, echoing the prophets’ call for righteousness."
    },
    {
      "pk": 3003049,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 49,
      "text": "'Let them know that You alone are the Lord God, glorious over all the earth.'",
      "links": "<a href='/AIV/19/83/18'>Ps. 83:18</a>",
      "comment": "God’s uniqueness and glory are established before nations."
    },
    {
      "pk": 3003050,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 50,
      "text": "And at this time, while the three young men prayed in the fire, the furnace was heated with flames and coals of fire, increased by the addition of pitch, tow, and brushwood.",
      "links": "",
      "comment": "Details highlight the trial’s extremity and the certainty of miraculous deliverance."
    },
    {
      "pk": 3003051,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 51,
      "text": "The flame poured out above the furnace forty-nine cubits and it broke out and burned those Chaldeans it found around the furnace.",
      "links": "",
      "comment": "God’s protection contrasts with the fate of the mighty who oppose Him."
    },
    {
      "pk": 3003052,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 52,
      "text": "But the angel of the Lord went down into the furnace with Azariah and his companions, and he drove the fiery flame away from the furnace.",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>",
      "comment": "Divine intervention by ‘the angel of the Lord’ shows God’s saving presence."
    },
    {
      "pk": 3003053,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 53,
      "text": "He made the center of the furnace as though a moist wind were blowing through, so that the fire did not touch them at all, nor hurt them, nor trouble them.",
      "links": "",
      "comment": "Miraculous deliverance affirms God’s control over nature."
    },
    {
      "pk": 3003054,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 54,
      "text": "Then the three began to sing in the furnace and bless and praise God.",
      "links": "<a href='/AIV/19/148/1'>Ps. 148:1</a>",
      "comment": "Song of praise amidst suffering highlights steadfast faith and connects to scriptural worship."
    },
    {
      "pk": 3003055,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 55,
      "text": "'Blessed are You, O Lord, God of our ancestors, and to be praised and exalted above all forever.'",
      "links": "",
      "comment": "Liturgical formula, magnifying the eternal God."
    },
    {
      "pk": 3003056,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 56,
      "text": "'Blessed is Your glorious, holy name, and to be praised and exalted above all forever.'",
      "links": "",
      "comment": "The recurring blessing structure mirrors ancient worship."
    },
    {
      "pk": 3003057,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 57,
      "text": "'Blessed are You in the temple of Your holy glory, and to be praised and exalted above all forever.'",
      "links": "",
      "comment": "Significance of God’s temple; spiritual interpretation sees it as fulfilled in Christ and the communion of saints."
    },
    {
      "pk": 3003058,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 58,
      "text": "'Blessed are You who look into the depths and sits upon cherubim, and to be praised and exalted above all forever.'",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "Cherubim invoke temple imagery; God’s presence is transcendent."
    },
    {
      "pk": 3003059,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 59,
      "text": "'Blessed are You on the throne of Your kingdom, and to be praised and exalted above all forever.'",
      "links": "",
      "comment": "Kingdom language prefigures Christ’s reign as King."
    },
    {
      "pk": 3003060,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 60,
      "text": "'Blessed are You in the firmament of heaven, and to be praised and exalted above all forever.'",
      "links": "",
      "comment": "Worship and praise extend across all creation, including heaven itself."
    },
    {
      "pk": 3003061,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 61,
      "text": "'Bless the Lord, all works of the Lord, praise and exalt Him above all forever.'",
      "links": "<a href='/AIV/19/148/2'>Ps. 148:2</a>",
      "comment": "Universal call to worship; echoes Psalms and Revelation."
    },
    {
      "pk": 3003062,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 62,
      "text": "'Bless the Lord, angels of the Lord, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Created beings included in offering praise."
    },
    {
      "pk": 3003063,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 63,
      "text": "'Bless the Lord, heavens and waters above the sky, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Cosmic worship extends beyond earth."
    },
    {
      "pk": 3003064,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 64,
      "text": "'Bless the Lord, all powers, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "‘Powers’ may refer to angelic hosts and heavenly beings."
    },
    {
      "pk": 3003065,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 65,
      "text": "'Bless the Lord, sun and moon, sing praise and exalt Him above all forever.'",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>",
      "comment": "Creation itself is called to praise the Creator."
    },
    {
      "pk": 3003066,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 66,
      "text": "'Bless the Lord, stars of heaven, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "All the cosmos participates in praise."
    },
    {
      "pk": 3003067,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 67,
      "text": "'Bless the Lord, showers and dew, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Natural elements called to worship God."
    },
    {
      "pk": 3003068,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 68,
      "text": "'Bless the Lord, winds and fire and heat, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Fire and heat especially pertinent to the context of the furnace."
    },
    {
      "pk": 3003069,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 69,
      "text": "'Bless the Lord, cold and warmth, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003070,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 70,
      "text": "'Bless the Lord, frost and snow, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003071,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 71,
      "text": "'Bless the Lord, nights and days, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003072,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 72,
      "text": "'Bless the Lord, light and darkness, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Even forces perceived in tension are united in praise."
    },
    {
      "pk": 3003073,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 73,
      "text": "'Bless the Lord, lightning and clouds, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003074,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 74,
      "text": "'Let the earth bless the Lord, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003075,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 75,
      "text": "'Bless the Lord, mountains and hills, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003076,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 76,
      "text": "'Bless the Lord, all things growing on the earth, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "All creation is included in the call to praise God."
    },
    {
      "pk": 3003077,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 77,
      "text": "'Bless the Lord, springs, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003078,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 78,
      "text": "'Bless the Lord, seas and rivers, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003079,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 79,
      "text": "'Bless the Lord, whales and all that move in waters, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003080,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 80,
      "text": "'Bless the Lord, all birds of the air, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003081,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 81,
      "text": "'Bless the Lord, all beasts and cattle, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003082,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 82,
      "text": "'Bless the Lord, sons of men, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "All humanity is called to worship, prefiguring the unity of God’s people."
    },
    {
      "pk": 3003083,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 83,
      "text": "'Bless the Lord, Israel, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003084,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 84,
      "text": "'Bless the Lord, priests of the Lord, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Priestly praise connects worship, liturgy, and mediation before God."
    },
    {
      "pk": 3003085,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 85,
      "text": "'Bless the Lord, servants of the Lord, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": ""
    },
    {
      "pk": 3003086,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 86,
      "text": "'Bless the Lord, spirits and souls of the righteous, sing praise and exalt Him above all forever.'",
      "links": "",
      "comment": "Spiritual interpretation sees the ‘souls of the righteous’ as saints and martyrs in communion with God."
    },
    {
      "pk": 3003087,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 87,
      "text": "'Bless the Lord, holy and humble in heart, sing praise and exalt Him above all forever.'",
      "links": "<a href='/AIV/19/34/18'>Ps. 34:18</a>",
      "comment": "Humility is exalted as the way of the truly righteous."
    },
    {
      "pk": 3003088,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 88,
      "text": "'Bless the Lord, Hananiah, Azariah, and Mishael, sing praise and exalt Him above all forever, for He has delivered us from the power of Sheol and saved us from the burning flame.'",
      "links": "<a href='/AIV/19/30/3'>Ps. 30:3</a>",
      "comment": "God’s deliverance extends even to salvation from death, prefiguring resurrection theology."
    },
    {
      "pk": 3003089,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 89,
      "text": "'Give thanks to the Lord, for He is good, for His mercy endures forever.'",
      "links": "<a href='/AIV/19/107/1'>Ps. 107:1</a>",
      "comment": "God’s enduring mercy is an ongoing theme throughout scripture."
    },
    {
      "pk": 3003090,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 90,
      "text": "Then at the command of the king, the men who had cast them into the furnace were slain; but the three walked out glorifying God all the more.",
      "links": "",
      "comment": "God’s judgment reverses human injustice; salvation leads to praise."
    },
    {
      "pk": 3003091,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 91,
      "text": "The king, seeing the miracle, praised the Most High, and ordered everyone to worship and honor Him.",
      "links": "",
      "comment": "Recognition of God by a Gentile king previews universal worship in the Messianic age."
    },
    {
      "pk": 3003092,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 92,
      "text": "And he restored the three men to their positions, granting them even greater authority in the province of Babylon.",
      "links": "",
      "comment": "Faithfulness to God is rewarded; echoes resurrection and reward themes in Scripture."
    },
    {
      "pk": 3003093,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 93,
      "text": "Thus the faith of Shadrach, Meshach, and Abednego was known throughout all the kingdom.",
      "links": "",
      "comment": "Public witness of saints can inspire many to faith."
    },
    {
      "pk": 3003094,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 94,
      "text": "And all the peoples marveled at the works God had done, and the memory of this miracle was kept in the hearts of many.",
      "links": "",
      "comment": "Remembrance is central in biblical theology; memorializing God’s works connects past, present, and future."
    },
    {
      "pk": 3003095,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 95,
      "text": "From that time, there was peace in Babylon for a long period, and honor for those who follow the true God.",
      "links": "",
      "comment": "Peace following faithfulness anticipates the spiritual blessings of the Messianic kingdom."
    },
    {
      "pk": 3003096,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 96,
      "text": "All who heard of these things gave glory to God and learned to trust in Him.",
      "links": "",
      "comment": "Testimony leading to conversion; a spiritual principle seen in New Testament witness."
    },
    {
      "pk": 3003097,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 97,
      "text": "Shadrach, Meshach, and Abednego remained faithful their whole lives, steadfast in service to the Most High.",
      "links": "",
      "comment": "Steadfastness across a lifetime; perseverance is a key virtue in Christian life."
    },
    {
      "pk": 3003098,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 98,
      "text": "Their story was recorded so that all generations might see the power of faith and the glory of God.",
      "links": "<a href='/AIV/19/78/4'>Ps. 78:4</a>",
      "comment": "Passing on the faith is vital in salvation history and discipleship."
    },
    {
      "pk": 3003099,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 99,
      "text": "For God is ruler over all things, mighty to save, and His mercy endures forever.",
      "links": "<a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "God’s rule and mercy are central in biblical worship and theology."
    },
    {
      "pk": 3003100,
      "translation": "AIV",
      "book": 27,
      "chapter": 3,
      "verse": 100,
      "text": "May all people, nations, and languages worship Him and glorify His holy name, now and forever. Amen.",
      "links": "<a href='/AIV/19/117/1'>Ps. 117:1</a>",
      "comment": "Universal worship and praise foresee the unity of all believers in faith and glory."
    }
  ],
  "translatedAt": "2025-12-23T07:14:36.276Z"
}