{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 8,
  "verses": [
    {
      "pk": 2088001,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 1,
      "text": "In the third year of King Belshazzar’s reign, I, Daniel, saw a vision after the one that had already appeared to me.",
      "links": "<a href='/AIV/27/7/1'>Daniel 7:1</a>",
      "comment": "Daniel records the time and context of his vision, highlighting its continuity with an earlier revelation. The specificity points to the reliability of the prophetic accounts."
    },
    {
      "pk": 2088002,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 2,
      "text": "In my vision I saw myself in the fortress city of Susa, in the province of Elam. In the vision, I was beside the Ulai canal.",
      "links": "<a href='/AIV/16/1/1'>Nehemiah 1:1</a>; <a href='/AIV/27/8/16'>Daniel 8:16</a>",
      "comment": "Susa later becomes central in Persian history (see Nehemiah and Esther). The geographic details show the prophetic scope, anticipating future empires."
    },
    {
      "pk": 2088003,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 3,
      "text": "I looked up, and saw a ram standing beside the canal; it had two horns, both tall, but one was taller than the other, and the taller horn rose up last.",
      "links": "<a href='/AIV/27/8/20'>Daniel 8:20</a>",
      "comment": "The ram’s two horns are interpreted later as representing the kings of Media and Persia. The discrepancy in horn size suggests uneven power between the two kingdoms."
    },
    {
      "pk": 2088004,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 4,
      "text": "I saw the ram charging westward, northward, and southward. No beast could stand before it, and none could rescue from its power. It did as it wished, and became great.",
      "links": "<a href='/AIV/27/8/20'>Daniel 8:20</a>",
      "comment": "The aggressive expansion hints at the historical conquests of the Medo-Persian empire. The language of 'becoming great' evokes the pride that precedes downfall in biblical narrative (cf. Proverbs 16:18)."
    },
    {
      "pk": 2088005,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 5,
      "text": "As I was considering this, suddenly a male goat came from the west, crossing the whole earth without touching the ground. The goat had a prominent horn between its eyes.",
      "links": "<a href='/AIV/27/8/21'>Daniel 8:21</a>",
      "comment": "This symbol refers to Greece and its swift conquest under Alexander the Great, described as moving without 'touching the ground.' The single 'prominent horn' signifies a singularly powerful king."
    },
    {
      "pk": 2088006,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 6,
      "text": "He came to the ram with two horns, which I had seen standing beside the canal, and charged at him in furious strength.",
      "links": "<a href='/AIV/27/8/21'>Daniel 8:21</a>",
      "comment": "This describes the confrontation between the Greek and Medo-Persian empires. The imagery suggests total and overwhelming victory."
    },
    {
      "pk": 2088007,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 7,
      "text": "I watched him reach the ram in rage and strike him, shattering his two horns. The ram was powerless to stand before him. The goat knocked him down and trampled him, and none could rescue the ram from his power.",
      "links": "<a href='/AIV/27/8/21'>Daniel 8:21</a>",
      "comment": "The shattering of the horns emphasizes the totality of the defeat. This passage highlights the dynamic shifts of power ordained in God’s providence, serving as a reminder of the fleeting nature of earthly kingdoms."
    },
    {
      "pk": 2088008,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 8,
      "text": "Then the male goat became exceedingly great; but when he was strong, his large horn was broken. In its place, four prominent horns grew up toward the four winds of heaven.",
      "links": "<a href='/AIV/27/8/22'>Daniel 8:22</a>; <a href='/AIV/27/7/6'>Daniel 7:6</a>",
      "comment": "The rise and fall of empires, even at the height of their power, points to the sovereignty of God. Four horns symbolize the division of Alexander’s kingdom, a testament to the cycle of rise and dissolution."
    },
    {
      "pk": 2088009,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 9,
      "text": "Out of one of them came a small horn, which grew exceedingly great toward the south, the east, and toward the glorious land.",
      "links": "<a href='/AIV/27/8/23-25'>Daniel 8:23-25</a>; <a href='/AIV/27/11/21'>Daniel 11:21</a>",
      "comment": "Traditionally taken to represent a later king, commonly Antiochus IV Epiphanes, whose persecutions foreshadow anti-Christian powers. The 'glorious land' is understood as Israel."
    },
    {
      "pk": 2088010,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 10,
      "text": "It grew up even to the host of heaven. It threw down some of the host and some of the stars to the ground and trampled them.",
      "links": "<a href='/AIV/27/12/3'>Daniel 12:3</a>; <a href='/AIV/19/82/6-7'>Psalm 82:6-7</a>",
      "comment": "The language here is cosmic, reflecting both earthly and spiritual battles. Host and stars may symbolize saints and spiritual leaders, whose suffering often precedes glory."
    },
    {
      "pk": 2088011,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 11,
      "text": "It even exalted itself as high as the prince of the host. It took away from him the regular burnt offering, and the place of his sanctuary was thrown down.",
      "links": "<a href='/AIV/27/11/31'>Daniel 11:31</a>; <a href='/AIV/40/24/15'>Matthew 24:15</a>",
      "comment": "Removal of the regular sacrifice refers to the desecration of the Temple. Jesus alludes to this in Matthew 24:15, drawing further prophetic connections. The centrality of worship and sacrificial offering points to the ongoing spiritual war against true faith."
    },
    {
      "pk": 2088012,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 12,
      "text": "Because of rebellion, an army was given over to the horn to oppose the regular burnt offering. It threw truth to the ground, and it prospered in what it did.",
      "links": "<a href='/AIV/27/11/31-32'>Daniel 11:31-32</a>; <a href='/AIV/2/32/19'>Exodus 32:19</a>",
      "comment": "Rebellion, false worship, and the rejection of truth parallel other episodes of apostasy. The victorious persecution serves as a moment for those who hold steadfast to faith."
    },
    {
      "pk": 2088013,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 13,
      "text": "Then I heard a holy one speaking; and another holy one said to him, 'How long will the vision of the regular offering, the desolation causing rebellion, and the trampling of the sanctuary and host last?'",
      "links": "<a href='/AIV/27/12/6-7'>Daniel 12:6-7</a>; <a href='/AIV/35/1/2'>Habakkuk 1:2</a>",
      "comment": "The inquiry into 'how long' suffering will persist expresses a spiritual yearning for God’s deliverance, echoed repeatedly in scripture and the prayers of saints."
    },
    {
      "pk": 2088014,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 14,
      "text": "He said to me, 'For two thousand three hundred evenings and mornings. Then the sanctuary shall be restored to righteousness.'",
      "links": "<a href='/AIV/27/12/11'>Daniel 12:11</a>",
      "comment": "The appointed time points to the exactness of God’s plan for redemption and restoration. Interpreted both literally (period of persecution) and allegorically (spiritual cleansing after trial)."
    },
    {
      "pk": 2088015,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 15,
      "text": "When I, Daniel, had seen the vision, I sought to understand it. Suddenly before me stood one having the appearance of a man.",
      "links": "<a href='/AIV/27/10/16'>Daniel 10:16</a>",
      "comment": "Divine revelation is often mysterious, given to humble seekers. Appearances of angelic messengers as men prefigure later moments in salvation history (see also Genesis 18:2)."
    },
    {
      "pk": 2088016,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 16,
      "text": "And I heard a human voice from the Ulai calling, 'Gabriel, make this man understand the vision.'",
      "links": "<a href='/AIV/27/9/21'>Daniel 9:21</a>; <a href='/AIV/42/1/19'>Luke 1:19</a>",
      "comment": "Gabriel, later prominent in the New Testament, is first named here. The angelic ministry affirms the importance of supernatural mediation in understanding divine mysteries."
    },
    {
      "pk": 2088017,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 17,
      "text": "So he came near where I stood. When he came, I was terrified and fell face down. But he said to me, 'Understand, son of man, that the vision refers to the time of the end.'",
      "links": "<a href='/AIV/27/10/7-9'>Daniel 10:7-9</a>; <a href='/AIV/26/2/1'>Ezekiel 2:1</a>",
      "comment": "Fear before angelic revelation echoes elsewhere in scripture. 'Son of man' anticipates christological language Jesus later applies to Himself, emphasizing both humanity and divine authority."
    },
    {
      "pk": 2088018,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 18,
      "text": "While he was speaking to me, I fell into a deep sleep with my face to the ground. He touched me and set me upright.",
      "links": "<a href='/AIV/27/10/9-10'>Daniel 10:9-10</a>",
      "comment": "The touch and restoration mirror other moments where divine messengers revive and strengthen human recipients—showing God's compassion and sustaining grace in revelation."
    },
    {
      "pk": 2088019,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 19,
      "text": "He said, 'I am going to tell you what will happen at the end of wrath, for the appointed time of the end.'",
      "links": "<a href='/AIV/27/12/9'>Daniel 12:9</a>; <a href='/AIV/40/24/3'>Matthew 24:3</a>",
      "comment": "God’s fulfillment is always according to His timetable. Themes of 'appointed end' point forward to Christ’s reign over history and final restoration."
    },
    {
      "pk": 2088020,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 20,
      "text": "The ram you saw with two horns represents the kings of Media and Persia.",
      "links": "<a href='/AIV/27/8/3'>Daniel 8:3</a>",
      "comment": "Gabriel explicitly interprets the vision, leaving little doubt regarding its immediate historical referents."
    },
    {
      "pk": 2088021,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 21,
      "text": "The shaggy goat is the king of Greece, and the large horn between its eyes is the first king.",
      "links": "<a href='/AIV/27/8/5'>Daniel 8:5</a>",
      "comment": "The clear fulfillment of prophecy in Alexander the Great is a striking proof of divine foreknowledge, supporting scriptural trustworthiness."
    },
    {
      "pk": 2088022,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 22,
      "text": "As for the horn that was broken and in whose place four stood up, four kingdoms shall arise from his nation, but not with his power.",
      "links": "<a href='/AIV/27/7/6'>Daniel 7:6</a>",
      "comment": "Historical accuracy is confirmed through the fragmentation of Alexander’s empire. Scriptural prophecy points toward divine sovereignty over nations."
    },
    {
      "pk": 2088023,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 23,
      "text": "At the latter end of their kingdom, when transgressors have reached their limit, a stern-faced king, skilled in intrigue, will arise.",
      "links": "<a href='/AIV/27/11/21'>Daniel 11:21</a>",
      "comment": "This points to a particular individual who is both a political and spiritual adversary, prefiguring final anti-Christian powers described in New Testament times."
    },
    {
      "pk": 2088024,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 24,
      "text": "His power will be mighty—but not by his own strength. He will bring extraordinary destruction, succeed in whatever he does, and destroy mighty men and the people who are holy.",
      "links": "<a href='/AIV/27/8/10'>Daniel 8:10</a>; <a href='/AIV/27/11/33'>Daniel 11:33</a>",
      "comment": "His ability is due to allowance from above—reminding us that even the most fearsome adversaries are ultimately under God's permission."
    },
    {
      "pk": 2088025,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 25,
      "text": "Through his cunning he will cause deceit to prosper under his hand, and he will become arrogant in his heart. He will destroy many in their complacency. He will oppose even the Prince of princes, yet he will be broken—not by human means.",
      "links": "<a href='/AIV/19/2/2'>Psalm 2:2</a>; <a href='/AIV/44/4/27'>Acts 4:27</a>",
      "comment": "This prophecy looks forward to the final defeat of anti-divine powers by supernatural means—interpreted spiritually as God’s ultimate victory, prefigured in the defeat of evil through divine intervention in Christ."
    },
    {
      "pk": 2088026,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 26,
      "text": "The vision of the evenings and mornings that has been told is true, but you must seal up the vision, for it refers to many days in the future.",
      "links": "<a href='/AIV/27/12/4'>Daniel 12:4</a>",
      "comment": "Sealing the vision denotes its importance and the mystery of God’s plan, which unfolds over generations. This calls to trust in tradition and continuity."
    },
    {
      "pk": 2088027,
      "translation": "AIV",
      "book": 27,
      "chapter": 8,
      "verse": 27,
      "text": "I, Daniel, was overcome and lay sick for several days. Then I rose and went about the king’s work, but I was appalled by the vision and could not understand it.",
      "links": "<a href='/AIV/27/7/28'>Daniel 7:28</a>",
      "comment": "Daniel’s reaction shows the tremendous spiritual weight of prophetic revelation. Nevertheless, Daniel persists in faithful service—a model of perseverance, obedience, and humility amidst mystery."
    }
  ],
  "translatedAt": "2025-12-23T07:17:08.809Z"
}