{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 10,
  "verses": [
    {
      "pk": 19421001,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 1,
      "text": "In the third year of Cyrus king of Persia, a message was revealed to Daniel, who was called Belteshazzar. The message was true and concerned great conflict. He understood the message and gained understanding through the vision.",
      "links": "<a href='/AIV/27/1/7'>Dan. 1:7</a>; <a href='/AIV/27/8/1'>Dan. 8:1</a>",
      "comment": "This sets the historical context and highlights Daniel’s insight into heavenly mysteries granted through visions, which prefigures later prophetic visions seen throughout scripture (cf. Rev. 1:1)."
    },
    {
      "pk": 19421002,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 2,
      "text": "In those days, I, Daniel, mourned for three weeks.",
      "links": "<a href='/AIV/27/9/3'>Dan. 9:3</a>",
      "comment": "Daniel’s mourning, marked by fasting, shows a pattern of deep prayer and spiritual discipline, which echoes other figures who seek God’s favor through earnest devotion."
    },
    {
      "pk": 19421003,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 3,
      "text": "I ate no rich food, no meat or wine entered my mouth, and I did not anoint myself until the three weeks were completed.",
      "links": "<a href='/AIV/27/1/8'>Dan. 1:8</a>; <a href='/AIV/27/9/3'>Dan. 9:3</a>",
      "comment": "Daniel’s abstinence points to voluntary sacrifice and purification, foreshadowing later spiritual disciplines associated with seeking God’s presence."
    },
    {
      "pk": 19421004,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 4,
      "text": "On the twenty-fourth day of the first month, as I was beside the great river, the Tigris,",
      "links": "<a href='/AIV/27/8/2'>Dan. 8:2</a>",
      "comment": "The specific date and location underscore the historicity of Daniel's vision, grounding spiritual events in real history. Many visions occur near water, symbolizing life and divine revelation (cf. Ezek. 1:1)."
    },
    {
      "pk": 19421005,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 5,
      "text": "I looked up and saw a man clothed in linen, with a belt of pure gold from Uphaz around his waist.",
      "links": "<a href='/AIV/27/12/6-7'>Dan. 12:6-7</a>; <a href='/AIV/66/1/13'>Rev. 1:13</a>",
      "comment": "The figure in linen signifies purity and priestly mediation, reminiscent of angelic appearances and even the glorified Christ described in Revelation (Rev. 1:13)."
    },
    {
      "pk": 19421006,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 6,
      "text": "His body was like beryl, his face shining like lightning, his eyes like flaming torches, his arms and legs with the gleam of polished bronze, and the sound of his words like a multitude.",
      "links": "<a href='/AIV/27/7/9'>Dan. 7:9</a>; <a href='/AIV/66/1/14-15'>Rev. 1:14-15</a>",
      "comment": "The vision evokes awe and has high christological significance, sharing traits with later descriptions of the Son of Man: divine glory, power, and purity (cf. Rev. 1:14-15)."
    },
    {
      "pk": 19421007,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 7,
      "text": "I, Daniel, saw the vision, but the men with me did not see it; a great trembling fell on them, and they fled to hide themselves.",
      "links": "<a href='/AIV/9/16/14'>1 Sam. 16:14</a>; <a href='/AIV/44/9/7'>Acts 9:7</a>",
      "comment": "Spiritual encounters often overwhelm those nearby. Like Paul’s companions at his conversion (Acts 9:7), Daniel alone receives the full revelation, highlighting God’s election for prophetic purposes."
    },
    {
      "pk": 19421008,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 8,
      "text": "So I was left alone and saw this great vision, and no strength remained in me; my face grew deathly pale, and I had no strength.",
      "links": "<a href='/AIV/27/8/27'>Dan. 8:27</a>",
      "comment": "A prophetic encounter with God’s messenger often overwhelms the physical senses, indicating humanity’s weakness before divine glory."
    },
    {
      "pk": 19421009,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 9,
      "text": "Then I heard the sound of his words, and as I listened, I fell into a deep sleep on my face, with my face to the ground.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>; <a href='/AIV/10/22/16'>2 Sam. 22:16</a>",
      "comment": "Daniel’s falling face-down signifies reverence and awe before God’s revelation, a common response in encounters with the divine (cf. John 18:6)."
    },
    {
      "pk": 19421010,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 10,
      "text": "And a hand touched me and set me trembling on my hands and knees.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>",
      "comment": "The touch restores Daniel enough to receive God’s word, illustrating divine compassion and assistance to the faithful."
    },
    {
      "pk": 19421011,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 11,
      "text": "And he said to me, \"Daniel, you who are greatly beloved, pay attention to the words I speak to you and stand upright, for I have been sent to you.\" And while he spoke this to me, I stood up trembling.",
      "links": "<a href='/AIV/27/9/23'>Dan. 9:23</a>",
      "comment": "Daniel is called ‘greatly beloved,’ a term denoting his favored status among God’s prophets, paralleling beloved status elsewhere in Scripture (cf. John 13:23)."
    },
    {
      "pk": 19421012,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 12,
      "text": "Then he said to me, \"Do not be afraid, Daniel, for from the first day that you set your heart to understand and humbled yourself before your God, your words have been heard, and I have come in response to your words.\"",
      "links": "<a href='/AIV/27/9/3-4'>Dan. 9:3-4</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "Daniel’s humility and intercession bring about divine response, emphasizing the power of heartfelt prayer as seen in Christ’s teachings on persistent prayer."
    },
    {
      "pk": 19421013,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 13,
      "text": "\"But the prince of the kingdom of Persia withstood me for twenty-one days. Then Michael, one of the chief princes, came to help me, for I was left there with the kings of Persia.\"",
      "links": "<a href='/AIV/65/1/9'>Jude 1:9</a>; <a href='/AIV/27/12/1'>Dan. 12:1</a>",
      "comment": "Here Michael is shown as a powerful spiritual intercessor, protecting God’s people—a tradition which reveres angelic guardianship and heavenly mediation."
    },
    {
      "pk": 19421014,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 14,
      "text": "\"Now I have come to make you understand what will happen to your people in the last days, for the vision is about days yet to come.\"",
      "links": "<a href='/AIV/27/8/17'>Dan. 8:17</a>; <a href='/AIV/66/1/1'>Rev. 1:1</a>",
      "comment": "This verse points to eschatological prophecy, drawing attention to future fulfillment and the pattern of God’s revelation about end times."
    },
    {
      "pk": 19421015,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 15,
      "text": "While he was speaking these words to me, I turned my face to the ground and became speechless.",
      "links": "<a href='/AIV/27/8/17'>Dan. 8:17</a>",
      "comment": "Daniel’s silence and humility stand as models for encountering the sacred mysteries of God."
    },
    {
      "pk": 19421016,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 16,
      "text": "Then one in form like a human touched my lips, and I opened my mouth and spoke. I said to the one standing before me, \"My lord, because of the vision, I am overcome with anguish, and I have no strength.\"",
      "links": "<a href='/AIV/27/7/16'>Dan. 7:16</a>; <a href='/AIV/15/9/6'>Ezra 9:6</a>",
      "comment": "The touch upon Daniel’s lips recalls Isaiah’s purification through the seraph (Isa. 6:6-7), symbolizing the need for purification to receive holy mysteries."
    },
    {
      "pk": 19421017,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 17,
      "text": "\"How can your servant speak with my lord? For my strength is gone, and no breath is left in me.\"",
      "links": "<a href='/AIV/27/7/28'>Dan. 7:28</a>",
      "comment": "Daniel once more confesses human weakness before the divine, reinforcing the humility required to converse with God."
    },
    {
      "pk": 19421018,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 18,
      "text": "Again, the one who looked like a man touched me and gave me strength.",
      "links": "<a href='/AIV/27/8/18'>Dan. 8:18</a>; <a href='/AIV/19/138/3'>Ps. 138:3</a>",
      "comment": "The repeated strengthening by heavenly beings echoes God’s sustaining grace for his chosen, typified in the strengthening of prophets, apostles, and saints."
    },
    {
      "pk": 19421019,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 19,
      "text": "And he said, \"Do not be afraid, O man greatly beloved, peace be to you; be strong and courageous.\" As he spoke, I felt strengthened and said, \"Let my lord speak, for you have strengthened me.\"",
      "links": "<a href='/AIV/06/1/9'>Josh. 1:9</a>; <a href='/AIV/27/9/23'>Dan. 9:23</a>",
      "comment": "The words ‘peace’ and ‘be strong and courageous’ recall divine encouragement in Joshua. The lasting peace and strength believers receive through divine mediation is a consistent biblical theme."
    },
    {
      "pk": 19421020,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 20,
      "text": "Then he said, \"Do you know why I have come to you? Now I will return to fight against the prince of Persia; and when I go, the prince of Greece will come.\"",
      "links": "<a href='/AIV/27/8/21'>Dan. 8:21</a>; <a href='/AIV/27/7/6'>Dan. 7:6</a>",
      "comment": "This verse unveils the reality of spiritual warfare behind world events, with angelic princes corresponding to earthly empires."
    },
    {
      "pk": 19421021,
      "translation": "AIV",
      "book": 27,
      "chapter": 10,
      "verse": 21,
      "text": "\"But I will tell you what is written in the Book of Truth. (No one stands with me against these except Michael your prince.)\"",
      "links": "<a href='/AIV/27/12/1'>Dan. 12:1</a>; <a href='/AIV/65/1/9'>Jude 1:9</a>",
      "comment": "The ‘Book of Truth’ suggests a divine ledger of God’s plans, with Michael as the appointed spiritual advocate of Israel—hinting at a continued heavenly protection and advocacy for God’s chosen people."
    }
  ],
  "translatedAt": "2025-12-23T07:18:00.232Z"
}