{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 1,
  "verses": [
    {
      "pk": 34001001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 1,
      "text": "In the third year of the reign of Jehoiakim king of Judah, Nebuchadnezzar king of Babylon came to Jerusalem and besieged it.",
      "links": "<a href='/AIV/12/24/1'>2 Kings 24:1</a>; <a href='/AIV/24/25/1'>Jer. 25:1</a>",
      "comment": "This verse sets the historical context for Daniel's story by dating Nebuchadnezzar's siege of Jerusalem. Compare with 2 Kings 24:1 and Jeremiah 25:1. The accuracy and fulfillment of prophecy here demonstrates God’s sovereignty over history (Is. 46:10)."
    },
    {
      "pk": 34001002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 2,
      "text": "And the Lord delivered Jehoiakim king of Judah into his hand, along with some of the vessels of the house of God. He carried them to the land of Shinar, to the house of his god, and placed the vessels in the treasury of his god.",
      "links": "<a href='/AIV/10/8/7'>2 Sam. 8:7</a>; <a href='/AIV/24/27/18-20'>Jer. 27:18-20</a>; <a href='/AIV/01/11/2'>Gen. 11:2</a>",
      "comment": "God allowed Judah to be handed over, displaying judgment and his mysterious providence. The mention of the 'house of God' foreshadows the later restoration of the true Temple and true worship (Ezra 1:7; see spiritual meaning in Heb. 9:24 regarding Christ as the true sanctuary)."
    },
    {
      "pk": 34001003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 3,
      "text": "Then the king commanded Ashpenaz, chief of his officials, to bring some of the Israelites, both from the royal family and from the nobility,",
      "links": "<a href='/AIV/12/20/17'>2 Kings 20:17</a>",
      "comment": "Babylon sought to use Israel’s nobility for its own purposes. This reflects how God can bring about sanctification and witness even amidst exile and adversity."
    },
    {
      "pk": 34001004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 4,
      "text": "Youths without any blemish, handsome and skillful in all wisdom, knowledgeable, quick to understand, and competent to serve in the king’s palace, and to teach them the literature and language of the Chaldeans.",
      "links": "<a href='/AIV/23/39/7'>Isa. 39:7</a>",
      "comment": "The emphasis on ‘without blemish’ recalls Old Testament requirements for priests (Lev. 21:17-23) and foreshadows the calling to purity and holiness. Their training points to transformation, sometimes controversial, when engaging conflicting cultures."
    },
    {
      "pk": 34001005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 5,
      "text": "The king assigned them a daily portion of the king’s food and wine. They were to be trained for three years, after which they were to enter the king’s service.",
      "links": "<a href='/AIV/01/41/46'>Gen. 41:46</a>",
      "comment": "The dietary requirements will become significant, testing faithfulness to God’s Law (see next verses and Lev. 11). The three-year training period echoes patterns of preparation for mission or ministry."
    },
    {
      "pk": 34001006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 6,
      "text": "Among these were Daniel, Hananiah, Mishael, and Azariah from the tribe of Judah.",
      "links": "<a href='/AIV/12/23/8-9'>2 Kings 23:8-9</a>",
      "comment": "These four serve as witnesses to God amidst a foreign land, an early type of remaining faithful under tribulation."
    },
    {
      "pk": 34001007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 7,
      "text": "The chief official gave them new names: Daniel he called Belteshazzar; Hananiah, Shadrach; Mishael, Meshach; and Azariah, Abednego.",
      "links": "<a href='/AIV/04/13/16'>Num. 13:16</a>; <a href='/AIV/27/4/8'>Dan. 4:8</a>",
      "comment": "Adopting Babylonian names sought to strip their identity, but their faithfulness shows the enduring character of God’s people. A parallel can be drawn to receiving a ‘new name’ in Revelation 2:17, but in divine, not pagan, context."
    },
    {
      "pk": 34001008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 8,
      "text": "But Daniel resolved in his heart not to defile himself with the king’s food or wine. He asked the chief official for permission not to defile himself.",
      "links": "<a href='/AIV/03/11/45'>Lev. 11:45</a>; <a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "Daniel’s determination to maintain ritual purity is exemplary. This foreshadows a call for unwavering fidelity to the divine law even when pressured by secular authorities (Acts 5:29)."
    },
    {
      "pk": 34001009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 9,
      "text": "Now God caused the chief official to show favor and compassion toward Daniel.",
      "links": "<a href='/AIV/01/39/21'>Gen. 39:21</a>",
      "comment": "God’s providence is at work, granting favor (cf. Joseph in Egypt, Gen. 39:21). Personal holiness attracts divine assistance, highlighting the interplay between grace and personal response."
    },
    {
      "pk": 34001010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 10,
      "text": "But the chief official said to Daniel, “I am afraid of my lord the king, who assigned your food and drink. If he sees you looking weaker than others your age, you will endanger my life with the king.”",
      "links": "<a href='/AIV/01/40/2'>Gen. 40:2</a>",
      "comment": "The official’s fear underlines the uncompromising power of earthly rulers—but God’s servants are called to a higher loyalty. Compare with Peter and John before the council (Acts 4:19)."
    },
    {
      "pk": 34001011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 11,
      "text": "Then Daniel said to the steward whom the chief official had appointed over Daniel, Hananiah, Mishael, and Azariah:",
      "links": "<a href='/AIV/27/1/16'>Dan. 1:16</a>",
      "comment": "This sets the stage for Daniel’s proposal, which trusts both in God’s providence and in prudent action."
    },
    {
      "pk": 34001012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 12,
      "text": "“Please test your servants for ten days. Let us be given only vegetables to eat and water to drink.”",
      "links": "<a href='/AIV/27/1/14'>Dan. 1:14</a>; <a href='/AIV/27/1/15'>Dan. 1:15</a>",
      "comment": "A voluntary fast or abstinence in faithfulness to God’s commands brings blessings. The number ‘ten’ often symbolizes perfection in testing in Scripture (Gen. 24:55)."
    },
    {
      "pk": 34001013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 13,
      "text": "Then let our appearance and the appearance of the youths who eat the king’s food be observed by you, and deal with your servants according to what you see.”",
      "links": "<a href='/AIV/27/1/18'>Dan. 1:18</a>",
      "comment": "Daniel puts full trust in God, allowing evidence to guide the steward. This is both prudent and faithful, showing confidence in God’s tangible blessings for obedience."
    },
    {
      "pk": 34001014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 14,
      "text": "So he listened to them in this matter and tested them for ten days.",
      "links": "<a href='/AIV/27/1/12'>Dan. 1:12</a>",
      "comment": "Faith is matched by obedience—trusting and acting according to God’s law, even when results are unknown."
    },
    {
      "pk": 34001015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 15,
      "text": "At the end of ten days, their appearance was better and healthier than all the youths who ate the king’s food.",
      "links": "<a href='/AIV/19/34/8-10'>Ps. 34:8-10</a>",
      "comment": "God rewards faithfulness beyond expectation. This demonstrates both the temporal and spiritual benefits of obedience, prefiguring the sacraments as outward signs with inward reality."
    },
    {
      "pk": 34001016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 16,
      "text": "So the steward continued to take away their food and wine and gave them vegetables.",
      "links": "<a href='/AIV/27/1/12'>Dan. 1:12</a>",
      "comment": "Persistence in faith and purity is possible even in exile. This quiet witness prepares the way for later, more public confrontations with pagan power."
    },
    {
      "pk": 34001017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 17,
      "text": "To these four youths, God gave learning and skill in every kind of literature and wisdom; and Daniel had understanding in all visions and dreams.",
      "links": "<a href='/AIV/01/41/15-16'>Gen. 41:15-16</a>; <a href='/AIV/27/2/19'>Dan. 2:19</a>",
      "comment": "The source of wisdom is God himself (Jam. 1:5). Daniel’s prophetic gifts foreshadow the later role of discerning spirits and interpreting God’s will for his people (cf. Acts 2:17)."
    },
    {
      "pk": 34001018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 18,
      "text": "At the end of the time set by the king for them to be brought in, the chief official presented them to Nebuchadnezzar.",
      "links": "<a href='/AIV/27/1/5'>Dan. 1:5</a>",
      "comment": "This verse marks the fulfillment of the testing period. It hints at the biblical theme of trial and exaltation, seen also in Joseph’s and David’s stories."
    },
    {
      "pk": 34001019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 19,
      "text": "The king spoke with them, and among them all, none was found like Daniel, Hananiah, Mishael, and Azariah; so they served before the king.",
      "links": "<a href='/AIV/27/2/48-49'>Dan. 2:48-49</a>",
      "comment": "Their special status before the king mirrors God’s unique calling; compare with the apostles' unique role as witnesses (Acts 1:8). God gives grace in response to fidelity."
    },
    {
      "pk": 34001020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 20,
      "text": "In every matter of wisdom and understanding about which the king questioned them, he found them ten times better than all the magicians and enchanters in his entire kingdom.",
      "links": "<a href='/AIV/27/5/11'>Dan. 5:11</a>; <a href='/AIV/01/41/39'>Gen. 41:39</a>",
      "comment": "God’s power surpasses all human wisdom and magic. Divine inspiration is given to the faithful—foreshadowing extraordinary spiritual gifts in the New Covenant (1 Cor. 12:8-10)."
    },
    {
      "pk": 34001021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 1,
      "verse": 21,
      "text": "And Daniel remained there until the first year of King Cyrus.",
      "links": "<a href='/AIV/15/1/1'>Ezra 1:1</a>; <a href='/AIV/27/6/28'>Dan. 6:28</a>",
      "comment": "Daniel’s endurance through successive regimes witnesses to God’s faithfulness across generations. His presence until Cyrus points to the restoration of God’s people (see Ezra 1:1) and a continuity of sacred tradition against all odds."
    }
  ],
  "translatedAt": "2025-12-24T09:27:21.259Z"
}