{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 11,
  "verses": [
    {
      "pk": 11930110,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 1,
      "text": "And in the first year of Darius the Mede, I stood to support and strengthen him.",
      "links": "<a href='/AIV/27/5/31'>Dan. 5:31</a>; <a href='/AIV/27/10/21'>Dan. 10:21</a>",
      "comment": "This verse refers to Daniel's intercessory role, showing heavenly intervention in human affairs."
    },
    {
      "pk": 11930111,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 2,
      "text": "Now I will reveal the truth to you: Three more kings will arise in Persia, and the fourth will be much richer than all the others. When he has gained power through his wealth, he will stir up all against the kingdom of Greece.",
      "links": "<a href='/AIV/27/8/20'>Dan. 8:20</a>; <a href='/AIV/17/1/1'>Est. 1:1</a>",
      "comment": "The prophecy looks ahead to Persian rulers, highlighting God's foresight regarding kingdoms."
    },
    {
      "pk": 11930112,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 3,
      "text": "Then a mighty king will arise, who will rule with great dominion and do as he pleases.",
      "links": "<a href='/AIV/27/8/21'>Dan. 8:21</a>; <a href='/AIV/27/7/6'>Dan. 7:6</a>",
      "comment": "Generally understood as Alexander the Great, whose brief but powerful empire prefigures the brevity of worldly kingdoms."
    },
    {
      "pk": 11930113,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 4,
      "text": "But as soon as he has arisen, his kingdom will be broken and divided toward the four winds of heaven, but not to his descendants, nor with the power he exercised, for his kingdom will be uprooted and given to others.",
      "links": "<a href='/AIV/27/8/8'>Dan. 8:8</a>; <a href='/AIV/27/7/6'>Dan. 7:6</a>",
      "comment": "Alexander's empire splits into four, confirming prophecy. Note the lack of succession, pointing to frailty of human achievement."
    },
    {
      "pk": 11930114,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 5,
      "text": "Then the king of the south will become strong, but one of his commanders will become stronger than him and will rule with great authority.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>",
      "comment": "Often identified as Ptolemy (South) and Seleucus (North). The shifting powers point toward God’s sovereignty."
    },
    {
      "pk": 11930115,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 6,
      "text": "After some years, they will join forces, and the daughter of the king of the south will go to the king of the north to make an alliance. But she will not retain her strength, nor will he or his power endure; she will be given up, along with her attendants, her father, and the one who supported her in those times.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "Dynastic marriages were used to secure peace, but always at risk of political instability."
    },
    {
      "pk": 11930116,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 7,
      "text": "But from the offspring of her roots one will arise in his place, who will come against the army and enter the fortress of the king of the north, and deal with them and prevail.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>",
      "comment": "This demonstrates how God’s plan surpasses human plotting; He uses even family ties within history."
    },
    {
      "pk": 11930117,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 8,
      "text": "He will also carry off gods, metal images, and treasured possessions of silver and gold into Egypt. For some years he will refrain from attacking the king of the north.",
      "links": "<a href='/AIV/27/5/2'>Dan. 5:2</a>; <a href='/AIV/2/12/36'>Exod. 12:36</a>",
      "comment": "The plundering of idols and treasures echoes the Exodus, symbolizing deliverance and true worship."
    },
    {
      "pk": 11930118,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 9,
      "text": "Then the king of the north will invade the territory of the king of the south but will return to his own land.",
      "links": "<a href='/AIV/27/7/5'>Dan. 7:5</a>",
      "comment": "Continual cycles of conflict are characteristic of fallen kingdoms; stability comes only from God."
    },
    {
      "pk": 11930119,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 10,
      "text": "His sons will stir up war and assemble a great army, which will come in and overflow and pass through. Then they will return and wage war until they reach his fortress.",
      "links": "<a href='/AIV/27/7/7'>Dan. 7:7</a>",
      "comment": "Generational wars intensify, amplifying the need for a lasting kingdom, foreshadowing the Establishment of God's Kingdom."
    },
    {
      "pk": 11930120,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 11,
      "text": "Then the king of the south, enraged, will come out and fight the king of the north, who will muster a great multitude, but the multitude will be given into his hand.",
      "links": "<a href='/AIV/27/8/11'>Dan. 8:11</a>",
      "comment": "The pendulum of victory shows the vanity of human ambition apart from God's will."
    },
    {
      "pk": 11930121,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 12,
      "text": "When the multitude is carried off, his heart will be exalted, and he will cast down tens of thousands, but he will not prevail.",
      "links": "<a href='/AIV/27/7/21'>Dan. 7:21</a>",
      "comment": "Pride leads to temporary victory, but ultimate defeat, illustrating the spiritual danger of self-reliance."
    },
    {
      "pk": 11930122,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 13,
      "text": "For the king of the north will again raise a greater army than before, and after several years he will come with a vast force and much equipment.",
      "links": "<a href='/AIV/27/8/24'>Dan. 8:24</a>",
      "comment": "Repeated wars foreshadow spiritual struggles, indicating the necessity for a higher form of peace."
    },
    {
      "pk": 11930123,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 14,
      "text": "In those times, many will rise up against the king of the south, and violent men among your own people will lift themselves up in order to fulfill the vision, but they will fall.",
      "links": "<a href='/AIV/27/8/10'>Dan. 8:10</a>; <a href='/AIV/27/2/44'>Dan. 2:44</a>",
      "comment": "Even among God’s people, some act violently, yet God's vision ultimately prevails. Foretells the need for unity and faithfulness among all believers."
    },
    {
      "pk": 11930124,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 15,
      "text": "Then the king of the north will come and build up siege works and capture a well-fortified city. The forces of the south will not withstand him—not even their best troops—they will have no strength to stand.",
      "links": "<a href='/AIV/27/7/23'>Dan. 7:23</a>",
      "comment": "Fortressed cities cannot guarantee safety; true refuge is found in God's faithfulness."
    },
    {
      "pk": 11930125,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 16,
      "text": "He who comes against him will do as he pleases, and no one will withstand him. He will stand in the glorious land, with destruction in his hand.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>; <a href='/AIV/27/9/16'>Dan. 9:16</a>",
      "comment": "\"Glorious land\" refers to Israel. The text points to future desecration, reminding us of Christ's concern for He is the true Temple (cf. <a href='/AIV/43/2/19'>John 2:19</a>)."
    },
    {
      "pk": 11930126,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 17,
      "text": "He will set his face to come with the strength of his whole kingdom. He will bring terms of peace and will act deceptively. He will give the daughter of women to him for corruption, but she will not stand with him nor be for him.",
      "links": "<a href='/AIV/27/8/25'>Dan. 8:25</a>",
      "comment": "Political intrigue through marriage echoes Genesis 3:15’s conflict. The instability hints at a better union, fulfilled in Christ and His Church (<a href='/AIV/49/5/32'>Eph. 5:32</a>)."
    },
    {
      "pk": 11930127,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 18,
      "text": "After this, he will turn his attention to the coastlands and capture many, but a commander will put an end to his insolence; indeed, he will repay him for his insolence.",
      "links": "<a href='/AIV/27/7/8'>Dan. 7:8</a>",
      "comment": "God uses even gentile commanders to uphold justice—in line with Romans 13:1, reminding us all authority is established by God."
    },
    {
      "pk": 11930128,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 19,
      "text": "Then he will turn toward the fortresses of his own land, but will stumble and fall, and will not be found.",
      "links": "<a href='/AIV/27/5/30'>Dan. 5:30</a>",
      "comment": "The sudden end of a ruler testifies that human pride is worthless before divine judgment."
    },
    {
      "pk": 11930129,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 20,
      "text": "In his place, one will arise who sends an exactor of tribute through the kingdom for its glory. But after a short time, he will be shattered, though neither in anger nor in battle.",
      "links": "<a href='/AIV/27/7/8'>Dan. 7:8</a>",
      "comment": "Change in leadership through financial pressure foreshadows later oppressive regimes, all ultimately subject to God's justice."
    },
    {
      "pk": 11930130,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 21,
      "text": "In his place will arise a contemptible person, to whom royal majesty has not been given. He will come unexpectedly and seize the kingdom by intrigue.",
      "links": "<a href='/AIV/27/8/23'>Dan. 8:23</a>",
      "comment": "Often regarded as Antiochus IV Epiphanes—a prototype of the Antichrist, pointing toward spiritual vigilance against deception (<a href='/AIV/53/2/3'>2 Thess. 2:3</a>)."
    },
    {
      "pk": 11930131,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 22,
      "text": "Armies will be swept away before him and broken, even the prince of the covenant.",
      "links": "<a href='/AIV/27/9/27'>Dan. 9:27</a>; <a href='/AIV/27/8/11'>Dan. 8:11</a>",
      "comment": "\"Prince of the covenant\" hints at sacred leadership—foreshadowing Christ as the ultimate Covenant-Maker."
    },
    {
      "pk": 11930132,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 23,
      "text": "And after making an alliance with him, he will act deceitfully, and he will become strong with only a small people.",
      "links": "<a href='/AIV/27/8/25'>Dan. 8:25</a>",
      "comment": "Subtlety and cunning are condemned; the passage invites readers to seek leaders marked by wisdom and truth, as exemplified in Christ."
    },
    {
      "pk": 11930133,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 24,
      "text": "He will enter peaceably into the richest parts of the province, and he will do what his fathers nor his ancestors have not done, distributing plunder, spoil, and wealth among them. He will plot schemes against strongholds, but only for a time.",
      "links": "<a href='/AIV/27/7/8'>Dan. 7:8</a>",
      "comment": "Redistribution appears appealing but ultimately serves the ruler’s ambition; contrast with Christ’s generous sharing in the Church."
    },
    {
      "pk": 11930134,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 25,
      "text": "He will rouse his strength and courage against the king of the south with a great army. And the king of the south will wage war with a very large and powerful army, but he will not stand, for plots will be devised against him.",
      "links": "<a href='/AIV/27/8/24'>Dan. 8:24</a>",
      "comment": "Plots and betrayals are inseparable from earthly politics, whereas God’s kingdom is marked by steadfast love and unity."
    },
    {
      "pk": 11930135,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 26,
      "text": "Those who eat of his delicacies will break him, and his army will be swept away, and many will fall down slain.",
      "links": "<a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "Inner circles can be sources of betrayal; spiritual application: caution against spiritual pride and division."
    },
    {
      "pk": 11930136,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 27,
      "text": "Both these kings, with hearts bent on evil, will sit at one table and speak lies, but it will not succeed—the end will not yet come at the appointed time.",
      "links": "<a href='/AIV/27/9/27'>Dan. 9:27</a>; <a href='/AIV/27/8/19'>Dan. 8:19</a>",
      "comment": "Human intrigue cannot thwart God’s timetable, reminding us to seek truth and patience in difficult times."
    },
    {
      "pk": 11930137,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 28,
      "text": "He will return to his land with much wealth, but his heart will be set against the holy covenant, and he will act and return to his own land.",
      "links": "<a href='/AIV/27/8/11'>Dan. 8:11</a>; <a href='/AIV/27/9/27'>Dan. 9:27</a>",
      "comment": "Rejection of the covenant foreshadows Christ's New Covenant, which alone fulfills true worship and relationship with God."
    },
    {
      "pk": 11930138,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 29,
      "text": "At the appointed time he will return and come into the south, but this time will not be as before.",
      "links": "<a href='/AIV/27/8/19'>Dan. 8:19</a>",
      "comment": "There are limits to worldly power; the appointed time foreshadows God’s sovereign timing of salvation history."
    },
    {
      "pk": 11930139,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 30,
      "text": "For ships from Kittim will come against him; he will lose heart and turn back, and he will be enraged against the holy covenant and act. He will return and pay attention to those who forsake the holy covenant.",
      "links": "<a href='/AIV/27/4/34'>Dan. 4:34</a>; <a href='/AIV/27/8/13'>Dan. 8:13</a>",
      "comment": "The opposition from \"Kittim\" signals the limits of human ambition; those who break faith face judgment, emphasizing the call to unity in worship."
    },
    {
      "pk": 11930140,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 31,
      "text": "Forces will be sent by him, and they will defile the sanctuary fortress, remove the regular burnt offering, and set up the abomination that causes desolation.",
      "links": "<a href='/AIV/27/9/27'>Dan. 9:27</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>; <a href='/AIV/41/13/14'>Mark 13:14</a>",
      "comment": "The \"abomination\" foreshadows attacks on true worship, with deep christological significance. Jesus references this in His prophecy—pointing to the need for faithfulness to worship instituted by Him."
    },
    {
      "pk": 11930141,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 32,
      "text": "He will seduce with flattery those who violate the covenant, but the people who know their God will stand firm and take action.",
      "links": "<a href='/AIV/27/12/3'>Dan. 12:3</a>; <a href='/AIV/62/2/3'>1 John 2:3</a>",
      "comment": "Faithfulness to God is upheld even in times of persecution—those who truly know God persevere, reminiscent of perseverance by the saints."
    },
    {
      "pk": 11930142,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 33,
      "text": "And those of wisdom among the people will instruct many, though for a time they will fall by sword and flame, captivity and plunder.",
      "links": "<a href='/AIV/27/12/3'>Dan. 12:3</a>; <a href='/AIV/40/5/10'>Matt. 5:10</a>",
      "comment": "Wise teachers endure suffering, a pattern fulfilled in Christ’s apostles. Their witness is foundational for all believers."
    },
    {
      "pk": 11930143,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 34,
      "text": "During their fall they will receive a little help, and many will join them insincerely.",
      "links": "<a href='/AIV/40/13/21'>Matt. 13:21</a>",
      "comment": "The presence of insincere followers highlights the need for a properly ordered and united community of faith."
    },
    {
      "pk": 11930144,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 35,
      "text": "Some of those who are wise will fall, to refine them, to purify and make them white, until the time of the end, for it still awaits the appointed time.",
      "links": "<a href='/AIV/27/12/10'>Dan. 12:10</a>; <a href='/AIV/60/1/7'>1 Pet. 1:7</a>",
      "comment": "Suffering purifies believers and foreshadows the doctrines of sanctification and perseverance, culminating in the ultimate restoration."
    },
    {
      "pk": 11930145,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 36,
      "text": "Then the king will act according to his own will; he will exalt himself and magnify himself above every god and speak astonishing things against the God of gods. He will prosper until the indignation is finished, for what is decreed shall be accomplished.",
      "links": "<a href='/AIV/53/2/4'>2 Thess. 2:4</a>; <a href='/AIV/27/8/25'>Dan. 8:25</a>",
      "comment": "Ultimate arrogance against God is seen as prophetic of the final rebellion before the end. The decree of God will always prevail."
    },
    {
      "pk": 11930146,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 37,
      "text": "He will neither regard the gods of his fathers nor the one desired by women, nor any god, for he will magnify himself above all.",
      "links": "<a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "\"The one desired by women\" possibly alludes to the Messiah, the hope of Israel. The king’s rejection prefigures the world’s rejection of Christ."
    },
    {
      "pk": 11930147,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 38,
      "text": "Instead, he will honor the god of fortresses, a god his fathers did not know. He shall honor them with gold, silver, precious stones, and costly gifts.",
      "links": "<a href='/AIV/27/8/12'>Dan. 8:12</a>",
      "comment": "Worship of power and military strength runs contrary to God’s demands for humility and trust in Him."
    },
    {
      "pk": 11930148,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 39,
      "text": "He will deal with the strongest fortresses by the help of a foreign god. To those who acknowledge him, he will grant honor, make them rulers over many, and distribute land as a reward.",
      "links": "<a href='/AIV/27/7/24'>Dan. 7:24</a>",
      "comment": "Alliance based on political reward and land grants points to the danger of divided loyalty; unity is essential for God’s people."
    },
    {
      "pk": 11930149,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 40,
      "text": "At the time of the end, the king of the south will attack him, but the king of the north will storm out against him with chariots, horsemen, and many ships. He will invade countries and sweep through like a flood.",
      "links": "<a href='/AIV/27/9/26'>Dan. 9:26</a>",
      "comment": "Great armies and warfare at the end, fulfilling apocalyptic themes and foreshadowing the final battle in Revelation (<a href='/AIV/66/19/19'>Rev. 19:19</a>)."
    },
    {
      "pk": 11930150,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 41,
      "text": "He will enter the glorious land, and many will stumble, but these will escape out of his hand: Edom, Moab, and the foremost of the sons of Ammon.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>; <a href='/AIV/23/11/14'>Isa. 11:14</a>",
      "comment": "Some neighboring peoples escape for a time, pointing to mysteries of divine justice among the nations of the earth."
    },
    {
      "pk": 11930151,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 42,
      "text": "He will extend his hand against countries, and the land of Egypt will not escape.",
      "links": "<a href='/AIV/26/30/6'>Ezek. 30:6</a>",
      "comment": "Universal reach of this king’s power compared to the universal kingship of Christ, whose rule brings perfect justice and peace."
    },
    {
      "pk": 11930152,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 43,
      "text": "He will gain control over all the treasures of gold and silver and all the precious things of Egypt, and the Libyans and Cushites will follow at his heels.",
      "links": "<a href='/AIV/27/8/9'>Dan. 8:9</a>",
      "comment": "Riches and power serve worldly purposes, but in God’s kingdom, they are used for the good of all (cf. <a href='/AIV/44/4/34'>Acts 4:34</a>)."
    },
    {
      "pk": 11930153,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 44,
      "text": "But rumors from the east and the north will disturb him, and he will go out with great fury to destroy and annihilate many.",
      "links": "<a href='/AIV/66/16/12'>Rev. 16:12</a>",
      "comment": "Fears and threats provoke destructive actions; contrast to Christ’s peace and the tranquility of true faith."
    },
    {
      "pk": 11930154,
      "translation": "AIV",
      "book": 27,
      "chapter": 11,
      "verse": 45,
      "text": "He will pitch his royal tents between the sea and the glorious holy mountain, but he will come to his end, with no one to help him.",
      "links": "<a href='/AIV/27/8/25'>Dan. 8:25</a>; <a href='/AIV/66/20/9'>Rev. 20:9</a>",
      "comment": "Final defeat of the pretender at the holy mountain alludes to proud powers vanquished before God’s truth on Zion. Christ, who establishes His Kingdom in Jerusalem, stands as the true fulfillment (<a href='/AIV/23/2/2-4'>Isa. 2:2-4</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:18:45.347Z"
}