{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 9,
  "verses": [
    {
      "pk": 2093090,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 1,
      "text": "In the first year of Darius the son of Ahasuerus, by lineage a Mede, who was made king over the realm of the Chaldeans—",
      "links": "<a href='/AIV/27/5/31'>Dan. 5:31</a>; <a href='/AIV/27/6/1'>Dan. 6:1</a>",
      "comment": "Daniel sets the historical context, indicating the period after Babylon fell. This prepares for Daniel’s prayer of repentance and the subsequent prophecy."
    },
    {
      "pk": 2093091,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 2,
      "text": "in the first year of his reign, I, Daniel, understood from the books that the word of the LORD had come to Jeremiah the prophet, that the desolations of Jerusalem would last seventy years.",
      "links": "<a href='/AIV/24/25/11-12'>Jer. 25:11–12</a>; <a href='/AIV/24/29/10'>Jer. 29:10</a>",
      "comment": "Daniel references Jeremiah’s prophecy about the seventy-year exile. This demonstrates reverence for earlier scriptures and links the continuity of God’s plan through His prophets."
    },
    {
      "pk": 2093092,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 3,
      "text": "So I turned my face to the Lord God, seeking Him with prayer and supplications, with fasting, sackcloth, and ashes.",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>; <a href='/AIV/29/2/12'>Joel 2:12</a>",
      "comment": "Daniel models earnest repentance through prayer and acts of humility, suggesting the value of penitential practices and sacrificial prayer in seeking God’s mercy."
    },
    {
      "pk": 2093093,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 4,
      "text": "I prayed to the LORD my God and confessed, saying, 'O Lord, the great and awesome God, who keeps covenant and steadfast love with those who love Him and keep His commandments,",
      "links": "<a href='/AIV/05/7/9'>Deut. 7:9</a>; <a href='/AIV/02/34/6-7'>Ex. 34:6-7</a>",
      "comment": "Daniel’s prayer begins with the acknowledgment of God’s character and covenant faithfulness—an appeal to God’s lovingkindness toward those who are obedient."
    },
    {
      "pk": 2093094,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 5,
      "text": "'We have sinned and done wrong, acted wickedly and rebelled, turning aside from Your commandments and rules.",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>; <a href='/AIV/19/51/3'>Ps. 51:3</a>",
      "comment": "Daniel identifies himself with the sins of his people, teaching corporate contrition. The confession highlights the seriousness of departing from God’s law."
    },
    {
      "pk": 2093095,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 6,
      "text": "'We have not listened to Your servants the prophets, who spoke in Your name to our kings, princes, our fathers, and to all the people of the land.",
      "links": "<a href='/AIV/24/25/4'>Jer. 25:4</a>; <a href='/AIV/14/36/15-16'>2 Chr. 36:15-16</a>",
      "comment": "Ignoring God’s prophets signified rebellion, a recurring Old Testament theme. The importance of the prophetic ministry and receptive obedience is central."
    },
    {
      "pk": 2093096,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 7,
      "text": "'To You, O Lord, belongs righteousness, but to us belongs shame of face, as is the case this day for the men of Judah, the inhabitants of Jerusalem, and all Israel, near and far, whom You have driven because of the unfaithfulness they committed against You.",
      "links": "<a href='/AIV/19/44/15'>Ps. 44:15</a>; <a href='/AIV/16/9/33'>Neh. 9:33-34</a>",
      "comment": "God’s justice is contrasted with human failure. This acknowledgment of corporate guilt demonstrates the seriousness of covenant breach."
    },
    {
      "pk": 2093097,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 8,
      "text": "'O Lord, to us belongs shame of face—to our kings, our princes, and our fathers—because we have sinned against You.",
      "links": "<a href='/AIV/19/74/9'>Ps. 74:9</a>",
      "comment": "Daniel emphasizes that no one, regardless of position, is exempt from guilt. Leaders and ancestors share in responsibility, showing the unity and solidarity of Israel."
    },
    {
      "pk": 2093098,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 9,
      "text": "'To the Lord our God belong mercy and forgiveness, for we have rebelled against Him.",
      "links": "<a href='/AIV/19/130/4'>Ps. 130:4</a>; <a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "God’s willingness to forgive, even while acknowledging rebellion, displays the depth of divine mercy and willingness to restore."
    },
    {
      "pk": 2093099,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 10,
      "text": "'We have not obeyed the voice of the LORD our God by walking in His laws set before us by His servants the prophets.",
      "links": "<a href='/AIV/03/26/14'>Lev. 26:14</a>; <a href='/AIV/24/11/7-8'>Jer. 11:7-8</a>",
      "comment": "The prophetic and priestly role of both law and proclamation is elevated. Failure to listen and obey is noted as the root cause of exile."
    },
    {
      "pk": 2093100,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 11,
      "text": "All Israel has transgressed Your law and turned aside, refusing to obey Your voice. Because of this, the curse and oath written in the Law of Moses the servant of God has been poured out on us, for we have sinned against Him.",
      "links": "<a href='/AIV/05/28/15'>Deut. 28:15</a>; <a href='/AIV/03/26/14-46'>Lev. 26:14–46</a>",
      "comment": "Daniel points to the covenant curses as consequences for disobedience. This is a direct fulfillment of the warnings in the Torah, emphasizing the seriousness of keeping covenant."
    },
    {
      "pk": 2093101,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 12,
      "text": "He has confirmed His words that He spoke against us and against our rulers, by bringing a great disaster upon us. For under the whole heaven nothing has ever been done like what was done to Jerusalem.",
      "links": "<a href='/AIV/25/1/12'>Lam. 1:12</a>; <a href='/AIV/14/36/17-20'>2 Chr. 36:17–20</a>",
      "comment": "Daniel affirms that Jerusalem’s devastation was the explicit result of God’s judgment, unique in its severity."
    },
    {
      "pk": 2093102,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 13,
      "text": "As it is written in the Law of Moses, all this disaster has come upon us. Yet we have not sought the favor of the LORD our God by turning from our iniquities and giving attention to Your truth.",
      "links": "<a href='/AIV/05/29/20-28'>Deut. 29:20–28</a>",
      "comment": "Even after experiencing the consequences, Israel failed to turn wholeheartedly to God, emphasizing repentance as the necessary response to discipline."
    },
    {
      "pk": 2093103,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 14,
      "text": "Therefore the LORD has kept the disaster in store and brought it upon us. For the LORD our God is righteous in all He does, yet we have not obeyed His voice.",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>; <a href='/AIV/05/32/4'>Deut. 32:4</a>",
      "comment": "God’s justice is affirmed, while the human responsibility in failure is repeated. The pattern of warning-punishment-repentance is foundational to biblical narrative."
    },
    {
      "pk": 2093104,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 15,
      "text": "Now, O Lord our God, who brought Your people out of Egypt with a mighty hand and made Yourself a name, as it is this day—we have sinned, we have acted wickedly.",
      "links": "<a href='/AIV/02/32/11-14'>Ex. 32:11–14</a>; <a href='/AIV/19/106/21-22'>Ps. 106:21–22</a>",
      "comment": "Daniel recalls the Exodus as a paradigm of deliverance, appealing to God’s past acts as the basis for seeking restoration—pointing to the importance of historical memory in repentance."
    },
    {
      "pk": 2093105,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 16,
      "text": "O Lord, according to all Your righteous acts, let Your anger and wrath turn away from Your city Jerusalem, Your holy hill, because of our sins and the iniquities of our fathers. Jerusalem and Your people have become a disgrace among all those around us.",
      "links": "<a href='/AIV/19/79/4'>Ps. 79:4</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Daniel appeals for mercy based on God’s righteousness, focusing on the restoration of Jerusalem—the center of worship and God’s dwelling among His people."
    },
    {
      "pk": 2093106,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 17,
      "text": "Now therefore, O our God, listen to the prayer and petition of Your servant, and for Your sake, O Lord, let Your face shine upon Your desolate sanctuary.",
      "links": "<a href='/AIV/19/80/3'>Ps. 80:3</a>; <a href='/AIV/04/6/25'>Num. 6:25</a>",
      "comment": "Daniel prays for the restoration of God’s sanctuary—emphasizing the enduring importance of worship in a consecrated place."
    },
    {
      "pk": 2093107,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 18,
      "text": "Incline Your ear, my God, and hear; open Your eyes and see our desolations, and the city that bears Your name. We do not present our pleas before You because of our righteousness but because of Your great mercy.",
      "links": "<a href='/AIV/19/143/1'>Ps. 143:1</a>; <a href='/AIV/19/31/16'>Ps. 31:16</a>",
      "comment": "Daniel appeals not to merit but to the sheer mercy of God—a reminder that grace, not works, is ultimately the basis for restoration."
    },
    {
      "pk": 2093108,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 19,
      "text": "O Lord, hear! O Lord, forgive! O Lord, pay attention and act! Do not delay, for Your own sake, my God, because Your city and Your people are called by Your name.",
      "links": "<a href='/AIV/19/69/17'>Ps. 69:17</a>; <a href='/AIV/19/25/11'>Ps. 25:11</a>",
      "comment": "The urgent triple appeal for God to act highlights the passionate intercessor’s heart. God’s reputation and His people are intimately connected."
    },
    {
      "pk": 2093109,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 20,
      "text": "While I was speaking, praying, confessing my sin and the sin of my people Israel, and presenting my petition before the LORD my God for the holy mountain of my God,",
      "links": "<a href='/AIV/19/51/1-2'>Ps. 51:1–2</a>; <a href='/AIV/27/9/3'>Dan. 9:3</a>",
      "comment": "Daniel’s focus on intercession for the holy mountain demonstrates the significance of sacred places in divine-human encounters."
    },
    {
      "pk": 2093110,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 21,
      "text": "while I was still in prayer, Gabriel, whom I had seen in the earlier vision, came swiftly to me at the time of the evening sacrifice.",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>; <a href='/AIV/02/29/39'>Ex. 29:39</a>",
      "comment": "The appearance of Gabriel, an angelic messenger, occurs at the time of daily sacrifice, showing continued liturgical rhythms—even during exile."
    },
    {
      "pk": 2093111,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 22,
      "text": "He made me understand, speaking with me and saying, 'Daniel, I have come now to give you insight and understanding.",
      "links": "<a href='/AIV/27/10/12'>Dan. 10:12</a>",
      "comment": "Gabriel’s instructional role echoes Old Testament angelic revelations, anticipating patterns of supernatural guidance in salvation history."
    },
    {
      "pk": 2093112,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 23,
      "text": "At the beginning of your pleas, a word went out, and I have come to tell you, for you are greatly loved. So consider the word and understand the vision:",
      "links": "<a href='/AIV/27/10/11'>Dan. 10:11</a>; <a href='/AIV/27/10/19'>Dan. 10:19</a>",
      "comment": "Daniel is called 'greatly loved,' highlighting God's favor upon those who are devoted in prayer. The immediacy of heaven’s response to intercession is shown."
    },
    {
      "pk": 2093113,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 24,
      "text": "'Seventy weeks are decreed upon your people and your holy city, to finish transgression, to make an end of sin, to atone for iniquity, to bring in everlasting righteousness, to seal up vision and prophecy, and to anoint the Most Holy.",
      "links": "<a href='/AIV/27/8/14'>Dan. 8:14</a>; <a href='/AIV/23/53/5'>Isa. 53:5</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "The prophecy of 'seventy weeks' is widely regarded as messianic. Bringing an end to sin and atonement points forward to the Messiah’s sacrifice, with layers of literal and spiritual fulfillment."
    },
    {
      "pk": 2093114,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 25,
      "text": "Know and understand: From the going forth of the word to restore and rebuild Jerusalem until the Anointed One, the ruler, comes, there will be seven weeks and sixty-two weeks. It will be rebuilt with plaza and moat, but in troubled times.",
      "links": "<a href='/AIV/16/2/1-8'>Neh. 2:1–8</a>; <a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "'Anointed One' is a title for the Messiah. The timeline is interpreted by many as pointing to Christ, linking prophecy and fulfillment in divine history."
    },
    {
      "pk": 2093115,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 26,
      "text": "After the sixty-two weeks, the Anointed One will be cut off and will have nothing. The people of the ruler who is to come will destroy the city and the sanctuary. The end will come like a flood, and desolations are decreed until the end of the war.",
      "links": "<a href='/AIV/23/53/8'>Isa. 53:8</a>; <a href='/AIV/40/24/2'>Matt. 24:2</a>",
      "comment": "A clear prophecy that the Messiah will suffer—a theme fulfilled in Christ’s crucifixion (Isa. 53). The destruction of the temple in AD 70 is a corresponding historical event."
    },
    {
      "pk": 2093116,
      "translation": "AIV",
      "book": 27,
      "chapter": 9,
      "verse": 27,
      "text": "He will confirm a covenant with many for one week, but in the middle of the week, he will put an end to sacrifice and offering. And on the wing of abominations shall come one who makes desolate, until the end that is decreed is poured out on the desolator.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The 'covenant' and cessation of sacrifice are interpreted decades later as signifying Christ’s new covenant, accomplished in the Passion. Daniel speaks to historical and spiritual fulfillment—a pattern continued in Church history."
    }
  ],
  "translatedAt": "2025-12-23T07:17:38.851Z"
}