{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 7,
  "verses": [
    {
      "pk": 2707001,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 1,
      "text": "In the first year of Belshazzar, king of Babylon, Daniel saw a dream and visions passed through his mind as he lay in bed. Then he wrote down the dream, giving a summary of the matters.",
      "links": "<a href='/AIV/27/2/28'>Dan. 2:28</a>",
      "comment": "Daniel specifically notes the time and king to anchor this vision historically, suggesting its reliability and divine origin (cf. Dan. 2:28 – God reveals mysteries)."
    },
    {
      "pk": 2707002,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 2,
      "text": "Daniel said: I saw in my vision by night, and behold, the four winds of heaven were stirring up the great sea.",
      "links": "<a href='/AIV/27/8/8'>Dan. 8:8</a>; <a href='/AIV/66/17/15'>Rev. 17:15</a>",
      "comment": "The 'sea' often represents the chaotic nations (Rev. 17:15), while the 'four winds' symbolize universal scope, pointing to God's sovereignty over all nations."
    },
    {
      "pk": 2707003,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 3,
      "text": "And four great beasts came up out of the sea, each different from the other.",
      "links": "<a href='/AIV/27/8/20-22'>Dan. 8:20-22</a>",
      "comment": "The four beasts represent four successive kingdoms, an idea echoed later in Daniel 8. The imagery also historically points to empires that rise from among the gentile nations."
    },
    {
      "pk": 2707004,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 4,
      "text": "The first was like a lion and had eagle’s wings. I looked until its wings were torn off, and it was lifted up from the earth and made to stand on two feet like a man, and a human mind was given to it.",
      "links": "<a href='/AIV/27/4/16'>Dan. 4:16</a>; <a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "Traditionally interpreted as Babylon; the transformation recalls Nebuchadnezzar’s humbling and restoration (Dan. 4:16). The 'human mind' points to restoration and a unique dignity among the beasts."
    },
    {
      "pk": 2707005,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 5,
      "text": "And behold, another beast, a second, like a bear. It was raised up on one side, and had three ribs in its mouth between its teeth. It was told, ‘Arise, devour much flesh!’",
      "links": "<a href='/AIV/27/8/20'>Dan. 8:20</a>",
      "comment": "The bear is most commonly linked to Medo-Persia, emphasized by the 'raised up on one side' (the Persian dominance) and its command to 'devour' suggests conquest."
    },
    {
      "pk": 2707006,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 6,
      "text": "After this I looked, and behold, another, like a leopard, with four wings of a bird on its back. And the beast had four heads, and dominion was given to it.",
      "links": "<a href='/AIV/27/8/21-22'>Dan. 8:21-22</a>",
      "comment": "This beast is often connected to the Greek Empire (especially Alexander the Great) due to its speed (wings) and division into four regions after Alexander's death (four heads). Dominion 'given' implies a higher authority granting rule."
    },
    {
      "pk": 2707007,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 7,
      "text": "After this I saw in the night visions, and behold, a fourth beast, terrifying and dreadful and exceedingly strong. It had great iron teeth; it devoured and broke in pieces and trampled what was left with its feet. It was different from all the beasts that were before it, and it had ten horns.",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The fourth beast is usually linked to Rome – it's described in terms echoed in Daniel 2:40 (iron legs, crushing power) and Revelation 13. Ten horns suggest a confederation or succession of powers."
    },
    {
      "pk": 2707008,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 8,
      "text": "I considered the horns, and behold, another horn, a little one, came up among them, and three of the first horns were uprooted before it. And behold, in this horn were eyes like the eyes of a man, and a mouth speaking great things.",
      "links": "<a href='/AIV/66/13/5-6'>Rev. 13:5-6</a>; <a href='/AIV/53/2/3-4'>2 Thess. 2:3-4</a>",
      "comment": "The 'little horn' is understood by many as a prefigurement of the antichrist: blasphemous and aggressive against God’s people. The motif recurs in Revelation and 2 Thessalonians."
    },
    {
      "pk": 2707009,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 9,
      "text": "As I looked, thrones were set in place, and the Ancient of Days took His seat. His clothing was white as snow, and the hair of His head like pure wool; His throne was fiery flames, its wheels burning fire.",
      "links": "<a href='/AIV/66/1/14'>Rev. 1:14</a>; <a href='/AIV/26/1/26'>Ezek. 1:26-28</a>",
      "comment": "A majestic and transcendent vision of the eternal God presiding in judgment. The purity and fire imagery (see also Rev. 1:14) show holiness and consuming justice, as in the Old and New Testaments."
    },
    {
      "pk": 2707010,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 10,
      "text": "A river of fire flowed out from before Him; thousands upon thousands served Him, and ten thousand times ten thousand stood before Him. The court sat in judgment, and the books were opened.",
      "links": "<a href='/AIV/66/5/11'>Rev. 5:11</a>; <a href='/AIV/20/20/12'>Prov. 20:12</a>; <a href='/AIV/27/12/1'>Dan. 12:1</a>",
      "comment": "The scene mirrors final judgment imagery: multitudes serve God, the 'books' are opened (see Rev. 20:12), and the court is ready – anticipating a future resurrection and judgment."
    },
    {
      "pk": 2707011,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 11,
      "text": "I looked then because of the sound of the great words that the horn was speaking. And as I watched, the beast was killed, and its body destroyed and given over to be burned with fire.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The boastful horn is ultimately judged and destroyed, paralleling the overthrow of evil powers prophesied in Revelation."
    },
    {
      "pk": 2707012,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 12,
      "text": "As for the rest of the beasts, their dominion was taken away, but their lives were prolonged for a season and a time.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "The end of earthly empires is ultimately determined by God’s timing. They lose dominion but are permitted some continued existence for a period, emphasizing God’s sovereignty."
    },
    {
      "pk": 2707013,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 13,
      "text": "I saw in the night visions, and behold, with the clouds of heaven there came one like a Son of Man, and He came to the Ancient of Days and was presented before Him.",
      "links": "<a href='/AIV/40/26/64'>Matt. 26:64</a>; <a href='/AIV/66/1/7'>Rev. 1:7</a>",
      "comment": "This 'Son of Man' prophecy is foundational for New Testament Christology. Jesus repeatedly identifies Himself as the Son of Man and references this passage, indicating His divinely conferred authority (cf. Matt. 26:64). The 'clouds' are symbols of divinity and heavenly authority."
    },
    {
      "pk": 2707014,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 14,
      "text": "And to Him was given dominion and glory and a kingdom, that all peoples, nations, and languages should serve Him; His dominion is an everlasting dominion, which shall not pass away, and His kingdom one that shall not be destroyed.",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "The universal and everlasting kingdom given to the Son of Man is the fulfillment of the divine kingdom anticipated throughout Scripture (Dan. 2:44; Rev. 11:15), prefiguring the spiritual and visible unity of all believers under Christ’s reign."
    },
    {
      "pk": 2707015,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 15,
      "text": "As for me, Daniel, my spirit was distressed within me, and the visions in my head troubled me.",
      "links": "<a href='/AIV/27/4/5'>Dan. 4:5</a>",
      "comment": "Daniel’s reaction underscores both the gravity and mystery of prophetic revelation; even the prophet finds the vision daunting and in need of divine interpretation, much as other visionaries in the Bible do."
    },
    {
      "pk": 2707016,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 16,
      "text": "I approached one of those who stood there and asked him the truth concerning all this. So he made known to me the interpretation of the things.",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>; <a href='/AIV/66/7/13-14'>Rev. 7:13-14</a>",
      "comment": "Angelic interpretation of visions is a biblical pattern (Dan. 8:16; Rev. 7:13-14), signifying God's intention for His people to receive understanding through divinely appointed messengers."
    },
    {
      "pk": 2707017,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 17,
      "text": "These four great beasts are four kings who shall arise from the earth.",
      "links": "<a href='/AIV/27/8/20-22'>Dan. 8:20-22</a>",
      "comment": "The angel’s summary affirms the explicitly historical aspect: four successive kingdoms on earth. This reading underlines the pattern of God's providence in human history."
    },
    {
      "pk": 2707018,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 18,
      "text": "But the saints of the Most High shall receive the kingdom and possess the kingdom forever, forever and ever.",
      "links": "<a href='/AIV/66/22/5'>Rev. 22:5</a>",
      "comment": "Here ‘saints’ refers to God’s faithful people, destined to inherit the everlasting kingdom, a hope reiterated at the end of Scripture (Rev. 22:5). Both spiritual and literal interpretations point to the persevering faith of the Church through history."
    },
    {
      "pk": 2707019,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 19,
      "text": "Then I desired to know the truth about the fourth beast, which was different from all the rest, exceedingly frightening, with its teeth of iron and claws of bronze, which devoured, broke in pieces, and trampled what was left with its feet;",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>",
      "comment": "The distinctiveness and violence of the fourth beast underscore its role as a unique threat, often seen as an intensification of human kingdoms in opposition to God’s rule."
    },
    {
      "pk": 2707020,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 20,
      "text": "and about the ten horns that were on its head and the other horn that came up and before which three of them fell—the horn that had eyes and a mouth that spoke great things, and seemed greater than its companions.",
      "links": "<a href='/AIV/66/17/12'>Rev. 17:12</a>",
      "comment": "The focus on the arrogant little horn connects to wider biblical themes about anti-divine powers that arise in history and challenge the faithful, to be overcome by God’s eventual intervention."
    },
    {
      "pk": 2707021,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 21,
      "text": "As I looked, this horn made war with the saints and prevailed against them,",
      "links": "<a href='/AIV/66/13/7'>Rev. 13:7</a>",
      "comment": "Parallels with Revelation 13:7 suggest a recurring biblical theme: the suffering of God’s people at the hands of unjust powers before ultimate deliverance."
    },
    {
      "pk": 2707022,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 22,
      "text": "until the Ancient of Days came, and judgment was given for the saints of the Most High, and the time came when the saints possessed the kingdom.",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "The arrival of the Ancient of Days signals the definitive vindication and reign of the faithful. The pattern is both prophetic and eschatological, looking toward the ultimate union of God’s justice and His people’s victory."
    },
    {
      "pk": 2707023,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 23,
      "text": "Thus he said: ‘The fourth beast shall be a fourth kingdom on earth, which shall be different from all the kingdoms, and shall devour the whole earth, trample it down, and break it to pieces.",
      "links": "<a href='/AIV/27/2/40'>Dan. 2:40</a>",
      "comment": "This direct interpretation confirms the earlier vision: the fourth kingdom’s global reach is unique. Often seen as Rome, its destructive power is a motif echoed throughout biblical prophecy."
    },
    {
      "pk": 2707024,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 24,
      "text": "As for the ten horns, out of this kingdom ten kings shall arise, and another shall arise after them; he shall be different from the former ones, and shall put down three kings.",
      "links": "<a href='/AIV/66/17/12'>Rev. 17:12</a>",
      "comment": "The ten horns/kings, paralleled in Revelation, represent a succession or coalition of rulers leading to a climactic challenge to God’s people."
    },
    {
      "pk": 2707025,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 25,
      "text": "He shall speak words against the Most High, and shall wear out the saints of the Most High, and shall think to change the times and the law; and they shall be given into his hand for a time, times, and half a time.",
      "links": "<a href='/AIV/66/13/5-7'>Rev. 13:5-7</a>; <a href='/AIV/27/12/7'>Dan. 12:7</a>",
      "comment": "The repeated phrase 'time, times, and half a time' recurs in Daniel and Revelation, indicating a defined, limited period of trial allowed by God. The attempt to alter law and worship subtly points to conflict over liturgy and faithful endurance within the Church through history."
    },
    {
      "pk": 2707026,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 26,
      "text": "But the court shall sit in judgment, and his dominion shall be taken away, to be consumed and destroyed to the end.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "Ultimate judgment comes from God alone, regardless of earthly opposition, ensuring that evil powers are decisively overcome at the end of the age."
    },
    {
      "pk": 2707027,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 27,
      "text": "And the kingdom and the dominion and the greatness of the kingdoms under all heaven shall be given to the people of the saints of the Most High; His kingdom shall be an everlasting kingdom, and all dominions shall serve and obey Him.",
      "links": "<a href='/AIV/66/22/5'>Rev. 22:5</a>; <a href='/AIV/27/2/44-45'>Dan. 2:44-45</a>",
      "comment": "This climactic promise echoes the hope of an unending, universal Kingdom—spiritual and visible—entrusted to God's people. This hints at the perpetual nature and visible authority of the Church as it carries forth God’s kingdom on earth."
    },
    {
      "pk": 2707028,
      "translation": "AIV",
      "book": 27,
      "chapter": 7,
      "verse": 28,
      "text": "At this point the matter ended. As for me, Daniel, my thoughts greatly troubled me and my face turned pale, but I kept the matter in my heart.",
      "links": "<a href='/AIV/27/8/27'>Dan. 8:27</a>; <a href='/AIV/42/2/19'>Luke 2:19</a>",
      "comment": "Daniel’s resolve to 'keep the matter in his heart' is mirrored in Luke 2:19—pondering divine mysteries inwardly is a sign of contemplative faith, encouraging the faithful to trust God’s revealed will over time."
    }
  ],
  "translatedAt": "2025-12-23T07:16:43.598Z"
}