{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 12,
  "verses": [
    {
      "pk": 2101231,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 1,
      "text": "At that time, Michael, the great prince who stands guard over the sons of your people, will arise. And there will be a time of trouble such as has never happened since there was a nation until that time. But at that time your people, everyone who is found written in the book, will be delivered.",
      "links": "<a href='/AIV/65/1/9'>Jude 1:9</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>; <a href='/AIV/40/24/21'>Matt. 24:21</a>",
      "comment": "Michael is a chief angelic protector. The 'book' refers to the book of life, where the righteous are recorded (see Revelation 20:12). Jesus references a similar unparalleled time of trouble in Matthew 24:21. The implication is deliverance is assured for those enduring in faith and belonging to God's people."
    },
    {
      "pk": 2101232,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 2,
      "text": "And many of those who sleep in the dust of the earth will awake, some to everlasting life, and some to shame and everlasting contempt.",
      "links": "<a href='/AIV/43/5/28-29'>John 5:28–29</a>; <a href='/AIV/66/20/13-15'>Rev. 20:13–15</a>",
      "comment": "This is one of the clearest Old Testament references to the general resurrection of the dead, a teaching affirmed in the New Testament (John 5:28–29). This points toward bodily resurrection and eternal destinies, foreshadowing the final judgment."
    },
    {
      "pk": 2101233,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 3,
      "text": "Those who are wise will shine like the brightness of the sky above; and those who turn many to righteousness, like the stars forever and ever.",
      "links": "<a href='/AIV/40/13/43'>Matt. 13:43</a>; <a href='/AIV/50/2/15'>Phil. 2:15</a>",
      "comment": "Righteousness and wisdom have an everlasting reward — a shining, enduring glory. Jesus refers to the righteous shining in his kingdom (Matthew 13:43). Those who lead others to righteousness echo the role of teaching and sanctifying in the community of faith."
    },
    {
      "pk": 2101234,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 4,
      "text": "But you, Daniel, shut up the words and seal the scroll until the time of the end. Many will run to and fro, and knowledge will increase.",
      "links": "<a href='/AIV/27/8/26'>Dan. 8:26</a>; <a href='/AIV/66/22/10'>Rev. 22:10</a>",
      "comment": "Daniel is told to seal the book, indicating the prophecy's full meaning would be revealed at the end. Similar language appears in Revelation. An increase in knowledge likely means both spiritual and prophetic understanding growing as the 'end' approaches."
    },
    {
      "pk": 2101235,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 5,
      "text": "Then I, Daniel, looked, and behold, two others stood, one on this bank of the river and one on the other bank of the river.",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>",
      "comment": "Daniel witnesses heavenly figures by the river. The vision recalls previous angelic appearances in Daniel, reinforcing the seriousness and divine origin of the message."
    },
    {
      "pk": 2101236,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 6,
      "text": "And one said to the man clothed in linen, who was above the waters of the river, 'How long shall it be to the end of these wonders?'",
      "links": "<a href='/AIV/66/10/5'>Rev. 10:5</a>; <a href='/AIV/27/10/5'>Dan. 10:5</a>",
      "comment": "The 'man clothed in linen' (see Daniel 10:5) is a figure of authority, possibly angelic or a pre-incarnate Christ. The question of 'how long' appears throughout prophecy, searching for when God's plans will complete."
    },
    {
      "pk": 2101237,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 7,
      "text": "And I heard the man clothed in linen, who was above the waters of the river. He raised his right hand and his left hand toward heaven and swore by Him who lives forever that it will be for a time, times, and half a time; and when the shattering of the power of the holy people comes to an end, all these things will be finished.",
      "links": "<a href='/AIV/27/7/25'>Dan. 7:25</a>; <a href='/AIV/66/12/14'>Rev. 12:14</a>",
      "comment": "The oath emphasizes the certainty of the prophetic timeline ('a time, times, and half a time' symbolizing three and a half years). The 'holy people' suffering before vindication is a motif foreshadowing persecution of the faithful before final deliverance."
    },
    {
      "pk": 2101238,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 8,
      "text": "I heard, but I did not understand. So I said, 'My lord, what will be the outcome of these things?'",
      "links": "<a href='/AIV/27/8/15'>Dan. 8:15</a>",
      "comment": "Daniel's honest questioning demonstrates human limitation in grasping the fullness of God's plan. Prophetic revelation often leaves some mystery, which invites faith and ongoing seeking."
    },
    {
      "pk": 2101239,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 9,
      "text": "He said, 'Go your way, Daniel, for the words are shut up and sealed until the time of the end.'",
      "links": "<a href='/AIV/66/22/10'>Rev. 22:10</a>",
      "comment": "Daniel is reassured that the meaning will unfold at the right time. Divine revelation is sometimes progressive, requiring patience and trust in God’s unfolding plan through history."
    },
    {
      "pk": 2101240,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 10,
      "text": "Many will be purified, made white, and refined, but the wicked will act wickedly. None of the wicked will understand, but those who are wise will understand.",
      "links": "<a href='/AIV/66/7/13-14'>Rev. 7:13–14</a>; <a href='/AIV/19/92/6'>Ps. 92:6</a>",
      "comment": "Refinement by trial prepares the righteous, making them ‘white’—imagery carried into the New Testament regarding saints (Rev. 7:14). Wisdom is both intellectual and spiritual, produced through prayer, faithfulness, and tradition."
    },
    {
      "pk": 2101241,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 11,
      "text": "From the time that the regular burnt offering is taken away and the abomination that causes desolation is set up, there will be one thousand two hundred ninety days.",
      "links": "<a href='/AIV/27/8/11-13'>Dan. 8:11–13</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The removal of the continual sacrifice and the 'abomination' mark a key prophetic period. This timeframe (1290 days) holds significance for understanding times of persecution and links to Jesus' warning about the abomination of desolation in Matthew 24:15."
    },
    {
      "pk": 2101242,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 12,
      "text": "Blessed is the one who waits and reaches the end of the one thousand three hundred thirty-five days.",
      "links": "<a href='/AIV/66/14/12'>Rev. 14:12</a>",
      "comment": "Perseverance is blessed. The specific numbers invite trusting God’s timing and providence. Waiting hints at steadfastness and faithfulness through trial, concepts later called virtues and integral to the tradition of the historic Church."
    },
    {
      "pk": 2101243,
      "translation": "AIV",
      "book": 27,
      "chapter": 12,
      "verse": 13,
      "text": "But as for you, go your way until the end; for you shall rest, and will arise for your allotted portion at the end of the days.",
      "links": "<a href='/AIV/23/26/19'>Isa. 26:19</a>; <a href='/AIV/43/11/24'>John 11:24</a>",
      "comment": "Daniel is promised rest (death), followed by resurrection and reward. This affirms belief in personal resurrection and the assurance of receiving an inheritance prepared by God, echoing New Testament hope in the final resurrection."
    }
  ],
  "translatedAt": "2025-12-23T07:19:08.010Z"
}