{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 8,
  "verses": [
    {
      "pk": 34008001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 1,
      "text": "In the third year of King Belshazzar’s reign, I, Daniel, saw a vision that came after the earlier one.",
      "links": "<a href='/AIV/34/7/1'>Dan 7:1</a>; <a href='/AIV/27/1/1'>Ezek 1:1</a>",
      "comment": "Daniel records a second vision from God, underlining the ongoing revelation during the Babylonian exile. The sequence echoes how God continues to speak in new ways, fulfilling earlier prophecies."
    },
    {
      "pk": 34008002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 2,
      "text": "In the vision, as I looked, I was in Susa, the capital, in the province of Elam. In the vision I saw myself beside the Ulai canal.",
      "links": "<a href='/AIV/16/1/1'>Neh 1:1</a>; <a href='/AIV/17/1/2'>Est 1:2</a>",
      "comment": "Daniel locates his vision in a specific historical setting—Susa, a Persian royal city. Anchoring prophetic messages to real locations highlights God’s action in history."
    },
    {
      "pk": 34008003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 3,
      "text": "I looked up, and saw a ram standing beside the canal. It had two horns, but one was higher than the other, and the higher one came up later.",
      "links": "<a href='/AIV/34/8/20'>Dan 8:20</a>; <a href='/AIV/27/34/2'>Ezek 34:2</a>",
      "comment": "The ram represents the dual kingdoms of Media and Persia (see Dan 8:20). The unequal horns symbolize one kingdom’s later ascendance."
    },
    {
      "pk": 34008004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 4,
      "text": "I saw the ram charging westward, northward, and southward. No beast could stand against him or rescue from his power, and he did as he pleased and became great.",
      "links": "<a href='/AIV/34/8/20'>Dan 8:20</a>; <a href='/AIV/27/39/16'>Ezek 39:16</a>",
      "comment": "Media-Persia’s expansion reflects God allowing worldly powers to rise. Yet, power is always permitted for a time and ultimately subject to divine sovereignty."
    },
    {
      "pk": 34008005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 5,
      "text": "As I was examining this, a male goat came from the west, crossing the whole earth without touching the ground. The goat had a prominent horn between its eyes.",
      "links": "<a href='/AIV/34/8/21'>Dan 8:21</a>; <a href='/AIV/1/49/17'>Gen 49:17</a>",
      "comment": "The swift goat symbolizes Greece and its first great king (Dan 8:21, Alexander the Great), showing God’s foreknowledge of future empires."
    },
    {
      "pk": 34008006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 6,
      "text": "He came towards the ram with two horns, which I had seen standing beside the canal, and ran at him in fierce anger.",
      "links": "<a href='/AIV/34/8/7'>Dan 8:7</a>",
      "comment": "The sudden and forceful attack points to the rapid conquest of Persia by Greece, fulfilling prophecy and demonstrating God’s control even over military events."
    },
    {
      "pk": 34008007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 7,
      "text": "I saw him reach the ram in fury; he attacked and broke both its horns. The ram was powerless to stand against him; he threw him down and trampeled him. None could rescue the ram from his power.",
      "links": "<a href='/AIV/34/8/20-21'>Dan 8:20-21</a>; <a href='/AIV/19/76/4-6'>Ps 76:4-6</a>",
      "comment": "Destruction of the ram shows the transition of world empires under God’s design, linking Daniel’s visions to actual historical events."
    },
    {
      "pk": 34008008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 8,
      "text": "The goat became very great, but at the peak of his power, his large horn was broken. In its place, four prominent horns grew toward the four winds of heaven.",
      "links": "<a href='/AIV/34/11/4'>Dan 11:4</a>; <a href='/AIV/34/7/6'>Dan 7:6</a>",
      "comment": "The four horns symbolize Alexander’s successors. The division of Greece corresponds with historical reality and prophecy, reflecting both judgment and providence."
    },
    {
      "pk": 34008009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 9,
      "text": "From one of them came a little horn, which grew great toward the south, east, and toward the Beautiful Land.",
      "links": "<a href='/AIV/34/7/8'>Dan 7:8</a>; <a href='/AIV/34/11/16'>Dan 11:16</a>",
      "comment": "Traditionally the ‘little horn’ refers to Antiochus IV, typifying future opposition to God’s people. The ‘Beautiful Land’ indicates Israel—God’s place of special concern."
    },
    {
      "pk": 34008010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 10,
      "text": "It grew up to the host of heaven, throwing down some of the host and some of the stars to the ground and trampeled them.",
      "links": "<a href='/AIV/34/8/24'>Dan 8:24</a>; <a href='/AIV/66/12/4'>Rev 12:4</a>",
      "comment": "Fallen stars symbolize persecution of God’s holy people. Revelation echoes this cosmic conflict, suggesting a spiritual battle alongside the historical one."
    },
    {
      "pk": 34008011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 11,
      "text": "It even exalted itself as high as the Prince of the host. He took away the regular sacrifice, and the place of His sanctuary was overthrown.",
      "links": "<a href='/AIV/34/8/25'>Dan 8:25</a>; <a href='/AIV/40/24/15'>Matt 24:15</a>",
      "comment": "Reference to abolishing sacrifice prefigures later attacks on worship and points to similar themes in end-times prophecy (Matt 24:15). The role of formal worship remains central."
    },
    {
      "pk": 34008012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 12,
      "text": "Because of rebellion, an army was given over to the horn to oppose the regular sacrifice. Truth was cast down to the ground, and it prospered in what it did.",
      "links": "<a href='/AIV/19/74/3-8'>Ps 74:3-8</a>; <a href='/AIV/53/2/7-12'>2 Thess 2:7-12</a>",
      "comment": "Suppression of truth and worship has both historical (Antiochus) and prophetic meaning (see 2 Thess 2). Even when evil seems to prevail, God ultimately restores true worship."
    },
    {
      "pk": 34008013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 13,
      "text": "Then I heard a holy one speaking, and another holy one asked him, 'How long will the vision be about the regular sacrifice, the rebellion, and the trampeled sanctuary and host?'",
      "links": "<a href='/AIV/66/6/9-11'>Rev 6:9-11</a>; <a href='/AIV/19/79/5'>Ps 79:5</a>",
      "comment": "The cry 'How long?' echoes the prayers of the saints through history, showing the continuity of suffering and the hope for God's intervention."
    },
    {
      "pk": 34008014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 14,
      "text": "He replied to me, 'For two thousand three hundred evenings and mornings; then the sanctuary shall be restored to its rightful state.'",
      "links": "<a href='/AIV/34/9/24-27'>Dan 9:24-27</a>; <a href='/AIV/19/102/13'>Ps 102:13</a>",
      "comment": "Restoration after a period of suffering mirrors prophetic patterns of purification preceding blessing. The sanctuary's cleansing anticipates return to regular worship and points to divine cycles of judgment and restoration."
    },
    {
      "pk": 34008015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 15,
      "text": "While I, Daniel, was watching the vision and trying to understand it, there stood before me one who looked like a man.",
      "links": "<a href='/AIV/34/7/13'>Dan 7:13</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "The 'manlike figure' recalls appearances of angelic messengers and prefigures ultimate divine revelation in human form (Christology, John 1:14)."
    },
    {
      "pk": 34008016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 16,
      "text": "And I heard a man's voice from the Ulai calling, 'Gabriel, make this man understand the vision.'",
      "links": "<a href='/AIV/42/1/19'>Luke 1:19</a>; <a href='/AIV/42/1/26'>Luke 1:26</a>",
      "comment": "Gabriel’s role as messenger aligns with later New Testament accounts of angelic revelation, highlighting spiritual continuity and the mediation of understanding."
    },
    {
      "pk": 34008017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 17,
      "text": "So he came near to where I stood. When he approached, I was terrified and fell face down. But he said to me, 'Understand, son of man, the vision is about the time of the end.'",
      "links": "<a href='/AIV/34/12/9'>Dan 12:9</a>; <a href='/AIV/27/1/28'>Ezek 1:28</a>",
      "comment": "Daniel’s awe before the angel parallels similar encounters in scripture (see Ezek 1:28). Reference to ‘the end’ points toward the prophetic nature of the vision for future ages."
    },
    {
      "pk": 34008018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 18,
      "text": "While he was speaking, I fell into a deep sleep with my face to the ground. But he touched me and set me upright.",
      "links": "<a href='/AIV/34/10/9-10'>Dan 10:9-10</a>; <a href='/AIV/19/3/5'>Ps 3:5</a>",
      "comment": "The angel’s touch revives Daniel, showing divine grace sustains and prepares us for deeper understanding—even when we are overwhelmed."
    },
    {
      "pk": 34008019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 19,
      "text": "He said, 'Look, I will make known to you what will happen in the last days of the wrath, for this concerns the appointed time of the end.'",
      "links": "<a href='/AIV/34/12/4'>Dan 12:4</a>; <a href='/AIV/66/1/3'>Rev 1:3</a>",
      "comment": "Prophecy’s purpose is revealed—God prepares His people for what is to come. The ‘appointed time’ points to precise, sovereign divine timing (see Gal 4:4 for fulfilled timing in Christ)."
    },
    {
      "pk": 34008020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 20,
      "text": "'The ram you saw, with two horns, represents the kings of Media and Persia.'",
      "links": "<a href='/AIV/34/8/3'>Dan 8:3</a>",
      "comment": "Direct identification clarifies the prophetic symbols—God’s revelation penetrates the veil of history and shows foreknowledge of empires."
    },
    {
      "pk": 34008021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 21,
      "text": "'The shaggy goat is the king of Greece, and the large horn between his eyes is the first king.'",
      "links": "<a href='/AIV/34/8/5'>Dan 8:5</a>; <a href='/AIV/34/11/3'>Dan 11:3</a>",
      "comment": "Alexander the Great is foretold centuries ahead, proving divine revelation is not limited by time. Prophetic specificity invites confidence in God’s guidance and wisdom."
    },
    {
      "pk": 34008022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 22,
      "text": "'The horn that was broken, and the four that arose in its place, represent four kingdoms that will rise from his nation, but not with his power.'",
      "links": "<a href='/AIV/34/11/4'>Dan 11:4</a>",
      "comment": "The division of Alexander’s empire is predicted, showing God controls both the rising and waning of nations. Human succession lacks the original power, revealing the limits of earthly rule compared to divine authority."
    },
    {
      "pk": 34008023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 23,
      "text": "'At the end of their rule, when rebels have filled up their measure, a fierce-looking king, skilled in intrigue, will arise.'",
      "links": "<a href='/AIV/34/7/8'>Dan 7:8</a>; <a href='/AIV/53/2/9'>2 Thess 2:9</a>",
      "comment": "Sinful rebellion sets the stage for a tyrant, prefiguring not only Antiochus but the future antichrist. The spiritual interpretation points toward cycles of evil and divine intervention, echoed in New Testament warnings."
    },
    {
      "pk": 34008024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 24,
      "text": "'His power will be mighty, but not by his own strength. He will cause terrible devastation and succeed in whatever he does. He will destroy the powerful and the holy people.'",
      "links": "<a href='/AIV/34/8/10'>Dan 8:10</a>; <a href='/AIV/40/24/21'>Matt 24:21</a>",
      "comment": "Evil rulers often seem unstoppable, but their power is limited and allowed for a purpose. The persecution of the faithful is a sign of spiritual warfare—parallels can be drawn to the suffering endured by the saints throughout history."
    },
    {
      "pk": 34008025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 25,
      "text": "'Through cunning, he will cause deceit to prosper and consider himself superior. In his arrogance, he will destroy many. He will even rise against the Prince of princes, but he will be broken—not by human hands.'",
      "links": "<a href='/AIV/19/2/2'>Ps 2:2</a>; <a href='/AIV/66/19/20'>Rev 19:20</a>",
      "comment": "God’s victory comes by divine, not human means. The Prince of princes alludes to Christ (see Ps 2, Rev 19:20), who ultimately conquers all opposition, fulfilling redemptive prophecy and confirming the spiritual dimension of this conflict."
    },
    {
      "pk": 34008026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 26,
      "text": "'The vision of the evenings and mornings that has been told is true. But seal up the vision, for it is for many days in the future.'",
      "links": "<a href='/AIV/34/12/4'>Dan 12:4</a>; <a href='/AIV/66/22/10'>Rev 22:10</a>",
      "comment": "Prophecy sometimes awaits fulfillment—storing up divine mysteries for those who faithfully await them over generations. There’s a call for trust and perseverance, hallmarks of enduring faith and tradition."
    },
    {
      "pk": 34008027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 8,
      "verse": 27,
      "text": "I, Daniel, was exhausted and sick for days. Then I got up and went about the king’s business. I was appalled by the vision; I did not understand it.",
      "links": "<a href='/AIV/34/7/15'>Dan 7:15</a>; <a href='/AIV/34/10/2'>Dan 10:2</a>",
      "comment": "Daniel’s response shows that engaging with divine mysteries is difficult and sometimes painful. Yet, God’s servants persevere in daily life, trusting ultimate fulfillment of God’s promises. The mystery invites deeper reflection, study, and holy anticipation."
    }
  ],
  "translatedAt": "2025-12-24T09:32:22.911Z"
}