{
  "book": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 4,
  "verses": [
    {
      "pk": 3004001,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 1,
      "text": "King Nebuchadnezzar, to all peoples, nations, and languages that dwell on the earth: Peace be multiplied to you.",
      "links": "<a href='/AIV/27/3/4'>Dan. 3:4</a>; <a href='/AIV/27/6/25'>Dan. 6:25</a>",
      "comment": "Nebuchadnezzar’s address indicates the universal scope of God’s message—a theme that anticipates the gospel reaching all nations (see Matt. 28:19)."
    },
    {
      "pk": 3004002,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 2,
      "text": "It seemed good to me to declare the signs and wonders that the Most High God has done for me.",
      "links": "<a href='/AIV/27/3/29'>Dan. 3:29</a>; <a href='/AIV/19/77/14'>Ps. 77:14</a>",
      "comment": "The king recognizes God’s action personally. His testimony anticipates Christian witness (cf. Acts 4:20) and the tradition of recounting God’s mighty deeds."
    },
    {
      "pk": 3004003,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 3,
      "text": "How great are His signs, how mighty His wonders! His kingdom is an everlasting kingdom, and His dominion endures from generation to generation.",
      "links": "<a href='/AIV/19/145/13'>Ps. 145:13</a>; <a href='/AIV/27/6/26'>Dan. 6:26</a>",
      "comment": "The eternal kingdom language foreshadows the everlasting reign of Christ. See Luke 1:33 for the fulfillment in the New Testament."
    },
    {
      "pk": 3004004,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 4,
      "text": "I, Nebuchadnezzar, was at ease in my house and flourishing in my palace.",
      "links": "<a href='/AIV/27/5/19'>Dan. 5:19</a>",
      "comment": "Nebuchadnezzar’s prosperity sets the background for God’s intervention—prosperity alone does not ensure right relationship with God."
    },
    {
      "pk": 3004005,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 5,
      "text": "I saw a dream that frightened me; and the thoughts and visions in my mind alarmed me.",
      "links": "<a href='/AIV/27/2/1'>Dan. 2:1</a>",
      "comment": "Dreams as divine warning are recurring in scripture (Gen. 41:1-7; Matt. 2:12)."
    },
    {
      "pk": 3004006,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 6,
      "text": "So I gave orders to bring before me all the wise men of Babylon, so they could explain the dream's meaning.",
      "links": "<a href='/AIV/27/2/2'>Dan. 2:2</a>",
      "comment": "Repeated reliance on human wisdom before seeking divine counsel suggests the futility of earthly wisdom without God (cf. 1 Cor. 1:20)."
    },
    {
      "pk": 3004007,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 7,
      "text": "Then the magicians, enchanters, Chaldeans, and astrologers came in, and I told them the dream, but they could not interpret it for me.",
      "links": "<a href='/AIV/27/2/10'>Dan. 2:10</a>",
      "comment": "Earthly powers are powerless apart from God’s wisdom; a theme seen in Pharoah’s magicians in Exodus and Paul in Acts 13."
    },
    {
      "pk": 3004008,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 8,
      "text": "Finally, Daniel came in before me—he who is called Belteshazzar, after the name of my god, and in whom is the spirit of the holy gods—and I told him the dream:",
      "links": "<a href='/AIV/27/1/7'>Dan. 1:7</a>; <a href='/AIV/27/5/12'>Dan. 5:12</a>",
      "comment": "Daniel’s reputation as one ‘in whom is the spirit of the holy gods’ points to the unique indwelling presence prefiguring the Holy Spirit (cf. Isa. 11:2; 1 Cor. 12:8)."
    },
    {
      "pk": 3004009,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 9,
      "text": "‘Belteshazzar, chief of the magicians, I know that the spirit of the holy gods dwells in you, and no mystery is too difficult for you. So explain to me the visions I saw in my dream.",
      "links": "<a href='/AIV/27/2/26'>Dan. 2:26</a>",
      "comment": "Daniel’s unique gift for interpretation echoes Joseph in Egypt, both serving as mediators of divine wisdom (Gen. 41:38)."
    },
    {
      "pk": 3004010,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 10,
      "text": "Here were the visions in my mind as I lay in bed: I saw a tree in the midst of the earth, and its height was great.",
      "links": "<a href='/AIV/27/4/20'>Dan. 4:20</a>; <a href='/AIV/26/31/3'>Ezek. 31:3</a>",
      "comment": "The tree’s imagery resembles visions in Ezekiel—a biblical motif for strength and majesty. Trees often symbolize rulers or nations."
    },
    {
      "pk": 3004011,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 11,
      "text": "The tree grew large and strong; its top reached to heaven, and it was visible to the ends of all the earth.",
      "links": "<a href='/AIV/27/4/22'>Dan. 4:22</a>",
      "comment": "Universal visibility points to a rule that extends broadly, paralleling Babel or later Babylon’s power (Gen. 11:4)."
    },
    {
      "pk": 3004012,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 12,
      "text": "Its leaves were beautiful, its fruit abundant, and in it was food for all. The beasts of the field found shade under it; the birds of the heavens lived in its branches, and all flesh was fed from it.",
      "links": "<a href='/AIV/26/31/6'>Ezek. 31:6</a>; <a href='/AIV/40/13/32'>Matt. 13:32</a>",
      "comment": "The tree as source of provision anticipates parables of the kingdom (cf. Matt. 13:32) and hints at spiritual nourishment found in the people of God."
    },
    {
      "pk": 3004013,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 13,
      "text": "I saw in the visions of my mind as I lay in bed, a watcher, a holy one, came down from heaven.",
      "links": "<a href='/AIV/27/4/17'>Dan. 4:17</a>",
      "comment": "Watchers are heavenly beings, signifying angelic mediators of God’s judgment (cf. Ps. 103:20)."
    },
    {
      "pk": 3004014,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 14,
      "text": "He called out loudly and said: ‘Cut down the tree and trim off its branches, strip off its leaves and scatter its fruit. Let the beasts flee from under it and the birds from its branches.",
      "links": "<a href='/AIV/27/4/23'>Dan. 4:23</a>; <a href='/AIV/26/31/12'>Ezek. 31:12'</a>",
      "comment": "Judgment imagery echoes Genesis and Ezekiel’s warnings against pride and earthly greatness apart from God."
    },
    {
      "pk": 3004015,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 15,
      "text": "But leave the stump of its roots in the ground, bound with a band of iron and bronze, among the grass of the field. Let him be wet with the dew of heaven, and let his portion be with the beasts in the grass of the earth.",
      "links": "<a href='/AIV/27/4/23'>Dan. 4:23</a>; <a href='/AIV/27/5/21'>Dan. 5:21</a>",
      "comment": "Preserving the stump offers hope for restoration, a repeated biblical theme (cf. Job 14:7), suggesting mercy can follow judgment."
    },
    {
      "pk": 3004016,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 16,
      "text": "Let his mind be changed from that of a man, and let an animal’s mind be given to him—seven periods of time will pass over him.",
      "links": "<a href='/AIV/27/5/21'>Dan. 5:21</a>",
      "comment": "A sovereign God can humble rulers and restore them; seven times indicate completeness in biblical symbolism."
    },
    {
      "pk": 3004017,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 17,
      "text": "The sentence is by decree of the watchers, the decision by the word of the holy ones, so that the living may know the Most High rules the kingdom of men and gives it to whom He wills, and sets over it the lowliest of men.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>; <a href='/AIV/19/113/7'>Ps. 113:7-8</a>",
      "comment": "The sovereignty of God over kingdoms is a key biblical truth echoed later by Christ’s kingship over all nations."
    },
    {
      "pk": 3004018,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 18,
      "text": "‘This is the dream I, King Nebuchadnezzar, have seen. Now you, Belteshazzar, tell me its interpretation, for none of the wise men of my kingdom can explain it, but you can, because the spirit of the holy gods is in you.’",
      "links": "<a href='/AIV/27/2/27'>Dan. 2:27-28</a>",
      "comment": "Nebuchadnezzar’s admission accentuates Daniel’s God-given wisdom as uniquely authoritative."
    },
    {
      "pk": 3004019,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 19,
      "text": "Then Daniel, whose name is Belteshazzar, was dismayed for a while, and his thoughts troubled him. The king said, ‘Belteshazzar, do not let the dream or its interpretation trouble you.’ Daniel replied, ‘My lord, may the dream be for those who hate you, and its interpretation for your enemies!",
      "links": "<a href='/AIV/27/7/15'>Dan. 7:15</a>",
      "comment": "Daniel’s concern shows compassion even toward pagan kings. The call to pray for leaders is repeated by Paul (1 Tim. 2:2)."
    },
    {
      "pk": 3004020,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 20,
      "text": "The tree you saw, which grew large and strong, whose top reached heaven and was visible to all the earth,",
      "links": "<a href='/AIV/27/4/10-11'>Dan. 4:10–11</a>",
      "comment": "Daniel repeats the image for clarity—his approach reflects the wisdom tradition of restating key truths."
    },
    {
      "pk": 3004021,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 21,
      "text": "whose leaves were beautiful, and its fruit abundant, in which was food for all, under which the beasts of the field lived, and in whose branches the birds of the heavens dwelt—",
      "links": "<a href='/AIV/27/4/12'>Dan. 4:12</a>",
      "comment": "Provision and shelter illustrate kingly responsibility with spiritual implications for God’s shepherding care (Ezek. 34:14)."
    },
    {
      "pk": 3004022,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 22,
      "text": "it is you, O king. You have grown and become strong. Your greatness has reached to heaven, and your dominion to the ends of the earth.",
      "links": "<a href='/AIV/27/2/37'>Dan. 2:37-38</a>",
      "comment": "Nebuchadnezzar’s reign, though mighty, is under God’s authority—a principle applicable in Christian understanding of divine providence."
    },
    {
      "pk": 3004023,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 23,
      "text": "And because the king saw a watcher, a holy one, coming down from heaven and saying, 'Cut down the tree and destroy it, but leave the stump with its roots in the ground, bound with iron and bronze, in the grass of the field, and let him be wet with the dew of heaven, and let his portion be with the beasts of the field till seven periods of time pass over him,'",
      "links": "<a href='/AIV/27/4/13-16'>Dan. 4:13–16</a>",
      "comment": "The specificity of the decree underscores the certainty of God’s judgment and the authority of heaven over earth."
    },
    {
      "pk": 3004024,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 24,
      "text": "this is the interpretation, O king. It is the decree of the Most High that has come upon my lord the king:",
      "links": "<a href='/AIV/27/4/17'>Dan. 4:17</a>",
      "comment": "The Most High’s intentional decree demonstrates divine sovereignty—a theme fulfilled in Jesus’ proclamations of God’s kingdom."
    },
    {
      "pk": 3004025,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 25,
      "text": "You shall be driven from among men, and your dwelling shall be with the beasts of the field. You shall be made to eat grass like an ox, and you shall be wet with the dew of heaven, and seven periods of time shall pass over you, until you know that the Most High rules the kingdom of men and gives it to whom He wills.",
      "links": "<a href='/AIV/27/5/21'>Dan. 5:21</a>; <a href='/AIV/19/83/18'>Ps. 83:18</a>",
      "comment": "God humbles rulers so they recognize divine authority; humility is integral to sanctification."
    },
    {
      "pk": 3004026,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 26,
      "text": "As it was commanded to leave the stump of the tree's roots, your kingdom will be assured to you after you recognize that Heaven rules.",
      "links": "<a href='/AIV/27/4/15'>Dan. 4:15</a>",
      "comment": "The possibility of restoration after repentance highlights the mercy inherent in God's justice."
    },
    {
      "pk": 3004027,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 27,
      "text": "Therefore, O king, let my advice be acceptable to you: break off your sins by practicing righteousness, and your iniquities by showing mercy to the poor, that perhaps there may be a lengthening of your prosperity.",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/40/19/21'>Matt. 19:21</a>; <a href='/AIV/59/5/1'>James 5:1</a>",
      "comment": "Daniel’s advice emphasizes the importance of works of mercy and righteousness, anticipating New Testament calls to give alms and live faithfully (Matt. 6:4)."
    },
    {
      "pk": 3004028,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 28,
      "text": "All this came upon King Nebuchadnezzar.",
      "links": "<a href='/AIV/27/4/33'>Dan. 4:33</a>",
      "comment": "The narrative transitions to fulfillment of prophecy, a pattern seen throughout the Bible."
    },
    {
      "pk": 3004029,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 29,
      "text": "At the end of twelve months, as he was walking on the roof of the royal palace of Babylon,",
      "links": "<a href='/AIV/27/4/4'>Dan. 4:4</a>",
      "comment": "The one-year delay exhibits divine patience, allowing time for repentance."
    },
    {
      "pk": 3004030,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 30,
      "text": "The king declared, ‘Is not this great Babylon, which I have built by my mighty power as a royal residence and for the glory of my majesty?’",
      "links": "<a href='/AIV/27/5/20'>Dan. 5:20</a>; <a href='/AIV/19/49/6'>Ps. 49:6-7</a>",
      "comment": "Human pride and self-exaltation are repeatedly condemned in both Testaments. The principle of humility is essential in Christian spirituality."
    },
    {
      "pk": 3004031,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 31,
      "text": "While the words were still in the king’s mouth, a voice came from heaven, ‘O King Nebuchadnezzar, to you it is spoken: The kingdom has departed from you.’",
      "links": "<a href='/AIV/27/5/28'>Dan. 5:28</a>",
      "comment": "God’s judgment is immediate and sovereign—see similar instances in Acts 12:23."
    },
    {
      "pk": 3004032,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 32,
      "text": "You shall be driven away from men, and your dwelling will be with the beasts of the field. You shall be made to eat grass like an ox; and seven periods of time will pass over you, until you know that the Most High rules the kingdom of men and gives it to whom He wills.",
      "links": "<a href='/AIV/27/4/25'>Dan. 4:25</a>",
      "comment": "Repetition underscores the lesson: God alone grants authority. Humiliation is a means to deeper spiritual truth."
    },
    {
      "pk": 3004033,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 33,
      "text": "Immediately the word was fulfilled upon Nebuchadnezzar. He was driven from among men and ate grass like an ox, and his body was wet with the dew of heaven until his hair grew like eagles' feathers and his nails like birds’ claws.",
      "links": "<a href='/AIV/27/5/21'>Dan. 5:21</a>",
      "comment": "Nebuchadnezzar’s transformation illustrates the consequence of pride and the restoration possible through humility—a spiritual lesson echoed in Jesus’ teaching (Luke 14:11)."
    },
    {
      "pk": 3004034,
      "translation": "AIV",
      "book": 27,
      "chapter": 4,
      "verse": 34,
      "text": "At the end of the days, I, Nebuchadnezzar, raised my eyes to heaven, and my reason returned to me. I blessed the Most High and praised and honored Him who lives forever, for His dominion is everlasting, and His kingdom endures from generation to generation.",
      "links": "<a href='/AIV/27/4/3'>Dan. 4:3</a>; <a href='/AIV/19/145/13'>Ps. 145:13</a>",
      "comment": "Nebuchadnezzar’s conversion is outwardly expressed; restoration comes with repentance and praise—foreshadowing spiritual renewal available to all who turn to God for mercy."
    }
  ],
  "translatedAt": "2025-12-23T07:15:07.259Z"
}