{
  "book": 60,
  "bookName": "2 Thessalonians",
  "bookAbbreviation": "2Thess",
  "chapter": 2,
  "verses": [
    {
      "pk": 60002001,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 1,
      "text": "Now, brothers, concerning the coming of our Lord Jesus Christ and our gathering together to Him, we urge you,",
      "links": "<a href='/AIV/40/24/31'>Matt. 24:31</a>; <a href='/AIV/46/15/51-52'>1 Cor. 15:51-52</a>",
      "comment": "Paul addresses the return of Jesus and the gathering of believers, emphasizing both personal and communal aspects of salvation. The word 'gathering' is used elsewhere to refer to the unity of the faithful in Christ, reminiscent of the importance of visible church community."
    },
    {
      "pk": 60002002,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 2,
      "text": "not to be quickly shaken in mind or troubled, either by a spirit or by a message or by a letter seeming to be from us, as though the day of the Lord has come.",
      "links": "<a href='/AIV/46/1/8'>1 Cor. 1:8</a>; <a href='/AIV/53/4/13-18'>1 Thess. 4:13-18</a>",
      "comment": "Paul cautions against false teachings or fears about Christ's return having already happened. He grounds assurance in trustworthy apostolic teaching, highlighting the value of tradition received from the apostles (see 2 Thess. 2:15)."
    },
    {
      "pk": 60002003,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 3,
      "text": "Let no one deceive you in any way. For that day will not come unless the falling away comes first, and the man of lawlessness is revealed, the son of destruction,",
      "links": "<a href='/AIV/54/4/1'>1 Tim. 4:1</a>; <a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "Paul prophesies a great apostasy and the revealing of a wicked figure before Christ's return. The reference to 'falling away' can be connected to doctrines of faithful perseverance and the importance of remaining within the true faith community."
    },
    {
      "pk": 60002004,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 4,
      "text": "who opposes and exalts himself above every so-called god or object of worship, so that he sits in the temple of God, displaying himself as God.",
      "links": "<a href='/AIV/27/11/36'>Dan. 11:36</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "Paul describes an anti-Christ figure who sets himself against all that is sacred. Echoes Daniel's prophecy and Jesus' warning about abomination in the temple. The imagery points to a spiritual battle for worship and truth."
    },
    {
      "pk": 60002005,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 5,
      "text": "Do you not remember that when I was still with you, I told you these things?",
      "links": "<a href='/AIV/54/6/20'>1 Tim. 6:20</a>",
      "comment": "Paul appeals to their memory of his oral instruction, highlighting the importance of apostolic teaching passed down both in writing and verbally—implying that tradition is authoritative alongside Scripture (cf. 2 Thess. 2:15)."
    },
    {
      "pk": 60002006,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 6,
      "text": "And now you know what restrains him, so that he may be revealed in his own time.",
      "links": "<a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "The 'restrainer' is mysterious, possibly referring to divine providence or a visible spiritual authority that holds back evil until God permits its unveiling—showcasing God's sovereignty over history."
    },
    {
      "pk": 60002007,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 7,
      "text": "For the mystery of lawlessness is already at work, but only until he who now restrains is taken out of the way.",
      "links": "<a href='/AIV/62/4/3'>1 John 4:3</a>; <a href='/AIV/27/8/23'>Dan. 8:23</a>",
      "comment": "Paul reveals that even now lawlessness secretly works until the restraining influence is removed. This suggests an ongoing spiritual battle, and underscores the need for faithful leadership and structure."
    },
    {
      "pk": 60002008,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 8,
      "text": "Then the lawless one will be revealed, whom the Lord Jesus will kill with the breath of His mouth and destroy by the brightness of His coming.",
      "links": "<a href='/AIV/23/11/4'>Isa. 11:4</a>; <a href='/AIV/66/19/15-21'>Rev. 19:15-21</a>",
      "comment": "Christ, in divine authority (cf. Isa. 11:4), destroys evil by His word and presence. This is a high christological affirmation of Jesus' divinity and power (see Rev. 19:15-21), and an assurance of ultimate victory for the faithful."
    },
    {
      "pk": 60002009,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 9,
      "text": "The coming of the lawless one is by the working of Satan, with all power and false signs and wonders,",
      "links": "<a href='/AIV/40/24/24'>Matt. 24:24</a>; <a href='/AIV/66/13/13-14'>Rev. 13:13-14</a>",
      "comment": "The evil one's signs and wonders are deceptive, imitating true miracles but leading astray. Warnings against false prophets stress discernment and being grounded in authentic, apostolic tradition."
    },
    {
      "pk": 60002010,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 10,
      "text": "and with every wicked deception for those who are perishing, because they did not receive the love of the truth, that they might be saved.",
      "links": "<a href='/AIV/45/1/25'>Rom. 1:25</a>; <a href='/AIV/40/13/15'>Matt. 13:15</a>",
      "comment": "Condemnation falls on those who reject truth. Salvation involves both knowledge and love—aligning with ideas that faith must be lived and received deeply, not merely acknowledged intellectually."
    },
    {
      "pk": 60002011,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 11,
      "text": "For this reason God sends them a powerful delusion, so that they will believe what is false,",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/45/1/28'>Rom. 1:28</a>",
      "comment": "God permits delusion as judgment for rejecting truth—a theme seen in Isaiah and Romans. It highlights divine justice and the necessity of grace for true understanding and faithfulness."
    },
    {
      "pk": 60002012,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 12,
      "text": "so that all may be condemned who did not believe the truth but delighted in unrighteousness.",
      "links": "<a href='/AIV/19/52/3'>Ps. 52:3</a>; <a href='/AIV/45/2/8'>Rom. 2:8</a>",
      "comment": "Condemnation results from loving evil over truth. Spiritual interpretation prompts self-examination, urging faithfulness to divine revelation received through authentic teaching and community."
    },
    {
      "pk": 60002013,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 13,
      "text": "But we ought always to give thanks to God for you, brothers beloved by the Lord, because God chose you as the firstfruits for salvation through sanctification by the Spirit and belief in the truth.",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/60/1/2'>1 Pet. 1:2</a>",
      "comment": "Paul celebrates faithful believers as chosen by God, emphasizing sanctification through the Spirit—pointing to the transformative process and journey within the church community, linking salvation with ongoing growth in holiness."
    },
    {
      "pk": 60002014,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 14,
      "text": "To this He called you through our gospel, so that you may obtain the glory of our Lord Jesus Christ.",
      "links": "<a href='/AIV/43/17/22'>John 17:22</a>; <a href='/AIV/45/8/17'>Rom. 8:17</a>",
      "comment": "The purpose of gospel calling is not merely forgiveness but sharing in the glory of Christ, as promised in John 17. Incorporation into Christ is both personal and communal, with a destiny of union with Him."
    },
    {
      "pk": 60002015,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 15,
      "text": "So then, brothers, stand firm and hold to the traditions that you were taught by us, whether by word of mouth or by letter.",
      "links": "<a href='/AIV/53/3/6'>2 Thess. 3:6</a>; <a href='/AIV/54/6/20'>1 Tim. 6:20</a>",
      "comment": "Paul instructs holding to traditions handed down—both written Scripture and oral apostolic teaching. This points towards a holistic understanding of passing down faith, underlining the necessity of both Scripture and tradition for safeguarding truth."
    },
    {
      "pk": 60002016,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 16,
      "text": "Now may our Lord Jesus Christ Himself, and God our Father, who loved us and gave us eternal comfort and good hope through grace,",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/45/15/13'>Rom. 15:13</a>",
      "comment": "Paul prays for grace, comfort, and hope through Jesus and the Father—a direct parallel to Jesus' assurance of eternal life in John 3:16, and a call to confidently trust in divine mercy and grace given through Christ."
    },
    {
      "pk": 60002017,
      "translation": "AIV",
      "book": 60,
      "bookName": "2 Thessalonians",
      "bookAbbreviation": "2Thess",
      "chapter": 2,
      "verse": 17,
      "text": "encourage your hearts and strengthen you in every good work and word.",
      "links": "<a href='/AIV/49/6/10'>Eph. 6:10</a>; <a href='/AIV/58/13/20-21'>Heb. 13:20-21</a>",
      "comment": "Paul ties comfort and strength with fruitful life—living faith in both works and words. Encouragement to persevere in sanctifying grace and service, echoing themes of faith shown by action, not mere belief."
    }
  ],
  "translatedAt": "2025-12-24T12:10:05.028Z"
}