{
  "book": 56,
  "bookName": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 2,
  "verses": [
    {
      "pk": 56002001,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 1,
      "text": "And you were dead in your sins and in the trespasses,",
      "links": "<a href='/AIV/51/1/21'>Col. 1:21</a>; <a href='/AIV/40/8/22'>Matt. 8:22</a>",
      "comment": "Paul begins by describing the spiritual condition before receiving grace: spiritual death, cut off from God. 'Dead' emphasizes the total inability to save oneself, echoing teachings in Colossians 1:21."
    },
    {
      "pk": 56002002,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 2,
      "text": "in which you once walked, following the ways of this world, following the ruler of the authority of the air, the spirit now at work in the sons of disobedience.",
      "links": "<a href='/AIV/43/12/31'>John 12:31</a>; <a href='/AIV/61/2/18'>2 Pet. 2:18</a>",
      "comment": "Paul makes clear that spiritual death was once a way of life, influenced by the evil one ('ruler of the authority of the air'). This phrase refers to Satan's influence in the world. John 12:31 references the 'ruler of this world,' supporting this view."
    },
    {
      "pk": 56002003,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 3,
      "text": "Among them we all once lived in the desires of our flesh, carrying out the cravings of the body and the mind, and were by nature children of wrath, like the rest of mankind.",
      "links": "<a href='/AIV/45/1/18'>Rom. 1:18</a>; <a href='/AIV/19/51/5'>Ps. 51:5</a>",
      "comment": "Paul includes himself and fellow Jews in this, showing all people are in need of redemption. 'Children of wrath' means destined for judgment by nature, due to original sin, as seen in Psalm 51:5 and Romans 1:18."
    },
    {
      "pk": 56002004,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 4,
      "text": "But God, being rich in mercy, because of His great love with which He loved us,",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>; <a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "The turning point: God's mercy, motivated by His love (John 3:16, Psalm 103:8), initiates salvation. Emphasis here is that salvation originates from God's loving initiative, not human merit."
    },
    {
      "pk": 56002005,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 5,
      "text": "even when we were dead in our trespasses, made us alive together with Christ—by grace you have been saved—",
      "links": "<a href='/AIV/45/6/4'>Rom. 6:4</a>; <a href='/AIV/56/2/8'>Eph. 2:8</a>",
      "comment": "Paul explains that God gave spiritual life when believers were spiritually dead. 'Made alive together with Christ' suggests union with Christ, a key doctrine, and 'by grace' is clarified later (v.8)."
    },
    {
      "pk": 56002006,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 6,
      "text": "and raised us up with Him, and seated us with Him in the heavenly realms in Christ Jesus,",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/56/1/20'>Eph. 1:20</a>",
      "comment": "'Raised us up' and 'seated us with Him' indicate not only resurrection but sharing in Christ's royal, priestly status. This points to the believer's participation in Christ's life, present in a spiritual sense, future in fullness."
    },
    {
      "pk": 56002007,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 7,
      "text": "so that in the ages to come He might show the surpassing riches of His grace in kindness toward us in Christ Jesus.",
      "links": "<a href='/AIV/45/9/23'>Rom. 9:23</a>; <a href='/AIV/19/31/19'>Ps. 31:19</a>",
      "comment": "The redemption of believers serves to demonstrate God's grace eternally. The phrase 'in the ages to come' refers both to future generations and eternal life. This hints at a continuing revelation of God's love, which aligns with the understanding of ongoing sanctification."
    },
    {
      "pk": 56002008,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 8,
      "text": "For by grace you have been saved through faith, and this is not from yourselves; it is the gift of God,",
      "links": "<a href='/AIV/45/3/24'>Rom. 3:24</a>; <a href='/AIV/56/2/5'>Eph. 2:5</a>",
      "comment": "A famous doctrinal statement. Salvation is a free gift, received by faith, but faith itself is made possible by grace (see Romans 3:24). The original Greek construction suggests the 'this' refers to the whole process, not only faith. This supports the view that faith, grace, and salvation are all God's gifts, not human achievements."
    },
    {
      "pk": 56002009,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 9,
      "text": "not by works, so that no one can boast.",
      "links": "<a href='/AIV/45/4/2'>Rom. 4:2</a>; <a href='/AIV/56/2/8'>Eph. 2:8</a>",
      "comment": "Paul denies human works as the cause of salvation, echoing Romans 4:2. This fosters humility among believers, highlighting God's initiative. Yet, as v.10 will make clear, good works are the result of salvation, not the cause."
    },
    {
      "pk": 56002010,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 10,
      "text": "For we are His workmanship, created in Christ Jesus for good works, which God prepared beforehand, so that we should walk in them.",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/59/2/17'>Jas. 2:17</a>",
      "comment": "Here, Paul emphasizes the purpose of salvation: to perform good works, prepared by God. This reveals that works are necessary fruit of true faith and are integral to the Christian life, pointing to James 2:17, which says faith without works is dead. The 'prepared beforehand' hints at God's sovereignty and a journey of sanctification."
    },
    {
      "pk": 56002011,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 11,
      "text": "Therefore, remember that at one time you, the Gentiles in the flesh—called 'uncircumcision' by those who call themselves 'circumcision,' which is done in the flesh by human hands—",
      "links": "<a href='/AIV/44/10/45'>Acts 10:45</a>; <a href='/AIV/45/2/28'>Rom. 2:28</a>",
      "comment": "Paul contrasts Gentile and Jewish believers, focusing on physical circumcision—an outward sign, not spiritual change (cf. Romans 2:28). This sets up the teaching that through Christ, these distinctions are overcome."
    },
    {
      "pk": 56002012,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 12,
      "text": "remember that you were at that time separate from Christ, excluded from citizenship in Israel, and strangers to the covenants of promise, having no hope and without God in the world.",
      "links": "<a href='/AIV/45/9/4'>Rom. 9:4</a>; <a href='/AIV/28/1/9'>Hos. 1:9</a>",
      "comment": "Gentiles were once outsiders, without access to the promises given to Israel (Romans 9:4). Hosea 1:9 illustrates exclusion from covenant blessings. Through Christ, these boundaries are now abolished."
    },
    {
      "pk": 56002013,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 13,
      "text": "But now in Christ Jesus you who once were far away have been brought near by the blood of Christ.",
      "links": "<a href='/AIV/23/57/19'>Isa. 57:19</a>; <a href='/AIV/51/1/20'>Col. 1:20</a>",
      "comment": "'Brought near' by Christ's blood means access to God, echoing Isaiah 57:19. Christ's sacrificial death reconciles all people, fulfilling Old Testament prophecy and emphasizing the necessity of Christ's atoning sacrifice."
    },
    {
      "pk": 56002014,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 14,
      "text": "For He Himself is our peace, who has made both one and has broken down the dividing wall of hostility,",
      "links": "<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/44/21/28'>Acts 21:28</a>",
      "comment": "Christ is the source of reconciliation and peace, uniting Jew and Gentile (Isaiah 9:6). The 'dividing wall' refers to the literal barrier in the temple (Acts 21:28), and symbolically the law and separation."
    },
    {
      "pk": 56002015,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 15,
      "text": "by abolishing in His flesh the law of commandments expressed in ordinances, so that He might create in Himself one new man in place of the two, thus making peace,",
      "links": "<a href='/AIV/45/7/6'>Rom. 7:6</a>; <a href='/AIV/51/2/14'>Col. 2:14</a>",
      "comment": "Christ's sacrifice abolishes ceremonial law (‘commandments in ordinances’), forming one unified people from Jews and Gentiles. This unity is spiritual and ecclesial, hinting at an apostolic, visible church founded by Christ."
    },
    {
      "pk": 56002016,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 16,
      "text": "and might reconcile both to God in one body through the cross, thereby killing the hostility.",
      "links": "<a href='/AIV/47/5/18'>2 Cor. 5:18</a>; <a href='/AIV/51/1/20'>Col. 1:20</a>",
      "comment": "'One body' refers to the unified church, reconciled through Christ's cross. The cross is central, both in history and in liturgy, as the source of reconciliation and peace for believers."
    },
    {
      "pk": 56002017,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 17,
      "text": "And He came and preached peace to you who were far away and peace to those who were near;",
      "links": "<a href='/AIV/23/57/19'>Isa. 57:19</a>; <a href='/AIV/44/13/26'>Acts 13:26</a>",
      "comment": "Quoting Isaiah 57:19, Paul shows Jesus as the fulfillment of prophecy, bringing the same message of peace to Gentiles and Jews alike, emphasizing the universal nature of the gospel."
    },
    {
      "pk": 56002018,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 18,
      "text": "For through Him we both have access in one Spirit to the Father.",
      "links": "<a href='/AIV/43/14/6'>John 14:6</a>; <a href='/AIV/45/5/2'>Rom. 5:2</a>",
      "comment": "Access to God is granted by Christ, through the Holy Spirit. John 14:6 echoes this: Jesus is the way to the Father. The mention of 'one Spirit' supports the unity and ongoing guidance of the Holy Spirit, especially through sacraments and communal worship."
    },
    {
      "pk": 56002019,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 19,
      "text": "So then you are no longer strangers and foreigners, but fellow citizens with the saints and members of God's household,",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "Gentile believers join the family of God, sharing in citizenship with the saints. 'God's household' is the spiritual family, founded by Christ and the apostles, with visible membership as a mark of the one, holy, apostolic community."
    },
    {
      "pk": 56002020,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 20,
      "text": "built on the foundation of the apostles and prophets, Christ Jesus Himself being the cornerstone,",
      "links": "<a href='/AIV/40/16/18'>Matt. 16:18</a>; <a href='/AIV/60/2/4-7'>1 Pet. 2:4-7</a>",
      "comment": "The church is founded on the apostles and prophets, with Christ as cornerstone (cf. 1 Peter 2:4-7, Matthew 16:18). Authority and teaching are received through this foundation and is preserved through apostolic succession."
    },
    {
      "pk": 56002021,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 21,
      "text": "in whom the whole building, being joined together, grows into a holy temple in the Lord;",
      "links": "<a href='/AIV/46/3/16'>1 Cor. 3:16</a>; <a href='/AIV/60/2/5'>1 Pet. 2:5</a>",
      "comment": "Paul describes a continuing process ('grows into a holy temple'), presenting the community of believers as a living temple, united in sacred worship and transformed spiritually. This imagery emphasizes the visible structure and unity among God's people."
    },
    {
      "pk": 56002022,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 2,
      "verse": 22,
      "text": "in whom you also are being built together for a dwelling place of God in the Spirit.",
      "links": "<a href='/AIV/43/14/17'>John 14:17</a>; <a href='/AIV/46/6/19'>1 Cor. 6:19</a>",
      "comment": "All believers are being formed into a spiritual home for God's presence, through the Spirit, individually and corporately. The continuous 'being built together' points to ongoing spiritual formation through communal life, worship, and sacraments."
    }
  ],
  "translatedAt": "2025-12-24T12:01:30.818Z"
}