{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 5,
  "verses": [
    {
      "pk": 17005001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 1,
      "text": "Tobias answered his father Tobit, 'Father, everything you told me I will do.'",
      "links": "<a href='/AIV/17/4/19'>Tob. 4:19</a>",
      "comment": "This sets the obedience of the son to the father as a model, reflecting themes of filial piety central to Old and New Testament teaching (cf. Ephesians 6:1-3). This obedience subtly foreshadows Christ's obedience to the Father."
    },
    {
      "pk": 17005002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 2,
      "text": "But Tobit said, 'Go now, my son, and find someone trustworthy from our people, who will travel with you, and we will pay him his wages as long as you return safe. And go and seek the money!'",
      "links": "<a href='/AIV/17/1/14'>Tob. 1:14</a>; <a href='/AIV/17/4/20'>Tob. 4:20</a>",
      "comment": "Tobit's concern for finding a suitable companion highlights the importance of trust and prudence in making significant journeys. This principle echoes throughout the wisdom literature (Proverbs 13:20)."
    },
    {
      "pk": 17005003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 3,
      "text": "Tobias replied, 'But I do not know him, Father. How can I find someone willing to go with me? I do not know the road to Media.'",
      "links": "<a href='/AIV/17/1/14'>Tob. 1:14</a>",
      "comment": "Tobias expresses humility and recognizes his own limitations. Such humility prepares the way for God's intervention (cf. James 4:6)."
    },
    {
      "pk": 17005004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 4,
      "text": "Tobit answered, 'Go out, my son, and seek out a trustworthy man who knows the way and will go with you. I will give him his wages, and you will get the money with him.'",
      "links": "<a href='/AIV/17/5/2'>Tob. 5:2</a>",
      "comment": "Prudence and the need for trusted guidance is highlighted again. There is also an analogy here for spiritual direction and guidance in discipleship."
    },
    {
      "pk": 17005005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 5,
      "text": "So Tobias went out to look for a man who would go with him to Media, and he found Raphael, the angel, but did not know that he was an angel of God.",
      "links": "<a href='/AIV/01/18/2'>Gen. 18:2</a>; <a href='/AIV/58/13/2'>Heb. 13:2</a>",
      "comment": "This moment reveals the reality of angels assisted in disguise (cf. Hebrews 13:2). It also hints at the principle that God sends unseen help to those who seek goodness—foreshadowing God's providential care in salvation history."
    },
    {
      "pk": 17005006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 6,
      "text": "Tobias said to him, 'Can you go with me to Media? Do you know the way?'",
      "links": "<a href='/AIV/17/5/3'>Tob. 5:3</a>",
      "comment": "Tobias's question further displays his need for guidance; this theme recurs in biblical narratives as humans depend on God's ministers for direction (cf. Exodus 23:20)."
    },
    {
      "pk": 17005007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 7,
      "text": "Raphael answered, 'Yes, I will go with you. I know the way to Media. I have lodged with our kinsman Gabael, who lives in Rages of Media.'",
      "links": "<a href='/AIV/17/1/14'>Tob. 1:14</a>; <a href='/AIV/17/4/1'>Tob. 4:1</a>",
      "comment": "Raphael's response confirms his readiness and knowledge, but also reveals a hidden layer: God prepares the way through His servants, even when humans do not recognize them as such."
    },
    {
      "pk": 17005008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 8,
      "text": "Tobias said, 'Wait for me, and I will tell my father.' He said, 'Go and do not delay.'",
      "links": "<a href='/AIV/17/5/9'>Tob. 5:9</a>",
      "comment": "Tobias's eagerness and desire for his father's approval again emphasizes filial obedience, a foundational virtue taught throughout scripture and mirrored in Christ's perfect obedience (Luke 2:51)."
    },
    {
      "pk": 17005009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 9,
      "text": "So Tobias went in and told his father, 'I have found someone from our people, one of the Israelites.' Tobit said to him, 'Call the man, so that I may learn what family he is from and whether he is trustworthy to go with you.'",
      "links": "<a href='/AIV/17/7/2'>Tob. 7:2</a>",
      "comment": "Tobit's concern to ascertain Raphael's background shows the importance of discernment—testing the spirits and being prudent with whom one entrusts important tasks (cf. 1 John 4:1)."
    },
    {
      "pk": 17005010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 10,
      "text": "So Tobias went out and called him. He said, 'Young man, my father is calling you.'",
      "links": "<a href='/AIV/17/5/11'>Tob. 5:11</a>",
      "comment": "This simple verse transitions to a moment of introduction, a key step in forming communities of trust."
    },
    {
      "pk": 17005011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 11,
      "text": "Raphael entered, and Tobit greeted him first. Raphael replied, 'Peace be with you!' Tobit said, 'What family are you from, brother? Tell me.'",
      "links": "<a href='/AIV/01/43/23'>Gen. 43:23</a>; <a href='/AIV/07/6/23'>Judg. 6:23</a>",
      "comment": "The greeting of peace is an Old Testament hallmark, and the question about family roots recalls the importance of lineage in salvation history (cf. Matthew 1:1-17)."
    },
    {
      "pk": 17005012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 12,
      "text": "Raphael replied, 'Why do you need to know my tribe?' But Tobit answered, 'I want to be sure, brother, whose son you are and what your name is.'",
      "links": "<a href='/AIV/08/1/1-2'>Ruth 1:1-2</a>",
      "comment": "Knowing one's origin was important, not only for safety but for assurance of shared faith and tradition (cf. Ruth 2:1). Tobias's concern underscores the continuity and stability required in passing on the faith."
    },
    {
      "pk": 17005013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 13,
      "text": "He said, 'I am Azariah the son of the great Hananiah, one of your relatives.'",
      "links": "<a href='/AIV/17/5/4'>Tob. 5:4</a>",
      "comment": "Raphael conceals his identity under a common Hebrew name. This reminds readers that God's intermediaries may come in unexpected forms—a motif echoed elsewhere in scripture (cf. Luke 24:16-31, the road to Emmaus)."
    },
    {
      "pk": 17005014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 14,
      "text": "Tobit said, 'Welcome and do not be angry, brother. I once knew Hananiah and Nathan, the two sons of Shemaiah, who were great men like you. They used to go with me to Jerusalem and worshipped there with us.'",
      "links": "<a href='/AIV/17/1/6'>Tob. 1:6</a>",
      "comment": "Tobit's reference to temple worship in Jerusalem and shared pilgrimage highlights the importance of communal liturgy and the unity of worship—a foreshadowing of the New Covenant community gathered in Christ (cf. Hebrews 10:25)."
    },
    {
      "pk": 17005015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 15,
      "text": "Now tell me, brother, what wages shall I give you—a drachma a day, and more, if you return safely?'",
      "links": "<a href='/AIV/40/20/2'>Matt. 20:2</a>",
      "comment": "Offering just wages echoes Levitical law (Leviticus 19:13) and Christ's parable of the laborers (cf. Matthew 20:2). There's a subtle affirmation of dignity in honest work and fair recompense."
    },
    {
      "pk": 17005016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 16,
      "text": "Raphael replied, 'I will go with you. Both safe going and safe return shall be given by God; the wages do not matter to me.'",
      "links": "<a href='/AIV/18/22/25'>Job 22:25</a>; <a href='/AIV/19/121/8'>Ps. 121:8</a>",
      "comment": "Raphael’s prioritizing of God’s providence over earthly wages suggests that divine mission and service transcend payment—echoing New Testament teachings on freely giving (cf. Matthew 10:8)."
    },
    {
      "pk": 17005017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 17,
      "text": "Tobit said to Tobias, 'Prepare for the journey, and go with this good man; may God, who dwells in heaven, keep you both safe and bring you home to me in peace. May his angel accompany you, my child.'",
      "links": "<a href='/AIV/02/23/20'>Exod. 23:20</a>; <a href='/AIV/19/91/11'>Ps. 91:11</a>",
      "comment": "Tobit’s prayer invokes angelic protection, recalling God's promise to send His angels (Psalm 91:11, Exodus 23:20). Such prayers anticipate Christian belief in guardian angels and divine protection."
    },
    {
      "pk": 17005018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 18,
      "text": "Tobias went out to begin his journey, and his mother began to weep. She said to Tobit, 'Why have you sent my child away? Is he not the staff of our hands, the one who enters and leaves before us?'",
      "links": "<a href='/AIV/01/42/38'>Gen. 42:38</a>",
      "comment": "Anna's sorrow reflects human fear and natural bonds. The phrase ‘staff of our hands’ echoes Jacob’s lament for Benjamin (Genesis 42:38), revealing depth in the parental relationship."
    },
    {
      "pk": 17005019,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 19,
      "text": "Do not add money to money, but rather let it be a ransom for our son’s life. For what the Lord has given us is enough to live on.'",
      "links": "<a href='/AIV/20/11/4'>Prov. 11:4</a>",
      "comment": "Anna’s value of life over wealth reflects wisdom tradition (cf. Proverbs 11:4), prioritizing relationship and trust in God above earthly gain."
    },
    {
      "pk": 17005020,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 20,
      "text": "Tobit said to her, 'Do not worry, sister. He will return in good health, and your eyes will see him again.'",
      "links": "<a href='/AIV/17/10/12'>Tob. 10:12</a>",
      "comment": "Tobit’s faith and reassurance is a model for perseverance in family hardships."
    },
    {
      "pk": 17005021,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 21,
      "text": "'For a good angel will accompany him; his journey will succeed, and he will come back in good health.'",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "Tobit's confidence in angelic guardianship is affirmed in Psalm 34:7 and supports the tradition of divine protectors sent for believers—a belief that finds fulfillment in the sending of the Holy Spirit (John 14:26)."
    },
    {
      "pk": 17005022,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 5,
      "verse": 22,
      "text": "She stopped weeping.",
      "links": "<a href='/AIV/17/11/17'>Tob. 11:17</a>",
      "comment": "The cessation of Anna's sorrow hints at the comfort and peace that faith provides, a theme fully revealed in Christ who turns mourning into joy (cf. John 16:20)."
    }
  ],
  "translatedAt": "2025-12-24T04:56:15.484Z"
}