{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 8,
  "verses": [
    {
      "pk": 17008001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 1,
      "text": "When they had finished eating and drinking, Tobiah got up and said to Sarah, 'Sister, get up. Let us pray and ask our Lord to have mercy on us and to protect us.'",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>; <a href='/AIV/40/18/19'>Matt. 18:19</a>",
      "comment": "Tobiah initiates prayer within his marriage, emphasizing the spiritual foundation of every union. The call to prayer together subtly prefigures the sacramental character of Christian marriage, upheld as a covenant before God."
    },
    {
      "pk": 17008002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 2,
      "text": "Sarah got up and together they prayed and begged God to keep them safe.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/55/2/22'>2 Tim. 2:22</a>",
      "comment": "The couple prays jointly, invoking God's protection. This reflects the biblical teaching that God is intimately involved in the lives of those who trust in Him, especially in the context of holy matrimony."
    },
    {
      "pk": 17008003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 3,
      "text": "He began to say, 'Blessed are you, God of our fathers, and blessed is your name forever. The heavens and all your works bless you.'",
      "links": "<a href='/AIV/19/103/20-22'>Ps. 103:20-22</a>; <a href='/AIV/27/2/20'>Dan. 2:20</a>",
      "comment": "Tobiah opens in praise, echoing biblical doxologies. The invocation of blessing connects this moment to the ancient prayers of Israel, and shows the importance of tradition in prayer."
    },
    {
      "pk": 17008004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 4,
      "text": "'You created Adam and gave him Eve his wife as a helper and support. And from them the human race has come. You said, “It is not good for man to be alone. Let us make him a helper like himself.”'",
      "links": "<a href='/AIV/01/2/18-24'>Gen. 2:18-24</a>; <a href='/AIV/40/19/4-6'>Matt. 19:4-6</a>",
      "comment": "This prayer directly references Genesis and the institution of marriage, reinforcing its divine origin and indissoluble nature. The connection to creation highlights the sanctity of marriage, a theme affirmed by Jesus Himself."
    },
    {
      "pk": 17008005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 5,
      "text": "'Now, Lord, I am taking this sister of mine not because of lust, but with honest intent. Grant that I and she may find mercy and grow old together.'",
      "links": "<a href='/AIV/40/19/6'>Matt. 19:6</a>; <a href='/AIV/20/5/18'>Prov. 5:18</a>",
      "comment": "Tobiah's words reflect the purity of intention and the sacred bond of marriage, focused on lifelong fidelity. This is an Old Testament witness to the self-giving nature of a marital relationship."
    },
    {
      "pk": 17008006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 6,
      "text": "And together they said, 'Amen, amen!'",
      "links": "<a href='/AIV/16/8/6'>Neh. 8:6</a>; <a href='/AIV/66/22/21'>Rev. 22:21</a>",
      "comment": "Their joint 'Amen' signifies total unity and acceptance of God's will, echoing liturgical responses and affirming the shared faith dimension of marriage."
    },
    {
      "pk": 17008007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 7,
      "text": "Then they both lay down to sleep; but Raguel got up and called his servants, and they went to dig a grave.",
      "links": "<a href='/AIV/01/38/7-10'>Gen. 38:7-10</a>",
      "comment": "Raguel's actions show anxiety rooted in the past tragedy of Sarah’s previous husbands. His reaction is shaped by deep respect for divine justice and concern for safety."
    },
    {
      "pk": 17008008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 8,
      "text": "He said to his servants, 'If Tobiah does not come out alive, bury him so that no one will know.'",
      "links": "<a href='/AIV/01/42/38'>Gen. 42:38</a>",
      "comment": "The secrecy highlights the gravity of the situation, while also respecting dignity even in potential tragedy. The narrative tension deepens reliance on God’s providence."
    },
    {
      "pk": 17008009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 9,
      "text": "Raguel and his wife went to bed, deeply troubled, and began to weep for their daughter.",
      "links": "<a href='/AIV/19/6/6'>Ps. 6:6</a>",
      "comment": "The sorrow of Sarah’s parents reveals the cost of suffering and empathy, reminding us of the pain that often attends human relationships and the need for trust in God."
    },
    {
      "pk": 17008010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 10,
      "text": "But as dawn broke, Raguel sent his servants to check on Tobiah. They found him alive and well, sleeping with Sarah.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "God’s intervention is revealed at daybreak, symbolizing hope arising after trial. The literal preservation of Tobiah highlights divine favor."
    },
    {
      "pk": 17008011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 11,
      "text": "Raguel blessed God and said, 'You are blessed, O God, with every pure blessing. Let them bless you forever.'",
      "links": "<a href='/AIV/19/113/2'>Ps. 113:2</a>; <a href='/AIV/27/3/28'>Dan. 3:28</a>",
      "comment": "Praise breaks forth naturally after deliverance. Genuine gratitude recognizes God’s active hand in daily life."
    },
    {
      "pk": 17008012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 12,
      "text": "'You are blessed because you have shown mercy to our two only children. Spare them, O Lord, and bring them to completion in happiness and mercy.'",
      "links": "<a href='/AIV/19/145/8-9'>Ps. 145:8-9</a>",
      "comment": "Raguel’s prayer expresses total dependence on God for the fullness of life, echoing ancient petitions for divine blessing over posterity."
    },
    {
      "pk": 17008013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 13,
      "text": "Then he told his servants to fill in the grave before dawn broke.",
      "links": "<a href='/AIV/01/23/19'>Gen. 23:19</a>",
      "comment": "The grave, dug in fear but never needed, is removed quietly, underscoring God’s protection and the value of hope over anxiety."
    },
    {
      "pk": 17008014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 14,
      "text": "Raguel prepared a wedding feast for them that lasted fourteen days.",
      "links": "<a href='/AIV/01/29/27-28'>Gen. 29:27-28</a>",
      "comment": "The significant length of the feast expresses the fullness of joy in covenantal celebrations, resonating with the biblical motif of feasting found throughout Scripture."
    },
    {
      "pk": 17008015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 15,
      "text": "Before the feast, Raguel swore to Tobiah, 'You must not leave here for two weeks, but stay and rejoice in my house, and make my daughter happy after all her sorrow.'",
      "links": "<a href='/AIV/23/54/1'>Isa. 54:1</a>",
      "comment": "Raguel’s words express a father's deep compassion and the integral role of joy in restoring broken hearts, a theme echoed in Scripture's prophetic promises."
    },
    {
      "pk": 17008016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 16,
      "text": "Afterwards, he brought out half of his possessions and gave them all to Tobiah.",
      "links": "<a href='/AIV/20/13/22'>Prov. 13:22</a>; <a href='/AIV/42/15/12'>Luke 15:12</a>",
      "comment": "The generous gift recalls biblical inheritance practices, emphasizing family legacy and the dignity of matrimonial union."
    },
    {
      "pk": 17008017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 17,
      "text": "He gave Sarah all of her goods as well. Tobiah and Sarah were now united as husband and wife, and all were joyful.",
      "links": "<a href='/AIV/19/128/6'>Ps. 128:6</a>",
      "comment": "The union accompanied by joy and generosity mirrors biblical weddings, which are often depicted as signs of God’s blessing and restoration."
    },
    {
      "pk": 17008018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 18,
      "text": "Afterwards, Edna said to Tobiah, 'May the Lord of heaven bring you back in peace, my child, and may I see your children from Sarah, my daughter, before I die.'",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>; <a href='/AIV/42/2/29'>Luke 2:29</a>",
      "comment": "Edna's blessing is reminiscent of other Old Testament prayers for continuity and generational blessing—suggesting the wider biblical hope of fruitfulness within marriage."
    },
    {
      "pk": 17008019,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 19,
      "text": "And embracing them both, she kissed them tenderly.",
      "links": "<a href='/AIV/01/48/10'>Gen. 48:10</a>",
      "comment": "The embrace and kiss show familial love and acceptance, reinforcing the theme of affection and reconciliation often seen in biblical narratives."
    },
    {
      "pk": 17008020,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 20,
      "text": "Raguel told his servants to bring in more food and wine, and prepared a greater feast than before.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/43/2/7-10'>John 2:7-10</a>",
      "comment": "The amplified celebration calls to mind biblical wedding feasts, including the wedding at Cana where Christ performed His first sign, symbolizing abundance and divine blessing."
    },
    {
      "pk": 17008021,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 21,
      "text": "So Tobiah and Sarah stayed in Raguel’s house in happiness, while he sent word to Tobit in Nineveh about all that had happened.",
      "links": "<a href='/AIV/01/24/67'>Gen. 24:67</a>",
      "comment": "The chapter concludes with lasting joy and tidings sent to Tobit, underscoring God’s faithfulness in fulfilling His promises. The narrative stresses the importance of familial connection, tradition, and the blessings of obedient faith."
    }
  ],
  "translatedAt": "2025-12-24T04:57:28.232Z"
}