{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 10,
  "verses": [
    {
      "pk": 10001,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 1,
      "text": "Meanwhile, each day Tobit kept count of the days that Tobias would be gone. When the days had passed and his son had not returned,",
      "links": "<a href='/AIV/17/8/3'>Tobit 8:3</a>; <a href='/AIV/17/5/1'>Tobit 5:1</a>",
      "comment": "Tobit's careful counting of days reflects parental concern and trust in divine providence. In ancient Jewish culture, the passage of time is marked with expectation of God's faithfulness."
    },
    {
      "pk": 10002,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 2,
      "text": "Tobit said, 'Has something happened? Why is my son delayed? Why is he not coming back?'",
      "links": "<a href='/AIV/17/5/3'>Tobit 5:3</a>; <a href='/AIV/17/7/1'>Tobit 7:1</a>",
      "comment": "Tobit’s anxiety points to the human experience of waiting and uncertainty, but it is also an invitation to deeper trust in God’s plans."
    },
    {
      "pk": 10003,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 3,
      "text": "But Anna his wife said, 'My son is dead. He is no longer among the living.' And she began to weep and mourn for her son, saying,",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>",
      "comment": "Anna’s lament echoes the grief of other biblical mothers (see <a href='/AIV/1/42/38'>Genesis 42:38</a>; <a href='/AIV/24/31/15'>Jeremiah 31:15</a>). Her grief is honest, yet ultimately God will use this pain for restoration. Also, this sets up a parallel to God’s comfort for the sorrowful."
    },
    {
      "pk": 10004,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 4,
      "text": "'Why have I let you depart, my child, you who are the light of my eyes?'",
      "links": "<a href='/AIV/19/13/3'>Psalm 13:3</a>",
      "comment": "Referring to her son as 'the light of my eyes' draws out the deep personal loss. This phrase also alludes to the wisdom literature’s use of sight as a metaphor for hope and joy."
    },
    {
      "pk": 10005,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 5,
      "text": "But Tobit kept assuring her, 'Be at peace. He is well. Something may have delayed him. The man who went with him is trustworthy and among our brethren. Do not worry about him, sister; he will soon be here.'",
      "links": "<a href='/AIV/17/5/15'>Tobit 5:15</a>",
      "comment": "Tobit calms Anna, expressing confidence in God's protection and in Raphael’s trustworthiness. The term 'brethren' emphasizes the unity and trust within the faith community, a theme strongly emphasized in the early Church."
    },
    {
      "pk": 10006,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 6,
      "text": "But she answered, 'Let me be. Do not deceive me. My son is gone.' And every day she went outside to watch the road by which he had departed, and did not eat any food during the day. As the sun set, she would come in and mourn and weep all night, never ceasing.",
      "links": "<a href='/AIV/17/2/4'>Tobit 2:4</a>",
      "comment": "Anna’s grief is persistent, yet she waits each day. This anticipation prefigures the hope for restoration and the triumph of faith over despair, themes that appear throughout salvation history."
    },
    {
      "pk": 10007,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 7,
      "text": "Now the days for Tobias’s wedding were being completed, and Raguel said to his son-in-law, 'Stay here, and I will send messengers to your father. They will inform him about you.'",
      "links": "<a href='/AIV/17/7/12-13'>Tobit 7:12-13</a>",
      "comment": "The mention of wedding days recalls the biblical motif of nuptial feasts pointing to God’s covenant with His people (<a href='/AIV/23/62/5'>Isaiah 62:5</a>; <a href='/AIV/40/22/2'>Matthew 22:2</a>)."
    },
    {
      "pk": 10008,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 8,
      "text": "But Tobias said, 'No, I beg you, let me go back to my father.'",
      "links": "<a href='/AIV/17/5/17'>Tobit 5:17</a>",
      "comment": "Tobias’s respect and sense of duty to his father mirrors the Fourth Commandment (Exodus 20:12), underscoring the importance of honoring parents—a value held throughout the Christian tradition."
    },
    {
      "pk": 10009,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 9,
      "text": "Then Raguel gave Tobias his wife Sarah, and half his property—servants, cattle, money, and household goods. He let him leave in happiness and peace,",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/1/24/35'>Genesis 24:35-36</a>",
      "comment": "The gifts and blessings parallel other biblical stories of marriage and inheritance (see Isaac and Rebekah in Genesis 24). This anticipates the greater inheritance believers receive through union with Christ."
    },
    {
      "pk": 10010,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 10,
      "text": "saying, 'May you prosper, my child, along with your wife. May the Lord of heaven bring you success before I die.'",
      "links": "<a href='/AIV/1/28/3'>Genesis 28:3-4</a>",
      "comment": "Raguel’s blessing invokes the ‘Lord of heaven,’ recognizing God’s sovereignty over all. This echoes patriarchal blessings, which also look forward to spiritual blessings in Christ (see Ephesians 1:3)."
    },
    {
      "pk": 10011,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 11,
      "text": "Then he called his daughter Sarah and blessed her and said to her, 'Go with your husband now, and may you flourish in your home. May I hear nothing but good about you for the rest of my life.'",
      "links": "<a href='/AIV/20/31/10'>Proverbs 31:10-31</a>",
      "comment": "A blessing on a daughter often included hopes for fruitfulness and harmony, which point forward to the New Testament’s vision of the family and Church as spiritual homes of blessing."
    },
    {
      "pk": 10012,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 12,
      "text": "After he kissed her, Raguel and Edna together sent them on their way.",
      "links": "<a href='/AIV/17/7/16'>Tobit 7:16</a>",
      "comment": "The parents’ final acts of blessing and parting show the importance of familial love, which mirrors God’s love for His people. The kiss is a sign of reconciliation and peace, elements later adopted in Christian liturgy."
    },
    {
      "pk": 10013,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 13,
      "text": "Edna said to Tobias, 'Dear son and brother of mine, may the Lord of heaven guide you safely home. May I live long enough to see your children and Sarah’s children, so that I might rejoice before the Lord. I entrust my daughter to your care. Do not grieve her all the days of your life. Go in peace, my child.'",
      "links": "<a href='/AIV/17/4/19'>Tobit 4:19</a>; <a href='/AIV/19/128/6'>Psalm 128:6</a>",
      "comment": "Edna’s prayer references a hope for descendants and transmission of blessing, a theme taken up in the promise of spiritual children in the faith, as Paul later calls Timothy ‘my true child in the faith’ (1 Timothy 1:2)."
    },
    {
      "pk": 10014,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 14,
      "text": "Then Raguel said to Tobias, 'May you have a safe journey!' So they departed, and Edna and her daughter Sarah wept for them.",
      "links": "<a href='/AIV/17/7/15'>Tobit 7:15</a>",
      "comment": "The narrative of journeying and blessing parallels God’s guidance of His people through times of transition (<a href='/AIV/2/33/14'>Exodus 33:14</a>). The story also echoes the Christian understanding of pilgrimage and hope for reunion in the presence of the Lord."
    }
  ],
  "translatedAt": "2025-12-23T09:10:41.083Z"
}