{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 6,
  "verses": [
    {
      "pk": 2500601,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 1,
      "text": "Now as they went on their way, they came at evening to the river Tigris and set up camp there.",
      "links": "<a href='/AIV/17/5/21'>Tobit 5:21</a>",
      "comment": "Here the narrative shifts to the journey, showing both God’s providence and the obedience of Tobit’s son, Tobias. Setting up camp recalls Israel’s wanderings, aligning this journey with the broader biblical theme of pilgrimage and divine guidance."
    },
    {
      "pk": 2500602,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 2,
      "text": "The young man went down to wash himself in the river, and a large fish jumped up from the water and tried to swallow his foot. Tobias screamed.",
      "links": "<a href='/AIV/17/6/4'>Tobit 6:4</a>; <a href='/AIV/32/1/17'>Jonah 1:17</a>",
      "comment": "The fish here recalls the story of Jonah, symbolizing danger but also potential redemption. Washing can be seen as a type, foreshadowing ritual purification and baptismal imagery."
    },
    {
      "pk": 2500603,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 3,
      "text": "But the angel said to him, 'Catch that fish!' And the young man grabbed the fish and pulled it to shore.",
      "links": "<a href='/AIV/17/12/15'>Tobit 12:15</a>",
      "comment": "The angel’s guidance highlights how God works through intermediaries to protect and direct. The act of catching the fish is both literal and symbolic—restoring order from chaos."
    },
    {
      "pk": 2500604,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 4,
      "text": "Then the angel said, 'Open the fish and take out its heart, liver, and gall. Keep them safe, for they are useful medicines.'",
      "links": "<a href='/AIV/17/6/7'>Tobit 6:7</a>; <a href='/AIV/17/8/2'>Tobit 8:2</a>",
      "comment": "The specific instructions to keep parts of the fish for healing foreshadow God’s means of grace through physical elements. These medicines prefigure sacramental signs in the Old Testament—a tangible expression of divine healing."
    },
    {
      "pk": 2500605,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 5,
      "text": "So the young man gutted the fish and kept its heart, liver, and gall. Then they roasted part of the fish for food, and ate it. The rest they salted and carried with them.",
      "links": "<a href='/AIV/2/12/11'>Exodus 12:11</a>",
      "comment": "Roasting and preserving the fish mirrors the Passover preparations, linking this journey with Israel’s story of deliverance by means of shared sacred meals and memory."
    },
    {
      "pk": 2500606,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 6,
      "text": "Then they continued on their way, till they reached Media.",
      "links": "<a href='/AIV/17/1/14'>Tobit 1:14</a>",
      "comment": "The journey continues, reinforcing trust in divine protection throughout trials. Media was a place of exile—reminding the reader of God’s sovereignty even far from home."
    },
    {
      "pk": 2500607,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 7,
      "text": "As they were traveling together, the young man asked the angel, 'Brother Azarias, what are these fish parts good for as medicine?'",
      "links": "<a href='/AIV/17/6/4'>Tobit 6:4</a>",
      "comment": "Tobias’s question shows his humility and willingness to learn—an attitude of listening to spiritual instruction, which is key in biblical discipleship."
    },
    {
      "pk": 2500608,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 8,
      "text": "He replied, 'The heart and liver, when burned, will drive away evil spirits so they never return to someone troubled by them.'",
      "links": "<a href='/AIV/17/8/2-3'>Tobit 8:2–3</a>",
      "comment": "Use of created material for spiritual purposes echoes themes of exorcism and sacramental reality—the physical being used by God to effect spiritual healing. <a href='/AIV/40/10/1'>Matthew 10:1</a>"
    },
    {
      "pk": 2500609,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 9,
      "text": "'The gall is used to heal someone's eyes when it is applied, curing white films.'",
      "links": "<a href='/AIV/17/11/11'>Tobit 11:11</a>",
      "comment": "The healing of blindness here anticipates New Testament miracles: sight restored recalling <a href='/AIV/43/9/6'>John 9:6</a>, where Jesus uses material means for healing."
    },
    {
      "pk": 2500610,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 10,
      "text": "Then Tobias said to the angel, 'Brother Azarias, please tell me: whom should I marry? I have no close relatives except my father’s family.'",
      "links": "<a href='/AIV/17/7/10'>Tobit 7:10</a>",
      "comment": "Tobias’s concern for a lawful marriage highlights the importance of family lineage and faithfulness to divine law—a theme fulfilled spiritually in unity with Christ’s family."
    },
    {
      "pk": 2500611,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 11,
      "text": "The angel answered, 'You will marry Sarah, daughter of Raguel. She is your kinswoman; no one else has a legal right to her.'",
      "links": "<a href='/AIV/17/7/2'>Tobit 7:2</a>; <a href='/AIV/8/4/3-5'>Ruth 4:3–5</a>",
      "comment": "Marriage as a divinely instituted covenant with inherited rights draws parallel to the Old Testament idea of kinsman-redeemer (see Ruth), emphasizing the sanctity and binding nature of marriage."
    },
    {
      "pk": 2500612,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 12,
      "text": "'She is beautiful, wise, and good. Only you are eligible by right of kinship. Listen to me: you must claim her. Tonight, I will speak to her father about her.'",
      "links": "<a href='/AIV/17/7/9'>Tobit 7:9</a>",
      "comment": "The angel’s initiative and mediation reflect both divine providence and the centrality of familial order, reminiscent of angelic interventions in Genesis and later traditions."
    },
    {
      "pk": 2500613,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 13,
      "text": "'When you enter the bridal chamber with her, take the heart and liver of the fish and burn them as incense. The evil spirit will smell it and flee, never to harm her again.'",
      "links": "<a href='/AIV/17/8/3'>Tobit 8:3</a>",
      "comment": "Burning incense as protection reveals faith in God’s power through ritual, foreshadowing sacramental elements and divine intervention through physical signs. <a href='/AIV/2/30/7'>Exodus 30:7</a>"
    },
    {
      "pk": 2500614,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 14,
      "text": "'When the spirit smells the smoke, he will flee and never return.'",
      "links": "<a href='/AIV/17/8/3'>Tobit 8:3</a>",
      "comment": "This protective effect illustrates God’s authority even over spiritual forces. Old Testament exorcisms relied on obedience and ritual—prefiguring Christ’s ultimate power over evil."
    },
    {
      "pk": 2500615,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 15,
      "text": "But Tobias was afraid and said, 'I have heard that she has been married to seven men, and each one died in the bridal chamber. Now I am the only son of my father, and I fear for my life.'",
      "links": "<a href='/AIV/17/3/8'>Tobit 3:8</a>",
      "comment": "Tobias’s fear is genuine—pointing to the reality of spiritual warfare and our need for God’s protection. The number seven here echoes biblical completeness, and further illustrates the gravity of the situation."
    },
    {
      "pk": 2500616,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 16,
      "text": "The angel said, 'Do not be afraid. She was set apart for you before all ages. You will save her, and she will go with you. She will bear children for you who will be your heirs—do not worry.'",
      "links": "<a href='/AIV/19/139/16'>Psalm 139:16</a>; <a href='/AIV/49/1/4'>Ephesians 1:4</a>",
      "comment": "Theangel’s assurance points to divine predestination and providential care. The language of being 'set apart before all ages' echoes New Testament ideas of election and God’s eternal plan, reinforcing trust in divine purposes for marriage and family."
    },
    {
      "pk": 2500617,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 17,
      "text": "'As for the seven who died, they fell from sin, not because of Sarah. Now give attention to what I tell you.'",
      "links": "<a href='/AIV/17/3/8'>Tobit 3:8</a>",
      "comment": "The deaths attributed to sin underline biblical teaching on moral consequence. The text shifts blame from Sarah, clearing her of wrongdoing, and hints at spiritual purity’s importance in relationship."
    },
    {
      "pk": 2500618,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 18,
      "text": "'Tonight, when you enter the chamber, both of you should pray to the Lord. God will have mercy and save you. Do not fear, for I have been sent to help you.'",
      "links": "<a href='/AIV/17/8/4'>Tobit 8:4</a>; <a href='/AIV/40/18/19'>Matthew 18:19</a>",
      "comment": "Prayer before marriage and trust in God’s mercy is central, and the angel’s role as intercessor suggests a deep biblical pattern. This foreshadows the spiritual dimension of sacraments, the necessity of grace, and the belief in God’s mercy working through visible means."
    }
  ],
  "translatedAt": "2025-12-23T09:09:29.823Z"
}