{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 9,
  "verses": [
    {
      "pk": 5209001,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 1,
      "text": "Then Tobias called Raphael and said to him, “Brother Azariah, take with you a servant and two camels, and go to Rages in Media to Gabael. Hand him the receipt, collect the money, and bring him with you to the wedding feast.",
      "links": "<a href='/AIV/17/4/1'>Tobit 4:1</a>; <a href='/AIV/17/5/6'>Tobit 5:6</a>; <a href='/AIV/17/9/2'>Tobit 9:2</a>",
      "comment": "Tobias entrusts Raphael (Angel in disguise) with an important mission, demonstrating trust and faith in God's providence. The mention of the 'brother' highlights the close, familial bonds in the People of God—a theme found throughout the Old and New Testaments (see <a href='/AIV/40/12/50'>Matt 12:50</a> where Jesus redefines family as those who do the will of God)."
    },
    {
      "pk": 5209002,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 2,
      "text": "You saw that I gave my father my promise, now I cannot break my word to him.",
      "links": "<a href='/AIV/17/5/3'>Tobit 5:3</a>; <a href='/AIV/17/10/7'>Tobit 10:7</a>",
      "comment": "Tobias emphasizes faithfulness to a promise given to his father, showing obedience and the honoring of one's parents, which is echoed in the commandment (see <a href='/AIV/2/20/12'>Ex 20:12</a>). There is a deeper layer here: fulfilling promises is seen as aligning with God's own faithfulness."
    },
    {
      "pk": 5209003,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 3,
      "text": "So Raphael went and stayed at Gabael’s house and gave him the receipt. Gabael brought out the sealed bags of money and gave them to him.",
      "links": "<a href='/AIV/17/1/14'>Tobit 1:14</a>; <a href='/AIV/17/5/17'>Tobit 5:17</a>",
      "comment": "Here, the safe-keeping and faithful return of the money underline the virtue of stewardship, echoing Christ’s parable of the talents (<a href='/AIV/40/25/14-30'>Matt 25:14–30</a>). Material blessings are seen as to be handled with care and justice in the community of believers."
    },
    {
      "pk": 5209004,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 4,
      "text": "Early in the morning they set out together to attend the wedding feast. When they came into Raguel’s house, they found Tobias sitting at the table.",
      "links": "<a href='/AIV/17/8/19'>Tobit 8:19</a>; <a href='/AIV/17/7/14'>Tobit 7:14</a>",
      "comment": "The wedding feast is a recurring biblical motif symbolizing God’s covenant relationship and final heavenly banquet (see <a href='/AIV/66/19/9'>Rev 19:9</a>). Spiritual interpretation sees every wedding feast in the Old Testament as a prefiguring of Christ’s union with the Church."
    },
    {
      "pk": 5209005,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 5,
      "text": "Gabael embraced Tobias and wept for joy. He blessed him and said, 'Good and noble son of a truly good and upright father! May the Lord bestow his blessing on you and on your wife and on your father and mother. May you see your children and your children’s children shining like the stars of heaven. You are truly worthy and descended from upright men. May God grant his blessing to you forever.'",
      "links": "<a href='/AIV/17/4/12'>Tobit 4:12</a>; <a href='/AIV/17/8/17'>Tobit 8:17</a>; <a href='/AIV/19/128/6'>Psalm 128:6</a>",
      "comment": "Gabael's blessing echoes the patriarchal blessings of Abraham, Isaac, and Jacob (see <a href='/AIV/1/22/17'>Gen 22:17</a>), connecting family line and promise. The benediction for descendants points toward the biblical emphasis on family and blessing as channels of God’s grace."
    },
    {
      "pk": 5209006,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 6,
      "text": "They rejoiced together, and all Israel who were in Media gave thanks and praise to the Lord.",
      "links": "<a href='/AIV/17/12/20'>Tobit 12:20</a>; <a href='/AIV/19/34/3'>Psalm 34:3</a>",
      "comment": "The joy and communal praise reflect the unity of God’s people in both Old and New Covenants, foreshadowing the command to give thanks always (see <a href='/AIV/52/5/18'>1 Thess 5:18</a>). Spiritual interpretation sees unity and thanksgiving as marks of the true Church, centered around God’s continued action in history."
    }
  ],
  "translatedAt": "2025-12-23T09:10:21.893Z"
}