{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 13,
  "verses": [
    {
      "pk": 9000131,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 1,
      "text": "Then Tobit spoke, and, filled with joy, blessed God and said:",
      "links": "<a href='/AIV/19/34/1'>Ps. 34:1</a>; <a href='/AIV/19/103/1-2'>Ps. 103:1–2</a>",
      "comment": "Tobit's song of praise begins here, modeled after many Old Testament psalms of thanksgiving."
    },
    {
      "pk": 9000132,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 2,
      "text": "\"Blessed be God who lives forever, and blessed be his kingdom! For he afflicts, and he shows mercy; he leads down to Sheol and brings up again, and there is no one who can escape his hand.",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>; <a href='/AIV/09/2/6'>1 Sam. 2:6</a>; <a href='/AIV/19/30/3'>Ps. 30:3</a>",
      "comment": "The mention of God's power over life and death anticipates later revelations about resurrection and salvation."
    },
    {
      "pk": 9000133,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 3,
      "text": "Acknowledge him before the nations, all you children of Israel; for he has scattered you among them, but there he has shown you his greatness.",
      "links": "<a href='/AIV/05/4/27'>Deut. 4:27</a>; <a href='/AIV/19/96/3'>Ps. 96:3</a>",
      "comment": "God’s discipline of Israel through diaspora becomes a way for God's glory to be revealed among the nations, preparing the way for universal salvation."
    },
    {
      "pk": 9000134,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 4,
      "text": "Exalt him before every living being. He is our Lord and he is God, our Father forever.",
      "links": "<a href='/AIV/19/145/21'>Ps. 145:21</a>; <a href='/AIV/23/63/16'>Isa. 63:16</a>",
      "comment": "A title for God as 'Father,' pointing both to Israel's unique relationship with God and anticipation of the New Testament's fuller revelation of God as Father in Christ."
    },
    {
      "pk": 9000135,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 5,
      "text": "He will discipline us for our iniquities, but he will again show mercy and will gather us from all the nations among whom you have been scattered.",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/27/9/7'>Dan. 9:7'</a>",
      "comment": "The return from exile is a recurring theme, foreshadowing the greater gathering of God's people in the messianic age."
    },
    {
      "pk": 9000136,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 6,
      "text": "If you turn to him with all your heart and with all your soul, to do what is right before him, then he will turn to you and will not hide his face from you.",
      "links": "<a href='/AIV/05/30/2-3'>Deut. 30:2–3</a>; <a href='/AIV/14/7/14'>2 Chron. 7:14</a>",
      "comment": "Emphasizes the need for repentance and wholehearted devotion for restoration—an enduring spiritual principle for God's people."
    },
    {
      "pk": 9000137,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 7,
      "text": "So now, consider what he has done for you; with all your voice, thank him. Bless the Lord of righteousness, exalt the King of the ages.",
      "links": "<a href='/AIV/19/66/16'>Ps. 66:16</a>; <a href='/AIV/27/4/34'>Dan. 4:34</a>",
      "comment": "God’s kingship and eternal reign, highlighted here, are themes that run through both testaments, inviting the faithful to always give thanks."
    },
    {
      "pk": 9000138,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 8,
      "text": "I will acknowledge him in the land of my captivity, for he has shown his majesty and great wonders among a sinful nation. Turn back, you sinners, and do what is right before him. Who knows if he will show you mercy and grant forgiveness?",
      "links": "<a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/32/3/9'>Jon. 3:9</a>",
      "comment": "Here is a call to repentance, alongside a recognition of God’s readiness to forgive even from a position of exile."
    },
    {
      "pk": 9000139,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 9,
      "text": "I will exalt my God and rejoice in the King of heaven. Let all people speak of his majesty and give him praise in Jerusalem.",
      "links": "<a href='/AIV/19/48/1-2'>Ps. 48:1–2</a>; <a href='/AIV/19/102/21'>Ps. 102:21</a>",
      "comment": "Jerusalem is singled out as the place of praise, signifying its special role in God’s saving plan."
    },
    {
      "pk": 9000140,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 10,
      "text": "Jerusalem, holy city, God will afflict you for the works of your children, but again he will show mercy to the children of the righteous.",
      "links": "<a href='/AIV/23/1/21-27'>Isa. 1:21–27</a>; <a href='/AIV/25/5/12-13'>Lam. 5:12–13</a>",
      "comment": "The holiness of Jerusalem is connected to God’s presence and discipline, yet restoration is promised to those who are faithful."
    },
    {
      "pk": 9000141,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 11,
      "text": "Give thanks to the Lord as is fitting, and bless the King of the ages, that his tent may be rebuilt within you with joy; may he gladden all the exiles, and may he love those within you who are miserable.",
      "links": "<a href='/AIV/19/147/2'>Ps. 147:2</a>; <a href='/AIV/24/33/7'>Jer. 33:7</a>",
      "comment": "Reference to God restoring his 'tent' (tabernacle) in Jerusalem anticipates themes of God’s dwelling among his people, fulfilled in Christ (see John 1:14)."
    },
    {
      "pk": 9000142,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 12,
      "text": "Many nations will come from afar to the name of the Lord God, bringing gifts in their hands—gifts for the King of heaven. Generations will rejoice in you, and the name of the chosen city will endure forever.",
      "links": "<a href='/AIV/23/60/6'>Isa. 60:6</a>; <a href='/AIV/36/3/10'>Zeph. 3:10</a>; <a href='/AIV/40/2/1-2'>Matt. 2:1–2</a>",
      "comment": "A prophecy that Gentiles will worship the Lord and bring gifts to Jerusalem, fulfilled in part with the coming of the Magi to Christ (Matt. 2:1–2)."
    },
    {
      "pk": 9000143,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 13,
      "text": "Cursed are all those who speak or act against you; blessed are those who build you up.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/19/122/6'>Ps. 122:6</a>",
      "comment": "God’s blessings and curses on those who interact with Jerusalem recall his covenant with Abraham and enduring concern for his city."
    },
    {
      "pk": 9000144,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 14,
      "text": "Rejoice and be glad for the children of the righteous, for they will be gathered together and will bless the Lord of the just.",
      "links": "<a href='/AIV/19/22/23'>Ps. 22:23</a>; <a href='/AIV/23/66/10'>Isa. 66:10</a>",
      "comment": "The restoration and unity of the righteous is highlighted—anticipating the gathering of God’s people into one worshiping community."
    },
    {
      "pk": 9000145,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 15,
      "text": "Blessed are those who love you, and blessed are those who rejoice in your peace.",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/19/128/5'>Ps. 128:5</a>",
      "comment": "Love for Jerusalem, the city of God, is commended; its 'peace' (shalom) is seen as a reflection of God’s kingdom among his people."
    },
    {
      "pk": 9000146,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 16,
      "text": "Blessed are all people who will grieve over you, over all your afflictions, for they will rejoice in you and will see all your joy forever.",
      "links": "<a href='/AIV/19/126/5'>Ps. 126:5</a>; <a href='/AIV/23/61/3'>Isa. 61:3</a>",
      "comment": "God turns mourning into joy for his people, a theme echoed in prophecies fulfilled in the advent of Christ and in the new Jerusalem (Rev. 21:4)."
    },
    {
      "pk": 9000147,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 17,
      "text": "Let my soul bless God, the great King, for Jerusalem will be built with sapphire and emerald, her walls with precious stones, and her towers and battlements with pure gold. The streets of Jerusalem will be paved with beryl, rubies, and stones from Ophir.",
      "links": "<a href='/AIV/23/54/11-12'>Isa. 54:11–12</a>; <a href='/AIV/66/21/18-21'>Rev. 21:18–21</a>",
      "comment": "The imagery here closely parallels descriptions of the New Jerusalem (Rev. 21:18–21), showing both spiritual fulfillment and future hope."
    },
    {
      "pk": 9000148,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 18,
      "text": "And all her streets will cry out, 'Hallelujah!' and bless God, saying, 'Blessed is God, who has exalted Jerusalem forever.'\"",
      "links": "<a href='/AIV/66/19/1'>Rev. 19:1</a>; <a href='/AIV/19/135/21'>Ps. 135:21</a>",
      "comment": "The praise of God in the new, victorious Jerusalem points to the ultimate destiny of the faithful—a worshiping people praising the Lord eternally."
    }
  ],
  "translatedAt": "2025-12-23T09:11:55.632Z"
}