{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 8,
  "verses": [
    {
      "pk": 1308001,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 1,
      "text": "When they had finished eating and drinking, they were ready to go to bed. So the young man was brought from the dining room into the bedroom.",
      "links": "<a href='/AIV/17/7/16'>Tobit 7:16</a>",
      "comment": "This verse resumes from the wedding meal described previously, introducing Tobiah and Sarah's private moment, a key setting for the unfolding miracle."
    },
    {
      "pk": 1308002,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 2,
      "text": "Tobiah remembered the instructions of Raphael. He took the fish’s liver and heart from the bag and placed them on the hot coals of the incense burner.",
      "links": "<a href='/AIV/17/6/7-8'>Tobit 6:7-8</a>",
      "comment": "The use of specific materials (fish organs) by instruction of an angel signifies God's tangible intervention through spiritual and material means, linking Old Testament miracle tradition."
    },
    {
      "pk": 1308003,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 3,
      "text": "The smell from the fish drove the demon away from them, and it fled to the upper parts of Egypt. Raphael followed it and immediately bound it hand and foot.",
      "links": "<a href='/AIV/17/6/17'>Tobit 6:17</a>; <a href='/AIV/17/3/8'>Tobit 3:8</a>",
      "comment": "The demon’s defeat shows the power of God mediated through angels. This foreshadows spiritual warfare themes in the New Testament (see <a href='/AIV/49/6/12'>Eph. 6:12</a>)."
    },
    {
      "pk": 1308004,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 4,
      "text": "When the parents had left and shut the door of the room, Tobiah got up from the bed and said to Sarah, 'Sister, get up. Let us pray and beg our Lord to have mercy on us and to save us.'",
      "links": "<a href='/AIV/17/6/18'>Tobit 6:18</a>; <a href='/AIV/1/2/18'>Gen. 2:18</a>",
      "comment": "Tobiah’s initiative in prayer before consummating marriage points to the sanctity and spiritual character of marriage. This anticipates Christian teaching on the sacramental character of matrimony."
    },
    {
      "pk": 1308005,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 5,
      "text": "They both rose and began to pray that they might be kept safe. He began with these words:",
      "links": "<a href='/AIV/17/6/18'>Tobit 6:18</a>; <a href='/AIV/17/8/4'>Tobit 8:4</a>",
      "comment": "Both spouses pray together, stressing unity in marriage, prefiguring marriage as a covenant reflecting Christ and the Church (<a href='/AIV/49/5/32'>Eph. 5:32</a>)."
    },
    {
      "pk": 1308006,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 6,
      "text": "'Blessed are you, O God of our ancestors, and blessed is your name forever and ever! Let the heavens and all your creation bless you.'",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/19/103/20-22'>Ps. 103:20-22</a>",
      "comment": "A liturgical prayer of blessing, invoking God as Creator. The praise forms a model for Christian doxology and worship."
    },
    {
      "pk": 1308007,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 7,
      "text": "'You made Adam, and you gave him his wife Eve, as a helper and support. From them the human race has come. You said: It is not good for the man to be alone; let us make him a helper like himself.'",
      "links": "<a href='/AIV/1/2/18-24'>Gen. 2:18-24</a>",
      "comment": "Directly referencing the creation of man and woman as husband and wife, affirming the origin and nature of marriage as instituted by God Himself."
    },
    {
      "pk": 1308008,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 8,
      "text": "'And now, Lord, I am not taking this sister of mine out of sensual desire, but with sincerity. Grant that we may find mercy and grow old together.'",
      "links": "<a href='/AIV/40/19/4-6'>Matt. 19:4-6</a>",
      "comment": "Tobiah’s intention for marriage emphasizes mutual self-giving rather than lust, anticipating later Christian marital ethics. The phrase 'find mercy' shows openness to God’s grace sustaining the marriage."
    },
    {
      "pk": 1308009,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 9,
      "text": "And they both said, 'Amen, Amen,' and went to bed for the night.",
      "links": "<a href='/AIV/24/11/5'>Jer. 11:5</a>; <a href='/AIV/19/41/13'>Ps. 41:13</a>",
      "comment": "Amen is a solemn affirmation, expressing trust in God. This parallels Christian liturgical usage."
    },
    {
      "pk": 1308010,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 10,
      "text": "Then, when Raguel got up, he called his servants and they went with him to dig a grave.",
      "links": "<a href='/AIV/17/7/13'>Tobit 7:13</a>",
      "comment": "Raguel’s act shows both his love for his daughter and his fear due to the deaths of her previous husbands, setting up the sign of God’s deliverance."
    },
    {
      "pk": 1308011,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 11,
      "text": "He said to himself, 'Maybe he will die, and people will mock us and ridicule me for letting him marry her once again.'",
      "links": "<a href='/AIV/17/7/11'>Tobit 7:11</a>",
      "comment": "Reflects human anxiety and the reality of shame in the ancient world, which God’s providence is about to overturn."
    },
    {
      "pk": 1308012,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 12,
      "text": "When they had finished digging the grave, Raguel went back to the house and called his wife,",
      "links": "<a href='/AIV/17/7/15'>Tobit 7:15</a>",
      "comment": "His actions underscore his expectation based on past tragedy, heightening the wonder of what is about to unfold."
    },
    {
      "pk": 1308013,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 13,
      "text": "'Send one of the maids in to see if he is alive. If he is not, let us bury him and not let anyone know.'",
      "links": "",
      "comment": "Practical concern and secrecy reflect fear and also a legal protection for the family's honor, typical in ancient Near Eastern culture."
    },
    {
      "pk": 1308014,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 14,
      "text": "So they sent the maid, who entered the bedroom; she found them both alive and sleeping together peacefully.",
      "links": "",
      "comment": "The discovery of both alive after the fearful night confirms the power of God over evil, prefiguring themes of resurrection and deliverance."
    },
    {
      "pk": 1308015,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 15,
      "text": "The maid came back and told them, and they praised the great God, who had shown mercy to them.",
      "links": "<a href='/AIV/19/107/1'>Ps. 107:1</a>; <a href='/AIV/42/1/49-50'>Luke 1:49-50</a>",
      "comment": "Praise immediately follows the realization of deliverance, aligning with biblical tradition of thanksgiving after salvation."
    },
    {
      "pk": 1308016,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 16,
      "text": "Raguel said, 'Blessed are you, O God, with every pure blessing! May your saints and all your creatures bless you! May all your angels and chosen ones bless you forever.'",
      "links": "<a href='/AIV/19/103/20-22'>Ps. 103:20-22</a>; <a href='/AIV/66/5/8-14'>Rev. 5:8-14</a>",
      "comment": "Raguel’s doxology includes invocation of saints and angels, a model for intercessory prayer, later reflected in Christian liturgical tradition."
    },
    {
      "pk": 1308017,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 17,
      "text": "'You have made me glad, and it has not turned out as I expected; instead, you have treated us according to your abundant mercy.'",
      "links": "<a href='/AIV/19/30/11'>Ps. 30:11</a>",
      "comment": "God’s mercy exceeds human expectation, a recurring biblical theme that is fulfilled supremely in Christ’s ministry."
    },
    {
      "pk": 1308018,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 18,
      "text": "'You have had compassion on these two only children. Show them, Lord, mercy and protection. Complete their lives with joy and mercy.'",
      "links": "<a href='/AIV/19/128/1-3'>Ps. 128:1-3</a>",
      "comment": "A prayer for God's blessing upon a new family; Christian tradition echoes this in prayers at marriage and family life."
    },
    {
      "pk": 1308019,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 19,
      "text": "Then Raguel told his servants to fill the grave before dawn.",
      "links": "",
      "comment": "The grave, now empty and filled, is a symbol of death’s defeat—inviting parallels to the empty tomb in Christ’s resurrection."
    },
    {
      "pk": 1308020,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 20,
      "text": "He ordered his wife to prepare a great banquet, and he told them to celebrate.",
      "links": "<a href='/AIV/17/9/6-7'>Tobit 9:6-7</a>",
      "comment": "Feasting as celebration of deliverance and covenant formation echoes similar banquets throughout Scripture, prefiguring the messianic wedding feast (<a href='/AIV/66/19/7-9'>Rev. 19:7-9</a>)."
    },
    {
      "pk": 1308021,
      "translation": "AIV",
      "book": 17,
      "chapter": 8,
      "verse": 21,
      "text": "Raguel summoned Tobiah and said, 'For fourteen days you are not to leave, but stay and eat and drink with me. Fill my daughter’s heart with gladness after her many troubles.'",
      "links": "<a href='/AIV/17/9/2'>Tobit 9:2</a>",
      "comment": "The period of feasting marks fulfillment and transition to new life, highlighting the joy that flows from faithfulness to God’s commands, a constant biblical theme."
    }
  ],
  "translatedAt": "2025-12-23T09:10:09.623Z"
}