{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 3,
  "verses": [
    {
      "pk": 1553001,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 1,
      "text": "Then, grieving, Tobit sighed deeply, wept, and began to pray with tears:",
      "links": "<a href='/AIV/19/39/12'>Psalm 39:12</a>; <a href='/AIV/19/42/3'>Psalm 42:3</a>",
      "comment": "Tobit’s lament echoes the tradition of the righteous suffering and pouring out their heart to God in the Psalms. Note the connection between suffering, sincere prayer, and God’s ultimate plan."
    },
    {
      "pk": 1553002,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 2,
      "text": "\"You are righteous, O Lord, and all Your works are just. All Your ways are mercy and truth, and You judge the world.",
      "links": "<a href='/AIV/19/119/137'>Psalm 119:137</a>; <a href='/AIV/05/32/4'>Deuteronomy 32:4</a>",
      "comment": "This verse affirms the justice and mercy of God, concepts fulfilled most fully in the coming of Christ (see John 1:17)."
    },
    {
      "pk": 1553003,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 3,
      "text": "So now, O Lord, remember me and look upon me. Do not punish me for my sins or those I have unknowingly committed, nor the sins of my ancestors.",
      "links": "<a href='/AIV/02/34/7'>Exodus 34:7</a>; <a href='/AIV/19/25/7'>Psalm 25:7</a>",
      "comment": "Here, Tobit’s prayer acknowledges both personal and ancestral sin, illustrating the biblical theme of communal responsibility. This idea is found in the Lord’s Prayer where we ask for forgiveness as we forgive others. It also foreshadows the New Covenant promise of forgiveness (Jeremiah 31:34)."
    },
    {
      "pk": 1553004,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 4,
      "text": "Because we disobeyed Your commandments, You handed us over to plunder, captivity, death, ridicule, and a proverb among all the nations where You scattered us.",
      "links": "<a href='/AIV/05/28/37'>Deuteronomy 28:37</a>; <a href='/AIV/25/2/15'>Lamentations 2:15</a>",
      "comment": "Tobit recognizes the justice in God’s discipline of Israel. This historical experience points to the need for repentance and the coming redemption."
    },
    {
      "pk": 1553005,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 5,
      "text": "Now, Your judgments are true concerning me, for my sins and those of my ancestors, because we have not kept Your commandments. For we did not walk in truth before You.",
      "links": "<a href='/AIV/19/51/4'>Psalm 51:4</a>",
      "comment": "Tobit’s humility before God serves as a model of confession. True contrition and acknowledgment of personal and communal guilt is foundational for God’s forgiveness."
    },
    {
      "pk": 1553006,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 6,
      "text": "So now, deal with me as You please. Command my spirit to be taken, so I may depart and become dust. For it is better for me to die than to live, because I have heard false reproaches and experience great sorrow. O Lord, command me to be delivered from this distress to go to the eternal dwelling. Do not turn Your face from me.",
      "links": "<a href='/AIV/18/3/21-22'>Job 3:21–22</a>; <a href='/AIV/19/55/6'>Psalm 55:6</a>",
      "comment": "Tobit’s request to die from distress and shame is reminiscent of prophetic lament (Elijah, Jonah). Yet, he ultimately submits to God’s will. The reference to an 'eternal dwelling' alludes to the hope of life beyond death, a reality fully revealed in the resurrection (Philippians 3:20–21)."
    },
    {
      "pk": 1553007,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 7,
      "text": "On that same day, in Ecbatana of Media, Sarah, the daughter of Raguel, also heard insults from one of her father’s maidservants.",
      "links": "<a href='/AIV/17/6/11'>Tobit 6:11</a>",
      "comment": "The narrative now shifts to Sarah, linking her suffering to Tobit’s, and foreshadowing God’s plan to unite their stories for mutual healing."
    },
    {
      "pk": 1553008,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 8,
      "text": "She had been married to seven husbands, but each one died on their wedding night, before being with her, all killed by an evil spirit. The maidservant said, 'You are the one who kills your husbands! You have already had seven, and have not even been named after any of them.'",
      "links": "<a href='/AIV/17/6/14'>Tobit 6:14</a>",
      "comment": "Sarah’s suffering under a demonic attack introduces the theme of spiritual warfare and deliverance. This anticipates the victory over evil promised in Christ (Luke 4:36; Mark 16:17)."
    },
    {
      "pk": 1553009,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 9,
      "text": "In her grief, she wept and went up to the upper room of her house. She intended to hang herself, but reconsidered, saying, 'People may insult my father and say, \"You had one beloved daughter, but she hanged herself because of her troubles.\" I would bring my father down in sorrow to the grave. It is better not to do it.'",
      "links": "<a href='/AIV/01/42/38'>Genesis 42:38</a>",
      "comment": "Sarah’s struggle emphasizes the pain of bearing false accusation, and her decision to spare her father echoes the commandment to honor parents (Exodus 20:12)."
    },
    {
      "pk": 1553010,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 10,
      "text": "Then she prayed at the window, and said, 'Blessed are You, O Lord my God! May Your holy and glorious Name be blessed and honored forever! Let all Your creation praise You forever.'",
      "links": "<a href='/AIV/19/103/1'>Psalm 103:1</a>; <a href='/AIV/19/113/2'>Psalm 113:2</a>",
      "comment": "Sarah’s turn to prayer in darkness demonstrates trust in God even when hope seems lost—anticipating Christ’s own prayer from the cross."
    },
    {
      "pk": 1553011,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 11,
      "text": "'At this time, my eyes turn to You for help.'",
      "links": "<a href='/AIV/19/121/1-2'>Psalm 121:1–2</a>",
      "comment": "A direct echo of the Psalms—looking to God as the ultimate source of deliverance. The heart seeking God in despair is a recurring biblical motif."
    },
    {
      "pk": 1553012,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 12,
      "text": "'Command that I be taken away from the earth, so I may no longer hear such insults.'",
      "links": "<a href='/AIV/19/69/20'>Psalm 69:20</a>",
      "comment": "Sarah’s prayer mirrors the honest cries of those suffering, yet trusting that God hears the brokenhearted (Psalm 34:18)."
    },
    {
      "pk": 1553013,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 13,
      "text": "'You know, O Master, that I have kept myself pure. I have never defiled my name, nor my father’s name, in the land of my captivity.'",
      "links": "<a href='/AIV/27/1/8'>Daniel 1:8</a>",
      "comment": "Sarah’s commitment to holiness foreshadows the biblical call to remain undefiled, as seen in Daniel and the New Testament teaching to keep oneself pure (James 1:27)."
    },
    {
      "pk": 1553014,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 14,
      "text": "'I have never joined myself to any man, nor have I dishonored myself with any unworthy companion.'",
      "links": "<a href='/AIV/19/18/23'>Psalm 18:23</a>",
      "comment": "Sarah’s personal integrity is highlighted, paralleling themes found in Proverbs 31 and the perpetual call to spiritual purity."
    },
    {
      "pk": 1553015,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 15,
      "text": "'But if it is not Your will to take my life now, O Lord, listen to my prayer, and spare me from being insulted.'",
      "links": "<a href='/AIV/19/31/15'>Psalm 31:15</a>",
      "comment": "Even in adversity, Sarah submits her life to God’s will, similar to Christ’s prayer in Gethsemane, 'Not my will, but Yours be done' (Luke 22:42)."
    },
    {
      "pk": 1553016,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 16,
      "text": "At that very moment, the prayers of both Tobit and Sarah were heard in the presence of the glory of the Most High.",
      "links": "<a href='/AIV/19/34/15'>Psalm 34:15</a>; <a href='/AIV/66/8/3-4'>Revelation 8:3–4</a>",
      "comment": "God’s compassion and providence are emphasized. The convergence of their prayers shows the mysterious unity in God’s response to individual suffering—pointing toward the communal nature of prayer and intercession."
    },
    {
      "pk": 1553017,
      "translation": "AIV",
      "book": 17,
      "chapter": 3,
      "verse": 17,
      "text": "And Raphael was sent to heal both of them: to remove the white spots from Tobit’s eyes, so he could see God’s light again; and to give Sarah the daughter of Raguel as a wife to Tobiah son of Tobit, to free her from the demon that tormented her. For Tobiah was the one whom she was meant to marry, according to the decree of Heaven. At that time, as Tobit returned to his house from the courtyard, Sarah came down from her upper room.",
      "links": "<a href='/AIV/17/5/4'>Tobit 5:4</a>; <a href='/AIV/17/12/15'>Tobit 12:15</a>; <a href='/AIV/19/103/20'>Psalm 103:20</a>",
      "comment": "Raphael’s mission reveals God’s use of ministering spirits for healing and guidance (Hebrews 1:14), emphasizing the reality of angelic intercession. The concept of a divinely arranged marriage foreshadows the greater union prepared for God’s people (Revelation 19:7)."
    }
  ],
  "translatedAt": "2025-12-23T09:08:10.744Z"
}