{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 11,
  "verses": [
    {
      "pk": 17011001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 1,
      "text": "As they were on their way, drawing near to Nineveh, Raphael said to Tobias,",
      "links": "<a href='/AIV/17/5/5'>Tob. 5:5</a>; <a href='/AIV/17/6/1'>Tob. 6:1</a>",
      "comment": "This marks a turning point of return and fulfillment—a recurring theme in salvation history. Notice the angel's role as a guide, echoing angelic aid elsewhere (Genesis 24:7, Acts 12:7)."
    },
    {
      "pk": 17011002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 2,
      "text": "\"You know what we promised your father. Let us hurry ahead of your wife and prepare the house while the others follow.\"",
      "links": "<a href='/AIV/17/5/17'>Tob. 5:17</a>",
      "comment": "Raphael reminds Tobias of his promises, highlighting the virtue of faithfulness (cf. Luke 16:10). The angel's urgency points to the readiness required for God's blessings."
    },
    {
      "pk": 17011003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 3,
      "text": "So they hurried on together. Meanwhile, Anna was sitting and watching the road for her son.",
      "links": "<a href='/AIV/17/10/7'>Tob. 10:7</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Anna's vigil recalls the expectant faith seen throughout Scripture, as in the parable of the prodigal son (Luke 15:20)."
    },
    {
      "pk": 17011004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 4,
      "text": "She spotted him coming and said to his father, \"Look, your son is coming, and the man who went with him!\"",
      "links": "<a href='/AIV/17/11/15'>Tob. 11:15</a>",
      "comment": "Family reunion and recognition are prominent. The motif echoes scenes of restoration—see Genesis 45:26-28."
    },
    {
      "pk": 17011005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 5,
      "text": "Before Tobias reached his father, Raphael said to him, \"I know that his eyes will be opened.",
      "links": "<a href='/AIV/17/2/10'>Tob. 2:10</a>; <a href='/AIV/43/9/6-7'>John 9:6-7</a>",
      "comment": "The angel foretells healing, a sign pointing toward miracles in Christ's ministry (John 9:6-7). Physical healing symbolizes spiritual restoration."
    },
    {
      "pk": 17011006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 6,
      "text": "Spread the fish’s gall on his eyes; the medicine will cause the white films to shrink and peel off. Your father will regain his sight and see the light of day.\"",
      "links": "<a href='/AIV/17/6/8-9'>Tob. 6:8-9</a>",
      "comment": "The use of the fish gall as medicinal points to the blending of natural means and divine intervention. God often works through creation (2 Kings 5:14; John 9:11)."
    },
    {
      "pk": 17011007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 7,
      "text": "Then Tobias applied the gall as Raphael told him. His father Tobit, who was nearly blind, rubbed his eyes.",
      "links": "<a href='/AIV/17/2/10'>Tob. 2:10</a>",
      "comment": "Obedience to angelic instruction was key for Tobit’s healing. God rewards trust and cooperation with His messengers (Luke 1:38)."
    },
    {
      "pk": 17011008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 8,
      "text": "Tobias gently spread the medicine. When his eyes began to sting, he rubbed them, and the white films peeled off from the corners.",
      "links": "<a href='/AIV/17/6/9'>Tob. 6:9</a>",
      "comment": "Note the process rather than instant healing—often, God's work in our lives is transformative rather than sudden (Mark 8:23-25)."
    },
    {
      "pk": 17011009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 9,
      "text": "Then, seeing his son, he fell upon his neck, weeping, and said, \"I see you, my son, the light of my eyes.\"",
      "links": "<a href='/AIV/17/10/7'>Tob. 10:7</a>; <a href='/AIV/42/15/20-24'>Luke 15:20-24</a>",
      "comment": "There is deep joy at restoration—an image of God's paternal love (cf. Genesis 46:29; Luke 15:20). The language relates to christological metaphors: Christ as the light (John 1:9; 8:12)."
    },
    {
      "pk": 17011010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 10,
      "text": "He continued, \"Blessed are you, O God, and blessed is your name forever! Blessed are all your holy angels!",
      "links": "<a href='/AIV/19/103/20-21'>Ps. 103:20-21</a>; <a href='/AIV/66/7/12'>Rev. 7:12</a>",
      "comment": "Giving thanks, Tobit models praise for God’s messengers, paralleling liturgical worship and the role of angels in the heavenly assembly."
    },
    {
      "pk": 17011011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 11,
      "text": "For you chastised me, but now you have shown me mercy; see, I behold my son Tobias!\"",
      "links": "<a href='/AIV/19/118/18'>Ps. 118:18</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "God’s correction is always for the purpose of restoration (Hebrews 12:6). The themes of discipline and mercy foreshadow the New Covenant."
    },
    {
      "pk": 17011012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 12,
      "text": "So Tobit rejoiced, and Anna his wife ran up to him. She threw her arms around her son, saying, \"Now that I see you, my child, I am content to die.\" And they both wept for joy.",
      "links": "<a href='/AIV/17/10/7'>Tob. 10:7</a>; <a href='/AIV/42/2/29-30'>Luke 2:29-30</a>",
      "comment": "Anna's reaction echoes Simeon’s song at Christ’s presentation (Luke 2:29-30), showing fulfillment and peace upon beholding one's beloved."
    },
    {
      "pk": 17011013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 13,
      "text": "Tobit got up and, walking through the door of his house, blessed God with thanksgiving. Then with a loud voice he proclaimed to all the people, \"Bless God and proclaim his greatness to all the living children, for he has had mercy on me!\"",
      "links": "<a href='/AIV/19/107/8'>Ps. 107:8</a>; <a href='/AIV/42/8/39'>Luke 8:39</a>",
      "comment": "Tobit acts as a witness. Public proclamation of thanksgiving recalls the biblical tradition of corporate worship (cf. Ps. 107:8; Acts 3:8)."
    },
    {
      "pk": 17011014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 14,
      "text": "For he has chastened me, and behold, I see my son Tobias!\" And Tobit’s son entered the house rejoicing, blessing God with all his heart.",
      "links": "<a href='/AIV/19/94/12'>Ps. 94:12</a>",
      "comment": "Repeated focus on discipline and restoration highlights a theology of suffering that leads to deeper joy. Notice the unity of father and son in worship; this models the faith handed down through generations."
    },
    {
      "pk": 17011015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 15,
      "text": "Tobit then made Sara, his son's wife, welcome and blessed her: \"Come in, my daughter! Blessed are you! Enter the house in safety, in joy, and with blessing.",
      "links": "<a href='/AIV/17/7/16'>Tob. 7:16</a>; <a href='/AIV/8/24/67'>Gen. 24:67</a>",
      "comment": "Sara’s welcome is solemn, formal, and liturgical in tone—akin to entering a sacred household. Parallels to Rebecca’s welcome (Gen. 24:67), emphasizing family as a realm of divine blessing."
    },
    {
      "pk": 17011016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 16,
      "text": "He then told her how God had worked mercy for them, and his joy was great. So all the Jews who were in Nineveh came to see Tobit as he rejoiced.",
      "links": "<a href='/AIV/17/2/8'>Tob. 2:8</a>; <a href='/AIV/21/8/15'>Eccl. 8:15</a>",
      "comment": "God’s assistance is not only personal but serves as a sign for the community. Sharing news of God's works fosters communal faith (Acts 2:46-47)."
    },
    {
      "pk": 17011017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 17,
      "text": "Tobit gave thanks before them, declaring how God had mercifully restored his sight.",
      "links": "<a href='/AIV/19/30/11-12'>Ps. 30:11-12</a>; <a href='/AIV/42/17/15'>Luke 17:15</a>",
      "comment": "Testimony leads to praise. Healing is not simply private—it’s for God’s glory before others (Luke 17:15)."
    },
    {
      "pk": 17011018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 11,
      "verse": 18,
      "text": "Then Tobit lived to see the day when Sara, the wife of his son Tobias, bore him a grandson. In great joy, he saw his descendants before he died.",
      "links": "<a href='/AIV/1/50/23'>Gen. 50:23</a>; <a href='/AIV/42/2/36'>Luke 2:36</a>",
      "comment": "This verse concludes with a note of fulfillment—seeing one's grandchildren is a sign of divine favor (Genesis 50:23). The family line continues, reflecting God’s faithfulness to His promises. In a spiritual sense, this foreshadows believers' hope to see the fruit of faith in future generations."
    }
  ],
  "translatedAt": "2025-12-24T04:58:29.869Z"
}