{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 3,
  "verses": [
    {
      "pk": 17003001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 1,
      "text": "Grieved in spirit, with tears in his eyes, I, Tobit, sighed and began to pray and to speak:",
      "links": "<a href='/AIV/19/6/6'>Ps. 6:6</a>; <a href='/AIV/18/16/20'>Job 16:20</a>",
      "comment": "Tobit's response to suffering is prayer and lament, showing the biblical pattern of crying out to God in distress. This echoes the psalmist’s practice and points to a spirituality of trust in God."
    },
    {
      "pk": 17003002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 2,
      "text": "You are righteous, O Lord, and all your deeds are just. All your ways are mercy and truth; you judge the world.",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>; <a href='/AIV/05/32/4'>Deut. 32:4</a>",
      "comment": "Tobit affirms the goodness and justice of God, even amid his trials, reflecting deep submission to divine providence. This kind of prayer shows the Old Testament foundation for enduring faith and trust."
    },
    {
      "pk": 17003003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 3,
      "text": "Remember me, and look upon me. Do not punish me for my sins or for the offenses of my ancestors. For we sinned against you,",
      "links": "<a href='/AIV/19/25/7'>Ps. 25:7</a>; <a href='/AIV/02/20/5'>Exod. 20:5</a>",
      "comment": "Tobit's recognition of generational sin and plea for mercy mirrors prayers in the Psalms and the prophets. This is important for understanding the need for God’s grace, foreshadowing the eventual outpouring of mercy through Christ."
    },
    {
      "pk": 17003004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 4,
      "text": "and did not keep your commandments. For this you have given us over to plunder, captivity, and death. You have made us a byword, a reproach, in all the nations where you have scattered us.",
      "links": "<a href='/AIV/24/29/18'>Jer. 29:18</a>; <a href='/AIV/27/9/7'>Dan. 9:7'</a>",
      "comment": "The scattering and suffering of Israel is interpreted as divine chastisement. This theme will later find resonance in the Church’s understanding of chastening and communal responsibility."
    },
    {
      "pk": 17003005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 5,
      "text": "Now your judgments concerning me are true, for I have not kept your commandments. And you have handed me over to trouble and hardship, to captivity and to darkness.",
      "links": "<a href='/AIV/25/1/18'>Lam. 1:18</a>; <a href='/AIV/05/28/29'>Deut. 28:29</a>",
      "comment": "A heartfelt acknowledgment of God's justice, paralleling lament traditions and deepening the theme of contrition, which is integral to Christian repentance and confession."
    },
    {
      "pk": 17003006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 6,
      "text": "Now deal with me as you will; command my spirit to be taken from me, so that I may be released and become earth again. For it is better for me to die than to live in distress, having heard false insults, so that I may no longer experience these trials.",
      "links": "<a href='/AIV/18/3/21'>Job 3:21</a>; <a href='/AIV/19/13/3'>Ps. 13:3</a>",
      "comment": "Tobit’s plea for death echoes Job and the psalmists, showing the biblical depth of human suffering but also pointing to trust in God’s sovereignty over life and death."
    },
    {
      "pk": 17003007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 7,
      "text": "On the same day, in Media, Sarah the daughter of Raguel also was insulted by her father’s female servants.",
      "links": "<a href='/AIV/17/4/4'>Esther 4:4</a>",
      "comment": "The narrative introduces Sarah, intertwining her story with Tobit’s, both suffering in innocence. This parallelism sets up the theme of God’s providential care for the faithful remnant."
    },
    {
      "pk": 17003008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 8,
      "text": "She had been married to seven husbands, but the evil spirit Asmodeus had killed them all before they had been with her as a wife. The servants said to her, 'You kill your husbands! See, you have already had seven, and have not enjoyed any of them.'",
      "links": "<a href='/AIV/01/38/7'>Gen. 38:7</a>",
      "comment": "Sarah’s affliction by an evil spirit highlights spiritual warfare and the need for deliverance. The number seven suggests completeness of her suffering, and prefigures liberation through divine intervention."
    },
    {
      "pk": 17003009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 9,
      "text": "Why do you beat us? If they are dead, go with them! May we never see a son or daughter of yours!'",
      "links": "<a href='/AIV/09/1/6'>1 Sam. 1:6</a>",
      "comment": "Sarah’s sorrow is compounded by mockery and despair, echoing the experiences of other godly women who suffered barrenness and misunderstanding—yet became vehicles of God’s grace."
    },
    {
      "pk": 17003010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 10,
      "text": "Sarah was deeply troubled and began to weep. She went up to her father's upper room, intending to hang herself. But she thought, 'They might reproach my father and say, “You had one beloved daughter, and she hanged herself in her sorrow.” I would bring my father's old age with sorrow down to the grave.'",
      "links": "<a href='/AIV/01/37/35'>Gen. 37:35</a>; <a href='/AIV/09/31/4'>1 Sam. 31:4</a>",
      "comment": "Sarah resists despair out of love and concern for her father. The sanctity of life and the consequences of actions frame her internal battle—a theme foundational for the Christian understanding of hope and redemptive suffering."
    },
    {
      "pk": 17003011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 11,
      "text": "So she prayed by the window and said: 'Blessed are you, O Lord my God, and blessed is your holy and glorious name forever. May all your works praise you forever.'",
      "links": "<a href='/AIV/19/145/21'>Ps. 145:21</a>; <a href='/AIV/27/3/28'>Dan. 3:28</a>",
      "comment": "Sarah turns pain into prayer, blessing the Lord in her anguish. Parallel to Mary’s Magnificat (<a href='/AIV/42/1/46-55'>Luke 1:46-55</a>), this points to the transforming power of praise even in suffering."
    },
    {
      "pk": 17003012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 12,
      "text": "Now, O Lord, I turn my face and my eyes away from life. Command that I be released from the earth, and no longer hear such insults.",
      "links": "<a href='/AIV/19/13/3'>Ps. 13:3</a>",
      "comment": "Sarah’s lament is honest yet directed to God, modeling authentic prayer. She seeks release, but surrenders her life to God’s will—anticipating the Christian call to trust even without understanding."
    },
    {
      "pk": 17003013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 13,
      "text": "'You know, O Lord, that I am innocent of any defilement with a man,",
      "links": "<a href='/AIV/19/17/3'>Ps. 17:3</a>",
      "comment": "Sarah appeals to God's omniscience and her innocence. Innocent suffering is a theme that finds fulfillment in Christ, the truly Innocent One who bears reproach for others."
    },
    {
      "pk": 17003014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 14,
      "text": "and that I have not defiled my name or my father’s name in this land of captivity.'",
      "links": "<a href='/AIV/27/1/8'>Dan. 1:8</a>",
      "comment": "Maintaining holiness and reputation in exile parallels Daniel and others in the Old Testament—anticipating the call for Christ’s followers to be pure and faithful 'exiles' in the world."
    },
    {
      "pk": 17003015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 15,
      "text": "'And if it pleases you, Lord, to take my life, command me to be taken away, so that I may be released from earthly sorrow and never again hear such reproach.'",
      "links": "<a href='/AIV/18/3/20-21'>Job 3:20-21</a>",
      "comment": "Total surrender to God’s will is learned here. The believer relies on God’s wisdom and timing, hints of Christ’s 'not my will but yours be done' (<a href='/AIV/42/22/42'>Luke 22:42</a>)."
    },
    {
      "pk": 17003016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 16,
      "text": "At that very moment, the prayers of both were heard in the glorious presence of God.",
      "links": "<a href='/AIV/02/2/23-25'>Exod. 2:23-25</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "God’s readiness to hear the prayers of the suffering shows his mercy and providence. The simultaneous response foreshadows God’s mysterious ordering and preparation for redemptive encounters."
    },
    {
      "pk": 17003017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 3,
      "verse": 17,
      "text": "And Raphael was sent to heal the two: to remove the white spots from Tobit’s eyes, and to give Sarah, daughter of Raguel, as a wife to Tobias, the son of Tobit, and to bind Asmodeus the evil spirit; for Tobias was entitled to her by law. At the same time that Tobit returned from the courtyard into his house, Sarah descended from the upper room.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/27/3/28'>Dan. 3:28</a>",
      "comment": "Angelic mediation is introduced—Raphael as divine helper, paralleling many episodes where God sends messengers to answer prayer (<a href='/AIV/42/1/26-38'>Luke 1:26-38</a>). This underlines the biblical role of intercession and divine agents in fulfilling God’s will for the faithful, reflecting the unity of God's plan and the importance of the community in salvation."
    }
  ],
  "translatedAt": "2025-12-24T04:55:09.697Z"
}