{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 10,
  "verses": [
    {
      "pk": 17010001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 1,
      "text": "Meanwhile, Tobit was counting each day that Tobias was delayed. When many days had passed and Tobias did not return, Tobit said, 'Could something have happened? Has he been detained, or has Gabael died and no one returned the money?'",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/17/1/15'>Tobit 1:15</a>",
      "comment": "Tobit's anxiety for his son and the awaited repayment echoes the theme of trust in God's providence. Like Abraham waiting for Isaac (Genesis 22), Tobit must trust through uncertainty."
    },
    {
      "pk": 17010002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 2,
      "text": "And he became very troubled.",
      "links": "<a href='/AIV/18/6/26'>Job 6:26</a>; <a href='/AIV/19/77/3'>Ps. 77:3</a>",
      "comment": "The distress of Tobit highlights the human experience of worry and waiting. Note Job’s similar emotional struggle (Job 6:26) and the Psalms’ expressions of sorrow (Psalm 77:3)."
    },
    {
      "pk": 17010003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 3,
      "text": "Anna, his wife, said, 'My son has perished.' But Tobit replied, 'Be still and do not be troubled. He is safe.'",
      "links": "<a href='/AIV/17/5/18'>Tobit 5:18-22</a>; <a href='/AIV/45/4/20'>Rom. 4:20</a>",
      "comment": "Anna’s maternal concern contrasts Tobit’s reassurance rooted in faith. The call to trust echoes Abraham’s unwavering hope (Romans 4:20), subtly encouraging confidence in the unseen workings of God."
    },
    {
      "pk": 17010004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 4,
      "text": "But Anna went out every day along the road by which they had departed, and she watched the road. Evening would fall, and then she would go home, and mourn and weep, grieving deeply for her son.",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Anna’s persistent longing mirrors the heart of the father in the parable of the prodigal son (Luke 15:20), showing parental love as a reflection of God’s own mercy and readiness to embrace the repentant."
    },
    {
      "pk": 17010005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 5,
      "text": "But Tobit grieved for his son each day, remembering how his journey had been dangerous. He said, 'Why has my son delayed? Might he have been harmed there?'",
      "links": "<a href='/AIV/19/142/2'>Ps. 142:2</a>; <a href='/AIV/17/6/1-6'>Tobit 6:1-6</a>",
      "comment": "Tobit’s ongoing grief is a reminder that even those strong in faith encounter worry, similar to David’s laments (Psalm 142:2). That anxious love provides a window into God’s own concern for us."
    },
    {
      "pk": 17010006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 6,
      "text": "But Raphael said to Tobias, 'Azariah, take me home, for my father and mother have lost their hope and are deeply troubled.'",
      "links": "<a href='/AIV/17/5/19'>Tobit 5:19</a>; <a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "Raphael’s concern for Tobit and Anna foreshadows the ministry of angels, mediating comfort and guidance. Jesus promised His disciples encouragement through tribulation (John 16:33), showing God’s sent help in difficult times."
    },
    {
      "pk": 17010007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 7,
      "text": "But Raguel said to Tobias, 'Stay, my child, and I will send messengers to your father. Let me give you half of my possessions. You will return safe to your father, and I will send Sarra, your wife, with you. May the Lord grant you prosperity.'",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/17/7/13'>Tobit 7:13</a>; <a href='/AIV/1/24/60'>Gen. 24:60</a>",
      "comment": "Raguel’s generous offer recalls Old Testament blessings over new marriages (Genesis 24:60), highlighting the importance of family and transmission of spiritual inheritance across generations."
    },
    {
      "pk": 17010008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 8,
      "text": "Tobias replied, 'I cannot stay, for my father and mother will be anxious. Let me go home.'",
      "links": "<a href='/AIV/42/2/49'>Luke 2:49'</a>; <a href='/AIV/17/5/22'>Tobit 5:22</a>",
      "comment": "Tobias’ eagerness to return reflects Christ’s urgency in fulfilling His mission and obeying His Father (Luke 2:49). The obedience of the son to the parents highlights the significance of the fourth commandment."
    },
    {
      "pk": 17010009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 9,
      "text": "So Raguel gave Tobias Sarra, his wife, along with half of his possessions: servants, cattle, and money.",
      "links": "<a href='/AIV/17/7/13-14'>Tobit 7:13-14</a>; <a href='/AIV/19/112/3'>Ps. 112:3</a>",
      "comment": "The transfer of wealth and blessing at marriage reflects covenantal faithfulness and echoes biblical patterns of inheritance and provision (Psalm 112:3)."
    },
    {
      "pk": 17010010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 10,
      "text": "He blessed them and said, 'May the God of heaven grant you a peaceful journey, my children.'",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/1/28/4'>Gen. 28:4</a>",
      "comment": "Raguel’s blessing invokes God as the source of security and peace, reminiscent of patriarchal blessings (Genesis 28:4). The emphasis on God’s providence prepares readers to grasp the sacramental reality of blessing."
    },
    {
      "pk": 17010011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 11,
      "text": "He sent his daughter away with Tobias, and Edna, his wife, and Sarra comforted each other as they departed.",
      "links": "<a href='/AIV/17/7/16'>Tobit 7:16</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "The close relationship among Edna, Sarra, and Tobias shows the importance of family unity during times of transition, pointing to the spiritual support found within the believing community."
    },
    {
      "pk": 17010012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 12,
      "text": "Raguel said to Tobias, 'My dear son, may the Lord of heaven bring you safely, and may I see your children before I die.'",
      "links": "<a href='/AIV/19/128/6'>Ps. 128:6</a>; <a href='/AIV/1/50/23'>Gen. 50:23</a>",
      "comment": "The longing to see grandchildren is a biblical theme (Psalm 128:6; Genesis 50:23), symbolizing hope for blessing and continuity within God’s people—a hint at the spiritual fruitfulness promised to those who remain in the covenant."
    },
    {
      "pk": 17010013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 13,
      "text": "He embraced Sarra his daughter and said, 'My child, honor your father and mother-in-law; they are now your parents. May I hear good news of you until my end.' Then he kissed her and let her go.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/41/7/10'>Mark 7:10</a>",
      "comment": "Raguel charges Sarra to honor her new parents, tying in the commandment to honor one’s father and mother (Exodus 20:12; Mark 7:10). This deepens the theology of obedience and familial authority, which foreshadows the Church’s structure and spiritual parenthood."
    },
    {
      "pk": 17010014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 14,
      "text": "He blessed them and said, 'May the Lord of heaven protect you all the days of your life.'",
      "links": "<a href='/AIV/19/121/7-8'>Ps. 121:7-8</a>; <a href='/AIV/17/12/20'>Tobit 12:20</a>",
      "comment": "The closing blessing invokes lasting divine protection, much like the priestly blessing (Psalm 121:7-8). This foreshadows the practice of blessing in the liturgical tradition, preparing hearts for a deeper appreciation of sacramental grace."
    }
  ],
  "translatedAt": "2025-12-24T04:57:59.002Z"
}