{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 1,
  "verses": [
    {
      "pk": 3400101,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 1,
      "text": "The words of Tobit, son of Tobiel, son of Ananiel, son of Aduel, son of Gabael, of the descendants of Asiel, from the tribe of Naphtali.",
      "links": "<a href='/AIV/04/26/48'>Num. 26:48</a>",
      "comment": "This introduction roots Tobit in Israel’s history, establishing his lineage and tribal identity, a common feature for highlighting faithful figures in Scripture. The mention of specific ancestors connects Tobit to God's covenant people. See also genealogical lists: <a href='/AIV/13/7/13-14'>1 Chr. 7:13–14</a>."
    },
    {
      "pk": 3400102,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 2,
      "text": "He was taken captive during the days of Shalmaneser, king of the Assyrians, from Thisbe, which is south of Kedesh Naphtali in upper Galilee, above Asher toward the west and north of Phogor.",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>",
      "comment": "The Assyrian exile is a key moment in Israel’s history. Tobit’s faithfulness remains despite living in exile, prefiguring the New Testament concept of living faithfully as a ‘resident alien’ (see <a href='/AIV/60/2/11'>1 Pet. 2:11</a>)."
    },
    {
      "pk": 3400103,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 3,
      "text": "I, Tobit, have walked all the days of my life in truth and righteousness. I did much almsgiving to my relatives and to my people who came with me as exiles to Nineveh, in the land of the Assyrians.",
      "links": "<a href='/AIV/40/6/1-4'>Matt. 6:1–4</a>",
      "comment": "Tobit’s righteousness includes both just living and acts of charity. Almsgiving is shown as essential, previewing New Testament teaching that true religion is found in both faith and works. (See <a href='/AIV/59/1/27'>Jas. 1:27</a>)."
    },
    {
      "pk": 3400104,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 4,
      "text": "When I was young, I lived in Israel’s land, but all my tribe of Naphtali rebelled against the house of David and Jerusalem. Jerusalem was the city chosen from all the tribes of Israel for sacrifices. The temple, God’s dwelling, had been built and consecrated for all generations forever.",
      "links": "<a href='/AIV/11/14/21-24'>1 Kings 14:21-24</a>; <a href='/AIV/14/6/2'>2 Chr. 6:2</a>",
      "comment": "Emphasis on Jerusalem and the temple as the spiritual heart underscores the importance of sacramental worship, foreshadowing the importance of right worship in the New Covenant (cf. <a href='/AIV/43/4/21-24'>John 4:21–24</a>)."
    },
    {
      "pk": 3400105,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 5,
      "text": "All the tribes that joined in revolt offered sacrifices to the calf Baal that Jeroboam, king of Israel, had made in Dan and on all the mountains of Galilee.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kings 12:28–30</a>",
      "comment": "Idolatry was the root cause of Israel’s downfall. Right worship and obedience are central to covenant fidelity. This calls God's people today to remain faithful to the worship He commands (cf. <a href='/AIV/45/1/22-25'>Rom. 1:22–25</a>)."
    },
    {
      "pk": 3400106,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 6,
      "text": "But I alone would often go to Jerusalem for the feasts, as it was decreed for all Israel, with the firstfruits and the tithes of produce, and the first shearing. These I would give at the altar to the priests, the sons of Aaron.",
      "links": "<a href='/AIV/05/12/5-6'>Deut. 12:5–6</a>",
      "comment": "Tobit’s faithfulness in keeping the feasts and supporting the priests highlights the importance of liturgical worship and supporting those set apart for sacred service. This anticipates later Christian practice of supporting ordained leaders (see <a href='/AIV/54/5/17-18'>1 Tim. 5:17–18</a>)."
    },
    {
      "pk": 3400107,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 7,
      "text": "To the Levites who served at Jerusalem, I would give the tithe of grain, wine, olive oil, and pomegranates. Every third year, I gave it to orphans, widows, and the foreigners living among us, as the Law of Moses commands, and I followed these regulations faithfully since my youth.",
      "links": "<a href='/AIV/05/14/28-29'>Deut. 14:28–29</a>",
      "comment": "Systematic support for the vulnerable mirrors the New Testament call to charity and justice (see <a href='/AIV/59/1/27'>Jas. 1:27</a>). Tobit’s obedience exemplifies living faith supported by works of mercy."
    },
    {
      "pk": 3400108,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 8,
      "text": "We ate according to the traditions of the Law, just as all my ancestors and the tribe of Naphtali did.",
      "links": "<a href='/AIV/03/11/46-47'>Lev. 11:46–47</a>",
      "comment": "Observing dietary laws was a sign of covenant faithfulness. While Christians are not bound by the old dietary laws, unity in worship and adherence to apostolic tradition remain important (cf. <a href='/AIV/44/15/28-29'>Acts 15:28–29</a>)."
    },
    {
      "pk": 3400109,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 9,
      "text": "But when I was a young man, in my own land, the entire tribe of my ancestor Naphtali turned away from the house of David and Jerusalem. They sacrificed to Baal, the heifer of gold, which Jeroboam, king of Israel, had made.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kings 12:28–30</a>",
      "comment": "The repetition underscores the gravity of apostasy and the narrative’s call to faithfulness even when surrounded by unfaithfulness. Standing apart for the truth, despite peer pressure, is a recurring biblical theme."
    },
    {
      "pk": 3400110,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 10,
      "text": "But I, all alone, would go often to Jerusalem for the appointed feasts, as it is prescribed for all Israel, and I brought the firstfruits and the tenth of the crops, and the first wool; and I would give these at the altar to the priests, sons of Aaron.",
      "links": "<a href='/AIV/02/23/15-17'>Exod. 23:15–17</a>",
      "comment": "Personal devotion, and specifically sacrificial giving, marks the truly faithful. This points forward to the New Testament’s stress on sacrificial love and self-offering (cf. <a href='/AIV/45/12/1'>Rom. 12:1</a>)."
    },
    {
      "pk": 3400111,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 11,
      "text": "To the Levites who served in Jerusalem, I gave the tithe of grain, wine, olive oil, pomegranates, and the rest of my harvest. Every third year I distributed it to the orphans, widows, and foreigners living among us, just as Moses’ Law commands, and I never neglected this practice.",
      "links": "<a href='/AIV/05/26/12'>Deut. 26:12</a>",
      "comment": "Reiterating care for the poor. Christian charity continues this pattern and is a mark of following Christ (see <a href='/AIV/40/25/35-40'>Matt. 25:35–40</a>)."
    },
    {
      "pk": 3400112,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 12,
      "text": "I went with my wife Anna and my son Tobias to Jerusalem for all the appointed festivals.",
      "links": "<a href='/AIV/05/16/16'>Deut. 16:16</a>",
      "comment": "Festival pilgrimage was an important family practice, showing unity and devotion. This foreshadows the Christian emphasis on worshiping together in the assembly (cf. <a href='/AIV/58/10/24-25'>Heb. 10:24–25</a>)."
    },
    {
      "pk": 3400113,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 13,
      "text": "I brought the firstfruits and tithes, and the first course of the animals, to the altar. I gave to the priests, the sons of Aaron, and to the Levites who served at Jerusalem. I also gave the second tithe in six years, according to Moses’ instruction, and I gave this to orphans, widows, and converts who had joined Israel.",
      "links": "<a href='/AIV/03/27/30'>Lev. 27:30</a>",
      "comment": "The ‘second tithe’ is a reminder of multiple layers of giving in the Law. Generosity toward the marginalized is an echo of God’s generous love."
    },
    {
      "pk": 3400114,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 14,
      "text": "And when I was taken captive to Assyria and entered as a prisoner into Nineveh, all my relatives and my people ate the food of the Gentiles, but I kept myself from eating unclean food.",
      "links": "<a href='/AIV/27/1/8'>Dan. 1:8</a>",
      "comment": "Focus on remaining undefiled in exile parallels Daniel’s example. Christ calls his followers to purity and faithfulness, especially when surrounded by compromising influences."
    },
    {
      "pk": 3400115,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 15,
      "text": "Because I remembered God with all my heart, the Most High gave me grace and favor before Shalmaneser, king of Assyria, and I managed to acquire all I needed.",
      "links": "<a href='/AIV/01/39/2-4'>Gen. 39:2–4</a>",
      "comment": "God honors those who honor Him, as seen in many biblical stories where God gives faithful individuals favor, even in foreign lands (<a href='/AIV/27/1/9'>Dan. 1:9</a>)."
    },
    {
      "pk": 3400116,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 16,
      "text": "Shalmaneser appointed me as his buyer of goods. Until his death, I went into Media and once left ten talents of silver in trust with Gabael, the brother of Gabrias, living in Rages of Media.",
      "links": "<a href='/AIV/17/4/1'>Tobit 4:1</a>",
      "comment": "Tobit’s trusted responsibilities and care for his family’s future continue the theme of faithful stewardship of God’s gifts."
    },
    {
      "pk": 3400117,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 17,
      "text": "When Shalmaneser died, Sennacherib reigned in his place. The roads to Media became unsafe, so I could no longer go there.",
      "links": "<a href='/AIV/12/18/13'>2 Kings 18:13</a>",
      "comment": "Historical details ground the narrative and also show how changing regimes affect faithfulness. Security and freedom to practice faith can be threatened, echoing Christian perseverance in difficult times."
    },
    {
      "pk": 3400118,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 18,
      "text": "During Sennacherib’s reign, I performed many acts of charity for my relatives. I gave bread to the hungry, clothing to the naked, and I buried those whom the king had put to death, casting their bodies outside the walls.",
      "links": "<a href='/AIV/40/25/35-36'>Matt. 25:35-36</a>",
      "comment": "Works of mercy—feeding the hungry, clothing the naked, and burying the dead—are highlighted as genuine marks of righteousness and are still considered vital Christian works of mercy today."
    },
    {
      "pk": 3400119,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 19,
      "text": "When Sennacherib killed many Israelites, I secretly took their bodies and buried them. When Sennacherib searched for them, he could not find them.",
      "links": "<a href='/AIV/40/5/10-12'>Matt. 5:10–12</a>",
      "comment": "Risking his own safety for acts of mercy, Tobit exemplifies faith that takes courageous action. Martyr-like virtue is already foreshadowed."
    },
    {
      "pk": 3400120,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 20,
      "text": "But a man from Nineveh informed the king that I had buried them, so I hid myself. When I realized I was being sought to be put to death, I was afraid and fled.",
      "links": "<a href='/AIV/58/11/35-38'>Heb. 11:35-38</a>",
      "comment": "God’s people have often faced persecution for doing what is right. Tobit’s flight is like Elijah’s flight from Jezebel (<a href='/AIV/11/19/3'>1 Kings 19:3</a>)."
    },
    {
      "pk": 3400121,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 21,
      "text": "Then all I owned was seized; nothing was left to me except my wife Anna and my son Tobias.",
      "links": "<a href='/AIV/18/1/21'>Job 1:21</a>",
      "comment": "Tobit suffers like Job, losing possessions but retaining faith. Suffering is not a sign of God’s absence, but sometimes a testing or purification, as Christ Himself endured."
    },
    {
      "pk": 3400122,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 22,
      "text": "But not long after, King Sennacherib was assassinated by his two sons. They fled to the mountains of Ararat, and Esarhaddon, his son, became king in his place. He appointed Ahikar, my brother Anael’s son, over all the accounts of his kingdom, and Ahikar interceded for me, so I returned to Nineveh. Ahikar had been the chief cupbearer, the keeper of the signet ring, and the administrator of the accounts under Sennacherib, king of Assyria, and Esarhaddon promoted him further.",
      "links": "<a href='/AIV/12/19/37'>2 Kings 19:37</a>",
      "comment": "God’s providence is seen in the fall of tyrants and the unexpected return of the righteous. Mediators like Ahikar prefigure Christ, our intercessor. Restoration after suffering is a theme repeated throughout Scripture (see <a href='/AIV/18/42/10'>Job 42:10</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:07:23.339Z"
}