{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 14,
  "verses": [
    {
      "pk": 6700140,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 1,
      "text": "After Tobit finished speaking, he passed away in peace at the age of one hundred and twelve.",
      "links": "<a href='/AIV/1/25/8'>Gen. 25:8</a>",
      "comment": "Tobit’s peaceful death echoes the patriarchs in Genesis who died ‘full of years,’ suggesting faithfulness to God brings peace in death."
    },
    {
      "pk": 6700141,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 2,
      "text": "He was buried honorably in Nineveh.",
      "links": "<a href='/AIV/17/1/20'>Tobit 1:20</a>",
      "comment": "The emphasis on honorable burial points to reverence for the body, a theme found throughout scripture that informs longstanding Christian practice."
    },
    {
      "pk": 6700142,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 3,
      "text": "He was sixty-two years old when he lost his sight, and after it was restored he lived another fifty years, giving alms and always praising the Lord.",
      "links": "<a href='/AIV/17/2/10'>Tobit 2:10</a>; <a href='/AIV/17/11/13'>Tobit 11:13</a>",
      "comment": "Tobit’s continued generosity and praise after suffering demonstrates perseverance in faith. See also James 1:12."
    },
    {
      "pk": 6700143,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 4,
      "text": "When he was dying, he called his son Tobiah, and urged him to leave Nineveh and go to Media, explaining that he had seen everything God had spoken come true regarding Nineveh’s destruction.",
      "links": "<a href='/AIV/17/13/12'>Tobit 13:12</a>; <a href='/AIV/23/10/12'>Isa. 10:12</a>",
      "comment": "Tobit’s prophecy and exhortation mirrors the warnings given by the prophets; see Amos 5:27."
    },
    {
      "pk": 6700144,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 5,
      "text": "For everything God spoke through his prophets concerning Israel and Assyria will surely happen. Not one word will fail. All will come true in their appointed times.",
      "links": "<a href='/AIV/23/55/11'>Isa. 55:11</a>; <a href='/AIV/06/21/45'>Josh. 21:45</a>",
      "comment": "God’s faithfulness to His word is affirmed. Compare with Isaiah 55:11 for the certainty of divine promises."
    },
    {
      "pk": 6700145,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 6,
      "text": "But you will see and experience everything for yourself—Jerusalem shall be rebuilt and the Temple restored with glory for every generation. All exiles of Israel will return and dwell there with security. A splendid house will be built for God, even more glorious than the former one.",
      "links": "<a href='/AIV/16/2/8'>Nehemiah 2:8</a>; <a href='/AIV/36/2/9'>Haggai 2:9</a>",
      "comment": "Foreshadows the restoration of the Temple, which has both a literal and eschatological interpretation, pointing ultimately to the heavenly worship and the unity of believers."
    },
    {
      "pk": 6700146,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 7,
      "text": "And all nations shall turn to fear the Lord God truly, burying their idols and blessing his name. All people, by their own strength, will come to fear the Lord, King of the heavens.",
      "links": "<a href='/AIV/23/2/2'>Isa. 2:2</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>",
      "comment": "Universal worship of God is foretold, tying to the prophets' vision of the Gentiles worshipping the true God. See Isaiah 2:2–4."
    },
    {
      "pk": 6700147,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 8,
      "text": "As Tobit had finished giving these commands to his son, he died and was buried with honor.",
      "links": "<a href='/AIV/17/14/2'>Tobit 14:2</a>; <a href='/AIV/01/50/13'>Gen. 50:13</a>",
      "comment": "Repetition of the honorable burial underscores respect for the deceased and continuity with patriarchal traditions."
    },
    {
      "pk": 6700148,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 9,
      "text": "Tobiah and his wife traveled to Media and lived in Ecbatana with Raguel, Tobiah’s father-in-law.",
      "links": "<a href='/AIV/17/7/1'>Tobit 7:1</a>",
      "comment": "Their move fulfills Tobit’s instruction, symbolizing obedience and family unity—even across nations."
    },
    {
      "pk": 6700149,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 10,
      "text": "He looked after his aged parents with respect, and buried them in Ecbatana in Media.",
      "links": "<a href='/AIV/02/20/12'>Exod. 20:12</a>",
      "comment": "Honoring one’s parents is a central biblical commandment. Tobiah’s care illustrates living faith through works, echoing James 2:17."
    },
    {
      "pk": 6700150,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 11,
      "text": "Tobiah inherited Raguel’s household, as well as his own father Tobit’s, and lived in high honor until old age.",
      "links": "<a href='/AIV/17/10/12'>Tobit 10:12</a>",
      "comment": "Inheritance and honor continue the biblical theme of God blessing those who are faithful."
    },
    {
      "pk": 6700151,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 12,
      "text": "He died in Ecbatana of Media at the age of one hundred and seventeen.",
      "links": "<a href='/AIV/17/14/1'>Tobit 14:1</a>",
      "comment": "Long life is seen as reward for righteousness and fidelity to God, reminiscent of Proverbs 3:1-2."
    },
    {
      "pk": 6700152,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 13,
      "text": "Before he died, he heard about the destruction of Nineveh, which Nebuchadnezzar and Ahasuerus had captured. He rejoiced at Nineveh’s fall, and praised the Lord God for all his works, as Tobit had commanded.",
      "links": "<a href='/AIV/23/10/13-14'>Isaiah 10:13-14</a>; <a href='/AIV/17/1/15'>Tobit 1:15</a>",
      "comment": "God’s justice is celebrated in the overthrow of the wicked. Tobiah maintains the pattern of praise and remembrance handed down to him."
    },
    {
      "pk": 6700153,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 14,
      "text": "So before he died, Tobiah witnessed the return of Israel from exile, and the glorious restoration of Jerusalem. He saw the Temple rebuilt, and lived in peace until his own death.",
      "links": "<a href='/AIV/16/6/15'>Nehemiah 6:15</a>; <a href='/AIV/19/122/1'>Psalm 122:1</a>",
      "comment": "The restoration of Jerusalem and the Temple is historically rooted and holds spiritual significance as a sign of God’s covenant faithfulness."
    },
    {
      "pk": 6700154,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 15,
      "text": "Then, all his descendants remained faithful, practicing justice and good works throughout all their days.",
      "links": "<a href='/AIV/17/2/6-7'>Tobit 2:6-7</a>; <a href='/AIV/19/112/2'>Psalm 112:2</a>",
      "comment": "The legacy of faith and works continues across generations, living out a tradition of righteousness. This reflects the biblical pattern of family passing on covenant blessings (cf. Psalm 112)."
    }
  ],
  "translatedAt": "2025-12-23T09:12:10.650Z"
}