{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 5,
  "verses": [
    {
      "pk": 3050001,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 1,
      "text": "Then Tobit answered his son Tobias, 'My child, remember to find a trustworthy man who will go with you for your journey. We will pay him his wages once you return, so go and seek him out.'",
      "links": "<a href='/AIV/43/4/19'>Tobit 4:19</a>; <a href='/AIV/1/24/2-4'>Gen. 24:2-4</a>",
      "comment": "Tobit encourages seeking God's guidance in choosing companions, echoing Abraham's care in Genesis 24."
    },
    {
      "pk": 3050002,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 2,
      "text": "Tobias went outside and found the angel Raphael standing before him, but he did not know he was an angel of God.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>; <a href='/AIV/58/13/2'>Heb. 13:2</a>",
      "comment": "The theme of angels appearing in human form is common in Scripture (see Hebrews 13:2)."
    },
    {
      "pk": 3050003,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 3,
      "text": "Tobias said to him, 'Can you go with me to Rages in Media? Do you know that route?'",
      "links": "",
      "comment": "Tobias seeks guidance from one who knows the way – a reminder of the biblical wisdom of seeking counsel."
    },
    {
      "pk": 3050004,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 4,
      "text": "Raphael answered, 'Yes, I know it well. I have traveled there many times and I know all the roads. I have stayed with our kinsman Gabael, who lives in Rages of Media. It’s a journey of two days from Ecbatana to Rages, for Rages is located in the mountains of Media.'",
      "links": "<a href='/AIV/43/1/14'>Tobit 1:14</a>",
      "comment": "The angel asserts familiarity with the way, prefiguring Christ as the One who knows and is the Way (cf. John 14:6)."
    },
    {
      "pk": 3050005,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 5,
      "text": "Tobias said to him, 'If you will come with me, I will pay you wages. Come with me and guide me safely; I will also pay you.'",
      "links": "<a href='/AIV/43/5/22'>Tobit 5:22</a>",
      "comment": "Tobias offers to compensate the guide—demonstrating fairness and just reward, reminiscent of passages about the worker's wage (Luke 10:7)."
    },
    {
      "pk": 3050006,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 6,
      "text": "Raphael replied, 'I will go with you. I am familiar with all the ways; I have even spent the night with our kinsman Gabael.'",
      "links": "<a href='/AIV/43/1/14'>Tobit 1:14</a>",
      "comment": "Raphael emphasizes his intimacy with the family, reflecting the angel's hidden role as a divine helper."
    },
    {
      "pk": 3050007,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 7,
      "text": "Then Tobias went in and informed his father Tobit, saying, 'I have found someone from the Israelites who will go with me.' He replied, 'Call the man to me, so I may learn to what tribe he belongs and whether he is trustworthy to go with you.'",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>",
      "comment": "Tobit's concern for heritage and trustworthiness reflects biblical care for faithfulness and communal bonds."
    },
    {
      "pk": 3050008,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 8,
      "text": "Tobias called Raphael and he came in. Tobit greeted him first and said, 'Young man, to which family and tribe do you belong?'",
      "links": "",
      "comment": "Tobit’s questioning shows a concern for tradition and belonging—values that underpin unity in faith and practice."
    },
    {
      "pk": 3050009,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 9,
      "text": "Raphael replied, 'Are you searching for a tribe or a family, or are you seeking a hired man to go with your son?' Tobit answered, 'I wish to know, my brother, both your family and your name.'",
      "links": "",
      "comment": "Names and genealogy are significant throughout Scripture (cf. Matthew 1), emphasizing continuity of God's plan."
    },
    {
      "pk": 3050010,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 10,
      "text": "Then Raphael said, 'I am Azariah, son of the great Hananiah, one of your relatives.'",
      "links": "",
      "comment": "The angel uses a human name and lineage, prefiguring ways God works through mediators in salvation history."
    },
    {
      "pk": 3050011,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 11,
      "text": "Tobit said, 'Welcome, my brother. Do not be angry with me for wanting to know your family and lineage. You seem to be a trustworthy and good man.'",
      "links": "",
      "comment": "Hospitality and discernment are presented as virtues."
    },
    {
      "pk": 3050012,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 12,
      "text": "He added, 'I knew Hananiah and Nathan, the two sons of the great Shemeliah, who went with me to Jerusalem and worshiped with me there.'",
      "links": "",
      "comment": "Connection through shared worship highlights the unity and continuity of true worship."
    },
    {
      "pk": 3050013,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 13,
      "text": "They were not led astray; your kindred are good men. You are of good lineage.'",
      "links": "",
      "comment": "The emphasis on faithful ancestry reflects on the importance of continuity and right teaching in the faith."
    },
    {
      "pk": 3050014,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 14,
      "text": "Then Raphael said, 'I will go with Tobias. Do not be afraid. We will return to you safe and sound.'",
      "links": "<a href='/AIV/43/12/6'>Tobit 12:6</a>",
      "comment": "A reassurance of God's providence through angelic guidance parallels divine care for His people."
    },
    {
      "pk": 3050015,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 15,
      "text": "Tobit said to him, 'May God go with you, and may his angel accompany you on your way.'",
      "links": "<a href='/AIV/2/24/20'>Ex. 24:20</a>; <a href='/AIV/19/91/11'>Ps. 91:11</a>",
      "comment": "Tobit’s blessing invokes the angelic protection promised elsewhere in Scripture."
    },
    {
      "pk": 3050016,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 16,
      "text": "So they got ready to go; Tobias kissed his father and mother. Tobit said to Tobias, 'May you have a safe journey.'",
      "links": "",
      "comment": "Parental blessing for a son recalls the patriarchal sending of children with prayerful support."
    },
    {
      "pk": 3050017,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 17,
      "text": "Anna, his mother, started weeping and said to Tobit, 'Why have you sent away our son? Isn’t he the staff of our hands as he enters and leaves before us?'",
      "links": "<a href='/AIV/1/42/38'>Gen. 42:38</a>",
      "comment": "Maternal sorrow echoes other biblical accounts of mothers anxious for their sons (cf. Rachel for Benjamin)."
    },
    {
      "pk": 3050018,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 18,
      "text": "Do not be deceived; the money is nothing compared to our child. What the Lord has given us to live on is enough.'",
      "links": "<a href='/AIV/40/6/25-34'>Matt. 6:25–34</a>",
      "comment": "Anna’s words highlight trust in God’s provision over material concerns (see Matthew 6:25–34)."
    },
    {
      "pk": 3050019,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 19,
      "text": "But Tobit said to her, 'Do not worry; our child will return safe. You will see him again, and your eyes will behold him.'",
      "links": "",
      "comment": "Tobit speaks hope in God’s providence and the ultimate reunion of loved ones."
    },
    {
      "pk": 3050020,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 20,
      "text": "Anna replied, 'Stop deceiving me. My son is gone.' And she began to weep.",
      "links": "",
      "comment": "Anna’s fear and sorrow remind us of the cost of faith and trust in God’s promises."
    },
    {
      "pk": 3050021,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 21,
      "text": "Tobit replied to her, 'Be quiet and do not worry. He is in good health, and there will be nothing wrong with him on his journey.'",
      "links": "",
      "comment": "Tobit’s steadfastness in adversity reflects the call to trust in God’s unseen protection."
    },
    {
      "pk": 3050022,
      "translation": "AIV",
      "book": 43,
      "chapter": 5,
      "verse": 22,
      "text": "So Anna stopped crying.",
      "links": "",
      "comment": "The chapter ends with comfort—underscoring peace through faith, trust in divine providence, and intercessory help, themes deepened throughout the history of the church."
    }
  ],
  "translatedAt": "2025-12-23T09:09:09.520Z"
}