{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 1,
  "verses": [
    {
      "pk": 17001001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 1,
      "text": "The words of Tobit, son of Tobiel, son of Hananiel, son of Aduel, son of Gabael, of the descendants of Asiel and the tribe of Naphtali,",
      "links": "<a href='/AIV/06/19/32-39'>Josh. 19:32–39</a>",
      "comment": "This introduction traces Tobit’s genealogy to the tribe of Naphtali, highlighting the continuation of Israel’s family lines, similar to how Matthew and Luke begin the narratives of Christ by establishing genealogy, emphasizing continuity and fulfillment of God’s promises (see <a href='/AIV/40/1/1-17'>Matt. 1:1–17</a> and <a href='/AIV/42/3/23-38'>Luke 3:23–38</a>)."
    },
    {
      "pk": 17001002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 2,
      "text": "who was taken captive from Thisbe, which is south of Kedesh Naphtali in Upper Galilee above Asher toward the west and north of Phogor.",
      "links": "<a href='/AIV/12/15/29'>2 Kgs 15:29</a>",
      "comment": "The mention of captivity and precise geography situates Tobit and his family within northern Israel’s turbulent history. This prepares the reader to see God’s faithfulness even in exile, foreshadowing later acts of deliverance."
    },
    {
      "pk": 17001003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 3,
      "text": "I, Tobit, walked in honesty and righteousness all the days of my life; I gave much in alms to my brothers and to my nation, who came with me to Nineveh in the land of the Assyrians.",
      "links": "<a href='/AIV/19/112/9'>Ps 112:9</a>; <a href='/AIV/40/6/1-4'>Matt 6:1-4</a>",
      "comment": "Tobit’s commitment to almsgiving and righteousness is a key theme, later emphasized by Christ (see <a href='/AIV/40/6/1-4'>Matt. 6:1-4</a>) and in early Christian life (see <a href='/AIV/44/10/2'>Acts 10:2</a>)."
    },
    {
      "pk": 17001004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 4,
      "text": "When I was young, I lived in the land of Israel, but all my tribe of Naphtali, my forefathers, and their house fell away from the house of David and Jerusalem,",
      "links": "<a href='/AIV/11/12/16-19'>1 Kgs 12:16-19</a>",
      "comment": "The split of Israel from Judah is recalled. This division would later be healed in the unity brought through Christ (<a href='/AIV/49/2/14-16'>Eph. 2:14-16</a>), who reunites God’s people."
    },
    {
      "pk": 17001005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 5,
      "text": "who were sacrificed at Jerusalem, the city chosen from all the tribes of Israel, where the sanctuary of God was built and His dwelling place was consecrated for all generations.",
      "links": "<a href='/AIV/11/8/44'>1 Kgs 8:44</a>; <a href='/AIV/13/7/12'>2 Chr 7:12</a>",
      "comment": "The mention of Jerusalem’s election and consecration subtly alludes to God’s enduring plan and the special significance Jerusalem retains, even as the New Testament declares Christ as the true and eternal temple (<a href='/AIV/43/2/19-21'>John 2:19-21</a>)."
    },
    {
      "pk": 17001006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 6,
      "text": "But all my tribe, along with the house of Naphtali, sacrificed to the calf Baal, which Jeroboam king of Israel had made in Dan and in all the mountains of Galilee.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kgs 12:28-30</a>",
      "comment": "Here, the north’s idolatry is condemned in light of the true worship God established in Jerusalem. True worship, instituted by God, is an important biblical motif later fulfilled in the worship of Christ in the New Covenant."
    },
    {
      "pk": 17001007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 7,
      "text": "But I alone often journeyed to Jerusalem for the feasts, as it is prescribed for all Israel by an everlasting decree, bringing the firstfruits and tithes of my produce and the first fleece, and giving them to the priests, the sons of Aaron, at the altar.",
      "links": "<a href='/AIV/03/23/1-44'>Lev 23</a>; <a href='/AIV/05/18/4-5'>Deut 18:4-5</a>",
      "comment": "Tobit’s faithfulness to pilgrimage and temple contributions mirrors early Christian devotion to worship and giving, highlighting the importance of visible, sacramental worship rooted in divine command."
    },
    {
      "pk": 17001008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 8,
      "text": "To the Levites I gave a tithe of grain, wine, olive oil, pomegranates, and other fruits. Every third year I would give the tithe to the orphans, widows, and immigrants living among the Israelites, as commanded in the Mosaic Law.",
      "links": "<a href='/AIV/05/14/28-29'>Deut 14:28-29</a>",
      "comment": "Almsgiving is emphasized as both a legal and moral responsibility, which Christ affirms and elevates (see <a href='/AIV/40/25/34-40'>Matt 25:34-40</a>)."
    },
    {
      "pk": 17001009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 9,
      "text": "I grew up with my wife Anna, and when we were married, I had a son named Tobias.",
      "links": "<a href='/AIV/01/2/24'>Gen 2:24</a>",
      "comment": "The mention of marriage and family points to God’s blessing through the covenant of marriage, which later acquires great significance in Christian teaching as a sign of Christ’s union with the church (<a href='/AIV/49/5/31-32'>Eph 5:31-32</a>)."
    },
    {
      "pk": 17001010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 10,
      "text": "When I was taken captive and brought to Assyria, I went to Nineveh; all my brothers and those of my people ate the food of the Gentiles,",
      "links": "<a href='/AIV/27/1/8'>Dan 1:8</a>",
      "comment": "Eating the Gentiles’ food symbolizes assimilation to foreign customs. Faithful resistance to such compromise is a recurring theme for righteous Israelites, seen also in Daniel’s refusal in Babylon."
    },
    {
      "pk": 17001011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 11,
      "text": "but I kept myself from eating that food,",
      "links": "<a href='/AIV/27/1/8'>Dan 1:8</a>",
      "comment": "Tobit’s dietary faithfulness anticipates later Christian emphasis on spiritual discipline and fidelity, calling believers to resist conforming to the world (<a href='/AIV/45/12/2'>Rom 12:2</a>)."
    },
    {
      "pk": 17001012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 12,
      "text": "because I remembered God with all my heart.",
      "links": "<a href='/AIV/05/6/5'>Deut 6:5</a>",
      "comment": "The call to love God wholeheartedly is echoed by Christ as the greatest commandment (<a href='/AIV/41/12/30'>Mark 12:30</a>). Tobit models personal fidelity."
    },
    {
      "pk": 17001013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 13,
      "text": "The Most High gave me favor and grace before Shalmaneser, and I became his purchasing agent.",
      "links": "<a href='/AIV/01/39/4'>Gen 39:4</a>",
      "comment": "Like Joseph in Egypt, Tobit finds favor with foreign rulers, showing God’s providence even in exile (<a href='/AIV/44/7/9-10'>Acts 7:9-10</a>)."
    },
    {
      "pk": 17001014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 14,
      "text": "Until his death, I would travel to Media to buy and sell for him, and I left in trust with Gabael, a kinsman in Rages of Media, ten talents of silver.",
      "links": "<a href='/AIV/17/2/7'>Tob 2:7</a>",
      "comment": "Tobit’s business affairs set the stage for later events, but also depict the reality of God’s people thriving in exile, maintaining honesty and faithful stewardship."
    },
    {
      "pk": 17001015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 15,
      "text": "When Shalmaneser died, Sennacherib his son became king. The roads to Media were closed, so I could no longer travel there.",
      "links": "<a href='/AIV/12/18/13'>2 Kgs 18:13</a>",
      "comment": "Changing political powers often affected the lives of exiled Jews, but God’s providence continues to operate through these circumstances."
    },
    {
      "pk": 17001016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 16,
      "text": "During the days of Sennacherib, I gave many alms to my brethren;",
      "links": "<a href='/AIV/19/41/1'>Ps 41:1</a>",
      "comment": "The steadfastness in almsgiving amid hardship imitates the sacrificial love taught in the Gospels."
    },
    {
      "pk": 17001017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 17,
      "text": "I would give my bread to the hungry, clothing to the naked, and, if I saw the dead among my people thrown outside the walls of Nineveh, I would bury them.",
      "links": "<a href='/AIV/23/58/7'>Isa 58:7</a>; <a href='/AIV/40/25/35-36'>Matt 25:35-36</a>",
      "comment": "Works of mercy — feeding the hungry, clothing the naked, and burying the dead — are foundational for Christian discipleship. These connect with the corporal works of mercy described by Jesus in Matthew 25."
    },
    {
      "pk": 17001018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 18,
      "text": "I buried those killed by Sennacherib, but when he searched for them, they were not found.",
      "links": "<a href='/AIV/19/37/28'>Ps 37:28</a>",
      "comment": "Burying the dead is shown as an act of piety, honoring the dignity of persons even in defiance of the ruling powers."
    },
    {
      "pk": 17001019,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 19,
      "text": "Then one of the people of Nineveh told the king about me, and I hid myself, realizing I was being sought to be put to death.",
      "links": "<a href='/AIV/09/19/2'>1 Sam 19:2</a>",
      "comment": "The righteous may face persecution, a theme that reaches its fullness in Christ and His followers."
    },
    {
      "pk": 17001020,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 20,
      "text": "All my possessions were seized and nothing was left to me except my wife Anna and my son Tobias.",
      "links": "<a href='/AIV/18/1/21'>Job 1:21</a>",
      "comment": "Loss of possession recalls the trials of Job, emphasizing trust in God over material wealth."
    },
    {
      "pk": 17001021,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 21,
      "text": "But forty days later, Sennacherib was killed by his two sons, and they fled to the mountains of Ararat. Then Esarhaddon his son became king, and he appointed Ahikar, the son of my brother Anael, over all the accounts of his kingdom.",
      "links": "<a href='/AIV/12/19/37'>2 Kgs 19:37</a>",
      "comment": "This shift of fortune for Tobit and Ahikar underscores God’s ability to raise the lowly in His own time (see <a href='/AIV/09/2/7-8'>1 Sam 2:7-8</a>)."
    },
    {
      "pk": 17001022,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 1,
      "verse": 22,
      "text": "Ahikar then interceded for me, and I returned to Nineveh, for Ahikar was chief cupbearer, keeper of the seal, controller of the accounts, and treasurer under Esarhaddon the king. And Ahikar was my nephew and maintained good relations with me.",
      "links": "<a href='/AIV/40/10/32'>Matt 10:32</a>",
      "comment": "Ahikar’s intercession models the power of faithful mediation, which foreshadows Christ’s mediation and the importance of intercessory prayer among the faithful."
    }
  ],
  "translatedAt": "2025-12-24T04:54:22.200Z"
}