{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 7,
  "verses": [
    {
      "pk": 2417001,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 1,
      "text": "When they entered Ecbatana, they came to the house of Raguel. Sarah greeted them, and they welcomed her in.",
      "links": "<a href='/AIV/17/3/7'>Tob. 3:7</a>",
      "comment": "Ecbatana was an ancient city in Media, indicating the journey was significant and purposeful, often seen as divinely guided."
    },
    {
      "pk": 2417002,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 2,
      "text": "Then Raguel said to Tobit’s son Tobias, 'How did you come, my brother?' He answered, 'By God’s grace, I am well.'",
      "links": "<a href='/AIV/19/121/8'>Ps. 121:8</a>",
      "comment": "Tobias’s response shows trust in God’s providence and protection throughout the journey, a core theme of this book."
    },
    {
      "pk": 2417003,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 3,
      "text": "Raguel said, 'You are welcome, my brother. May God’s blessing be upon you.' And he brought them into his house.",
      "links": "<a href='/AIV/01/14/19'>Gen. 14:19</a>",
      "comment": "The hospitality and blessing mirror Old Testament patterns of welcoming strangers as expressions of faith in God’s sovereignty."
    },
    {
      "pk": 2417004,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 4,
      "text": "Then Raguel killed a ram from the flock and gave them a warm welcome.",
      "links": "<a href='/AIV/01/18/7'>Gen. 18:7</a>",
      "comment": "Sacrificial hospitality signifies generous love, recalling Abraham’s welcome of the three visitors."
    },
    {
      "pk": 2417005,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 5,
      "text": "When they had washed and were seated for the meal, Tobias said to Raphael, 'Brother Azariah, speak about what you mentioned on the journey.'",
      "links": "<a href='/AIV/17/6/5'>Tob. 6:5</a>",
      "comment": "Tobias seeks guidance, displaying obedience and readiness to act on divine instruction. Raphael’s guidance is continuous throughout the book, symbolizing angelic intercession."
    },
    {
      "pk": 2417006,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 6,
      "text": "Raphael then spoke to Raguel, 'Tobias is your kinsman. He wishes to marry your daughter Sarah. Give her to him, according to the Law, for he is her closest relative. Do not hesitate to give her to him.'",
      "links": "<a href='/AIV/03/25/49'>Lev. 25:49</a>; <a href='/AIV/04/36/6-9'>Num. 36:6-9</a>",
      "comment": "This request shows faithfulness to the Law of Moses concerning marriage within one's kin, upholding the sanctity and unity of family God established."
    },
    {
      "pk": 2417007,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 7,
      "text": "Raguel replied, 'I must do so, my brother. But let me speak honestly: I have given her to seven men, all of whom died the night they entered her chamber. But for now, be of good cheer, my son.'",
      "links": "<a href='/AIV/17/3/8'>Tob. 3:8</a>",
      "comment": "Sarah’s suffering and the deaths of her previous husbands are central to the story, prefiguring God’s power to redeem seemingly hopeless situations."
    },
    {
      "pk": 2417008,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 8,
      "text": "Tobias answered, 'I will marry her, no matter what happens, for she is appointed to me according to the judgment of the Law of Moses.'",
      "links": "<a href='/AIV/05/25/5-6'>Deut. 25:5-6</a>",
      "comment": "Tobias’s bold acceptance demonstrates faith and commitment to God’s law and a trust that divine will prevails over fear."
    },
    {
      "pk": 2417009,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 9,
      "text": "Raguel said, 'May the Lord bless you, my child. This marriage is lawful and right. Take my daughter and may your union be blessed.'",
      "links": "<a href='/AIV/19/128/3'>Ps. 128:3</a>",
      "comment": "Marriage is affirmed as a divine institution and blessing, echoing themes of sacred covenant and fruitful union seen throughout Scripture."
    },
    {
      "pk": 2417010,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 10,
      "text": "He called his wife Edna, and she brought a scroll, and he wrote a contract, sealing her as his wife according to the law of Moses.",
      "links": "<a href='/AIV/02/24/3-4'>Ex. 24:3-4</a>",
      "comment": "Here we see the formalization of marriage by written contract, emphasizing the covenantal aspect of matrimony, fidelity, and law."
    },
    {
      "pk": 2417011,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 11,
      "text": "After this, they ate and rejoiced together.",
      "links": "<a href='/AIV/19/45/15'>Ps. 45:15</a>",
      "comment": "Feasting after the covenant echoes biblical weddings and celebrations, tying joy to obedience and righteousness."
    },
    {
      "pk": 2417012,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 12,
      "text": "Raguel called Edna his wife and said, 'Sister, prepare the other room and take Sarah there.'",
      "links": "<a href='/AIV/17/6/14'>Tob. 6:14</a>",
      "comment": "The bridal chamber is prepared, signifying the transition and the sacredness of marriage consummation in biblical tradition."
    },
    {
      "pk": 2417013,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 13,
      "text": "Edna did as he said and took Sarah there. She wept for her daughter, then dried her tears.",
      "links": "<a href='/AIV/01/24/67'>Gen. 24:67</a>",
      "comment": "Edna’s maternal compassion highlights the human dimension of faith, as parents entrust children to God’s providence in pivotal moments."
    },
    {
      "pk": 2417014,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 14,
      "text": "After they had eaten and drunk, Raguel called Tobias and said,",
      "links": "<a href='/AIV/17/8/1'>Tob. 8:1</a>",
      "comment": "The transition to matrimonial fulfillment is bridged by feasting, a deeply scriptural symbol of celebration and covenant renewal."
    },
    {
      "pk": 2417015,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 15,
      "text": "'Get up, my child, and take your wife. May God’s mercy and peace be upon you both.'",
      "links": "<a href='/AIV/19/67/1'>Ps. 67:1</a>",
      "comment": "The blessing invokes divine favor and peace, anticipated in Christ’s coming as the true bridegroom bringing grace to human union. See <a href='/AIV/40/9/6'>Matt. 9:6</a> for God’s mercy and power."
    },
    {
      "pk": 2417016,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 16,
      "text": "He left them together and shut the door of the room.",
      "links": "<a href='/AIV/19/4/8'>Ps. 4:8</a>",
      "comment": "Privacy and sanctity of marriage are underscored, echoing the biblical concept of the exclusive bond between husband and wife."
    },
    {
      "pk": 2417017,
      "translation": "AIV",
      "book": 17,
      "chapter": 7,
      "verse": 17,
      "text": "Afterward, Raguel got up and dug a grave, thinking, 'Perhaps he may die also.'",
      "links": "<a href='/AIV/17/8/9'>Tob. 8:9</a>",
      "comment": "Raguel’s act demonstrates persistent fear from tragic experience, yet, in biblical narrative, God’s miraculous intervention often occurs after human preparation for the worst, displaying God’s power and providence beyond expectation."
    }
  ],
  "translatedAt": "2025-12-23T09:09:44.677Z"
}