{
  "book": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 4,
  "verses": [
    {
      "pk": 400401,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 1,
      "text": "That day, Tobit called his son Tobias and said to him, 'My son, when I die, give me a proper burial. Honor your mother, and do not leave her as long as she lives. Do everything that pleases her, and do not grieve her in anything.'",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>; <a href='/AIV/51/3/20'>Col. 3:20</a>",
      "comment": "Here, Tobit draws upon the commandment to honor one's parents. This echoes the Ten Commandments and aligns with Christian teachings about respect for family authority, which is the foundation of a strong and ordered society. Honoring parents is understood here not simply as obedience, but as a deeper act of filial piety."
    },
    {
      "pk": 400402,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 2,
      "text": "'Remember, my child, all the trials I have endured, and how I was exiled from Nineveh. Do not forget the Lord as long as you live. Do not violate His commandments. Serve Him in all your ways, and be faithful to Him with all your strength.'",
      "links": "<a href='/AIV/19/119/1-2'>Ps. 119:1-2</a>; <a href='/AIV/40/22/37'>Matt. 22:37</a>",
      "comment": "Tobit urges Tobias to remain steadfast in faith and avoid turning from God's law, even in suffering. This teaching anticipates the New Testament's emphasis on perseverance (James 1:12), showing how righteousness is lived out through loyalty to God in adversity."
    },
    {
      "pk": 400403,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 3,
      "text": "'Do what is right all the days of your life. Do not walk in the ways of injustice, for those who act in truth will prosper in their deeds.'",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/20/21/21'>Prov. 21:21</a>",
      "comment": "This ancient wisdom literature guarantees that those who live justly are blessed. The spiritual reading is that true prosperity comes from righteousness in the eyes of God, not merely in external success (Matt. 6:33)."
    },
    {
      "pk": 400404,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 4,
      "text": "'Give generously from what you have to those who do good, and do not let your eye begrudge when you give alms. Do not turn your face away from anyone who is poor, and God's face will not be turned away from you.'",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/40/6/2'>Matt. 6:2</a>; <a href='/AIV/42/12/33'>Luke 12:33</a>",
      "comment": "Almsgiving is presented as a direct way to please God, which Jesus will affirm in the Gospels (see Matt. 6:2). Giving to the poor is both an act of mercy and a means of storing up spiritual treasures."
    },
    {
      "pk": 400405,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 5,
      "text": "'Give alms from your possessions according to how much you have. If you have much, give more; if you have little, do not be afraid to give even a little.'",
      "links": "<a href='/AIV/42/21/1-4'>Luke 21:1-4</a>; <a href='/AIV/47/9/7'>2 Cor. 9:7</a>",
      "comment": "The proportional giving here echoes Jesus' praise of the widow's offering (Luke 21:1-4); God values the heart and self-sacrifice in giving."
    },
    {
      "pk": 400406,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 6,
      "text": "'You will be laying up a good treasure for yourself against the day of necessity, for alms deliver from death, and keep you from going into darkness.'",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>; <a href='/AIV/40/6/19-21'>Matt. 6:19-21</a>",
      "comment": "Almsgiving is seen as spiritually effective—both beneficial for the present and for salvation (see Matt. 6:20). There is a spiritual dimension to works of mercy, hinting at a tradition where faith is expressed through charitable acts."
    },
    {
      "pk": 400407,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 7,
      "text": "'For giving to the poor delivers from death and prevents you from entering the darkness. Those who give alms will enjoy life.'",
      "links": "<a href='/AIV/19/41/1-2'>Ps. 41:1-2</a>",
      "comment": "Here the text repeats and emphasizes the salvific quality of charity, a theme carried into Christian teaching (James 2:14-17). Good works are not merely evidence of faith but have a genuine role in our spiritual well-being."
    },
    {
      "pk": 400408,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 8,
      "text": "'But keep yourself, my child, from all sexual immorality. Take a wife from among your own people and do not marry a foreign woman who does not share our faith.'",
      "links": "<a href='/AIV/2/34/16'>Ex. 34:16</a>; <a href='/AIV/47/6/14'>2 Cor. 6:14</a>",
      "comment": "Purity, both physically and spiritually, is valued. Marriage in the faith is recommended, as is later echoed by Paul (2 Cor. 6:14). The wisdom here guides Christians to build families rooted in shared belief."
    },
    {
      "pk": 400409,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 9,
      "text": "'Remember how our ancestors Noah, Abraham, Isaac, and Jacob all married women from their own kin and were blessed in their children. Cherish their example, my child.'",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>; <a href='/AIV/1/28/1'>Gen. 28:1</a>",
      "comment": "Tobit references patriarchs as models of fidelity. This alludes to the blessing found in marriages grounded in the shared worship of God."
    },
    {
      "pk": 400410,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 10,
      "text": "'So do not disregard the law, my child. For we will be blessed if we keep it, and cursed if we forsake it.'",
      "links": "<a href='/AIV/5/11/26-28'>Deut. 11:26-28</a>",
      "comment": "Blessing and curse, the Old Testament paradigm, is restated. Loyalty to God's law brings blessing—a scriptural principle fulfilled in Christ, who secures blessing by establishing a new covenant (Gal. 3:13-14)."
    },
    {
      "pk": 400411,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 11,
      "text": "'My child, always remember and never let pride rule your mind or deeds. For pride has caused many to stumble and fall. Those who do for others, who act humbly, will be raised up.'",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/42/18/14'>Luke 18:14</a>",
      "comment": "Humility is praised, a virtue central to Christ's teaching (Luke 18:14). Pride distances us from God, while humility invites His grace."
    },
    {
      "pk": 400412,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 12,
      "text": "'Do not hold back from working for the poor or supporting the needy. Do not turn your face from those who ask, and do not let anyone’s cry for help go unheard.'",
      "links": "<a href='/AIV/5/15/7-8'>Deut. 15:7-8</a>; <a href='/AIV/42/6/30'>Luke 6:30</a>",
      "comment": "Active aid to the poor is emphasized—a call to mercy and justice that anticipates the Sermon on the Mount and Jesus’ identification with the needy (Matt. 25:40)."
    },
    {
      "pk": 400413,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 13,
      "text": "'Give your bread to the hungry and your clothing to the naked. Give from your abundance and do not grudge it. Store up your treasure in the Lord’s sight, and it will be repaid to you.'",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>; <a href='/AIV/40/6/20'>Matt. 6:20</a>",
      "comment": "'Treasures in heaven' is an enduring image for spiritual rewards gained through charity (Matt. 6:20). Works of mercy have spiritual value, preparing us for eternal life."
    },
    {
      "pk": 400414,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 14,
      "text": "'Be careful, my child, in all your actions; act with good counsel. Do not do to another what you hate. Do not drink wine to excess, and do not let drunkenness be your companion.'",
      "links": "<a href='/AIV/40/7/12'>Matt. 7:12</a>; <a href='/AIV/20/23/20'>Prov. 23:20</a>",
      "comment": "The 'Golden Rule' is foreshadowed here, later taught by Christ (Matt. 7:12). Temperance—self-control in all things—is urged."
    },
    {
      "pk": 400415,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 15,
      "text": "'From early youth, seek wise counsel. Do not despise any useful advice. Bless the Lord God at all times, and ask Him to direct your steps and teach you what is right.'",
      "links": "<a href='/AIV/19/32/8'>Ps. 32:8</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "Seeking wisdom and guidance is central to spiritual maturity (James 1:5). Prayer for guidance keeps believers close to God's will and open to His providence."
    },
    {
      "pk": 400416,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 16,
      "text": "'My child, remember the Lord your God all your days, and never let your will be set on sin or pride. Do not go in the way of those acting unjustly.'",
      "links": "<a href='/AIV/20/3/5-7'>Prov. 3:5-7</a>",
      "comment": "Avoiding sin and pride keeps believers aligned with God's will. The call to separate from injustice reflects the consistent Old Testament call to holiness."
    },
    {
      "pk": 400417,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 17,
      "text": "'Share your bread with the hungry and your clothing with the naked. Give all your surplus as alms, and let nothing of yours go to waste.'",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>",
      "comment": "This verse reiterates the biblical theme of radical generosity, a precursor to Christ’s teaching to care for the least among us (Matt. 25:35-40)."
    },
    {
      "pk": 400418,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 18,
      "text": "'Place your trust in the Lord. In all your work, call upon Him, and you will find that He makes your paths straight.'",
      "links": "<a href='/AIV/20/3/5-6'>Prov. 3:5-6</a>",
      "comment": "Total reliance on God's providence is fundamental. The theme of trusting God echoes throughout both Testaments, affirming that our works prosper when aligned to His guidance."
    },
    {
      "pk": 400419,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 19,
      "text": "'But beware, my child, of anyone who plots evil. Do not associate with proud or violent people, so you may not learn their ways or fall into their snares.'",
      "links": "<a href='/AIV/20/1/10-15'>Prov. 1:10-15</a>",
      "comment": "Avoiding evil associations helps maintain moral integrity. This is a warning, much like Paul’s advice in 1 Cor. 15:33, to keep good company for spiritual safety."
    },
    {
      "pk": 400420,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 20,
      "text": "'Give thanks to God at all times. Ask Him to make your plans succeed. In all things, seek to do what is pleasing in His sight.'",
      "links": "<a href='/AIV/52/5/18'>1 Thess. 5:18</a>; <a href='/AIV/19/37/5'>Ps. 37:5</a>",
      "comment": "Thanksgiving and trust in providence continue to be marks of the faithful throughout Scripture (1 Thess. 5:18). The pursuit of God's will is a lifelong disposition."
    },
    {
      "pk": 400421,
      "translation": "AIV",
      "book": 70,
      "chapter": 4,
      "verse": 21,
      "text": "'And now, my child, let me tell you about the ten talents of silver which I entrusted to Gabael in Rages of Media. He is a trustworthy man. When I die, claim that money from him.'",
      "links": "<a href='/AIV/70/1/14'>Tobit 1:14</a>",
      "comment": "Tobit gives practical, familial instructions alongside spiritual counsel. Scripture often bridges material and spiritual concerns, reflecting a holistic vision of human life. This verse sets up the journey that follows in the narrative."
    }
  ],
  "translatedAt": "2025-12-23T09:08:44.719Z"
}