{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 73,
  "verses": [
    {
      "pk": 1917301,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 1,
      "text": "Surely God is good to Israel, to those who are pure in heart.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3–4</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "The psalm opens by affirming God's goodness specifically towards the faithful, echoing the beatitude of the pure in heart from Christ’s Sermon on the Mount (Matthew 5:8). This sets a tone of confidence in God’s justice, a theme throughout the psalm and central to Christian teaching on perseverance and purity."
    },
    {
      "pk": 1917302,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 2,
      "text": "But as for me, my feet almost stumbled, my steps nearly slipped.",
      "links": "<a href='/AIV/19/94/18'>Ps. 94:18</a>",
      "comment": "A personal confession of spiritual struggle. The psalmist admits a near-fall, revealing the human tendency to doubt or envy. This foreshadows the role of grace and is a subtle nod to the belief in the necessity of divine assistance, as emphasized in Catholic teaching."
    },
    {
      "pk": 1917303,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 3,
      "text": "For I was envious of the arrogant; I saw the prosperity of the wicked.",
      "links": "<a href='/AIV/19/37/1-2'>Ps. 37:1–2</a>",
      "comment": "The psalmist confesses envy towards those who seem to flourish without God. This is key to understanding spiritual temptation and the subtle workings of pride and envy, themes addressed in Church teaching on the deadly sins."
    },
    {
      "pk": 1917304,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 4,
      "text": "For they have no struggles; their bodies are healthy and strong.",
      "links": "<a href='/AIV/19/17/10'>Ps. 17:10</a>",
      "comment": "The prosperity of the wicked appears uninterrupted, challenging the doctrine of divine justice. The Catholic tradition often views such prosperity as a test or preparation for greater dependence on God."
    },
    {
      "pk": 1917305,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 5,
      "text": "They are not in trouble as other men are; they are not plagued like the rest of mankind.",
      "links": "",
      "comment": "The seeming immunity of the wicked can drive the faithful towards doubt. Catholic interpretation sees this as a call to keep one’s eyes on spiritual rather than material realities."
    },
    {
      "pk": 1917306,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 6,
      "text": "Therefore pride is their necklace; violence covers them like a garment.",
      "links": "<a href='/AIV/19/109/18-19'>Ps. 109:18–19</a>",
      "comment": "Pride is presented as a visible trait, warning of its corrupting effect. Catholic teaching places pride as the root of many sins, a theme echoed here and throughout Scripture."
    },
    {
      "pk": 1917307,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 7,
      "text": "Their eyes bulge with fatness; the imaginations of their hearts run wild.",
      "links": "",
      "comment": "Physical abundance mirrors moral corruption. The unrestrained desires signal a spiritual disorder that Catholic theology often links to concupiscence and the need for conversion."
    },
    {
      "pk": 1917308,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 8,
      "text": "They scoff and speak with malice; with arrogance, they threaten oppression.",
      "links": "<a href='/AIV/19/31/18'>Ps. 31:18</a>",
      "comment": "Wickedness manifests in speech and action. Catholics see the tongue as a spiritual battleground; this verse calls to mind the importance of guarding one's words, a theme St. James reiterates (James 3:6–10)."
    },
    {
      "pk": 1917309,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 9,
      "text": "They set their mouths against heaven, and their tongues strut through the earth.",
      "links": "<a href='/AIV/19/2/3'>Ps. 2:3</a>",
      "comment": "Arrogance is directed against both divine and human realms, highlighting rebellion similar to Babel (Genesis 11:4). This prefigures the rejection of God that Christ overcomes in His humility."
    },
    {
      "pk": 1917310,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 10,
      "text": "Therefore his people turn here, and waters of abundance are drained by them.",
      "links": "",
      "comment": "The literal meaning is debated. Most translations read this as the faithful being confused or led astray by the prosperity of the wicked. Catholic teaching would see here the danger of scandal and the importance of steadfastness."
    },
    {
      "pk": 1917311,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 11,
      "text": "They say, 'How can God know? Is there knowledge in the Most High?'",
      "links": "<a href='/AIV/19/10/11'>Ps. 10:11</a>; <a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "Doubt about God's omniscience echoes the serpent’s temptation in Eden (Genesis 3:1–5). Catholic doctrine emphasizes God’s perfect knowledge and the folly of disbelief."
    },
    {
      "pk": 1917312,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 12,
      "text": "Behold, these are the wicked; always at ease, they increase in riches.",
      "links": "<a href='/AIV/19/49/16'>Ps. 49:16</a>",
      "comment": "Observation of the prosperity of the wicked is a recurring biblical theme—see parable of the rich fool (Luke 12:16–21). God's final judgment is not negated by temporary earthly success."
    },
    {
      "pk": 1917313,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 13,
      "text": "Surely in vain have I kept my heart pure and washed my hands in innocence.",
      "links": "<a href='/AIV/19/24/4'>Ps. 24:4</a>; <a href='/AIV/40/27/24'>Matt. 27:24</a>",
      "comment": "Despair over righteousness is a temptation. Washing hands recalls Pilate and ritual purity, connecting to Catholic sacramental theology about visible signs pointing to inward grace."
    },
    {
      "pk": 1917314,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 14,
      "text": "For all day long I am afflicted; every morning I am punished.",
      "links": "<a href='/AIV/19/88/15-16'>Ps. 88:15–16</a>",
      "comment": "The life of the righteous is marked by suffering, echoing Christ’s passion and reminding us of Catholic teaching on redemptive suffering: our share in Christ’s Cross brings deeper union with God."
    },
    {
      "pk": 1917315,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 15,
      "text": "If I had said, 'I will speak thus,' I would have betrayed your children.",
      "links": "",
      "comment": "The psalmist resists voicing doubt, fearing it would lead others astray. This points to the Catholic understanding of scandal and the responsibility to guard the faith of others."
    },
    {
      "pk": 1917316,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 16,
      "text": "When I tried to understand all this, it seemed a difficult task to me.",
      "links": "",
      "comment": "Human reason finds the mystery of suffering and evil unfathomable. Catholics recognize that full understanding often comes through faith, not reason alone, as seen in the acceptance of divine mysteries."
    },
    {
      "pk": 1917317,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 17,
      "text": "Until I entered the sanctuary of God; then I understood their end.",
      "links": "<a href='/AIV/19/20/2'>Ps. 20:2</a>; <a href='/AIV/19/27/4'>Ps. 27:4</a>",
      "comment": "Clarity comes in the presence of God, highlighting the necessity of communal worship—a subtle nod to the Catholic view of the importance of the Church and liturgy as a means of grace and understanding."
    },
    {
      "pk": 1917318,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 18,
      "text": "Surely you set them in slippery places; you cast them down to ruin.",
      "links": "<a href='/AIV/19/35/6'>Ps. 35:6</a>",
      "comment": "Judgment awaits the wicked despite fleeting success. Catholic teaching on final judgment and purgatory is foreshadowed in this recognition of ultimate justice."
    },
    {
      "pk": 1917319,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 19,
      "text": "How suddenly are they destroyed, swept away by terrors in an instant!",
      "links": "<a href='/AIV/19/37/36'>Ps. 37:36</a>",
      "comment": "Sudden reversal is a biblical theme—see the fate of Sodom (Genesis 19:24–25). Christ warns of unexpected judgment; Catholic spirituality urges constant vigilance."
    },
    {
      "pk": 1917320,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 20,
      "text": "As a dream when one awakes, so, Lord, when you arise, you will despise their image.",
      "links": "<a href='/AIV/19/39/6'>Ps. 39:6</a>",
      "comment": "Earthly illusions vanish before God’s presence. The fleeting nature of worldly glory underlines Catholic teaching on the emptiness of material pursuits."
    },
    {
      "pk": 1917321,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 21,
      "text": "When my heart was embittered and my soul was pierced within me,",
      "links": "",
      "comment": "The psalmist’s internal struggle hints at the purifying role of suffering. Catholics are familiar with this theme in the doctrine of spiritual purification and growth in holiness."
    },
    {
      "pk": 1917322,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 22,
      "text": "I was senseless and ignorant; I was like a beast before you.",
      "links": "<a href='/AIV/19/32/9'>Ps. 32:9</a>",
      "comment": "Humility before God, recognizing our limitation. The Church upholds this sense of creatureliness found in the psalm and calls for Deeper trust in divine wisdom."
    },
    {
      "pk": 1917323,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 23,
      "text": "Nevertheless, I am always with you; you hold my right hand.",
      "links": "<a href='/AIV/19/16/8'>Ps. 16:8</a>",
      "comment": "Divine companionship and stability. Catholic tradition sees God’s grace as actively sustaining us, like the sacraments which assure the soul of God’s presence."
    },
    {
      "pk": 1917324,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 24,
      "text": "You guide me with your counsel, and afterward you will receive me to glory.",
      "links": "<a href='/AIV/19/49/15'>Ps. 49:15</a>; <a href='/AIV/43/14/2-3'>John 14:2–3</a>",
      "comment": "The hope of glory after guidance recalls Christian belief in eternal life—see John 14:2–3, a promise made by Christ Himself. The phrase contains a subtle allusion to the Catholic doctrines of heaven and the beatific vision."
    },
    {
      "pk": 1917325,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 25,
      "text": "Whom have I in heaven but you? And on earth, there is nothing I desire besides you.",
      "links": "<a href='/AIV/19/16/2'>Ps. 16:2</a>",
      "comment": "The psalmist’s focus shifts to God alone, echoing the call to total love and devotion. Catholics see this as a model for detachment from earthly things and as an interior disposition cultivated by the saints."
    },
    {
      "pk": 1917326,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 26,
      "text": "My flesh and my heart may fail, but God is the strength of my heart and my portion forever.",
      "links": "<a href='/AIV/19/37/4'>Ps. 37:4</a>; <a href='/AIV/47/4/16'>2 Cor. 4:16</a>",
      "comment": "Human weakness finds its answer in God alone. Catholic interpretation links this with the Eucharist, where Christ is our 'portion' forever, and with Paul’s teaching on spiritual inner renewal (2 Corinthians 4:16)."
    },
    {
      "pk": 1917327,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 27,
      "text": "For behold, those who are far from you will perish; you destroy all who are unfaithful to you.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "Judgment is reserved for those who reject God. Catholic tradition emphasizes the reality of separation from God as the greatest loss."
    },
    {
      "pk": 1917328,
      "translation": "AIV",
      "book": 19,
      "chapter": 73,
      "verse": 28,
      "text": "But for me, it is good to be near God; I have made the Lord God my refuge, that I may tell of all your works.",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/19/71/17'>Ps. 71:17</a>",
      "comment": "Closeness to God brings fulfillment and mission. Catholic spirituality emphasizes refuge in God and proclaiming His deeds: the heart of the call to missionary discipleship."
    }
  ],
  "translatedAt": "2025-12-22T21:42:59.283Z"
}