{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 134,
  "verses": [
    {
      "pk": 1343001,
      "translation": "AIV",
      "book": 19,
      "chapter": 134,
      "verse": 1,
      "text": "Behold, bless the LORD, all you servants of the LORD, who stand by night in the house of the LORD.",
      "links": "<a href='/AIV/19/33/1'>Ps. 33:1</a>; <a href='/AIV/19/135/1-2'>Ps. 135:1-2</a>; <a href='/AIV/19/92/13'>Ps. 92:13</a>",
      "comment": "This psalm invites the servants—the priests and Levites—to worship God during the night watches in the temple. The emphasis on continuous worship hints at a spiritual understanding of unceasing prayer, as well as the importance of those called to minister in the sanctuary. This has echoes in New Testament exhortations towards constant prayer and the divine service of God (see <a href='/AIV/52/5/17'>1 Thess. 5:17</a>). The concept of standing in the LORD’s house all night also reminds believers of the tradition of perpetual adoration and the holiness of liturgical worship."
    },
    {
      "pk": 1343002,
      "translation": "AIV",
      "book": 19,
      "chapter": 134,
      "verse": 2,
      "text": "Lift up your hands toward the sanctuary and bless the LORD.",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/19/63/4'>Ps. 63:4</a>; <a href='/AIV/54/2/8'>1 Tim. 2:8</a>",
      "comment": "The physical act of lifting hands is an ancient posture of prayer, symbolizing surrender and worship. It highlights both bodily participation in prayer and the sacredness of the sanctuary. In the New Testament, believers are urged to pray by lifting holy hands (<a href='/AIV/54/2/8'>1 Tim. 2:8</a>), suggesting a continuity of worship from Old to New. This outward gesture supports a more sacramental understanding of worship, implying that spiritual devotion is often accompanied by physical expression."
    },
    {
      "pk": 1343003,
      "translation": "AIV",
      "book": 19,
      "chapter": 134,
      "verse": 3,
      "text": "May the LORD bless you from Zion, he who made heaven and earth.",
      "links": "<a href='/AIV/19/128/5'>Ps. 128:5</a>; <a href='/AIV/19/121/2'>Ps. 121:2</a>; <a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "Blessing comes from Zion—God’s chosen city and the location of the temple. This connects the earthly place of worship with the universal Creator. The unity of God’s presence in a particular place and his sovereignty over all creation is a key theme in both Old and New Testament theology (see <a href='/AIV/19/121/2'>Ps. 121:2</a>). Zion’s blessings point forward to the fulfillment in Christ, who makes the new and eternal worship available to all (see <a href='/AIV/58/12/22-24'>Heb. 12:22-24</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:48:24.574Z"
}