{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 133,
  "verses": [
    {
      "pk": 1932133,
      "translation": "AIV",
      "book": 19,
      "chapter": 133,
      "verse": 1,
      "text": "Behold, how good and how pleasant it is when brothers dwell together in unity!",
      "links": "<a href='/AIV/19/122/8'>Psalm 122:8</a>; <a href='/AIV/19/26/8'>Psalm 26:8</a>; <a href='/AIV/19/147/1'>Psalm 147:1</a>",
      "comment": "This verse highlights the beauty of true unity among God's people. The word 'brothers' refers both to literal family and to the wider community of believers, prefiguring the unity Christ desires for His followers (cf. John 17:21). While the original Hebrew uses 'achim,' the spiritual interpretation points to all who have been gathered into God's family, setting a foundation for the emphasis on one united Church."
    },
    {
      "pk": 1932134,
      "translation": "AIV",
      "book": 19,
      "chapter": 133,
      "verse": 2,
      "text": "It is like the precious oil on the head, running down on the beard, on Aaron's beard, running down on the collar of his robes.",
      "links": "<a href='/AIV/2/29/7'>Exodus 29:7</a>; <a href='/AIV/3/8/12'>Leviticus 8:12</a>; <a href='/AIV/19/23/5'>Psalm 23:5</a>",
      "comment": "The anointing oil recalls the consecration of Aaron as high priest. This image connects unity with holiness and the priestly office. The abundance of oil represents the overflowing blessing from God that sanctifies His people and their leaders. Spiritually, this prefigures the anointing of Christ (the Messiah, which means 'Anointed One') and the fullness of blessing that comes through sacramental unity (cf. Hebrews 2:17; 1 Peter 2:9)."
    },
    {
      "pk": 1932135,
      "translation": "AIV",
      "book": 19,
      "chapter": 133,
      "verse": 3,
      "text": "It is like the dew of Hermon, which falls on the mountains of Zion. For there the LORD has commanded the blessing, life forevermore.",
      "links": "<a href='/AIV/5/11/11-12'>Deuteronomy 11:11-12</a>; <a href='/AIV/19/42/6'>Psalm 42:6</a>; <a href='/AIV/19/134/3'>Psalm 134:3</a>",
      "comment": "Hermon's dew is a symbol of refreshment and abundance, and its descent upon Zion represents the grace that brings God's blessing to His chosen dwelling place. This blessing is nothing less than eternal life. Unity is shown here as a unique place of divine favor, foreshadowing the gathering of the faithful in the one assembly, receiving the fullness of God's life. This anticipates Christ's prayer for unity and the outpouring of the Spirit in the New Covenant (cf. John 17:22-23; Acts 2:1-4)."
    }
  ],
  "translatedAt": "2025-12-23T05:48:18.192Z"
}