{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 16,
  "verses": [
    {
      "pk": 1016011,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 1,
      "text": "Protect me, O God, for in you I take refuge.",
      "links": "<a href='/AIV/7/15/9'>Judges 15:9</a>; <a href='/AIV/19/7/1'>Psalm 7:1</a>; <a href='/AIV/19/11/1'>Psalm 11:1</a>",
      "comment": "The psalmist opens with a plea for protection and trust in God alone, echoing other psalms of confidence. The term 'refuge' implies total reliance on God's care, anticipating Christ's absolute trust in the Father (see Luke 23:46)."
    },
    {
      "pk": 1016012,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 2,
      "text": "I say to the Lord, 'You are my Lord; I have no good apart from you.'",
      "links": "<a href='/AIV/19/73/25'>Psalm 73:25</a>; <a href='/AIV/19/119/57'>Psalm 119:57</a>",
      "comment": "Acknowledgement that every true blessing and goodness comes from God alone. This echoes a key biblical principle that our true happiness is found only in a relationship with Him (see James 1:17)."
    },
    {
      "pk": 1016013,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 3,
      "text": "As for the saints who are in the land, they are the noble ones in whom is all my delight.",
      "links": "<a href='/AIV/19/34/9'>Psalm 34:9</a>; <a href='/AIV/19/119/63'>Psalm 119:63</a>",
      "comment": "'Saints' refers to God's faithful people set apart for Him. The Psalmist expresses deep communion and unity with these holy ones, implying a special bond among all the faithful. This points toward the concept of an enduring spiritual fellowship of believers unified in God."
    },
    {
      "pk": 1016014,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 4,
      "text": "Those who run after other gods multiply their sorrows; I will not pour out their drink offerings of blood, nor will I take their names upon my lips.",
      "links": "<a href='/AIV/19/32/10'>Psalm 32:10</a>; <a href='/AIV/2/23/13'>Exodus 23:13</a>",
      "comment": "Idolatry brings pain and separation. The Psalmist refuses to participate in pagan practices, emphasizing the importance of true worship and purity in devotion—highlighting themes of exclusive loyalty to God."
    },
    {
      "pk": 1016015,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 5,
      "text": "The Lord is my chosen portion and my cup; You hold my lot.",
      "links": "<a href='/AIV/19/23/5'>Psalm 23:5</a>; <a href='/AIV/19/142/5'>Psalm 142:5</a>",
      "comment": "God is pictured as both provider and inheritance, using language of the promised land received by Israel. This verse points to God as the deepest fulfillment, reflected in the later Christian understanding of receiving God Himself as our ultimate portion."
    },
    {
      "pk": 1016016,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 6,
      "text": "The lines have fallen for me in pleasant places; indeed, I have a beautiful inheritance.",
      "links": "<a href='/AIV/6/21/43'>Joshua 21:43</a>; <a href='/AIV/19/47/4'>Psalm 47:4</a>",
      "comment": "Originally referring to the division of land in Israel (Joshua), the verse spiritually signifies the believer’s eternal inheritance in God, fulfilled ultimately through Christ. The language anticipates the New Testament teaching of a spiritual inheritance (see 1 Peter 1:4)."
    },
    {
      "pk": 1016017,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 7,
      "text": "I will bless the Lord who gives me counsel; even at night my heart instructs me.",
      "links": "<a href='/AIV/19/119/148'>Psalm 119:148</a>; <a href='/AIV/19/73/24'>Psalm 73:24</a>",
      "comment": "God’s guidance is continual, even in the night, reflecting intimacy with God through prayer and meditation. There is an allusion to the interior life of prayer that transforms the heart (see Philippians 4:7)."
    },
    {
      "pk": 1016018,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 8,
      "text": "I have set the Lord always before me; because He is at my right hand, I will not be shaken.",
      "links": "<a href='/AIV/19/15/5'>Psalm 15:5</a>; <a href='/AIV/44/2/25'>Acts 2:25</a>",
      "comment": "This is quoted by Peter in Acts 2:25 regarding Christ’s resurrection. Placing God constantly before oneself brings steadfastness. The right hand signifies strength, protection, and honor from God—a foretaste of Christ’s victory over death and His constant presence with believers."
    },
    {
      "pk": 1016019,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 9,
      "text": "Therefore my heart is glad, and my whole being rejoices; my flesh also will rest secure.",
      "links": "<a href='/AIV/19/4/8'>Psalm 4:8</a>; <a href='/AIV/44/2/26'>Acts 2:26</a>",
      "comment": "The Psalmist expresses complete joy and confidence, body and soul, knowing he is safe in God. In the New Testament this points to Christ’s resurrection and the believer’s hope in the resurrection of the body."
    },
    {
      "pk": 1016020,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 10,
      "text": "For you will not abandon my soul to Sheol, nor will you let your faithful one see decay.",
      "links": "<a href='/AIV/19/49/9'>Psalm 49:9</a>; <a href='/AIV/44/13/35'>Acts 13:35</a>",
      "comment": "A profound prophecy fulfilled in Christ who was not left in the grave (see Acts 2:31; Matthew 28:6). The 'faithful one' ultimately refers to Jesus, but is also a promise for all who are united to Him through true faith, with the assurance of sharing in His resurrection."
    },
    {
      "pk": 1016021,
      "translation": "AIV",
      "book": 19,
      "chapter": 16,
      "verse": 11,
      "text": "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.",
      "links": "<a href='/AIV/19/21/6'>Psalm 21:6</a>; <a href='/AIV/19/36/8'>Psalm 36:8</a>; <a href='/AIV/19/73/24'>Psalm 73:24</a>",
      "comment": "Climactic confidence that eternal joy, lasting happiness, and fullness of life are found in God’s presence—a vision completed in the life of the world to come, which the New Testament affirms is prepared for all who are joined in true faith to Christ (see John 14:3)."
    }
  ],
  "translatedAt": "2025-12-23T05:35:34.605Z"
}