{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 71,
  "verses": [
    {
      "pk": 1971001,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 1,
      "text": "In you, O LORD, I seek refuge; let me never be put to shame.",
      "links": "<a href='/AIV/19/31/1'>Ps. 31:1</a>; <a href='/AIV/19/25/2'>Ps. 25:2</a>",
      "comment": "The psalmist's trust in God as a refuge echoes earlier Psalms. The language is direct plea, aligning well with the original Hebrew. Catholics see this as expressing reliance on God—foundational for faith, reflected in sacramental grace and spiritual safety within the Church."
    },
    {
      "pk": 1971002,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 2,
      "text": "In your righteousness deliver me and rescue me; incline your ear to me and save me.",
      "links": "<a href='/AIV/19/31/2'>Ps. 31:2</a>; <a href='/AIV/19/143/1'>Ps. 143:1</a>",
      "comment": "Seeking God's righteousness reflects a dependence on divine mercy, underlining the Catholic understanding of salvation as not by faith alone but through God's grace, imparted through means like the sacraments (<a href='/AIV/45/3/24'>Romans 3:24</a>)."
    },
    {
      "pk": 1971003,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 3,
      "text": "Be to me a rock of refuge, to which I may continually come. You have appointed to save me, for you are my rock and my fortress.",
      "links": "<a href='/AIV/19/31/3'>Ps. 31:3</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "The imagery of 'rock' and 'fortress' is Christological (<a href='/AIV/46/10/4'>1 Cor. 10:4</a>), foreshadowing Christ as the foundation of the Church. Catholics see Christ as the rock upon which the Church is built (<a href='/AIV/40/16/18'>Matt 16:18</a>)."
    },
    {
      "pk": 1971004,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 4,
      "text": "Rescue me, my God, from the hand of the wicked, from the grasp of the unjust and ruthless man.",
      "links": "<a href='/AIV/19/35/10'>Ps. 35:10</a>; <a href='/AIV/19/140/1'>Ps. 140:1'>Ps. 140:1</a>",
      "comment": "Praying for rescue from evil points to the Catholic emphasis on spiritual warfare and the Church's role as a protector from spiritual dangers (<a href='/AIV/49/6/10-18'>Eph 6:10-18</a>)."
    },
    {
      "pk": 1971005,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 5,
      "text": "For you, O Lord GOD, are my hope, my trust, from my youth.",
      "links": "<a href='/AIV/19/22/9'>Ps. 22:9</a>; <a href='/AIV/19/40/4'>Ps. 40:4</a>",
      "comment": "Trust from youth hints at lifelong formation, resonating with the Catholic view of faith formation beginning in childhood."
    },
    {
      "pk": 1971006,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 6,
      "text": "Upon you I have depended from birth; you took me from my mother's womb. My praise is continually of you.",
      "links": "<a href='/AIV/19/22/10'>Ps. 22:10</a>; <a href='/AIV/19/139/13'>Ps. 139:13</a>",
      "comment": "Emphasizes God's providence and election from infancy—a theme present in the Catholic understanding of baptismal grace from birth."
    },
    {
      "pk": 1971007,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 7,
      "text": "I have become a wonder to many, but you are my strong refuge.",
      "links": "<a href='/AIV/19/71/18'>Ps. 71:18</a>; <a href='/AIV/19/61/3'>Ps. 61:3</a>",
      "comment": "The psalmist's life as a 'wonder' echoes saints' witness, cherished in Catholic tradition, pointing to the power of sanctity as visible testimony."
    },
    {
      "pk": 1971008,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 8,
      "text": "My mouth is filled with your praise, and with your glory all day long.",
      "links": "<a href='/AIV/19/34/1'>Ps. 34:1</a>; <a href='/AIV/19/63/5'>Ps. 63:5</a>",
      "comment": "The continual praise reminds of the Catholic Liturgy of the Hours, where prayer and praise are sustained throughout the day."
    },
    {
      "pk": 1971009,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 9,
      "text": "Do not cast me off in the time of old age; forsake me not when my strength is spent.",
      "links": "<a href='/AIV/19/92/14'>Ps. 92:14</a>",
      "comment": "A compassionate call not to abandon the elderly, underscoring Catholic social teaching on the dignity and value of every person at each stage of life."
    },
    {
      "pk": 1971010,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 10,
      "text": "For my enemies speak against me; those who watch for my life conspire together,",
      "links": "<a href='/AIV/19/38/12'>Ps. 38:12</a>; <a href='/AIV/19/41/7'>Ps. 41:7</a>",
      "comment": "The presence of opposition foreshadows Christ's own experience facing enemies and betrayers, interpreted in Catholic tradition as participating in Christ's sufferings."
    },
    {
      "pk": 1971011,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 11,
      "text": "saying, “God has forsaken him; pursue and seize him, for there is no one to deliver.”",
      "links": "<a href='/AIV/19/22/1'>Ps. 22:1</a>; <a href='/AIV/19/3/2'>Ps. 3:2</a>",
      "comment": "The accusation of divine abandonment relates to Christ's cry from the Cross (<a href='/AIV/40/27/46'>Matt 27:46</a>), a high-christology point, fulfilled in the Passion."
    },
    {
      "pk": 1971012,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 12,
      "text": "O God, do not be far from me; O my God, make haste to help me.",
      "links": "<a href='/AIV/19/22/11'>Ps. 22:11</a>; <a href='/AIV/19/38/21'>Ps. 38:21</a>",
      "comment": "A repeated prayer for God's nearness, pivotal to the Catholic sacramental experience—God draws near especially in the Eucharist."
    },
    {
      "pk": 1971013,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 13,
      "text": "Let those who accuse me be put to shame and consumed; let those who seek my harm be covered with scorn and disgrace.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/19/109/29'>Ps. 109:29</a>",
      "comment": "Vindication and overcoming enemies is seen as God’s justice prevailing, a theme present in Catholic teaching on the final judgment."
    },
    {
      "pk": 1971014,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 14,
      "text": "But I will hope continually and will praise you yet more and more.",
      "links": "<a href='/AIV/19/42/5'>Ps. 42:5</a>; <a href='/AIV/19/71/8'>Ps. 71:8</a>",
      "comment": "The accent on perseverance in faith and praise underlines the Catholic view of the necessity of perseverance in grace."
    },
    {
      "pk": 1971015,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 15,
      "text": "My mouth will tell of your righteous acts, of your salvation all day, for I do not know their number.",
      "links": "<a href='/AIV/19/40/5'>Ps. 40:5</a>; <a href='/AIV/19/51/14'>Ps. 51:14</a>",
      "comment": "God’s works are innumerable—echoing Catholic recognition of God’s abundant graces dispensed through the Church."
    },
    {
      "pk": 1971016,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 16,
      "text": "With the mighty deeds of the Lord GOD I will come; I will remind people of your righteousness, yours alone.",
      "links": "<a href='/AIV/19/35/28'>Ps. 35:28</a>",
      "comment": "Testifying to the Lord’s righteousness invites proclaiming God’s mighty works—parallels Catholic evangelization and witness to the faith."
    },
    {
      "pk": 1971017,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 17,
      "text": "O God, from my youth you have taught me, and I still proclaim your wondrous deeds.",
      "links": "<a href='/AIV/19/22/10'>Ps. 22:10</a>; <a href='/AIV/19/78/4'>Ps. 78:4</a>",
      "comment": "The psalmist's lifelong catechesis resonates with Catholic emphasis on catechism and continuous religious formation."
    },
    {
      "pk": 1971018,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 18,
      "text": "So even to old age and gray hairs, O God, do not forsake me, until I declare your strength to the next generation, your power to all those who come.",
      "links": "<a href='/AIV/19/92/14'>Ps. 92:14</a>; <a href='/AIV/19/48/14'>Ps. 48:14</a>",
      "comment": "Passing on the faith to each generation, central to Catholic tradition, especially through apostolic succession."
    },
    {
      "pk": 1971019,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 19,
      "text": "Your righteousness, O God, reaches to the heavens. You have done great things; O God, who is like you?",
      "links": "<a href='/AIV/19/35/10'>Ps. 35:10</a>; <a href='/AIV/19/86/8'>Ps. 86:8</a>",
      "comment": "God’s transcendence and unique holiness is emphasized, worshipped in the Catholic liturgy—the Mass includes similar doxologies."
    },
    {
      "pk": 1971020,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 20,
      "text": "You, who have made me see many troubles and calamities, will revive me again; from the depths of the earth you will bring me up again.",
      "links": "<a href='/AIV/19/30/3'>Ps. 30:3</a>; <a href='/AIV/19/86/13'>Ps. 86:13</a>",
      "comment": "References to God raising from the depths are viewed with high christology: interpreted as prophetic of Christ’s resurrection and the hope Catholics place in the resurrection of the faithful."
    },
    {
      "pk": 1971021,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 21,
      "text": "You will increase my greatness and comfort me again.",
      "links": "<a href='/AIV/19/18/35'>Ps. 18:35</a>; <a href='/AIV/19/119/76'>Ps. 119:76</a>",
      "comment": "Comfort and exaltation suggest the future glory of the saints, which the Catholic Church teaches in the doctrine of glorification."
    },
    {
      "pk": 1971022,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 22,
      "text": "I will also praise you with the harp for your faithfulness, O my God; I will sing to you with the lyre, Holy One of Israel.",
      "links": "<a href='/AIV/19/33/2'>Ps. 33:2</a>; <a href='/AIV/19/43/4'>Ps. 43:4</a>",
      "comment": "Musical praise in worship echoes the Catholic tradition of using music and instruments in the Mass."
    },
    {
      "pk": 1971023,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 23,
      "text": "My lips will shout for joy, when I sing praise to you; my soul also, which you have redeemed.",
      "links": "<a href='/AIV/19/63/5'>Ps. 63:5</a>; <a href='/AIV/19/103/4'>Ps. 103:4</a>",
      "comment": "Joy in redemption foreshadows the complete redemption offered through Christ, sacramentally experienced in the Church."
    },
    {
      "pk": 1971024,
      "translation": "AIV",
      "book": 19,
      "chapter": 71,
      "verse": 24,
      "text": "And my tongue will talk of your righteous help all day long, for those who sought to harm me have been put to shame and confounded.",
      "links": "<a href='/AIV/19/35/28'>Ps. 35:28</a>; <a href='/AIV/19/71/13'>Ps. 71:13</a>",
      "comment": "Celebrating divine vindication is consistent with the Catholic understanding of God's ultimate victory, manifest in the saints' final glory."
    }
  ],
  "translatedAt": "2025-12-22T21:42:11.922Z"
}