{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 75,
  "verses": [
    {
      "pk": 1975071,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 1,
      "text": "We give thanks to you, God, we give thanks; your name is near. Men tell of your wondrous works.",
      "links": "<a href='/AIV/19/9/1'>Ps. 9:1</a>; <a href='/AIV/19/105/1'>Ps. 105:1</a>",
      "comment": "The opening verse is a communal thanksgiving, emphasizing God's closeness to His people and His active work in history. The phrase 'your name is near' hints at the presence of God through covenant and worship, themes central in both Old and New Testament worship (see <a href='/AIV/19/145/18'>Ps. 145:18</a>). In Catholic tradition, 'works' are seen as manifestations of grace and the Church continues this witness."
    },
    {
      "pk": 1975072,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 2,
      "text": "At the appointed time, I will judge with fairness.",
      "links": "<a href='/AIV/19/37/28'>Ps. 37:28</a>; <a href='/AIV/44/17/31'>Acts 17:31</a>",
      "comment": "God declares He will judge in His perfect timing, recalling that God's justice is not arbitrary but established by His sovereign will. Acts 17:31 refers to Christ as Judge, connecting this to future eschatological judgement. The Catholic understanding of judgment also emphasizes the role of the Church and sacraments in preparing believers for this."
    },
    {
      "pk": 1975073,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 3,
      "text": "When the earth totters, and all its people, it is I who hold its pillars firm. Selah.",
      "links": "<a href='/AIV/19/46/2-3'>Ps. 46:2-3</a>; <a href='/AIV/19/104/5'>Ps. 104:5</a>",
      "comment": "God is the sustainer of creation, even when chaos threatens. The imagery of 'pillars' evokes the foundation and the stability of order, which in Catholic doctrine is reflected by the enduring nature of the Church (see <a href='/AIV/40/16/18'>Matt. 16:18</a>), a spiritual and visible foundation."
    },
    {
      "pk": 1975074,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 4,
      "text": "I say to the boastful, 'Do not boast,' and to the wicked, 'Do not lift up your horn.'",
      "links": "<a href='/AIV/19/31/18'>Ps. 31:18</a>; <a href='/AIV/19/94/4'>Ps. 94:4</a>",
      "comment": "'Horn' is a symbol of strength and pride. God rebukes arrogance, reminding us that all power is subordinate to His authority. Humility is a foundational Christian virtue (see <a href='/AIV/40/23/12'>Matt. 23:12</a>), emphasized in both Protestant and Catholic spirituality, but especially articulated in the Church's teaching on the necessity of grace."
    },
    {
      "pk": 1975075,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 5,
      "text": "Do not lift up your horn on high, or speak with a haughty neck.",
      "links": "<a href='/AIV/19/12/3'>Ps. 12:3</a>; <a href='/AIV/19/89/24'>Ps. 89:24</a>",
      "comment": "The Psalm continues the warning against pride, with vivid imagery for arrogance. Catholic interpreters have seen here a shadow of the danger of schism and the virtue of obedience, linking spiritual humility to unity within Christ's Body."
    },
    {
      "pk": 1975076,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 6,
      "text": "For exaltation does not come from the east, nor from the west, nor from the wilderness;",
      "links": "<a href='/AIV/19/113/7-8'>Ps. 113:7-8</a>; <a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "Promotion and glory do not come from human sources, but from God alone. The Catholic sense of vocation and divine calling reflects this: all true exaltation (including sanctity and leadership) is God's gift, not self-made."
    },
    {
      "pk": 1975077,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 7,
      "text": "But God is the Judge: He puts down one and lifts up another.",
      "links": "<a href='/AIV/19/50/6'>Ps. 50:6</a>; <a href='/AIV/42/1/52'>Luke 1:52</a>",
      "comment": "The sovereignty of God over all human affairs is reaffirmed here. The pattern of God's choice—He lowers the mighty and exalts the humble—is central to Marian theology, echoed in the Magnificat (<a href='/AIV/42/1/52'>Luke 1:52</a>). This spiritual reading invites recognition of God's work through humble servants."
    },
    {
      "pk": 1975078,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 8,
      "text": "For in the hand of Yahweh is a cup with foaming wine, full of mixture; He pours it out, and all the wicked of the earth shall drink it, draining it down to the dregs.",
      "links": "<a href='/AIV/19/60/3'>Ps. 60:3</a>; <a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "The cup is a symbol of divine judgment. Foaming wine implies the intensity and completeness of judgment. The New Testament transforms this image through Christ's acceptance of the cup (see <a href='/AIV/40/26/39'>Matt. 26:39</a>). Catholic tradition sees here a strong Eucharistic typology, Christ drinking the cup for our salvation."
    },
    {
      "pk": 1975079,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 9,
      "text": "But I will declare forever, I will sing praise to the God of Jacob.",
      "links": "<a href='/AIV/19/146/2'>Ps. 146:2</a>; <a href='/AIV/19/59/17'>Ps. 59:17</a>",
      "comment": "The Psalmist's resolve to worship God eternally anticipates New Testament worship in spirit and truth (<a href='/AIV/43/4/23'>John 4:23</a>), which the Catholic Church continues through perpetual praise and liturgy, inviting all believers into this ongoing worship."
    },
    {
      "pk": 1975080,
      "translation": "AIV",
      "book": 19,
      "chapter": 75,
      "verse": 10,
      "text": "He will cut off the power of the wicked, but the horn of the righteous will be lifted up.",
      "links": "<a href='/AIV/19/92/10'>Ps. 92:10</a>; <a href='/AIV/19/112/9'>Ps. 112:9</a>; <a href='/AIV/42/1/69'>Luke 1:69</a>",
      "comment": "The 'horn' is restored as a symbol of spiritual strength and victory. In <a href='/AIV/42/1/69'>Luke 1:69</a>, Christ is called the 'horn of salvation', fulfilling this prophecy. Catholic interpretation sees here the ultimate vindication of the righteous through Christ and His mystical Body, the Church."
    }
  ],
  "translatedAt": "2025-12-22T21:43:33.254Z"
}