{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 37,
  "verses": [
    {
      "pk": 1932100,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 1,
      "text": "Do not be disturbed by evildoers; do not be envious of those who do wrong.",
      "links": "<a href='/AIV/20/24/19'>Prov. 24:19</a>",
      "comment": "The call to avoid envy or anger towards the wicked is a frequent theme in wisdom literature (see Proverbs 24:19). Setting one's heart on God, not worldly success, is foundational for biblical righteousness woven throughout both Old and New Testaments."
    },
    {
      "pk": 1932101,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 2,
      "text": "For they will soon wither like grass and fade like green plants.",
      "links": "<a href='/AIV/19/90/5-6'>Ps. 90:5–6</a>; <a href='/AIV/23/40/6-8'>Isa. 40:6–8</a>",
      "comment": "The comparison to fading grass is reminiscent of Isaiah 40. The fleeting nature of worldly power is contrasted sharply with the permanence of God’s kingdom."
    },
    {
      "pk": 1932102,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 3,
      "text": "Trust in the LORD and do good; dwell in the land and cultivate faithfulness.",
      "links": "<a href='/AIV/19/62/8'>Ps. 62:8</a>; <a href='/AIV/19/34/8'>Ps. 34:8</a>",
      "comment": "There is a promise of security and inheritance for the faithful. Catholics see in this invitation to dwell and 'work the land' a foreshadowing of the life of virtue and the Church’s enduring presence."
    },
    {
      "pk": 1932103,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 4,
      "text": "Delight yourself in the LORD, and He will give you the desires of your heart.",
      "links": "<a href='/AIV/19/21/2'>Ps. 21:2</a>; <a href='/AIV/19/145/19'>Ps. 145:19</a>",
      "comment": "Spiritual delight in God aligns our desires with His will (cf. Psalm 145:19). Catholic tradition encourages the seeking of God Himself as the greatest desire of the heart."
    },
    {
      "pk": 1932104,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 5,
      "text": "Commit your way to the LORD; trust in Him, and He will act.",
      "links": "<a href='/AIV/20/16/3'>Prov. 16:3</a>",
      "comment": "Entrusting one’s life to God and allowing Him to guide has strong echoes in Christ’s teachings on abandonment to God’s will (see Matt 6:33)."
    },
    {
      "pk": 1932105,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 6,
      "text": "He will bring forth your righteousness as the light, and your justice as the noonday.",
      "links": "<a href='/AIV/19/97/11'>Ps. 97:11</a>",
      "comment": "The vindication of the righteous is a central promise. Light as a symbol anticipates Christ (cf. John 8:12), the Light of the world."
    },
    {
      "pk": 1932106,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 7,
      "text": "Be still before the LORD and wait patiently for Him; do not fret because of the one who prospers in his way, because of the man who carries out evil schemes.",
      "links": "<a href='/AIV/19/62/1'>Ps. 62:1</a>; <a href='/AIV/19/73/3'>Ps. 73:3</a>",
      "comment": "Patience is emphasized, echoing both the virtue of hope and the contemplative stillness encouraged in Catholic spirituality."
    },
    {
      "pk": 1932107,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 8,
      "text": "Refrain from anger and abandon wrath; do not fret—it leads only to evil.",
      "links": "<a href='/AIV/20/14/29'>Prov. 14:29</a>; <a href='/AIV/49/4/26-27'>Eph. 4:26-27</a>",
      "comment": "The instruction to turn from anger is echoed in the teachings of Jesus (Matt 5:22). In Catholic tradition, anger is counted among the seven deadly sins."
    },
    {
      "pk": 1932108,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 9,
      "text": "For evildoers will be cut off, but those who hope in the LORD will inherit the land.",
      "links": "<a href='/AIV/19/25/13'>Ps. 25:13</a>; <a href='/AIV/19/37/22'>Ps. 37:22</a>",
      "comment": "‘Inherit the land’ also prefigures Christ’s Beatitude on the meek (Matthew 5:5). Catholics see this as not only material but spiritual inheritance, pointing to the saints’ share in the heavenly Jerusalem."
    },
    {
      "pk": 1932109,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 10,
      "text": "In just a little while, the wicked will be no more; though you look for them, they will not be found.",
      "links": "<a href='/AIV/19/73/19-20'>Ps. 73:19-20</a>",
      "comment": "Echoes the prophetic perspective of God's ultimate justice."
    },
    {
      "pk": 1932110,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 11,
      "text": "But the meek will inherit the land and will delight themselves in abundant peace.",
      "links": "<a href='/AIV/40/5/5'>Matt. 5:5</a>",
      "comment": "Directly quoted by Christ in the Sermon on the Mount, showing fulfillment in the Church. Catholic commentary sees this as a pointer to the sanctity and ultimate reward of the humble (saints)."
    },
    {
      "pk": 1932111,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 12,
      "text": "The wicked plot against the righteous and gnash their teeth at him.",
      "links": "<a href='/AIV/19/35/16'>Ps. 35:16</a>; <a href='/AIV/19/112/10'>Ps. 112:10</a>",
      "comment": "Gnashing of teeth becomes, in Jesus’ teaching, a sign of the torment of the damned (Matt 13:42)."
    },
    {
      "pk": 1932112,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 13,
      "text": "But the Lord laughs at the wicked, for He knows their day is coming.",
      "links": "<a href='/AIV/19/2/4'>Ps. 2:4</a>",
      "comment": "Contrast between God’s sovereignty and human schemes. Related to divine providence and the ultimate futility of opposing God’s will."
    },
    {
      "pk": 1932113,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 14,
      "text": "The wicked draw the sword and bend the bow to bring down the poor and needy, to kill those whose way is upright;",
      "links": "<a href='/AIV/19/10/8-10'>Ps. 10:8–10</a>",
      "comment": "A warning of injustice. Christ, identifying with the poor and persecuted (see Matthew 25:40), fulfills this by His passion and death."
    },
    {
      "pk": 1932114,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 15,
      "text": "but their sword will enter their own heart, and their bows will be broken.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15–16</a>",
      "comment": "The self-destruction of evil plots is a reversal theme common in both Psalms and Marian prayers (cf. Magnificat, Luke 1:51-53)."
    },
    {
      "pk": 1932115,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 16,
      "text": "Better is the little that the righteous has than the abundance of many wicked.",
      "links": "<a href='/AIV/19/73/12'>Ps. 73:12</a>; <a href='/AIV/20/15/16'>Prov. 15:16</a>",
      "comment": "Echoes the theme that true riches are spiritual, not material—see Jesus’ teaching on treasures in heaven (Luke 12:33)."
    },
    {
      "pk": 1932116,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 17,
      "text": "For the arms of the wicked will be broken, but the LORD upholds the righteous.",
      "links": "<a href='/AIV/19/37/24'>Ps. 37:24</a>",
      "comment": "God’s active support for the righteous is a recurring promise in Psalms."
    },
    {
      "pk": 1932117,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 18,
      "text": "The LORD knows the days of the blameless, and their inheritance will last forever.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/19/125/3'>Ps. 125:3</a>",
      "comment": "Catholic interpreters see in this the security of the saints, preserved in grace, and the promise of eternal life."
    },
    {
      "pk": 1932118,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 19,
      "text": "They are not put to shame in evil times; in the days of famine they have abundance.",
      "links": "<a href='/AIV/19/33/19'>Ps. 33:19</a>",
      "comment": "God’s providence, both material and spiritual, is reaffirmed."
    },
    {
      "pk": 1932119,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 20,
      "text": "But the wicked will perish; the enemies of the LORD will vanish like smoke—like the splendor of pastures, they disappear.",
      "links": "<a href='/AIV/19/68/2'>Ps. 68:2</a>",
      "comment": "Fleeting glory of the wicked is contrasted with the enduring reward of the righteous."
    },
    {
      "pk": 1932120,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 21,
      "text": "The wicked borrows and does not pay back, but the righteous is generous and gives.",
      "links": "<a href='/AIV/5/15/8'>Deut. 15:8</a>; <a href='/AIV/19/112/5'>Ps. 112:5</a>",
      "comment": "Generosity is a mark of the just. Catholic social teaching takes its cue from such passages, emphasizing charity as integral to holiness."
    },
    {
      "pk": 1932121,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 22,
      "text": "For those blessed by the LORD will inherit the land, but those cursed by Him will be cut off.",
      "links": "<a href='/AIV/19/37/9'>Ps. 37:9</a>",
      "comment": "Inheritance through blessing foreshadows the Gospel theme of beatitude. See also the Church's emphasis on the efficacy of blessing (sacramentals)."
    },
    {
      "pk": 1932122,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 23,
      "text": "The steps of a man are established by the LORD when He delights in his way.",
      "links": "<a href='/AIV/19/40/2'>Ps. 40:2</a>",
      "comment": "God's guidance is both providential and personal. In Catholic spirituality, this verse resonates with the idea of discernment and vocation."
    },
    {
      "pk": 1932123,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 24,
      "text": "Though he falls, he will not be cast headlong, for the LORD upholds his hand.",
      "links": "<a href='/AIV/19/145/14'>Ps. 145:14</a>",
      "comment": "God’s mercy aids the just when they stumble, hinting at the Church’s teaching on grace sustaining us after sin (see Sacrament of Reconciliation)."
    },
    {
      "pk": 1932124,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 25,
      "text": "I was young and now am old, yet I have not seen the righteous forsaken or his children begging for bread.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "God’s faithfulness to generations is celebrated—seen in the Catholic Church’s stress on family and spiritual heritage."
    },
    {
      "pk": 1932125,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 26,
      "text": "He is always generous and lends freely; his children are blessed.",
      "links": "<a href='/AIV/19/112/5'>Ps. 112:5</a>",
      "comment": "Children inheriting blessing for a parent’s virtue echoes Catholic teachings on the communion of saints and intergenerational blessing."
    },
    {
      "pk": 1932126,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 27,
      "text": "Turn away from evil and do good, so you will dwell forever.",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>",
      "comment": "Holiness of life ensures lasting security—a principle undergirding Christ’s call to discipleship (Mark 10:21)."
    },
    {
      "pk": 1932127,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 28,
      "text": "For the LORD loves justice; He will not abandon His saints. They are preserved forever, but the children of the wicked will be cut off.",
      "links": "<a href='/AIV/19/31/23'>Ps. 31:23</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "God’s love for justice underlies Catholic teaching on the communion of saints and final perseverance (see Jude 1:24)."
    },
    {
      "pk": 1932128,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 29,
      "text": "The righteous will inherit the land and dwell upon it forever.",
      "links": "<a href='/AIV/19/37/9'>Ps. 37:9</a>; <a href='/AIV/40/25/34'>Matt. 25:34</a>",
      "comment": "An eternal inheritance points to the New Covenant hope—fulfilled in Christ offering the Church both here and in eternity."
    },
    {
      "pk": 1932129,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 30,
      "text": "The mouth of the righteous utters wisdom, and his tongue speaks what is just.",
      "links": "<a href='/AIV/20/10/31'>Prov. 10:31</a>; <a href='/AIV/19/49/3'>Ps. 49:3</a>",
      "comment": "The speech of the virtuous reflects the wisdom of the Holy Spirit—a theme expanded upon in the New Testament (James 3:13)."
    },
    {
      "pk": 1932130,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 31,
      "text": "The law of his God is in his heart; his steps do not slip.",
      "links": "<a href='/AIV/19/40/8'>Ps. 40:8</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "‘Law written on the heart’ is fulfilled in the New Covenant (cf. Jer. 31:33), which the Catholic Church holds as inaugurated through Christ and entered in Baptism."
    },
    {
      "pk": 1932131,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 32,
      "text": "The wicked watches for the righteous and seeks to put him to death.",
      "links": "<a href='/AIV/19/10/8-10'>Ps. 10:8–10</a>",
      "comment": "A foreshadowing of Christ's passion: ‘they watched for his life’ (see Mark 14:1; John 7:1)."
    },
    {
      "pk": 1932132,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 33,
      "text": "The LORD will not abandon him to his power or let him be condemned when he is judged.",
      "links": "<a href='/AIV/19/34/22'>Ps. 34:22</a>; <a href='/AIV/45/8/33'>Rom. 8:33</a>",
      "comment": "Echoes the resurrection—evil does not have the last word. Note the Catholic view of God’s continuing deliverance through grace."
    },
    {
      "pk": 1932133,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 34,
      "text": "Wait for the LORD and keep His way, and He will exalt you to inherit the land; you will look on when the wicked are cut off.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/19/92/11'>Ps. 92:11</a>",
      "comment": "Waiting and perseverance are rewarded. Catholic tradition encourages perseverance in faith, especially in hardships."
    },
    {
      "pk": 1932134,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 35,
      "text": "I have seen a wicked, ruthless man, spreading himself like a green tree in its native soil.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>",
      "comment": "The image of seeming prosperity is ultimately deceptive, as the next verse shows."
    },
    {
      "pk": 1932135,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 36,
      "text": "But he passed away, and behold, he was no more; though I sought him, he could not be found.",
      "links": "<a href='/AIV/19/73/20'>Ps. 73:20</a>",
      "comment": "The visible success of the wicked has no permanence—an encouragement to trust in God’s justice."
    },
    {
      "pk": 1932136,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 37,
      "text": "Mark the blameless person, and observe the upright, for there is a future for the man of peace.",
      "links": "<a href='/AIV/19/73/17'>Ps. 73:17</a>",
      "comment": "The promise of peace and a future ties into Christ's blessing of peacemakers (see Matthew 5:9)."
    },
    {
      "pk": 1932137,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 38,
      "text": "But transgressors will be destroyed together; the future of the wicked will be cut off.",
      "links": "<a href='/AIV/19/37/9'>Ps. 37:9</a>",
      "comment": "Clear statement of final judgment. Catholic doctrine stresses the reality of both heaven and hell."
    },
    {
      "pk": 1932138,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 39,
      "text": "The salvation of the righteous comes from the LORD; He is their stronghold in the time of trouble.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/62/2'>Ps. 62:2</a>",
      "comment": "Old Testament salvation prefigures Christ, who Christians view as true Deliverer and refuge for the Church."
    },
    {
      "pk": 1932139,
      "translation": "AIV",
      "book": 19,
      "chapter": 37,
      "verse": 40,
      "text": "The LORD helps them and delivers them; He delivers them from the wicked and saves them, because they take refuge in Him.",
      "links": "<a href='/AIV/19/34/22'>Ps. 34:22</a>",
      "comment": "Taking refuge in God points ahead to the Church as the ark of salvation, a motif carried into Catholic understanding of the role of the Church and the sacraments as means of grace."
    }
  ],
  "translatedAt": "2025-12-22T21:32:22.237Z"
}