{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 110,
  "verses": [
    {
      "pk": 23110001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 1,
      "text": "The LORD says to my Lord: 'Sit at My right hand until I make Your enemies a footstool for Your feet.'",
      "links": "<a href='/AIV/40/22/44'>Matt. 22:44</a>; <a href='/AIV/41/12/36'>Mark 12:36</a>; <a href='/AIV/42/20/42-43'>Luke 20:42–43</a>; <a href='/AIV/58/1/13'>Heb. 1:13</a>",
      "comment": "This verse is quoted directly in the New Testament to highlight Messiah's divine authority. 'The LORD says to my Lord' presents two divine persons, indicating both the Father's and the Messiah's sovereignty. Jesus uses this text to reveal His own divinity and greater kingship (see Matt. 22:44). The image of sitting at the right hand symbolizes sharing in God’s authority, signifying the Messiah's kingship over all creation. The idea of a footstool for Your feet (see Isa. 66:1) shows ultimate victory and subjection of all enemies."
    },
    {
      "pk": 23110002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 2,
      "text": "The LORD will extend Your mighty scepter from Zion, saying, 'Rule in the midst of Your enemies!'",
      "links": "<a href='/AIV/19/2/6-9'>Ps. 2:6-9</a>; <a href='/AIV/38/9/10'>Zech. 9:10</a>",
      "comment": "The scepter represents authority and kingship. Its extension from Zion links the Messiah’s spiritual rule to Jerusalem as the center of God’s kingdom. The command to 'rule in the midst of Your enemies' points to the Messiah’s reign even while opposition exists—fulfilled ultimately in Christ’s kingship over both heaven and earth. This expectation of an everlasting kingdom is echoed throughout the prophets (see Dan. 7:13-14)."
    },
    {
      "pk": 23110003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 3,
      "text": "Your people will offer themselves freely on the day of Your power, in holy splendor. From the womb of the dawn, You have the dew of Your youth.",
      "links": "<a href='/AIV/23/60/1-3'>Isa. 60:1-3</a>; <a href='/AIV/54/2/21'>1 Pet. 2:9</a>",
      "comment": "This verse foresees a willing and devoted people who serve the Messiah in holiness. The phrase 'from the womb of the dawn, You have the dew of Your youth,' poetically expresses renewal, purity, and the perpetual vigor of the Messiah’s priestly people. The image of freely offering themselves indicates joyful, voluntary service—a mark of those truly united to Christi­­an worship, especially in the context of the Church as a holy priesthood (see 1 Pet. 2:9)."
    },
    {
      "pk": 23110004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 4,
      "text": "The LORD has sworn and will not change His mind: 'You are a priest forever according to the order of Melchizedek.'",
      "links": "<a href='/AIV/01/14/18-20'>Gen. 14:18-20</a>; <a href='/AIV/58/5/6'>Heb. 5:6</a>; <a href='/AIV/58/7/17'>Heb. 7:17</a>",
      "comment": "This oath makes the Messiah a priest forever, not from the tribe of Levi but after Melchizedek (Gen. 14:18-20), who was both king and priest. The New Testament sees this as fulfilled in Christ’s eternal priesthood (Heb. 5–7). Christ’s priesthood brings a lasting, unbreakable covenant and mediates God’s presence, perfectly reconciling God and man through a single, unending sacrifice."
    },
    {
      "pk": 23110005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 5,
      "text": "The Lord at Your right hand will shatter kings on the day of His wrath.",
      "links": "<a href='/AIV/23/2/12'>Isa. 2:12</a>; <a href='/AIV/66/19/11-16'>Rev. 19:11-16</a>",
      "comment": "The Messiah, standing at God’s right hand, judges the nations. This foreshadows the final judgment when all earthly rulers are brought low. This victory is both spiritual—in defeating sin and death—and, in the broader sense, shows the Messiah’s supreme authority in history and eternity. Notice the unity between kingship and priesthood—a unique feature of this figure."
    },
    {
      "pk": 23110006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 6,
      "text": "He will judge among the nations, filling them with corpses; He will shatter chiefs over the wide earth.",
      "links": "<a href='/AIV/23/66/16'>Isa. 66:16</a>; <a href='/AIV/66/19/17-21'>Rev. 19:17-21</a>",
      "comment": "This verse emphasizes the Messiah’s just and universal rule—not only as savior but as judge. Judgment of nations and rulers indicates that no authority stands outside the Messiah’s reign, consistent with prophetic imagery of the final day (see Isa. 66:16, Rev. 19:19-21). This also highlights the seriousness of God’s call to conversion and faithfulness."
    },
    {
      "pk": 23110007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 110,
      "verse": 7,
      "text": "He will drink from the brook by the way; therefore He will lift up His head.",
      "links": "<a href='/AIV/07/7/5-7'>Judg. 7:5-7</a>; <a href='/AIV/19/3/3'>Ps. 3:3</a>",
      "comment": "Drinking from the brook symbolizes refreshment and humble dependence even amid conquest. The Messiah’s 'lifting up His head' suggests exaltation through humility and trust in God. This points spiritually to Christ’s endurance and triumph—His willingness to enter into the suffering of humanity (Phil. 2:8-11), and His final glorification. There is also an implicit reference to leading the people with strength and confidence on the journey of faith."
    }
  ],
  "translatedAt": "2025-12-24T06:39:16.453Z"
}