{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 110,
  "verses": [
    {
      "pk": 1901101,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 1,
      "text": "The LORD said to my Lord: \"Sit at My right hand until I make Your enemies a footstool for Your feet.\"",
      "links": "<a href='/AIV/40/22/44'>Matt. 22:44</a>; <a href='/AIV/41/12/36'>Mark 12:36</a>; <a href='/AIV/42/20/42-43'>Luke 20:42–43</a>; <a href='/AIV/58/1/13'>Heb. 1:13</a>",
      "comment": "This verse is directly quoted by Jesus to establish His divine authority (see Matt. 22:44). The phrase 'sit at My right hand' is an explicit claim to sharing God's power and majesty, pointing to the Messiah’s divinity. The original Hebrew distinguishes between 'the LORD' (YHWH) and 'my Lord' (Adonai), anticipating the mystery of Christ seated at the right hand of the Father. In Christian tradition, this supports the belief in Christ's kingship and the unique relationship between the Father and the Son, laying the foundation for a visible, united Church with divine authority."
    },
    {
      "pk": 1901102,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 2,
      "text": "The LORD will extend Your mighty scepter from Zion, saying, \"Rule in the midst of Your enemies!\"",
      "links": "<a href='/AIV/19/2/6-9'>Ps. 2:6–9</a>; <a href='/AIV/19/45/6'>Ps. 45:6</a>",
      "comment": "The Messiah’s rule goes forth from Zion, signifying both a spiritual and historical center for God’s people. The 'scepter' represents authority and kingship (see Gen. 49:10), which is ultimately realized in Christ as King, whose reign is both present and expected to be fully manifested. Note how this foreshadows the spread of Christ’s reign throughout the world, through the ongoing work and mission of His Church."
    },
    {
      "pk": 1901103,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 3,
      "text": "Your people will offer themselves freely on the day of Your power, in holy garments; from the womb of the morning, the dew of Your youth will be Yours.",
      "links": "<a href='/AIV/19/96/9'>Ps. 96:9</a>; <a href='/AIV/19/49/14'>Ps. 49:14</a>",
      "comment": "Willing service is given to the Messiah by His people, described as clothed in 'holy garments'—a phrase that echoes priestly and royal consecration. 'Dew of Your youth' suggests vitality and a multitude, hinting at both a spiritual priesthood and the sanctity of those who belong to Christ. The imagery subtly points to the sacrificial and liturgical nature of the worship offered to God by all believers, set apart in purity and devotion."
    },
    {
      "pk": 1901104,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 4,
      "text": "The LORD has sworn and will not change His mind: \"You are a priest forever after the order of Melchizedek.\"",
      "links": "<a href='/AIV/01/14/18'>Gen. 14:18</a>; <a href='/AIV/58/5/6'>Heb. 5:6</a>; <a href='/AIV/58/7/17'>Heb. 7:17</a>",
      "comment": "Here the Messiah is declared an eternal priest, not from the line of Aaron, but in the 'order of Melchizedek'—a king and priest from Genesis who offered bread and wine to Abram (Gen. 14:18). The New Testament (especially Hebrews 7) associates this with Christ’s unique priesthood—unending and mediatorial. The unbroken oath signifies the perpetual nature of Christ’s priestly mediation, prefiguring lasting rituals and mysteries through which grace is continually offered to believers."
    },
    {
      "pk": 1901105,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 5,
      "text": "The Lord is at Your right hand; He will crush kings on the day of His wrath.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "This verse emphasizes the Messiah’s active judgment and authority over the nations. The imagery of crushing kings reminds us of the Messiah’s victory over all earthly powers, a theme elaborated in Revelation. This immense authority also points to a single, final judgment and the ultimate vindication of God’s chosen people."
    },
    {
      "pk": 1901106,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 6,
      "text": "He will judge among the nations, filling them with corpses; He will crush the heads over the wide earth.",
      "links": "<a href='/AIV/19/2/10-12'>Ps. 2:10–12</a>; <a href='/AIV/01/3/15'>Gen. 3:15</a>",
      "comment": "The Messiah is depicted as universal judge, ruling in righteousness. The phrase 'crush the heads' echoes the promise of Genesis 3:15 and foreshadows Christ’s triumph over evil. The scope of judgment is global, leading to the hope of a new creation free from sin, with God’s people united in purpose and worship."
    },
    {
      "pk": 1901107,
      "translation": "AIV",
      "book": 19,
      "chapter": 110,
      "verse": 7,
      "text": "He will drink from the brook by the way; therefore He will lift up His head.",
      "links": "<a href='/AIV/23/53/12'>Isa. 53:12</a>; <a href='/AIV/19/3/3'>Ps. 3:3</a>",
      "comment": "This poetic image suggests humble refreshment and victory through suffering. 'Drinking from the brook' can point to Messiah’s willingness to undergo hardship for the sake of His mission, then being lifted up in triumph. The pattern of humility and exaltation mirrors the passion and resurrection of Christ—honoring obedience, self-offering, and trust in God’s final vindication."
    }
  ],
  "translatedAt": "2025-12-23T05:41:51.146Z"
}