{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 31,
  "verses": [
    {
      "pk": 31031001,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 1,
      "text": "In you, O LORD, I have taken refuge; let me never be put to shame. Deliver me in your righteousness.",
      "links": "<a href='/AIV/25/3/25'>Lam. 3:25</a>; <a href='/AIV/19/71/1'>Ps. 71:1</a>",
      "comment": "The psalmist begins with trust in God, not his own merit. The theme of seeking refuge in God anticipates Christ's perfect trust in the Father (see Luke 23:46)."
    },
    {
      "pk": 31031002,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 2,
      "text": "Incline your ear to me, rescue me quickly! Be to me a rock of refuge, a strong fortress to save me.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/71/3'>Ps. 71:3</a>",
      "comment": "God is pictured as both attentive and a stronghold—images fulfilled in Christ as our unshakable refuge."
    },
    {
      "pk": 31031003,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 3,
      "text": "For you are my rock and my fortress, and for your name’s sake you will lead me and guide me.",
      "links": "<a href='/AIV/19/23/3'>Ps. 23:3</a>; <a href='/AIV/19/25/11'>Ps. 25:11</a>",
      "comment": "God leads for the sake of His name, anticipating God’s shepherding role in Christ (John 10:11–14). In Catholic understanding, God's guidance is mediated especially through the Church."
    },
    {
      "pk": 31031004,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 4,
      "text": "Pull me out of the net they have hidden for me, for you are my refuge.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>",
      "comment": "The image of a hidden net demonstrates the reality of spiritual warfare and human plots. Trust in God’s deliverance foreshadows Christ’s escape from evil plots (Matt. 26:4)."
    },
    {
      "pk": 31031005,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 5,
      "text": "Into your hand I commit my spirit; you have redeemed me, O LORD, faithful God.",
      "links": "<a href='/AIV/42/23/46'>Luke 23:46</a>; <a href='/AIV/19/16/10'>Ps. 16:10</a>",
      "comment": "Jesus quotes this on the cross. This is a direct prophecy fulfilled by Christ (Luke 23:46), indicating total trust. The phrase is echoed in the Christian tradition, for example in the dying words of many saints."
    },
    {
      "pk": 31031006,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 6,
      "text": "I hate those who regard worthless idols, but I trust in the LORD.",
      "links": "<a href='/AIV/19/26/5'>Ps. 26:5</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Idolatry is rejected. Trust in the LORD alone is foundational. The Catholic tradition maintains vigilance against all forms of idolatry, clarifying the distinction between worship (latria) and veneration (dulia)."
    },
    {
      "pk": 31031007,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 7,
      "text": "I will rejoice and be glad in your steadfast love, because you have seen my affliction and known the troubles of my soul.",
      "links": "<a href='/AIV/19/13/5'>Ps. 13:5</a>; <a href='/AIV/19/25/18'>Ps. 25:18</a>",
      "comment": "God's steadfast love (hesed) is key in the Psalms. The concept of God’s lovingkindness finds fulfillment in the tangible sacramental life in the Church."
    },
    {
      "pk": 31031008,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 8,
      "text": "You have not given me into the hand of the enemy; you have set my feet in a broad place.",
      "links": "<a href='/AIV/19/18/36'>Ps. 18:36</a>; <a href='/AIV/19/118/5'>Ps. 118:5</a>",
      "comment": "A 'broad place' suggests liberation and security. Christ, in his resurrection, is the ultimate deliverance from the enemy."
    },
    {
      "pk": 31031009,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 9,
      "text": "Be gracious to me, O LORD, for I am in distress; my eye is wasted from grief, my soul and my body also.",
      "links": "<a href='/AIV/19/6/7'>Ps. 6:7</a>; <a href='/AIV/19/38/8'>Ps. 38:8</a>",
      "comment": "A cry for mercy in suffering—reflective of Christ’s passion and His identification with human sorrow."
    },
    {
      "pk": 31031010,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 10,
      "text": "For my life is spent with sorrow and my years with sighing; my strength fails because of my sin, and my bones are wasted away.",
      "links": "<a href='/AIV/19/32/3'>Ps. 32:3</a>; <a href='/AIV/19/38/3'>Ps. 38:3</a>",
      "comment": "The psalmist acknowledges personal sin. Catholics see here the value of contrition and penance, which points to the sacrament of Reconciliation."
    },
    {
      "pk": 31031011,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 11,
      "text": "Because of all my adversaries I have become a reproach, especially to my neighbors, and an object of dread to my friends; those who see me in the street flee from me.",
      "links": "<a href='/AIV/19/69/7-9'>Ps. 69:7-9</a>; <a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "This isolation and reproach prefigures the suffering servant (Isa. 53:3) and finds fulfillment in Christ's passion."
    },
    {
      "pk": 31031012,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 12,
      "text": "I have been forgotten like one dead, I have become like a broken vessel.",
      "links": "<a href='/AIV/19/88/5'>Ps. 88:5</a>",
      "comment": "A vivid image of suffering and exclusion. The spiritual tradition understands this as a type of the soul abandoned apart from grace."
    },
    {
      "pk": 31031013,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 13,
      "text": "For I hear the whispering of many—terror on every side! —as they scheme together against me, plotting to take my life.",
      "links": "<a href='/AIV/24/20/10'>Jer. 20:10</a>; <a href='/AIV/40/26/4'>Matt. 26:4</a>",
      "comment": "The language echoes Jeremiah 20:10 and the conspiracy against Jesus. Christological fulfillment is clear in Jesus’ betrayal and arrest."
    },
    {
      "pk": 31031014,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 14,
      "text": "But as for me, I trust in you, O LORD; I say, 'You are my God.'",
      "links": "<a href='/AIV/19/16/2'>Ps. 16:2</a>",
      "comment": "Confession of faith in the midst of abandonment. The constant recourse to God in difficulty is modeled by the saints."
    },
    {
      "pk": 31031015,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 15,
      "text": "My times are in your hand; deliver me from the hand of my enemies and from those who pursue me.",
      "links": "<a href='/AIV/19/37/5'>Ps. 37:5</a>; <a href='/AIV/19/139/16'>Ps. 139:16</a>",
      "comment": "The sovereignty of God over the psalmist’s life foreshadows the doctrine of Divine Providence. Entrusting all to God echoes Marian abandonment: 'Let it be done unto me.'"
    },
    {
      "pk": 31031016,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 16,
      "text": "Make your face shine on your servant; save me in your steadfast love.",
      "links": "<a href='/AIV/4/6/25'>Num. 6:25</a>; <a href='/AIV/19/80/7'>Ps. 80:7</a>",
      "comment": "An allusion to the priestly blessing. Catholics find the face of God revealed in Christ and encountered sacramentally."
    },
    {
      "pk": 31031017,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 17,
      "text": "O LORD, let me not be put to shame, for I call upon you; let the wicked be put to shame; let them be silent in Sheol.",
      "links": "<a href='/AIV/19/6/10'>Ps. 6:10</a>; <a href='/AIV/19/28/1'>Ps. 28:1</a>",
      "comment": "Shame is contrasted with trust. The psalm's expectation of divine justice is now realized in the final judgment seat of Christ."
    },
    {
      "pk": 31031018,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 18,
      "text": "Let lying lips be silenced, which speak arrogantly against the righteous in pride and contempt.",
      "links": "<a href='/AIV/19/120/2'>Ps. 120:2</a>; <a href='/AIV/19/34/13'>Ps. 34:13</a>",
      "comment": "God’s justice silences falsehood. In the Church, truth is safeguarded and taught 'without error.'"
    },
    {
      "pk": 31031019,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 19,
      "text": "How abundant is your goodness, which you have stored up for those who fear you, and worked for those who take refuge in you, in the sight of the children of mankind!",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "God’s goodness is for those who 'fear' Him—a holy reverence that finds expression in liturgical worship, especially the Eucharist."
    },
    {
      "pk": 31031020,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 20,
      "text": "You hide them in the shelter of your presence from the plots of men; you conceal them in your dwelling from accusing tongues.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>; <a href='/AIV/19/17/8'>Ps. 17:8</a>",
      "comment": "God’s presence and 'dwelling' were first the Temple, then Christ Himself, and today extended in the Church—the new Temple."
    },
    {
      "pk": 31031021,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 21,
      "text": "Blessed be the LORD, for he has shown me his marvelous love in a fortified city.",
      "links": "<a href='/AIV/19/66/20'>Ps. 66:20</a>; <a href='/AIV/19/48/8'>Ps. 48:8</a>",
      "comment": "The 'fortified city' points to Jerusalem, and by extension the Heavenly Jerusalem (Heb. 12:22), also seen as the Church."
    },
    {
      "pk": 31031022,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 22,
      "text": "As for me, I said in my alarm, 'I am cut off from your sight.' Yet you heard the voice of my pleas when I cried to you for help.",
      "links": "<a href='/AIV/19/77/7-10'>Ps. 77:7-10</a>",
      "comment": "Even in apparent abandonment, God hears the humble. The spiritual life includes seasons of spiritual dryness, but God's mercy endures."
    },
    {
      "pk": 31031023,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 23,
      "text": "Love the LORD, all you his saints! The LORD preserves the faithful, but fully repays the one who acts with arrogance.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "A call to the 'saints'—the holy ones, sometimes referring to faithful Israel, now understood also as the Church. The call to love God is echoed in Christ’s great commandment (Matt. 22:37)."
    },
    {
      "pk": 31031024,
      "translation": "AIV",
      "book": 19,
      "chapter": 31,
      "verse": 24,
      "text": "Be strong, and let your heart take courage, all you who hope in the LORD.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "Concluding exhortation: hope and strength are found in the LORD. Christ fulfills this by saying, 'Take heart; I have overcome the world.' (John 16:33). The Church continues as a source of hope and courage for the faithful."
    }
  ],
  "translatedAt": "2025-12-22T21:29:55.030Z"
}