{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 91,
  "verses": [
    {
      "pk": 1991001,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 1,
      "text": "He who dwells in the secret place of the Most High will abide in the shadow of the Almighty.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>; <a href='/AIV/19/32/7'>Ps. 32:7</a>; <a href='/AIV/19/121/5'>Ps. 121:5</a>",
      "comment": "‘Secret place’ may refer to the Temple or God's protection. The phrase 'Most High' (Heb: Elyon) emphasizes God's supreme authority, a theme common in both Old and New Testaments. The imagery points to spiritual safety, prefiguring the safety found in Christ and the Church (see Col. 3:3)."
    },
    {
      "pk": 1991002,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 2,
      "text": "I will say to the LORD, 'My refuge and my fortress, my God, in whom I trust.'",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/31/3-4'>Ps. 31:3-4</a>",
      "comment": "The language of refuge and fortress connects to covenant faithfulness. Trust in God anticipates NT themes of faith in Christ (Heb. 6:18-20; 2 Thes. 3:3)."
    },
    {
      "pk": 1991003,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 3,
      "text": "For he will deliver you from the snare of the fowler and from the deadly pestilence.",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>; <a href='/AIV/19/121/7'>Ps. 121:7</a>",
      "comment": "'Fowler's snare' is a metaphor for hidden dangers. Deliverance from pestilence foreshadows God's ultimate deliverance through Christ and sacramental life in the Church (James 5:14)."
    },
    {
      "pk": 1991004,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 4,
      "text": "He will cover you with his feathers, and under his wings you will find refuge; his faithfulness is a shield and armor.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/57/1'>Ps. 57:1</a>",
      "comment": "The maternal, protective image is echoed by Jesus (Matt. 23:37), showing Christ as fulfillment. 'Faithfulness' (Heb: 'emet') signifies covenant love – a notion central to Catholic soteriology."
    },
    {
      "pk": 1991005,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 5,
      "text": "You will not fear the terror of the night, nor the arrow that flies by day,",
      "links": "<a href='/AIV/19/121/6'>Ps. 121:6</a>",
      "comment": "Symbolic of dangers at all times; day and night encompass all threats, tying into spiritual warfare (Eph. 6:16)."
    },
    {
      "pk": 1991006,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 6,
      "text": "nor the pestilence that stalks in darkness, nor the destruction that lays waste at noon.",
      "links": "<a href='/AIV/19/91/3'>Ps. 91:3</a>; <a href='/AIV/19/121/7'>Ps. 121:7</a>",
      "comment": "Repetition of safety from hidden and obvious dangers. Some Church Fathers see in this verse a type of protection found in the sacraments."
    },
    {
      "pk": 1991007,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 7,
      "text": "A thousand may fall at your side, ten thousand at your right hand, but it will not come near you.",
      "links": "<a href='/AIV/19/3/6'>Ps. 3:6</a>; <a href='/AIV/19/27/3'>Ps. 27:3</a>",
      "comment": "This overwhelming protection illustrates divine favor, prefiguring the saints’ perseverance and God’s guardianship over the Church (Matt. 16:18)."
    },
    {
      "pk": 1991008,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 8,
      "text": "You will only look with your eyes and see the punishment of the wicked.",
      "links": "<a href='/AIV/19/37/34'>Ps. 37:34'>; <a href='/AIV/19/92/11'>Ps. 92:11</a>",
      "comment": "A promise of vindication. The idea of final judgment is consistent with both Old and New Testament teaching (2 Thes. 1:6-8)."
    },
    {
      "pk": 1991009,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 9,
      "text": "Because you have made the LORD your dwelling place—the Most High, who is my refuge—",
      "links": "<a href='/AIV/19/90/1'>Ps. 90:1</a>; <a href='/AIV/19/32/7'>Ps. 32:7</a>",
      "comment": "God as 'dwelling' recalls temple imagery, which Catholics see ultimately fulfilled in Christ (John 2:19-21) and the Church as God’s new temple (1 Cor. 3:16)."
    },
    {
      "pk": 1991010,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 10,
      "text": "no evil shall be allowed to befall you, no plague come near your tent.",
      "links": "<a href='/AIV/19/121/7'>Ps. 121:7</a>",
      "comment": "This promise is not a guarantee of no suffering, but of ultimate spiritual protection. The 'tent' echoes the tabernacle – a symbol precious to Catholic liturgy."
    },
    {
      "pk": 1991011,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 11,
      "text": "For he will command his angels concerning you to guard you in all your ways.",
      "links": "<a href='/AIV/40/4/6'>Matt. 4:6</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/18/33/23-24'>Job 33:23-24</a>",
      "comment": "Quoted when Satan tempts Jesus (Matt. 4:6; Luke 4:10), highlighting the messianic expectation and Christ's obedience. Catholic tradition develops the doctrine of guardian angels from this verse."
    },
    {
      "pk": 1991012,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 12,
      "text": "They will lift you up in their hands, so that you do not strike your foot against a stone.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/40/4/6'>Matt. 4:6</a>",
      "comment": "Directly applied to Christ during his temptation, affirming his messianic identity. Spiritual application for all Christians – God’s providence is active yet calls for humility, not presumption."
    },
    {
      "pk": 1991013,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 13,
      "text": "You will tread on the lion and the cobra; the young lion and the serpent you will trample underfoot.",
      "links": "<a href='/AIV/41/16/18'>Mark 16:18</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>; <a href='/AIV/10/22/34'>2 Sam. 22:34</a>",
      "comment": "Echoes the protoevangelium (Gen. 3:15). Christians, united with Christ, participate in his victory over evil powers—this is liturgically expressed in Catholic exorcism prayers."
    },
    {
      "pk": 1991014,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 14,
      "text": "Because he has set his love upon me, therefore I will deliver him; I will set him on high, because he knows my name.",
      "links": "<a href='/AIV/19/9/10'>Ps. 9:10</a>; <a href='/AIV/20/18/10'>Prov. 18:10</a>",
      "comment": "The initiative of grace and elevation is God's, but requires human response. The Catholic notion of cooperation with grace is subtly present."
    },
    {
      "pk": 1991015,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 15,
      "text": "He will call on me, and I will answer him; I will be with him in trouble; I will deliver him and honor him.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "Prayer is effective, and God’s presence is promised in suffering. The Church interprets this as a call to perseverance and fidelity (Rom. 8:28, Phil. 1:20)."
    },
    {
      "pk": 1991016,
      "translation": "AIV",
      "book": 19,
      "chapter": 91,
      "verse": 16,
      "text": "With long life I will satisfy him and show him my salvation.",
      "links": "<a href='/AIV/19/21/4'>Ps. 21:4</a>; <a href='/AIV/42/2/30'>Luke 2:30</a>",
      "comment": "In the NT, 'salvation' is fully revealed in Christ. Early Christians saw this as a prophecy of eternal life in Christ – made present especially through the Eucharist."
    }
  ],
  "translatedAt": "2025-12-22T21:49:06.475Z"
}