{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 73,
  "verses": [
    {
      "pk": 23073001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 1,
      "text": "Surely God is good to Israel, to those who are pure in heart.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "This opening verse affirms God's goodness specifically to the righteous—those pure in heart. Jesus expands on this in the Sermon on the Mount, emphasizing purity of heart as the way to see God (Matt. 5:8). The concept draws us to think about the spiritual union of believers with God through inner transformation."
    },
    {
      "pk": 23073002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 2,
      "text": "But as for me, my feet had almost slipped; I nearly lost my footing.",
      "links": "<a href='/AIV/19/94/18'>Ps. 94:18</a>",
      "comment": "The psalmist confesses his vulnerability to doubt and weakness. This humble admission echoes the frequent biblical theme that faith can be tested (see Ps. 94:18), but God's grace sustains the faithful."
    },
    {
      "pk": 23073003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 3,
      "text": "For I envied the arrogant when I saw the prosperity of the wicked.",
      "links": "<a href='/AIV/18/21/7-13'>Job 21:7-13</a>; <a href='/AIV/19/37/1'>Ps. 37:1</a>",
      "comment": "This verse addresses the common struggle with envy and the apparent success of the unjust. This theme is echoed in Job and elsewhere in the Psalms, reminding readers of the mysterious justice of God’s providence."
    },
    {
      "pk": 23073004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 4,
      "text": "For they have no struggles; their bodies are healthy and strong.",
      "links": "<a href='/AIV/18/21/7-9'>Job 21:7-9</a>",
      "comment": "The psalmist observes the external blessings of the wicked, showing that earthly prosperity is not always a sign of God’s favor. This insight foreshadows New Testament teaching about storing up treasures in heaven."
    },
    {
      "pk": 23073005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 5,
      "text": "They are not in trouble like other people, nor are they plagued like the rest of mankind.",
      "links": "<a href='/AIV/18/12/6'>Job 12:6</a>",
      "comment": "This verse adds to the psalmist’s observation that the lives of the wicked seem unusually easy, creating a temptation to believe that God overlooks evil. Yet, Scripture reassures us that final justice belongs to God."
    },
    {
      "pk": 23073006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 6,
      "text": "Therefore pride is their necklace; violence covers them like a garment.",
      "links": "<a href='/AIV/20/1/18-19'>Prov. 1:18-19</a>",
      "comment": "Pride and violence become the defining features, or ‘clothing’, of the wicked. This metaphor invites reflection on interior sins versus outward appearance, a contrast Jesus often highlighted."
    },
    {
      "pk": 23073007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 7,
      "text": "Their eyes bulge with abundance; the imaginations of their hearts overflow.",
      "links": "<a href='/AIV/19/17/10'>Ps. 17:10</a>; <a href='/AIV/20/10/22'>Prov. 10:22</a>",
      "comment": "These are vivid images of materialistic greed and sinful desires. The abundance they possess fosters a spiritual emptiness, which stands in stark contrast to true richness found in God."
    },
    {
      "pk": 23073008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 8,
      "text": "They scoff and speak with malice; arrogantly they threaten oppression.",
      "links": "<a href='/AIV/19/12/4'>Ps. 12:4</a>",
      "comment": "The wicked not only prosper but use their words to oppress others. The Psalms repeatedly warn against speaking evil and remind us of the power of the tongue (see James 3:6)."
    },
    {
      "pk": 23073009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 9,
      "text": "They have set their mouths against the heavens, and their tongues strut through the earth.",
      "links": "<a href='/AIV/19/2/2-4'>Ps. 2:2-4</a>",
      "comment": "Here is blasphemy: the arrogant speak against God and flaunt their rebellion openly. Ps. 2 warns that God’s ultimate authority cannot be challenged; He remains on His throne."
    },
    {
      "pk": 23073010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 10,
      "text": "Therefore his people turn back to them and find no fault in them.",
      "links": "<a href='/AIV/19/36/1-4'>Ps. 36:1-4</a>",
      "comment": "Many are led astray by the outward appearance of blessing. Such deception cautions believers not to judge by worldly standards, but to seek deeper spiritual discernment."
    },
    {
      "pk": 23073011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 11,
      "text": "They say, 'How can God know? Does the Most High have knowledge?'",
      "links": "<a href='/AIV/19/10/11'>Ps. 10:11</a>; <a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "The wicked question God's omniscience, a common tactic in the Psalms. Yet, the knowledge of God is complete; nothing is hidden from Him (Heb. 4:13)."
    },
    {
      "pk": 23073012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 12,
      "text": "Behold, these are the wicked; always at ease, they increase in wealth.",
      "links": "<a href='/AIV/19/49/6'>Ps. 49:6</a>",
      "comment": "The Psalmist sums up the apparent contradiction—wickedness and prosperity together—hinting at the tension between earthly life and ultimate justice."
    },
    {
      "pk": 23073013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 13,
      "text": "Surely in vain have I kept my heart pure, and washed my hands in innocence.",
      "links": "<a href='/AIV/19/26/6'>Ps. 26:6</a>; <a href='/AIV/40/27/24'>Matt. 27:24</a>",
      "comment": "The psalmist voices a crisis of faith, feeling his devotion has been fruitless. Such honesty is allowed in God’s presence—the psalms model prayerful wrestling with doubt."
    },
    {
      "pk": 23073014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 14,
      "text": "For all day long I am afflicted, and every morning brings new punishment.",
      "links": "<a href='/AIV/19/88/15'>Ps. 88:15</a>",
      "comment": "The faithful experience suffering while the wicked appear to thrive. Jesus Himself bore suffering, showing believers the deeper meaning found in redemptive trials (see Isa 53:3)."
    },
    {
      "pk": 23073015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 15,
      "text": "If I had spoken like this, I would have betrayed your children.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "Honest doubt is distinguished from open rebellion. The psalmist restrains his complaint, mindful of its possible impact on the faith community. This reflects a communal understanding of faith."
    },
    {
      "pk": 23073016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 16,
      "text": "When I tried to understand all this, it seemed a wearisome task.",
      "links": "",
      "comment": "Relying on human reasoning alone, life’s injustices are impossible to grasp. True wisdom comes from God’s revelation, not mere intellect."
    },
    {
      "pk": 23073017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 17,
      "text": "Until I entered the sanctuary of God, then I understood their end.",
      "links": "<a href='/AIV/19/77/13'>Ps. 77:13</a>; <a href='/AIV/19/27/4'>Ps. 27:4</a>",
      "comment": "Everything changes in God’s presence, especially during corporate worship and sacramental encounters. Here, divine justice and eternity are revealed—echoed in the New Covenant’s focus on the transformative nature of worship."
    },
    {
      "pk": 23073018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 18,
      "text": "Surely you set them on slippery ground; you cast them down to ruin.",
      "links": "<a href='/AIV/19/35/6'>Ps. 35:6</a>; <a href='/AIV/19/37/35-36'>Ps. 37:35-36</a>",
      "comment": "Here, divine retribution is affirmed: God’s justice will prevail. The seemingly secure are actually on unstable ground, subject to God's judgment."
    },
    {
      "pk": 23073019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 19,
      "text": "How suddenly they are destroyed, swept away by terrors in an instant!",
      "links": "<a href='/AIV/19/35/8'>Ps. 35:8</a>",
      "comment": "God’s judgment often comes swiftly and unexpectedly. The image parallels Jesus’ warnings about the end times and God’s decisive action."
    },
    {
      "pk": 23073020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 20,
      "text": "Like a dream when one awakens, so, Lord, when you arise, you will despise their phantom form.",
      "links": "<a href='/AIV/19/90/5-6'>Ps. 90:5-6</a>",
      "comment": "The prosperity of the wicked is fleeting—a mere illusion compared to eternal realities. God’s judgment reveals the true state of every soul."
    },
    {
      "pk": 23073021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 21,
      "text": "When my heart was embittered and my spirit was wounded,",
      "links": "<a href='/AIV/19/32/3-4'>Ps. 32:3-4</a>",
      "comment": "Spiritual bitterness blinds us to the truth. Recognizing our woundedness opens the way for God’s healing grace, a recurring biblical theme."
    },
    {
      "pk": 23073022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 22,
      "text": "I was senseless and ignorant; I was like a brute beast before you.",
      "links": "<a href='/AIV/20/30/2'>Prov. 30:2</a>",
      "comment": "The psalmist repents of his ignorance, echoing biblical calls to humility before God. True wisdom means acknowledging our limitations."
    },
    {
      "pk": 23073023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 23,
      "text": "Yet I am always with you; you hold me by my right hand.",
      "links": "<a href='/AIV/19/16/8'>Ps. 16:8</a>; <a href='/AIV/23/41/13'>Isa. 41:13</a>",
      "comment": "Despite moments of doubt, God remains present. The image of being led by the hand parallels New Testament teachings on intimate fellowship with God."
    },
    {
      "pk": 23073024,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 24,
      "text": "You guide me with your counsel, and afterward you will receive me into glory.",
      "links": "<a href='/AIV/19/49/15'>Ps. 49:15</a>; <a href='/AIV/43/17/24'>John 17:24</a>",
      "comment": "This verse points towards the hope of eternal life, a resurrection faith that will develop more fully in later revelation and in Christ’s own promises of glory."
    },
    {
      "pk": 23073025,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 25,
      "text": "Whom have I in heaven but you? And on earth there is nothing I desire besides you.",
      "links": "<a href='/AIV/19/16/2'>Ps. 16:2</a>; <a href='/AIV/19/42/1-2'>Ps. 42:1-2</a>",
      "comment": "This is the heart’s longing for union with God. It anticipates the beatific vision—perfect fellowship with God—fulfilled in Christ and the communion of saints."
    },
    {
      "pk": 23073026,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 26,
      "text": "My flesh and my heart may fail, but God is the strength of my heart and my portion forever.",
      "links": "<a href='/AIV/19/16/5'>Ps. 16:5</a>; <a href='/AIV/47/4/16-18'>2 Cor. 4:16-18</a>",
      "comment": "Though bodily strength fades, the soul’s true sustenance is God Himself. This theme is picked up in the New Testament—our hope transcends this life."
    },
    {
      "pk": 23073027,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 27,
      "text": "Those who are far from you will perish; you destroy all who are unfaithful to you.",
      "links": "<a href='/AIV/19/37/38'>Ps. 37:38</a>",
      "comment": "Faithfulness to God has everlasting consequences. The language of judgment reminds us that God’s mercy is offered now, but justice will be assured."
    },
    {
      "pk": 23073028,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 73,
      "verse": 28,
      "text": "But for me it is good to be near God; I have made the Lord GOD my refuge, so I will tell of all your works.",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/19/71/15'>Ps. 71:15</a>",
      "comment": "The final verse returns to the central theme: nearness to God as the greatest good. It calls us to personal relationship and public witness, aligning personal faith with participation in the worshiping community."
    }
  ],
  "translatedAt": "2025-12-24T06:24:13.559Z"
}