{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 1,
  "verses": [
    {
      "pk": 1001001,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 1,
      "text": "Blessed is the man who does not walk in the counsel of the wicked, nor stand in the way of sinners, nor sit in the seat of mockers.",
      "links": "<a href='/AIV/20/4/14'>Prov. 4:14</a>; <a href='/AIV/19/26/4-5'>Ps. 26:4–5</a>",
      "comment": "The psalm opens by describing the truly happy person as one who avoids sinful influences. The original Hebrew uses a progression—walk, stand, sit—suggesting a deepening involvement with sin. This verse establishes a pattern of separating oneself from impurity (cf. 2 Cor. 6:17). The motif of blessedness echoes Christ’s teachings in the Beatitudes (<a href='/AIV/40/5/3'>Matt. 5:3</a>), pointing to spiritual happiness rooted in obedience."
    },
    {
      "pk": 1001002,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 2,
      "text": "But his delight is in the law of the LORD, and on his law he meditates day and night.",
      "links": "<a href='/AIV/19/119/97'>Ps. 119:97</a>; <a href='/AIV/6/1/8'>Josh. 1:8</a>",
      "comment": "Delighting in the law shows an interior love for God’s instruction, not mere external observance. Meditating ‘day and night’ points to constant devotion, similar to how prayer and reflection are encouraged in every age. The verse implies not just hearing, but inwardly digesting the Word—hinting at the need for divine grace to transform hearts. Christians later understood ‘the law’ as fulfilled perfectly in Christ (<a href='/AIV/40/5/17'>Matt. 5:17</a>)."
    },
    {
      "pk": 1001003,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 3,
      "text": "He is like a tree planted by streams of water, that yields its fruit in its season, and its leaf does not wither. In all that he does, he prospers.",
      "links": "<a href='/AIV/24/17/8'>Jer. 17:8</a>; <a href='/AIV/19/92/12-14'>Ps. 92:12–14</a>",
      "comment": "The image of a fruitful tree draws from wisdom literature; steady and nourished by God’s grace, such a person bears visible results. ‘Planted’—not wild—implies intentional setting through God’s action, a subtle pointer to divine providence acting through his people, and hints at the sacramental life’s ongoing nourishment (see <a href='/AIV/15/8/15'>Neh. 8:15</a>)."
    },
    {
      "pk": 1001004,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 4,
      "text": "The wicked are not so, but are like chaff that the wind drives away.",
      "links": "<a href='/AIV/18/21/18'>Job 21:18</a>; <a href='/AIV/29/2/5'>Joel 2:5</a>",
      "comment": "The fate of the wicked is a striking contrast—they lack permanence and substance, their lives scattered by external forces. This image is later used in judgment passages (<a href='/AIV/40/3/12'>Matt. 3:12</a>). The impermanence relates to a life disconnected from God, without roots or sustenance."
    },
    {
      "pk": 1001005,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 5,
      "text": "Therefore, the wicked will not stand in the judgment, nor sinners in the assembly of the righteous.",
      "links": "<a href='/AIV/19/5/5'>Ps. 5:5</a>; <a href='/AIV/40/25/32-33'>Matt. 25:32–33</a>",
      "comment": "The division between the righteous and the wicked recalls final judgment themes throughout Scripture. ‘Assembly’ evokes a gathered people, set apart for God—a phrase that later refers to Christ’s body of believers. Early Christian writers saw the ‘assembly of the righteous’ as the fully restored community united in worship and truth."
    },
    {
      "pk": 1001006,
      "translation": "AIV",
      "book": 19,
      "chapter": 1,
      "verse": 6,
      "text": "For the LORD knows the way of the righteous, but the way of the wicked will perish.",
      "links": "<a href='/AIV/15/7/9'>Ezra 7:9</a>; <a href='/AIV/40/7/13'>Matt. 7:13–14</a>",
      "comment": "To ‘know’ in the Hebrew sense implies God’s special care and loving attention, not just awareness. The two ways—life and destruction—present a clear moral choice, similar to Christ’s teaching on the narrow way (<a href='/AIV/40/7/13-14'>Matt. 7:13–14</a>). The righteous are preserved by God’s grace, hinting at an organic unity and security found in remaining faithful within the full life of God’s people."
    }
  ],
  "translatedAt": "2025-12-23T05:33:56.354Z"
}