{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 129,
  "verses": [
    {
      "pk": 23129001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 1,
      "text": "Many times they have afflicted me from my youth—let Israel now say—",
      "links": "<a href='/AIV/19/124/1'>Ps. 124:1</a>; <a href='/AIV/19/25/2'>Ps. 25:2</a>",
      "comment": "The psalmist invites the people as a whole to recount their suffering, stressing the importance of communal memory in worship. This anticipates how, throughout Salvation History, God's people are called to collectively remember both trials and deliverance. The phrase 'from my youth' often refers to the nation's early history (e.g., the Exodus)."
    },
    {
      "pk": 23129002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 2,
      "text": "Many times they have afflicted me from my youth, yet they have not prevailed against me.",
      "links": "<a href='/AIV/19/129/1'>Ps. 129:1</a>; <a href='/AIV/24/46/28'>Jer. 46:28</a>",
      "comment": "The repetition emphasizes Israel’s identity as a suffering yet unbroken people. The resilience of God's people foreshadows Christ, who suffered but was not defeated (see <a href='/AIV/23/53/7-12'>Isa. 53:7–12</a>). The victory is attributed to God's protecting hand."
    },
    {
      "pk": 23129003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 3,
      "text": "The plowers plowed upon my back; they made their furrows long.",
      "links": "<a href='/AIV/23/50/6'>Isa. 50:6</a>; <a href='/AIV/25/3/30'>Lam. 3:30</a>",
      "comment": "This agricultural metaphor vividly depicts deep suffering, likened to being scourged. In a spiritual sense, this points to Christ's own suffering (see <a href='/AIV/40/27/26'>Matt. 27:26</a>), and the afflictions that mark God's true people."
    },
    {
      "pk": 23129004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 4,
      "text": "The Lord is righteous; He has cut in pieces the cords of the wicked.",
      "links": "<a href='/AIV/19/125/3'>Ps. 125:3</a>; <a href='/AIV/19/116/16'>Ps. 116:16</a>",
      "comment": "God’s righteousness ensures both justice and liberation. The ‘cords’ here suggest bonds or oppression, possibly alluding to the chains of slavery broken at the Exodus. Spiritually, these are also the bonds of sin, which only God can break—an idea fulfilled in Christ’s redemptive work."
    },
    {
      "pk": 23129005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 5,
      "text": "Let all who hate Zion be put to shame and turned back.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/19/126/1'>Ps. 126:1</a>",
      "comment": "Zion becomes a symbol of God’s chosen dwelling and the unity of His people. To be an enemy of Zion is to stand against God’s covenant and His plan. In the new covenant, this takes on a deeper meaning—those who resist God’s true assembly will ultimately fail."
    },
    {
      "pk": 23129006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 6,
      "text": "Let them be like grass on the housetops, which withers before it grows up,",
      "links": "<a href='/AIV/19/37/2'>Ps. 37:2</a>; <a href='/AIV/23/40/7'>Isa. 40:7</a>",
      "comment": "The image of rooftop grass, which quickly withers, underscores the futility and short-lived nature of opposition against God’s people. The theme of impermanence calls to mind the fleeting quality of earthly rebellion versus the enduring promise to God’s faithful."
    },
    {
      "pk": 23129007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 7,
      "text": "with which the reaper does not fill his hand, nor the binder of sheaves his arms.",
      "links": "<a href='/AIV/18/8/17-19'>Job 8:17–19</a>",
      "comment": "The image shows that the efforts of the wicked result in emptiness—no lasting fruit. Their opposition does not endure, whereas those who remain in God’s covenant are fruitful (<a href='/AIV/19/1/3'>Ps. 1:3</a>)."
    },
    {
      "pk": 23129008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 129,
      "verse": 8,
      "text": "Nor do those who pass by say, 'The blessing of the Lord be upon you; we bless you in the name of the Lord.'",
      "links": "<a href='/AIV/08/2/4'>Ruth 2:4</a>; <a href='/AIV/19/118/26'>Ps. 118:26</a>",
      "comment": "Blessing was a common greeting and prayer among God’s people (see <a href='/AIV/04/6/24-26'>Num. 6:24–26</a>). Here, it is withheld from the wicked, indicating the importance of being part of God’s true assembly to receive authentic blessing. The unity and shared life of God’s people centers around receiving and sharing God’s blessing—both through spoken word and the life of the covenant community."
    }
  ],
  "translatedAt": "2025-12-24T06:43:58.902Z"
}