{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 10,
  "verses": [
    {
      "pk": 4010010,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 1,
      "text": "Why, O LORD, do You stand far off? Why do You hide Yourself in times of trouble?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>; <a href='/AIV/18/23/8-9'>Job 23:8-9</a>",
      "comment": "This honest lament expresses the feeling of God's absence in suffering. The psalmist's direct address demonstrates deep trust amidst doubt, a pattern echoed throughout salvation history."
    },
    {
      "pk": 4010011,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 2,
      "text": "In arrogance the wicked pursue the poor; let them be caught in the schemes they have devised.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15-16</a>; <a href='/AIV/19/9/15-16'>Ps. 9:15-16</a>",
      "comment": "The theme of retributive justice—EVIL returning upon the wicked—is common in the Psalms. This reflects confidence in divine justice even when it seems delayed (cf. Rom. 2:6)."
    },
    {
      "pk": 4010012,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 3,
      "text": "For the wicked boasts of the cravings of his soul; he blesses the covetous, whom the LORD abhors.",
      "links": "<a href='/AIV/19/49/6,18'>Ps. 49:6,18</a>; <a href='/AIV/20/28/4'>Prov. 28:4</a>",
      "comment": "The wicked's self-exaltation contrasts sharply with the humility God desires. See parallels in Luke 18:9-14 (the Pharisee and tax collector)."
    },
    {
      "pk": 4010013,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 4,
      "text": "In the pride of his face, the wicked does not seek Him; all his thoughts are, 'There is no God.'",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "This denial of God is seen not only in atheism but in practical neglect of His sovereignty. Cf. Rom. 1:21-23 for the spiritual consequences."
    },
    {
      "pk": 4010014,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 5,
      "text": "His ways are always prosperous; Your judgments are far above, out of his sight. As for all his foes, he snorts at them.",
      "links": "<a href='/AIV/19/92/7'>Ps. 92:7</a>; <a href='/AIV/35/1/13'>Hab. 1:13</a>",
      "comment": "The prosperity of the wicked challenges faith, yet the psalmist recognizes the ultimate transcendence of God's judgments (see Rom. 11:33)."
    },
    {
      "pk": 4010015,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 6,
      "text": "He says in his heart, 'I shall not be moved; throughout all generations I shall not meet adversity.'",
      "links": "<a href='/AIV/19/30/6'>Ps. 30:6</a>; <a href='/AIV/66/18/7'>Rev. 18:7</a>",
      "comment": "This arrogant self-confidence echoes the warnings against presumption found throughout scripture (cf. James 4:13-16)."
    },
    {
      "pk": 4010016,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 7,
      "text": "His mouth is filled with cursing, deceit, and oppression; under his tongue are mischief and iniquity.",
      "links": "<a href='/AIV/19/36/3'>Ps. 36:3</a>; <a href='/AIV/45/3/14'>Rom. 3:14</a>",
      "comment": "Paul later cites this verse (Rom. 3:14) in demonstrating the universality of sin. Here the psalmist depicts evil both in speech and action—a theme fulfilled in the call to purity of heart and lips (Matt. 12:34)."
    },
    {
      "pk": 4010017,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 8,
      "text": "He sits in ambush in the villages; in hidden places he murders the innocent. His eyes stealthily watch for the helpless.",
      "links": "<a href='/AIV/20/1/11'>Prov. 1:11</a>; <a href='/AIV/19/94/6'>Ps. 94:6</a>",
      "comment": "The imagery of secret plots against the innocent echoes God’s frequent concern for the vulnerable throughout both Testaments."
    },
    {
      "pk": 4010018,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 9,
      "text": "He lurks in secret like a lion in his hiding place; he lurks to seize the poor; he seizes the poor when he draws him into his net.",
      "links": "<a href='/AIV/19/17/12'>Ps. 17:12</a>; <a href='/AIV/19/35/7-8'>Ps. 35:7-8</a>",
      "comment": "The attack on the poor foreshadows later biblical teaching on divine concern for the lowly (cf. Luke 4:18, Jesus’ proclamation of good news to the poor)."
    },
    {
      "pk": 4010019,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 10,
      "text": "The helpless are crushed, sink down, and fall by his might.",
      "links": "<a href='/AIV/19/9/12'>Ps. 9:12</a>; <a href='/AIV/19/37/14'>Ps. 37:14</a>",
      "comment": "The victims of oppression are portrayed as utterly vulnerable, highlighting the need for a Redeemer. Spiritual readers see in this the suffering Messiah who identifies with the lowly."
    },
    {
      "pk": 4010020,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 11,
      "text": "He says in his heart, 'God has forgotten, He hides His face, He will never see.'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>; <a href='/AIV/19/73/11'>Ps. 73:11</a>",
      "comment": "The wicked assumes divine passivity. This doubt of God’s providence is answered throughout salvation history by God’s unexpected intervention."
    },
    {
      "pk": 4010021,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 12,
      "text": "Arise, O LORD; O God, lift up Your hand. Do not forget the afflicted.",
      "links": "<a href='/AIV/19/9/12'>Ps. 9:12</a>; <a href='/AIV/19/44/26'>Ps. 44:26</a>",
      "comment": "A plea for divine action echoes the hope for God’s direct intervention—fulfilled most profoundly in the Incarnation, when God entered our suffering."
    },
    {
      "pk": 4010022,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 13,
      "text": "Why does the wicked despise God, and say in his heart, 'You will not call to account'?",
      "links": "<a href='/AIV/19/73/11'>Ps. 73:11</a>; <a href='/AIV/19/50/21'>Ps. 50:21</a>",
      "comment": "The psalmist’s rhetorical question implies certainty that divine judgment is coming, affirming ultimate justice (see Acts 17:31 on God’s day of judgment)."
    },
    {
      "pk": 4010023,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 14,
      "text": "But You do see; for You note mischief and vexation, that You may take it into Your hands. To You the helpless commits himself; You are the helper of the orphan.",
      "links": "<a href='/AIV/19/22/24'>Ps. 22:24</a>; <a href='/AIV/66/7/17'>Rev. 7:17</a>",
      "comment": "God’s watchfulness and care for the orphan and helpless point toward the spiritual fatherhood of God’s people, later embodied in the ministry of Christ and His Apostles (cf. John 14:18)."
    },
    {
      "pk": 4010024,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 15,
      "text": "Break the arm of the wicked and evildoer; seek out his wickedness until You find none.",
      "links": "<a href='/AIV/19/37/17,38'>Ps. 37:17,38</a>",
      "comment": "The psalmist’s prayer for God to destroy evil is both literal and spiritual—fulfilled in Christ’s victory over sin and evil (cf. 1 John 3:8)."
    },
    {
      "pk": 4010025,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 16,
      "text": "The LORD is King forever and ever; the nations perish from His land.",
      "links": "<a href='/AIV/19/29/10'>Ps. 29:10</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "God’s eternal kingship affirms that no matter what earthly powers may do, the Lord reigns universally—a theme central to both Testaments (cf. Phil. 2:9-11)."
    },
    {
      "pk": 4010026,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 17,
      "text": "O LORD, You hear the desire of the afflicted; You will strengthen their heart; You will incline Your ear",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>; <a href='/AIV/19/145/19'>Ps. 145:19</a>",
      "comment": "This assurance of God’s special attention to the prayers of the humble forms the foundation for intercessory prayer—an enduring practice handed down in the apostolic Church (see James 5:14-16)."
    },
    {
      "pk": 4010027,
      "translation": "AIV",
      "book": 19,
      "chapter": 10,
      "verse": 18,
      "text": "to do justice for the orphan and the oppressed, so that man of the earth may strike terror no more.",
      "links": "<a href='/AIV/19/82/3'>Ps. 82:3</a>; <a href='/AIV/23/11/4'>Isa. 11:4</a>",
      "comment": "God’s commitment to justice especially for society’s outcasts is ultimately realized in the Messiah’s reign (cf. Isa. 11:4; Luke 4:18-21). The spiritual interpretation sees the Church commissioned as an agent of Christ’s mercy on earth."
    }
  ],
  "translatedAt": "2025-12-23T05:34:17.341Z"
}