{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 17,
  "verses": [
    {
      "pk": 42001701,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 1,
      "text": "Hear a just cause, O Lord; listen to my cry. Give ear to my prayer from lips without deceit.",
      "links": "<a href='/AIV/19/7/8'>Ps. 7:8</a>; <a href='/AIV/19/54/2'>Ps. 54:2</a>",
      "comment": "David pleads his innocence, approaching God as the righteous Judge. The language anticipates the sincere prayers of Christ, who spoke truth without deceit (see 1 Peter 2:22)."
    },
    {
      "pk": 42001702,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 2,
      "text": "Let my vindication come from your presence; let your eyes see what is right.",
      "links": "<a href='/AIV/19/26/1'>Ps. 26:1</a>; <a href='/AIV/19/35/23-24'>Ps. 35:23-24</a>",
      "comment": "David submits to God's judgment, confident that God alone sees into the heart. This foreshadows Christ trusting the Father's judgment entirely (1 Peter 2:23)."
    },
    {
      "pk": 42001703,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 3,
      "text": "You have tested my heart; you have visited me by night; you have tried me and found nothing. I have resolved that my mouth will not transgress.",
      "links": "<a href='/AIV/18/23/10'>Job 23:10</a>; <a href='/AIV/19/139/1'>Ps. 139:1</a>",
      "comment": "David claims purity, which points beyond himself to the only One who was truly without sin. Nighttime testing and inner purity invite a spiritual interpretation: God searches not only action, but intent. See Hebrews 4:13."
    },
    {
      "pk": 42001704,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 4,
      "text": "Concerning the works of men, by the word of your lips I have avoided the paths of the violent.",
      "links": "<a href='/AIV/19/119/9-11'>Ps. 119:9-11</a>",
      "comment": "Obedience to the word of God shields one from evil. The theme of keeping God's word prefigures Christ's perfect obedience (John 8:29)."
    },
    {
      "pk": 42001705,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 5,
      "text": "My steps have held fast to your paths; my feet have not slipped.",
      "links": "<a href='/AIV/19/18/36'>Ps. 18:36</a>",
      "comment": "Faithful walking recalls the biblical call to follow God's way. In Christian tradition, this speaks to persevering in the faith by grace, cooperating with God’s help."
    },
    {
      "pk": 42001706,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 6,
      "text": "I call upon you, for you will answer me, O God; incline your ear to me, hear my words.",
      "links": "<a href='/AIV/19/86/7'>Ps. 86:7</a>; <a href='/AIV/19/4/3'>Ps. 4:3</a>",
      "comment": "Expresses trust in prayer and God's faithfulness. God heard Christ’s prayers (John 11:41-42), and hears ours when united to Him (John 14:13)."
    },
    {
      "pk": 42001707,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 7,
      "text": "Show your wondrous steadfast love, O Savior of those who seek refuge at your right hand from their enemies.",
      "links": "<a href='/AIV/19/31/21'>Ps. 31:21</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>",
      "comment": "Steadfast love (‘hesed’) is a key term for God’s covenant faithfulness. Salvation through God's right hand prefigures Christ, who saves us (Luke 1:69)."
    },
    {
      "pk": 42001708,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 8,
      "text": "Keep me as the apple of your eye; hide me in the shadow of your wings.",
      "links": "<a href='/AIV/19/91/4'>Ps. 91:4</a>; <a href='/AIV/05/32/10'>Deut. 32:10</a>",
      "comment": "Being the 'apple of your eye' and ‘under your wings’ reflect God’s personal care and protection. These phrases are later echoed by Christ regarding Jerusalem (Luke 13:34)."
    },
    {
      "pk": 42001709,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 9,
      "text": "From the wicked who oppress me, my deadly enemies who surround me.",
      "links": "<a href='/AIV/19/22/12-13'>Ps. 22:12-13</a>",
      "comment": "Enemies threaten, as later happens to Christ. Spiritual reading sees this as the soul surrounded by opposition but preserved by God's grace."
    },
    {
      "pk": 42001710,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 10,
      "text": "They close their hearts to pity; with their mouths they speak arrogantly.",
      "links": "<a href='/AIV/19/73/8'>Ps. 73:8</a>; <a href='/AIV/20/6/17'>Prov. 6:17</a>",
      "comment": "The wicked's lack of mercy and prideful speech contrast God's mercy. The New Testament calls believers to humility and charity (James 4:6)."
    },
    {
      "pk": 42001711,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 11,
      "text": "They have now surrounded our steps; they set their eyes to throw us to the ground.",
      "links": "<a href='/AIV/19/3/6'>Ps. 3:6</a>",
      "comment": "A scene of being hunted, reminiscent of Christ's passion and the Church’s later persecutions; yet, perseverance is promised to those who remain steadfast."
    },
    {
      "pk": 42001712,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 12,
      "text": "He is like a lion eager to tear, like a young lion lurking in secret places.",
      "links": "<a href='/AIV/19/10/9'>Ps. 10:9</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "The enemy depicted as a lion links with the devil portrayed as a roaring lion in the New Testament (1 Peter 5:8). The threat is both physical and spiritual."
    },
    {
      "pk": 42001713,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 13,
      "text": "Arise, O Lord! Confront him, bring him down. Deliver my soul from the wicked by your sword.",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/35/1'>Ps. 35:1</a>",
      "comment": "The psalmist trusts in God’s intervention. God's sword is His power and Word (Hebrews 4:12), echoing how Christ defeats evil."
    },
    {
      "pk": 42001714,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 14,
      "text": "From men, by your hand, O Lord, from men of the world whose portion is in this life. You fill their bellies with treasure; they are satisfied with children and leave their abundance to their infants.",
      "links": "<a href='/AIV/19/49/17'>Ps. 49:17</a>; <a href='/AIV/19/73/12'>Ps. 73:12</a>",
      "comment": "The psalm contrasts those who hope in earthly things with those who await a greater promise. This spiritualizes the Old Testament view of blessing into longing for eternal life (see Luke 12:21)."
    },
    {
      "pk": 42001715,
      "translation": "AIV",
      "book": 19,
      "chapter": 17,
      "verse": 15,
      "text": "As for me, I shall behold your face in righteousness; when I awake, I will be satisfied with your likeness.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/54/3/2'>1 John 3:2</a>",
      "comment": "David expresses hope in seeing God, even after death—a strong hint of resurrection and the beatific vision. Interpreted as ultimate fulfillment in Christ, who opens the way for us to see God face to face (Matthew 5:8; Revelation 22:4)."
    }
  ],
  "translatedAt": "2025-12-23T05:35:51.708Z"
}