{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 101,
  "verses": [
    {
      "pk": 23101001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 1,
      "text": "I will sing of mercy and justice; to you, LORD, I will make music.",
      "links": "<a href='/AIV/19/89/1'>Ps. 89:1</a>; <a href='/AIV/19/92/1'>Ps. 92:1</a>; <a href='/AIV/19/106/1'>Ps. 106:1</a>",
      "comment": "This opening verse combines two key divine attributes: mercy and justice. The psalmist commits his song to the LORD, highlighting worship as the proper response to God’s character. Note: 'To you, LORD,' reflects the direct address and devotion, paralleling other psalms of praise."
    },
    {
      "pk": 23101002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 2,
      "text": "I will ponder the path that is blameless. When will you come to me? I will walk within my house with a heart of integrity.",
      "links": "<a href='/AIV/19/18/23'>Ps. 18:23</a>; <a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/19/119/1'>Ps. 119:1</a>",
      "comment": "The psalmist pledges personal holiness and integrity, both publicly and privately. 'When will you come to me?' expresses longing for God's presence, echoing the desire for communion with God. Living with integrity in the home has been interpreted as foundational to wider spiritual leadership, subtly endorsing commitment to order and discipline in personal and communal life."
    },
    {
      "pk": 23101003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 3,
      "text": "I will not set before my eyes anything worthless. I hate the deeds of those who turn aside; it shall not cling to me.",
      "links": "<a href='/AIV/19/24/4'>Ps. 24:4</a>; <a href='/AIV/19/119/37'>Ps. 119:37</a>; <a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "This verse emphasizes vigilance against sin and moral corruption. Avoiding anything 'worthless' suggests a call to purity of mind and action. The psalmist's strong distancing from the deeds of the faithless hints at the importance of avoiding occasions of sin—a concept rooted in early Christian spiritual discipline."
    },
    {
      "pk": 23101004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 4,
      "text": "A twisted heart will depart from me; I will not know evil.",
      "links": "<a href='/AIV/19/73/27'>Ps. 73:27</a>; <a href='/AIV/19/141/4'>Ps. 141:4</a>; <a href='/AIV/19/26/4'>Ps. 26:4</a>",
      "comment": "The pursuit of virtue requires rejecting inner corruption ('twisted heart') and refusing association with evil. This echoes a call not only to outward righteousness but also to inward transformation, a central biblical theme deepened through the tradition of interior conversion."
    },
    {
      "pk": 23101005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 5,
      "text": "Whoever secretly slanders his neighbor, I will destroy; the arrogant in heart and eyes, I will not endure.",
      "links": "<a href='/AIV/19/15/3'>Ps. 15:3</a>; <a href='/AIV/19/101/7'>Ps. 101:7</a>; <a href='/AIV/20/16/5'>Prov. 16:5</a>",
      "comment": "Condemnation of slander and pride is direct; the psalmist's strict standard implies leadership rooted in justice and humility. This pattern of accountability corresponds to Jesus' teachings on the heart and speech (<a href='/AIV/40/12/36'>Matt. 12:36</a>), and the model of the holy assembly as a place where only the righteous dwell."
    },
    {
      "pk": 23101006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 6,
      "text": "My eyes will be on the faithful of the land, that they may dwell with me; those who walk in integrity are the ones who will minister to me.",
      "links": "<a href='/AIV/19/15/1-2'>Ps. 15:1-2</a>; <a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/19/101/2'>Ps. 101:2</a>",
      "comment": "Here, service is reserved for those who are upright—a standard for true spiritual leadership. The emphasis on integrity as a qualification for ministry subtly affirms the value of visible, consecrated servants set apart for holy purposes."
    },
    {
      "pk": 23101007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 7,
      "text": "No one who practices deceit shall dwell in my house; no one who utters lies shall stand before my eyes.",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/19/24/4'>Ps. 24:4</a>; <a href='/AIV/20/6/16-19'>Prov. 6:16-19</a>",
      "comment": "Moral purity is enforced for the community. The psalmist insists on excluding liars and deceivers from his home, echoing the biblical notion of the holy assembly and the Church as a gathering of truth and righteousness, foreshadowed in the New Testament vision of the pure community of believers."
    },
    {
      "pk": 23101008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 101,
      "verse": 8,
      "text": "Morning by morning I will destroy all the wicked of the land, cutting off from the LORD’s city all who practice evil.",
      "links": "<a href='/AIV/19/73/27'>Ps. 73:27</a>; <a href='/AIV/19/37/38'>Ps. 37:38</a>; <a href='/AIV/23/52/1'>Isa. 52:1</a>; <a href='/AIV/66/21/27'>Rev. 21:27</a>",
      "comment": "Daily vigilance against evil is stressed. The reference to the LORD's city points toward the biblical ideal of a holy people dwelling in the renewed Jerusalem, as fulfilled in Revelation (<a href='/AIV/66/21/27'>Rev. 21:27</a>). This foreshadows the ultimate gathering of the righteous, both literally and spiritually, under God’s eternal reign."
    }
  ],
  "translatedAt": "2025-12-24T06:34:14.319Z"
}