{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 26,
  "verses": [
    {
      "pk": 23026001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 1,
      "text": "Vindicate me, LORD, for I have walked with integrity; I have trusted in the LORD without wavering.",
      "links": "<a href='/AIV/19/7/8'>Ps. 7:8</a>; <a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/19/18/20-23'>Ps. 18:20-23</a>",
      "comment": "David asks God to judge him, confident in his own integrity and faithfulness. The language anticipates NT themes of justification by faith and emphasizes living a life pleasing to God as the path to vindication."
    },
    {
      "pk": 23026002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 2,
      "text": "Examine me, LORD, and test me; purify my heart and mind.",
      "links": "<a href='/AIV/19/17/3'>Ps. 17:3</a>; <a href='/AIV/19/139/23'>Ps. 139:23</a>; <a href='/AIV/20/17/3'>Prov. 17:3</a>",
      "comment": "David invites God to scrutinize his innermost being. This openness to divine testing reflects a sacramental understanding of continual sanctification. Spiritual growth involves both external actions and inward transformation of heart and mind."
    },
    {
      "pk": 23026003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 3,
      "text": "For your steadfast love is before my eyes, and I walk in your faithfulness.",
      "links": "<a href='/AIV/19/25/10'>Ps. 25:10</a>; <a href='/AIV/19/89/14'>Ps. 89:14</a>",
      "comment": "God’s steadfast love (Hebrew 'chesed') is a covenantal term. Walking in faithfulness signifies both trusting and responding to God’s mercy, a theme fulfilled fully in Christ’s redemptive love and sacrificial obedience."
    },
    {
      "pk": 23026004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 4,
      "text": "I do not sit with deceitful men, nor do I associate with hypocrites.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/19/24/4'>Ps. 24:4</a>",
      "comment": "David’s resolve echoes Psalm 1’s emphasis on moral separation and purity. It reflects the call to holiness for believers: to be set apart from the influence of unrighteousness, while maintaining compassion for all."
    },
    {
      "pk": 23026005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 5,
      "text": "I hate the assembly of evildoers, and I will not sit with the wicked.",
      "links": "<a href='/AIV/19/31/6'>Ps. 31:6</a>; <a href='/AIV/19/94/16'>Ps. 94:16</a>",
      "comment": "David expresses strong aversion to participation in the council of the wicked. The concept of assembly also foreshadows the importance of gathering with the righteous in worship as a means of spiritual growth."
    },
    {
      "pk": 23026006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 6,
      "text": "I wash my hands in innocence and go around your altar, LORD,",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/3/8/6'>Lev. 8:6</a>",
      "comment": "Washing hands symbolizes ritual purity—a significant act in Hebrew worship. Approaching God’s altar implies participation in sacred rites, with spiritual echoes of entering God’s presence through grace and purification."
    },
    {
      "pk": 23026007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 7,
      "text": "Proclaiming aloud thanksgiving, and telling of all your wondrous works.",
      "links": "<a href='/AIV/19/9/1'>Ps. 9:1</a>; <a href='/AIV/19/107/22'>Ps. 107:22</a>",
      "comment": "Public worship and thanksgiving are essential aspects of a believer’s life, reminiscent of NT exhortations to confess faith and gather for communal praise, reflecting continuity in liturgical practice."
    },
    {
      "pk": 23026008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 8,
      "text": "LORD, I love the habitation of your house, and the place where your glory dwells.",
      "links": "<a href='/AIV/19/84/1-2'>Ps. 84:1-2</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "Deep longing for God’s house points to the importance of sacred spaces and worship. Scripturally, this relates to the Temple, but also finds fulfillment in the Church assembled, where God's presence is manifest among His people."
    },
    {
      "pk": 23026009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 9,
      "text": "Do not take away my soul with sinners, nor my life with murderers,",
      "links": "<a href='/AIV/19/28/3'>Ps. 28:3</a>; <a href='/AIV/19/1/5'>Ps. 1:5</a>",
      "comment": "David prays for distinction from those who reject God, suggesting both earthly consequences and eschatological separation—an idea later developed in NT teaching on judgment and perseverance in grace."
    },
    {
      "pk": 23026010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 10,
      "text": "In whose hands are evil devices, and whose right hands are full of bribes.",
      "links": "<a href='/AIV/19/15/5'>Ps. 15:5</a>; <a href='/AIV/20/17/23'>Prov. 17:23</a>",
      "comment": "The contrast is drawn between honesty and corruption. Christian life calls for many to resist temptation of moral compromise, a principle affirmed throughout Scripture and embodied perfectly in Jesus."
    },
    {
      "pk": 23026011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 11,
      "text": "But as for me, I walk in my integrity; redeem me and be gracious to me.",
      "links": "<a href='/AIV/19/25/21-22'>Ps. 25:21-22</a>; <a href='/AIV/19/103/4'>Ps. 103:4</a>",
      "comment": "‘Redeem’ points to salvation that comes not merely from merit, but grace, anticipating the Messiah’s work. Integrity and humility before God remain key virtues marking the true disciple’s path."
    },
    {
      "pk": 23026012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 26,
      "verse": 12,
      "text": "My foot stands on level ground; in the congregations I will bless the LORD.",
      "links": "<a href='/AIV/19/27/11'>Ps. 27:11</a>; <a href='/AIV/19/22/22'>Ps. 22:22</a>",
      "comment": "Standing on level ground signifies security and assurance from God. Blessing God in the congregation points to both unity and public worship—a recurring theme throughout the Bible, culminating in the NT assembly of saints united in Christ."
    }
  ],
  "translatedAt": "2025-12-24T06:07:07.155Z"
}