{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 138,
  "verses": [
    {
      "pk": 1932230,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 1,
      "text": "I will praise you with all my heart; before the gods I will sing your praise.",
      "links": "<a href='/AIV/19/95/3'>Ps. 95:3</a>; <a href='/AIV/19/100/1'>Ps. 100:1</a>",
      "comment": "The psalmist’s wholehearted praise sets the tone, addressing the Lord even in the presence of rival powers or authorities ('gods'). The word 'gods' may refer to false idols or spiritual beings. This verse anticipates Christ’s teaching to worship God alone (Matt. 4:10), and contains a suggestion that worship is properly ordered and communal, reflecting the unity of God’s people."
    },
    {
      "pk": 1932231,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 2,
      "text": "I bow down toward your holy temple and give thanks to your name for your steadfast love and your faithfulness, for you have exalted your word and your name above all things.",
      "links": "<a href='/AIV/11/8/29'>1 Kings 8:29</a>; <a href='/AIV/19/5/7'>Ps. 5:7</a>",
      "comment": "The physical act of worship points to reverence in God’s designated place. The temple points forward to Christ, who called Himself the true temple (John 2:19–21). 'Steadfast love' (Hebrew: hesed) and 'faithfulness' reflect God’s covenant character, fulfilled in Jesus."
    },
    {
      "pk": 1932232,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 3,
      "text": "On the day I called, you answered me; you made me bold and strengthened my soul.",
      "links": "<a href='/AIV/19/86/7'>Ps. 86:7</a>; <a href='/AIV/19/27/14'>Ps. 27:14</a>",
      "comment": "God’s response to prayer is immediate and personal, granting courage and spiritual endurance. This reflects both literal deliverance and a deeper spiritual strengthening, echoing Jesus’s invitation to ask and receive (Matt. 7:7)."
    },
    {
      "pk": 1932233,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 4,
      "text": "All the kings of the earth shall give thanks to you, O LORD, for they have heard the words of your mouth.",
      "links": "<a href='/AIV/19/102/15'>Ps. 102:15</a>; <a href='/AIV/19/72/11'>Ps. 72:11</a>",
      "comment": "Prophetic anticipation of the nations and their rulers coming to acknowledge the Lord, pointing to the global calling of all people to praise God (see Phil. 2:10–11). This has both messianic and eschatological overtones and foreshadows the unity of all believers."
    },
    {
      "pk": 1932234,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 5,
      "text": "They shall sing of the ways of the LORD, for great is the glory of the LORD.",
      "links": "<a href='/AIV/19/145/10'>Ps. 145:10–12</a>",
      "comment": "Worship of God’s glory unites people in song and proclamation, a foreshadowing of the worship conducted by God’s people together. These themes mirror heavenly worship as revealed in Rev. 15:3–4, inviting all to join in praise."
    },
    {
      "pk": 1932235,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 6,
      "text": "Though the LORD is exalted, he regards the lowly, but the proud he knows from afar.",
      "links": "<a href='/AIV/19/113/5-6'>Ps. 113:5–6</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "God’s transcendence is matched by His nearness to the humble, echoing Christ’s teaching (Matt. 5:3–5) and God’s preference for humility throughout Scripture. This verse signifies a spiritual hierarchy where humility is central for drawing close to God."
    },
    {
      "pk": 1932236,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 7,
      "text": "Though I walk in the midst of trouble, you preserve my life; you stretch out your hand against the anger of my enemies, and your right hand saves me.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/19/140/7'>Ps. 140:7</a>",
      "comment": "Divine protection in adversity reflects God’s saving power at work. 'Right hand' represents power and authority, often attributed to Christ (Isa. 41:10; Acts 7:56). The verse carries both a promise of physical deliverance and a deeper spiritual security in God."
    },
    {
      "pk": 1932237,
      "translation": "AIV",
      "book": 19,
      "chapter": 138,
      "verse": 8,
      "text": "The LORD will fulfill his purpose for me; your steadfast love endures forever. Do not forsake the work of your hands.",
      "links": "<a href='/AIV/19/57/2'>Ps. 57:2</a>; <a href='/AIV/50/1/6'>Phil. 1:6</a>",
      "comment": "Confidence that God’s purposes are not thwarted speaks to the believer’s assurance and hope in God’s ongoing work (see Phil. 1:6). The enduring nature of divine love points to the permanence of God’s covenant and faithfulness, which is ultimately fulfilled in Christ."
    }
  ],
  "translatedAt": "2025-12-23T05:49:46.007Z"
}