{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 123,
  "verses": [
    {
      "pk": 23123001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 123,
      "verse": 1,
      "text": "To you I lift up my eyes, O you who sit enthroned in heaven.",
      "links": "<a href='/AIV/19/121/1'>Ps. 121:1</a>; <a href='/AIV/19/11/4'>Ps. 11:4</a>",
      "comment": "The psalmist's focus is upward, recognizing the sovereign Lord seated above all things. This expresses humility and dependence, key virtues in the life of faith. There is a spiritual meaning here—the act of looking up signifies the soul's ascent to God, a theme echoed throughout the spiritual writings of the Church Fathers. Christologically, lifting one's eyes to heaven foreshadows how believers must look to Christ, who is now enthroned at the right hand of the Father (see <a href='/AIV/58/12/2'>Heb. 12:2</a>)."
    },
    {
      "pk": 23123002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 123,
      "verse": 2,
      "text": "Just as the eyes of servants look to the hand of their master, and the eyes of a maid to the hand of her mistress, so our eyes look to the Lord our God, until he shows us mercy.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>; <a href='/AIV/19/130/6'>Ps. 130:6</a>",
      "comment": "This verse uses vivid imagery of servants watching for signs from their master, reflecting complete trust and expectancy. The spiritual interpretation points to the virtue of perseverance in prayer, waiting for God's grace. The reference to 'mercy' resonates with the New Testament's emphasis on grace and the need to remain close to the Lord, awaiting his compassionate response, just as one remains close to the visible Church Christ founded."
    },
    {
      "pk": 23123003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 123,
      "verse": 3,
      "text": "Have mercy on us, O Lord, have mercy! For we have endured much contempt.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/19/51/1'>Ps. 51:1</a>",
      "comment": "The repetition 'have mercy' highlights the urgency and depth of the psalmist's request. This echoes the 'Kyrie Eleison' tradition found throughout Christian worship. Enduring contempt links to the sufferings of Christ and his followers (see <a href='/AIV/40/5/11-12'>Matt. 5:11-12</a>), pointing to the spiritual value of patience under trial—a theme that connects to the idea of patient endurance within the communion of saints and the tradition of intercessory prayer."
    },
    {
      "pk": 23123004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 123,
      "verse": 4,
      "text": "Our soul has had more than enough of the scorn of those who are at ease, of the contempt of the proud.",
      "links": "<a href='/AIV/19/73/3-12'>Ps. 73:3-12</a>; <a href='/AIV/19/119/51'>Ps. 119:51</a>",
      "comment": "Here, the psalmist expresses exhaustion from the mockery and arrogance of the prosperous and proud. This is a reminder that God calls his people to humility and dependence on Him, not the fleeting comforts of self-sufficiency. Theologically, this verse can be read as a call to deep unity among believers, persevering together in adversity and not isolating oneself—an idea central to apostolic teaching and the historical church's focus on visible unity."
    }
  ],
  "translatedAt": "2025-12-24T06:42:44.905Z"
}