{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 130,
  "verses": [
    {
      "pk": 1932810,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 1,
      "text": "Out of the depths I cry to you, O LORD!",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>; <a href='/AIV/14/20/12'>2 Chr. 20:12</a>",
      "comment": "The psalmist cries from the depths of distress, a theme repeated elsewhere in the Psalms (see Ps. 69:2). This portrays a soul reaching out to God in humility and total dependence."
    },
    {
      "pk": 1932811,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 2,
      "text": "Lord, hear my voice! Let your ears be attentive to the voice of my pleas for mercy!",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/19/143/1'>Ps. 143:1</a>",
      "comment": "This verse stresses a plea for mercy—essential for all who seek forgiveness. Notice how the psalmist relies on God's attentiveness, reflecting trust in a personal, responsive Lord."
    },
    {
      "pk": 1932812,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 3,
      "text": "If you, LORD, kept a record of sins, Lord, who could stand?",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "This verse affirms human inability to stand before God without His mercy, echoed in Paul's teaching that all have sinned (Rom. 3:23). The Lord here is both just and merciful."
    },
    {
      "pk": 1932813,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 4,
      "text": "But with you there is forgiveness, that you may be feared.",
      "links": "<a href='/AIV/19/86/5'>Ps. 86:5</a>; <a href='/AIV/62/2/12'>1 Jn. 2:12</a>",
      "comment": "Forgiveness leads not only to relief but to reverence. The fear of the Lord is a theme that unites humility, wisdom, and true worship (Prov. 9:10). Christ Himself, in granting forgiveness, calls sinners to repentance and awe."
    },
    {
      "pk": 1932814,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 5,
      "text": "I wait for the LORD, my soul waits, and in his word I put my hope.",
      "links": "<a href='/AIV/19/119/81'>Ps. 119:81</a>; <a href='/AIV/23/40/31'>Isa. 40:31</a>",
      "comment": "Patient waiting upon the Lord is a hallmark of faith. Hoping in God's word points to a confidence in His promises, fulfilled ultimately in Jesus Christ (see 2 Cor. 1:20)."
    },
    {
      "pk": 1932815,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 6,
      "text": "My soul waits for the Lord more than watchmen for the morning, more than watchmen for the morning.",
      "links": "<a href='/AIV/19/63/6'>Ps. 63:6</a>; <a href='/AIV/42/12/37'>Lk. 12:37</a>",
      "comment": "The repetition underscores deep longing and expectancy for God’s deliverance, much like those eagerly awaiting the dawn after a long night. There is an implied spiritual discipline of vigilant prayer and trust."
    },
    {
      "pk": 1932816,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 7,
      "text": "O Israel, hope in the LORD! For with the LORD there is steadfast love, and plentiful redemption.",
      "links": "<a href='/AIV/19/131/3'>Ps. 131:3</a>; <a href='/AIV/45/3/24'>Rom. 3:24</a>",
      "comment": "The psalmist calls the community to hope in God's faithful love and abundant redemption. This anticipates New Testament language about God's saving grace and the need for unity under His steadfast love."
    },
    {
      "pk": 1932817,
      "translation": "AIV",
      "book": 19,
      "chapter": 130,
      "verse": 8,
      "text": "And he will redeem Israel from all his sins.",
      "links": "<a href='/AIV/19/25/22'>Ps. 25:22</a>; <a href='/AIV/40/1/21'>Matt. 1:21</a>",
      "comment": "This final verse points to the fullness of redemption—freedom from all sin—which would find its perfect fulfillment in the Messiah (see Matt. 1:21). Redemption here is communal and individual, reflecting both forgiveness and restoration for all God’s people."
    }
  ],
  "translatedAt": "2025-12-23T05:47:35.383Z"
}