{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 21,
  "verses": [
    {
      "pk": 2102101,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 1,
      "text": "O LORD, the king rejoices in Your strength; how greatly he exults in Your salvation!",
      "links": "<a href='/AIV/10/8/14'>2 Sam. 8:14</a>; <a href='/AIV/19/20/5'>Ps. 20:5</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "The psalmist celebrates God's deliverance of the king. The word 'salvation' (Hebrew: 'yeshuah') is used here, with possible messianic overtones, as Christian tradition often reads this verse as pointing forward to Christ's victory (see Ps. 2:2)."
    },
    {
      "pk": 2102102,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 2,
      "text": "You have given him his heart’s desire and have not withheld the request of his lips. Selah.",
      "links": "<a href='/AIV/19/20/4'>Ps. 20:4</a>; <a href='/AIV/19/37/4'>Ps. 37:4</a>",
      "comment": "This verse connects directly with Psalm 20:4; note the divine granting of requests is reminiscent of intercessory prayer and the value of persistent supplication."
    },
    {
      "pk": 2102103,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 3,
      "text": "For You meet him with rich blessings; You set a crown of pure gold upon his head.",
      "links": "<a href='/AIV/19/132/18'>Ps. 132:18</a>; <a href='/AIV/19/103/4'>Ps. 103:4</a>; <a href='/AIV/10/12/30'>2 Sam. 12:30</a>",
      "comment": "The crowning scene evokes messianic imagery; the pure gold crown points forward typologically to Christ the King, foreshadowed in David. This royal motif is echoed in Rev. 19:12."
    },
    {
      "pk": 2102104,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 4,
      "text": "He asked life from You, and You gave it to him—length of days forever and ever.",
      "links": "<a href='/AIV/19/61/6'>Ps. 61:6</a>; <a href='/AIV/12/2/11'>2 Kings 2:11</a>",
      "comment": "The phrase 'forever and ever' (Hebrew: 'olam va'ed') goes beyond earthly kingship and prophetically anticipates the resurrection and eternal reign attributed to the Messiah (cf. Luke 1:33)."
    },
    {
      "pk": 2102105,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 5,
      "text": "His glory is great through Your salvation; You bestow splendor and majesty upon him.",
      "links": "<a href='/AIV/19/8/5'>Ps. 8:5</a>; <a href='/AIV/19/45/3'>Ps. 45:3</a>",
      "comment": "Language of splendor and majesty closely matches the Old Testament’s high view of Davidic kingship, ultimately fulfilled in Christ’s glorification—see Philippians 2:9-11."
    },
    {
      "pk": 2102106,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 6,
      "text": "For You make him most blessed forever; You make him glad with the joy of Your presence.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/19/89/15-17'>Ps. 89:15-17</a>",
      "comment": "The joy of God’s presence prefigures the beatific vision promised in Catholic theology and ultimately realized in the heavenly kingdom (cf. Rev. 21:3-4)."
    },
    {
      "pk": 2102107,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 7,
      "text": "For the king trusts in the LORD, and through the steadfast love of the Most High he shall not be moved.",
      "links": "<a href='/AIV/19/16/8'>Ps. 16:8</a>; <a href='/AIV/19/62/6'>Ps. 62:6</a>",
      "comment": "Trust in God’s 'steadfast love' (Hebrew: 'hesed') is a theme closely tied to the biblical covenants, and especially God’s faithfulness to the house of David."
    },
    {
      "pk": 2102108,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 8,
      "text": "Your hand will find out all Your enemies; Your right hand will seize those who hate You.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/19/110/5-6'>Ps. 110:5-6</a>",
      "comment": "The imagery of God’s 'right hand' is often associated with mighty acts of deliverance, echoing Exodus 15:6 and prefiguring Christ’s position at the Father’s right hand (Acts 2:33)."
    },
    {
      "pk": 2102109,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 9,
      "text": "You will make them like a blazing oven when You appear. The LORD will swallow them up in His wrath, and fire will devour them.",
      "links": "<a href='/AIV/19/18/8'>Ps. 18:8</a>; <a href='/AIV/19/37/20'>Ps. 37:20</a>; <a href='/AIV/19/97/3'>Ps. 97:3</a>",
      "comment": "References to fire and judgment connect with themes of divine justice and eschatological reckoning, inviting meditation on the reality of final judgment (cf. Malachi 4:1; 2 Thess. 1:7-8)."
    },
    {
      "pk": 2102110,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 10,
      "text": "You will destroy their offspring from the earth, and their descendants from among the children of man.",
      "links": "<a href='/AIV/19/37/28'>Ps. 37:28</a>; <a href='/AIV/19/109/13'>Ps. 109:13</a>",
      "comment": "Eradication of enemies’ descendants underscores God’s total victory—a foreshadowing of the triumph of Christ’s kingdom in the world."
    },
    {
      "pk": 2102111,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 11,
      "text": "Though they plot evil against You and devise wicked schemes, they will not succeed.",
      "links": "<a href='/AIV/19/2/1'>Ps. 2:1</a>; <a href='/AIV/19/64/6'>Ps. 64:6</a>",
      "comment": "The futility of scheming against God recalls the plotting of the nations against Christ in Psalm 2, fulfilled by the opposition to Jesus (Acts 4:25-28)."
    },
    {
      "pk": 2102112,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 12,
      "text": "For You will put them to flight; You will aim at their faces with Your bow.",
      "links": "<a href='/AIV/19/7/13'>Ps. 7:13</a>; <a href='/AIV/02/15/6'>Ex. 15:6</a>",
      "comment": "The divine warrior imagery echoes other Old Testament texts and is spiritually understood as Christ conquering evil through the Paschal Mystery—His death and resurrection."
    },
    {
      "pk": 2102113,
      "translation": "AIV",
      "book": 19,
      "chapter": 21,
      "verse": 13,
      "text": "Be exalted, O LORD, in Your strength! We will sing and praise Your power.",
      "links": "<a href='/AIV/19/18/46'>Ps. 18:46</a>; <a href='/AIV/19/57/5'>Ps. 57:5</a>",
      "comment": "The psalm closes with praise to God, a liturgical action still central today. Catholic tradition, echoing Early Church practice, sees this as anticipating the eternal heavenly liturgy (Rev. 5:13)—where Christ is eternally exalted and worshipped by the Church."
    }
  ],
  "translatedAt": "2025-12-22T21:26:49.775Z"
}