{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 146,
  "verses": [
    {
      "pk": 1946146,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 1,
      "text": "Praise the LORD! Let my soul praise the LORD!",
      "links": "<a href='/AIV/19/103/1'>Ps. 103:1</a>; <a href='/AIV/19/147/1'>Ps. 147:1</a>",
      "comment": "The psalm opens with a double call to praise, echoing the personal devotion seen throughout the Psalms. The repetition emphasizes wholehearted worship, inviting believers to continuous prayer and praise, reminiscent of the biblical command to pray unceasingly (<a href='/AIV/52/5/16-18'>1 Thess. 5:16–18</a>)."
    },
    {
      "pk": 1946147,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 2,
      "text": "I will praise the LORD as long as I live; I will sing praises to my God while I have being.",
      "links": "<a href='/AIV/19/104/33'>Ps. 104:33</a>; <a href='/AIV/19/34/1'>Ps. 34:1</a>",
      "comment": "Here, the psalmist vows lifelong worship. This reflects the biblical ideal of persistent fidelity to God, akin to Christian perseverance. The declaration of singing to 'my God' points to a personal relationship but also an ongoing participation in corporate worship, a significant aspect of Christian spirituality."
    },
    {
      "pk": 1946148,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 3,
      "text": "Do not put your trust in princes, nor in a son of man, in whom there is no salvation.",
      "links": "<a href='/AIV/19/118/8-9'>Ps. 118:8–9</a>; <a href='/AIV/23/2/22'>Isa. 2:22</a>",
      "comment": "The psalm warns against reliance on earthly rulers or human strength. The phrase 'son of man' is used generically here, contrasting with the messianic use in Daniel and the Gospels (<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/40/16/13'>Matt. 16:13</a>). Salvation comes only from the LORD, hinting at the greater Son of Man, Jesus Christ, who alone brings true salvation."
    },
    {
      "pk": 1946149,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 4,
      "text": "When his breath departs, he returns to the earth; on that very day his plans perish.",
      "links": "<a href='/AIV/1/3/19'>Gen. 3:19</a>; <a href='/AIV/21/12/7'>Eccl. 12:7</a>",
      "comment": "This verse recognizes human mortality and the futility of merely human plans. It draws from Genesis and Ecclesiastes, underscoring the need for hope in divine promises beyond earthly life—a hope realized in Christ’s resurrection (<a href='/AIV/46/15/22'>1 Cor. 15:22</a>)."
    },
    {
      "pk": 1946150,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 5,
      "text": "Blessed is he whose help is the God of Jacob, whose hope is in the LORD his God,",
      "links": "<a href='/AIV/19/84/12'>Ps. 84:12</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "True blessedness flows from relying on God rather than worldly power. The reference to 'God of Jacob' ties believers into the history of God's covenant people. This notion of hope in God's faithfulness prepares the heart for trust in the promises fulfilled in the New Covenant through Jesus."
    },
    {
      "pk": 1946151,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 6,
      "text": "who made heaven and earth, the sea, and all that is in them; who keeps faith forever;",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/19/104/24-25'>Ps. 104:24–25</a>",
      "comment": "God’s identity as Creator grounds our trust in Him. The phrase 'keeps faith forever' expresses His unwavering fidelity, laying a foundation for belief in divine providence and the trustworthiness of God's covenant throughout salvation history. This faithfulness is echoed in God’s unchanging commitment to care for His people."
    },
    {
      "pk": 1946152,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 7,
      "text": "who executes justice for the oppressed, who gives food to the hungry. The LORD sets the prisoners free;",
      "links": "<a href='/AIV/19/103/6'>Ps. 103:6</a>; <a href='/AIV/40/11/5'>Matt. 11:5</a>",
      "comment": "God’s care for the marginalized reflects His justice and compassion. The liberation, feeding, and freeing of the oppressed finds fulfillment in Christ’s ministry, which manifests God’s love in both spiritual and practical acts (<a href='/AIV/42/4/18'>Luke 4:18</a>). This has been an enduring call for Christian action throughout history."
    },
    {
      "pk": 1946153,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 8,
      "text": "The LORD opens the eyes of the blind; the LORD lifts up those who are bowed down; the LORD loves the righteous.",
      "links": "<a href='/AIV/23/35/5'>Isa. 35:5</a>; <a href='/AIV/40/9/27-30'>Matt. 9:27–30</a>",
      "comment": "Miraculous healing is described here, foreshadowing Jesus' works in the Gospels (<a href='/AIV/43/9/1-7'>John 9:1–7</a>). This verse has a spiritual dimension, referring not just to physical healing but the restoration of souls. God’s particular love for the righteous connects ongoing sanctification with living out faith in practice."
    },
    {
      "pk": 1946154,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 9,
      "text": "The LORD protects the strangers; He upholds the orphan and the widow, but the way of the wicked He turns to ruin.",
      "links": "<a href='/AIV/5/10/18'>Deut. 10:18</a>; <a href='/AIV/19/68/5'>Ps. 68:5</a>",
      "comment": "God’s concern for the vulnerable (the foreigner, orphan, widow) is reflected throughout Scripture. This reiterates the Christian duty to charity and mercy, elements deeply embedded in traditional Christian practice. The final contrast of the wicked’s fate reinforces divine justice’s ultimate victory."
    },
    {
      "pk": 1946155,
      "translation": "AIV",
      "book": 19,
      "chapter": 146,
      "verse": 10,
      "text": "The LORD will reign forever, your God, O Zion, to all generations. Praise the LORD!",
      "links": "<a href='/AIV/19/10/16'>Ps. 10:16</a>; <a href='/AIV/19/125/1'>Ps. 125:1</a>",
      "comment": "The psalm closes with the affirmation of the LORD’s eternal kingship. 'Zion' points to the community of God’s people, and intergenerational praise anticipates the enduring worship promised in the New Covenant, following the great tradition of gathered worship. The perpetual reign signifies God’s kingdom fulfilled and made manifest in Christ (<a href='/AIV/42/1/33'>Luke 1:33</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:51:47.670Z"
}