{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 8,
  "verses": [
    {
      "pk": 1908001,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 1,
      "text": "O LORD, our Lord, how majestic is your name in all the earth! You have set your glory above the heavens.",
      "links": "<a href='/AIV/19/113/4'>Ps. 113:4</a>; <a href='/AIV/57/2/9-11'>Phil. 2:9–11</a>",
      "comment": "This Psalm opens by declaring God's universal majesty. The use of 'LORD' (YHWH) is a personal, covenant name, and 'our Lord' points to God’s kingship over creation. The structure is liturgical, mirroring worship in both the synagogue and, later, the Christian Mass. Note the Christological connection with Philippians 2:9–11, where Jesus is given the Name above every name—a subtle foreshadowing of Christ's divine Lordship."
    },
    {
      "pk": 1908002,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 2,
      "text": "Out of the mouths of children and infants, you have established strength because of your enemies, to silence the foe and the avenger.",
      "links": "<a href='/AIV/40/21/15-16'>Matt. 21:15–16</a>; <a href='/AIV/46/1/27'>1 Cor. 1:27</a>",
      "comment": "Jesus references this verse in Matthew 21:16 to show the praise he receives even from children as messianic fulfillment. God’s strength is revealed through the weak—especially significant in Christian theology, referencing how humility and childlike faith are exalted. The citation by Jesus is an indirect claim to divinity by receiving the praise belonging to God."
    },
    {
      "pk": 1908003,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 3,
      "text": "When I consider your heavens, the work of your fingers, the moon and the stars, which you have ordained—",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>; <a href='/AIV/18/9/9'>Job 9:9</a>",
      "comment": "The author meditates on the vastness of the creation, which God crafted. Psalm 19:1 provides a parallel regarding God’s glory in creation—this recognition of God as Creator underscores humanity’s humility, pointing toward the need to honor God as source of all, echoing themes later found in the Catholic understanding of God’s sovereignty and sacramental order."
    },
    {
      "pk": 1908004,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 4,
      "text": "What is man that you are mindful of him, and the son of man that you care for him?",
      "links": "<a href='/AIV/58/2/6'>Heb. 2:6–8</a>",
      "comment": "This verse expresses amazement that God would be concerned with humankind. Hebrews 2 applies this to Christ, the true 'Son of Man,' as the fulfillment of humanity’s destiny. The phrase 'son of man' is later a self-title of Jesus, deepening christological significance."
    },
    {
      "pk": 1908005,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 5,
      "text": "Yet you have made him a little lower than the heavenly beings and crowned him with glory and honor.",
      "links": "<a href='/AIV/58/2/7'>Heb. 2:7</a>; <a href='/AIV/19/21/5'>Ps. 21:5</a>",
      "comment": "While 'heavenly beings' could be translated 'angels' or 'God,' the Hebrew word 'Elohim' is used. Catholic tradition—and the New Testament—sees this as a prophetic echo of Christ’s incarnation, his temporary humility before being crowned in glory (cf. Hebrews 2:7). The Church interprets this dignity of man as the source for the sanctity of life and the doctrine of deification."
    },
    {
      "pk": 1908006,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 6,
      "text": "You have given him dominion over the works of your hands; you have put all things under his feet:",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/46/15/27'>1 Cor. 15:27</a>; <a href='/AIV/49/1/22'>Eph. 1:22</a>",
      "comment": "Original dominion given to Adam is a type of the fuller dominion given to Christ (1 Corinthians 15:27). Catholic theology teaches this as a restoration in Christ, where humanity is raised to a new dignity. This also prefigures humanity’s restored lordship in Christ, particularly mediated through sacramental life."
    },
    {
      "pk": 1908007,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 7,
      "text": "All sheep and oxen, and also the beasts of the field,",
      "links": "<a href='/AIV/1/2/19-20'>Gen. 2:19–20</a>",
      "comment": "This sustains the theme that man, as God’s steward, has authority over creation, echoing Genesis 2:19–20. The ordering of creation is an enduring doctrine, underlying later teachings on man's responsibility in caring for the earth—an idea universally recognized, but especially emphasized through centuries in Catholic social teaching."
    },
    {
      "pk": 1908008,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 8,
      "text": "the birds of the air, and the fish of the sea, whatever passes along the paths of the seas.",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/19/104/25'>Ps. 104:25</a>",
      "comment": "Expanding the dominion theme to all living creatures, reflecting God’s intention for harmonious stewardship. This image is recalled in the blessings over creation found in the liturgy—foreshadowing the Church’s sacramental worldview."
    },
    {
      "pk": 1908009,
      "translation": "AIV",
      "book": 19,
      "chapter": 8,
      "verse": 9,
      "text": "O LORD, our Lord, how majestic is your name in all the earth!",
      "links": "<a href='/AIV/19/8/1'>Ps. 8:1</a>; <a href='/AIV/19/113/4'>Ps. 113:4</a>",
      "comment": "The Psalm closes as it began, with praise. This repeated refrain forms a kind of liturgical bracket, typical in Hebrew poetry and echoed later in Christian worship—especially in the Eucharist, where the repeated declaration of God’s majesty is central. It invites believers to join in the universal, sacramental praise of God."
    }
  ],
  "translatedAt": "2025-12-22T21:22:48.281Z"
}