{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 32,
  "verses": [
    {
      "pk": 1933201,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 1,
      "text": "Blessed is the one whose transgression is forgiven, whose sin is covered.",
      "links": "<a href='/AIV/19/85/2'>Ps. 85:2</a>; <a href='/AIV/45/4/7-8'>Rom. 4:7–8</a>",
      "comment": "The use of 'covered' here points to the fullness of God's mercy. Notably, Paul cites this passage in Romans 4:7–8 in the context of justification, emphasizing forgiveness is a gift. Catholic theology affirms this but also stresses ongoing participation in sacraments for the continuing removal of sin, in harmony with this Psalm’s imagery."
    },
    {
      "pk": 1933202,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 2,
      "text": "Blessed is the person to whom the LORD does not count iniquity, and in whose spirit there is no deceit.",
      "links": "<a href='/AIV/19/24/4'>Ps. 24:4</a>; <a href='/AIV/43/1/47'>John 1:47</a>",
      "comment": "‘Does not count iniquity’ shows God’s gracious forgiveness. Spiritual honesty (‘no deceit’) is valued highly. Compare John 1:47, where Jesus praises Nathanael for being 'without deceit', an echo of the Psalm, and an implicit affirmation of sincerity being blessed in the sight of God."
    },
    {
      "pk": 1933203,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 3,
      "text": "When I kept silent, my bones wasted away through my groaning all day long.",
      "links": "<a href='/AIV/19/31/10'>Ps. 31:10</a>; <a href='/AIV/19/51/3'>Ps. 51:3</a>",
      "comment": "This verse acknowledges the physical and spiritual cost of unconfessed sin. The connection to Psalm 51 underscores the need for confession, a practice upheld in Catholic tradition through the sacrament of reconciliation."
    },
    {
      "pk": 1933204,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 4,
      "text": "For day and night your hand was heavy upon me; my strength dried up as in the heat of summer. Selah.",
      "links": "<a href='/AIV/19/38/2'>Ps. 38:2</a>; <a href='/AIV/19/39/10'>Ps. 39:10</a>",
      "comment": "Divine discipline is described as God’s 'heavy hand.' ‘Selah’ signals a pause for reflection—traditionally seen as an invitation to meditate on repentance’s necessity and the healing found in returning to God."
    },
    {
      "pk": 1933205,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 5,
      "text": "I acknowledged my sin to you, and I did not conceal my iniquity; I said, 'I will confess my transgressions to the LORD,' and you forgave the guilt of my sin. Selah.",
      "links": "<a href='/AIV/19/51/4-5'>Ps. 51:4–5</a>; <a href='/AIV/62/1/9'>1 John 1:9</a>",
      "comment": "This verse strongly affirms the act of confessing sins directly to God and His forgiveness. 1 John 1:9 echoes this in the New Testament. The centrality of confession here is reminiscent of the Catholic sacrament of penance, subtly encouraging a sacramental approach to forgiveness."
    },
    {
      "pk": 1933206,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 6,
      "text": "Therefore let everyone who is godly pray to you at a time when you may be found; surely in the flood of mighty waters they will not reach him.",
      "links": "<a href='/AIV/23/55/6'>Isa. 55:6</a>; <a href='/AIV/19/69/1'>Ps. 69:1</a>",
      "comment": "Urgency in seeking God (‘when you may be found’) alludes to Isaiah 55:6 and suggests a call to regularly approach the Lord. The metaphor of the flood may recall Noah (Genesis 7), implicitly linking God’s saving action."
    },
    {
      "pk": 1933207,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 7,
      "text": "You are my hiding place; you preserve me from trouble; you surround me with songs of deliverance. Selah.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "This imagery of God as protector finds echoes throughout Psalms. That God ‘surrounds with songs’ recalls worship and praise—central in liturgy, especially the sung psalms in Catholic tradition."
    },
    {
      "pk": 1933208,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 8,
      "text": "I will instruct you and teach you in the way you should go; I will counsel you with my eye upon you.",
      "links": "<a href='/AIV/19/25/12'>Ps. 25:12</a>; <a href='/AIV/19/48/14'>Ps. 48:14</a>",
      "comment": "This speaking voice is traditionally understood as God addressing His people. The emphasis on divine teaching can be read as opening the way for the Church’s role in guiding believers; Catholic tradition sees this fulfilled through apostolic teaching authority."
    },
    {
      "pk": 1933209,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 9,
      "text": "Do not be like a horse or a mule, without understanding, which must be controlled with bit and bridle, or else they will not come near you.",
      "links": "<a href='/AIV/20/26/3'>Prov. 26:3</a>",
      "comment": "Encourages willing obedience rather than being forced; spiritual wisdom leads to closer relationship with God. The weekly rhythm of formation found in liturgy and catechesis fosters understanding and readiness to follow God’s ways, aligning with Catholic practice."
    },
    {
      "pk": 1933210,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 10,
      "text": "Many are the sorrows of the wicked, but steadfast love surrounds the one who trusts in the LORD.",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/19/125/2'>Ps. 125:2</a>",
      "comment": "Shows the contrasting destiny of the wicked and the faithful. 'Steadfast love' (Hebrew hesed) frequently describes covenantal loyalty—seen by Catholics as made visible and tangible in the sacraments and the communion of saints."
    },
    {
      "pk": 1933211,
      "translation": "AIV",
      "book": 19,
      "chapter": 32,
      "verse": 11,
      "text": "Be glad in the LORD, and rejoice, you righteous, and shout for joy, all you upright in heart.",
      "links": "<a href='/AIV/19/33/1'>Ps. 33:1</a>; <a href='/AIV/41/16/16'>Mark 16:16</a>",
      "comment": "The psalm ends with praise and exultation, proper response to forgiveness and restoration. The righteous are called to public joy, prefiguring the celebratory nature of Eucharist and communal worship, an ongoing source of unity as found in Catholic tradition."
    }
  ],
  "translatedAt": "2025-12-22T21:30:08.495Z"
}