{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 90,
  "verses": [
    {
      "pk": 1909001,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 1,
      "text": "Lord, you have been our dwelling place in every generation.",
      "links": "<a href='/AIV/19/91/9'>Ps. 91:9</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "The psalm opens by addressing God as the eternal refuge of His people. Catholic tradition sees in this a mystical image of the Church as our spiritual home and in God's abiding presence, the sacramental life is foreshadowed."
    },
    {
      "pk": 1909002,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 2,
      "text": "Before the mountains were brought forth, before you gave birth to the earth and the world, from everlasting to everlasting, you are God.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/93/2'>Ps. 93:2</a>",
      "comment": "Affirms God's eternal existence, distinct from creation. Used in trinitarian theology to show God's nature beyond time. 'Gave birth' evokes creation as an act originating from the Father, and this imagery resonates with Mary's unique role in salvation history—a subtle Marian echo."
    },
    {
      "pk": 1909003,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 3,
      "text": "You turn man back to dust, and say, 'Return, children of men.'",
      "links": "<a href='/AIV/01/3/19'>Gen. 3:19</a>; <a href='/AIV/18/34/15'>Job 34:15</a>",
      "comment": "Confirms human mortality because of original sin (see Genesis 3). Catholic interpretation insists that even in judgment, God calls humanity back to Himself, which prefigures reconciliation offered through Christ's cross."
    },
    {
      "pk": 1909004,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 4,
      "text": "For a thousand years in your sight are like yesterday when it passes, or as a watch in the night.",
      "links": "<a href='/AIV/61/3/8'>2 Pet. 3:8</a>; <a href='/AIV/19/39/5'>Ps. 39:5</a>",
      "comment": "God's perception of time transcends ours. Peter quotes this in the New Testament to highlight God's eternal patience. Liturgically, the Church uses this to express God's timelessness in the Eucharist, where time and eternity unite."
    },
    {
      "pk": 1909005,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 5,
      "text": "You sweep them away like a flood; they are like a dream. In the morning, they are like grass that sprouts up.",
      "links": "<a href='/AIV/19/103/15'>Ps. 103:15</a>; <a href='/AIV/06/24/7'>Josh. 24:7</a>",
      "comment": "Human life compared to grass and dreams reveals our fragility and dependence on God. Flood imagery references Noah and God’s power in judgment, pointing forward to sacramental cleansing in baptism."
    },
    {
      "pk": 1909006,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 6,
      "text": "In the morning it flourishes and grows, but in the evening it fades and withers.",
      "links": "<a href='/AIV/23/40/6-7'>Isa. 40:6-7</a>; <a href='/AIV/19/37/2'>Ps. 37:2</a>",
      "comment": "Grass flourishes and then fades, symbolizing the brevity of life. Early Church Fathers interpreted this as a symbol of resurrection: morning brings new life, and evening recalls mortality, anticipating resurrection through Christ."
    },
    {
      "pk": 1909007,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 7,
      "text": "For we are consumed by your anger and terrified by your wrath.",
      "links": "<a href='/AIV/19/78/49'>Ps. 78:49</a>; <a href='/AIV/19/32/4'>Ps. 32:4</a>",
      "comment": "Here, God's justice is emphasized, which brings true repentance. The Catholic view underscores penance and the need for sacramental absolution, which reconciles the believer with God."
    },
    {
      "pk": 1909008,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 8,
      "text": "You have set our iniquities before you, our secret sins in the light of your presence.",
      "links": "<a href='/AIV/19/19/12'>Ps. 19:12</a>; <a href='/AIV/19/69/5'>Ps. 69:5</a>",
      "comment": "All sins, even hidden ones, are exposed to God. Catholic theology teaches thorough confession and examination of conscience, encouraging the faithful to seek reconciliation in the sacrament of penance."
    },
    {
      "pk": 1909009,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 9,
      "text": "For all our days pass away under your wrath; we finish our years like a sigh.",
      "links": "<a href='/AIV/19/39/4'>Ps. 39:4</a>; <a href='/AIV/19/78/33'>Ps. 78:33</a>",
      "comment": "Life is fleeting because of sin. The sigh suggests longing for redemption—fulfilled in Christ, whose sacrifice removes the sting of death for those united to Him, especially in the Eucharist."
    },
    {
      "pk": 1909010,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 10,
      "text": "The years of our life are seventy, or even eighty, if we have strength; yet their span is toil and trouble; they are soon gone, and we fly away.",
      "links": "<a href='/AIV/18/14/1-2'>Job 14:1-2</a>; <a href='/AIV/19/89/47'>Ps. 89:47</a>",
      "comment": "Typical lifespan expressed. Catholic tradition would interpret 'fly away' in reference to the soul's immortal destiny, inviting contemplation of heaven, purgatory, or hell—consistent with the fuller view of the afterlife."
    },
    {
      "pk": 1909011,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 11,
      "text": "Who understands the power of your anger and your wrath according to the fear that is due to you?",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>; <a href='/AIV/19/130/3-4'>Ps. 130:3-4</a>",
      "comment": "Proper reverence for God’s justice brings conversion. Catholic doctrine encourages a holy fear, leading not only to repentance but deeper trust in God's mercy—fostered in prayer and devotion."
    },
    {
      "pk": 1909012,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 12,
      "text": "So teach us to number our days, that we may gain a heart of wisdom.",
      "links": "<a href='/AIV/19/39/4'>Ps. 39:4</a>; <a href='/AIV/19/111/10'>Ps. 111:10</a>",
      "comment": "Seeking wisdom is a major theme in both Testaments. Catholic teaching sees wisdom as a gift of the Holy Spirit, given abundantly through the sacraments and the praying Church."
    },
    {
      "pk": 1909013,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 13,
      "text": "Return, O Lord! How long? Have compassion on your servants.",
      "links": "<a href='/AIV/19/6/4'>Ps. 6:4</a>; <a href='/AIV/19/85/4'>Ps. 85:4</a>",
      "comment": "A prayer for God’s mercy recalls God’s historical interventions—shadows of Christ’s coming and His ongoing presence in the Church through mercy and grace, especially the Eucharist."
    },
    {
      "pk": 1909014,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 14,
      "text": "Satisfy us in the morning with your loyal love, that we may rejoice and be glad all our days.",
      "links": "<a href='/AIV/19/143/8'>Ps. 143:8</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "Morning refers to new mercies and resurrection. 'Loyal love' translates hesed—the covenantal love Catholics see fulfilled in Christ and administered through Church sacraments."
    },
    {
      "pk": 1909015,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 15,
      "text": "Make us glad for as many days as you have afflicted us, for as many years as we have seen evil.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/19/126/5'>Ps. 126:5</a>",
      "comment": "God transforms suffering into joy. Catholic teaching emphasizes redemptive suffering united to Christ, especially linking this to participation in the Mass where suffering and praise are joined."
    },
    {
      "pk": 1909016,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 16,
      "text": "Let your work be shown to your servants, and your glorious power to their children.",
      "links": "<a href='/AIV/02/15/6'>Ex. 15:6</a>; <a href='/AIV/19/77/14'>Ps. 77:14</a>",
      "comment": "Desires the revelation of God’s saving acts to future generations, foreshadowing the ongoing mission of the Church to pass on the faith through tradition and Scripture."
    },
    {
      "pk": 1909017,
      "translation": "AIV",
      "book": 19,
      "chapter": 90,
      "verse": 17,
      "text": "Let the favor of the Lord our God be upon us; establish the work of our hands for us—yes, establish the work of our hands.",
      "links": "<a href='/AIV/19/128/2'>Ps. 128:2</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Double plea for God’s blessing and permanence. The desire for God to 'establish' our works points to the Catholic understanding of cooperation with God’s grace in our vocations and good works—never alone, always by God's help."
    }
  ],
  "translatedAt": "2025-12-22T21:48:48.258Z"
}