{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 77,
  "verses": [
    {
      "pk": 1907701,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 1,
      "text": "I cry aloud to God; I cry out, and He will listen to me.",
      "links": "<a href='/AIV/18/30/20'>Job 30:20</a>; <a href='/AIV/19/34/6'>Ps. 34:6</a>",
      "comment": "The psalm begins with a personal, persistent plea to God, emphasizing trust that God hears. This echoes earlier psalms and Job's lament, showing a traditional Jewish approach to bringing cares before the Lord."
    },
    {
      "pk": 1907702,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 2,
      "text": "In the day of my trouble I sought the Lord. My hand was stretched out at night and did not grow weary; my soul refused to be comforted.",
      "links": "<a href='/AIV/19/88/9'>Ps. 88:9</a>; <a href='/AIV/25/1/16-17'>Lam. 1:16–17</a>",
      "comment": "A picture of unresolved suffering and tireless prayer; highlighting that even devout people can face periods when God seems distant."
    },
    {
      "pk": 1907703,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 3,
      "text": "When I remember God, I groan; when I meditate, my spirit grows faint. Selah.",
      "links": "<a href='/AIV/19/42/5'>Ps. 42:5</a>; <a href='/AIV/19/143/4'>Ps. 143:4</a>",
      "comment": "The psalmist’s pain increases as he reflects on God’s ways, hinting at the mystery of suffering. The word 'Selah' is retained—a musical or liturgical pause; its meaning is debated."
    },
    {
      "pk": 1907704,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 4,
      "text": "You hold my eyelids open; I am so troubled that I cannot speak.",
      "links": "<a href='/AIV/19/6/6'>Ps. 6:6</a>; <a href='/AIV/19/38/13-14'>Ps. 38:13–14</a>",
      "comment": "The inability to sleep or speak shows how thorough suffering can silence and paralyze even the faithful—an experience not foreign to saints or Christ Himself (<a href='/AIV/40/26/38'>Matt. 26:38</a>)."
    },
    {
      "pk": 1907705,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 5,
      "text": "I consider the days of old, the years long past.",
      "links": "<a href='/AIV/19/143/5'>Ps. 143:5</a>",
      "comment": "Turning to the memories of God’s past faithfulness as a source of hope, echoing the importance of history and tradition in faith—parallels to Sacred Tradition in Catholic understanding."
    },
    {
      "pk": 1907706,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 6,
      "text": "I remember my song in the night; I meditate within my heart, and my spirit makes a diligent search:",
      "links": "<a href='/AIV/19/42/8'>Ps. 42:8</a>; <a href='/AIV/19/16/7'>Ps. 16:7</a>",
      "comment": "Night-time reflection recalls moments of deeper prayer and the use of song—prefiguring the tradition of liturgical prayers and hymns."
    },
    {
      "pk": 1907707,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 7,
      "text": "Will the Lord reject forever? Will He never again show His favor?",
      "links": "<a href='/AIV/19/85/5'>Ps. 85:5</a>; <a href='/AIV/25/3/31-33'>Lam. 3:31–33</a>",
      "comment": "Deep questions of abandonment reflect those asked by Christ on the Cross (<a href='/AIV/40/27/46'>Matt. 27:46</a>). Such questions reveal vulnerability and honesty in prayer."
    },
    {
      "pk": 1907708,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 8,
      "text": "Has His steadfast love ceased forever? Are His promises at an end for all generations?",
      "links": "<a href='/AIV/19/89/49'>Ps. 89:49</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "'Steadfast love' translates 'hesed'—God’s covenantal mercy. The psalmist’s doubt shows the human side of faith, wrestling with the promises of God, later fulfilled in Christ, the New Covenant."
    },
    {
      "pk": 1907709,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 9,
      "text": "Has God forgotten to be gracious? Has He in anger shut up His compassion? Selah.",
      "links": "<a href='/AIV/19/9/18'>Ps. 9:18</a>; <a href='/AIV/23/49/15'>Isa. 49:15</a>",
      "comment": "God’s graciousness (grace) and compassion are questioned—a theme that recurs in Israel’s doubts. The word 'Selah' again invites contemplation."
    },
    {
      "pk": 1907710,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 10,
      "text": "Then I said, 'It is my grief, that the right hand of the Most High has changed.'",
      "links": "<a href='/AIV/19/74/11'>Ps. 74:11</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "\"The right hand of the Most High\" is a biblical symbol for God’s power—Saints and the Church understand God’s apparent silence as a test for steadfast faith."
    },
    {
      "pk": 1907711,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 11,
      "text": "I will remember the deeds of the Lord; yes, I will remember your wonders of old.",
      "links": "<a href='/AIV/19/143/5'>Ps. 143:5</a>; <a href='/AIV/19/78/4'>Ps. 78:4</a>",
      "comment": "Remembrance of God’s works is a recurring theme. In a Catholic context, this foreshadows the Eucharist, which is the memorial of Christ’s Paschal Mystery, fulfilled in the New Covenant."
    },
    {
      "pk": 1907712,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 12,
      "text": "I will meditate on all your work and consider your mighty deeds.",
      "links": "<a href='/AIV/19/111/2'>Ps. 111:2</a>",
      "comment": "The practice of meditation is encouraged in both Jewish and Christian tradition; the pondering of God’s works is central to spiritual life."
    },
    {
      "pk": 1907713,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 13,
      "text": "Your way, O God, is holy. What god is as great as our God?",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "The uniqueness and transcendence of God are declared. The rhetorical question is later fulfilled in Christ, who reveals God’s true holiness."
    },
    {
      "pk": 1907714,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 14,
      "text": "You are the God who works wonders; you have made your power known among the peoples.",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>; <a href='/AIV/19/98/2'>Ps. 98:2</a>",
      "comment": "God’s works make His presence known to all nations—a prophecy ultimately completed in Christ and through the universal Church."
    },
    {
      "pk": 1907715,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 15,
      "text": "You with your arm redeemed your people, the children of Jacob and Joseph. Selah.",
      "links": "<a href='/AIV/19/74/2'>Ps. 74:2</a>; <a href='/AIV/19/105/37'>Ps. 105:37</a>",
      "comment": "Redemption is central. The rescuing of Israel prefigures the final redemption in Christ. 'Selah' again marks a pause for meditation."
    },
    {
      "pk": 1907716,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 16,
      "text": "When the waters saw you, O God, when the waters saw you, they trembled; the depths also shook.",
      "links": "<a href='/AIV/19/114/3-5'>Ps. 114:3-5</a>; <a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>",
      "comment": "Poetic language describing the crossing of the Red Sea—a clear typology foreshadowing Christian baptism, which Paul explicitly references (<a href='/AIV/46/10/1-2'>1 Cor. 10:1-2</a>)."
    },
    {
      "pk": 1907717,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 17,
      "text": "The clouds poured out water; the skies gave forth thunder; your arrows flashed on every side.",
      "links": "<a href='/AIV/02/9/23'>Ex. 9:23</a>; <a href='/AIV/19/18/14'>Ps. 18:14</a>",
      "comment": "Thunder and lightning are frequently used as images of God’s power and revelation, connected with Sinai and Theophany."
    },
    {
      "pk": 1907718,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 18,
      "text": "The sound of your thunder was in the whirlwind; your lightning lit up the world; the earth trembled and shook.",
      "links": "<a href='/AIV/02/19/16-18'>Ex. 19:16–18</a>; <a href='/AIV/19/97/4'>Ps. 97:4</a>",
      "comment": "Describes Sinai, theophany, and the awe-inspiring presence of God—a connection to God’s revelation to His people and, spiritually, to how God’s presence still stirs the world."
    },
    {
      "pk": 1907719,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 19,
      "text": "Your way was through the sea, your path through the great waters; yet your footprints were unseen.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/23/43/16'>Isa. 43:16</a>",
      "comment": "God’s mysterious guidance—He leads even when we cannot see Him, analogous to divine Providence and Christ’s presence in the Sacraments."
    },
    {
      "pk": 1907720,
      "translation": "AIV",
      "book": 19,
      "chapter": 77,
      "verse": 20,
      "text": "You led your people like a flock by the hand of Moses and Aaron.",
      "links": "<a href='/AIV/19/78/52'>Ps. 78:52</a>; <a href='/AIV/04/33/1'>Num. 33:1</a>",
      "comment": "The closing verse uses shepherd imagery, foundational for Christ’s declaration 'I am the Good Shepherd' (<a href='/AIV/43/10/11'>John 10:11</a>). Moses and Aaron prefigure Christ's role as High Priest—recall the importance of priestly mediation in Catholic faith."
    }
  ],
  "translatedAt": "2025-12-22T21:44:12.124Z"
}