{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 106,
  "verses": [
    {
      "pk": 3010601,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 1,
      "text": "Praise the LORD! Give thanks to the LORD, for he is good; his steadfast love endures forever.",
      "links": "<a href='/AIV/19/107/1'>Ps. 107:1</a>; <a href='/AIV/19/118/1'>Ps. 118:1</a>",
      "comment": "This opening sets the praise for God's eternal mercy, a common theme throughout the Psalms. 'Steadfast love' (Heb: hesed) often points to God's covenant faithfulness."
    },
    {
      "pk": 3010602,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 2,
      "text": "Who can speak of the mighty acts of the LORD, or declare all his praise?",
      "links": "<a href='/AIV/19/145/3'>Ps. 145:3</a>",
      "comment": "God's deeds and glory surpass human comprehension, highlighting our need to worship in humility before his grandeur."
    },
    {
      "pk": 3010603,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 3,
      "text": "Blessed are those who keep justice, and do righteousness at all times.",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/19/37/27'>Ps. 37:27</a>",
      "comment": "Consistent pursuit of justice and righteousness brings blessing; this echoes the call to holiness as a response to God's mercy."
    },
    {
      "pk": 3010604,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 4,
      "text": "Remember me, LORD, with the favor you show to your people; come to me with your salvation,",
      "links": "<a href='/AIV/19/119/132'>Ps. 119:132</a>",
      "comment": "The psalmist requests personal inclusion in God's redemptive work, illustrating both individual and communal aspects of salvation."
    },
    {
      "pk": 3010605,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 5,
      "text": "so I may see the good of your chosen ones, rejoice in your nation's joy, and boast with your inheritance.",
      "links": "<a href='/AIV/19/105/6'>Ps. 105:6</a>; <a href='/AIV/19/33/12'>Ps. 33:12</a>",
      "comment": "God’s people (Israel) are described as 'chosen' and 'inheritance', terms later retaken by the Church, connecting the Old Testament community to those who share in the promises through Christ (<a href='/AIV/60/2/9'>1 Peter 2:9</a>)."
    },
    {
      "pk": 3010606,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 6,
      "text": "We have sinned, just like our ancestors; we have done wrong and acted wickedly.",
      "links": "<a href='/AIV/27/9/5'>Dan. 9:5</a>; <a href='/AIV/13/21/17'>1 Chron. 21:17</a>",
      "comment": "Notice the confession of communal sin, showing solidarity in repentance, a model for prayers of contrition and reconciliation."
    },
    {
      "pk": 3010607,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 7,
      "text": "Our fathers, in Egypt, did not grasp your wonders; they did not remember your many mercies, but rebelled by the sea, at the Red Sea.",
      "links": "<a href='/AIV/2/14/11-12'>Ex. 14:11–12</a>",
      "comment": "Israel’s forgetfulness and rebellion at the Red Sea remind us of the importance of remembering God’s saving works."
    },
    {
      "pk": 3010608,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 8,
      "text": "Yet he saved them for his name’s sake, to make known his mighty power.",
      "links": "<a href='/AIV/2/9/16'>Ex. 9:16</a>; <a href='/AIV/19/79/9'>Ps. 79:9</a>",
      "comment": "God’s deliverance is for the sake of his own name, showing that salvation is God-initiated and for his glory."
    },
    {
      "pk": 3010609,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 9,
      "text": "He rebuked the Red Sea, and it dried up; and he led them through the depths as through a desert.",
      "links": "<a href='/AIV/2/14/21'>Ex. 14:21</a>",
      "comment": "A recounting of the Exodus, showing God’s power over creation and affirming the miraculous nature of salvation history."
    },
    {
      "pk": 3010610,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 10,
      "text": "He saved them from the hand of the one who hated them, and redeemed them from the enemy.",
      "links": "<a href='/AIV/2/15/13'>Ex. 15:13</a>",
      "comment": "‘Redeemed’ (Heb: ga’al) indicates liberation through sacrifice—a theme that foreshadows Christ’s own redemptive work."
    },
    {
      "pk": 3010611,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 11,
      "text": "The waters covered their foes; not one of them was left.",
      "links": "<a href='/AIV/2/14/28'>Ex. 14:28</a>",
      "comment": "The complete destruction of Egypt’s army points to God’s total victory over evil; a spiritual battle paralleled in Christ’s victory over sin and death."
    },
    {
      "pk": 3010612,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 12,
      "text": "Then they believed his words; they sang his praise.",
      "links": "<a href='/AIV/2/15/1'>Ex. 15:1</a>",
      "comment": "Faith and praise follow deliverance, yet as the psalm continues, this faith proves fragile, warning us against forgetting God."
    },
    {
      "pk": 3010613,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 13,
      "text": "But they quickly forgot his works; they did not wait for his counsel.",
      "links": "<a href='/AIV/19/78/11'>Ps. 78:11</a>",
      "comment": "Impatience and forgetfulness lead to sin; reliance on God’s guidance is essential for perseverance in faith."
    },
    {
      "pk": 3010614,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 14,
      "text": "They craved intensely in the wilderness and tested God in the desert.",
      "links": "<a href='/AIV/4/11/4'>Num. 11:4</a>",
      "comment": "Testing God recalls Israel’s lack of trust; this theme is spiritually tied to temptations faced by Christ (<a href='/AIV/40/4/1-11'>Matt. 4:1–11</a>)."
    },
    {
      "pk": 3010615,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 15,
      "text": "So he gave them what they asked for, but sent leanness into their souls.",
      "links": "<a href='/AIV/4/11/18-20'>Num. 11:18–20</a>",
      "comment": "Earthly desires granted without spiritual benefit bring spiritual barrenness, teaching the importance of seeking God’s will above our own."
    },
    {
      "pk": 3010616,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 16,
      "text": "They grew envious of Moses in the camp, and of Aaron, the LORD’s holy one.",
      "links": "<a href='/AIV/4/16/1-3'>Num. 16:1–3</a>",
      "comment": "Rebellion against God’s appointed leaders foreshadows the honor due to those chosen to guide God’s people—a theme continuing in the Church’s hierarchical structure."
    },
    {
      "pk": 3010617,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 17,
      "text": "The earth opened up and swallowed Dathan, and covered the company of Abiram.",
      "links": "<a href='/AIV/4/16/31-33'>Num. 16:31–33</a>",
      "comment": "God’s judgment against open rebellion exemplifies the seriousness of rejecting divinely instituted order."
    },
    {
      "pk": 3010618,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 18,
      "text": "Fire blazed among their company; a flame consumed the wicked.",
      "links": "<a href='/AIV/4/16/35'>Num. 16:35</a>",
      "comment": "Divine judgment by fire is a sign of God's holiness and justice, echoing later imagery of purification and judgment."
    },
    {
      "pk": 3010619,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 19,
      "text": "They made a calf at Horeb and worshiped a metal image.",
      "links": "<a href='/AIV/2/32/4'>Ex. 32:4</a>",
      "comment": "Idolatry at Sinai stands as the classic example of spiritual infidelity; the worship of images is repeatedly condemned as a violation of direct communion with the true God."
    },
    {
      "pk": 3010620,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 20,
      "text": "They exchanged their glory for the image of an ox that eats grass.",
      "links": "<a href='/AIV/2/32/24'>Ex. 32:24</a>; <a href='/AIV/45/1/23'>Rom. 1:23</a>",
      "comment": "Turning from divine glory to lifeless idols foreshadows Paul’s later condemnation of idolatry (<a href='/AIV/45/1/23'>Romans 1:23</a>)."
    },
    {
      "pk": 3010621,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 21,
      "text": "They forgot God, their Savior, who had done great things in Egypt,",
      "links": "<a href='/AIV/19/78/42'>Ps. 78:42</a>; <a href='/AIV/2/14/30'>Ex. 14:30</a>",
      "comment": "Forgetting God after salvation points to the need for continuous remembrance through liturgical and sacramental life."
    },
    {
      "pk": 3010622,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 22,
      "text": "wonders in the land of Ham, and awesome deeds by the Red Sea.",
      "links": "<a href='/AIV/19/78/12'>Ps. 78:12</a>",
      "comment": "God’s power shown in Egypt is recalled as evidence for his saving presence."
    },
    {
      "pk": 3010623,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 23,
      "text": "So he said he would destroy them, but Moses, his chosen one, stood in the breach before him, to turn away his wrath from destroying them.",
      "links": "<a href='/AIV/2/32/10-14'>Ex. 32:10–14</a>; <a href='/AIV/26/22/30'>Ezek. 22:30</a>",
      "comment": "Moses acts as a mediator, pleading for the people—a prefiguration of Christ’s unique mediatorship (<a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 3010624,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 24,
      "text": "Then they despised the pleasant land; they did not believe his promise.",
      "links": "<a href='/AIV/4/13/27-32'>Num. 13:27–32</a>",
      "comment": "Refusal to enter the promised land shows the consequences of unbelief; God’s promises call for trust above obstacles."
    },
    {
      "pk": 3010625,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 25,
      "text": "They grumbled in their tents, and did not obey the voice of the LORD.",
      "links": "<a href='/AIV/4/14/1-4'>Num. 14:1–4</a>",
      "comment": "Persistent grumbling reflects hearts hardened against God’s commands—a warning against spiritual complacency."
    },
    {
      "pk": 3010626,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 26,
      "text": "So he lifted his hand and swore to make them fall in the wilderness,",
      "links": "<a href='/AIV/4/14/28-30'>Num. 14:28–30</a>",
      "comment": "God’s oath seals the judgment for unbelief, showing the seriousness of breaking covenant."
    },
    {
      "pk": 3010627,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 27,
      "text": "and to scatter their offspring among the nations, and disperse them in the lands.",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>; <a href='/AIV/5/4/27'>Deut. 4:27</a>",
      "comment": "Prophecy of dispersion is fulfilled in the Exile, yet the hope of restoration runs through the biblical narrative."
    },
    {
      "pk": 3010628,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 28,
      "text": "They joined themselves to Baal of Peor, and ate sacrifices offered to lifeless gods.",
      "links": "<a href='/AIV/4/25/2-3'>Num. 25:2–3</a>",
      "comment": "Eating idol sacrifices highlights the importance of right worship and echoes Paul’s warnings about idolatry (<a href='/AIV/46/10/21'>1 Cor. 10:21</a>)."
    },
    {
      "pk": 3010629,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 29,
      "text": "They provoked the LORD with their deeds, so that a plague broke out among them.",
      "links": "<a href='/AIV/4/25/9'>Num. 25:9</a>",
      "comment": "Direct consequences followed the spiritual transgressions, underscoring the reality of divine justice and its connection to human freedom."
    },
    {
      "pk": 3010630,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 30,
      "text": "But Phinehas stood up and intervened, and the plague was stopped.",
      "links": "<a href='/AIV/4/25/7-8'>Num. 25:7–8</a>",
      "comment": "Intercession by a righteous person averts God’s wrath; Phinehas prefigures righteous mediators, culminating in Christ."
    },
    {
      "pk": 3010631,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 31,
      "text": "And that was counted to him as righteousness for all generations forever.",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/59/2/21-22'>James 2:21–22</a>",
      "comment": "Righteous acts are remembered eternally, linking faith and works in God’s plan."
    },
    {
      "pk": 3010632,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 32,
      "text": "They angered him at the waters of Meribah, and it went poorly for Moses because of them;",
      "links": "<a href='/AIV/4/20/2-13'>Num. 20:2–13</a>",
      "comment": "Even the leader Moses suffered for the people’s rebellion; leadership is a holy responsibility requiring trust in God."
    },
    {
      "pk": 3010633,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 33,
      "text": "for they made his spirit bitter, so that he spoke rashly with his lips.",
      "links": "<a href='/AIV/4/20/10-12'>Num. 20:10–12</a>",
      "comment": "Sin affects even the greatest of God’s servants; Moses’ failure reflects the universal human need for grace."
    },
    {
      "pk": 3010634,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 34,
      "text": "They did not destroy the peoples as the LORD had commanded them,",
      "links": "<a href='/AIV/5/7/2'>Deut. 7:2</a>",
      "comment": "Failure to obey leads to spiritual compromise; God’s commands are meant to preserve holiness among his people."
    },
    {
      "pk": 3010635,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 35,
      "text": "but mixed themselves among the nations and learned their practices.",
      "links": "<a href='/AIV/7/2/11-13'>Judg. 2:11–13</a>",
      "comment": "Mixing with other nations led to idolatry and moral decline, a warning about assimilating worldly values."
    },
    {
      "pk": 3010636,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 36,
      "text": "They served their idols, which became a snare to them.",
      "links": "<a href='/AIV/19/78/58'>Ps. 78:58</a>",
      "comment": "Idols are repeatedly described as traps, keeping people from true worship and relationship with God."
    },
    {
      "pk": 3010637,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 37,
      "text": "They sacrificed their sons and daughters to demons,",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>; <a href='/AIV/19/78/58'>Ps. 78:58</a>",
      "comment": "The horror of child sacrifice shows the depths of human rebellion when rejecting God—a grave sin with deep social and spiritual consequences."
    },
    {
      "pk": 3010638,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 38,
      "text": "and they poured out innocent blood—the blood of their sons and daughters whom they sacrificed to the idols of Canaan—and the land was polluted with blood.",
      "links": "<a href='/AIV/4/33/55'>Num. 33:55</a>; <a href='/AIV/5/12/31'>Deut. 12:31</a>",
      "comment": "The crime of bloodshed brings defilement and necessitates purification, echoing later themes of atonement and redemption."
    },
    {
      "pk": 3010639,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 39,
      "text": "So they became unclean by their deeds and prostituted themselves by what they did.",
      "links": "<a href='/AIV/3/18/24'>Lev. 18:24</a>",
      "comment": "Spiritual and moral impurity is likened to infidelity, using strong covenant language found throughout the prophets."
    },
    {
      "pk": 3010640,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 40,
      "text": "Then the LORD’s anger was kindled against his people, and he abhorred his inheritance.",
      "links": "<a href='/AIV/19/78/59'>Ps. 78:59</a>",
      "comment": "God’s response highlights both justice and the seriousness of sin, yet as the narrative continues, mercy will prevail."
    },
    {
      "pk": 3010641,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 41,
      "text": "He gave them into the hand of the nations, and those who hated them ruled over them.",
      "links": "<a href='/AIV/16/9/37'>Neh. 9:37</a>",
      "comment": "God’s people suffer exile and persecution due to their unfaithfulness, yet these sufferings become a means for repentance and eventual restoration."
    },
    {
      "pk": 3010642,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 42,
      "text": "Their enemies oppressed them, and they were subjected under their hand.",
      "links": "<a href='/AIV/7/2/14'>Judg. 2:14</a>",
      "comment": "Oppression under enemies is described as just consequence, yet opens the door for future deliverance."
    },
    {
      "pk": 3010643,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 43,
      "text": "Many times he delivered them, but they were stubborn in their plans and sank lower in their guilt.",
      "links": "<a href='/AIV/7/2/16'>Judg. 2:16</a>",
      "comment": "God’s mercy is persistent, but human stubbornness leads repeatedly to downfall; true conversion remains the needed response."
    },
    {
      "pk": 3010644,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 44,
      "text": "Even so, he saw their distress when he heard their cry;",
      "links": "<a href='/AIV/2/2/24'>Ex. 2:24</a>",
      "comment": "Despite their sin, God is always attentive to repentance and will answer the cry of his people."
    },
    {
      "pk": 3010645,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 45,
      "text": "and he remembered his covenant for them, and relented according to the abundance of his steadfast love.",
      "links": "<a href='/AIV/2/6/5'>Ex. 6:5</a>; <a href='/AIV/19/105/8'>Ps. 105:8</a>",
      "comment": "God’s mercy flows from his covenant promises; steadfast love anchors hope for forgiveness and restoration."
    },
    {
      "pk": 3010646,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 46,
      "text": "He made them pitied by all who held them captive.",
      "links": "<a href='/AIV/27/1/9'>Dan. 1:9</a>",
      "comment": "Divine favor softens the hearts of captors, showing God’s providence at work even in exile."
    },
    {
      "pk": 3010647,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 47,
      "text": "Save us, LORD our God, and gather us from among the nations, that we may give thanks to your holy name and glory in your praise.",
      "links": "<a href='/AIV/19/107/3'>Ps. 107:3</a>; <a href='/AIV/24/29/14'>Jer. 29:14</a>",
      "comment": "The prayer for gathering points both to the return of Israel, and spiritually, to God’s promise to unite people from all nations in praise—hinting at the universality of God's plan."
    },
    {
      "pk": 3010648,
      "translation": "AIV",
      "book": 19,
      "chapter": 106,
      "verse": 48,
      "text": "Blessed be the LORD, the God of Israel, from everlasting to everlasting! Let all the people say, Amen! Praise the LORD!",
      "links": "<a href='/AIV/19/41/13'>Ps. 41:13</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Doxology closes the psalm in communal worship; the repeated 'Amen' affirms the faithful response and forms the liturgical ending echoed in Christian worship traditions."
    }
  ],
  "translatedAt": "2025-12-23T05:40:15.642Z"
}