{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 128,
  "verses": [
    {
      "pk": 1280061,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 1,
      "text": "Blessed is everyone who fears the LORD, who walks in His ways.",
      "links": "<a href='/AIV/19/112/1'>Psalm 112:1</a>; <a href='/AIV/19/1/1'>Psalm 1:1</a>; <a href='/AIV/20/3/7'>Proverbs 3:7</a>",
      "comment": "This verse introduces the theme of reverent obedience as the path to blessing. The word 'fear' here has a dual sense of awe and filial respect, reflected throughout Scripture (Proverbs 1:7) and fulfilled in Christ's perfect reverence (Hebrews 5:7)."
    },
    {
      "pk": 1280062,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 2,
      "text": "You will eat the fruit of the labor of your hands; you will be blessed, and it will be well with you.",
      "links": "<a href='/AIV/19/127/2'>Psalm 127:2</a>; <a href='/AIV/5/28/4'>Deuteronomy 28:4'</a>; <a href='/AIV/23/3/10'>Isaiah 3:10</a>",
      "comment": "The promise of enjoying the fruits of one's labor echoes the covenant blessings in Deuteronomy 28. The physical blessings anticipate spiritual fulfillment through abiding in Christ (John 15:4–5)."
    },
    {
      "pk": 1280063,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 3,
      "text": "Your wife will be like a fruitful vine within your house; your children will be like olive shoots around your table.",
      "links": "<a href='/AIV/19/52/8'>Psalm 52:8</a>; <a href='/AIV/20/31/10-31'>Proverbs 31:10–31</a>",
      "comment": "The imagery of the fruitful vine and olive shoots conveys vitality, unity, and lasting blessings in the household. This points to the importance of family within God's design, reflecting the spiritual fruitfulness of the Church and individual believers (Galatians 5:22)."
    },
    {
      "pk": 1280064,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 4,
      "text": "See, thus shall the man be blessed who fears the LORD.",
      "links": "<a href='/AIV/19/112/2'>Psalm 112:2</a>; <a href='/AIV/20/14/26'>Proverbs 14:26</a>",
      "comment": "The verse restates the blessing linked with fearing the Lord, forming an inclusio to emphasize its certainty. This spiritual reality finds its ultimate expression in the beatitudes Jesus taught (Matthew 5:1-12)."
    },
    {
      "pk": 1280065,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 5,
      "text": "The LORD bless you from Zion! May you see the prosperity of Jerusalem all the days of your life.",
      "links": "<a href='/AIV/19/134/3'>Psalm 134:3</a>; <a href='/AIV/23/65/20-22'>Isaiah 65:20–22</a>",
      "comment": "Blessing 'from Zion' holds deep significance, as Zion is both the earthly center of worship and foreshadowing the heavenly Jerusalem (Hebrews 12:22). This has literal and spiritual implications: believers look forward to the fullness of blessing mediated through the New Covenant and gathered worship."
    },
    {
      "pk": 1280066,
      "translation": "AIV",
      "book": 19,
      "chapter": 128,
      "verse": 6,
      "text": "May you see your children's children! Peace be upon Israel!",
      "links": "<a href='/AIV/19/125/5'>Psalm 125:5</a>; <a href='/AIV/1/50/23'>Genesis 50:23</a>; <a href='/AIV/19/122/6'>Psalm 122:6</a>",
      "comment": "Witnessing sons’ sons is an expression of generational blessing and continuity, a concept highly valued in Scripture (Genesis 50:23). The prayer for peace upon Israel links personal blessing to the communal flourishing of God’s people, echoing the spiritual peace brought by the Messiah (John 14:27; Romans 5:1)."
    }
  ],
  "translatedAt": "2025-12-23T05:47:14.839Z"
}