{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 60,
  "verses": [
    {
      "pk": 20060601,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 1,
      "text": "O God, you have rejected us; you have broken us. You have been angry; restore us to yourself.",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/19/74/1'>Ps. 74:1</a>; <a href='/AIV/23/64/9'>Isa. 64:9</a>",
      "comment": "The psalmist acknowledges God’s displeasure towards Israel, calling for restoration. In both Catholic and Protestant readings, such pleas prefigure Christ, who reconciles humanity to God (2 Cor. 5:18–19)."
    },
    {
      "pk": 20060602,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 2,
      "text": "You have made the earth tremble; you have broken it open. Heal its fractures, for it shakes.",
      "links": "<a href='/AIV/19/18/7'>Ps. 18:7</a>; <a href='/AIV/23/24/19'>Isa. 24:19</a>",
      "comment": "Earthquakes often symbolize divine judgment in the Old Testament. The motif of healing points to the sacraments as means of grace by which the Church dispenses God's healing (see <a href='/AIV/59/5/14-15'>James 5:14-15</a>)."
    },
    {
      "pk": 20060603,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 3,
      "text": "You have shown your people harsh things; you have made us drink the wine of staggering.",
      "links": "<a href='/AIV/23/51/17'>Isa. 51:17</a>; <a href='/AIV/19/75/8'>Ps. 75:8</a>",
      "comment": "Wine of judgment signifies God’s corrective discipline. The motif is echoed later at Gethsemane with Christ accepting the ‘cup’ (<a href='/AIV/40/26/39'>Matt. 26:39</a>)."
    },
    {
      "pk": 20060604,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 4,
      "text": "You have given a banner to those who fear you, that it may be displayed because of the truth.",
      "links": "<a href='/AIV/19/20/5'>Ps. 20:5</a>; <a href='/AIV/23/11/10-12'>Isa. 11:10-12</a>",
      "comment": "The ‘banner’ often symbolizes God’s deliverance and guidance of His people. In Catholic tradition, Mary is sometimes seen as a standard or sign (cf. Rev. 12:1–2), but Christ Himself is ultimately the true banner who is lifted up (Jn. 12:32)."
    },
    {
      "pk": 20060605,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 5,
      "text": "That your beloved ones may be delivered, save by your right hand and answer us.",
      "links": "<a href='/AIV/19/17/7'>Ps. 17:7</a>; <a href='/AIV/19/108/6'>Ps. 108:6</a>",
      "comment": "God’s ‘right hand’ is a symbol of His power to save. This phrase is repeatedly used in scripture for divine intervention—with Christ, seated at the right hand of God (Acts 2:33), fulfilling this hope."
    },
    {
      "pk": 20060606,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 6,
      "text": "God has spoken in his holiness: 'I will exult; I will divide Shechem and measure out the Valley of Succoth.'",
      "links": "<a href='/AIV/19/108/7'>Ps. 108:7</a>; <a href='/AIV/06/17/7'>Josh. 17:7'>Josh. 17:7</a>",
      "comment": "God’s sovereign control over the land is emphasized. The division of territory also symbolizes, in Catholic understanding, Christ’s authority to establish his Church’s domain on earth (<a href='/AIV/40/16/18-19'>Matt. 16:18–19</a>)."
    },
    {
      "pk": 20060607,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 7,
      "text": "Gilead is mine; Manasseh is mine; Ephraim is my helmet, Judah is my scepter.",
      "links": "<a href='/AIV/19/108/8'>Ps. 108:8</a>; <a href='/AIV/01/49/10'>Gen. 49:10</a>",
      "comment": "Judah as ‘scepter’ anticipates the messianic promise (Gen. 49:10), fulfilled in Jesus Christ. The reference supports both the Jewish and Christian belief in a coming ruler from Judah’s line."
    },
    {
      "pk": 20060608,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 8,
      "text": "Moab is my washbasin; on Edom I throw my sandal; over Philistia I shout in triumph.",
      "links": "<a href='/AIV/19/108/9'>Ps. 108:9</a>; <a href='/AIV/04/24/17-18'>Num. 24:17-18</a>",
      "comment": "These nations symbolize opposition to God's people, yet are depicted as under God’s authority. In the spiritual sense, Catholic doctrine affirms that Christ’s universal kingship ultimately brings all nations under his lordship."
    },
    {
      "pk": 20060609,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 9,
      "text": "Who will bring me to the fortified city? Who will lead me to Edom?",
      "links": "<a href='/AIV/19/108/10'>Ps. 108:10</a>; <a href='/AIV/04/20/20-21'>Num. 20:20-21</a>",
      "comment": "David’s reliance on God for victory implies that, on a deeper level, victory in the spiritual life is granted through grace rather than human effort—a truth underlying both Protestant and Catholic theology, though Catholics emphasize continued cooperation with grace."
    },
    {
      "pk": 20060610,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 10,
      "text": "Have you not rejected us, O God? You do not go out with our armies.",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/07/6/13'>Judg. 6:13</a>",
      "comment": "God’s apparent absence is lamented. This sense of divine withdrawal has parallels in the experience of Christ’s abandonment on the cross (<a href='/AIV/40/27/46'>Matt. 27:46</a>)."
    },
    {
      "pk": 20060611,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 11,
      "text": "Give us help against the enemy, for the help of man is worthless.",
      "links": "<a href='/AIV/19/33/16'>Ps. 33:16</a>; <a href='/AIV/24/17/5'>Jer. 17:5</a>",
      "comment": "Reliance on God alone is essential. In Catholic doctrine, the saints intercede, yet all true help and victory are ultimately from God. The insufficiency of human strength subtly supports the need for divine assistance, as articulated through the sacraments."
    },
    {
      "pk": 20060612,
      "translation": "AIV",
      "book": 19,
      "chapter": 60,
      "verse": 12,
      "text": "With God we will do valiantly; he will tread down our enemies.",
      "links": "<a href='/AIV/05/33/27-29'>Deut. 33:27-29</a>; <a href='/AIV/19/44/5'>Ps. 44:5</a>",
      "comment": "The final victory belongs to God. In Catholic teaching, the Church, as the Body of Christ, shares in Christ’s victory. This triumph is not just temporal but spiritual, pointing toward ultimate triumph over evil (Rom. 16:20)."
    }
  ],
  "translatedAt": "2025-12-22T21:38:55.539Z"
}