{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 112,
  "verses": [
    {
      "pk": 1934012,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 1,
      "text": "Praise the LORD! Blessed is the man who fears the LORD, who greatly delights in His commandments.",
      "links": "<a href='/AIV/19/128/1'>Ps. 128:1</a>; <a href='/AIV/19/1/2'>Ps. 1:2</a>",
      "comment": "This opening exclamation is common in the Psalms, recognizing the holiness of God. 'Fears the LORD' here denotes reverence rather than terror, and 'delights in His commandments' highlights obedience as a sign of love for God, echoing Jesus’ teaching in John 14:15. The emphasis on commandments anticipates Jesus as the fulfillment of the law."
    },
    {
      "pk": 1934013,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 2,
      "text": "His offspring will be mighty in the land; the generation of the upright will be blessed.",
      "links": "<a href='/AIV/19/25/13'>Ps. 25:13</a>; <a href='/AIV/20/20/7'>Prov. 20:7</a>",
      "comment": "The blessing upon descendants for faithfulness calls to mind God’s promises to Abraham (Genesis 12:2-3). The uprightness required, then, is a fidelity to God’s covenant, perpetuated across generations in both faith and practice."
    },
    {
      "pk": 1934014,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 3,
      "text": "Wealth and riches are in his house, and his righteousness endures forever.",
      "links": "<a href='/AIV/19/37/29'>Ps. 37:29</a>; <a href='/AIV/19/111/3'>Ps. 111:3</a>",
      "comment": "Material blessing is intertwined with spiritual integrity. The eternal nature of righteousness connects with the New Testament theme of salvation and enduring sanctification, as seen in Romans 6:22."
    },
    {
      "pk": 1934015,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 4,
      "text": "Light rises in the darkness for the upright; he is gracious, merciful, and righteous.",
      "links": "<a href='/AIV/19/97/11'>Ps. 97:11</a>; <a href='/AIV/42/1/78-79'>Luke 1:78-79</a>",
      "comment": "Light represents God’s guidance and presence, a theme fulfilled in Christ as the 'light of the world' (John 8:12). The triad of graciousness, mercy, and righteousness reveals the character God desires in His people, modeled perfectly by Christ."
    },
    {
      "pk": 1934016,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 5,
      "text": "It is good for the man who deals generously and lends; he conducts his affairs with justice.",
      "links": "<a href='/AIV/19/37/26'>Ps. 37:26</a>; <a href='/AIV/40/5/42'>Matt. 5:42</a>",
      "comment": "Generosity and justice underscore a call to charity, reflecting the biblical tradition of caring for the poor and needy. Jesus’ teachings (Matthew 5:42) radicalize this charity, shaping Christian social ethics and stewardship."
    },
    {
      "pk": 1934017,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 6,
      "text": "Surely the righteous will never be shaken; he will be remembered forever.",
      "links": "<a href='/AIV/19/125/1'>Ps. 125:1</a>; <a href='/AIV/19/37/28'>Ps. 37:28</a>",
      "comment": "Ultimate security is found in righteousness. The theme of eternal remembrance points toward the Christian hope of resurrection and the communion of saints, as God’s faithful are eternally preserved."
    },
    {
      "pk": 1934018,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 7,
      "text": "He is not afraid of bad news; his heart is firm, trusting in the LORD.",
      "links": "<a href='/AIV/19/62/8'>Ps. 62:8</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "Faith removes fear, building fortitude amid life's trials. This virtue is often seen as a spiritual gift, tied to the peace Christ promises in John 14:27."
    },
    {
      "pk": 1934019,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 8,
      "text": "His heart is steady; he will not fear, until he looks in triumph on his adversaries.",
      "links": "<a href='/AIV/19/27/6'>Ps. 27:6</a>; <a href='/AIV/19/91/8'>Ps. 91:8</a>",
      "comment": "The steadfastness of heart is a sign of the Spirit working in believers, foreshadowing Christ's victory over evil. The triumph recalls the vindication and justice that believers will experience ultimately in Christ (Revelation 21:7)."
    },
    {
      "pk": 1934020,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 9,
      "text": "He has distributed freely; he has given to the poor; his righteousness endures forever. His horn will be exalted in honor.",
      "links": "<a href='/AIV/19/111/3'>Ps. 111:3</a>; <a href='/AIV/47/9/9'>2 Cor. 9:9</a>; <a href='/AIV/42/1/52'>Luke 1:52'</a>",
      "comment": "Freely giving echoes God’s love expressed through action, with a spiritual and corporal generosity. The enduring righteousness and exalted horn (symbol of strength and honor) find their fulfillment in Christ, who raises up the humble (Luke 1:52)."
    },
    {
      "pk": 1934021,
      "translation": "AIV",
      "book": 19,
      "chapter": 112,
      "verse": 10,
      "text": "The wicked man will see it and be angry; he will gnash his teeth and melt away; the desire of the wicked will come to nothing.",
      "links": "<a href='/AIV/19/35/16'>Ps. 35:16</a>; <a href='/AIV/42/13/28'>Luke 13:28</a>",
      "comment": "The final verse contrasts the fate of the wicked with the triumph of the righteous. 'Gnashing of teeth' is a phrase Jesus often uses to describe judgment (Luke 13:28), highlighting the consequence of rejecting God’s commands."
    }
  ],
  "translatedAt": "2025-12-23T05:42:20.258Z"
}