{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 29,
  "verses": [
    {
      "pk": 1932921,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 1,
      "text": "Ascribe to the LORD, O sons of God, ascribe to the LORD glory and strength.",
      "links": "<a href='/AIV/96/1/6'>1 Chr. 16:28–29</a>; <a href='/AIV/19/89/6'>Ps. 89:6</a>",
      "comment": "The phrase 'sons of God' (Hebrew: 'bene elim') may refer to angelic beings, indicating that even the heavenly hosts recognize God's glory. The Catholic tradition reads this as a sign of the communion of saints and angels with God, echoing the heavenly liturgy (cf. Rev. 4:8–11)."
    },
    {
      "pk": 1932922,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 2,
      "text": "Ascribe to the LORD the glory due His name; worship the LORD in the splendor of holiness.",
      "links": "<a href='/AIV/19/96/8-9'>Ps. 96:8–9</a>; <a href='/AIV/19/110/3'>Ps. 110:3</a>",
      "comment": "The call to worship in holiness points to liturgical worship rooted in sanctity. The Catholic faith emphasizes the sacredness and reverence owed to God, as seen in sacramental worship and the Mass."
    },
    {
      "pk": 1932923,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 3,
      "text": "The voice of the LORD is over the waters; the God of glory thunders, the LORD, over many waters.",
      "links": "<a href='/AIV/19/18/13'>Ps. 18:13</a>; <a href='/AIV/01/1/2'>Gen. 1:2</a>; <a href='/AIV/40/3/16-17'>Matt. 3:16–17</a>",
      "comment": "God’s voice over the waters recalls creation and the baptism of Jesus, where the Father speaks from heaven. In Catholic thought, water symbolizes both creation and sacramental rebirth through baptism."
    },
    {
      "pk": 1932924,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 4,
      "text": "The voice of the LORD is powerful; the voice of the LORD is full of majesty.",
      "links": "<a href='/AIV/19/68/33'>Ps. 68:33</a>; <a href='/AIV/19/33/9'>Ps. 33:9</a>",
      "comment": "God's word accomplishes great things. This foreshadows Christ, the Word made flesh (John 1:1–14), and the effective power in the sacraments where God's word is active."
    },
    {
      "pk": 1932925,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 5,
      "text": "The voice of the LORD breaks the cedars; the LORD shatters the cedars of Lebanon.",
      "links": "<a href='/AIV/19/104/16'>Ps. 104:16</a>; <a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "Lebanon’s cedars symbolize strength and pride; God’s authority surpasses earthly powers. Catholic theology teaches humility before God, and that reliance on our own strength must yield to His sovereignty."
    },
    {
      "pk": 1932926,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 6,
      "text": "He makes them leap like a calf; Lebanon and Sirion like a young wild ox.",
      "links": "<a href='/AIV/05/3/9'>Deut. 3:9</a>; <a href='/AIV/19/114/4'>Ps. 114:4</a>",
      "comment": "The imagery of creation obeying God’s command is both literal and spiritual; the Catholic tradition sees in this the joy and freedom that comes from divine grace."
    },
    {
      "pk": 1932927,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 7,
      "text": "The voice of the LORD flashes forth flames of fire.",
      "links": "<a href='/AIV/19/18/13'>Ps. 18:13</a>; <a href='/AIV/19/97/4'>Ps. 97:4</a>; <a href='/AIV/44/2/3'>Acts 2:3</a>",
      "comment": "Fire is often a symbol for the presence and purification by the Holy Spirit (cf. Pentecost). The Catholic Church teaches that the Spirit is given in fullness—especially through Confirmation and the sacraments."
    },
    {
      "pk": 1932928,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 8,
      "text": "The voice of the LORD shakes the wilderness; the LORD shakes the wilderness of Kadesh.",
      "links": "<a href='/AIV/04/13/26'>Num. 13:26</a>; <a href='/AIV/19/77/16-18'>Ps. 77:16–18</a>",
      "comment": "God’s power reaches even the most desolate places. Catholic interpretation often sees wilderness as a symbol of spiritual testing and renewal, reminiscent of Christ’s temptation in the wilderness (Matt. 4:1–11)."
    },
    {
      "pk": 1932929,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 9,
      "text": "The voice of the LORD makes the deer give birth and strips the forests bare, and in His temple all cry, 'Glory!'",
      "links": "<a href='/AIV/18/39/1-2'>Job 39:1–2</a>; <a href='/AIV/19/24/7'>Ps. 24:7</a>; <a href='/AIV/19/148/13'>Ps. 148:13</a>",
      "comment": "The universal response in God's temple highlights liturgical worship. The Catholic tradition sees this as the pattern for heavenly worship and the Mass, where all creation glorifies God together."
    },
    {
      "pk": 1932930,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 10,
      "text": "The LORD sits enthroned over the flood; the LORD sits enthroned as King forever.",
      "links": "<a href='/AIV/19/93/2-4'>Ps. 93:2–4</a>; <a href='/AIV/01/7/17'>Gen. 7:17</a>; <a href='/AIV/22/4/2'>Rev. 4:2</a>",
      "comment": "God’s kingship is eternal, emphasizing both His sovereignty and His role as judge. Catholic doctrine teaches Christ’s reign through the Church and His final kingship at the end of time."
    },
    {
      "pk": 1932931,
      "translation": "AIV",
      "book": 19,
      "chapter": 29,
      "verse": 11,
      "text": "The LORD gives strength to His people; the LORD blesses His people with peace.",
      "links": "<a href='/AIV/19/28/8'>Ps. 28:8-9</a>; <a href='/AIV/19/85/8'>Ps. 85:8</a>; <a href='/AIV/43/14/27'>John 14:27</a>",
      "comment": "God’s people are strengthened and given peace—a promise fulfilled in Christ. The Catholic Church sees its role as a means of grace and peace dispensed through the sacraments and communion with Christ. Spiritual and literal peace culminate in Christ’s Paschal mystery, present in each Eucharist."
    }
  ],
  "translatedAt": "2025-12-22T21:29:08.566Z"
}