{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 93,
  "verses": [
    {
      "pk": 2009301,
      "translation": "AIV",
      "book": 19,
      "chapter": 93,
      "verse": 1,
      "text": "The LORD reigns; He is clothed in majesty. The LORD is robed, He has put on strength as a belt. The world is established; it will never be moved.",
      "links": "<a href='/AIV/19/96/10'>Ps. 96:10</a>; <a href='/AIV/19/104/1-2'>Ps. 104:1-2</a>",
      "comment": "The declaration that the LORD reigns affirms the eternal kingship and rule of God. 'Clothed in majesty' emphasizes God's sovereign power and royal dignity—an image commonly drawn upon also in the language of worship and liturgy, connecting to Hebrews 1:3 about Christ's radiance and divine nature, regularly affirmed in historic Christian tradition."
    },
    {
      "pk": 2009302,
      "translation": "AIV",
      "book": 19,
      "chapter": 93,
      "verse": 2,
      "text": "Your throne is established from long ago; You are from everlasting.",
      "links": "<a href='/AIV/19/90/2'>Ps. 90:2</a>; <a href='/AIV/19/45/6'>Ps. 45:6</a>",
      "comment": "God's throne is eternal, confirming His unchanging nature ('from everlasting'), which subtly points toward the doctrine of God's timelessness and the perpetual nature of His covenant and kingdom, echoed in Daniel 7:14 and Revelation 1:8. The recognition of God as everlasting ultimately points ahead toward the eternal reign of Christ, emphasizing unity with historic, sacramental Christianity."
    },
    {
      "pk": 2009303,
      "translation": "AIV",
      "book": 19,
      "chapter": 93,
      "verse": 3,
      "text": "The floods have lifted up, O LORD, the floods have lifted up their voice; the floods lift up their roaring.",
      "links": "<a href='/AIV/19/29/3'>Ps. 29:3</a>; <a href='/AIV/18/38/11'>Job 38:11</a>",
      "comment": "Here, the 'floods' symbolically represent chaotic powers or opposition on earth. God's sovereignty over these tumultuous forces recalls the Genesis creation narrative and shows that nothing can overthrow God's established order—an image often linked to Christ calming the storm (<a href='/AIV/41/4/39'>Mark 4:39</a>), foreshadowing Christ’s divinity and His authority over nature."
    },
    {
      "pk": 2009304,
      "translation": "AIV",
      "book": 19,
      "chapter": 93,
      "verse": 4,
      "text": "Mightier than the thunders of many waters, mightier than the waves of the sea, the LORD on high is mighty.",
      "links": "<a href='/AIV/19/65/7'>Ps. 65:7</a>; <a href='/AIV/19/89/9'>Ps. 89:9</a>",
      "comment": "God's supremacy over nature, portrayed in the metaphor of waters and waves, resonates with Catholic theological tradition stressing God’s transcendence and power. Christians see in this verse a type of Christ who, by His divine authority, brings peace—again reinforced in the miracle of calming the storm (<a href='/AIV/40/8/27'>Matt 8:27</a>)."
    },
    {
      "pk": 2009305,
      "translation": "AIV",
      "book": 19,
      "chapter": 93,
      "verse": 5,
      "text": "Your testimonies are very trustworthy; holiness befits Your house, O LORD, forever.",
      "links": "<a href='/AIV/19/119/138'>Ps. 119:138</a>; <a href='/AIV/19/47/8'>Ps. 47:8</a>; <a href='/AIV/19/15/1'>Ps. 15:1</a>",
      "comment": "God’s reliable 'testimonies' echo the enduring nature of His word and promises, paralleling John 17:17 (‘Your word is truth’). 'Holiness befits Your house' hints at the sanctity of sacred space—understood in Catholic tradition as the Church, the body of Christ and temple of the Holy Spirit. Protestant emphasis on spiritual worship is complemented here by the visible, sacramental presence of God in His house, a subtle affirmation of continuity with historic apostolic Christianity."
    }
  ],
  "translatedAt": "2025-12-22T21:49:29.146Z"
}