{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 67,
  "verses": [
    {
      "pk": 671001,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 1,
      "text": "May God be gracious to us and bless us; may He make His face shine upon us. Selah",
      "links": "<a href='/AIV/4/6/24-26'>Numbers 6:24–26</a>; <a href='/AIV/80/1/2'>1 Timothy 1:2</a>",
      "comment": "This verse echoes the Aaronic blessing, highlighting God's grace and the gift of His presence. The invocation for God’s face to shine upon us is a plea for divine favor, often spiritually interpreted as pointing towards God’s ongoing blessing through the sacraments."
    },
    {
      "pk": 671002,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 2,
      "text": "That Your way may be known on earth, Your salvation among all nations.",
      "links": "<a href='/AIV/66/7/9'>Revelation 7:9</a>; <a href='/AIV/19/98/2-3'>Psalm 98:2–3</a>; <a href='/AIV/23/49/6'>Isaiah 49:6</a>",
      "comment": "God’s blessing equips His people to be witnesses to the world. The reference to 'all nations' hints at the universality of His salvation, fulfilled in Christ and communicated through the Church (see Matt 28:19), a continuing mission in the catholic (universal) sense."
    },
    {
      "pk": 671003,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 3,
      "text": "Let the peoples praise You, O God; let all the peoples praise You.",
      "links": "<a href='/AIV/19/117/1'>Psalm 117:1</a>; <a href='/AIV/45/15/9-11'>Romans 15:9–11</a>",
      "comment": "'Peoples' is plural, stressing the desire for worldwide worship, a major theme of both the Old and New Testaments, and fulfilled as the Church gathers all people into one faith. This anticipates the worship described in Revelation 7:9–10."
    },
    {
      "pk": 671004,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 4,
      "text": "Let the nations rejoice and be glad, for You judge the peoples with fairness and guide the nations upon the earth. Selah",
      "links": "<a href='/AIV/19/96/10'>Psalm 96:10</a>; <a href='/AIV/19/9/8'>Psalm 9:8</a>",
      "comment": "God's just rule is a cause for the joy of the nations. The concept of God as judge points toward the final judgment (Matt 25:31–32), and spiritually anticipates Christ's kingship and the Church's mission to teach and guide."
    },
    {
      "pk": 671005,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 5,
      "text": "Let the peoples praise You, O God; let all the peoples praise You.",
      "links": "<a href='/AIV/19/67/3'>Psalm 67:3</a>",
      "comment": "This refrain repeats for emphasis, encouraging universal praise—fulfilled through the international unity seen beginning at Pentecost (Acts 2:5-11), continuing in the catholic Church’s worldwide liturgy."
    },
    {
      "pk": 671006,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 6,
      "text": "The earth has yielded its harvest; God, our God, blesses us.",
      "links": "<a href='/AIV/19/85/12'>Psalm 85:12</a>; <a href='/AIV/3/26/4'>Leviticus 26:4</a>",
      "comment": "The material blessing of the land anticipates spiritual blessings. Some Church Fathers saw the 'harvest' as a type of the Eucharist, the fruit of the earth transformed into a blessing that feeds God’s people (John 6:33)."
    },
    {
      "pk": 671007,
      "translation": "AIV",
      "book": 19,
      "chapter": 67,
      "verse": 7,
      "text": "May God continue to bless us; let all the ends of the earth fear Him.",
      "links": "<a href='/AIV/19/22/27'>Psalm 22:27</a>; <a href='/AIV/23/45/22'>Isaiah 45:22</a>; <a href='/AIV/44/13/47'>Acts 13:47</a>",
      "comment": "The psalm ends with a prayer for ongoing blessing and reverence. The call for 'all the ends of the earth' points to the universal call to salvation, fulfilled by Christ and extended through the Church. In Catholic theology, this continual blessing is most perfectly fulfilled in the sacraments, which draw the nations to God."
    }
  ],
  "translatedAt": "2025-12-22T21:40:39.465Z"
}