{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 10,
  "verses": [
    {
      "pk": 23010001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 1,
      "text": "Why, O LORD, do you stand far off? Why do you hide yourself in times of trouble?",
      "links": "<a href='/AIV/18/13/24'>Job 13:24</a>; <a href='/AIV/23/44/24'>Is. 44:24</a>",
      "comment": "The Psalmist begins with a heartfelt question, expressing confusion at God's seeming distance during suffering. This is a common theme in Scripture, highlighting the mystery of God's timing and presence (see also Ps. 22:1). Such honest prayer affirms that it's permissible to bring deep feelings before God."
    },
    {
      "pk": 23010002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 2,
      "text": "In arrogance, the wicked pursue the afflicted; let them be caught in the schemes they have devised.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/19/35/8'>Ps. 35:8</a>",
      "comment": "The Psalm calls for justice, asking that the wicked fall into their own traps. Theologically, this echoes the biblical principle of reaping what one sows (Gal. 6:7). Judgment and mercy are integral to God’s providence."
    },
    {
      "pk": 23010003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 3,
      "text": "For the wicked boasts of the desires of his soul, and the greedy man curses and despises the LORD.",
      "links": "<a href='/AIV/19/49/6'>Ps. 49:6</a>; <a href='/AIV/19/52/1'>Ps. 52:1</a>",
      "comment": "Greed and pride separate a person from God, reflecting the spiritual danger of disordered desires (cf. Jas. 4:6). This verse points to the need for inner transformation—a central Christian theme."
    },
    {
      "pk": 23010004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 4,
      "text": "In the pride of his face the wicked does not seek Him; all his thoughts are, 'There is no God.'",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "This verse exposes the heart condition that leads to practical atheism—living as if God does not exist. Pride blinds the heart to God’s presence and law, a universal warning seen throughout Scripture."
    },
    {
      "pk": 23010005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 5,
      "text": "His ways prosper at all times; your judgments are far above, out of his sight; as for all his foes, he sneers at them.",
      "links": "<a href='/AIV/19/73/3'>Ps. 73:3</a>; <a href='/AIV/35/1/13'>Hab. 1:13</a>",
      "comment": "It often appears that the wicked prosper unchecked—this theme recurs in wisdom literature. This confusion about God's justice invites deeper faith in His ultimate judgment and providence (see Ps. 73)."
    },
    {
      "pk": 23010006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 6,
      "text": "He says in his heart, 'I shall not be moved; throughout all generations I shall not meet adversity.'",
      "links": "<a href='/AIV/19/49/11'>Ps. 49:11</a>; <a href='/AIV/19/30/6'>Ps. 30:6-7</a>",
      "comment": "False security is a temptation for the arrogant. The phrase 'I shall not be moved' contrasts with the call to humility found elsewhere (cf. Prov. 16:18)."
    },
    {
      "pk": 23010007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 7,
      "text": "His mouth is filled with cursing, deceit, and oppression; under his tongue are mischief and iniquity.",
      "links": "<a href='/AIV/19/36/3'>Ps. 36:3</a>; <a href='/AIV/45/3/14'>Rom. 3:14</a>",
      "comment": "This verse is cited by Paul in Romans 3:14 to show the universality of human sinfulness. The description of the tongue aligns with warnings in James 3:6–10 about the destructive power of words."
    },
    {
      "pk": 23010008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 8,
      "text": "He sits in ambush in the villages; in hiding places he murders the innocent. His eyes stealthily watch for the helpless.",
      "links": "<a href='/AIV/19/17/11'>Ps. 17:11</a>; <a href='/AIV/20/1/11'>Prov. 1:11</a>",
      "comment": "The crafty violence of the wicked contrasts with God’s call to justice. This verse emphasizes the need for righteous protection of the vulnerable—a concern seen throughout the Bible (cf. Jas. 1:27)."
    },
    {
      "pk": 23010009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 9,
      "text": "He lurks in secret like a lion in his den; he lurks that he may seize the poor; he seizes the poor when he draws him into his net.",
      "links": "<a href='/AIV/19/17/12'>Ps. 17:12</a>; <a href='/AIV/19/35/7'>Ps. 35:7</a>",
      "comment": "Imagery of a lion provides a prophetic connection to evil oppressors—and ultimately to the adversary of souls (cf. 1 Pet. 5:8). Yet, God’s deliverance remains a central hope."
    },
    {
      "pk": 23010010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 10,
      "text": "The helpless are crushed, sink down, and fall by his might.",
      "links": "<a href='/AIV/19/9/9'>Ps. 9:9</a>; <a href='/AIV/23/1/17'>Is. 1:17</a>",
      "comment": "Evil’s power seems overwhelming at times, but the Bible repeatedly affirms God’s commitment to defend and uplift the oppressed (see Lk. 4:18)."
    },
    {
      "pk": 23010011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 11,
      "text": "He says in his heart, 'God has forgotten. He hides his face; he will never see it.'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>; <a href='/AIV/19/73/11'>Ps. 73:11</a>",
      "comment": "The wicked delude themselves that God is inattentive. Scripture everywhere testifies that God never abandons His people or overlooks injustice."
    },
    {
      "pk": 23010012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 12,
      "text": "Arise, O LORD! O God, lift up your hand; do not forget the afflicted.",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/74/22'>Ps. 74:22</a>",
      "comment": "The Psalmist calls upon God to act, expressing faith that prayer moves the Lord to compassion and action. The belief that God hears and responds is foundational for Christian prayer life, and points to the mediating role found in intercessory prayer."
    },
    {
      "pk": 23010013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 13,
      "text": "Why does the wicked despise God, and say in his heart, 'You will not call to account'?",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/35/1/13'>Hab. 1:13</a>",
      "comment": "The Psalmist again challenges the blindness of the wicked, pointing rhetorically to the certainty of future judgment—a truth fulfilled and clarified in the teachings of Jesus (Mt. 25:31-46)."
    },
    {
      "pk": 23010014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 14,
      "text": "But you do see, for you note mischief and vexation, that you may take it into your hands; the helpless commits himself to you; you are the helper of the fatherless.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/19/146/9'>Ps. 146:9</a>",
      "comment": "God’s care for the helpless and orphans is a constant theme, reflecting His character and calling God’s people to mirror His compassion (Jas. 1:27)."
    },
    {
      "pk": 23010015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 15,
      "text": "Break the arm of the wicked and the evildoer; call him to account for his wickedness till you find none.",
      "links": "<a href='/AIV/19/37/17'>Ps. 37:17</a>; <a href='/AIV/19/94/23'>Ps. 94:23</a>",
      "comment": "The 'arm' symbolizes strength; to break it means to strip the wicked of their power (cf. Luke 1:51). The plea for complete justice anticipates God’s ultimate victory over evil."
    },
    {
      "pk": 23010016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 16,
      "text": "The LORD is King forever and ever; the nations will perish from his land.",
      "links": "<a href='/AIV/19/29/10'>Ps. 29:10</a>; <a href='/AIV/19/146/10'>Ps. 146:10</a>",
      "comment": "God’s eternal kingship is declared here. The connection between the Lord’s rule and the nations prepares the way for messianic expectation—a theme fulfilled in the coming of Christ, the true King (see Rev. 11:15)."
    },
    {
      "pk": 23010017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 17,
      "text": "O LORD, you hear the desire of the humble; you will strengthen their heart; you will incline your ear",
      "links": "<a href='/AIV/19/34/18'>Ps. 34:18</a>; <a href='/AIV/19/145/19'>Ps. 145:19</a>",
      "comment": "The importance of humility is highlighted—God hears the lowly and grants them strength. Spiritual tradition consistently affirms the prayer and faith of the humble as especially pleasing to God."
    },
    {
      "pk": 23010018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 10,
      "verse": 18,
      "text": "to do justice for the fatherless and the oppressed, so that man who is of the earth may terrify no more.",
      "links": "<a href='/AIV/19/82/3'>Ps. 82:3</a>; <a href='/AIV/23/11/4'>Is. 11:4</a>",
      "comment": "God’s justice culminates in defending the most vulnerable. This role of divine justice connects to the mission of Christ and the call for believers to engage in works of mercy and justice—a mark of a holy community."
    }
  ],
  "translatedAt": "2025-12-24T06:02:04.140Z"
}