{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 75,
  "verses": [
    {
      "pk": 23075001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 1,
      "text": "We give thanks to you, God; we give thanks, for your name is near. People declare your wondrous deeds.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/19/145/18'>Ps. 145:18</a>",
      "comment": "The psalm opens with a prayer of gratitude, focusing on God's proximity and mighty works. The nearness of God's name recalls His covenantal faithfulness and presence amongst His people, which forms the foundation for public worship and testimony. Spiritual interpretation sees Christ as the fullest revelation of God's nearness (John 1:14; Matthew 1:23)."
    },
    {
      "pk": 23075002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 2,
      "text": "\"When I choose the appointed time, I will judge with fairness.\"",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>; <a href='/AIV/46/4/5'>1 Cor. 4:5</a>",
      "comment": "God speaks, promising a just judgment at the time He determines. This points toward the final judgment and divine sovereignty, echoing themes throughout Scripture. Christologically, this foreshadows Christ as the righteous Judge (Acts 17:31; John 5:22), who will come at an appointed time."
    },
    {
      "pk": 23075003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 3,
      "text": "\"When the earth and all its inhabitants shake, it is I who hold its pillars firm.\"",
      "links": "<a href='/AIV/19/46/2-3'>Ps. 46:2-3</a>; <a href='/AIV/19/104/5'>Ps. 104:5</a>",
      "comment": "God upholds creation even in times of chaos. The image of pillars connects with God's sustaining power, not only of the physical world but also of the moral order. Spiritually, this hints at the Church as upheld by God's hand through trials, and Christ as the cornerstone (Ephesians 2:20)."
    },
    {
      "pk": 23075004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 4,
      "text": "\"I say to the arrogant, 'Do not boast,' and to the wicked, 'Do not lift up your horn.'\"",
      "links": "<a href='/AIV/19/94/4'>Ps. 94:4</a>; <a href='/AIV/42/1/51-52'>Luke 1:51-52</a>",
      "comment": "The 'horn' symbolizes pride and power. This warning highlights God's opposition to proud self-exaltation. In the New Testament, Mary’s Magnificat echoes the theme of God humbling the powerful and lifting the lowly."
    },
    {
      "pk": 23075005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 5,
      "text": "\"Do not lift up your horn on high, or speak with arrogance from your neck.\"",
      "links": "<a href='/AIV/19/31/18'>Ps. 31:18</a>; <a href='/AIV/20/8/13'>Prov. 8:13</a>",
      "comment": "Further condemnation of pride and boastfulness, depicting it as rebellion against God's authority. Spiritual interpretation encourages humility, an essential virtue modeled uniquely in the life of Christ and promoted by apostolic tradition."
    },
    {
      "pk": 23075006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 6,
      "text": "For exaltation comes neither from the east nor from the west nor from the wilderness;",
      "links": "<a href='/AIV/19/113/7-8'>Ps. 113:7-8</a>; <a href='/AIV/20/29/23'>Prov. 29:23</a>",
      "comment": "True promotion and authority are determined by God alone, not by human effort or geographical advantage. This stresses divine sovereignty in elevating His servants, consistent with Christ’s teaching that humble service leads to true greatness (Matthew 23:11-12)."
    },
    {
      "pk": 23075007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 7,
      "text": "but God is the Judge; He brings down one and lifts up another.",
      "links": "<a href='/AIV/19/75/2'>Ps. 75:2</a>; <a href='/AIV/42/18/14'>Luke 18:14</a>",
      "comment": "God is depicted as the final Judge, responsible for humbling and exalting. The spiritual meaning points toward the biblical vision of a divinely ordered community, with authority rooted in God’s will. Christ, as the appointed Judge, fulfills this role perfectly (John 5:27)."
    },
    {
      "pk": 23075008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 8,
      "text": "For in the hand of the Lord is a cup, foaming with wine, richly blended; He pours it out, and all the wicked of the earth must drink it, draining it to the dregs.",
      "links": "<a href='/AIV/19/60/3'>Ps. 60:3</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>",
      "comment": "The 'cup' symbolizes divine wrath and judgment. Jesus Himself refers to the cup of suffering and judgment He accepts in Gethsemane, connecting this passage to His Passion where He bears the judgment for humanity. The cup imagery is later infused with deeper sacramental meaning in the New Testament."
    },
    {
      "pk": 23075009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 9,
      "text": "But as for me, I will declare this forever; I will sing praise to the God of Jacob.",
      "links": "<a href='/AIV/19/146/2'>Ps. 146:2</a>; <a href='/AIV/19/77/13'>Ps. 77:13</a>",
      "comment": "In contrast to the fate of the wicked, the psalmist commits to perpetual praise, focusing on the faithfulness of God to Jacob. The reference encapsulates the continuity of God's promises, inviting the faithful to join in perpetual worship rooted in the covenant."
    },
    {
      "pk": 23075010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 75,
      "verse": 10,
      "text": "All the horns of the wicked I will cut off, but the horns of the righteous will be lifted up.",
      "links": "<a href='/AIV/19/92/10'>Ps. 92:10</a>; <a href='/AIV/19/148/14'>Ps. 148:14</a>",
      "comment": "Horns symbolize power; God promises to remove the strength of the wicked but to exalt the righteous. This foreshadows ultimate vindication for the faithful, fulfilled in Christ’s victory and in the establishment of a community where holiness is celebrated and protected. The righteous are those who live in covenant relationship, supported by sacramental grace and faithful worship."
    }
  ],
  "translatedAt": "2025-12-24T06:25:05.404Z"
}