{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 65,
  "verses": [
    {
      "pk": 1965065,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 1,
      "text": "Praise awaits you, O God, in Zion; and to you vows will be fulfilled.",
      "links": "<a href='/AIV/19/66/13'>Ps. 66:13</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>",
      "comment": "Zion here represents the dwelling place of God and points forward to the Church as the spiritual Zion (Heb. 12:22). The mention of vows aligns with Old Testament sacrificial practices, prefiguring the fulfillment of offerings in Christ and the Eucharist."
    },
    {
      "pk": 1965066,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 2,
      "text": "O you who hear prayer, to you all flesh will come.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/23/56/7'>Isa. 56:7</a>",
      "comment": "God is depicted as the universal receiver of prayer, which Catholic theology understands as the Church's invitation to all people (cf. 1 Tim. 2:4). ‘All flesh’ hints at the global ingathering in Christ (John 12:32)."
    },
    {
      "pk": 1965067,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 3,
      "text": "Iniquities overwhelm me; our transgressions— you atone for them.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>; <a href='/AIV/19/51/2'>Ps. 51:2</a>",
      "comment": "The psalmist acknowledges personal and communal sin, but trusts in God’s forgiveness. ‘Atone for them’ prefigures Christ’s sacrificial atonement and sacramental absolution, placing emphasis on God’s means of grace through concrete acts, prefiguring Confession (John 20:23)."
    },
    {
      "pk": 1965068,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 4,
      "text": "Blessed is the one you choose and bring near, to dwell in your courts! We will be satisfied with the goodness of your house, your holy temple.",
      "links": "<a href='/AIV/19/84/4'>Ps. 84:4</a>; <a href='/AIV/19/23/6'>Ps. 23:6</a>",
      "comment": "God’s initiative in choosing and drawing near recalls Catholic doctrine of grace and election. Satisfied ‘with the goodness of your house’ is an image of Eucharistic communion—the fullness of life in God’s presence (John 6:55)."
    },
    {
      "pk": 1965069,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 5,
      "text": "By awesome deeds in righteousness you answer us, O God of our salvation, the hope of all the ends of the earth and of the farthest seas.",
      "links": "<a href='/AIV/19/46/10'>Ps. 46:10</a>; <a href='/AIV/60/1/20'>1 Pet. 1:20</a>",
      "comment": "God’s salvation is both cosmic and particular. The hope for all nations foreshadows the Great Commission (Matt. 28:19), showing the Catholic Church's universality."
    },
    {
      "pk": 1965070,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 6,
      "text": "You establish the mountains by your strength, being girded with power.",
      "links": "<a href='/AIV/19/104/5'>Ps. 104:5</a>; <a href='/AIV/24/10/12'>Jer. 10:12</a>",
      "comment": "God’s creative power echoes Genesis 1 and underlines His sovereignty. The mountains symbolize stability, which in Catholic tradition is sometimes seen as a type for the Church’s unshaken foundation (Matt. 16:18)."
    },
    {
      "pk": 1965071,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 7,
      "text": "You quiet the roaring seas, the roaring of their waves, and the tumult of the peoples.",
      "links": "<a href='/AIV/19/89/9'>Ps. 89:9</a>; <a href='/AIV/40/8/26'>Matt. 8:26</a>",
      "comment": "This verse parallels Christ calming the storm (Matt. 8:26), subtly identifying the divine authority of Christ, which is a high Christological claim. The ‘waves’ symbolize chaos and nations, both of which God subdues."
    },
    {
      "pk": 1965072,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 8,
      "text": "Those who dwell at the ends of the earth are in awe at your signs; you make the dawn and the sunset shout for joy.",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>; <a href='/AIV/19/113/3'>Ps. 113:3</a>",
      "comment": "Creation itself worships God, prefiguring the universality of the Church’s call to worship. Catholic liturgy sees the rising and setting sun as moments sanctified by prayer—the Liturgy of the Hours."
    },
    {
      "pk": 1965073,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 9,
      "text": "You visit the earth and water it; you greatly enrich it; the river of God is full of water; you prepare their grain, for so you provide for the earth.",
      "links": "<a href='/AIV/19/104/13'>Ps. 104:13</a>; <a href='/AIV/23/55/10'>Isa. 55:10</a>",
      "comment": "God's providence in nature echoes sacramental themes—water as baptism, grain as Eucharist. The ‘river of God’ is a frequent image for grace flowing from God’s temple (Ezek. 47:1-12), fulfilled in Christ and the sacraments."
    },
    {
      "pk": 1965074,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 10,
      "text": "You drench its furrows and level its ridges; you soften it with showers and bless its growth.",
      "links": "<a href='/AIV/19/72/6'>Ps. 72:6</a>; <a href='/AIV/19/147/8'>Ps. 147:8</a>",
      "comment": "God’s nurturing of creation hints at His continual care for souls. The Catholic tradition sees spiritual growth as made possible through the sacraments and ongoing graces."
    },
    {
      "pk": 1965075,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 11,
      "text": "You crown the year with your bounty; your pathways overflow with abundance.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "Divine generosity is depicted as overflowing abundance, which Catholic tradition links to the lavishness of God’s grace in the life of the Church, especially in the sacramental economy."
    },
    {
      "pk": 1965076,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 12,
      "text": "The pastures of the wilderness overflow, and the hills are clothed with gladness.",
      "links": "<a href='/AIV/19/96/12'>Ps. 96:12</a>; <a href='/AIV/23/55/12'>Isa. 55:12</a>",
      "comment": "The transformation of wilderness into abundance echoes the renewal of the soul and the promises of new creation (Rev. 21:5). In Catholic tradition, this is a common motif for sanctification."
    },
    {
      "pk": 1965077,
      "translation": "AIV",
      "book": 19,
      "chapter": 65,
      "verse": 13,
      "text": "The meadows are covered with flocks, the valleys are decked with grain; they shout and sing for joy.",
      "links": "<a href='/AIV/19/98/4'>Ps. 98:4</a>; <a href='/AIV/19/100/1'>Ps. 100:1</a>",
      "comment": "Flocks and grain symbolize fullness and peace, a vision of eschatological joy. In Catholic theology, this prefigures the heavenly banquet and echoes celebration of the Eucharist, the sacrament of unity and thanksgiving."
    }
  ],
  "translatedAt": "2025-12-22T21:40:02.073Z"
}