{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 28,
  "verses": [
    {
      "pk": 23028001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 1,
      "text": "To you, O LORD, I call; my Rock, do not be silent to me. If you remain silent to me, I will become like those who go down to the pit.",
      "links": "<a href='/AIV/18/7/21'>Job 7:21</a>; <a href='/AIV/19/143/7'>Ps. 143:7</a>; <a href='/AIV/23/38/18'>Isa. 38:18</a>",
      "comment": "The psalmist addresses the LORD as 'my Rock', emphasizing trust and dependence. The 'pit' refers to Sheol, symbolizing spiritual death—a plea for God’s saving presence (see Ps. 143:7). The spiritual sense sees a foreshadowing of trust in God as the sole source of salvation."
    },
    {
      "pk": 23028002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 2,
      "text": "Hear the voice of my prayer when I cry to you for help, when I lift up my hands toward your holy sanctuary.",
      "links": "<a href='/AIV/19/5/7'>Ps. 5:7</a>; <a href='/AIV/19/134/2'>Ps. 134:2</a>",
      "comment": "'Sanctuary' refers to the temple, the place of God's true presence. Lifting hands is a posture of worship and supplication. In an allegorical sense, prayer directed toward the holy place points to God’s real presence among his people, prefiguring deeper realities fulfilled in Jesus and continued worship."
    },
    {
      "pk": 23028003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 3,
      "text": "Do not drag me away with the wicked, with those who do evil, who speak peace with their neighbors while evil is in their hearts.",
      "links": "<a href='/AIV/19/26/9-10'>Ps. 26:9-10</a>; <a href='/AIV/19/12/2'>Ps. 12:2</a>",
      "comment": "A prayer for distinction from the deceitful. The reference to hypocrisy highlights the need for genuine faith, not just outward words—an important principle in all authentic faith communities."
    },
    {
      "pk": 23028004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 4,
      "text": "Repay them according to their deeds and the evil of their actions; give them what their hands have done and bring upon them what they deserve.",
      "links": "<a href='/AIV/19/94/2'>Ps. 94:2</a>; <a href='/AIV/20/24/12'>Prov. 24:12</a>",
      "comment": "This plea for justice reflects God’s role as the righteous Judge. Contrast with Jesus' call to forgive (Matt. 5:44), showing the growth from Old to New Testament theology, but the longing for justice remains a universal theme with fulfillment in the Messiah."
    },
    {
      "pk": 23028005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 5,
      "text": "Because they do not regard the works of the LORD or what his hands have done, he will tear them down and not build them up.",
      "links": "<a href='/AIV/19/92/5-7'>Ps. 92:5-7</a>",
      "comment": "The wicked reject God’s handiwork. The theme echoes the need for right worship and acknowledgment of God’s covenant works—important for perseverance in faith. Neglecting what God has done brings judgment."
    },
    {
      "pk": 23028006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 6,
      "text": "Blessed be the LORD! For he has heard the voice of my prayer.",
      "links": "<a href='/AIV/19/66/19-20'>Ps. 66:19-20</a>",
      "comment": "A sudden shift to praise, reflecting confidence in God’s faithfulness. The responsive blessing is both personal and communal, resembling liturgical prayer patterns practiced in unified faith down the ages."
    },
    {
      "pk": 23028007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 7,
      "text": "The LORD is my strength and my shield; my heart trusted in him, and I was helped; my heart rejoices, and with my song I will thank him.",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "The dual title 'strength and shield' links God's protection with the joy of worship. A theme picked up in Christ, who becomes the true strength and shield for all believers (see Heb. 2:13). Thanksgiving through song foreshadows the tradition of corporate worship and liturgical praise."
    },
    {
      "pk": 23028008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 8,
      "text": "The LORD is the strength of his people; he is a saving fortress for his anointed one.",
      "links": "<a href='/AIV/19/20/6'>Ps. 20:6</a>; <a href='/AIV/19/89/18'>Ps. 89:18</a>",
      "comment": "'His anointed one' (mashiach) points to the king, but spiritually prefigures the Messiah, Jesus, the ultimate anointed one (see Luke 4:18). God’s people share in His strength by unity with the anointed leader of God’s people."
    },
    {
      "pk": 23028009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 28,
      "verse": 9,
      "text": "Save your people and bless your inheritance; shepherd them and carry them forever.",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/23/40/11'>Isa. 40:11</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The request to 'shepherd and carry' the people echoes God’s continual provision. This image finds ultimate fulfillment in Christ as the Good Shepherd (John 10:11). The connection of inheritance, blessing, and shepherding points to a visible, protected community under God’s guidance throughout history."
    }
  ],
  "translatedAt": "2025-12-24T06:07:50.752Z"
}