{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 53,
  "verses": [
    {
      "pk": 1953053,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 1,
      "text": "The fool says in his heart, “There is no God.” They are corrupt and commit wicked deeds; there is no one who does good.",
      "links": "<a href='/AIV/14/15/2'>2 Chr. 15:2</a>; <a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/45/3/10-12'>Rom. 3:10–12</a>",
      "comment": "This verse closely mirrors Psalm 14:1, highlighting the folly of atheism and moral corruption. Paul quotes this in Romans 3:10–12 to support humanity’s universal need for salvation, laying the foundation for understanding original sin—a core Catholic doctrine. The heart as the seat of belief is significant in spiritual tradition."
    },
    {
      "pk": 1953054,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 2,
      "text": "God looks down from heaven upon the children of man to see if there are any who understand, any who seek after God.",
      "links": "<a href='/AIV/19/33/13-15'>Ps. 33:13–15</a>; <a href='/AIV/19/14/2'>Ps. 14:2</a>; <a href='/AIV/24/5/1'>Jer. 5:1</a>",
      "comment": "The divine initiative in seeking the faithful is present. This verse shows God’s omniscient searching, a theme fulfilled in Christ’s coming (see John 1:48), and subtly points towards the grace that precedes faith, in line with the Catholic emphasis on prevenient grace."
    },
    {
      "pk": 1953055,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 3,
      "text": "Each one has turned aside; together they have become corrupt. There is no one who does good, not even one.",
      "links": "<a href='/AIV/19/14/3'>Ps. 14:3</a>; <a href='/AIV/45/3/12'>Rom. 3:12</a>; <a href='/AIV/21/7/20'>Eccl. 7:20</a>",
      "comment": "Reiterates human depravity—universal corruption. This is essential for understanding the need for redemption, tying to Paul’s use in Romans. Original sin and its effects further underscore the Catholic teaching on the necessity of both the sacraments and grace."
    },
    {
      "pk": 1953056,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 4,
      "text": "Do all the evildoers know nothing, those who devour my people like eating bread and do not call upon God?",
      "links": "<a href='/AIV/19/14/4'>Ps. 14:4</a>; <a href='/AIV/33/3/3'>Mic. 3:3</a>; <a href='/AIV/65/1/12'>Jude 1:12</a>",
      "comment": "Eating God’s people evokes images of persecution and sacrilege, and subtly contrasts with the Eucharist—where faithful partake of Christ, not in destruction but in union. The criticism implies communal worship (‘call upon God’), which reflects the Catholic understanding of the Church’s role in mediating grace."
    },
    {
      "pk": 1953057,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 5,
      "text": "They are seized with great dread, where there was no fear before, because God has scattered the bones of those who besiege you; you put them to shame, for God has rejected them.",
      "links": "<a href='/AIV/19/14/5'>Ps. 14:5'> </a>; <a href='/AIV/23/66/24'>Isa. 66:24</a>",
      "comment": "God’s deliverance leads to the downfall of the wicked—language of scattering bones points to divine judgment. The rejection of God is met by God’s rejection, connecting to Christ’s warnings to those who deny Him (see Matt. 10:33). Spiritual readings see this as a type for final judgment."
    },
    {
      "pk": 1953058,
      "translation": "AIV",
      "book": 19,
      "chapter": 53,
      "verse": 6,
      "text": "Oh, that salvation for Israel would come from Zion! When God restores the fortunes of his people, let Jacob rejoice, let Israel be glad.",
      "links": "<a href='/AIV/19/14/7'>Ps. 14:7</a>; <a href='/AIV/45/11/26'>Rom. 11:26</a>; <a href='/AIV/23/2/3'>Isa. 2:3</a>",
      "comment": "The Psalm ends with a longing for salvation from Zion—a strong image of hope in God’s redemptive action, later realized in Christ’s resurrection in Jerusalem. This verse foreshadows messianic fulfillment and, spiritually, points to the Catholic Church as the new Israel gathered around the Eucharist, rejoicing in the fullest salvation."
    }
  ],
  "translatedAt": "2025-12-22T21:36:48.159Z"
}