{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 129,
  "verses": [
    {
      "pk": 1298001,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 1,
      "text": "Greatly have they afflicted me from my youth—let Israel now say—",
      "links": "<a href='/AIV/19/94/5'>Ps. 94:5</a>; <a href='/AIV/19/124/1'>Ps. 124:1</a>",
      "comment": "The psalm opens with a communal cry reflecting the long-standing history of suffering faced by God’s people. There is a literal historical interpretation (Israel’s national history), but spiritually, this points to the endurance of the faithful amid persecution. Christ endured affliction from His youth, fulfilling the deeper meaning for God’s chosen people (cf. Isa. 53:3-8)."
    },
    {
      "pk": 1298002,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 2,
      "text": "Greatly have they afflicted me from my youth, yet they have not prevailed against me.",
      "links": "<a href='/AIV/19/118/13'>Ps. 118:13</a>; <a href='/AIV/23/54/17'>Isa. 54:17</a>",
      "comment": "Though God’s people are attacked repeatedly, the adversaries cannot overcome them. This foreshadows Christ’s victory over suffering and death, and the permanence of His Church against all opposition (<a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 1298003,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 3,
      "text": "The plowers plowed upon my back; they made their furrows long.",
      "links": "<a href='/AIV/23/50/6'>Isa. 50:6</a>; <a href='/AIV/19/22/16'>Ps. 22:16</a>",
      "comment": "The vivid imagery of deep wounds evokes both Israel’s suffering and the scourging of Christ before His crucifixion. The spiritual reading sees this as a connection to the Passion, where stripes are suffered for the healing of others (<a href='/AIV/23/53/5'>Isa. 53:5</a>)."
    },
    {
      "pk": 1298004,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 4,
      "text": "The LORD is righteous; He has cut the cords of the wicked.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>; <a href='/AIV/19/125/3'>Ps. 125:3</a>",
      "comment": "God’s justice is shown in delivering His people and breaking the bonds of oppression. The literal release from captivity points to Christ’s greater spiritual deliverance from sin and evil (<a href='/AIV/43/8/36'>John 8:36</a>)."
    },
    {
      "pk": 1298005,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 5,
      "text": "Let all who hate Zion be put to shame and turned backward.",
      "links": "<a href='/AIV/19/6/10'>Ps. 6:10</a>; <a href='/AIV/19/35/4'>Ps. 35:4</a>",
      "comment": "Zion represents the holy dwelling place chosen by God, both physically and spiritually. To be opposed to Zion is to be opposed to the blessing and presence of God. This anticipates the ultimate vindication of the faithful (cf. <a href='/AIV/66/21/2'>Rev. 21:2</a>)."
    },
    {
      "pk": 1298006,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 6,
      "text": "Let them be like grass on the housetops, which withers before it grows up,",
      "links": "<a href='/AIV/23/37/27'>Isa. 37:27</a>; <a href='/AIV/19/37/2'>Ps. 37:2</a>",
      "comment": "Enemies are likened to shallow, rootless grass that quickly dies. This metaphor underscores that opposition to God’s people is fleeting and ultimately barren. There is a spiritual lesson here about perseverance and true fruitfulness."
    },
    {
      "pk": 1298007,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 7,
      "text": "With which the reaper does not fill his hand, nor the binder of sheaves his arms,",
      "links": "<a href='/AIV/19/126/6'>Ps. 126:6</a>; <a href='/AIV/40/13/30'>Matt. 13:30</a>",
      "comment": "The futility of the wicked’s efforts is contrasted with the true harvest of the righteous. Spiritually, this echoes the separation at the final judgment between fruitless and fruitful lives (<a href='/AIV/40/25/32'>Matt. 25:32</a>)."
    },
    {
      "pk": 1298008,
      "translation": "AIV",
      "book": 19,
      "chapter": 129,
      "verse": 8,
      "text": "Nor do those who pass by say, 'The blessing of the LORD be upon you! We bless you in the name of the LORD!'",
      "links": "<a href='/AIV/19/128/5'>Ps. 128:5</a>; <a href='/AIV/04/6/24-26'>Num. 6:24-26</a>",
      "comment": "The absence of blessing upon the wicked signifies God’s favor rests only on the faithful. The invocation of blessing in the name of the LORD foreshadows the liturgical blessings pronounced in communal worship, a central tradition in the apostolic Church, continuing the Old Testament pattern (<a href='/AIV/40/21/9'>Matt. 21:9</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:47:25.644Z"
}