{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 35,
  "verses": [
    {
      "pk": 23035001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 1,
      "text": "Contend, O LORD, with those who contend against me; fight against those who fight against me.",
      "links": "<a href='/AIV/02/14/14'>Ex. 14:14</a>; <a href='/AIV/19/109/1-3'>Ps. 109:1-3</a>",
      "comment": "David invokes God as his defender against unjust enemies. The spiritual principle of relying on God's justice rather than personal vengeance echoes later teachings in Romans 12:19. Throughout this Psalm, God's unique role as Judge and Defender is emphasized."
    },
    {
      "pk": 23035002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 2,
      "text": "Take up shield and buckler, and rise up to help me.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/91/4'>Ps. 91:4</a>",
      "comment": "Imagery of God as a warrior with shield and buckler highlights His direct protection. This prefigures Christ as our shield against evil (Eph. 6:16). The invocation to 'rise up' signifies God's active intervention in our struggles."
    },
    {
      "pk": 23035003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 3,
      "text": "Draw the spear and halt the way against those who pursue me; say to my soul, 'I am your salvation.'",
      "links": "<a href='/AIV/07/6/23'>Judg. 6:23</a>; <a href='/AIV/19/62/2'>Ps. 62:2</a>",
      "comment": "God's promise, 'I am your salvation,' is both literal and messianic. David anticipates salvation not only from physical enemies but hints at the ultimate deliverance found in Christ (Matt. 1:21)."
    },
    {
      "pk": 23035004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 4,
      "text": "Let those who seek my life be put to shame and dishonored; let those who plan evil against me be turned back and confounded.",
      "links": "<a href='/AIV/19/40/14'>Ps. 40:14</a>; <a href='/AIV/19/70/2'>Ps. 70:2</a>",
      "comment": "A prayer for justice against persecutors. This theme of shame for evildoers and vindication for the righteous is deepened in Christ's own journey, particularly in His passion (Luke 23:35)."
    },
    {
      "pk": 23035005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 5,
      "text": "Let them be like chaff before the wind, with the angel of the LORD driving them away.",
      "links": "<a href='/AIV/19/1/4'>Ps. 1:4</a>; <a href='/AIV/02/23/20'>Ex. 23:20</a>",
      "comment": "Chaff symbolizes worthlessness and judgment. Reference to the 'angel of the LORD' evokes God's present action, which in Christian tradition is fulfilled in Christ’s authority over angels (Matt. 13:41)."
    },
    {
      "pk": 23035006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 6,
      "text": "Let their way be dark and slippery, with the angel of the LORD pursuing them.",
      "links": "<a href='/AIV/19/73/18'>Ps. 73:18</a>; <a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "Divine justice is portrayed through the difficulties faced by the wicked. This hardship is also a call to repentance, a theme prominent in Scripture (Ezek. 18:30–32)."
    },
    {
      "pk": 23035007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 7,
      "text": "For without cause they hid their net for me; without reason they dug a pit for my life.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/19/119/85'>Ps. 119:85</a>",
      "comment": "David emphasizes the unjust hostility he faces. Christ too suffered unjust persecution (John 15:25), fulfilling this pattern of the innocent sufferer."
    },
    {
      "pk": 23035008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 8,
      "text": "Let ruin come upon him unawares; and let the net that he hid ensnare him; let him fall in it—to his destruction.",
      "links": "<a href='/AIV/19/9/15'>Ps. 9:15</a>; <a href='/AIV/19/57/6'>Ps. 57:6</a>",
      "comment": "The poetic justice described here reflects God’s sovereignty, emphasizing that evil plots recoil on their authors. This principle is found throughout Proverbs (Prov. 26:27)."
    },
    {
      "pk": 23035009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 9,
      "text": "Then my soul will rejoice in the LORD, exulting in his salvation.",
      "links": "<a href='/AIV/19/13/5'>Ps. 13:5</a>; <a href='/AIV/19/34/2'>Ps. 34:2</a>",
      "comment": "David vows to praise God upon deliverance. Gratitude for salvation forms the basis of Christian worship. The language here mirrors Mary’s Magnificat and the joy at liberation (Luke 1:47)."
    },
    {
      "pk": 23035010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 10,
      "text": "All my bones shall say, 'O LORD, who is like you, rescuing the poor from one too strong for him, the poor and needy from him who robs him?'",
      "links": "<a href='/AIV/19/113/5'>Ps. 113:5</a>; <a href='/AIV/19/6/2'>Ps. 6:2</a>",
      "comment": "David’s total being praises God, paralleling the Psalmist’s frequent declaration of unique dependence on the Lord. God’s compassion for the oppressed is a major biblical theme, deeply fulfilled in Christ’s ministry (Luke 4:18)."
    },
    {
      "pk": 23035011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 11,
      "text": "Malicious witnesses rise up; they ask me things I do not know.",
      "links": "<a href='/AIV/19/27/12'>Ps. 27:12</a>; <a href='/AIV/40/26/59-61'>Matt. 26:59–61</a>",
      "comment": "Suffering false accusation foreshadows Christ’s trial before the Sanhedrin (Matt. 26:59-61). The persecution of the righteous is a recurring spiritual battle."
    },
    {
      "pk": 23035012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 12,
      "text": "They repay me evil for good; my soul is forlorn.",
      "links": "<a href='/AIV/19/38/20'>Ps. 38:20</a>; <a href='/AIV/19/109/5'>Ps. 109:5</a>; <a href='/AIV/40/27/24'>Matt. 27:24</a>",
      "comment": "Echoes Christ’s own experience, where good deeds are met with betrayal. The suffering servant motif develops throughout the Psalms and into the prophetic portrayal of Jesus."
    },
    {
      "pk": 23035013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 13,
      "text": "But as for me, when they were sick, I wore sackcloth; I afflicted myself with fasting. I prayed with head bowed on my chest.",
      "links": "<a href='/AIV/19/69/10'>Ps. 69:10</a>; <a href='/AIV/19/109/24'>Ps. 109:24</a>",
      "comment": "David demonstrates personal piety, interceding for his enemies. The practice of fasting and prayer is foundational in both Old and New Testament spiritual life (Matt. 6:16-18)."
    },
    {
      "pk": 23035014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 14,
      "text": "I went about as though it were my friend or brother; I bowed in mourning, like one grieving for his mother.",
      "links": "<a href='/AIV/19/122/8'>Ps. 122:8</a>; <a href='/AIV/42/23/27'>Luke 23:27</a>",
      "comment": "David’s compassion even for his adversaries reflects an ideal of charity. Early Christian tradition retains mourning and intercessory prayer for others, echoing the depth of spiritual kinship."
    },
    {
      "pk": 23035015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 15,
      "text": "But at my stumbling they rejoiced and gathered together; they slandered me, and I did not know it. They tore at me without ceasing.",
      "links": "<a href='/AIV/19/22/7'>Ps. 22:7</a>; <a href='/AIV/40/27/29-30'>Matt. 27:29–30</a>",
      "comment": "The mockery and abuse David suffered is a prophetic image of Christ’s humiliation by the crowds. The repeated reference to slander reveals an ongoing spiritual trial for the righteous."
    },
    {
      "pk": 23035016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 16,
      "text": "Like profane mockers at a feast, they gnash at me with their teeth.",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/37/12'>Ps. 37:12</a>",
      "comment": "Gnashing of teeth symbolizes hatred and rebellion. The setting of a feast draws attention to the irony of celebration at another's pain, which Christ endures at His own passion."
    },
    {
      "pk": 23035017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 17,
      "text": "Lord, how long will you look on? Rescue me from their destruction, my precious life from the lions.",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>; <a href='/AIV/19/22/21'>Ps. 22:21</a>",
      "comment": "David’s plea for deliverance anticipates Christ's cry from the cross. ‘Lions’ represent mortal threat, as seen elsewhere (Ps. 22:21), and the request for rescue shows faith in divine intervention."
    },
    {
      "pk": 23035018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 18,
      "text": "I will thank you in the great assembly; in the throng I will praise you.",
      "links": "<a href='/AIV/19/22/22'>Ps. 22:22</a>; <a href='/AIV/19/40/9'>Ps. 40:9</a>",
      "comment": "Corporate worship is a recurring theme. The 'great assembly' prefigures the gathered Church community, which continues this tradition of public praise and thanksgiving. This emphasizes unity in worship."
    },
    {
      "pk": 23035019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 19,
      "text": "Let not those rejoice over me who are wrongfully my enemies, nor let those wink maliciously who hate me without cause.",
      "links": "<a href='/AIV/19/38/19'>Ps. 38:19</a>; <a href='/AIV/43/15/25'>John 15:25</a>",
      "comment": "‘Hate me without cause’ is quoted in John 15:25, paralleling Jesus’ unjust suffering. God’s justice is again shown to favor innocence over malice."
    },
    {
      "pk": 23035020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 20,
      "text": "For they do not speak peace, but devise false accusations against those who are quiet in the land.",
      "links": "<a href='/AIV/19/120/7'>Ps. 120:7</a>",
      "comment": "The Psalmist contrasts peaceable living with the plotting of the wicked. Jesus blesses the peacemakers (Matt. 5:9), reinforcing the reward for righteousness in God’s kingdom."
    },
    {
      "pk": 23035021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 21,
      "text": "They open wide their mouths against me; they say, 'Aha! Aha! Our eyes have seen it!'",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/40/15'>Ps. 40:15</a>",
      "comment": "Mocking by enemies is again highlighted. This verse is often linked with Christ’s suffering (Mark 15:29). The desire of the wicked to witness the downfall of the just is condemned."
    },
    {
      "pk": 23035022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 22,
      "text": "You have seen, O LORD; do not be silent! O Lord, do not be far from me!",
      "links": "<a href='/AIV/19/10/1'>Ps. 10:1</a>; <a href='/AIV/19/22/11'>Ps. 22:11</a>",
      "comment": "David appeals to God’s Presence and intervention, a foundational belief in God’s immanence. The confidence that God sees all forms the basis of trust in divine justice."
    },
    {
      "pk": 23035023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 23,
      "text": "Awake and rouse yourself for my right; contend for me, my God and my Lord!",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/44/23'>Ps. 44:23</a>",
      "comment": "David’s call for God to awake is metaphorical, urging immediate action. Addressing God as ‘my God and my Lord’ points toward a personal relationship, an idea later deepened in New Testament revelation (John 20:28)."
    },
    {
      "pk": 23035024,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 24,
      "text": "Vindicate me, O LORD my God, according to your righteousness, and let them not rejoice over me.",
      "links": "<a href='/AIV/19/26/1'>Ps. 26:1</a>",
      "comment": "Justice based on God's righteousness mirrors the principle that salvation is by divine grace, not human merit. The expectation of vindication foreshadows the Last Judgment."
    },
    {
      "pk": 23035025,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 25,
      "text": "Do not let them say in their hearts, 'Aha, our soul!' Do not let them say, 'We have swallowed him up!'",
      "links": "<a href='/AIV/19/124/3'>Ps. 124:3</a>; <a href='/AIV/19/13/4'>Ps. 13:4</a>",
      "comment": "This verse prays that enemies are denied triumph in their evil intentions. The humble trust in God’s deliverance rather than in self-assertion."
    },
    {
      "pk": 23035026,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 26,
      "text": "Let those who rejoice at my calamity be put to shame and confusion together; let those who exalt themselves over me be clothed with shame and dishonor.",
      "links": "<a href='/AIV/19/71/13'>Ps. 71:13</a>; <a href='/AIV/19/109/29'>Ps. 109:29</a>",
      "comment": "A repeated prayer for justice and humility. God's judgment brings reversal for the arrogant—a theme recurring through the Psalms and the teachings of Jesus on humility (Luke 18:14)."
    },
    {
      "pk": 23035027,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 27,
      "text": "Let those who desire my vindication shout for joy and be glad, and say evermore, 'Great is the LORD, who delights in the peace of his servant!'",
      "links": "<a href='/AIV/19/40/16'>Ps. 40:16</a>; <a href='/AIV/19/16/9'>Ps. 16:9</a>",
      "comment": "Those who seek the righteousness of God will rejoice at the triumph of truth. God ‘delights in the peace of his servant’ hints at the beatitude promised in Christ (Matt. 5:9), encouraging works of charity and unity in community."
    },
    {
      "pk": 23035028,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 35,
      "verse": 28,
      "text": "Then my tongue shall tell of your righteousness and of your praise all day long.",
      "links": "<a href='/AIV/19/71/15'>Ps. 71:15</a>; <a href='/AIV/19/35/18'>Ps. 35:18</a>",
      "comment": "The Psalm ends with a promise of continuous praise. Proclamation and witness are central to faith, drawing all people together in worship and thanksgiving of God’s saving deeds. In the New Testament, praise and worship are continually encouraged as marks of discipleship (Eph. 5:19-20)."
    }
  ],
  "translatedAt": "2025-12-24T06:10:26.676Z"
}