{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 127,
  "verses": [
    {
      "pk": 1932200,
      "translation": "AIV",
      "book": 19,
      "chapter": 127,
      "verse": 1,
      "text": "Unless the LORD builds the house, those who build it labor in vain. Unless the LORD watches over the city, the watchman stays awake in vain.",
      "links": "<a href='/AIV/19/121/4'>Ps. 121:4</a>; <a href='/AIV/13/29/15'>1 Chr. 29:15</a>; <a href='/AIV/20/16/9'>Prov. 16:9</a>",
      "comment": "Echoing the deep dependence on God for all endeavors, the text highlights that human effort alone cannot accomplish true success. The spiritual meaning suggests Christ as the true foundation (cf. Matt 7:24-25), the builder of God’s house, foretelling the mystery of the Church built by divine initiative. See <a href='/AIV/40/16/18'>Matthew 16:18</a> for further reflection on the building of God’s household."
    },
    {
      "pk": 1932201,
      "translation": "AIV",
      "book": 19,
      "chapter": 127,
      "verse": 2,
      "text": "It is futile for you to rise up early and go late to rest, eating the bread of anxious toil; for he gives to his beloved sleep.",
      "links": "<a href='/AIV/19/4/8'>Ps. 4:8</a>; <a href='/AIV/40/6/25-34'>Matt. 6:25-34</a>",
      "comment": "Trust in the LORD brings peace, rest, and assurance. The linkage to sleep given to God’s beloved prophetically hints toward the gracious gift of spiritual rest found in Christ (see Heb. 4:9-10). This verse invites deeper faith in providence rather than restless self-reliance—a spiritual interpretation leading to greater confidence in God's ongoing care, echoed in Jesus’ invitation to rest (Matt. 11:28)."
    },
    {
      "pk": 1932202,
      "translation": "AIV",
      "book": 19,
      "chapter": 127,
      "verse": 3,
      "text": "Behold, children are a heritage from the LORD, the fruit of the womb a reward.",
      "links": "<a href='/AIV/01/30/2'>Gen. 30:2</a>; <a href='/AIV/19/113/9'>Ps. 113:9</a>; <a href='/AIV/19/128/3'>Ps. 128:3</a>",
      "comment": "Children are praised as gifts, not merely personal accomplishments. The verse emphasizes the family as a divinely instituted blessing, prefiguring spiritual inheritance through faith (cf. Gal. 3:26-29), and hints at the broader biblical theme of spiritual fruitfulness and legacy."
    },
    {
      "pk": 1932203,
      "translation": "AIV",
      "book": 19,
      "chapter": 127,
      "verse": 4,
      "text": "Like arrows in the hand of a warrior, so are the children of one's youth.",
      "links": "<a href='/AIV/19/120/4'>Ps. 120:4</a>; <a href='/AIV/20/17/6'>Prov. 17:6</a>",
      "comment": "The imagery portrays children as effective and purposeful extensions of their parents, much like disciples sent forth. This subtly alludes to the formative influence of spiritual training, reflecting the role of godly families in strengthening the People of God (cf. Deut. 6:6-7), and by analogy, the propagation of faith from generation to generation."
    },
    {
      "pk": 1932204,
      "translation": "AIV",
      "book": 19,
      "chapter": 127,
      "verse": 5,
      "text": "Blessed is the man who fills his quiver with them. He shall not be ashamed when he speaks with his enemies at the gate.",
      "links": "<a href='/AIV/19/128/4'>Ps. 128:4</a>; <a href='/AIV/18/5/4'>Job 5:4</a>",
      "comment": "This verse concludes with the practical and spiritual security offered by a full household, pointing to the joy and defense found in one’s descendants. The literal meaning affirms the value of family, while the spiritual reading suggests the communal strength of the People of God united—foreshadowing the scriptural concept of believers’ solidarity and defense against adversity (Eph. 6:10-18)."
    }
  ],
  "translatedAt": "2025-12-23T05:47:06.768Z"
}