{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 124,
  "verses": [
    {
      "pk": 2001240,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 1,
      "text": "If the LORD had not been on our side—let Israel now say—",
      "links": "<a href='/AIV/19/94/17'>Ps. 94:17</a>; <a href='/AIV/19/129/1'>Ps. 129:1</a>",
      "comment": "This opening acts as a call and response for the assembly, inviting reflection on God's direct intervention throughout Israel’s history. The liturgical aspect hints at the communal worship and oral tradition central to Israel's identity."
    },
    {
      "pk": 2001241,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 2,
      "text": "if the LORD had not been on our side when people rose up against us,",
      "links": "<a href='/AIV/19/118/7'>Ps. 118:7</a>; <a href='/AIV/2/14/9'>Exod. 14:9</a>",
      "comment": "This speaks to deliverance from human opposition, alluding to times Israel was surrounded by enemies. It serves as a reminder that salvation comes from the LORD, not human strength, paralleling Exodus deliverance."
    },
    {
      "pk": 2001242,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 3,
      "text": "then they would have swallowed us up alive, when their anger was kindled against us;",
      "links": "<a href='/AIV/19/56/1-2'>Ps. 56:1-2</a>; <a href='/AIV/4/16/30-33'>Num. 16:30-33</a>",
      "comment": "Language of being 'swallowed alive' reflects total destruction, reminiscent of Korah’s rebellion (Numbers 16). Expresses utter dependence on the LORD’s protection."
    },
    {
      "pk": 2001243,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 4,
      "text": "then the waters would have overwhelmed us, the torrent would have swept over our soul;",
      "links": "<a href='/AIV/19/69/1-2'>Ps. 69:1-2</a>; <a href='/AIV/1/7/11-12'>Genesis 7:11-12</a>",
      "comment": "'Waters' often symbolize chaos or judgment. As in the Flood or the Red Sea crossing, deliverance from waters echoes both literal and spiritual rescue—foreshadowing baptismal theology where water brings both death and new life."
    },
    {
      "pk": 2001244,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 5,
      "text": "then the raging waters would have gone over our soul.",
      "links": "<a href='/AIV/19/42/7'>Ps. 42:7</a>; <a href='/AIV/23/43/2'>Isa. 43:2</a>",
      "comment": "Repeats and intensifies the threat, underscoring the severity of what God has saved His people from. The phrase 'over our soul' hints at both physical and spiritual peril."
    },
    {
      "pk": 2001245,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 6,
      "text": "Blessed be the LORD, who has not given us as prey to their teeth.",
      "links": "<a href='/AIV/19/35/17'>Ps. 35:17</a>; <a href='/AIV/27/6/22'>Dan. 6:22</a>",
      "comment": "'Prey to their teeth' uses predator imagery, signaling God's power to save from destruction, much like Daniel’s deliverance from the lions. This foreshadows divine preservation of God's people throughout salvation history."
    },
    {
      "pk": 2001246,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 7,
      "text": "We have escaped like a bird from the snare of the fowlers; the snare is broken, and we have escaped.",
      "links": "<a href='/AIV/19/91/3'>Ps. 91:3</a>; <a href='/AIV/28/7/12'>Hos. 7:12</a>",
      "comment": "Escape from the snare images liberation from deadly traps—an ongoing motif in Scripture for God’s saving acts over sin and death. Spiritually, this points forward to freedom from bondage and hints at final victory found ultimately in Christ (see <a href='/AIV/43/8/36'>John 8:36</a>)."
    },
    {
      "pk": 2001247,
      "translation": "AIV",
      "book": 19,
      "chapter": 124,
      "verse": 8,
      "text": "Our help is in the name of the LORD, who made heaven and earth.",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>; <a href='/AIV/1/1/1'>Gen. 1:1</a>",
      "comment": "The closing verse professes faith in the Creator as the ultimate source of help. This confessional refrain was integral in the worship life of Israel and continues as a profound formula of trust in God’s power—paralleling New Testament affirmations of Jesus as Creator and Savior (see <a href='/AIV/51/1/16-17'>Col. 1:16–17</a>). The repeated liturgical use underscores the ongoing mediating structure between God and His people, reverberating through the Church’s ancient traditions."
    }
  ],
  "translatedAt": "2025-12-23T05:46:40.334Z"
}