{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 52,
  "verses": [
    {
      "pk": 1952052,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 1,
      "text": "Why do you boast of evil, O mighty man? The steadfast love of God endures all day long.",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>; <a href='/AIV/19/36/5'>Ps. 36:5</a>",
      "comment": "This verse addresses a powerful evildoer, contrasting his pride with God's enduring mercy. 'Steadfast love' (Hebrew: 'chesed') is especially emphasized in Catholic theology as pointing toward God's covenantal faithfulness, which continues in the sacraments. Both Protestant and Catholic views affirm the primacy of God's mercy, but Catholics deeply connect 'chesed' with grace given through the Church."
    },
    {
      "pk": 1952053,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 2,
      "text": "Your tongue plots destruction, like a sharp razor, working deceit.",
      "links": "<a href='/AIV/19/57/4'>Ps. 57:4</a>; <a href='/AIV/59/3/6'>James 3:6</a>",
      "comment": "The imagery of the tongue as a destructive tool is echoed in James 3:6. Spiritual interpretation invites examination of how untruth divides the Body of Christ, a theme Catholic tradition addresses deeply through guidance and confession."
    },
    {
      "pk": 1952054,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 3,
      "text": "You love evil more than good, and lying more than speaking what is right. Selah.",
      "links": "<a href='/AIV/19/34/13'>Ps. 34:13</a>; <a href='/AIV/19/120/2'>Ps. 120:2</a>",
      "comment": "The emphasis on preferring evil over good can be read literally. However, spiritually, the Church encourages constant conversion toward goodness by means of the sacramental life; the 'Selah' offers a pause to reflect, much like liturgical silence in the Mass."
    },
    {
      "pk": 1952055,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 4,
      "text": "You love all words that devour, O deceitful tongue.",
      "links": "<a href='/AIV/19/15/3'>Ps. 15:3</a>; <a href='/AIV/19/64/3'>Ps. 64:3</a>",
      "comment": "Further denouncing destructive speech, this verse highlights the power of words. Catholic teaching elevates the importance of truth both personally and communally, especially in the context of the sacrament of reconciliation."
    },
    {
      "pk": 1952056,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 5,
      "text": "But God will break you down forever; he will snatch you up and tear you from your tent; he will uproot you from the land of the living. Selah.",
      "links": "<a href='/AIV/19/27/13'>Ps. 27:13</a>; <a href='/AIV/19/37/10'>Ps. 37:10</a>",
      "comment": "A warning of divine judgment for the wicked. Catholic teaching often links judgment with the necessity of remaining in grace, nurtured by the Church's sacramental life. 'Selah' again encourages meditation, akin to Eucharistic reflection."
    },
    {
      "pk": 1952057,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 6,
      "text": "The righteous will see and fear, and will laugh at him, saying:",
      "links": "<a href='/AIV/19/40/3'>Ps. 40:3</a>; <a href='/AIV/19/58/10'>Ps. 58:10</a>",
      "comment": "The righteous respond with awe and even joy when God's justice is revealed. This calls to mind Catholic veneration of the saints, who behold God's judgment and mercy with holy fear and rejoicing."
    },
    {
      "pk": 1952058,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 7,
      "text": "'Here is the man who did not make God his refuge, but trusted in the abundance of his riches and sought refuge in his own destruction!'",
      "links": "<a href='/AIV/19/49/6'>Ps. 49:6</a>; <a href='/AIV/19/118/8-9'>Ps. 118:8–9</a>",
      "comment": "Material security versus divine refuge is a central theme. Catholics find deep meaning in trusting God above earthly wealth, with liturgical prayers reinforcing reliance on divine providence."
    },
    {
      "pk": 1952059,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 8,
      "text": "But I am like a green olive tree in the house of God; I trust in the steadfast love of God forever and ever.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>; <a href='/AIV/19/23/6'>Ps. 23:6</a>",
      "comment": "The olive tree is a symbol of fruitfulness and anointing, recalling both Israel and the Church. Catholics see in this a figure of abiding in Christ and receiving grace through His Church—a subtle echo of the security offered in sacramental communion."
    },
    {
      "pk": 1952060,
      "translation": "AIV",
      "book": 19,
      "chapter": 52,
      "verse": 9,
      "text": "I will thank you forever, because you have done it. I will wait on your name, for it is good, in the presence of your faithful ones.",
      "links": "<a href='/AIV/19/35/18'>Ps. 35:18</a>; <a href='/AIV/19/30/4'>Ps. 30:4</a>",
      "comment": "Thanksgiving in the assembly defines Catholic worship—most notably in the Eucharist (from Greek, 'thanksgiving'). The gathered 'faithful ones' foreshadow the Church, and waiting on God's name recalls Catholic devotion to the holy Name of Jesus. Spiritually, the enduring praise points to eternal worship in heaven."
    }
  ],
  "translatedAt": "2025-12-22T21:36:36.574Z"
}