{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 47,
  "verses": [
    {
      "pk": 2004701,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 1,
      "text": "Clap your hands, all you peoples; shout to God with a voice of triumph!",
      "links": "<a href='/AIV/66/7/9'>Rev. 7:9</a>; <a href='/AIV/19/66/1'>Ps. 66:1</a>",
      "comment": "This universal call to worship anticipates all nations praising God, hinting at the catholicity (universality) of God's kingdom (see Rev. 7:9). The text emphasizes the communal and liturgical response to God's kingship."
    },
    {
      "pk": 2004702,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 2,
      "text": "For the LORD Most High is awesome, a great King over all the earth.",
      "links": "<a href='/AIV/19/95/3'>Ps. 95:3</a>; <a href='/AIV/19/96/10'>Ps. 96:10</a>",
      "comment": "God's sovereignty is proclaimed here as 'King over all the earth,' prefiguring Christ's kingship and His reign over all creation (see Ps. 95:3)."
    },
    {
      "pk": 2004703,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 3,
      "text": "He subdues peoples under us, and nations under our feet.",
      "links": "<a href='/AIV/19/18/47'>Ps. 18:47</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "This verse foreshadows the messianic victory, later fulfilled in Christ who puts all things under His feet (see Ps. 110:1). The imagery of subduing nations is fully realized in the spiritual conquest of the Church."
    },
    {
      "pk": 2004704,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 4,
      "text": "He chooses our heritage for us, the pride of Jacob whom He loves. Selah.",
      "links": "<a href='/AIV/19/105/6'>Ps. 105:6</a>; <a href='/AIV/5/7/6'>Deut. 7:6</a>",
      "comment": "God's choosing of Israel prefigures His election of the Church as His people. The mention of ‘heritage’ echoes the Catholic understanding of being adopted sons through grace and sacramental life."
    },
    {
      "pk": 2004705,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 5,
      "text": "God has gone up with a shout, the LORD with the sound of a trumpet.",
      "links": "<a href='/AIV/44/1/9-11'>Acts 1:9–11</a>; <a href='/AIV/19/68/18'>Ps. 68:18</a>",
      "comment": "This ascent refers both to the Ark’s procession and prophetically to Christ’s Ascension (see Acts 1:9–11; Ps. 68:18). The ‘trumpet’ signals liturgical and heavenly worship, akin to Catholic liturgy."
    },
    {
      "pk": 2004706,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 6,
      "text": "Sing praises to God, sing praises! Sing praises to our King, sing praises!",
      "links": "<a href='/AIV/19/66/4'>Ps. 66:4</a>; <a href='/AIV/19/95/1'>Ps. 95:1</a>",
      "comment": "This repeated call for praise forms the basis for regular liturgical worship, which is central to Catholic and historical Christian practice."
    },
    {
      "pk": 2004707,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 7,
      "text": "For God is the King of all the earth; sing praises with understanding.",
      "links": "<a href='/AIV/19/22/28'>Ps. 22:28</a>; <a href='/AIV/19/96/1'>Ps. 96:1</a>",
      "comment": "Praising God 'with understanding' highlights the need for proper teaching and catechesis, strongly reflected in the Catholic tradition. God’s kingship is over all people, not just Israel."
    },
    {
      "pk": 2004708,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 8,
      "text": "God reigns over the nations; God sits on His holy throne.",
      "links": "<a href='/AIV/19/99/1'>Ps. 99:1</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "The vision of God enthroned points to the heavenly liturgy and Christ’s eternal reign, and is fulfilled in Catholic teachings on Christ the King (see Rev. 11:15)."
    },
    {
      "pk": 2004709,
      "translation": "AIV",
      "book": 19,
      "chapter": 47,
      "verse": 9,
      "text": "The princes of the peoples gather as the people of the God of Abraham. For the shields of the earth belong to God; He is greatly exalted.",
      "links": "<a href='/AIV/19/72/11'>Ps. 72:11</a>; <a href='/AIV/23/2/2'>Isa. 2:2</a>",
      "comment": "The gathering of nations around the God of Abraham foreshadows the ingathering of the Gentiles into the one, holy, catholic, and apostolic Church (see Isa. 2:2). The ‘shields’ symbolize rulers under God’s authority."
    }
  ],
  "translatedAt": "2025-12-22T21:35:01.693Z"
}