{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 44,
  "verses": [
    {
      "pk": 1944401,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 1,
      "text": "O God, we have heard with our ears; our fathers have told us the deeds You did in their days, in the days of old.",
      "links": "<a href='/AIV/2/13/8-10'>Ex. 13:8-10</a>; <a href='/AIV/19/78/3-4'>Ps. 78:3-4</a>",
      "comment": "Faithful passing down of God’s works through tradition. Notice the emphasis on listening to the elders—a sign of the value of oral tradition in salvation history, which echoes Catholic appreciation of both Scripture and Tradition (see 2 Thess. 2:15)."
    },
    {
      "pk": 1944402,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 2,
      "text": "With Your hand You drove out nations and planted our fathers; You afflicted peoples but spread them out.",
      "links": "<a href='/AIV/6/24/12'>Josh. 24:12</a>; <a href='/AIV/19/80/8'>Ps. 80:8</a>",
      "comment": "The Lord’s active role in establishing Israel, echoing His sovereignty. The image of God planting His people is often seen as a type of the Church, which Christ establishes and protects."
    },
    {
      "pk": 1944403,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 3,
      "text": "For not by their own sword did they take the land, nor did their own arm save them, but it was Your right hand, Your arm, and the light of Your face, for You favored them.",
      "links": "<a href='/AIV/5/7/7-8'>Deut. 7:7-8</a>; <a href='/AIV/19/77/15'>Ps. 77:15</a>",
      "comment": "Salvation is by God’s grace alone, not by human effort—a principle emphasized in both Protestant and Catholic soteriology, though Catholics see grace as working through the sacraments (cf. Eph. 2:8-9)."
    },
    {
      "pk": 1944404,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 4,
      "text": "You are my King, O God; command salvation for Jacob.",
      "links": "<a href='/AIV/19/74/12'>Ps. 74:12</a>",
      "comment": "Addressing God as ‘King’ foreshadows the coming of Christ the King, and underscores the monarchic authority of the Messiah (see John 18:37; Luke 1:33)."
    },
    {
      "pk": 1944405,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 5,
      "text": "Through You we push back our foes; through Your name we trample those who rise against us.",
      "links": "<a href='/AIV/19/18/29'>Ps. 18:29</a>; <a href='/AIV/19/118/10'>Ps. 118:10</a>",
      "comment": "Victory comes from God’s name—the invocation of His Name (see Phil. 2:10) is deeply sacramental, pointing to New Testament practice (cf. Acts 3:6, 16)."
    },
    {
      "pk": 1944406,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 6,
      "text": "For I do not trust in my bow, and my sword does not save me.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Human power is insufficient for salvation or victory. See also the spiritual interpretation: the futility of self-reliance apart from grace."
    },
    {
      "pk": 1944407,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 7,
      "text": "But You have saved us from our foes and put to shame those who hate us.",
      "links": "<a href='/AIV/19/18/47'>Ps. 18:47</a>",
      "comment": "Only God delivers His people and vindicates them before enemies. In a spiritual sense, this points to Christ’s victory over sin and death (cf. Col. 2:15)."
    },
    {
      "pk": 1944408,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 8,
      "text": "In God we boast all day long, and we will give thanks to Your name forever. Selah.",
      "links": "<a href='/AIV/19/34/2'>Ps. 34:2</a>; <a href='/AIV/19/52/9'>Ps. 52:9</a>",
      "comment": "Continual praise and thanksgiving echo the perpetual worship found in the liturgy. Catholics view the Eucharist (‘thanksgiving’) as the highest form of praise."
    },
    {
      "pk": 1944409,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 9,
      "text": "But now You have rejected and humbled us; You do not go out with our armies.",
      "links": "<a href='/AIV/19/60/1'>Ps. 60:1</a>",
      "comment": "A sudden change in God’s favor is recognized by the people. In Church tradition, this is often linked to the purifying value of suffering, a teaching richly developed in Catholic spirituality."
    },
    {
      "pk": 1944410,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 10,
      "text": "You have made us turn back from the enemy, and those who hate us have plundered us.",
      "links": "<a href='/AIV/19/89/41'>Ps. 89:41</a>",
      "comment": "God permits defeat to teach trust and humility. The discipline of God, as described in Heb. 12:6-7, is central in Catholic understanding of redemptive suffering."
    },
    {
      "pk": 1944411,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 11,
      "text": "You have made us like sheep for slaughter and have scattered us among the nations.",
      "links": "<a href='/AIV/19/74/1'>Ps. 74:1</a>; <a href='/AIV/45/8/36'>Rom. 8:36</a>",
      "comment": "‘Like sheep for slaughter’ is quoted by Paul in Romans 8:36, giving it a messianic and Christological interpretation: the suffering of God’s people as sharing in Christ’s own suffering."
    },
    {
      "pk": 1944412,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 12,
      "text": "You sell Your people for nothing, and have not profited by their sale.",
      "links": "<a href='/AIV/5/32/30'>Deut. 32:30</a>; <a href='/AIV/23/52/3'>Isa. 52:3</a>",
      "comment": "God permits His people to be given up, not for profit, showing that the suffering of the faithful is a mystery. Catholics interpret such sufferings as a participation in Christ’s redemptive work."
    },
    {
      "pk": 1944413,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 13,
      "text": "You have made us a reproach to our neighbors, a scoffing and a derision to those around us.",
      "links": "<a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "Being shamed before the nations foreshadows Christ’s own rejection and the Church’s expected sharing in His reproach (cf. Heb. 13:13)."
    },
    {
      "pk": 1944414,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 14,
      "text": "You have made us a byword among the nations, a laughingstock among the peoples.",
      "links": "<a href='/AIV/5/28/37'>Deut. 28:37</a>; <a href='/AIV/25/3/14'>Lam. 3:14</a>",
      "comment": "The theme of public humiliation is common in Israel’s history. Note that the Church, too, has often been mocked in history, yet perseveres with hope."
    },
    {
      "pk": 1944415,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 15,
      "text": "All day long my disgrace is before me, and shame has covered my face.",
      "links": "<a href='/AIV/19/69/7'>Ps. 69:7</a>",
      "comment": "Shame and disgrace are part of the human condition, but the faithful turn to the Lord, reflecting Catholic devotion to regular confession and penance."
    },
    {
      "pk": 1944416,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 16,
      "text": "At the voice of the one who taunts and reviles, because of the enemy and the avenger.",
      "links": "<a href='/AIV/19/42/10'>Ps. 42:10</a>",
      "comment": "The pain from enemies is both physical and spiritual. This echoes Christ’s endurance of mockery and leads the Church to follow His example."
    },
    {
      "pk": 1944417,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 17,
      "text": "All this has come upon us, though we have not forgotten You, nor have we falsely dealt with Your covenant.",
      "links": "<a href='/AIV/19/119/176'>Ps. 119:176</a>",
      "comment": "Suffering can occur even for the faithful ‘remnant’ who strive to keep the covenant. This matches Christ’s innocence and suffering for others."
    },
    {
      "pk": 1944418,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 18,
      "text": "Our heart has not turned back, nor have our steps departed from Your way;",
      "links": "<a href='/AIV/19/18/21'>Ps. 18:21</a>",
      "comment": "Uprightness in trial. The call to remain faithful under persecution resembles the early martyrs and saints, whose memory is preserved liturgically in Catholic tradition."
    },
    {
      "pk": 1944419,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 19,
      "text": "Yet You have crushed us in the place of jackals and covered us with the shadow of death.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "‘Shadow of death’ evokes the valley in Psalm 23, which is often read at funerals. Catholics place special hope in praying for the dead—a practice rooted in the belief in the Communion of Saints."
    },
    {
      "pk": 1944420,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 20,
      "text": "If we had forgotten the name of our God, or stretched out our hands to a foreign god,",
      "links": "<a href='/AIV/5/6/14'>Deut. 6:14</a>",
      "comment": "Idolatry is rejected. The psalmist insists on fidelity. The Catechism stresses continual conversion to God, and this liturgical prayer fits well in Catholic renewal movements."
    },
    {
      "pk": 1944421,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 21,
      "text": "would not God search this out? For He knows the secrets of the heart.",
      "links": "<a href='/AIV/19/139/1-2'>Ps. 139:1-2</a>; <a href='/AIV/1/3/9'>Gen. 3:9</a>",
      "comment": "God’s omniscience is highlighted—a theme that resonates with the doctrine of God knowing every soul’s heart and intention, which is central at the Last Judgment (Matt. 25:31-46)."
    },
    {
      "pk": 1944422,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 22,
      "text": "Yet for Your sake we are killed all day long; we are regarded as sheep to be slaughtered.",
      "links": "<a href='/AIV/45/8/36'>Rom. 8:36</a>",
      "comment": "Explicitly cited by Paul in Rom. 8:36, linking the suffering of God’s people to Christ’s own Passion. Catholics see martyrdom—and even daily sacrifice—as the highest imitation of Christ."
    },
    {
      "pk": 1944423,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 23,
      "text": "Awake! Why do You sleep, O Lord? Rise up! Do not reject us forever.",
      "links": "<a href='/AIV/19/35/23'>Ps. 35:23</a>; <a href='/AIV/40/8/24-26'>Matt. 8:24-26</a>",
      "comment": "Crying out to God to ‘awake’ echoes the disciples’ appeal to Christ during the storm (Matt. 8:24-26), further connecting Jesus to the LORD in the Psalms."
    },
    {
      "pk": 1944424,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 24,
      "text": "Why do You hide Your face? Why do You forget our misery and oppression?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>",
      "comment": "God’s hiddenness is a common theme in the spiritual life—Catholic mystics like St. John of the Cross speak about the ‘dark night of the soul.’"
    },
    {
      "pk": 1944425,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 25,
      "text": "For our soul is bowed down to the dust; our body clings to the ground.",
      "links": "<a href='/AIV/19/119/25'>Ps. 119:25</a>",
      "comment": "Deep humility is shown; the language of dust recalls our mortality. Catholic liturgy at Ash Wednesday echoes this imagery (‘Remember that you are dust…’)."
    },
    {
      "pk": 1944426,
      "translation": "AIV",
      "book": 19,
      "chapter": 44,
      "verse": 26,
      "text": "Rise up, come to our help! Redeem us for the sake of Your steadfast love.",
      "links": "<a href='/AIV/19/6/4'>Ps. 6:4</a>; <a href='/AIV/19/25/22'>Ps. 25:22</a>",
      "comment": "The prayer for redemption (Heb. ‘pada’) alludes to God’s covenant ‘hesed’—His steadfast love. For Catholics, the fullness of this redemption is Christ’s sacrifice, made present in the Eucharist."
    }
  ],
  "translatedAt": "2025-12-22T21:34:15.472Z"
}