{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 28,
  "verses": [
    {
      "pk": 28001,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 1,
      "text": "To You, LORD, I call; My rock, do not be deaf to me, lest, if You remain silent toward me, I become like those who go down to the pit.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/143/7'>Ps. 143:7</a>",
      "comment": "David addresses God as his 'rock', pointing toward God's steadfastness and the reliance one can have upon Him. The image anticipates Christ as the cornerstone (see <a href='/AIV/40/21/42'>Matt. 21:42</a>), though at this time David is expressing deep dependence on God's mercy. The reference to 'the pit' draws up themes of death and separation, reminiscent of Old Testament concepts of Sheol."
    },
    {
      "pk": 28002,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 2,
      "text": "Hear the voice of my pleading when I cry to You for help, when I lift up my hands toward Your holy sanctuary.",
      "links": "<a href='/AIV/19/5/7'>Ps. 5:7</a>; <a href='/AIV/19/134/2'>Ps. 134:2</a>",
      "comment": "Here David lifts his hands toward the sanctuary—Old Testament worship was always directed toward the place of God's dwelling. Notice the physical expression of prayer, which hints at the sacramental nature of worship seen later in the New Testament Church (<a href='/AIV/54/2/8'>1 Tim. 2:8</a>)."
    },
    {
      "pk": 28003,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 3,
      "text": "Do not drag me away with the wicked, with those who do evil, who speak peace with their neighbors while evil is in their hearts.",
      "links": "<a href='/AIV/19/26/9'>Ps. 26:9</a>; <a href='/AIV/19/12/2'>Ps. 12:2</a>",
      "comment": "David pleads for separation—distinguishing himself from the wicked, aligning his prayer for deliverance with the theme of holiness. There is a call here for integrity, and an implicit encouragement toward confession and reconciliation, hinting at the role of examination of conscience (<a href='/AIV/19/139/23-24'>Ps. 139:23-24</a>)."
    },
    {
      "pk": 28004,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 4,
      "text": "Give to them according to their deeds, and according to the evil of their actions; give to them according to the work of their hands; render to them what they deserve.",
      "links": "<a href='/AIV/19/62/12'>Ps. 62:12</a>; <a href='/AIV/45/2/6'>Rom. 2:6</a>",
      "comment": "A request for God's justice. David appeals to the principle that God judges based on deeds—foreshadowing New Testament teaching on judgment according to works (<a href='/AIV/66/20/12'>Rev. 20:12</a>). The balance between justice and mercy in God's character encourages deeper reflection on the necessity of grace dispensed through sacramental means."
    },
    {
      "pk": 28005,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 5,
      "text": "Because they do not regard the works of the LORD, nor the deeds of His hands, He will tear them down and not build them up.",
      "links": "<a href='/AIV/19/10/4'>Ps. 10:4</a>; <a href='/AIV/19/14/1'>Ps. 14:1</a>",
      "comment": "This verse highlights neglect of God’s revealed works, calling to mind humanity’s tendency to ignore divine action. Rejection of God’s revelation leads to spiritual destruction, an echo of Christ’s warnings against rejecting Him (<a href='/AIV/40/23/37-39'>Matt. 23:37-39</a>)."
    },
    {
      "pk": 28006,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 6,
      "text": "Blessed be the LORD, for He has heard the sound of my prayers.",
      "links": "<a href='/AIV/19/31/22'>Ps. 31:22</a>; <a href='/AIV/19/34/6'>Ps. 34:6</a>",
      "comment": "The psalm turns from petition to thanksgiving, recognizing God’s personal answer to prayer. The theme of God’s active listening is continued in the New Testament, where prayer is united with Christ’s intercession (<a href='/AIV/58/7/25'>Heb. 7:25</a>)."
    },
    {
      "pk": 28007,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 7,
      "text": "The LORD is my strength and my shield; my heart trusts in Him, and I am helped. Therefore my heart rejoices, and with my song I will give thanks to Him.",
      "links": "<a href='/AIV/19/18/1-2'>Ps. 18:1-2</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Themes of trust, joy, and thanksgiving are central here. The language of God as ‘strength’ and ‘shield’ is later fulfilled in Christ, our ultimate protector and mediator (<a href='/AIV/49/6/10-17'>Eph. 6:10-17</a>). The direct correlation of faith and gratitude underpins the Catholic teaching on sanctifying grace enabling worship."
    },
    {
      "pk": 28008,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 8,
      "text": "The LORD is the strength of His people; He is the saving refuge for His anointed.",
      "links": "<a href='/AIV/19/20/6'>Ps. 20:6</a>; <a href='/AIV/19/89/20'>Ps. 89:20</a>",
      "comment": "The title 'His anointed' (Hebrew: Messiah, cf. <a href='/AIV/19/2/2'>Ps. 2:2</a>) is directly messianic, anticipating Christ’s role as the ultimate Savior. The psalm’s collective emphasis ('His people') hints at the communal nature of salvation, realized in the visible Church, the Body of Christ."
    },
    {
      "pk": 28009,
      "translation": "AIV",
      "book": 19,
      "chapter": 28,
      "verse": 9,
      "text": "Save Your people, and bless Your inheritance; shepherd them and carry them forever.",
      "links": "<a href='/AIV/19/78/71-72'>Ps. 78:71-72</a>; <a href='/AIV/19/79/13'>Ps. 79:13</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "David prays for God’s people collectively, with explicit language of 'shepherding' (see <a href='/AIV/19/23/1'>Ps. 23:1</a>). Jesus later fulfills this as the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>). Catholic tradition sees this realized in Christ’s ongoing pastoral care exercised through the ordained magisterium, and in the sacramental life safeguarding God’s 'inheritance'."
    }
  ],
  "translatedAt": "2025-12-22T21:28:53.024Z"
}