{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 24,
  "verses": [
    {
      "pk": 23024001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 1,
      "text": "The earth and everything in it belongs to the LORD—the world and all its inhabitants.",
      "links": "<a href='/AIV/19/50/12'>Ps. 50:12</a>; <a href='/AIV/2/9/29'>Ex. 9:29</a>; <a href='/AIV/46/10/26'>1 Cor. 10:26</a>",
      "comment": "This verse expresses God's universal sovereignty as Creator. The statement that the world and all who dwell in it belong to the LORD connects to both literal possession and spiritual authority. In the New Testament, Paul echoes this theme, emphasizing God's ownership over creation."
    },
    {
      "pk": 23024002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 2,
      "text": "For He founded it upon the seas and established it on the rivers.",
      "links": "<a href='/AIV/1/1/9-10'>Gen. 1:9-10</a>; <a href='/AIV/19/136/6'>Ps. 136:6</a>",
      "comment": "God's establishment of the earth upon the waters ties back to Genesis creation. This imagery symbolizes both God's creative power and the ordering of chaos, which also prefigures baptism—transforming disorder into new life (see Gen. 1:9-10)."
    },
    {
      "pk": 23024003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 3,
      "text": "Who may ascend the mountain of the LORD? Who may stand in His holy place?",
      "links": "<a href='/AIV/19/15/1'>Ps. 15:1</a>; <a href='/AIV/1/28/12'>Gen. 28:12</a>; <a href='/AIV/19/43/3'>Ps. 43:3</a>",
      "comment": "This verse asks who is worthy to approach God’s presence. The question anticipates both access to worship and ultimate communion with God, which is fulfilled through holiness and sacrifice. The imagery foreshadows the ascending of Christ and His role as mediator (see Heb. 10:19-22)."
    },
    {
      "pk": 23024004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 4,
      "text": "He who has clean hands and a pure heart, who does not lift up his soul to an idol or swear deceitfully.",
      "links": "<a href='/AIV/19/73/1'>Ps. 73:1</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>; <a href='/AIV/19/15/2'>Ps. 15:2</a>",
      "comment": "The requirements—clean hands, pure heart, rejecting idolatry, and honesty—point to an interior transformation multiplied by sacramental cleansing and faithfulness. The spiritual meaning points toward the righteousness imparted through Christ and the necessity of true worship."
    },
    {
      "pk": 23024005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 5,
      "text": "He will receive blessing from the LORD and righteousness from the God of his salvation.",
      "links": "<a href='/AIV/19/85/11'>Ps. 85:11</a>; <a href='/AIV/45/4/5'>Rom. 4:5</a>",
      "comment": "Blessing and righteousness come from God, not human effort. This is key to understanding salvation: a gift received, not earned. The personal nature of salvation is highlighted, pointing toward the necessity of God’s grace communicated through faith and divine life."
    },
    {
      "pk": 23024006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 6,
      "text": "Such is the generation of those who seek Him, who seek Your face, O God of Jacob.",
      "links": "<a href='/AIV/19/27/8'>Ps. 27:8</a>; <a href='/AIV/19/105/4'>Ps. 105:4</a>",
      "comment": "Seeking God's face is a call to intimate relationship, reminiscent of the biblical concept of seeking God's presence through communal worship and prayer. The reference to 'generation' indicates a people set apart, highlighting the continuity of God’s people and the importance of tradition in the faith."
    },
    {
      "pk": 23024007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 7,
      "text": "Lift up your heads, O gates! Be lifted up, you ancient doors, that the King of glory may enter.",
      "links": "<a href='/AIV/19/118/19'>Ps. 118:19-20</a>; <a href='/AIV/66/3/20'>Rev. 3:20</a>",
      "comment": "This triumphant entrance anticipates the coming of the Lord into His sanctuary. Tradition interprets this as a prophetic vision fulfilled in Christ’s ascension, entering the heavenly temple, also connecting to sacramental worship as participation in the reality of heaven."
    },
    {
      "pk": 23024008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 8,
      "text": "Who is this King of glory? The LORD, strong and mighty, the LORD, mighty in battle.",
      "links": "<a href='/AIV/19/29/1'>Ps. 29:1-2</a>; <a href='/AIV/66/19/16'>Rev. 19:16</a>",
      "comment": "The King of glory is the LORD, a title that holds messianic hopes. Christ is revealed as the victorious King, overcoming sin and death, and fulfilling the promise of true kingship in spiritual and historical dimensions."
    },
    {
      "pk": 23024009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 9,
      "text": "Lift up your heads, O gates! Be lifted up, you ancient doors, that the King of glory may enter.",
      "links": "<a href='/AIV/19/24/7'>Ps. 24:7</a>; <a href='/AIV/19/118/20'>Ps. 118:20</a>",
      "comment": "Repeating verse 7 emphasizes the significance of the King’s entry. Liturgically, this became associated with processions and the welcoming of the Lord’s presence, prefiguring Christ's final coming and entry into the new and eternal Temple."
    },
    {
      "pk": 23024010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 24,
      "verse": 10,
      "text": "Who is this King of glory? The LORD of hosts—He is the King of glory.",
      "links": "<a href='/AIV/19/84/3'>Ps. 84:3</a>; <a href='/AIV/1/14/18'>Gen. 14:18</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "The final answer confirms God’s identity as ruler over all. In Christian tradition, this is seen as Christ, triumphant in heaven. The ‘hosts’ points to both the heavenly assembly and the gathered people in worship, connecting the visible and invisible church in unity."
    }
  ],
  "translatedAt": "2025-12-24T06:06:28.611Z"
}