{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 18,
  "verses": [
    {
      "pk": 1841001,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 1,
      "text": "I love you, O LORD, my strength.",
      "links": "<a href='/AIV/19/116/1'>Ps. 116:1</a>",
      "comment": "David opens with a declaration of love for God. The Hebrew word for 'love' used here uniquely expresses deep affection—uncommon for expressing man’s love toward God elsewhere in the Psalms. This verse highlights the personal and intimate relationship between David and the LORD, setting the tone for the Psalm."
    },
    {
      "pk": 1841002,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 2,
      "text": "The LORD is my rock, my fortress, and my deliverer, my God, my rock in whom I take refuge, my shield, and the horn of my salvation, my stronghold.",
      "links": "<a href='/AIV/19/31/3'>Ps. 31:3</a>; <a href='/AIV/19/144/2'>Ps. 144:2</a>",
      "comment": "'Horn of my salvation' is a figure of strength, echoing the power often attributed to horns in ancient cultures (see 1 Samuel 2:10). The repetition of protection imagery points to God as the unshakable foundation and source of rescue, anticipating Christ as the ultimate Redeemer and fortress (Luke 1:69)."
    },
    {
      "pk": 1841003,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 3,
      "text": "I call upon the LORD, who is worthy to be praised, and I am saved from my enemies.",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "Praise and salvation are closely tied here, suggesting the efficacy of worship and prayer in divine deliverance. The theme prefigures salvation through calling upon the Lord, an idea fulfilled fully through Christ (Romans 10:13)."
    },
    {
      "pk": 1841004,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 4,
      "text": "The cords of death surrounded me, and the torrents of destruction overwhelmed me;",
      "links": "<a href='/AIV/19/116/3'>Ps. 116:3</a>",
      "comment": "'Cords of death' and 'torrents of destruction' are poetic images representing mortally dangerous situations. These metaphors continue throughout the psalm and are later echoed in Messianic contexts—referenced in Christ’s agony (Matthew 26:38)."
    },
    {
      "pk": 1841005,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 5,
      "text": "the cords of Sheol entangled me, the snares of death confronted me.",
      "links": "<a href='/AIV/19/116/3'>Ps. 116:3</a>",
      "comment": "‘Sheol’ refers to the abode of the dead in Hebrew thought. The imagery stresses the hopelessness apart from God’s deliverance, pointing towards ultimate rescue from death found in Christ’s resurrection (Acts 2:24-27)."
    },
    {
      "pk": 1841006,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 6,
      "text": "In my distress I called upon the LORD; to my God I cried for help. From his temple he heard my voice, and my cry before him reached his ears.",
      "links": "<a href='/AIV/19/34/6'>Ps. 34:6</a>; <a href='/AIV/19/65/2'>Ps. 65:2</a>",
      "comment": "'His temple' signifies the heavenly sanctuary. The verse assures that God hears prayer from his people, no matter where they are. The reality of intercessory prayer and mediation is subtly reflected here."
    },
    {
      "pk": 1841007,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 7,
      "text": "Then the earth shook and quaked; and the foundations of the mountains trembled; they shook because he was angry.",
      "links": "<a href='/AIV/19/77/18'>Ps. 77:18</a>; <a href='/AIV/2/19/18'>Ex. 19:18</a>",
      "comment": "Theophanic imagery (God appearing with power) recalls Sinai and other manifestations of God's presence in the Old Testament. Anger at injustice and evil is a recurring biblical theme."
    },
    {
      "pk": 1841008,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 8,
      "text": "Smoke went up from his nostrils and devouring fire from his mouth; glowing coals blazed forth from him.",
      "links": "<a href='/AIV/2/19/18'>Ex. 19:18</a>; <a href='/AIV/66/11/5'>Rev. 11:5</a>",
      "comment": "God's wrath here is depicted in dramatic, almost volcanic terms. The consuming fire is a consistent symbol for God's holiness and power (Hebrews 12:29)."
    },
    {
      "pk": 1841009,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 9,
      "text": "He bowed the heavens and came down; thick darkness was under his feet.",
      "links": "<a href='/AIV/2/19/16'>Ex. 19:16</a>",
      "comment": "A poetic description of God's nearness and omnipotent intervention in human affairs, reminiscent of Sinai. The darkness symbolizes holy mystery and transcendence."
    },
    {
      "pk": 1841010,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 10,
      "text": "He rode on a cherub and flew; he was seen on the wings of the wind.",
      "links": "<a href='/AIV/10/22/11'>2 Sam. 22:11</a>; <a href='/AIV/19/104/3'>Ps. 104:3</a>",
      "comment": "Cherubs are angelic beings associated with God’s throne. Imagery denotes God’s absolute authority and swiftness in delivering his people (cf. Ezekiel 10:1–2)."
    },
    {
      "pk": 1841011,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 11,
      "text": "He made darkness his covering, his canopy around him, thick clouds, dark with water.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>",
      "comment": "Darkness and clouds signal the impenetrable and awe-inspiring nature of God, shrouding his immediate presence (Exodus 20:21)."
    },
    {
      "pk": 1841012,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 12,
      "text": "Out of the brightness before him hailstones and coals of fire broke through his clouds.",
      "links": "<a href='/AIV/2/9/23'>Ex. 9:23–24</a>",
      "comment": "God’s judgment is portrayed using weather phenomena, echoing the plagues in Egypt. Hail and fire signify both judgment and purification—motifs later applied spiritually to the coming of the Holy Spirit (Acts 2:3)."
    },
    {
      "pk": 1841013,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 13,
      "text": "The LORD thundered in the heavens, and the Most High uttered his voice, hailstones and coals of fire.",
      "links": "<a href='/AIV/2/9/23'>Ex. 9:23</a>; <a href='/AIV/19/29/3'>Ps. 29:3</a>",
      "comment": "Thunder is often associated with God’s voice and power (John 12:28–29). The repetition intensifies the display of God’s majesty."
    },
    {
      "pk": 1841014,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 14,
      "text": "He sent out his arrows and scattered them; he flashed forth lightning and routed them.",
      "links": "<a href='/AIV/19/77/17'>Ps. 77:17</a>; <a href='/AIV/19/144/6'>Ps. 144:6</a>",
      "comment": "‘Arrows’ and lightning describe God’s overwhelming strikes against evil. The language also foreshadows divine judgment at the end of time (Matthew 24:27)."
    },
    {
      "pk": 1841015,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 15,
      "text": "Then the channels of the sea were seen, and the foundations of the world were laid bare at your rebuke, O LORD, at the blast of the breath of your nostrils.",
      "links": "<a href='/AIV/2/14/21'>Ex. 14:21</a>; <a href='/AIV/19/104/7'>Ps. 104:7</a>",
      "comment": "This refers to the miraculous splitting of the Red Sea (Exodus 14). The underlying theme is that God has universal authority, able to reveal or cover creation as he wills."
    },
    {
      "pk": 1841016,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 16,
      "text": "He reached down from on high, he took me; he drew me out of many waters.",
      "links": "<a href='/AIV/2/2/10'>Ex. 2:10</a>; <a href='/AIV/19/144/7'>Ps. 144:7</a>",
      "comment": "‘Drew me out of many waters’ uses Exodus/Moses imagery, symbolizing rescue from chaos and threat. Early Christian interpretations view this as a type of baptism—a deliverance by God from death (1 Peter 3:20–21)."
    },
    {
      "pk": 1841017,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 17,
      "text": "He rescued me from my strong enemy and from those who hated me, for they were too mighty for me.",
      "links": "<a href='/AIV/19/35/10'>Ps. 35:10</a>",
      "comment": "David acknowledges his weakness and God's sufficiency, modeling humility and total reliance on divine power (2 Corinthians 12:9–10)."
    },
    {
      "pk": 1841018,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 18,
      "text": "They confronted me in the day of my calamity, but the LORD was my support.",
      "links": "",
      "comment": "The theme of steadfast support foreshadows Christ as the ultimate help in moments of distress (Hebrews 2:18)."
    },
    {
      "pk": 1841019,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 19,
      "text": "He brought me out into a broad place; he rescued me, because he delighted in me.",
      "links": "<a href='/AIV/19/31/8'>Ps. 31:8</a>",
      "comment": "The ‘broad place’ denotes freedom and safety, representing salvation. God's delight in his people suggests the intimate parental relationship exemplified in Christ’s redemption (Matthew 3:17)."
    },
    {
      "pk": 1841020,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 20,
      "text": "The LORD rewarded me according to my righteousness; according to the cleanness of my hands he repaid me.",
      "links": "<a href='/AIV/19/7/8'>Ps. 7:8</a>",
      "comment": "While appearing to champion works-righteousness, the psalm also highlights grace—the Lord initiates and empowers righteousness in His people (Philippians 2:13). The theme anticipates the necessity of being made clean to stand before God, fulfilled through Christ."
    },
    {
      "pk": 1841021,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 21,
      "text": "For I have kept the ways of the LORD, and have not wickedly departed from my God.",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>",
      "comment": "Walking in the ways of God is a continual biblical theme, signifying faithfulness and covenant fidelity—bearing both individual and communal implications."
    },
    {
      "pk": 1841022,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 22,
      "text": "For all his rules were before me, and I did not put away his statutes from me.",
      "links": "<a href='/AIV/19/119/102'>Ps. 119:102</a>",
      "comment": "Faithful observance of God's law is often correlated with blessing and protection (Deut. 11:26-28), setting a pattern for spiritual and moral discipline."
    },
    {
      "pk": 1841023,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 23,
      "text": "I was blameless before him, and I kept myself from my guilt.",
      "links": "<a href='/AIV/19/24/4'>Ps. 24:4</a>",
      "comment": "‘Blameless’ reflects ritual and moral purity, always dependent upon ongoing repentance and divine mercy. Implies a sacramental understanding of atonement (Leviticus 16:30)."
    },
    {
      "pk": 1841024,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 24,
      "text": "So the LORD has rewarded me according to my righteousness, according to the cleanness of my hands in his sight.",
      "links": "<a href='/AIV/19/7/8'>Ps. 7:8</a>",
      "comment": "A repetition reinforcing divine justice, yet always in context of God’s grace—no one is truly righteous apart from divine help (Romans 3:10)."
    },
    {
      "pk": 1841025,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 25,
      "text": "With the merciful you show yourself merciful; with the blameless man you show yourself blameless;",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>; <a href='/AIV/40/5/7'>Matt. 5:7</a>",
      "comment": "God reciprocates the disposition of people towards him—prefiguring the Beatitudes (Matt. 5:7)."
    },
    {
      "pk": 1841026,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 26,
      "text": "with the pure you show yourself pure; but with the crooked you make yourself seem twisted.",
      "links": "<a href='/AIV/3/26/23-24'>Lev. 26:23–24</a>",
      "comment": "God’s dealings reflect the hearts of those who approach him. The statement anticipates later biblical teaching on spiritual ‘reaping what one sows’ (Galatians 6:7)."
    },
    {
      "pk": 1841027,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 27,
      "text": "For you save a humble people, but the haughty eyes you bring down.",
      "links": "<a href='/AIV/19/147/6'>Ps. 147:6</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "Humility is exalted and pride is cast down. The virtue of humility is set forth as necessary for salvation, fulfilled perfectly in Christ (Philippians 2:5–8)."
    },
    {
      "pk": 1841028,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 28,
      "text": "For you light my lamp; the LORD my God lightens my darkness.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/19/132/17'>Ps. 132:17</a>",
      "comment": "God as light is a common spiritual metaphor, pointing toward themes of illumination and truth. Christ declares himself the Light of the World (John 8:12)."
    },
    {
      "pk": 1841029,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 29,
      "text": "For by you I can run against a troop, and by my God I can leap over a wall.",
      "links": "<a href='/AIV/19/118/10-12'>Ps. 118:10–12</a>",
      "comment": "All courage and achievement are attributed to God’s strength. This foreshadows New Testament teaching: 'I can do all things through him who strengthens me' (Philippians 4:13)."
    },
    {
      "pk": 1841030,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 30,
      "text": "This God—his way is perfect; the word of the LORD proves true; he is a shield for all who take refuge in him.",
      "links": "<a href='/AIV/19/12/6'>Ps. 12:6</a>; <a href='/AIV/19/84/11'>Ps. 84:11</a>",
      "comment": "God’s perfection and fidelity are underlined here. His Word is a tested foundation—inviting the believer to full trust and fidelity."
    },
    {
      "pk": 1841031,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 31,
      "text": "For who is God, but the LORD? And who is a rock, except our God?",
      "links": "<a href='/AIV/5/32/4'>Deut. 32:4</a>",
      "comment": "Affirmation of monotheism and the singular reliability of God as foundation—a precursor to New Testament revelation of Christ as the true Rock (1 Corinthians 10:4)."
    },
    {
      "pk": 1841032,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 32,
      "text": "the God who equipped me with strength and made my way blameless;",
      "links": "<a href='/AIV/19/18/20'>Ps. 18:20</a>",
      "comment": "All virtue and victory are attributed to divine empowerment. Righteousness is never self-established; God is its source (Ephesians 2:10)."
    },
    {
      "pk": 1841033,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 33,
      "text": "he made my feet like the feet of a deer and set me secure on the heights.",
      "links": "<a href='/AIV/35/3/19'>Hab. 3:19</a>",
      "comment": "Swift-footedness and stability evoke images of divine enablement for spiritual life, also echoed in Habakkuk 3:19."
    },
    {
      "pk": 1841034,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 34,
      "text": "He trains my hands for battle, so that my arms can bend a bow of bronze.",
      "links": "<a href='/AIV/10/22/35'>2 Sam. 22:35</a>",
      "comment": "'Bow of bronze' points to extraordinary strength provided by God. The spiritual application references readiness for spiritual warfare (Ephesians 6:10–18)."
    },
    {
      "pk": 1841035,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 35,
      "text": "You have given me the shield of your salvation, and your right hand supported me, and your gentleness made me great.",
      "links": "<a href='/AIV/19/63/8'>Ps. 63:8</a>; <a href='/AIV/19/89/21'>Ps. 89:21'</a>",
      "comment": "God’s gentleness' (also 'meekness' or 'condescension') is powerful—a paradox that finds fulfillment in the humility of Jesus (Philippians 2:6–8)."
    },
    {
      "pk": 1841036,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 36,
      "text": "You gave a wide place for my steps under me, and my feet did not slip.",
      "links": "<a href='/AIV/19/31/8'>Ps. 31:8</a>",
      "comment": "Steadfastness and security symbolize enduring faith and the security of following the path God lays out."
    },
    {
      "pk": 1841037,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 37,
      "text": "I pursued my enemies and overtook them, and did not turn back until they were consumed.",
      "links": "<a href='/AIV/5/28/7'>Deut. 28:7</a>",
      "comment": "David’s victories are attributed to God’s empowerment. The spiritual interpretation: God equips the faithful for victory over sin and evil."
    },
    {
      "pk": 1841038,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 38,
      "text": "I thrust them through, so that they were not able to rise; they fell under my feet.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Defeat of enemies represents total victory, also symbolically referring to Christ placing all enemies under his feet (1 Corinthians 15:25)."
    },
    {
      "pk": 1841039,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 39,
      "text": "For you equipped me with strength for the battle; you made those who rise against me sink under me.",
      "links": "",
      "comment": "Theme of divinely endowed power continues. All victory is ultimately a result of reliance on God."
    },
    {
      "pk": 1841040,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 40,
      "text": "You made my enemies turn their backs to me, and those who hated me I destroyed.",
      "links": "",
      "comment": "David claims not personal credit, but attributes victory entirely to God’s intervention."
    },
    {
      "pk": 1841041,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 41,
      "text": "They cried for help, but there was none to save; to the LORD, but he did not answer them.",
      "links": "<a href='/AIV/20/1/28'>Prov. 1:28</a>",
      "comment": "The judgment of God may include the removal of his aid from the unrepentant—mirroring the fate of those rejecting grace."
    },
    {
      "pk": 1841042,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 42,
      "text": "I beat them as fine as dust before the wind; I cast them out like the mud of the streets.",
      "links": "<a href='/AIV/2/15/7'>Ex. 15:7'</a>",
      "comment": "The imagery is total; symbolizes the triumph of good over evil anticipated finally in the Messianic reign."
    },
    {
      "pk": 1841043,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 43,
      "text": "You delivered me from strife with the people; you made me the head of the nations; a people whom I had not known served me.",
      "links": "<a href='/AIV/10/8/1-2'>2 Sam. 8:1–2</a>",
      "comment": "David as 'head of the nations' foreshadows the Messianic kingdom, in which all peoples come under the one Shepherd (Ephesians 1:22)."
    },
    {
      "pk": 1841044,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 44,
      "text": "As soon as they heard of me they obeyed me; foreigners came cringing to me.",
      "links": "<a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "This anticipates the spread of worship to all nations, fulfilled spiritually in the universal proclamation of the gospel."
    },
    {
      "pk": 1841045,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 45,
      "text": "Foreigners lost heart and came trembling out of their strongholds.",
      "links": "",
      "comment": "Depicts the power and authority of God’s anointed. Gentile nations recognize divine authority."
    },
    {
      "pk": 1841046,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 46,
      "text": "The LORD lives, and blessed be my rock, and exalted be the God of my salvation—",
      "links": "<a href='/AIV/19/144/1'>Ps. 144:1</a>",
      "comment": "Expression of heartfelt thanksgiving, celebrating the living God—contrasted with lifeless idols."
    },
    {
      "pk": 1841047,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 47,
      "text": "the God who gave me vengeance and subdued peoples under me,",
      "links": "<a href='/AIV/19/144/2'>Ps. 144:2</a>",
      "comment": "God as the one who establishes justice and universal rule is stressed. Echoes the right of God to judge and vindicate his faithful."
    },
    {
      "pk": 1841048,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 48,
      "text": "who rescued me from my enemies; yes, you lifted me up above those who rose against me; you delivered me from the man of violence.",
      "links": "",
      "comment": "God’s deliverance extends to both spiritual and physical enemies. There is an implicit Messianic fulfillment in Christ, who triumphed over every enemy."
    },
    {
      "pk": 1841049,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 49,
      "text": "For this I will praise you, O LORD, among the nations, and sing to your name.",
      "links": "<a href='/AIV/45/15/9'>Rom. 15:9</a>",
      "comment": "Paul applies this verse to Gentile inclusion in Christ (Romans 15:9), foreshadowing the worldwide worship of the true God."
    },
    {
      "pk": 1841050,
      "translation": "AIV",
      "book": 19,
      "chapter": 18,
      "verse": 50,
      "text": "Great salvation he brings to his king, and shows steadfast love to his anointed, to David and his offspring forever.",
      "links": "<a href='/AIV/42/1/33'>Luke 1:33</a>; <a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>",
      "comment": "‘Anointed’ means ‘Messiah’ in Hebrew. The everlasting covenant with David points to the perpetual reign of Christ, in whose kingdom God’s love endures forever—fulfilling Old Testament prophecy in the New (Luke 1:32–33)."
    }
  ],
  "translatedAt": "2025-12-23T05:36:52.706Z"
}