{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 100,
  "verses": [
    {
      "pk": 23100001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 100,
      "verse": 1,
      "text": "Shout with joy to the LORD, all the earth!",
      "links": "<a href='/AIV/19/98/4'>Ps. 98:4</a>; <a href='/AIV/19/66/1'>Ps. 66:1</a>",
      "comment": "This call to worship is universal—all lands are included, anticipating the global nature of God's people (see Ps. 98:4). Here, even Gentiles are invited to worship. The joyful shout prefigures the praise directed to Christ by all nations (Rom. 15:11; Rev. 7:9)."
    },
    {
      "pk": 23100002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 100,
      "verse": 2,
      "text": "Serve the LORD with gladness; come into his presence with singing.",
      "links": "<a href='/AIV/19/95/2'>Ps. 95:2</a>; <a href='/AIV/19/2/11'>Ps. 2:11</a>",
      "comment": "Serving God is connected with joy and worship. Worship isn't meant to be perfunctory, but heartfelt, aligning with Jesus' teaching that true worshipers worship in spirit and truth (John 4:23). Entering his presence has sacramental echoes, as ancient Israel did in the temple, later fulfilled in the worship assembly (Heb. 10:25)."
    },
    {
      "pk": 23100003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 100,
      "verse": 3,
      "text": "Know that the LORD is God. He made us, and we are his—his people, the sheep of his pasture.",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/43/10/14'>John 10:14</a>",
      "comment": "This verse affirms God's sovereignty in creation and his intimate care. Calling believers 'sheep' echoes Jesus as the Good Shepherd (John 10:11-16), pointing to the continuity of God's covenant family throughout history. The phrase 'he made us' supports the idea of God's initiative and authority over his people, which extends to the gathering of the faithful (see Ps. 95:7)."
    },
    {
      "pk": 23100004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 100,
      "verse": 4,
      "text": "Enter his gates with thanksgiving, and his courts with praise! Give thanks to him and bless his name.",
      "links": "<a href='/AIV/19/116/19'>Ps. 116:19</a>; <a href='/AIV/19/95/2'>Ps. 95:2</a>; <a href='/AIV/19/118/19'>Ps. 118:19</a>",
      "comment": "Approaching God with thanksgiving was performed in the temple, foreshadowing the Christian call to participate in sacred worship with grateful hearts (see Heb. 13:15). 'Gates' and 'courts' suggest a holy space dedicated for God’s praise, paralleling the assembly of believers who draw near to God together (Ps. 118:19). Notice the communal dimension of worship—a sign of unity and continuity."
    },
    {
      "pk": 23100005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 100,
      "verse": 5,
      "text": "For the LORD is good; his steadfast love endures forever, and his faithfulness reaches every generation.",
      "links": "<a href='/AIV/19/89/1'>Ps. 89:1</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>; <a href='/AIV/19/103/17'>Ps. 103:17</a>",
      "comment": "God's unwavering love and faithfulness are emphasized, promising that his care extends continually through the ages. This enduring mercy finds its fulfillment in Christ, whose new covenant gathers all nations into one family (see Ps. 103:17; Rom. 11:32). This verse is often sung in Christian liturgy, highlighting the tradition of praise connected from ancient Israel to present-day worship."
    }
  ],
  "translatedAt": "2025-12-24T06:34:02.697Z"
}