{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 51,
  "verses": [
    {
      "pk": 5101001,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 1,
      "text": "Have mercy on me, O God, according to your steadfast love; according to your abundant mercy, blot out my transgressions.",
      "links": "<a href='/AIV/19/6/4'>Psalm 6:4</a>; <a href='/AIV/19/86/5'>Psalm 86:5</a>",
      "comment": "The plea for God's mercy is grounded in His faithful and covenantal love (Hebrew: 'chesed'), a term used consistently to describe God's lovingkindness. The Catholic understanding of mercy here aligns with the need for sacramental reconciliation."
    },
    {
      "pk": 5101002,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 2,
      "text": "Wash me thoroughly from my guilt, and cleanse me from my sin.",
      "links": "<a href='/AIV/19/19/12'>Psalm 19:12</a>; <a href='/AIV/19/32/5'>Psalm 32:5</a>",
      "comment": "David uses language of washing and cleansing, prefiguring baptism's role in removing sin and pointing towards sacramental confession for restoration after baptism."
    },
    {
      "pk": 5101003,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 3,
      "text": "For I know my transgressions, and my sin is always before me.",
      "links": "<a href='/AIV/19/38/18'>Psalm 38:18</a>",
      "comment": "Awareness of sin reflects necessary contrition before forgiveness. This acknowledges the importance of both interior repentance and public confession, themes central to the Catholic sacrament of Penance."
    },
    {
      "pk": 5101004,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 4,
      "text": "Against you, you alone, have I sinned, and done what is evil in your sight; so you are justified when you speak and blameless when you judge.",
      "links": "<a href='/AIV/2/32/30-32'>Ex. 32:30–32</a>; <a href='/AIV/45/3/4'>Rom. 3:4</a>",
      "comment": "Though sin harms others, it is ultimately rebellion against God. Paul quotes this verse in Romans to establish God’s justice. Both Protestant and Catholic traditions see this as essential for true repentance."
    },
    {
      "pk": 5101005,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 5,
      "text": "Behold, I was brought forth in iniquity, and in sin did my mother conceive me.",
      "links": "<a href='/AIV/18/14/4'>Job 14:4</a>; <a href='/AIV/19/58/3'>Psalm 58:3</a>",
      "comment": "This verse is a key proof-text for the doctrine of original sin, recognized in both traditions, though Catholics distinguish the Immaculate Conception of Mary as an exception (cf. Luke 1:28)."
    },
    {
      "pk": 5101006,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 6,
      "text": "Behold, you desire truth in the inward being, and in the secret heart you will teach me wisdom.",
      "links": "<a href='/AIV/1/6/5'>Gen. 6:5</a>; <a href='/AIV/19/15/2'>Psalm 15:2</a>",
      "comment": "True repentance and wisdom come from within; the purification of the inner self is a recurring Catholic emphasis, connected to transformation by God’s grace."
    },
    {
      "pk": 5101007,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 7,
      "text": "Purify me with hyssop, and I shall be clean; wash me, and I shall be whiter than snow.",
      "links": "<a href='/AIV/3/14/49-52'>Lev. 14:49–52</a>; <a href='/AIV/23/1/18'>Isa. 1:18</a>; <a href='/AIV/58/9/13-14'>Heb. 9:13–14</a>",
      "comment": "Hyssop was used in ritual purification. This anticipates how the blood of Christ cleanses us (see Hebrews 9:13–14), a sacramental reality in Catholic theology."
    },
    {
      "pk": 5101008,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 8,
      "text": "Let me hear joy and gladness; let the bones you have crushed rejoice.",
      "links": "<a href='/AIV/19/32/3-4'>Psalm 32:3–4</a>",
      "comment": "Restoration brings true joy after repentance; the imagery of physical brokenness and healing has resonance in spiritual healing found in the sacraments."
    },
    {
      "pk": 5101009,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 9,
      "text": "Hide your face from my sins, and blot out all my iniquities.",
      "links": "<a href='/AIV/1/4/14'>Gen. 4:14</a>; <a href='/AIV/19/32/1-2'>Psalm 32:1–2</a>",
      "comment": "David asks for forgiveness, not to be cast away. This is a prayer for total absolution, as is found through priestly mediation in Catholic understanding."
    },
    {
      "pk": 5101010,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 10,
      "text": "Create in me a clean heart, O God, and renew a right spirit within me.",
      "links": "<a href='/AIV/26/36/26'>Ezek. 36:26</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "The word for 'create' echoes the language of Genesis. This verse prefigures the transformation by grace received at baptism and the indwelling of the Holy Spirit."
    },
    {
      "pk": 5101011,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 11,
      "text": "Do not cast me away from your presence, and do not take your Holy Spirit from me.",
      "links": "<a href='/AIV/9/16/14'>1 Sam. 16:14</a>; <a href='/AIV/19/143/10'>Psalm 143:10</a>",
      "comment": "Invoking the Holy Spirit shows the Spirit's Old Testament presence (see also Wisdom 1:5). The Catholic Church teaches He comes in fullness at Confirmation."
    },
    {
      "pk": 5101012,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 12,
      "text": "Restore to me the joy of your salvation, and uphold me with a willing spirit.",
      "links": "<a href='/AIV/35/3/18'>Hab. 3:18</a>; <a href='/AIV/19/126/3-6'>Psalm 126:3–6</a>",
      "comment": "The restoration of joy and perseverance depend on God. In Catholic thought, final perseverance is a grace to be humbly sought for."
    },
    {
      "pk": 5101013,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 13,
      "text": "Then I will teach transgressors your ways, and sinners will return to you.",
      "links": "<a href='/AIV/19/32/8'>Psalm 32:8</a>; <a href='/AIV/42/22/32'>Luke 22:32</a>",
      "comment": "Having been forgiven, the psalmist pledges public witness, much like the Church publicly proclaims the message of reconciliation and penance."
    },
    {
      "pk": 5101014,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 14,
      "text": "Deliver me from bloodguiltiness, O God, O God of my salvation, and my tongue will sing aloud of your righteousness.",
      "links": "<a href='/AIV/2/20/13'>Ex. 20:13</a>; <a href='/AIV/19/71/15'>Psalm 71:15</a>",
      "comment": "References bloodguilt, probably the murder of Uriah. Here, forgiveness leads to praise, reflecting Catholic liturgical tradition—penance leads to restored worship."
    },
    {
      "pk": 5101015,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 15,
      "text": "O Lord, open my lips, and my mouth will declare your praise.",
      "links": "<a href='/AIV/19/40/3'>Psalm 40:3</a>; <a href='/AIV/35/3/18'>Hab. 3:18</a>",
      "comment": "This phrase is used every day in the Catholic Liturgy of the Hours, indicating its ongoing liturgical fulfillment."
    },
    {
      "pk": 5101016,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 16,
      "text": "For you do not delight in sacrifice, or I would give it; you do not take pleasure in burnt offering.",
      "links": "<a href='/AIV/23/1/11'>Isa. 1:11</a>; <a href='/AIV/28/6/6'>Hos. 6:6</a>",
      "comment": "David recognizes that ritual sacrifice alone cannot substitute for a contrite heart, which Catholic theology upholds in the necessity of interior conversion accompanying exterior practice."
    },
    {
      "pk": 5101017,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 17,
      "text": "The sacrifices of God are a broken spirit; a broken and contrite heart, O God, you will not despise.",
      "links": "<a href='/AIV/19/34/18'>Psalm 34:18</a>; <a href='/AIV/23/57/15'>Isa. 57:15</a>",
      "comment": "God desires sincere repentance. Catholics see this as foundational to the attitude required for effective participation in the sacrament of confession."
    },
    {
      "pk": 5101018,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 18,
      "text": "In your good pleasure, do good to Zion; build up the walls of Jerusalem.",
      "links": "<a href='/AIV/19/102/16'>Psalm 102:16</a>; <a href='/AIV/15/4/12'>Neh. 4:12</a>",
      "comment": "Prays for the prosperity of Jerusalem. The Church is seen as the new Jerusalem (see Rev. 21:2); Catholic interpretation holds that individual conversion brings blessings to the whole community."
    },
    {
      "pk": 5101019,
      "translation": "AIV",
      "book": 19,
      "chapter": 51,
      "verse": 19,
      "text": "Then you will delight in righteous sacrifices, in burnt offerings and whole burnt offerings; then bulls will be offered on your altar.",
      "links": "<a href='/AIV/5/33/19'>Deut. 33:19</a>; <a href='/AIV/40/5/23-24'>Matt. 5:23–24</a>",
      "comment": "Sacrifices are acceptable when offered in righteousness. The Church teaches that the Eucharist is the unbloody re-presentation of Christ’s one sacrifice, the fulfillment of all Old Testament sacrifice."
    }
  ],
  "translatedAt": "2025-12-22T21:36:25.132Z"
}