{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 70,
  "verses": [
    {
      "pk": 70001,
      "translation": "AIV",
      "book": 19,
      "chapter": 70,
      "verse": 1,
      "text": "God, hurry to rescue me; LORD, make haste to help me.",
      "links": "<a href='/AIV/19/40/13'>Psalm 40:13</a>; <a href='/AIV/19/71/12'>Psalm 71:12</a>",
      "comment": "This urgent prayer for deliverance closely matches the Hebrew and is echoed in liturgical tradition, especially in the Catholic Liturgy of the Hours as an opening invocation. The capitalization of both 'God' and 'LORD' maintains the distinction between 'Elohim' and 'Yahweh' in the original text. Protestants may recognize this as a model of petition, but Catholics employ it as a frequent, communal prayer—hinting at the value of liturgy and tradition in the spiritual life."
    },
    {
      "pk": 70002,
      "translation": "AIV",
      "book": 19,
      "chapter": 70,
      "verse": 2,
      "text": "Let those who seek my life be turned back and ashamed; let those who take pleasure in my misfortune be disgraced.",
      "links": "<a href='/AIV/19/35/4'>Psalm 35:4</a>; <a href='/AIV/19/71/13'>Psalm 71:13</a>",
      "comment": "Imprecatory elements here express righteous indignation against evil. This strongly literal translation preserves the cause-and-effect parallelism of the original. Spiritual reading in the Catholic tradition often connects such prayers to the battle against spiritual enemies and encourages prayers for conversion, not just punishment, subtly alluding to Catholic teaching on intercession for sinners."
    },
    {
      "pk": 70003,
      "translation": "AIV",
      "book": 19,
      "chapter": 70,
      "verse": 3,
      "text": "Let them be turned back in humiliation, those who say, 'Aha! Aha!' to me.",
      "links": "<a href='/AIV/19/35/21'>Psalm 35:21</a>; <a href='/AIV/19/40/15'>Psalm 40:15</a>",
      "comment": "The phrase 'Aha! Aha!' is a direct quote from the Hebrew, expressing mocking or scorn. Its use in prophetic taunts foreshadows Christ's own experience of ridicule during His Passion (<a href='/AIV/40/27/39-43'>Matt. 27:39-43</a>), which Catholics often meditate on during the Stations of the Cross. Readers are quietly invited to see Christ as fulfilling these patterns—a gentle introduction to typological (Catholic) interpretation."
    },
    {
      "pk": 70004,
      "translation": "AIV",
      "book": 19,
      "chapter": 70,
      "verse": 4,
      "text": "But let all who seek You rejoice and be glad in You; let those who love Your salvation always say, 'God is great!'",
      "links": "<a href='/AIV/19/40/16'>Psalm 40:16</a>; <a href='/AIV/19/5/11'>Psalm 5:11</a>",
      "comment": "The phrase mirrors the Hebrew closely, emphasizing joy in seeking God—a major theme in both Testaments. 'Love Your salvation' subtly points to a more personal, ongoing relationship with God, characteristic of Catholic perspectives on grace and sanctification. The joyful acclamation 'God is great!' is a refrain in Catholic and early church worship, quietly highlighting tradition and communal praise."
    },
    {
      "pk": 70005,
      "translation": "AIV",
      "book": 19,
      "chapter": 70,
      "verse": 5,
      "text": "Yet I am poor and needy; God, come quickly to me. You are my help and my deliverer; LORD, do not delay.",
      "links": "<a href='/AIV/19/86/1'>Psalm 86:1</a>; <a href='/AIV/19/40/17'>Psalm 40:17</a>; <a href='/AIV/19/69/29'>Psalm 69:29</a>",
      "comment": "The acknowledgment of poverty and need echoes Christ's teaching on spiritual poverty (<a href='/AIV/40/5/3'>Matt. 5:3</a>). The double invocation of God as help and deliverer closely aligns to Catholic prayers of petition, mirroring the Church's emphasis on God as rescuer and reason for hope. The repeated appeal, 'do not delay,' reflects not just urgency but the trust expected in liturgical Catholic prayer, gently encouraging habitual recourse to God in times of need."
    }
  ],
  "translatedAt": "2025-12-22T21:41:49.094Z"
}