{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 74,
  "verses": [
    {
      "pk": 1974074,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 1,
      "text": "O God, why have You rejected us forever? Why does Your anger burn against the sheep of Your pasture?",
      "links": "<a href='/AIV/19/79/5'>Ps. 79:5</a>; <a href='/AIV/19/44/9'>Ps. 44:9</a>",
      "comment": "The psalm begins with a profound sense of abandonment, yet the language 'sheep of Your pasture' echoes God's pastoral care—linking to the Good Shepherd motif Christ claims in John 10:11."
    },
    {
      "pk": 1974075,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 2,
      "text": "Remember Your congregation which You have purchased of old, the tribe You redeemed to be Your inheritance, Mount Zion where You dwelt.",
      "links": "<a href='/AIV/19/77/15'>Ps. 77:15</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "God's act of purchase and redemption foreshadows Christ’s redemption at the cross (Eph. 1:7). The mention of Zion anticipates the Church as the dwelling place of God (Heb. 12:22-23)."
    },
    {
      "pk": 1974076,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 3,
      "text": "Lift up Your steps to the perpetual ruins— all the destruction the enemy has brought in the sanctuary.",
      "links": "<a href='/AIV/19/80/14'>Ps. 80:14</a>; <a href='/AIV/25/1/10'>Lam. 1:10</a>",
      "comment": "The devastation of the sanctuary is a physical image pointing to spiritual desolation, urging reflection on restoration through sacramental grace."
    },
    {
      "pk": 1974077,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 4,
      "text": "Your adversaries roar in the midst of Your meeting place; they have set up their own signs as signs.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "The enemy replacing God’s signs recalls the need for proper reverence in worship and the distinctness of holy symbols—a subtle inflection on the importance of tradition."
    },
    {
      "pk": 1974078,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 5,
      "text": "They seem like men who lift up axes among a thicket of trees.",
      "links": "",
      "comment": "The imagery of axes brings to mind the idea of judgment and destruction, echoing John the Baptist’s warning in Matt. 3:10."
    },
    {
      "pk": 1974079,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 6,
      "text": "Now they break down all its carved works with axes and hammers.",
      "links": "<a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "Carved works reference the beauty and artistry within worship, reminding us of the sacramental nature of physical spaces dedicated to God."
    },
    {
      "pk": 1974080,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 7,
      "text": "They set Your sanctuary on fire; they profane the dwelling place of Your Name, bringing it down to the ground.",
      "links": "<a href='/AIV/2/40/34'>Ex. 40:34</a>; <a href='/AIV/19/89/39'>Ps. 89:39</a>",
      "comment": "Destruction of the sanctuary is physical but also spiritual—hinting at Christ's words about His body as the new Temple (John 2:19-21)."
    },
    {
      "pk": 1974081,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 8,
      "text": "They said in their hearts, “Let us completely destroy them!” They have burned down all the places where God dwells in the land.",
      "links": "<a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "Burning “all the meeting places” foreshadows attacks on the sacred and the enduring promise that Christ’s Church shall not be overcome (Matt. 16:18)."
    },
    {
      "pk": 1974082,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 9,
      "text": "We do not see our signs; there is no longer any prophet, and none among us knows how long.",
      "links": "<a href='/AIV/19/77/8'>Ps. 77:8</a>; <a href='/AIV/1/4/10'>1 Sam 4:10</a>",
      "comment": "Absence of prophets signals spiritual drought—a Catholic reading would see the continual prophetic ministry through Church teaching preserved from apostolic succession."
    },
    {
      "pk": 1974083,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 10,
      "text": "O God, how long will the adversary reproach? Will the enemy blaspheme Your Name forever?",
      "links": "<a href='/AIV/19/44/24'>Ps. 44:24</a>",
      "comment": "Blasphemy against God recalls Jesus’ teaching on the eternal consequences of blasphemy (Matt. 12:31). The cry for restoration mirrors prayers for the coming of Christ’s Kingdom."
    },
    {
      "pk": 1974084,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 11,
      "text": "Why do You withdraw Your hand, even Your right hand? Take it out from Your bosom and destroy them!",
      "links": "<a href='/AIV/19/138/7'>Ps. 138:7</a>",
      "comment": "The right hand represents power and authority, seen fulfilled in Christ seated at the right hand of the Father (Heb. 1:3)."
    },
    {
      "pk": 1974085,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 12,
      "text": "Yet God is my King from of old, working salvation in the midst of the earth.",
      "links": "<a href='/AIV/19/93/2'>Ps. 93:2</a>; <a href='/AIV/19/22/3'>Ps. 22:3</a>",
      "comment": "‘Salvation in the earth’ anticipates the Incarnation, highlighting Christ as both King and Savior—see Luke 1:32-33."
    },
    {
      "pk": 1974086,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 13,
      "text": "You divided the sea by Your strength; You broke the heads of the sea monsters in the waters.",
      "links": "<a href='/AIV/2/14/21'>Ex. 14:21</a>; <a href='/AIV/19/89/10'>Ps. 89:10</a>",
      "comment": "This verse alludes to Exodus and God's victory over chaos; spiritual victory is fulfilled in Christ's triumph over evil (Col. 2:15)."
    },
    {
      "pk": 1974087,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 14,
      "text": "You crushed the heads of Leviathan; You gave him as food for the creatures of the wilderness.",
      "links": "<a href='/AIV/18/41/1'>Job 41:1</a>; <a href='/AIV/23/27/1'>Isa. 27:1</a>",
      "comment": "Leviathan often symbolizes evil or Satan; divine victory here prefigures Christ’s defeat of death and evil (see Rev. 20:2)."
    },
    {
      "pk": 1974088,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 15,
      "text": "You opened up springs and streams; You dried up ever-flowing rivers.",
      "links": "<a href='/AIV/2/17/6'>Ex. 17:6</a>; <a href='/AIV/19/78/15-16'>Ps. 78:15-16</a>",
      "comment": "Control over water reveals God's sovereignty; water motifs foreshadow sacramental cleansing and baptismal grace."
    },
    {
      "pk": 1974089,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 16,
      "text": "The day is Yours, the night also belongs to You; You have established light and sun.",
      "links": "<a href='/AIV/1/1/16'>Gen. 1:16</a>; <a href='/AIV/19/104/19'>Ps. 104:19</a>",
      "comment": "God as Creator recalls the Genesis account and highlights the liturgical rhythm of daily worship."
    },
    {
      "pk": 1974090,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 17,
      "text": "You have set all the boundaries of the earth; You have made summer and winter.",
      "links": "<a href='/AIV/1/8/22'>Gen. 8:22</a>; <a href='/AIV/19/104/20'>Ps. 104:20</a>",
      "comment": "God's sovereignty over creation is absolute—rhythms and boundaries suggest order, reflecting the sacramental principle of matter in liturgy."
    },
    {
      "pk": 1974091,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 18,
      "text": "Remember this, O LORD, how the enemy has mocked, and foolish people have blasphemed Your Name.",
      "links": "<a href='/AIV/19/79/12'>Ps. 79:12</a>; <a href='/AIV/19/89/51'>Ps. 89:51</a>",
      "comment": "The plea for remembrance echoes prayers of the saints, suggesting intercessory reliance—see Rev. 8:3-4."
    },
    {
      "pk": 1974092,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 19,
      "text": "Do not give the life of Your dove to the wild beasts; do not forget the life of Your poor forever.",
      "links": "<a href='/AIV/19/68/10'>Ps. 68:10</a>; <a href='/AIV/19/56/6'>Ps. 56:6</a>",
      "comment": "The dove, a symbol of the Spirit, also points to Christ’s gentleness and care for the poor—see Matt. 5:3."
    },
    {
      "pk": 1974093,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 20,
      "text": "Have regard for Your covenant, because the dark places of the earth are full of violence.",
      "links": "<a href='/AIV/1/9/16'>Gen. 9:16</a>; <a href='/AIV/19/106/45'>Ps. 106:45</a>",
      "comment": "Covenant language anticipates new covenant realities, fulfilled in Christ’s blood and perpetuated in Eucharistic celebration."
    },
    {
      "pk": 1974094,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 21,
      "text": "Do not let the oppressed turn back in shame; let the poor and needy praise Your Name.",
      "links": "<a href='/AIV/19/9/18'>Ps. 9:18</a>; <a href='/AIV/19/72/12'>Ps. 72:12</a>",
      "comment": "God’s care for the poor is a central theme, embodied by the Church’s work of charity and justice as a sacramental sign to the world."
    },
    {
      "pk": 1974095,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 22,
      "text": "Arise, O God, defend Your cause; remember how fools mock You all day long.",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "'Arise, O God' is a plea for divine intervention, paralleling themes of resurrection and vindication in Christ."
    },
    {
      "pk": 1974096,
      "translation": "AIV",
      "book": 19,
      "chapter": 74,
      "verse": 23,
      "text": "Do not forget the voices of Your adversaries, the noise of those who rise up against You always increasing.",
      "links": "<a href='/AIV/19/69/18'>Ps. 69:18</a>",
      "comment": "The increasing opposition is a reminder of ongoing spiritual warfare, and the hope of Christ’s final victory—a promise continued in the life of the Church and its saints."
    }
  ],
  "translatedAt": "2025-12-22T21:43:20.832Z"
}