{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 46,
  "verses": [
    {
      "pk": 1004601,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 1,
      "text": "God is our refuge and strength, a help that is always found in times of trouble.",
      "links": "<a href='/AIV/19/91/2'>Ps. 91:2</a>; <a href='/AIV/18/36/7'>Job 36:7</a>",
      "comment": "The psalm starts by acknowledging God as both protector and source of strength. The phrase 'always found' underscores God's continual, unfailing presence. Catholics see this as reminiscent of the constant intercession of saints and the Church's sacramental care, while Protestants may focus more individually."
    },
    {
      "pk": 1004602,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 2,
      "text": "Therefore we will not fear, though the earth gives way, and the mountains fall into the heart of the sea;",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>; <a href='/AIV/19/18/7'>Ps. 18:7</a>",
      "comment": "This imagery of cosmic chaos is often interpreted as symbolic of spiritual trials or earthly calamities. Early Christian writings saw the mountain falling as an image of worldly powers being overcome by Christ. The Church provides an abiding stability amidst life’s upheavals."
    },
    {
      "pk": 1004603,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 3,
      "text": "though its waters roar and foam, though the mountains tremble at its swelling. Selah",
      "links": "<a href='/AIV/19/42/7'>Ps. 42:7</a>; <a href='/AIV/19/77/16'>Ps. 77:16</a>",
      "comment": "The roaring waters and trembling mountains broaden the theme of turmoil, pointing both to natural disaster and spiritual trial. The inclusion of 'Selah' marks a pause, traditionally seen as an invitation to contemplate God’s sovereignty—a practice rich in liturgical tradition."
    },
    {
      "pk": 1004604,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 4,
      "text": "There is a river whose streams make glad the city of God, the holy dwelling place of the Most High.",
      "links": "<a href='/AIV/66/22/1'>Rev. 22:1</a>; <a href='/AIV/26/47/5-9'>Ezek. 47:5–9</a>",
      "comment": "The imagery of the life-giving river recalls Eden (Gen. 2:10), and is fulfilled spiritually in Christ and the grace flowing from Him through the Church (<a href='/AIV/43/7/38'>John 7:38</a>). The 'city of God' refers to Jerusalem, but for Christians, it symbolizes the Church, the body of Christ, and ultimately the heavenly Jerusalem."
    },
    {
      "pk": 1004605,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 5,
      "text": "God is within her; she will not be shaken. God will help her when morning dawns.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/19/125/1'>Ps. 125:1</a>",
      "comment": "God’s indwelling assures the stability of His people—and, in a Catholic context, the Church’s indefectibility. 'Morning dawns' hints at new creation and resurrection. For Protestants, the verse might stress personal assurance; Catholic interpretation emphasizes God’s enduring presence with His Church."
    },
    {
      "pk": 1004606,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 6,
      "text": "Nations rage, kingdoms totter; he lifts his voice, the earth melts.",
      "links": "<a href='/AIV/19/2/1'>Ps. 2:1</a>; <a href='/AIV/66/20/11'>Rev. 20:11</a>",
      "comment": "God’s sovereign voice is enough to dissolve all opposition. This foreshadows judgment themes found in both Old and New Testaments. Early Church Fathers saw this as a picture of Christ’s final victory."
    },
    {
      "pk": 1004607,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 7,
      "text": "The LORD of armies is with us; the God of Jacob is our fortress. Selah",
      "links": "<a href='/AIV/19/24/10'>Ps. 24:10</a>; <a href='/AIV/19/91/9'>Ps. 91:9</a>",
      "comment": "'LORD of armies' (Sabaoth) highlights God’s power and protection. The reference to Jacob connects God’s ongoing promise to His people. In Catholic liturgy, this 'with us' echoes Emmanuel, God with us (<a href='/AIV/40/1/23'>Matt. 1:23</a>), seen in the Incarnation and Eucharistic presence."
    },
    {
      "pk": 1004608,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 8,
      "text": "Come, behold the works of the LORD, who has made desolations on the earth.",
      "links": "<a href='/AIV/19/66/5'>Ps. 66:5</a>; <a href='/AIV/23/13/9'>Isa. 13:9</a>",
      "comment": "An invitation to witness God’s mighty acts, including His judgment on evil. Catholic thought sees this as a call to reflect on God’s work throughout history—the visible and invisible Church, and sacramental signs—which Protestants also affirm, though sometimes less visibly."
    },
    {
      "pk": 1004609,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 9,
      "text": "He makes wars cease to the ends of the earth; he breaks the bow and shatters the spear; he burns the shields with fire.",
      "links": "<a href='/AIV/23/2/4'>Isa. 2:4</a>; <a href='/AIV/19/76/3'>Ps. 76:3</a>",
      "comment": "This verse points to God’s ultimate peace, reminiscent of Isaiah’s prophecy of universal peace. For Catholics, this also prefigures the peace that is progressively realized in the Kingdom of God through Christ, sacramental life, and the Church’s social doctrine."
    },
    {
      "pk": 1004610,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 10,
      "text": "\"Be still, and know that I am God. I will be exalted among the nations; I will be exalted in the earth.\"",
      "links": "<a href='/AIV/23/42/10'>Isa. 42:10</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "God’s invitation to 'be still' encourages both interior reflection and active trust. Catholics emphasize contemplation and silent prayer, while the command 'know' calls all Christians to deeper relationship. God is made known to the whole earth—fulfilled perfectly in Christ’s universal mission through the Church (<a href='/AIV/40/28/19'>Matt. 28:19</a>)."
    },
    {
      "pk": 1004611,
      "translation": "AIV",
      "book": 19,
      "chapter": 46,
      "verse": 11,
      "text": "The LORD of armies is with us; the God of Jacob is our fortress. Selah",
      "links": "<a href='/AIV/19/46/7'>Ps. 46:7</a>; <a href='/AIV/40/1/23'>Matt. 1:23</a>",
      "comment": "This closing refrain reinforces God’s real presence with His people. Catholic tradition sees repetitions as emphasizing the abiding, sacramental presence of Christ in the Church, the true fortress and protector of the faithful."
    }
  ],
  "translatedAt": "2025-12-22T21:34:50.883Z"
}