{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 11,
  "verses": [
    {
      "pk": 1983110,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 1,
      "text": "In the LORD I take refuge. How can you say to my soul, “Flee like a bird to your mountain”?",
      "links": "<a href='/AIV/19/16/1'>Ps. 16:1</a>; <a href='/AIV/19/7/1'>Ps. 7:1</a>",
      "comment": "David begins by affirming his trust in God as his ultimate refuge, challenging the advice to run in fear. The imagery of the bird fleeing to the mountain suggests abandonment of trust in God for self-preservation. See also Luke 13:34 where Jesus likens His care to a hen gathering her brood."
    },
    {
      "pk": 1983111,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 2,
      "text": "For look, the wicked bend the bow; they fit their arrow to the string to shoot in the dark at the upright in heart.",
      "links": "<a href='/AIV/19/37/14'>Ps. 37:14</a>; <a href='/AIV/19/64/3-4'>Ps. 64:3–4</a>",
      "comment": "This verse describes the secret and malicious attacks of the wicked against the righteous. The darkness represents both secrecy and evil, recalling Ephesians 6:12 about the spiritual battle against darkness. For early readers, this highlights trust in God's justice even when it seems evil has the advantage."
    },
    {
      "pk": 1983112,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 3,
      "text": "If the foundations are destroyed, what can the righteous do?",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>; <a href='/AIV/40/7/24-27'>Matt. 7:24–27</a>",
      "comment": "The 'foundations' likely refer to the basic pillars of justice and order. When these collapse, the righteous seem powerless—yet the psalm emphasizes that their help is in God, not in human institutions. Compare with Christ’s teaching on building one's life on the rock (Matt. 7:24-27). This subtly points to the unchanging nature of the faith community established by God."
    },
    {
      "pk": 1983113,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 4,
      "text": "The LORD is in his holy temple; the LORD’s throne is in heaven. His eyes see, his eyelids test the children of man.",
      "links": "<a href='/AIV/19/18/6'>Ps. 18:6</a>; <a href='/AIV/66/4/2'>Rev. 4:2</a>",
      "comment": "Even as evil seems rampant, God remains sovereign and observes all from His dwelling place. The mention of the holy temple can inspire reflection upon God’s real presence and the continuity of His dwelling among His people throughout the generations, fulfilled most perfectly in Christ and the ongoing worship of the Church. Spiritual and literal interpretations both stress God’s continual oversight."
    },
    {
      "pk": 1983114,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 5,
      "text": "The LORD tests the righteous, but his soul hates the wicked and the one who loves violence.",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/20/17/3'>Prov. 17:3</a>",
      "comment": "God’s testing of the righteous purifies their faith (cf. 1 Peter 1:6-7); He separates those who truly love Him from those who are only outwardly just. The idea that God 'hates' wickedness stresses His utter opposition to evil and is both a warning and a comfort. Baptism and enduring in faith are ways the righteous continually submit to God's purifying tests."
    },
    {
      "pk": 1983115,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 6,
      "text": "Let him rain down coals on the wicked; fire and sulfur and a scorching wind shall be the portion of their cup.",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>",
      "comment": "Echoing the destruction of Sodom (Gen. 19:24), this depicts Divine judgment upon the wicked. The 'cup' imagery foreshadows the imagery Christ uses for His own suffering and for judgment (Matt. 26:39; Rev. 14:10). Spiritually, it warns of the ultimate consequences of rejecting God, while also suggesting that only God determines justice."
    },
    {
      "pk": 1983116,
      "translation": "AIV",
      "book": 19,
      "chapter": 11,
      "verse": 7,
      "text": "For the LORD is righteous; he loves righteous deeds; the upright shall behold his face.",
      "links": "<a href='/AIV/19/17/15'>Ps. 17:15</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>; <a href='/AIV/66/22/4'>Rev. 22:4</a>",
      "comment": "The psalm ends on a note of hope: God’s character as righteous means He delights in those who live rightly. The promise to 'behold His face' goes beyond the literal—pointing toward intimate communion with God as presented in the Beatitudes (Matt. 5:8) and finally realized in eternal life (Rev. 22:4). Throughout salvation history, God’s faithful are called to perseverance and hold to the vision that the ultimate reward is full union with Him, both now through grace and fully in the age to come."
    }
  ],
  "translatedAt": "2025-12-23T05:34:29.551Z"
}