{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 119,
  "verses": [
    {
      "pk": 23119001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 1,
      "text": "Blessed are those whose way is blameless, who walk in the law of the LORD.",
      "links": "<a href='/AIV/5/6/5'>Deuteronomy 6:5</a>, <a href='/AIV/40/5/48'>Matthew 5:48</a>",
      "comment": "The beginning of this Psalm sets the tone for the whole chapter. The blessing comes from living according to God's law—a theme fulfilled spiritually in Christ who perfectly kept the law and invites believers to follow Him. 'Blameless' here reflects not just outward morality but inner devotion and integrity, as echoed in the call to holiness throughout both Old and New Testaments."
    },
    {
      "pk": 23119002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 2,
      "text": "Blessed are those who keep His testimonies, who seek Him with their whole heart.",
      "links": "<a href='/AIV/24/29/13'>Jeremiah 29:13</a>, <a href='/AIV/40/22/37'>Matthew 22:37</a>",
      "comment": "To seek God wholeheartedly highlights a deep, personal relationship rather than mere outward obedience. This notion is expanded in the New Testament, where loving God fully is connected to salvation and spiritual growth. The Psalm promotes ongoing pursuit, not just one-time action, aligning with Christ's emphasis on daily discipleship."
    },
    {
      "pk": 23119003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 3,
      "text": "They also do no wrong but walk in His ways.",
      "links": "<a href='/AIV/19/1/1'>Psalms 1:1</a>, <a href='/AIV/40/7/13-14'>Matthew 7:13-14</a>",
      "comment": "Walking in God’s ways urges us to continually strive for righteousness. Moral purity is possible through grace and persistence; the spiritual path requires intentional choices. This recalls Jesus’ teaching about the narrow way that leads to life."
    },
    {
      "pk": 23119004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 4,
      "text": "You have commanded Your precepts to be kept diligently.",
      "links": "<a href='/AIV/5/6/6-9'>Deuteronomy 6:6-9</a>",
      "comment": "God's law is not merely suggested but given as a command, with an expectation of persistent and careful observance. This establishes the foundation for both moral living and spiritual formation, as seen in traditions that emphasize the regular practice of faith."
    },
    {
      "pk": 23119005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 5,
      "text": "Oh, that my ways may be steadfast in keeping Your statutes!",
      "links": "<a href='/AIV/19/26/1'>Psalms 26:1</a>",
      "comment": "This longing for steadfastness points to the human inability to consistently obey without divine help. It echoes the Christian understanding of needing both effort and grace to walk in holiness, a principle foundational to spiritual disciplines."
    },
    {
      "pk": 23119006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 6,
      "text": "Then I shall not be put to shame, having my eyes fixed on all Your commandments.",
      "links": "<a href='/AIV/19/25/3'>Psalms 25:3</a>, <a href='/AIV/45/10/11'>Romans 10:11</a>",
      "comment": "Shame is avoided when the believer focuses on God’s commandments—both in studying and living them out. This commitment to the Word is essential to avoiding spiritual downfall, and reflects the New Testament promise that faith in Christ shields from ultimate shame."
    },
    {
      "pk": 23119007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 7,
      "text": "I will praise You with an upright heart when I learn Your righteous rules.",
      "links": "<a href='/AIV/19/7/17'>Psalms 7:17</a>, <a href='/AIV/19/119/164'>Psalms 119:164</a>",
      "comment": "Praise is not just vocal but springs from a purified heart shaped by God’s righteousness. Learning God’s rules is seen here as a lifelong journey of conversion and increasing alignment with His will."
    },
    {
      "pk": 23119008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 8,
      "text": "I will keep Your statutes; do not utterly forsake me!",
      "links": "<a href='/AIV/19/51/11'>Psalms 51:11</a>",
      "comment": "The psalmist’s commitment is paired with a plea for God’s presence, recognizing human frailty and the need for ongoing mercy. This dependency foreshadows New Testament assurances of God’s faithfulness to those who persevere."
    },
    {
      "pk": 23119009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 9,
      "text": "How can a young person keep their way pure? By guarding it according to Your word.",
      "links": "<a href='/AIV/19/24/3-4'>Psalms 24:3-4</a>, <a href='/AIV/43/17/17'>John 17:17</a>",
      "comment": "Purity is preserved by internalizing God’s Word. This principle undergirds spiritual formation, encouraging deliberate discipline and frequent meditative prayer, and is key for young believers seeking sanctification."
    },
    {
      "pk": 23119010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 10,
      "text": "With my whole heart I seek You; let me not wander from Your commandments.",
      "links": "<a href='/AIV/19/119/2'>Psalms 119:2</a>, <a href='/AIV/42/15/4-6'>Luke 15:4-6</a>",
      "comment": "The request to not wander highlights spiritual vulnerability, recalling the biblical theme of God as the Shepherd who seeks the lost. Seeking God is pictured as both an act of the will and a gift of grace."
    },
    {
      "pk": 23119011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 11,
      "text": "I have stored up Your word in my heart, that I might not sin against You.",
      "links": "<a href='/AIV/19/19/14'>Psalms 19:14</a>, <a href='/AIV/40/4/4'>Matthew 4:4</a>",
      "comment": "Scripture hidden in the heart is a spiritual defense against sin, reflecting the practice of memorization and meditation. Jesus Himself used the Word against temptation, underscoring this principle."
    },
    {
      "pk": 23119012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 12,
      "text": "Blessed are You, O LORD; teach me Your statutes!",
      "links": "<a href='/AIV/19/25/4'>Psalms 25:4</a>",
      "comment": "The cry for divine instruction establishes the need for spiritual mentorship and guidance. Learning from God directly ultimately leads to authentic understanding—the same attitude modeled by the apostles."
    },
    {
      "pk": 23119013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 13,
      "text": "With my lips I declare all the rules of Your mouth.",
      "links": "<a href='/AIV/19/40/9'>Psalms 40:9</a>, <a href='/AIV/45/10/10'>Romans 10:10</a>",
      "comment": "Confession with the lips is vital; spoken testimony to God’s word reinforces faith and accountability. It’s reminiscent of apostolic preaching as a means to spread the Gospel."
    },
    {
      "pk": 23119014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 14,
      "text": "I rejoice in following the way of Your testimonies as much as in all riches.",
      "links": "<a href='/AIV/19/119/72'>Psalms 119:72</a>, <a href='/AIV/40/13/44'>Matthew 13:44</a>",
      "comment": "God’s ways are valued above material wealth, echoing Jesus’ teaching about the pearl of great price. The Psalmist finds deepest joy in spiritual obedience."
    },
    {
      "pk": 23119015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 15,
      "text": "I meditate on Your precepts and fix my eyes on Your ways.",
      "links": "<a href='/AIV/19/1/2'>Psalms 1:2</a>, <a href='/AIV/50/4/8'>Philippians 4:8</a>",
      "comment": "Meditation here suggests deliberate contemplation, a practice rooted in both personal devotion and regular communal worship. Fixing one's gaze spiritually suggests purpose and resolution."
    },
    {
      "pk": 23119016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 16,
      "text": "I delight in Your statutes; I will not forget Your word.",
      "links": "<a href='/AIV/19/112/1'>Psalms 112:1</a>, <a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Finding delight in God’s Word reflects an ongoing love relationship; remembering His commands demonstrates loyalty. These twin themes echo Jesus’ call to abide in His love through obedience."
    },
    {
      "pk": 23119017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 17,
      "text": "Deal bountifully with Your servant, that I may live and keep Your word.",
      "links": "<a href='/AIV/19/13/6'>Psalms 13:6</a>, <a href='/AIV/19/119/65'>Psalms 119:65</a>",
      "comment": "The psalmist depends on God’s kindness both for life and for the strength to obey. The correlation between spiritual vitality and obedience points to ongoing renewal through divine generosity."
    },
    {
      "pk": 23119018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 18,
      "text": "Open my eyes, that I may behold wondrous things out of Your law.",
      "links": "<a href='/AIV/19/119/73'>Psalms 119:73</a>, <a href='/AIV/42/24/45'>Luke 24:45</a>",
      "comment": "Understanding Scripture requires God’s revelation as well as personal effort. This interplay between grace and cooperation is foundational, paralleling Christ opening His disciples’ minds after the resurrection."
    },
    {
      "pk": 23119019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 19,
      "text": "I am a sojourner on the earth; do not hide Your commandments from me.",
      "links": "<a href='/AIV/58/11/13'>Hebrews 11:13</a>, <a href='/AIV/19/39/12'>Psalms 39:12</a>",
      "comment": "Believers are temporary residents, journeying toward their ultimate home. Divine guidance is essential for travelers, as echoed in the New Testament teaching about being strangers in the world."
    },
    {
      "pk": 23119020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 20,
      "text": "My soul is consumed with longing for Your rules at all times.",
      "links": "<a href='/AIV/19/42/1-2'>Psalms 42:1-2</a>",
      "comment": "The psalmist expresses passionate, ongoing yearning for God’s will—a characteristic found among saints and martyrs who model intense spiritual desire for union with God."
    },
    {
      "pk": 23119021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 21,
      "text": "You rebuke the arrogant, the accursed ones, who wander from Your commandments.",
      "links": "<a href='/AIV/19/1/6'>Psalms 1:6</a>, <a href='/AIV/40/23/12'>Matthew 23:12</a>",
      "comment": "Divine rebuke is directed at pride and rebellion. The theme is not only a warning but a call to humility and holiness, inviting deeper examination and repentance."
    },
    {
      "pk": 23119022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 22,
      "text": "Take away from me scorn and contempt, for I have kept Your testimonies.",
      "links": "<a href='/AIV/19/31/20'>Psalms 31:20</a>, <a href='/AIV/41/10/30'>Mark 10:30</a>",
      "comment": "Faithfulness to God sometimes leads to the world’s scorn, yet the psalmist’s plea reminds us that divine approval is greater than human recognition, a concept Jesus taught."
    },
    {
      "pk": 23119023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 23,
      "text": "Though rulers sit and plot against me, Your servant meditates on Your statutes.",
      "links": "<a href='/AIV/19/2/2'>Psalms 2:2</a>, <a href='/AIV/42/22/2'>Luke 22:2</a>",
      "comment": "Opposition from authorities is met not with retaliation, but deeper reflection on God’s Word. This persistent focus conquers fear and is a blueprint for enduring persecution in faith."
    },
    {
      "pk": 23119024,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 24,
      "text": "Your testimonies are my delight; they are my counselors.",
      "links": "<a href='/AIV/19/16/7'>Psalms 16:7</a>, <a href='/AIV/43/14/26'>John 14:26</a>",
      "comment": "God’s Word is portrayed as both joy and wisdom, guiding personal choices and community life. The idea of Scripture as counselor anticipates the gift of the Holy Spirit, who guides the Church into all truth."
    },
    {
      "pk": 23119025,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 25,
      "text": "My soul clings to the dust; revive me according to Your word.",
      "links": "<a href='/AIV/19/71/20'>Psalms 71:20</a>, <a href='/AIV/19/143/11'>Psalms 143:11</a>",
      "comment": "The phrase describes spiritual exhaustion and a need for revival. Restoration is sought not by external means but directly from the Word, a recurring theme in renewal movements."
    },
    {
      "pk": 23119026,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 26,
      "text": "I have told of my ways, and You answered me; teach me Your statutes.",
      "links": "<a href='/AIV/19/66/19'>Psalms 66:19</a>",
      "comment": "Confession and divine response frame ongoing dialogue between believer and God. The request for teaching illustrates life-long openness to spiritual growth and formation."
    },
    {
      "pk": 23119027,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 27,
      "text": "Make me understand the way of Your precepts, and I will meditate on Your wondrous works.",
      "links": "<a href='/AIV/19/119/18'>Psalms 119:18</a>, <a href='/AIV/19/111/2'>Psalms 111:2</a>",
      "comment": "Understanding comes first from God. The meditative approach to God’s works is reminiscent of the spiritual journey that includes study, prayer, and reflection."
    },
    {
      "pk": 23119028,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 28,
      "text": "My soul melts away for sorrow; strengthen me according to Your word.",
      "links": "<a href='/AIV/19/88/3'>Psalms 88:3</a>, <a href='/AIV/40/11/28'>Matthew 11:28</a>",
      "comment": "Sorrow is transformed by God’s Word into strength. This approach to suffering shows the power of Scripture to comfort and sustain believers through trials."
    },
    {
      "pk": 23119029,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 29,
      "text": "Put false ways far from me, and graciously teach me Your law!",
      "links": "<a href='/AIV/19/119/104'>Psalms 119:104</a>, <a href='/AIV/43/16/13'>John 16:13</a>",
      "comment": "A prayer for deliverance from deception is coupled with a plea for authentic guidance. The grace requested here is essential for discernment both individually and in the community of believers."
    },
    {
      "pk": 23119030,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 30,
      "text": "I have chosen the way of faithfulness; I set Your rules before me.",
      "links": "<a href='/AIV/19/25/10'>Psalms 25:10</a>, <a href='/AIV/58/12/1-2'>Hebrews 12:1-2</a>",
      "comment": "Faithfulness is a deliberate choice, not automatic, and requires continual rededication to God’s law. The theme resonates with the New Testament’s call to run the race set before us."
    },
    {
      "pk": 23119031,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 31,
      "text": "I cling to Your testimonies, O LORD; do not let me be put to shame.",
      "links": "<a href='/AIV/19/119/6'>Psalms 119:6</a>, <a href='/AIV/45/9/33'>Romans 9:33</a>",
      "comment": "Clinging suggests active dependence. The prayer not to be put to shame expresses confidence that God’s promises will hold firm in difficulty and persecution."
    },
    {
      "pk": 23119032,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 32,
      "text": "I will run in the way of Your commandments when You enlarge my heart.",
      "links": "<a href='/AIV/19/119/45'>Psalms 119:45</a>, <a href='/AIV/47/6/11'>2 Corinthians 6:11</a>",
      "comment": "The metaphor of running symbolizes energetic, joyful obedience that comes from inner transformation. Expansion of the heart is a scriptural image for increased capacity to love and obey God."
    },
    {
      "pk": 23119033,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 33,
      "text": "Teach me, O LORD, the way of Your statutes, and I will keep it to the end.",
      "links": "<a href='/AIV/40/24/13'>Matthew 24:13</a>",
      "comment": "The request is for deep, lasting instruction that enables perseverance in faith. The concept of enduring to the end is later affirmed by Jesus as a sign of true discipleship."
    },
    {
      "pk": 23119034,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 34,
      "text": "Give me understanding, that I may keep Your law and observe it with my whole heart.",
      "links": "<a href='/AIV/19/119/2'>Psalms 119:2</a>, <a href='/AIV/19/119/10'>Psalms 119:10</a>",
      "comment": "Understanding leads to heartfelt obedience, not mere ritual. Spiritual interpretation emphasizes internalizing the law in a way that transforms the heart, making it fully devoted."
    },
    {
      "pk": 23119035,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 35,
      "text": "Lead me in the path of Your commandments, for I delight in it.",
      "links": "<a href='/AIV/19/23/3'>Psalms 23:3</a>",
      "comment": "Seeking direction expresses trust in God's will; delight in the law signals a loving response to divine initiation. The Psalmist’s attitude models joyful surrender to God’s guidance."
    },
    {
      "pk": 23119036,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 36,
      "text": "Incline my heart to Your testimonies and not to selfish gain.",
      "links": "<a href='/AIV/19/119/14'>Psalms 119:14</a>, <a href='/AIV/40/6/19-21'>Matthew 6:19-21</a>",
      "comment": "The psalmist requests help against materialism, asking for the heart to prefer God’s Word. This prayer reflects an interior conversion, aligning desires with spiritual values."
    },
    {
      "pk": 23119037,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 37,
      "text": "Turn my eyes from looking at worthless things; give me life in Your ways.",
      "links": "<a href='/AIV/19/101/3'>Psalms 101:3</a>, <a href='/AIV/19/16/11'>Psalms 16:11</a>",
      "comment": "A prayer to avoid distractions and focus on eternal value. Life is found in choosing God's ways over fleeting worldly pursuits, affirming both spiritual and moral priorities."
    },
    {
      "pk": 23119038,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 38,
      "text": "Confirm to Your servant Your promise, that You may be feared.",
      "links": "<a href='/AIV/19/119/49'>Psalms 119:49</a>, <a href='/AIV/19/89/34'>Psalms 89:34</a>",
      "comment": "The fear of God here means respectful awe, fostered by seeing God’s faithfulness to His promises. Integrity of God’s Word gives believers confidence and reverence."
    },
    {
      "pk": 23119039,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 39,
      "text": "Turn away the disgrace that I dread, for Your rules are good.",
      "links": "<a href='/AIV/19/119/22'>Psalms 119:22</a>, <a href='/AIV/19/86/17'>Psalms 86:17</a>",
      "comment": "Disgrace is avoided by trusting in God’s goodness; the statutes themselves are the remedy to shame and spiritual downfall. Obedience is portrayed as a shield."
    },
    {
      "pk": 23119040,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 40,
      "text": "Behold, I long for Your precepts; in Your righteousness give me life.",
      "links": "<a href='/AIV/19/119/77'>Psalms 119:77</a>, <a href='/AIV/40/5/6'>Matthew 5:6</a>",
      "comment": "Longing for God’s truth is answered by being filled with God's own righteousness. True spiritual life is found not in self-justification but in receiving and living out divine righteousness—a motif that finds fulfillment in Christ's work."
    },
    {
      "pk": 23119041,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 41,
      "text": "Let your faithful love come to me, O Lord, your salvation according to your promise.",
      "links": "<a href='/AIV/19/6/4'>Psalm 6:4</a>, <a href='/AIV/19/25/6'>Psalm 25:6</a>",
      "comment": "The psalmist earnestly seeks God's steadfast love and salvation, emphasizing the reliability of God's promises—a theme reflected throughout Scripture. The focus on steadfast love links to covenantal mercy, fulfilled in Christ (see <a href='/AIV/43/3/16'>John 3:16</a>)."
    },
    {
      "pk": 23119042,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 42,
      "text": "Then I will have an answer for him who taunts me, for I trust in your word.",
      "links": "<a href='/AIV/19/42/10'>Psalm 42:10</a>, <a href='/AIV/19/56/4'>Psalm 56:4</a>",
      "comment": "Trust in God's word is presented as a shield against adversaries. This anticipates Jesus' use of Scripture when confronted by Satan (<a href='/AIV/40/4/4'>Matthew 4:4</a>), demonstrating Scripture's authoritative power."
    },
    {
      "pk": 23119043,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 43,
      "text": "Do not take the word of truth utterly out of my mouth, for my hope is in your judgments.",
      "links": "<a href='/AIV/19/40/9'>Psalm 40:9</a>, <a href='/AIV/19/119/147'>Psalm 119:147</a>",
      "comment": "The psalmist desires never to be deprived of proclaiming God's truth. This aligns with the Christian call to continual witness to God's word (see <a href='/AIV/55/4/2'>2 Timothy 4:2</a>)."
    },
    {
      "pk": 23119044,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 44,
      "text": "So I will keep your law continually, forever and ever.",
      "links": "<a href='/AIV/19/119/33'>Psalm 119:33</a>, <a href='/AIV/19/119/112'>Psalm 119:112</a>",
      "comment": "A commitment to continual obedience displays love for God. Jesus affirmed the enduring nature of God’s commands (<a href='/AIV/40/5/17'>Matthew 5:17</a>)."
    },
    {
      "pk": 23119045,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 45,
      "text": "And I will walk in freedom, for I seek your precepts.",
      "links": "<a href='/AIV/19/119/32'>Psalm 119:32</a>, <a href='/AIV/43/8/32'>John 8:32</a>",
      "comment": "True freedom is found in seeking and following God's ways, which leads away from slavery to sin (see <a href='/AIV/43/8/36'>John 8:36</a>)."
    },
    {
      "pk": 23119046,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 46,
      "text": "I will speak of your testimonies before kings and will not be put to shame.",
      "links": "<a href='/AIV/44/26/1-2'>Acts 26:1-2</a>, <a href='/AIV/42/12/11-12'>Luke 12:11-12</a>",
      "comment": "The readiness to speak God’s truth even before rulers foreshadows the apostles’ boldness. Jesus assured his followers they would be witnesses before authorities."
    },
    {
      "pk": 23119047,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 47,
      "text": "For I delight in your commandments, which I love.",
      "links": "<a href='/AIV/19/119/16'>Psalm 119:16</a>, <a href='/AIV/19/119/70'>Psalm 119:70</a>",
      "comment": "Obedience to God is not burdensome but a source of joy—a theme Jesus summarized with the command to love God with one’s whole heart (<a href='/AIV/40/22/37'>Matthew 22:37</a>)."
    },
    {
      "pk": 23119048,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 48,
      "text": "I lift up my hands to your commandments, which I love, and I will meditate on your statutes.",
      "links": "<a href='/AIV/19/28/2'>Psalm 28:2</a>, <a href='/AIV/19/119/78'>Psalm 119:78</a>",
      "comment": "Physical gestures of worship—like lifting hands—express deep reverence and adoration for God's word, symbolic of worship practices continued throughout church history."
    },
    {
      "pk": 23119049,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 49,
      "text": "Remember your word to your servant, in which you have made me hope.",
      "links": "<a href='/AIV/19/119/38'>Psalm 119:38</a>, <a href='/AIV/19/119/76'>Psalm 119:76</a>",
      "comment": "Biblical remembrance requests God's faithfulness to his promises. This evokes New Testament themes of hope through the word (<a href='/AIV/45/15/4'>Romans 15:4</a>)."
    },
    {
      "pk": 23119050,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 50,
      "text": "This is my comfort in my affliction, that your promise gives me life.",
      "links": "<a href='/AIV/19/94/19'>Psalm 94:19</a>, <a href='/AIV/19/119/92'>Psalm 119:92</a>",
      "comment": "God’s word brings life and consolation even in suffering—seen ultimately in Christ as the Word who brings eternal life (see <a href='/AIV/43/1/1-4'>John 1:1-4</a>)."
    },
    {
      "pk": 23119051,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 51,
      "text": "The arrogant utterly deride me, but I do not turn aside from your law.",
      "links": "<a href='/AIV/19/123/4'>Psalm 123:4</a>, <a href='/AIV/19/119/157'>Psalm 119:157</a>",
      "comment": "Remaining faithful despite the scorn of the proud reflects a righteous perseverance, prefiguring the suffering of Christ and his steadfastness."
    },
    {
      "pk": 23119052,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 52,
      "text": "When I remember your judgments from of old, O Lord, I take comfort.",
      "links": "<a href='/AIV/19/119/90-91'>Psalm 119:90-91</a>, <a href='/AIV/19/77/11'>Psalm 77:11</a>",
      "comment": "Recalling God’s historic faithfulness brings present encouragement. The believer is encouraged to stand firm by remembering how God has judged righteously throughout history."
    },
    {
      "pk": 23119053,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 53,
      "text": "Hot indignation seizes me because of the wicked, those who forsake your law.",
      "links": "<a href='/AIV/19/119/136'>Psalm 119:136</a>, <a href='/AIV/19/69/9'>Psalm 69:9</a>",
      "comment": "Righteous anger over the violation of God’s law shows the seriousness of sin. This passion is seen in Christ cleansing the temple (<a href='/AIV/43/2/17'>John 2:17</a>)."
    },
    {
      "pk": 23119054,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 54,
      "text": "Your statutes have been my songs in the house of my pilgrimage.",
      "links": "<a href='/AIV/19/42/4'>Psalm 42:4</a>, <a href='/AIV/58/13/14'>Hebrews 13:14</a>",
      "comment": "Journeying through life, God’s commands become sources of joy and praise. The 'house of my pilgrimage' sees life as a journey towards God’s presence."
    },
    {
      "pk": 23119055,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 55,
      "text": "O Lord, I remember your name in the night and keep your law.",
      "links": "<a href='/AIV/19/63/6'>Psalm 63:6</a>, <a href='/AIV/19/119/62'>Psalm 119:62</a>",
      "comment": "Constant remembrance of God, even at night, leads to obedience. This reflects devout spirituality, with both private and communal dimensions."
    },
    {
      "pk": 23119056,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 56,
      "text": "This blessing has fallen to me, that I have kept your precepts.",
      "links": "<a href='/AIV/19/119/2'>Psalm 119:2</a>, <a href='/AIV/19/119/67'>Psalm 119:67</a>",
      "comment": "Keeping God’s commandments is seen as a divine blessing, not mere obligation—a theme echoed in the Beatitudes (<a href='/AIV/40/5/6'>Matthew 5:6</a>)."
    },
    {
      "pk": 23119057,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 57,
      "text": "The Lord is my portion; I promise to keep your words.",
      "links": "<a href='/AIV/25/3/24'>Lamentations 3:24</a>, <a href='/AIV/19/16/5'>Psalm 16:5</a>",
      "comment": "God alone is the psalmist’s inheritance and satisfaction, responding with faithfulness. The theme of God as ‘portion’ runs through both testaments."
    },
    {
      "pk": 23119058,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 58,
      "text": "I entreat your favor with all my heart; be gracious to me according to your word.",
      "links": "<a href='/AIV/19/4/1'>Psalm 4:1</a>, <a href='/AIV/19/119/10'>Psalm 119:10</a>",
      "comment": "Wholeheartedly seeking God’s favor and grace underscores humanity’s need for mercy—fully revealed in Christ (<a href='/AIV/45/3/24'>Romans 3:24</a>)."
    },
    {
      "pk": 23119059,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 59,
      "text": "I pondered my ways and turned my steps back to your testimonies.",
      "links": "<a href='/AIV/19/119/9'>Psalm 119:9</a>, <a href='/AIV/42/15/17'>Luke 15:17</a>",
      "comment": "True repentance involves reflection and deliberate return to God’s path, as seen in the parable of the Prodigal Son."
    },
    {
      "pk": 23119060,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 60,
      "text": "I hurry and do not delay to keep your commandments.",
      "links": "<a href='/AIV/19/119/32'>Psalm 119:32</a>, <a href='/AIV/18/23/13'>Job 23:13'</a>",
      "comment": "Prompt obedience is valued. There is urgency for aligning one’s life with God’s will—a theme echoed in Christ’s call to discipleship."
    },
    {
      "pk": 23119061,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 61,
      "text": "Though the cords of the wicked ensnare me, I do not forget your law.",
      "links": "<a href='/AIV/19/119/109'>Psalm 119:109</a>, <a href='/AIV/19/119/23'>Psalm 119:23</a>",
      "comment": "Even in the midst of oppression, fidelity to God’s law is maintained. This echoes Christ’s obedience in suffering."
    },
    {
      "pk": 23119062,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 62,
      "text": "At midnight I rise to give you thanks because of your righteous judgments.",
      "links": "<a href='/AIV/19/119/164'>Psalm 119:164</a>, <a href='/AIV/44/16/25'>Acts 16:25</a>",
      "comment": "Nighttime devotion and praise are modeled, reminiscent of Paul and Silas praying at midnight in prison."
    },
    {
      "pk": 23119063,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 63,
      "text": "I am a companion of all who fear you, of those who keep your precepts.",
      "links": "<a href='/AIV/19/16/3'>Psalm 16:3</a>, <a href='/AIV/56/1/4'>Titus 1:4</a>",
      "comment": "Fellowship with those devoted to God is celebrated. Community life among the faithful is rooted in obedience."
    },
    {
      "pk": 23119064,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 64,
      "text": "The earth, O Lord, is full of your steadfast love; teach me your statutes.",
      "links": "<a href='/AIV/19/33/5'>Psalm 33:5</a>, <a href='/AIV/19/119/12'>Psalm 119:12</a>",
      "comment": "God’s mercy fills creation, and understanding His laws is the believer’s prayer. Recognizing God’s love in all creation is part of spiritual insight."
    },
    {
      "pk": 23119065,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 65,
      "text": "You have dealt well with your servant, O Lord, according to your word.",
      "links": "<a href='/AIV/19/13/6'>Psalm 13:6</a>, <a href='/AIV/19/119/17'>Psalm 119:17</a>",
      "comment": "Praise for God’s faithfulness in fulfilling his promises, echoing God’s goodness throughout salvation history."
    },
    {
      "pk": 23119066,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 66,
      "text": "Teach me good judgment and knowledge, for I believe in your commandments.",
      "links": "<a href='/AIV/19/119/125'>Psalm 119:125</a>, <a href='/AIV/59/1/5'>James 1:5</a>",
      "comment": "The psalmist recognizes the need for divine instruction—pursuing wisdom requires faith in God’s word."
    },
    {
      "pk": 23119067,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 67,
      "text": "Before I was afflicted I went astray, but now I keep your word.",
      "links": "<a href='/AIV/19/119/71'>Psalm 119:71</a>, <a href='/AIV/58/12/10-11'>Hebrews 12:10-11</a>",
      "comment": "Suffering leads to repentance and obedience—a theme echoed in the New Testament’s teaching on the discipline of the Lord."
    },
    {
      "pk": 23119068,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 68,
      "text": "You are good and do good; teach me your statutes.",
      "links": "<a href='/AIV/19/100/5'>Psalm 100:5</a>, <a href='/AIV/19/25/8'>Psalm 25:8</a>",
      "comment": "God's essential goodness is affirmed. The believer eagerly seeks to learn from God’s perfect ways."
    },
    {
      "pk": 23119069,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 69,
      "text": "The arrogant smear me with lies, but I keep your precepts with my whole heart.",
      "links": "<a href='/AIV/19/119/78'>Psalm 119:78</a>, <a href='/AIV/19/31/18'>Psalm 31:18</a>",
      "comment": "Injustice and slander are countered by steadfast obedience from the heart. The spiritual battle is persevered by remaining in truth."
    },
    {
      "pk": 23119070,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 70,
      "text": "Their hearts are unfeeling like fat, but I delight in your law.",
      "links": "<a href='/AIV/19/17/10'>Psalm 17:10</a>, <a href='/AIV/19/73/7'>Psalm 73:7</a>",
      "comment": "Spiritual dullness is contrasted with the joy of divine instruction. Hardened hearts turn away, while the faithful rejoice in God’s law."
    },
    {
      "pk": 23119071,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 71,
      "text": "It was good for me that I was afflicted, so that I might learn your statutes.",
      "links": "<a href='/AIV/19/119/67'>Psalm 119:67</a>, <a href='/AIV/45/5/3-5'>Romans 5:3-5</a>",
      "comment": "Affliction is seen as a means of spiritual growth. Suffering is permitted by God for a greater good—reflected in Christ’s passion."
    },
    {
      "pk": 23119072,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 72,
      "text": "The law from your mouth is more precious to me than thousands of pieces of gold and silver.",
      "links": "<a href='/AIV/19/19/10'>Psalm 19:10</a>, <a href='/AIV/20/16/16'>Proverbs 16:16</a>",
      "comment": "The supreme value of God’s word exceeds all worldly wealth—a principle which forms the foundation for prioritizing spiritual treasures."
    },
    {
      "pk": 23119073,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 73,
      "text": "Your hands made me and formed me; give me understanding so I may learn your commandments.",
      "links": "<a href='/AIV/19/139/13'>Psalm 139:13</a>, <a href='/AIV/18/10/8-12'>Job 10:8-12</a>",
      "comment": "There is a recognition of God as Creator and Teacher. The petition for understanding emphasizes grace empowering knowledge."
    },
    {
      "pk": 23119074,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 74,
      "text": "Those who fear you shall see me and rejoice, because I have hoped in your word.",
      "links": "<a href='/AIV/19/34/2'>Psalm 34:2</a>, <a href='/AIV/42/1/6'>Luke 1:6</a>",
      "comment": "The faithfulness of one believer brings encouragement to the community. Witness impacts others—calling to the communal life of the Church."
    },
    {
      "pk": 23119075,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 75,
      "text": "I know, O Lord, that your judgments are righteous, and that in faithfulness you have afflicted me.",
      "links": "<a href='/AIV/05/8/16'>Deuteronomy 8:16</a>, <a href='/AIV/19/119/137'>Psalm 119:137</a>",
      "comment": "God’s afflictions are grounded in righteousness and love—discipline is a sign of true sonship (<a href='/AIV/58/12/6'>Hebrews 12:6</a>)."
    },
    {
      "pk": 23119076,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 76,
      "text": "Let your steadfast love be my comfort, according to your promise to your servant.",
      "links": "<a href='/AIV/19/119/41'>Psalm 119:41</a>, <a href='/AIV/23/40/1'>Isaiah 40:1</a>",
      "comment": "Once again, the theme of covenantal love as the believer’s source of comfort is emphasized, anticipating Christ as the fulfillment of God’s promises."
    },
    {
      "pk": 23119077,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 77,
      "text": "Let your tender mercies come to me, that I may live; for your law is my delight.",
      "links": "<a href='/AIV/19/119/93'>Psalm 119:93</a>, <a href='/AIV/19/51/1'>Psalm 51:1</a>",
      "comment": "Divine mercy is closely linked to the gift of spiritual life. The request for mercy reveals human dependency on God’s grace, reflected in the Gospel."
    },
    {
      "pk": 23119078,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 78,
      "text": "Let the arrogant be put to shame, for they wrong me with lies; but as for me, I will meditate on your precepts.",
      "links": "<a href='/AIV/19/35/26'>Psalm 35:26</a>, <a href='/AIV/19/119/69'>Psalm 119:69</a>",
      "comment": "The righteous respond to slander with prayerful meditation and trust in God's justice—a theme embodied by Christ (<a href='/AIV/60/2/23'>1 Peter 2:23</a>)."
    },
    {
      "pk": 23119079,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 79,
      "text": "Let those who fear you turn to me, that they may know your testimonies.",
      "links": "<a href='/AIV/19/34/2'>Psalm 34:2</a>, <a href='/AIV/19/119/74'>Psalm 119:74</a>",
      "comment": "Godly community depends on mutual encouragement and shared witness. Instruction in the faith draws others to deeper understanding."
    },
    {
      "pk": 23119080,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 80,
      "text": "May my heart be blameless in your statutes, that I may not be put to shame.",
      "links": "<a href='/AIV/19/19/13'>Psalm 19:13</a>, <a href='/AIV/42/1/6'>Luke 1:6</a>",
      "comment": "Integrity of heart is emphasized as the foundation for a shameless life. Holiness is consistently presented as both inward and outward."
    },
    {
      "pk": 23119081,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 81,
      "text": "My soul longs for Your salvation; I put my hope in Your word.",
      "links": "<a href='/AIV/19/130/5'>Psalm 130:5</a>; <a href='/AIV/42/2/25'>Luke 2:25</a>",
      "comment": "The psalmist expresses deep yearning for God's deliverance, trusting in His promises. This mirrors the expectation for the Messiah and salvation through Christ—a theme fulfilled in the New Testament."
    },
    {
      "pk": 23119082,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 82,
      "text": "My eyes grow tired as I look for Your promise; I ask, \"When will You comfort me?\"",
      "links": "<a href='/AIV/19/69/3'>Psalm 69:3</a>; <a href='/AIV/23/40/1'>Isaiah 40:1</a>",
      "comment": "The psalmist's persistence suggests active waiting and trust, aligning with biblical calls to patient endurance in faith, anticipating God’s timing."
    },
    {
      "pk": 23119083,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 83,
      "text": "Though I am like a wineskin dried in smoke, I do not forget Your statutes.",
      "links": "<a href='/AIV/18/30/30'>Job 30:30</a>",
      "comment": "A wineskin in smoke is shriveled and worn. Even in affliction, the psalmist holds fast to God’s law—a call for steadfast faith during trials."
    },
    {
      "pk": 23119084,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 84,
      "text": "How many are the days of Your servant? When will You judge those who persecute me?",
      "links": "<a href='/AIV/19/94/1-2'>Psalm 94:1-2</a>",
      "comment": "The plea for just judgment reflects hope in divine vindication. Spiritual interpretation: Christ embodies the perfect judge (see <a href='/AIV/43/5/22'>John 5:22</a>)."
    },
    {
      "pk": 23119085,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 85,
      "text": "The arrogant have dug pits for me, contrary to Your law.",
      "links": "<a href='/AIV/19/57/6'>Psalm 57:6</a>",
      "comment": "Pit-digging is a metaphor for deadly traps by the wicked. Fidelity to God’s law brings opposition—a theme fulfilled in the suffering of Christ."
    },
    {
      "pk": 23119086,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 86,
      "text": "All Your commands are trustworthy; they persecute me with lies—help me!",
      "links": "<a href='/AIV/19/12/6'>Psalm 12:6</a>",
      "comment": "God’s commands are pure and reliable. The psalmist’s cry reveals confidence in divine help, reminiscent of appeals to truth found in Christ (see <a href='/AIV/43/14/6'>John 14:6</a>)."
    },
    {
      "pk": 23119087,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 87,
      "text": "They have nearly wiped me from the earth, but I have not forsaken Your precepts.",
      "links": "<a href='/AIV/19/44/13'>Psalm 44:13</a>",
      "comment": "Faithfulness amid distress is a trait of God’s servants. An echo of those lovingly obedient even to death, such as the martyrs and Christ."
    },
    {
      "pk": 23119088,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 88,
      "text": "In Your steadfast love, preserve my life, so that I may keep the testimony of Your mouth.",
      "links": "<a href='/AIV/19/119/159'>Psalm 119:159</a>",
      "comment": "Seeking preservation for the sake of obedience shows gratitude for God’s love. Testimonies are meant to be lived and proclaimed, as seen in apostolic witness."
    },
    {
      "pk": 23119089,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 89,
      "text": "Forever, O LORD, Your word stands firm in heaven.",
      "links": "<a href='/AIV/19/89/2'>Psalm 89:2</a>",
      "comment": "God’s word is eternal and unchanging. This reveals a timeless truth: divine revelation is not subject to human change, a key theme in Christian tradition."
    },
    {
      "pk": 23119090,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 90,
      "text": "Your faithfulness continues through all generations; You established the earth, and it stands firm.",
      "links": "<a href='/AIV/19/33/9'>Psalm 33:9</a>",
      "comment": "God’s creative power and fidelity form the basis for creation and covenant. His constancy is a source of assurance for believers."
    },
    {
      "pk": 23119091,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 91,
      "text": "Your laws remain to this day, for all things serve You.",
      "links": "<a href='/AIV/19/148/5-6'>Psalm 148:5-6</a>",
      "comment": "Creation obeys God’s ordinances, underscoring divine providence. This understanding shapes liturgical prayer and doxology."
    },
    {
      "pk": 23119092,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 92,
      "text": "If Your law had not been my delight, I would have perished in my affliction.",
      "links": "<a href='/AIV/19/119/143'>Psalm 119:143</a>",
      "comment": "Finding joy in God’s law offers strength to endure suffering. Recitation of God’s word is a source of life."
    },
    {
      "pk": 23119093,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 93,
      "text": "I will never forget Your precepts, for by them You have restored my life.",
      "links": "<a href='/AIV/19/119/50'>Psalm 119:50</a>",
      "comment": "God’s precepts impart renewal. Spiritual formation centers on remembering and inwardly digesting the Word."
    },
    {
      "pk": 23119094,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 94,
      "text": "I am Yours—save me, for I have sought Your precepts.",
      "links": "<a href='/AIV/19/100/3'>Psalm 100:3</a>",
      "comment": "Belonging to God calls forth protection. The attitude of abandonment to God recurs in the prayer life of saints."
    },
    {
      "pk": 23119095,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 95,
      "text": "The wicked wait in ambush to destroy me, but I consider Your testimonies.",
      "links": "<a href='/AIV/19/56/6'>Psalm 56:6</a>",
      "comment": "Reflecting on God’s word is a defense against evil, and a call to perseverance. The meditative aspect is essential for spiritual growth."
    },
    {
      "pk": 23119096,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 96,
      "text": "I see an end to all perfection, but Your commandment is exceedingly broad.",
      "links": "<a href='/AIV/19/19/7'>Psalm 19:7</a>",
      "comment": "Human achievement has limits, but divine law is infinite in wisdom. Emphasizes the fullness and depth of God’s revelation."
    },
    {
      "pk": 23119097,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 97,
      "text": "Oh, how I love Your law! I meditate on it all day long.",
      "links": "<a href='/AIV/19/1/2'>Psalm 1:2</a>",
      "comment": "A deep affection for God’s law fosters constant meditation—considered key for sanctification."
    },
    {
      "pk": 23119098,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 98,
      "text": "Your commands make me wiser than my enemies, for they are always with me.",
      "links": "<a href='/AIV/19/111/10'>Psalm 111:10</a>",
      "comment": "Wisdom is a byproduct of obedience to God’s commands—an encouragement for ongoing study and application."
    },
    {
      "pk": 23119099,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 99,
      "text": "I have more insight than all my teachers, for I meditate on Your testimonies.",
      "links": "<a href='/AIV/19/119/24'>Psalm 119:24</a>",
      "comment": "Spiritual insight surpasses human knowledge. Meditation opens the way to deeper understanding by God’s Spirit."
    },
    {
      "pk": 23119100,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 100,
      "text": "I understand more than the elders, for I keep Your precepts.",
      "links": "<a href='/AIV/19/119/104'>Psalm 119:104</a>",
      "comment": "Obedience to God’s word brings wisdom, sometimes surpassing even those of high rank. Consider Christ’s wisdom at age twelve (<a href='/AIV/42/2/46-47'>Luke 2:46-47</a>)."
    },
    {
      "pk": 23119101,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 101,
      "text": "I have kept my feet from every evil path, so that I might obey Your word.",
      "links": "<a href='/AIV/19/17/4'>Psalm 17:4</a>",
      "comment": "Avoiding sin is tied to a commitment to obey God, urging both moral and spiritual discipline."
    },
    {
      "pk": 23119102,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 102,
      "text": "I have not turned away from Your ordinances, for You Yourself have taught me.",
      "links": "<a href='/AIV/19/119/12'>Psalm 119:12</a>",
      "comment": "God’s personal instruction is a form of direct teaching—acknowledged in Christian understanding of spiritual guidance."
    },
    {
      "pk": 23119103,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 103,
      "text": "How sweet are Your words to my taste, sweeter than honey to my mouth!",
      "links": "<a href='/AIV/19/19/10'>Psalm 19:10</a>; <a href='/AIV/26/3/3'>Ezekiel 3:3</a>",
      "comment": "The Word is a sweetness, to be relished; signals the importance of internalizing scripture in prayer and worship."
    },
    {
      "pk": 23119104,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 104,
      "text": "Through Your precepts I gain understanding; therefore I hate every false way.",
      "links": "<a href='/AIV/19/97/10'>Psalm 97:10</a>",
      "comment": "God’s teachings cultivate discernment and a strong aversion to evil—vital to spiritual formation."
    },
    {
      "pk": 23119105,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 105,
      "text": "Your word is a lamp to my feet and a light to my path.",
      "links": "<a href='/AIV/19/18/28'>Psalm 18:28</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "God’s word illuminates the way, guiding believers towards righteousness. Christ as ‘light of the world’ fulfills this imagery (<a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 23119106,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 106,
      "text": "I have sworn, and I will confirm it, to keep Your righteous judgments.",
      "links": "<a href='/AIV/19/101/1'>Psalm 101:1</a>",
      "comment": "A solemn vow to obedience is affirmed. Vows and public commitments hold deep biblical and spiritual significance."
    },
    {
      "pk": 23119107,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 107,
      "text": "I am greatly afflicted; LORD, give me life according to Your word.",
      "links": "<a href='/AIV/19/71/20'>Psalm 71:20</a>",
      "comment": "A prayer for renewal and restoration through the life-giving Word; a motif evident throughout salvation history."
    },
    {
      "pk": 23119108,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 108,
      "text": "Accept the offerings I freely give, LORD, and teach me Your judgments.",
      "links": "<a href='/AIV/19/19/14'>Psalm 19:14</a>",
      "comment": "Freewill offerings can refer to praise or sacrifice—paralleling New Testament spiritual sacrifices (<a href='/AIV/58/13/15'>Hebrews 13:15</a>)."
    },
    {
      "pk": 23119109,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 109,
      "text": "My life is always in danger, but I do not forget Your law.",
      "links": "<a href='/AIV/19/119/61'>Psalm 119:61</a>",
      "comment": "Loyalty to God’s law is maintained despite risk—highlights faithfulness unto death, even as seen in Christ’s passion."
    },
    {
      "pk": 23119110,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 110,
      "text": "The wicked have set a snare for me, but I have not strayed from Your precepts.",
      "links": "<a href='/AIV/19/141/9'>Psalm 141:9</a>",
      "comment": "Temptation and opposition are resisted through adherence to God’s commands. Spiritual vigilance is encouraged."
    },
    {
      "pk": 23119111,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 111,
      "text": "Your testimonies are my heritage forever; they are the joy of my heart.",
      "links": "<a href='/AIV/19/16/6'>Psalm 16:6</a>",
      "comment": "God’s testimonies form an everlasting inheritance to the faithful—joy in shared legacy of the family of faith."
    },
    {
      "pk": 23119112,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 112,
      "text": "I have set my heart to follow Your ordinances always, to the very end.",
      "links": "<a href='/AIV/19/119/33'>Psalm 119:33</a>",
      "comment": "A resolute commitment to lifelong obedience—exemplifies perseverance, a Christian virtue."
    },
    {
      "pk": 23119113,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 113,
      "text": "I hate divided minds, but I love Your law.",
      "links": "<a href='/AIV/19/12/2'>Psalm 12:2</a>; <a href='/AIV/59/1/8'>James 1:8</a>",
      "comment": "Sincerity is valued; double-mindedness is rejected. Holding firmly to God’s law is praised as a mark of true devotion."
    },
    {
      "pk": 23119114,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 114,
      "text": "You are my shelter and my shield; I hope in Your word.",
      "links": "<a href='/AIV/19/3/3'>Psalm 3:3</a>",
      "comment": "God’s protection and His word are the psalmist’s security. Spiritual meaning: God defends those who trust in Him and in His promises."
    },
    {
      "pk": 23119115,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 115,
      "text": "Away from me, you evildoers, so I may keep the commands of my God!",
      "links": "<a href='/AIV/19/6/8'>Psalm 6:8</a>",
      "comment": "Rejection of evil company supports a life dedicated to God. Separation for holiness is an important biblical theme."
    },
    {
      "pk": 23119116,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 116,
      "text": "Uphold me as You promised, that I may live; let me not be put to shame for my hope.",
      "links": "<a href='/AIV/19/25/2-3'>Psalm 25:2-3</a>",
      "comment": "Trust in God’s faithfulness prevents disappointment, echoing Romans 5:5—that hope does not put us to shame."
    },
    {
      "pk": 23119117,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 117,
      "text": "Hold me up, and I will be safe; I will always regard Your statutes.",
      "links": "<a href='/AIV/19/41/12'>Psalm 41:12</a>",
      "comment": "Safety and stability come from God’s support and sustained reverence for His law."
    },
    {
      "pk": 23119118,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 118,
      "text": "You dismiss all who wander from Your statutes, for their deceit is in vain.",
      "links": "<a href='/AIV/19/73/27'>Psalm 73:27</a>",
      "comment": "God opposes those who turn away; truth prevails while deceit is exposed and judged."
    },
    {
      "pk": 23119119,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 119,
      "text": "All the wicked of the earth You remove like dross; therefore I love Your testimonies.",
      "links": "<a href='/AIV/20/25/4'>Proverbs 25:4</a>",
      "comment": "Dross represents impurities. God’s purification of His people encourages deeper love for His revealed Word."
    },
    {
      "pk": 23119120,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 120,
      "text": "My flesh trembles for fear of You, and I stand in awe of Your judgments.",
      "links": "<a href='/AIV/19/2/11'>Psalm 2:11</a>; <a href='/AIV/19/119/161'>Psalm 119:161</a>",
      "comment": "Holy fear and reverence for God’s judgments bring the soul into proper relationship with Him—a theme further illuminated in the encounter with Christ, who fulfilled the law and revealed perfect justice."
    },
    {
      "pk": 23119121,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 121,
      "text": "I have done what is just and right; do not leave me to my oppressors.",
      "links": "<a href='/AIV/20/2/9'>Proverbs 2:9</a>",
      "comment": "The psalmist appeals to God’s justice, acknowledging personal righteousness. Justice is a crucial virtue in the biblical narrative, pointing to the deeper need for divine intervention and a higher moral standard."
    },
    {
      "pk": 23119122,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 122,
      "text": "Guarantee your servant's welfare; do not let the arrogant oppress me.",
      "links": "<a href='/AIV/19/37/20'>Psalm 37:20</a>",
      "comment": "The psalmist requests divine advocacy, suggesting God's unique ability to secure protection for the faithful. This foreshadows Christ's role as advocate and mediator."
    },
    {
      "pk": 23119123,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 123,
      "text": "My eyes grow tired looking for your salvation and for your righteous promise.",
      "links": "<a href='/AIV/23/130/5'>Psalm 130:5</a>",
      "comment": "Salvation and promise here are messianic in nature, with the longing hinting at a desire for ultimate deliverance, later fulfilled in Christ."
    },
    {
      "pk": 23119124,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 124,
      "text": "Deal with your servant according to your steadfast love and teach me your statutes.",
      "links": "<a href='/AIV/23/25/6'>Psalm 25:6</a>",
      "comment": "The reference to steadfast love (Hebrew: 'hesed') connects God's mercy to instruction, indicating that grace is intertwined with learning divine law."
    },
    {
      "pk": 23119125,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 125,
      "text": "I am your servant; give me understanding, that I may know your decrees.",
      "links": "<a href='/AIV/20/2/3-6'>Proverbs 2:3-6</a>",
      "comment": "Here, knowledge and service are closely linked. Understanding God's law reflects the importance of both study and obedience."
    },
    {
      "pk": 23119126,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 126,
      "text": "It is time for the Lord to act, for they have broken your law.",
      "links": "<a href='/AIV/23/94/20-23'>Psalm 94:20-23</a>",
      "comment": "A call for divine intervention when God's law is neglected. This sets up a longing for restoration and divine judgment."
    },
    {
      "pk": 23119127,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 127,
      "text": "Therefore I love your commandments above gold, even the finest gold.",
      "links": "<a href='/AIV/20/8/10'>Proverbs 8:10</a>",
      "comment": "A declaration of the priceless value of God’s commands. This prefigures Jesus' teaching on the treasures of the Kingdom."
    },
    {
      "pk": 23119128,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 128,
      "text": "So I consider all your precepts to be right; I hate every false way.",
      "links": "<a href='/AIV/20/13/5'>Proverbs 13:5</a>",
      "comment": "Affirming the absolute righteousness of God’s statutes, contrasting truth and falsehood. Calls believers to moral clarity."
    },
    {
      "pk": 23119129,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 129,
      "text": "Your testimonies are wonderful; therefore my soul keeps them.",
      "links": "<a href='/AIV/19/19/7'>Psalm 19:7</a>",
      "comment": "The psalmist's awe at God's word inspires dedication—echoes the transformative nature of God's law."
    },
    {
      "pk": 23119130,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 130,
      "text": "The unfolding of your words gives light, it gives understanding to the simple.",
      "links": "<a href='/AIV/19/43/3'>Psalm 43:3</a>",
      "comment": "God's word illuminates hearts and minds, symbolizing divine revelation—an essential principle for true spiritual formation."
    },
    {
      "pk": 23119131,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 131,
      "text": "I open my mouth wide and pant, because I long for your commandments.",
      "links": "<a href='/AIV/19/84/2'>Psalm 84:2</a>",
      "comment": "Deep spiritual longing for God’s law, evoking desire for closeness with God—literally and mystically."
    },
    {
      "pk": 23119132,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 132,
      "text": "Turn to me and show me mercy, as is your custom toward those who love your name.",
      "links": "<a href='/AIV/23/86/5'>Psalm 86:5</a>",
      "comment": "Appeals to God's established pattern of mercy for the faithful, connecting the personal with the communal."
    },
    {
      "pk": 23119133,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 133,
      "text": "Direct my steps by your word, and let no evil gain dominion over me.",
      "links": "<a href='/AIV/19/17/5'>Psalm 17:5</a>",
      "comment": "God’s word is shown as actively guiding and protecting from the reign of sin. There is a spiritual dynamic to this dominion."
    },
    {
      "pk": 23119134,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 134,
      "text": "Redeem me from human oppression, that I may keep your precepts.",
      "links": "<a href='/AIV/19/119/22'>Psalm 119:22</a>",
      "comment": "Deliverance from persecution is connected to faithful obedience. Freedom to serve God is a central biblical theme."
    },
    {
      "pk": 23119135,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 135,
      "text": "Make your face shine on your servant, and teach me your statutes.",
      "links": "<a href='/AIV/4/6/25'>Numbers 6:25</a>",
      "comment": "The shining face invokes blessing and favor, echoing the priestly benediction and highlighting the value of divine revelation."
    },
    {
      "pk": 23119136,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 136,
      "text": "Streams of tears flow from my eyes because people do not keep your law.",
      "links": "<a href='/AIV/19/119/53'>Psalm 119:53</a>",
      "comment": "A lament over the widespread neglect of God’s law, which points toward communal responsibility and sorrow over sin."
    },
    {
      "pk": 23119137,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 137,
      "text": "You are righteous, O LORD, and your judgments are right.",
      "links": "<a href='/AIV/19/145/17'>Psalm 145:17</a>",
      "comment": "Affirms the righteousness of God and His decrees—key to understanding divine justice and holiness."
    },
    {
      "pk": 23119138,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 138,
      "text": "You have appointed your testimonies in righteousness and in exceeding faithfulness.",
      "links": "<a href='/AIV/19/119/75'>Psalm 119:75</a>",
      "comment": "God’s faithful and righteous establishment of His word shows reliability, foregrounding the stability of divine truth."
    },
    {
      "pk": 23119139,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 139,
      "text": "My zeal wears me out because my foes ignore your words.",
      "links": "<a href='/AIV/19/69/9'>Psalm 69:9</a>",
      "comment": "The psalmist’s zeal for God’s law leads to exhaustion—echoes prophetic devotion and the cost of fidelity."
    },
    {
      "pk": 23119140,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 140,
      "text": "Your word is very pure; therefore your servant loves it.",
      "links": "<a href='/AIV/19/12/6'>Psalm 12:6</a>",
      "comment": "A declaration of the pure and refined nature of God’s revelation, making it a source of love and commitment."
    },
    {
      "pk": 23119141,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 141,
      "text": "I am insignificant and despised, yet I do not forget your precepts.",
      "links": "<a href='/AIV/19/22/6'>Psalm 22:6</a>",
      "comment": "Even in humility and rejection, the psalmist remains faithful—foreshadowing Christ’s own humble endurance."
    },
    {
      "pk": 23119142,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 142,
      "text": "Your righteousness is everlasting, and your law is truth.",
      "links": "<a href='/AIV/19/19/9'>Psalm 19:9</a>",
      "comment": "Affirms the eternal nature of God's righteousness and the absolute truth of His law—a foundation for Christian doctrine."
    },
    {
      "pk": 23119143,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 143,
      "text": "Trouble and distress have come upon me, but I delight in your commandments.",
      "links": "<a href='/AIV/19/119/50'>Psalm 119:50</a>",
      "comment": "Despite affliction, joy is found in God’s commandments—parallels Christ’s perseverance in suffering."
    },
    {
      "pk": 23119144,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 144,
      "text": "The righteousness of your testimonies is everlasting; give me understanding and I shall live.",
      "links": "<a href='/AIV/19/119/34'>Psalm 119:34</a>",
      "comment": "Life and understanding are connected to knowledge of God's eternal testimonies—echoes promises of new life through grace."
    },
    {
      "pk": 23119145,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 145,
      "text": "I call with my whole heart; answer me, O LORD, that I may keep your statutes.",
      "links": "<a href='/AIV/19/86/11'>Psalm 86:11</a>",
      "comment": "Shows the heartfelt nature of true prayer, aiming at faithful obedience; connects inward devotion to outward action."
    },
    {
      "pk": 23119146,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 146,
      "text": "I call to you; save me, and I will keep your testimonies.",
      "links": "<a href='/AIV/19/18/3'>Psalm 18:3</a>",
      "comment": "Salvation is linked to ongoing obedience, a recurring theme in both Testaments."
    },
    {
      "pk": 23119147,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 147,
      "text": "I rise before dawn and cry for help; I put my hope in your word.",
      "links": "<a href='/AIV/19/5/3'>Psalm 5:3</a>",
      "comment": "Early rising for prayer and placing hope in God's word highlight spiritual discipline and trust."
    },
    {
      "pk": 23119148,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 148,
      "text": "My eyes are awake through the night watches, so that I may meditate on your promise.",
      "links": "<a href='/AIV/19/63/6'>Psalm 63:6</a>",
      "comment": "Nighttime meditation signifies ongoing devotion and the importance of habitual reflection on God’s promises."
    },
    {
      "pk": 23119149,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 149,
      "text": "Hear my voice according to your steadfast love; O LORD, revive me according to your justice.",
      "links": "<a href='/AIV/19/119/40'>Psalm 119:40</a>",
      "comment": "Links God’s loving kindness and justice to personal rejuvenation—rooted in God’s dual attributes."
    },
    {
      "pk": 23119150,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 150,
      "text": "Those who pursue wicked schemes draw near, but they are far from your law.",
      "links": "<a href='/AIV/19/119/95'>Psalm 119:95</a>",
      "comment": "Contrasts closeness of evil intentions with distance from divine law—hints at the necessity of moral separation from deceit."
    },
    {
      "pk": 23119151,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 151,
      "text": "But you are near, O LORD, and all your commandments are truth.",
      "links": "<a href='/AIV/19/34/18'>Psalm 34:18</a>",
      "comment": "God’s nearness is associated with the reliability of His commandments—invites intimacy with the divine through revelation."
    },
    {
      "pk": 23119152,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 152,
      "text": "Long ago I learned from your testimonies that you have established them forever.",
      "links": "<a href='/AIV/19/89/34'>Psalm 89:34</a>",
      "comment": "God’s word endures through time, highlighting the unchanging nature of divine revelation and doctrine."
    },
    {
      "pk": 23119153,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 153,
      "text": "Look upon my affliction and deliver me, for I have not forgotten your law.",
      "links": "<a href='/AIV/19/25/18'>Psalm 25:18</a>",
      "comment": "Deliverance sought through fidelity to God’s law—demonstrates the value of enduring commitment in adversity."
    },
    {
      "pk": 23119154,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 154,
      "text": "Plead my cause and redeem me; revive me according to your promise.",
      "links": "<a href='/AIV/19/43/1'>Psalm 43:1</a>",
      "comment": "The idea of pleading and redemption prefigures the intercessory work of Christ and the renewal found in His promises."
    },
    {
      "pk": 23119155,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 155,
      "text": "Salvation is far from the wicked, for they do not seek your statutes.",
      "links": "<a href='/AIV/19/18/41'>Psalm 18:41</a>",
      "comment": "Highlights spiritual distance as a result of disregard for God’s law—implies the necessity of seeking God with one’s life."
    },
    {
      "pk": 23119156,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 156,
      "text": "Great are your mercies, O LORD; revive me according to your judgments.",
      "links": "<a href='/AIV/19/119/77'>Psalm 119:77</a>",
      "comment": "The magnitude of God’s mercy is linked with renewal through His righteous judgments; balance of justice and grace."
    },
    {
      "pk": 23119157,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 157,
      "text": "Many are those who persecute and trouble me, yet I do not turn from your testimonies.",
      "links": "<a href='/AIV/19/119/86'>Psalm 119:86</a>",
      "comment": "Fidelity amid persecution prefigures the perseverance seen throughout Christian witness, particularly in the lives of the saints."
    },
    {
      "pk": 23119158,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 158,
      "text": "I look at the faithless with disgust, because they do not keep your word.",
      "links": "<a href='/AIV/19/139/21'>Psalm 139:21</a>",
      "comment": "A righteous indignation at those who abandon God’s law calls for discernment and zeal among the faithful."
    },
    {
      "pk": 23119159,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 159,
      "text": "See how I love your precepts; revive me, O LORD, according to your steadfast love.",
      "links": "<a href='/AIV/19/119/88'>Psalm 119:88</a>",
      "comment": "The psalmist ties revival and life to love of God’s law and mercy; hints at the transforming power of divine grace operating through adherence and love."
    },
    {
      "pk": 23119160,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 160,
      "text": "The sum of your word is truth, and every one of your righteous judgments endures forever.",
      "links": "<a href='/AIV/19/119/142'>Psalm 119:142</a>",
      "comment": "Concludes with the comprehensive claim of truth and eternal justice in God’s word, laying the foundation for stable doctrine and full trust in divine authority."
    },
    {
      "pk": 23119161,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 161,
      "text": "Princes persecute me without cause, but my heart stands in awe of your words.",
      "links": "<a href='/AIV/19/56/5'>Psalm 56:5</a>; <a href='/AIV/19/119/120'>Psalm 119:120</a>",
      "comment": "The psalmist contrasts worldly power against the enduring authority of God's word. 'Princes' can be read literally as rulers, but spiritually may reflect any antagonists to true faith, prefiguring Christ before authorities (<a href='/AIV/40/27/12-14'>Matthew 27:12-14</a>)."
    },
    {
      "pk": 23119162,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 162,
      "text": "I rejoice at your word like one who finds great treasure.",
      "links": "<a href='/AIV/19/19/10'>Psalm 19:10</a>; <a href='/AIV/40/13/44'>Matthew 13:44</a>",
      "comment": "Finding God's word is likened to finding treasure, echoing Jesus' parable about the kingdom of heaven. The value of scripture and tradition is emphasized here for those seeking spiritual riches."
    },
    {
      "pk": 23119163,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 163,
      "text": "I hate and despise falsehood, but I love your law.",
      "links": "<a href='/AIV/19/31/6'>Psalm 31:6</a>; <a href='/AIV/19/97/10'>Psalm 97:10</a>",
      "comment": "'Falsehood' represents anything contrary to God's teaching. Loving the law shows delight in God’s commandments beyond mere external obedience (<a href='/AIV/40/5/17'>Matthew 5:17</a>)."
    },
    {
      "pk": 23119164,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 164,
      "text": "Seven times a day I praise you for your righteous judgments.",
      "links": "<a href='/AIV/19/55/17'>Psalm 55:17</a>; <a href='/AIV/52/5/16-18'>1 Thessalonians 5:16-18</a>",
      "comment": "Praise structured around the day points to a tradition of regular prayer. This foreshadows the practice of continual prayer and communal worship (<a href='/AIV/44/3/1'>Acts 3:1</a>)."
    },
    {
      "pk": 23119165,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 165,
      "text": "Great peace have those who love your law; nothing can make them stumble.",
      "links": "<a href='/AIV/19/37/37'>Psalm 37:37</a>; <a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "The connection between loving God's law and having true peace is emphasized—hinting at the inner calm granted through fidelity to God's established ways in word and tradition."
    },
    {
      "pk": 23119166,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 166,
      "text": "Lord, I hope for your salvation, and I do your commandments.",
      "links": "<a href='/AIV/19/42/5'>Psalm 42:5</a>; <a href='/AIV/62/3/3'>1 John 3:3</a>",
      "comment": "Salvation is awaited by faith, but expressed through obedience—foreshadowing the role of good works as a fruit of true belief (<a href='/AIV/59/2/18'>James 2:18</a>)."
    },
    {
      "pk": 23119167,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 167,
      "text": "My soul keeps your testimonies; I love them greatly.",
      "links": "<a href='/AIV/19/119/47'>Psalm 119:47</a>; <a href='/AIV/19/119/129'>Psalm 119:129</a>",
      "comment": "A spiritual desire to keep God’s testimonies leads to great love for His revealed truth, pointing to the harmony of faith and works in the believer’s life."
    },
    {
      "pk": 23119168,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 168,
      "text": "I keep your precepts and your testimonies, for all my ways are before you.",
      "links": "<a href='/AIV/19/139/3'>Psalm 139:3</a>; <a href='/AIV/58/4/13'>Hebrews 4:13</a>",
      "comment": "The psalmist acknowledges God’s all-seeing presence; obedience is both heartfelt and conscious, reflecting a life open before God and the need for continual examination and confession."
    },
    {
      "pk": 23119169,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 169,
      "text": "Let my cry come before you, Lord; give me understanding according to your word.",
      "links": "<a href='/AIV/19/28/2'>Psalm 28:2</a>; <a href='/AIV/19/119/34'>Psalm 119:34</a>",
      "comment": "Understanding is sought as a gift through prayer, not just intellect—suggesting God’s grace enables proper comprehension, foreshadowing the need for divine illumination."
    },
    {
      "pk": 23119170,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 170,
      "text": "Let my request come before you; deliver me according to your promise.",
      "links": "<a href='/AIV/19/61/1'>Psalm 61:1</a>; <a href='/AIV/19/119/41'>Psalm 119:41</a>",
      "comment": "‘Promise’ here reminds the reader of God's covenants with His people, fulfilled ultimately in Christ's redemptive work (<a href='/AIV/42/1/68-73'>Luke 1:68-73</a>)."
    },
    {
      "pk": 23119171,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 171,
      "text": "My lips will pour out praise, for you teach me your statutes.",
      "links": "<a href='/AIV/19/51/15'>Psalm 51:15</a>; <a href='/AIV/19/119/12'>Psalm 119:12</a>",
      "comment": "True praise flows from instruction and learning from God, showing that knowledge and worship are united when faith seeks understanding in community."
    },
    {
      "pk": 23119172,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 172,
      "text": "My tongue will sing of your word, for all your commandments are righteous.",
      "links": "<a href='/AIV/19/40/9'>Psalm 40:9</a>; <a href='/AIV/45/7/12'>Romans 7:12</a>",
      "comment": "Singing God’s word emphasizes the joy and community of worship, echoing early practices of chanting Scripture as both worship and catechesis."
    },
    {
      "pk": 23119173,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 173,
      "text": "Let your hand be ready to help me, for I have chosen your precepts.",
      "links": "<a href='/AIV/19/119/173'>Psalm 119:173</a>; <a href='/AIV/19/18/35'>Psalm 18:35</a>",
      "comment": "The image of God's hand refers to his power and intervention. Actively choosing God's precepts points to free will and the human response to divine grace."
    },
    {
      "pk": 23119174,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 174,
      "text": "I long for your salvation, Lord, and your law is my delight.",
      "links": "<a href='/AIV/19/119/41'>Psalm 119:41</a>; <a href='/AIV/42/2/25'>Luke 2:25</a>",
      "comment": "The psalmist’s yearning for salvation links with delight in God's law—hinting at a longing not just for deliverance but for full communion with God within His established order."
    },
    {
      "pk": 23119175,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 175,
      "text": "Let my soul live and praise you, and let your judgments help me.",
      "links": "<a href='/AIV/19/22/26'>Psalm 22:26</a>; <a href='/AIV/19/119/7'>Psalm 119:7</a>",
      "comment": "Life and praise are linked—spiritual vitality is connected with continual worship. God’s judgments are understood as teaching instruments, guiding the faithful in both truth and mercy."
    },
    {
      "pk": 23119176,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 119,
      "verse": 176,
      "text": "I have gone astray like a lost sheep; seek your servant, for I do not forget your commandments.",
      "links": "<a href='/AIV/23/53/6'>Isaiah 53:6</a>; <a href='/AIV/42/15/4-7'>Luke 15:4-7</a>",
      "comment": "The image of the lost sheep foreshadows Christ’s parable, showing God as the seeker of the lost. The combination of confession and faithfulness echoes the dynamic between repentance and ongoing observance."
    }
  ],
  "translatedAt": "2025-12-24T17:41:32.656Z"
}