{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 97,
  "verses": [
    {
      "pk": 23097001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 1,
      "text": "The LORD reigns; let the earth rejoice; let the many coastlands be glad.",
      "links": "<a href='/AIV/19/96/10'>Ps. 96:10</a>; <a href='/AIV/19/99/1'>Ps. 99:1</a>",
      "comment": "This psalm opens with a declaration of God's kingship over all the earth, echoing the universal reign of the LORD as found in Ps. 96:10 and Ps. 99:1. The inclusion of 'many coastlands' shows God's sovereignty over all nations, pointing forward to the international scope of salvation brought through the Messiah and the gathering of all peoples into one worship. See also Isa. 42:10."
    },
    {
      "pk": 23097002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 2,
      "text": "Clouds and thick darkness are all around Him; righteousness and justice are the foundation of His throne.",
      "links": "<a href='/AIV/19/89/14'>Ps. 89:14</a>; <a href='/AIV/2/20/21'>Ex. 20:21</a>",
      "comment": "God's presence is described in terms associated with mystery and divine majesty, as seen in Exodus 20:21 when Moses approached God in the thick darkness. Righteousness and justice as the foundation of His throne underlines the unchanging moral character of God, a foundational belief for Christian ethics."
    },
    {
      "pk": 23097003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 3,
      "text": "Fire goes before Him and burns up His adversaries all around.",
      "links": "<a href='/AIV/19/50/3'>Ps. 50:3</a>; <a href='/AIV/2/24/17'>Ex. 24:17</a>",
      "comment": "The imagery of fire represents God's holiness and judgment. See Ps. 50:3. Fire is often seen preceding divine theophanies, indicating God's power to purify and judge. This alludes also to the final judgment when Christ returns in glory (2 Thess. 1:7-8)."
    },
    {
      "pk": 23097004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 4,
      "text": "His lightnings light up the world; the earth sees and trembles.",
      "links": "<a href='/AIV/19/77/18'>Ps. 77:18</a>; <a href='/AIV/19/18/14'>Ps. 18:14</a>",
      "comment": "The lightning is a sign of God's power being perceived worldwide, causing awe and fear. This reflects the events at Sinai and hints at Christ's second coming 'like lightning' (Matt. 24:27)."
    },
    {
      "pk": 23097005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 5,
      "text": "The mountains melt like wax before the LORD, before the Lord of all the earth.",
      "links": "<a href='/AIV/19/46/6'>Ps. 46:6</a>; <a href='/AIV/33/1/4'>Mic. 1:4</a>",
      "comment": "Mountains symbolize things unmovable or solid in creation but even these vanish before God's presence (Mic. 1:4). God's lordship is not just over a people, but over all the earth, pointing towards a universal understanding of God's reign."
    },
    {
      "pk": 23097006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 6,
      "text": "The heavens declare His righteousness, and all the peoples see His glory.",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>; <a href='/AIV/19/98/2'>Ps. 98:2</a>",
      "comment": "Echoes Ps. 19:1, affirming that creation itself testifies to the righteousness of God for all to see. This verse holds a prophetic dimension fulfilled as the knowledge of the LORD spreads to all nations through Christ. Cross-reference Rom. 1:19-20."
    },
    {
      "pk": 23097007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 7,
      "text": "Let all who serve carved images and boast in idols be put to shame; all gods bow down before Him.",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>; <a href='/AIV/58/1/6'>Heb. 1:6</a>",
      "comment": "Idolatry is renounced. Other 'gods' (false powers) are subject to the LORD alone. Hebrews 1:6 applies this to Christ, confirming the worship of Jesus as divine—used in early worship liturgies."
    },
    {
      "pk": 23097008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 8,
      "text": "Zion hears and is glad, and the daughters of Judah rejoice because of Your judgments, O LORD.",
      "links": "<a href='/AIV/19/48/11'>Ps. 48:11</a>; <a href='/AIV/19/122/4'>Ps. 122:4</a>",
      "comment": "Zion and Judah symbolize the covenant people rejoicing in God's rule. This anticipates the joy of the Church as the new Zion, gathering together to celebrate God’s just reign, which comes to fullness in Christ."
    },
    {
      "pk": 23097009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 9,
      "text": "For You, O LORD, are Most High over all the earth; You are exalted far above all gods.",
      "links": "<a href='/AIV/19/83/18'>Ps. 83:18</a>; <a href='/AIV/19/95/3'>Ps. 95:3</a>",
      "comment": "This verse continues to oppose paganism, emphasizing the supremacy of the LORD. The unique claim for the LORD’s universality finds greater fulfillment as Christ is revealed as Lord of all."
    },
    {
      "pk": 23097010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 10,
      "text": "O you who love the LORD, hate evil! He guards the lives of His saints; He delivers them from the hand of the wicked.",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>; <a href='/AIV/20/2/8'>Prov. 2:8</a>",
      "comment": "A call for moral living is given to the faithful. The word 'saints' denotes those set apart and who remain close to God. The mention of 'delivers them' points to the ultimate deliverance in Christ, who preserves his own from evil."
    },
    {
      "pk": 23097011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 11,
      "text": "Light is sown for the righteous, and gladness for the upright in heart.",
      "links": "<a href='/AIV/19/112/4'>Ps. 112:4</a>; <a href='/AIV/23/60/1-2'>Isa. 60:1-2</a>",
      "comment": "God’s blessings are likened to light and joy that spread to the righteous, echoing the growing revelation of salvation. Spiritually, this also foreshadows Christ, the true Light (John 8:12)."
    },
    {
      "pk": 23097012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 97,
      "verse": 12,
      "text": "Rejoice in the LORD, you righteous, and give thanks to His holy Name!",
      "links": "<a href='/AIV/19/30/4'>Ps. 30:4</a>; <a href='/AIV/19/32/11'>Ps. 32:11</a>",
      "comment": "A call to praise and thanksgiving concludes the psalm. To rejoice and give thanks is central to true worship, celebrated fully in the gathered worshiping community before God’s holy name; reminiscent of the liturgical praise found in God’s people assembled."
    }
  ],
  "translatedAt": "2025-12-24T06:33:32.234Z"
}