{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 80,
  "verses": [
    {
      "pk": 1908001,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 1,
      "text": "Hear us, Shepherd of Israel, you who lead Joseph like a flock; you who sit enthroned above the cherubim, shine forth.",
      "links": "<a href='/ESV/19/23/1'>Ps. 23:1</a>; <a href='/ESV/19/99/1'>Ps. 99:1</a>; <a href='/ESV/04/07/89'>Num. 7:89</a>",
      "comment": "The Psalm opens with a plea to the Shepherd of Israel, an image commonly associated with God’s pastoral care, foreshadowing Christ as the Good Shepherd (John 10:11). The mention of enthroned above the cherubim recalls God’s presence in the Holy of Holies, anticipating the fullness of His dwelling in Christ and the Church."
    },
    {
      "pk": 1908002,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 2,
      "text": "Before Ephraim and Benjamin and Manasseh, stir up your might and come to save us.",
      "links": "<a href='/ESV/04/10/22'>Num. 10:22–24</a>; <a href='/ESV/19/78/67'>Ps. 78:67–68</a>",
      "comment": "The tribes mentioned camped closest to the Ark, highlighting God’s saving power manifested through His chosen people. The emphasis on salvation prefigures the salvation brought by Christ, as understood in Catholic sacramental theology."
    },
    {
      "pk": 1908003,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 3,
      "text": "Restore us, O God; let your face shine, that we may be saved.",
      "links": "<a href='/ESV/19/67/1'>Ps. 67:1</a>; <a href='/ESV/04/06/25'>Num. 6:25</a>",
      "comment": "The request for God’s face to shine echoes the blessing of Aaron (Num. 6:25). Restoration and salvation here have both immediate historical meanings and deeper spiritual interpretations connected to grace in Catholic tradition."
    },
    {
      "pk": 1908004,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 4,
      "text": "O LORD God of hosts, how long will you be angry with the prayers of your people?",
      "links": "<a href='/ESV/19/74/1'>Ps. 74:1</a>; <a href='/ESV/23/64/9'>Isa. 64:9</a>",
      "comment": "Despite their prayers, God’s anger persists due to sin. This signifies the necessity of true repentance, and hints at the fuller reconciliation offered in the Sacraments."
    },
    {
      "pk": 1908005,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 5,
      "text": "You have fed them with the bread of tears and given them tears to drink in full measure.",
      "links": "<a href='/ESV/19/42/3'>Ps. 42:3</a>; <a href='/ESV/19/102/9'>Ps. 102:9</a>",
      "comment": "Bread and drink symbolize deep sorrow, but they prefigure Christ’s offering in the Eucharist, where bread and wine become channels of grace and transformation."
    },
    {
      "pk": 1908006,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 6,
      "text": "You have made us an object of contention for our neighbors, and our enemies mock us.",
      "links": "<a href='/ESV/19/44/13'>Ps. 44:13</a>; <a href='/ESV/19/79/4'>Ps. 79:4</a>",
      "comment": "Israel's shame among nations echoes the suffering servant motif, culminating in Jesus’ rejection and mockery. Suffering is understood in Catholicism as redemptive when united to Christ."
    },
    {
      "pk": 1908007,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 7,
      "text": "Restore us, O God of hosts; let your face shine, that we may be saved.",
      "links": "<a href='/ESV/19/80/3'>Ps. 80:3</a>; <a href='/ESV/19/67/1'>Ps. 67:1</a>",
      "comment": "Repeats the refrain, emphasizing the communal prayer for restoration. Theologically, this aligns with the Church's communal prayer life and liturgical restoration centered on God's presence."
    },
    {
      "pk": 1908008,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 8,
      "text": "You brought a vine out of Egypt; you drove out the nations and planted it.",
      "links": "<a href='/ESV/19/44/2'>Ps. 44:2</a>; <a href='/ESV/23/5/1-7'>Isa. 5:1–7</a>",
      "comment": "The vine metaphor for Israel is later applied by Jesus to Himself (John 15:1). Catholic interpretation sees the Church as the fulfillment of this planted vine."
    },
    {
      "pk": 1908009,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 9,
      "text": "You cleared the ground for it; it took root and filled the land.",
      "links": "<a href='/ESV/19/78/55'>Ps. 78:55</a>; <a href='/ESV/02/23/30'>Ex. 23:30</a>",
      "comment": "God’s action in establishing His people prefigures Christ's establishment of the new covenant community—the Church."
    },
    {
      "pk": 1908010,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 10,
      "text": "The mountains were covered with its shade, the mighty cedars with its branches.",
      "links": "<a href='/ESV/19/104/16'>Ps. 104:16</a>",
      "comment": "Israel’s flourishing foreshadows the Church’s spiritual influence, reaching every nation."
    },
    {
      "pk": 1908011,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 11,
      "text": "It sent out its branches to the sea and its shoots to the River.",
      "links": "<a href='/ESV/11/04/21'>1 Kings 4:21</a>; <a href='/ESV/01/15/18'>Gen. 15:18</a>",
      "comment": "The expanse of the vine symbolizes missionary outreach. Catholics interpret this as a prophecy of the Church’s universality."
    },
    {
      "pk": 1908012,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 12,
      "text": "Why then have you broken down its walls, so that all who pass along the way pluck its fruit?",
      "links": "<a href='/ESV/19/89/40'>Ps. 89:40</a>; <a href='/ESV/16/01/03'>Neh. 1:3</a>",
      "comment": "The breaking of walls is a sign of judgment for unfaithfulness, but also calls to mind Christ’s suffering and the vulnerability of the Church."
    },
    {
      "pk": 1908013,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 13,
      "text": "The boar from the forest ravages it, and all the creatures of the field feed on it.",
      "links": "<a href='/ESV/19/68/30'>Ps. 68:30</a>; <a href='/ESV/19/79/7'>Ps. 79:7</a>",
      "comment": "Interpretations often link 'the boar' to pagan invaders. Catholic tradition refers to this verse in relation to threats to the Church, as seen with Pope Leo X’s reference to Martin Luther as ‘the boar’."
    },
    {
      "pk": 1908014,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 14,
      "text": "Turn again, O God of hosts; look down from heaven and see; watch over this vine,",
      "links": "<a href='/ESV/19/33/13'>Ps. 33:13</a>; <a href='/ESV/19/14/2'>Ps. 14:2</a>",
      "comment": "The plea for God’s protection prefigures prayers for the Church’s guidance and care, especially through apostolic succession and papal leadership."
    },
    {
      "pk": 1908015,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 15,
      "text": "the root that your right hand planted, and the branch you made strong for yourself.",
      "links": "<a href='/ESV/23/11/1'>Isa. 11:1</a>; <a href='/ESV/19/44/3'>Ps. 44:3</a>",
      "comment": "‘Branch’ is messianic, pointing to Christ (Isa. 11:1). In Catholic exegesis, the branch also echoes Marian and ecclesial themes—the Church’s strength from Christ."
    },
    {
      "pk": 1908016,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 16,
      "text": "It is burned with fire, it is cut down; they perish at the rebuke of your face.",
      "links": "<a href='/ESV/23/10/17'>Isa. 10:17</a>; <a href='/ESV/19/21/9'>Ps. 21:9</a>",
      "comment": "Judgment comes to those who sever themselves from the vine—reflective of warnings against schism."
    },
    {
      "pk": 1908017,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 17,
      "text": "Let your hand be upon the man of your right hand, upon the son of man whom you have made strong for yourself.",
      "links": "<a href='/ESV/19/110/1'>Ps. 110:1</a>; <a href='/ESV/40/26/64'>Matt. 26:64</a>",
      "comment": "‘Son of man’ is directly linked in Christian theology to Jesus (see Mark 14:62), underscoring His preeminence. Catholic tradition also sees this as Christological and Marian, connecting to Jesus as the New Adam."
    },
    {
      "pk": 1908018,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 18,
      "text": "Then we will not turn away from you; revive us, and we will call upon your name.",
      "links": "<a href='/ESV/19/71/20'>Ps. 71:20</a>; <a href='/ESV/19/85/6'>Ps. 85:6</a>",
      "comment": "Revival and fidelity to God are the fruits of divine intervention, realized perfectly in the Church’s sacramental life, especially in confession and Eucharist."
    },
    {
      "pk": 1908019,
      "translation": "AIV",
      "book": 19,
      "chapter": 80,
      "verse": 19,
      "text": "Restore us, O LORD God of hosts; let your face shine, that we may be saved.",
      "links": "<a href='/ESV/19/80/3'>Ps. 80:3</a>; <a href='/ESV/19/80/7'>Ps. 80:7</a>",
      "comment": "The closing refrain again invokes God’s saving presence—fulfilled through Christ and continually experienced in the Church’s worship and sacramental grace."
    }
  ],
  "translatedAt": "2025-12-22T21:45:47.909Z"
}