{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 99,
  "verses": [
    {
      "pk": 1999001,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 1,
      "text": "The LORD reigns; let the peoples tremble! He sits enthroned upon the cherubim; let the earth quake!",
      "links": "<a href='/AIV/02/25/22'>Ex. 25:22</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/19/97/1'>Ps. 97:1</a>",
      "comment": "The mention of the LORD reigning and being enthroned on the cherubim recalls God's presence above the Ark of the Covenant (Ex. 25:22), prefiguring Christ as the true King and High Priest. The trembling of the peoples hints at reverent worship ordered around God's real presence—an idea continued in Catholic liturgy."
    },
    {
      "pk": 1999002,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 2,
      "text": "The LORD is great in Zion; He is exalted over all the peoples.",
      "links": "<a href='/AIV/19/48/1'>Ps. 48:1</a>; <a href='/AIV/19/113/4'>Ps. 113:4</a>",
      "comment": "God’s greatness in Zion references the special status of Jerusalem, prefiguring the Church as the new Jerusalem where God dwells among His people (Rev. 21:2-3)."
    },
    {
      "pk": 1999003,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 3,
      "text": "Let them praise Your great and awesome name! Holy is He.",
      "links": "<a href='/AIV/19/111/9'>Ps. 111:9</a>; <a href='/AIV/23/6/3'>Isa. 6:3</a>",
      "comment": "The phrase 'Holy is He' anticipates the triple ‘Holy’ of the angels in Isaiah 6:3 and Revelation 4:8, echoed in the Sanctus of Catholic Mass. Worship of God’s holy name is rooted in recognition of His utter transcendence."
    },
    {
      "pk": 1999004,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 4,
      "text": "The King in His might loves justice. You have established equity; You have executed justice and righteousness in Jacob.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>; <a href='/AIV/23/9/7'>Isa. 9:7</a>",
      "comment": "God is the King who establishes justice and equity, foreshadowing Christ the true King, who fulfills perfect justice (see Isa. 9:7). The Church continues this ministry through her sacraments and teaching authority."
    },
    {
      "pk": 1999005,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 5,
      "text": "Exalt the LORD our God; worship at His footstool! Holy is He.",
      "links": "<a href='/AIV/13/28/2'>1 Chr. 28:2</a>; <a href='/AIV/19/132/7'>Ps. 132:7</a>",
      "comment": "To worship at His footstool refers to the Temple or Ark (1 Chr. 28:2), foreshadowing the Incarnation where Christ becomes physically present. Catholic tradition sees fulfillment in Eucharistic worship."
    },
    {
      "pk": 1999006,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 6,
      "text": "Moses and Aaron were among His priests, Samuel also among those who called upon His name; they called to the LORD, and He answered them.",
      "links": "<a href='/AIV/02/28/1'>Ex. 28:1</a>; <a href='/AIV/09/07/9'>1 Sam. 7:9</a>",
      "comment": "Moses, Aaron, and Samuel are intercessors, a role continued by saints in Christian tradition (cf. Rev. 5:8, 8:3-4)—a foundation for the Catholic practice of asking saints to pray for us."
    },
    {
      "pk": 1999007,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 7,
      "text": "He spoke to them in the pillar of cloud; they kept His testimonies and the statutes He gave them.",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>; <a href='/AIV/02/33/9'>Ex. 33:9</a>",
      "comment": "God speaks through tangible signs (pillar of cloud), showing how He desires to communicate with humanity by visible means—a pattern fulfilled in the sacraments, which are visible signs instituted by Christ."
    },
    {
      "pk": 1999008,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 8,
      "text": "O LORD our God, You answered them; You were a forgiving God to them, but an avenger of their wrongdoings.",
      "links": "<a href='/AIV/19/78/38'>Ps. 78:38</a>; <a href='/AIV/19/103/8-10'>Ps. 103:8-10</a>",
      "comment": "God’s mercy and justice are united. Forgiveness is coupled with discipline—this points ahead to the sacrament of Reconciliation, where forgiveness is given but true repentance is required."
    },
    {
      "pk": 1999009,
      "translation": "AIV",
      "book": 19,
      "chapter": 99,
      "verse": 9,
      "text": "Exalt the LORD our God, and worship at His holy mountain; for the LORD our God is holy!",
      "links": "<a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>; <a href='/AIV/23/2/2-3'>Isa. 2:2-3</a>",
      "comment": "Mount Zion is the place of God’s presence; in the new covenant, the Church becomes the ‘holy mountain’ where God dwells with His people (Heb. 12:22-24). The call to worship foreshadows the eternal heavenly liturgy."
    }
  ],
  "translatedAt": "2025-12-22T21:51:04.063Z"
}