{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 145,
  "verses": [
    {
      "pk": 1945145,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 1,
      "text": "I will exalt you, my God and King, and bless your name forever and ever.",
      "links": "<a href='/AIV/19/34/1'>Ps. 34:1</a>; <a href='/AIV/19/146/2'>Ps. 146:2</a>",
      "comment": "David begins with personal praise, signifying close relationship with the Lord as eternal King. The language echoes the idea of worship across generations."
    },
    {
      "pk": 1945146,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 2,
      "text": "Every day I will bless You and praise Your name forever and ever.",
      "links": "<a href='/AIV/19/113/2-3'>Ps. 113:2–3</a>",
      "comment": "The continual nature of praise reminds believers to uphold daily devotion, likely hinting at a liturgical life of regular prayer."
    },
    {
      "pk": 1945147,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 3,
      "text": "Great is the LORD, and greatly to be praised; His greatness is beyond searching out.",
      "links": "<a href='/AIV/19/48/1'>Ps. 48:1</a>; <a href='/AIV/19/147/5'>Ps. 147:5</a>",
      "comment": "The majesty of God exceeds human comprehension. This points to the mystery of the divine nature, later reflected in Christ’s incarnation (cf. Col. 1:15–17)."
    },
    {
      "pk": 1945148,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 4,
      "text": "One generation shall praise Your works to another, and shall declare Your mighty acts.",
      "links": "<a href='/AIV/19/78/4'>Ps. 78:4</a>; <a href='/AIV/19/22/30'>Ps. 22:30</a>",
      "comment": "Passing down the faith is central; spiritual inheritance is emphasized, showing the importance of tradition."
    },
    {
      "pk": 1945149,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 5,
      "text": "I will meditate on the glorious splendor of Your majesty, and on Your wondrous works.",
      "links": "<a href='/AIV/19/77/12'>Ps. 77:12</a>",
      "comment": "Contemplation is highlighted; this verse encourages reflection and awe, which deepens love for God’s mysteries."
    },
    {
      "pk": 1945150,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 6,
      "text": "People will speak of the power of Your awesome deeds, and I will declare Your greatness.",
      "links": "<a href='/AIV/19/66/3'>Ps. 66:3</a>; <a href='/AIV/19/71/15'>Ps. 71:15</a>",
      "comment": "The sharing of God’s wonders is a communal act, subtly highlighting the unity of believers in worship."
    },
    {
      "pk": 1945151,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 7,
      "text": "They shall pour forth the memory of Your abundant goodness and will sing of Your righteousness.",
      "links": "<a href='/AIV/19/33/5'>Ps. 33:5</a>",
      "comment": "Remembrance and song are ways the community celebrates divine goodness, suggesting spiritual songs as part of worship’s regular pattern."
    },
    {
      "pk": 1945152,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 8,
      "text": "The LORD is gracious and merciful, slow to anger and abounding in steadfast love.",
      "links": "<a href='/AIV/2/34/6'>Ex. 34:6</a>; <a href='/AIV/19/86/15'>Ps. 86:15</a>",
      "comment": "This description repeats a foundational revelation of God’s character in the Old Testament, fulfilled perfectly in Christ’s mercy (cf. John 1:14–17)."
    },
    {
      "pk": 1945153,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 9,
      "text": "The LORD is good to all, and His compassion is over all that He has made.",
      "links": "<a href='/AIV/19/100/5'>Ps. 100:5</a>; <a href='/AIV/19/103/13'>Ps. 103:13'>Ps. 103:13</a>",
      "comment": "God’s universal kindness foreshadows the invitation to salvation for all nations, realized in the New Testament (cf. Acts 10:34–35)."
    },
    {
      "pk": 1945154,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 10,
      "text": "All Your works give thanks to You, O LORD, and Your faithful ones bless You.",
      "links": "<a href='/AIV/19/103/22'>Ps. 103:22</a>",
      "comment": "Creation and the community of believers together respond to God—a pattern for the unity of worship seen in later liturgical practice."
    },
    {
      "pk": 1945155,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 11,
      "text": "They speak of the glory of Your kingdom and tell of Your power.",
      "links": "<a href='/AIV/19/29/4'>Ps. 29:4</a>; <a href='/AIV/19/103/19'>Ps. 103:19</a>",
      "comment": "The kingdom is a central theme tying old and new covenants; pointing toward Christ’s reign (cf. Luke 1:33)."
    },
    {
      "pk": 1945156,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 12,
      "text": "To make known to mankind Your mighty deeds and the glorious majesty of Your kingdom.",
      "links": "<a href='/AIV/19/67/2'>Ps. 67:2</a>; <a href='/AIV/27/7/14'>Dan. 7:14</a>",
      "comment": "The call to proclaim the kingdom prefigures Christ’s command to evangelize and the visible manifestation of God’s reign."
    },
    {
      "pk": 1945157,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 13,
      "text": "Your kingdom is an everlasting kingdom, and Your dominion endures throughout all generations. The LORD is faithful in all His words and gracious in all His deeds.",
      "links": "<a href='/AIV/19/10/16'>Ps. 10:16</a>; <a href='/AIV/27/4/3'>Dan. 4:3</a>",
      "comment": "A messianic promise, highlighting an eternal kingdom fulfilled in Christ. Ancient manuscripts sometimes include 'faithful in all His words...' as a later addition, but it aligns with God’s covenant faithfulness."
    },
    {
      "pk": 1945158,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 14,
      "text": "The LORD upholds all who are falling and raises up all who are bowed down.",
      "links": "<a href='/AIV/19/37/24'>Ps. 37:24</a>; <a href='/AIV/19/146/8'>Ps. 146:8</a>",
      "comment": "Divine help for the humble echoes Christ’s teaching on humility (cf. Matt. 11:28–30)."
    },
    {
      "pk": 1945159,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 15,
      "text": "The eyes of all look to You, and You give them their food at the proper time.",
      "links": "<a href='/AIV/19/104/27'>Ps. 104:27</a>; <a href='/AIV/40/6/11'>Matt. 6:11</a>",
      "comment": "God’s providence is universal and timely. This foreshadows spiritual nourishment, pointing subtly to eucharistic themes in later worship."
    },
    {
      "pk": 1945160,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 16,
      "text": "You open Your hand and satisfy the desire of every living thing.",
      "links": "<a href='/AIV/19/36/8'>Ps. 36:8</a>; <a href='/AIV/19/104/28'>Ps. 104:28</a>",
      "comment": "The abundance from God’s hand points toward the grace bestowed on all creation, including spiritual blessings."
    },
    {
      "pk": 1945161,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 17,
      "text": "The LORD is righteous in all His ways and kind in all His works.",
      "links": "<a href='/AIV/19/25/8'>Ps. 25:8</a>; <a href='/AIV/19/119/137'>Ps. 119:137</a>",
      "comment": "God’s righteousness is both a standard and a gift; it reflects both the justice and the mercy shown in redemption."
    },
    {
      "pk": 1945162,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 18,
      "text": "The LORD is near to all who call on Him, to all who call on Him in truth.",
      "links": "<a href='/AIV/19/34/18'>Ps. 34:18</a>; <a href='/AIV/19/75/1'>Ps. 75:1</a>",
      "comment": "This verse teaches the accessibility of God through sincere prayer, anticipating deeper relationship through sacramental communion."
    },
    {
      "pk": 1945163,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 19,
      "text": "He fulfills the desire of those who fear Him; He hears their cry and saves them.",
      "links": "<a href='/AIV/19/37/4'>Ps. 37:4</a>; <a href='/AIV/19/20/5'>Ps. 20:5</a>",
      "comment": "The fear of the Lord is the beginning of wisdom and leads to salvation; a relational dynamic encouraged by Christ (cf. Luke 1:50)."
    },
    {
      "pk": 1945164,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 20,
      "text": "The LORD preserves all who love Him, but all the wicked He will destroy.",
      "links": "<a href='/AIV/19/31/23'>Ps. 31:23</a>; <a href='/AIV/40/25/46'>Matt. 25:46</a>",
      "comment": "God’s care for the righteous mirrors the New Testament’s promise of eternal life and judgment."
    },
    {
      "pk": 1945165,
      "translation": "AIV",
      "book": 19,
      "chapter": 145,
      "verse": 21,
      "text": "My mouth shall speak the praise of the LORD, and let all flesh bless His holy name forever and ever.",
      "links": "<a href='/AIV/19/103/1'>Ps. 103:1</a>; <a href='/AIV/19/106/48'>Ps. 106:48</a>",
      "comment": "Concludes with a universal call to worship that transcends individual prayer, inviting all peoples—later fulfilled in the worship of the global church."
    }
  ],
  "translatedAt": "2025-12-23T05:51:34.491Z"
}