{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 20,
  "verses": [
    {
      "pk": 2002001,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 1,
      "text": "May the LORD answer you in the day of trouble; may the name of the God of Jacob protect you.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>; <a href='/AIV/19/99/6'>Ps. 99:6</a>; <a href='/AIV/19/24/6'>Ps. 24:6</a>",
      "comment": "The phrase 'God of Jacob' reflects God's covenant faithfulness to Israel (see Gen. 35:11–12). Catholics link this covenant foundationally to the Church as the 'new Israel' (cf. Gal. 6:16). The invocation of the divine Name subtly suggests a sacramental dimension to God's protection."
    },
    {
      "pk": 2002002,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 2,
      "text": "May he send you help from the sanctuary and support you from Zion.",
      "links": "<a href='/AIV/19/14/7'>Ps. 14:7</a>; <a href='/AIV/19/110/2'>Ps. 110:2</a>",
      "comment": "Reference to 'sanctuary' and 'Zion' has liturgical dimensions, foreshadowing the role of the physical Church and its sacraments as channels of God's help. Many see spiritual help from God as coming through the Church, echoing Catholic teaching on mediation through holy places and people."
    },
    {
      "pk": 2002003,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 3,
      "text": "May he remember all your offerings and regard with favor your burnt sacrifices. Selah.",
      "links": "<a href='/AIV/19/50/23'>Ps. 50:23</a>; <a href='/AIV/19/51/19'>Ps. 51:19</a>",
      "comment": "The remembrance of offerings points to the value of sacrificial worship. Christians see these sacrifices fulfilled in Christ’s offering (Heb. 10:10), and the Catholic tradition continues this reality through the Eucharist—Christ’s once-for-all sacrifice made present at every Mass. The use of 'Selah' highlights the importance of reflecting on the mystery of sacrifice."
    },
    {
      "pk": 2002004,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 4,
      "text": "May he grant you your heart’s desire and fulfill all your plans.",
      "links": "<a href='/AIV/19/37/4'>Ps. 37:4</a>; <a href='/AIV/19/21/2'>Ps. 21:2</a>",
      "comment": "This expresses confidence that God responds to the righteous. In the Catholic view, aligning our desires with God's will is nurtured through prayer and spiritual guidance within the Church."
    },
    {
      "pk": 2002005,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 5,
      "text": "We will shout for joy over your victory, and in the name of our God we will set up our banners. May the LORD fulfill all your requests.",
      "links": "<a href='/AIV/19/118/15-16'>Ps. 118:15–16</a>; <a href='/AIV/19/60/4'>Ps. 60:4</a>",
      "comment": "The theme of rejoicing in salvation evokes New Testament joy over Christ’s victory (Rom. 8:37). The 'name of our God' implies communal worship and liturgical triumph—this foreshadows Catholic processions and celebrations done 'in the name of God.'"
    },
    {
      "pk": 2002006,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 6,
      "text": "Now I know that the LORD saves his anointed; he will answer him from his holy heaven with the saving strength of his right hand.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/19/28/8'>Ps. 28:8</a>; <a href='/AIV/19/89/20'>Ps. 89:20</a>",
      "comment": "‘Anointed’ (Heb: Messiah, Christos) has Christological significance, foreshadowing Jesus Christ, the ultimate Anointed One. Catholic interpretation sees this prophecy fulfilled in Jesus and perpetuated in the Church through apostolic succession and anointing (cf. James 5:14, 2 Cor. 1:21)."
    },
    {
      "pk": 2002007,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 7,
      "text": "Some trust in chariots and some in horses, but we trust in the name of the LORD our God.",
      "links": "<a href='/AIV/19/33/16-17'>Ps. 33:16–17</a>; <a href='/AIV/19/44/6'>Ps. 44:6</a>; <a href='/AIV/20/3/5-6'>Prov. 3:5–6</a>",
      "comment": "This verse sharply contrasts worldly strength with reliance on God’s power. Catholics interpret ‘the name of the LORD’ sacramentally, referencing baptism and prayer ‘in Jesus’ name.’ Faith transcending earthly security is echoed in trust toward the Church’s spiritual authority."
    },
    {
      "pk": 2002008,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 8,
      "text": "They collapse and fall, but we rise and stand upright.",
      "links": "<a href='/AIV/19/27/2-3'>Ps. 27:2–3</a>; <a href='/AIV/19/18/38'>Ps. 18:38</a>",
      "comment": "God’s people stand through divine support, connecting with themes of resurrection and perseverance (Rom. 6:4; 1 Cor. 15:57). Catholics see this rising as mirrored in the sacraments, particularly baptism and Eucharist, which strengthen and raise believers spiritually."
    },
    {
      "pk": 2002009,
      "translation": "AIV",
      "book": 19,
      "chapter": 20,
      "verse": 9,
      "text": "O LORD, save the king! May he answer us when we call.",
      "links": "<a href='/AIV/19/72/1'>Ps. 72:1</a>; <a href='/AIV/19/21/1'>Ps. 21:1</a>",
      "comment": "Prayer for the king points to Christ, the King of Kings, and historically to God’s anointed leadership. For Catholics, this finds fulfillment in Jesus as eternal King and through the Church’s visible shepherds (see Matt. 16:18–19). The communal 'us' foreshadows the collective prayer of the Church."
    }
  ],
  "translatedAt": "2025-12-22T21:26:33.425Z"
}