{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 100,
  "verses": [
    {
      "pk": 1000001,
      "translation": "AIV",
      "book": 19,
      "chapter": 100,
      "verse": 1,
      "text": "Shout for joy to the LORD, all the earth!",
      "links": "<a href='/AIV/19/66/1'>Psalm 66:1</a>; <a href='/AIV/19/98/4'>Psalm 98:4</a>; <a href='/AIV/19/47/1'>Psalm 47:1</a>",
      "comment": "The imperative 'Shout for joy' echoes universal worship, calling all nations to praise God. Note the emphasis on joyful worship, not only individually but as a united community before God. Some ancient versions render 'earth' as 'lands' to highlight global scope. This anticipates the worship gathered from all nations, fulfilled in the new covenant and described in Revelation 7:9."
    },
    {
      "pk": 1000002,
      "translation": "AIV",
      "book": 19,
      "chapter": 100,
      "verse": 2,
      "text": "Serve the LORD with gladness; come before Him with joyful songs.",
      "links": "<a href='/AIV/19/2/11'>Psalm 2:11</a>; <a href='/AIV/19/95/2'>Psalm 95:2</a>; <a href='/AIV/19/81/1'>Psalm 81:1</a>",
      "comment": "Service to God is paired with gladness, implying worship that is both active and heartfelt. The invitation to 'come before Him' suggests entering His presence, which connects with themes of sacrificial worship and community liturgy (see Psalm 95:2). Spiritually, this points to the joy found in the Christian life as expressed in communal worship gatherings and the Eucharistic celebration."
    },
    {
      "pk": 1000003,
      "translation": "AIV",
      "book": 19,
      "chapter": 100,
      "verse": 3,
      "text": "Know that the LORD is God. He made us, and we belong to Him; we are His people, the sheep of His pasture.",
      "links": "<a href='/AIV/19/95/7'>Psalm 95:7</a>; <a href='/AIV/23/40/11'>Isaiah 40:11</a>; <a href='/AIV/43/10/14'>John 10:14</a>",
      "comment": "Recognizing the LORD as Creator and Shepherd emphasizes divine authority and care. The phrase 'He made us, and we belong to Him' asserts God's sovereign initiative in salvation—a theme echoed in the teachings of Christ as the Good Shepherd (John 10:14). The sheep imagery is both literal and spiritual, pointing to God's covenant people gathered into His fold."
    },
    {
      "pk": 1000004,
      "translation": "AIV",
      "book": 19,
      "chapter": 100,
      "verse": 4,
      "text": "Enter His gates with thanksgiving, and His courts with praise; give thanks to Him and bless His name.",
      "links": "<a href='/AIV/19/95/2'>Psalm 95:2</a>; <a href='/AIV/19/118/19'>Psalm 118:19</a>; <a href='/AIV/19/96/8'>Psalm 96:8</a>",
      "comment": "This verse highlights liturgical worship, referencing the physical entrance into the temple as symbolic of access to God's presence. Word choice connects to sacramental worship, where believers gather to corporately offer thanksgiving and blessing. The invitation foreshadows the fulfillment in Christ, who opens the way for all to enter spiritual communion with God (Hebrews 10:19-22)."
    },
    {
      "pk": 1000005,
      "translation": "AIV",
      "book": 19,
      "chapter": 100,
      "verse": 5,
      "text": "For the LORD is good; His loyal love endures forever, and His faithfulness continues to all generations.",
      "links": "<a href='/AIV/19/106/1'>Psalm 106:1</a>; <a href='/AIV/19/89/1'>Psalm 89:1</a>; <a href='/AIV/19/136/1'>Psalm 136:1</a>",
      "comment": "The affirmation of God's goodness and steadfast love is both foundational and forward-looking. The Hebrew 'hesed' (loyal love) signals covenantal commitment. God's faithfulness is declared perpetual, connecting to the promises given to Abraham and fulfilled in Christ. The continuity through generations speaks to the perpetual nature of divine mercy and guidance for God's people, underscoring the importance of remaining within the visible community of faith to receive these promises."
    }
  ],
  "translatedAt": "2025-12-23T05:37:00.782Z"
}