{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 87,
  "verses": [
    {
      "pk": 1932870,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 1,
      "text": "His foundation is in the holy mountains.",
      "links": "<a href='/AIV/19/68/16'>Ps. 68:16</a>; <a href='/AIV/19/48/1-2'>Ps. 48:1-2</a>",
      "comment": "The Psalm opens by declaring the Lord's chosen foundation set upon the holy mountains, a clear reference to Zion/Jerusalem. Many Fathers see a type here for the Church built on the 'rock' (cf. Matt 16:18). The mountains, in Catholic thought, also allude to the saints and apostles as 'foundations' (Eph 2:20)."
    },
    {
      "pk": 1932871,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 2,
      "text": "The LORD loves the gates of Zion more than all the dwelling places of Jacob.",
      "links": "<a href='/AIV/19/132/13'>Ps. 132:13</a>; <a href='/AIV/19/78/68'>Ps. 78:68</a>; <a href='/AIV/19/48/2'>Ps. 48:2</a>",
      "comment": "Zion, often referring spiritually to the Church and ultimately fulfilled in Christ (Heb 12:22), is deeply loved by God. The preference for 'gates of Zion' echoes the Catholic reverence for the Church as the true spiritual home (cf. 1 Tim 3:15)."
    },
    {
      "pk": 1932872,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 3,
      "text": "Glorious things are spoken of you, O city of God. Selah.",
      "links": "<a href='/AIV/19/46/4'>Ps. 46:4</a>; <a href='/AIV/19/48/1-8'>Ps. 48:1-8</a>; <a href='/AIV/60/2/6'>1 Pet 2:6</a>",
      "comment": "Prophetic voices acclaim Jerusalem, yet this points forward to the heavenly Jerusalem, the dwelling of God with men (Rev 21:2-3). The Catholic tradition connects such glorification to Mary as 'city of God' in a mystical sense, just as she is called the Ark (cf. Luke 1:43, Rev 11:19–12:1)."
    },
    {
      "pk": 1932873,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 4,
      "text": "I will record Rahab and Babylon among those who know me; behold, Philistia and Tyre, with Cush—this one was born there.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/23/19/18-25'>Isa. 19:18-25</a>; <a href='/AIV/28/2/23'>Hos. 2:23</a>",
      "comment": "The Psalmist proclaims salvation for former enemies; Gentile nations are counted as citizens of Zion. This anticipates the inclusion of all nations in Christ’s Church (Eph 2:13-19), and echoes the Catholic emphasis on universality ('catholic' means universal)."
    },
    {
      "pk": 1932874,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 5,
      "text": "And of Zion it shall be said, 'This one and that one were born in her'; for the Most High himself establishes her.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/48/4/26'>Gal. 4:26</a>",
      "comment": "Zion’s spiritual motherhood is noted—she gives birth to many people. The Fathers saw in this the Church’s role in spiritual rebirth through baptism, a key sacrament for entering the Church (John 3:5; 1 Pet 1:23)."
    },
    {
      "pk": 1932875,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 6,
      "text": "The LORD records, as he registers the peoples, 'This one was born there.' Selah.",
      "links": "<a href='/AIV/65/4/20'>Phil. 4:3</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "God himself enrolls the nations as citizens—a parallel to the Book of Life (Rev 21:27). The Catholic doctrine sees in baptism the means by which names are written in heaven. This belongs to the communal, sacramental life of the Church."
    },
    {
      "pk": 1932876,
      "translation": "AIV",
      "book": 19,
      "chapter": 87,
      "verse": 7,
      "text": "Singers and dancers alike say, 'All my springs are in you.'",
      "links": "<a href='/AIV/19/46/4'>Ps. 46:4</a>; <a href='/AIV/43/7/38'>John 7:38</a>",
      "comment": "'Springs' imply sources of life and grace. In Catholic thought, the Church is the fountain of the sacraments and spiritual life. Jesus’ words (John 7:38) about 'rivers of living water' flow most deeply in the Church. The joy and beauty in worship are a hallmark both of earthly Zion and the new covenant community."
    }
  ],
  "translatedAt": "2025-12-22T21:47:21.387Z"
}