{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 72,
  "verses": [
    {
      "pk": 1948271,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 1,
      "text": "Give the king Your judgments, O God, and Your righteousness to the king’s son.",
      "links": "<a href='/AIV/11/3/9'>1 Kings 3:9</a>; <a href='/AIV/19/24/5'>Ps. 24:5</a>",
      "comment": "The psalm opens with a prayer for God to grant the king, and his son, divine justice and righteousness. Traditionally attributed to Solomon, but also foreshadowing Christ, the true King and Son. Catholic tradition often points to the connection between the Davidic kingship and Christ’s Messianic reign (see Luke 1:32), a theme worth contemplating alongside Marian devotion where Jesus is seen as the king ‘from David’s line’."
    },
    {
      "pk": 1948272,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 2,
      "text": "May he judge Your people with righteousness, and Your afflicted ones with justice.",
      "links": "<a href='/AIV/19/67/4'>Ps. 67:4</a>; <a href='/AIV/19/82/3'>Ps. 82:3</a>",
      "comment": "Solomon asks for the ability to rule justly over God's people, mirroring Christ the Just Judge. Catholic teaching draws parallels between the king’s justice and the Church's ongoing mission to care for the poor and oppressed (see Matthew 25:40)."
    },
    {
      "pk": 1948273,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 3,
      "text": "Let the mountains bring peace to the people, and the hills, righteousness.",
      "links": "<a href='/AIV/19/85/10'>Ps. 85:10</a>; <a href='/AIV/23/52/7'>Isa. 52:7</a>",
      "comment": "A poetic image of the land itself reflecting the King’s just rule. Catholics often spiritually interpret the 'mountains' as saints and 'hills' as the faithful, who by God’s grace spread peace through Christ's mediation (cf. Heb. 12:22-24)."
    },
    {
      "pk": 1948274,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 4,
      "text": "May he defend the cause of the poor among the people, save the children of the needy, and crush the oppressor.",
      "links": "<a href='/AIV/19/72/12'>Ps. 72:12</a>; <a href='/AIV/19/82/4'>Ps. 82:4</a>",
      "comment": "Justice for the poor is essential in biblical kingship. This foreshadows Christ's saving ministry, especially toward the marginalized. Catholics can associate this with the Church’s social teaching and works of mercy (see Catechism of the Catholic Church §2447)."
    },
    {
      "pk": 1948275,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 5,
      "text": "May they fear you while the sun endures, and as long as the moon, through all generations.",
      "links": "<a href='/AIV/19/89/36-37'>Ps. 89:36–37</a>; <a href='/AIV/19/148/3'>Ps. 148:3</a>",
      "comment": "The universal, everlasting reign asked for here points beyond Solomon to the Messiah, Jesus. The endless kingdom language ties Christianity’s understanding of the Kingdom of God as being eternal (cf. Daniel 2:44, Luke 1:33)."
    },
    {
      "pk": 1948276,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 6,
      "text": "May he be like rain that falls on the mown grass, like showers that water the earth.",
      "links": "<a href='/AIV/05/32/2'>Deut. 32:2</a>; <a href='/AIV/19/65/10'>Ps. 65:10</a>",
      "comment": "Describing the king’s reign as refreshing and life-giving. Many Catholic commentators see here a figure of the outpouring of grace, especially through the sacraments, which spiritually nourish the faithful (cf. John 7:37–39)."
    },
    {
      "pk": 1948277,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 7,
      "text": "In his days may the righteous flourish, and peace abound, till the moon is no more.",
      "links": "<a href='/AIV/19/37/11'>Ps. 37:11</a>; <a href='/AIV/23/9/7'>Isa. 9:7</a>",
      "comment": "A Messianic vision of a world filled with righteousness and peace. St. Augustine and others have seen this as a prophecy of Christ's eternal kingdom, fulfilled in part by the Church."
    },
    {
      "pk": 1948278,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 8,
      "text": "May he have dominion from sea to sea, and from the River to the ends of the earth.",
      "links": "<a href='/AIV/38/9/10'>Zech. 9:10</a>; <a href='/AIV/19/2/8'>Ps. 2:8</a>",
      "comment": "The king’s rule is described as unlimited, a prophecy seen as fulfilled in Christ, the universal King. The Catholic Church views itself as the continuing presence of Christ’s kingdom expanding to every corner of the world."
    },
    {
      "pk": 1948279,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 9,
      "text": "May desert tribes bow before him, and his enemies lick the dust.",
      "links": "<a href='/AIV/01/3/14'>Gen. 3:14</a>; <a href='/AIV/19/149/7-9'>Ps. 149:7–9</a>",
      "comment": "Universal submission is pictured, with language echoing Genesis 3:14. For Catholics, this is fulfilled in Christ's ultimate victory over sin and evil, and through the Church’s triumphs in history."
    },
    {
      "pk": 1948280,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 10,
      "text": "May the kings of Tarshish and of distant shores bring tribute; the kings of Sheba and Seba offer gifts.",
      "links": "<a href='/AIV/23/60/6'>Isa. 60:6</a>; <a href='/AIV/40/2/11'>Matt. 2:11</a>",
      "comment": "A prophecy of Gentile nations honoring the king, foreshadowing the Magi bringing gifts to Christ in Matthew 2:11. Catholics reflect on how the Church welcomes all peoples to worship Christ."
    },
    {
      "pk": 1948281,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 11,
      "text": "Yes, all kings will bow down before him, all nations will serve him.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/50/2/10-11'>Phil. 2:10–11</a>",
      "comment": "This universal worship is seen in Catholic thought as a foretaste of the heavenly liturgy, where Christ is king of creation—an image that subtly encourages reflection on the universality and visible unity of the Catholic Church."
    },
    {
      "pk": 1948282,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 12,
      "text": "For he delivers the needy when he calls, the poor and him who has no helper.",
      "links": "<a href='/AIV/19/34/6'>Ps. 34:6</a>; <a href='/AIV/19/35/10'>Ps. 35:10</a>",
      "comment": "Once again, the king cares for the weakest. Catholic interpretation highlights Christ’s mercy—manifest above all in His Church’s work among the poor, especially through saints and religious orders."
    },
    {
      "pk": 1948283,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 13,
      "text": "He has compassion on the weak and the needy, and saves the lives of the poor.",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/19/72/2-4'>Ps. 72:2–4</a>",
      "comment": "The royal figure’s compassion reflects Christ’s own love, echoed in Catholic veneration of saints known for charity. Subtly, this serves as a model which Catholics see especially realized in the Church’s ministry."
    },
    {
      "pk": 1948284,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 14,
      "text": "He redeems their lives from oppression and violence, and precious is their blood in his sight.",
      "links": "<a href='/AIV/02/3/7-8'>Ex. 3:7–8</a>; <a href='/AIV/19/116/15'>Ps. 116:15</a>",
      "comment": "This verse has been seen as alluding to Christ’s Passion, where His blood redeems humanity. In Catholic understanding, the value of Christ’s sacrifice is represented, among other places, in the Mass—subtly inviting appreciation for sacramental theology."
    },
    {
      "pk": 1948285,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 15,
      "text": "Long may he live; may gold of Sheba be given to him. May people pray for him continually, and bless him all day long.",
      "links": "<a href='/AIV/11/10/10'>1 Kings 10:10</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Reference to gold from Sheba links to the Queen of Sheba’s visit to Solomon. 'Pray for him continually' carries sacramental undertones suggestive of Catholic prayers for leaders and, in a mystical sense, intercession for Christ, especially through Mary."
    },
    {
      "pk": 1948286,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 16,
      "text": "May there be an abundance of grain in the land, atop the mountains; may its fruit wave like Lebanon, and may men flourish in the cities like the grass of the earth.",
      "links": "<a href='/AIV/03/26/4-5'>Lev. 26:4–5</a>; <a href='/AIV/19/65/13'>Ps. 65:13</a>",
      "comment": "Beyond literal blessing, Catholic commentators have interpreted this as a sign of spiritual fruitfulness—the grain atop mountains subtly echoing the Eucharist, which Catholics believe is spiritual food provided by Christ the King."
    },
    {
      "pk": 1948287,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 17,
      "text": "May his name endure forever; may his name continue as long as the sun. May men be blessed in him; let all nations call him blessed.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/19/89/36'>Ps. 89:36</a>",
      "comment": "Eternal blessing through the king points to Christ. Catholics relate this also to Mary, who is 'blessed among women' (Luke 1:48), reminding that God’s blessings come to all nations through Christ in the Church."
    },
    {
      "pk": 1948288,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 18,
      "text": "Blessed be the LORD God, the God of Israel, who alone does wondrous things.",
      "links": "<a href='/AIV/02/15/11'>Ex. 15:11</a>; <a href='/AIV/19/86/10'>Ps. 86:10</a>",
      "comment": "A doxology, common in psalms. Catholics interpret liturgical praise as central, reflecting the constant worship given in Mass, echoing the heavenly worship described in Revelation."
    },
    {
      "pk": 1948289,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 19,
      "text": "Blessed be his glorious name forever; may the whole earth be filled with his glory! Amen and Amen.",
      "links": "<a href='/AIV/19/57/5'>Ps. 57:5</a>; <a href='/AIV/35/2/14'>Hab. 2:14</a>",
      "comment": "The universal scope of this doxology fits both the literal kingdom of Solomon and the spiritual reign of Christ. It also subtly points to the catholic (universal) nature of the Church, envisioned to fill the whole earth."
    },
    {
      "pk": 1948290,
      "translation": "AIV",
      "book": 19,
      "chapter": 72,
      "verse": 20,
      "text": "The prayers of David, the son of Jesse, are ended.",
      "links": "<a href='/AIV/19/72/1'>Ps. 72:1</a>; <a href='/AIV/10/23/1'>2 Sam. 23:1</a>",
      "comment": "A closing note marking the end of a major section of psalms attributed to David. This phrase signals both completion and anticipation; from a Catholic perspective, it encourages reflection on Christ as the true Son of David whose prayers are never ended within His Church."
    }
  ],
  "translatedAt": "2025-12-22T21:42:35.890Z"
}