{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 93,
  "verses": [
    {
      "pk": 23093001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 93,
      "verse": 1,
      "text": "The LORD reigns; He is clothed with majesty. The LORD is wrapped in strength; He has girded Himself. Surely the world is established; it shall never be moved.",
      "links": "<a href='/AIV/24/10/10'>Jer. 10:10</a>; <a href='/AIV/19/96/10'>Ps. 96:10</a>; <a href='/AIV/23/40/10'>Isa. 40:10</a>",
      "comment": "The emphasis on the LORD's kingship and the stability of creation reflects God's sovereign rule. The imagery of clothing and strength echoes royal ceremonial language, pointing not only to God's eternal authority but also prefiguring Christ's kingship. The unshakable world hints at God's unchanging nature and the trustworthiness of His promises. In tradition, this verse is also interpreted spiritually, suggesting that the enduring kingdom is founded on God’s appointment and maintained by divine governance, paralleling Christ establishing His Church (see <a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 23093002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 93,
      "verse": 2,
      "text": "Your throne is established from of old; You are from everlasting.",
      "links": "<a href='/AIV/19/90/2'>Ps. 90:2</a>; <a href='/AIV/58/1/8'>Heb. 1:8</a>",
      "comment": "God’s everlasting throne underscores His eternal authority and preexistence. This echoes other passages where God is described as eternal and uncreated, a cornerstone for doctrinal teaching about His divine nature. The reference to the throne, in Christian theology, prefigures Christ’s everlasting reign (see <a href='/AIV/42/1/33'>Luke 1:33</a>). This language supports the continuity and unity of God’s kingdom throughout salvation history."
    },
    {
      "pk": 23093003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 93,
      "verse": 3,
      "text": "The floods have lifted up, O LORD, the floods have lifted up their voice; the floods lift up their roaring.",
      "links": "<a href='/AIV/19/42/7'>Ps. 42:7</a>; <a href='/AIV/19/98/7-8'>Ps. 98:7-8</a>",
      "comment": "The rising floods symbolize powerful, chaotic forces—often interpreted as opposition to God or trials faced by His people. The repetition emphasizes the intensity and persistence of these challenges. In Christian tradition, the waves are seen as representing both historical enemies and spiritual trials, which the faithful endure through union with God and perseverance in the faith community."
    },
    {
      "pk": 23093004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 93,
      "verse": 4,
      "text": "Mightier than the voices of many waters, mightier than the breakers of the sea, the LORD on high is mighty.",
      "links": "<a href='/AIV/19/29/3-4'>Ps. 29:3-4</a>; <a href='/AIV/41/4/39-41'>Mark 4:39-41</a>",
      "comment": "God’s power surpasses all natural and spiritual forces. The use of ‘many waters’ in Scripture often signifies chaos or nations in turmoil, and God's dominion over them points to His absolute authority. In Christian understanding, Jesus’ calming of the storm (see <a href='/AIV/41/4/39-41'>Mark 4:39-41</a>) fulfills and reveals this divine power, showing Christ’s authority not only over creation but also as Lord and Savior."
    },
    {
      "pk": 23093005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 93,
      "verse": 5,
      "text": "Your decrees are very trustworthy; holiness adorns Your house, O LORD, forevermore.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/54/3/15'>1 Tim. 3:15</a>",
      "comment": "God’s statutes are certain and reliable, forming a foundation for life and community. The call to holiness not only describes the worship of God in the temple but also extends to the spiritual house built by Christ (see <a href='/AIV/60/2/5'>1 Pet. 2:5</a>). The emphasis on enduring trustworthiness and sanctity reflects God’s desire for a holy people gathered in His name, preserved through apostolic teaching and sacramental worship."
    }
  ],
  "translatedAt": "2025-12-24T06:32:12.492Z"
}