{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 79,
  "verses": [
    {
      "pk": 1030971,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 1,
      "text": "O God, the nations have invaded your inheritance; they have defiled your holy temple; they have laid Jerusalem in ruins.",
      "links": "<a href='/AIV/10/1/6'>1 Sam. 6:20</a>; <a href='/AIV/19/74/3'>Ps. 74:3</a>; <a href='/AIV/25/1/10'>Lam. 1:10</a>",
      "comment": "This verse describes the desecration of God's holy place and city, which historically refers to the Babylonian destruction (see 2 Kings 25). It prefigures the destruction and restoration motif fulfilled in Christ, who is the true Temple (<a href='/AIV/43/2/19-21'>John 2:19–21</a>)."
    },
    {
      "pk": 1030972,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 2,
      "text": "They have given the dead bodies of your servants to be food for the birds of the sky, the flesh of your faithful ones to the beasts of the earth.",
      "links": "<a href='/AIV/05/28/26'>Deut. 28:26</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "The judgment motif recalls covenant curses (Deut. 28:26), yet this devastation points to the need for God's mercy and ultimate deliverance. The suffering of the righteous will later find its fullest meaning in the suffering of Christ and the communion of saints."
    },
    {
      "pk": 1030973,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 3,
      "text": "They have poured out their blood like water all around Jerusalem, and there was no one to bury them.",
      "links": "<a href='/AIV/25/2/21'>Lam. 2:21</a>; <a href='/AIV/24/22/19'>Jer. 22:19</a>",
      "comment": "This lack of burial was a profound shame (cf. Jer. 22:19). The lament echoes the call for justice and the dignity of every person—a theme the Church upholds especially in her teachings on the sanctity of life."
    },
    {
      "pk": 1030974,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 4,
      "text": "We have become a reproach to our neighbors, mocked and scorned by those around us.",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "Being a reproach among the nations shows the visible nature of God’s people, reminiscent of the Church’s witness before the world (<a href='/AIV/40/5/14-16'>Matt. 5:14–16</a>)."
    },
    {
      "pk": 1030975,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 5,
      "text": "How long, O LORD? Will you be angry forever? Will your jealousy burn like fire?",
      "links": "<a href='/AIV/19/74/1'>Ps. 74:1</a>; <a href='/AIV/16/1/6'>Neh. 1:6</a>",
      "comment": "A heartfelt plea for mercy. The reference to God's jealousy reflects His passionate love for His people, similar to Christ’s zealous love displayed in the Gospels (<a href='/AIV/43/2/17'>John 2:17</a>)."
    },
    {
      "pk": 1030976,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 6,
      "text": "Pour out your wrath on the nations that do not know you, and on the kingdoms that do not call upon your name.",
      "links": "<a href='/AIV/24/10/25'>Jer. 10:25</a>; <a href='/AIV/36/3/8'>Zeph. 3:8</a>",
      "comment": "The psalmist asks for judgment upon those outside the covenant. In Christ, however, the call moves toward bringing all nations to know the true God (<a href='/AIV/40/28/19'>Matt. 28:19</a>). The completeness of God's justice is found in the Catholic vision of the universality of salvation."
    },
    {
      "pk": 1030977,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 7,
      "text": "For they have devoured Jacob and laid waste his home.",
      "links": "<a href='/AIV/23/1/7'>Isa. 1:7</a>; <a href='/AIV/29/1/6'>Joel 1:6</a>",
      "comment": "‘Jacob’ stands for Israel, God's chosen people; their suffering foreshadows the suffering of Christ and His Church (see Col. 1:24)."
    },
    {
      "pk": 1030978,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 8,
      "text": "Do not remember against us the iniquities of our ancestors; let your compassion come quickly to meet us, for we are brought very low.",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>; <a href='/AIV/27/9/18-19'>Dan. 9:18–19</a>",
      "comment": "Here is a plea for mercy for inherited sin, emphasizing God’s readiness to forgive. The Catholic faith teaches of God’s grace administered through the sacraments and relies on the communion of saints (see Catechism 1475)."
    },
    {
      "pk": 1030979,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 9,
      "text": "Help us, O God of our salvation, for the glory of your name; deliver us, and atone for our sins, for your name’s sake!",
      "links": "<a href='/AIV/19/25/11'>Ps. 25:11</a>; <a href='/AIV/23/43/25'>Isa. 43:25</a>",
      "comment": "The plea for atonement for God’s name’s sake prefigures the sacrifice of Christ, whose passion is the perfect act of atonement (see <a href='/AIV/58/9/12'>Heb. 9:12</a>). The language can also be seen in Catholic liturgy."
    },
    {
      "pk": 1030980,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 10,
      "text": "Why should the nations say, 'Where is their God?' Let the avenging of the blood of your servants which has been poured out be known among the nations before our eyes.",
      "links": "<a href='/AIV/19/115/2'>Ps. 115:2</a>; <a href='/AIV/05/32/43'>Deut. 32:43</a>",
      "comment": "God’s visible vindication brings Him glory, confirming His real presence among His people. This concept develops in the Eucharistic theology of the Church where Christ is present and vindicated among His faithful."
    },
    {
      "pk": 1030981,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 11,
      "text": "Let the groans of the prisoners come before you; according to the greatness of your power, preserve those doomed to die.",
      "links": "<a href='/AIV/19/102/20'>Ps. 102:20</a>",
      "comment": "God listens to the cries of the afflicted. The ‘prisoners’ represent both physical and spiritual captivity, which finds its ultimate fulfillment in Christ’s liberation of souls (<a href='/AIV/42/4/18'>Luke 4:18</a>)."
    },
    {
      "pk": 1030982,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 12,
      "text": "Give sevenfold back to our neighbors into their lap the reproach with which they have reproached you, O Lord!",
      "links": "<a href='/AIV/01/4/15'>Gen. 4:15</a>; <a href='/AIV/19/12/6'>Ps. 12:6</a>",
      "comment": "Calling on a full measure of recompense, 'sevenfold,' echoes Biblical themes of complete justice. Ultimately, justice and mercy meet at the Cross (see <a href='/AIV/40/5/7'>Matt. 5:7</a>)."
    },
    {
      "pk": 1030983,
      "translation": "AIV",
      "book": 19,
      "chapter": 79,
      "verse": 13,
      "text": "But we your people, the sheep of your pasture, will give thanks to you forever; from generation to generation we will recount your praise.",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "This confession of praise affirms God's people as His flock, a motif Christ fulfills as the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>). The perpetual thanksgiving hints at the Church’s ongoing sacrifice of praise in the Eucharist."
    }
  ],
  "translatedAt": "2025-12-22T21:45:27.033Z"
}