{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 4,
  "verses": [
    {
      "pk": 1900401,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 1,
      "text": "Answer me when I call, God of my righteousness! You have given me relief when I was in distress. Be merciful to me and hear my prayer.",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/19/6/9'>Ps. 6:9</a>; <a href='/AIV/19/17/6'>Ps. 17:6</a>",
      "comment": "David appeals to the God who sets him apart and gives righteousness. 'Relief' here literally means making space or freedom in a tight situation (cf. Ps. 18:19). Catholics see God's mercy as received through both faith and the sacraments, prefigured in David's dependence on God's gracious hearing of prayer."
    },
    {
      "pk": 1900402,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 2,
      "text": "O men, how long will my glory be turned into shame? How long will you love vain words and seek after lies? Selah.",
      "links": "<a href='/AIV/19/3/2'>Ps. 3:2</a>; <a href='/AIV/19/62/3-4'>Ps. 62:3-4</a>",
      "comment": "'Men' (lit. 'sons of men') refers to the leaders or nobles who opposed David. Their pursuit of 'vain words' suggests idolatry or false confidence. Notice the spiritual sense: all men are tempted by empty promises; only God brings true honor."
    },
    {
      "pk": 1900403,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 3,
      "text": "But know that the LORD has set apart the godly for himself; the LORD hears when I call to him.",
      "links": "<a href='/AIV/19/50/5'>Ps. 50:5</a>; <a href='/AIV/19/17/6'>Ps. 17:6</a>; <a href='/AIV/2/33/16'>Ex. 33:16</a>",
      "comment": "'Set apart' (literally 'distinguishes by miracle or sign') recalls how God marks his chosen, similar to sacramental grace (see Ex. 33:16). The Catholic idea of sanctification is reflected here in God choosing and hearing his saints."
    },
    {
      "pk": 1900404,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 4,
      "text": "Be angry, and do not sin; ponder in your own hearts on your beds, and be silent. Selah.",
      "links": "<a href='/AIV/49/4/26'>Eph. 4:26</a>; <a href='/AIV/19/77/6'>Ps. 77:6</a>",
      "comment": "Paul quotes this verse in Ephesians 4:26. The text encourages righteous examination of conscience, a key to spiritual growth and repentance—an attitude at the heart of Catholic practice, especially in Confession. Notice the call to silence—a recurring theme in monastic Catholicism."
    },
    {
      "pk": 1900405,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 5,
      "text": "Offer right sacrifices, and put your trust in the LORD.",
      "links": "<a href='/AIV/19/51/19'>Ps. 51:19</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/1/1/9'>Gen. 4:4-7</a>",
      "comment": "The offering of sacrifices in faith prefigures the perfect sacrifice of Christ (Heb. 10:12-14). Catholics see this fulfilled in the Holy Mass, the true and holy sacrifice of the New Covenant, in which trust is placed in God’s initiative rather than in mere outward ritual."
    },
    {
      "pk": 1900406,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 6,
      "text": "Many say, 'Who will show us good?' Lift up the light of your face upon us, O LORD!",
      "links": "<a href='/AIV/4/6/25'>Num. 6:25–26</a>; <a href='/AIV/19/31/16'>Ps. 31:16</a>; <a href='/AIV/2/33/18-19'>Ex. 33:18-19</a>",
      "comment": "The 'light of your face' is a reference to the priestly blessing (Num. 6:25-26), fulfilled in Christ who is the light of the world (John 8:12). The Catholic understanding sees God’s real favor mediated sacramentally, especially in the Eucharist—a foretaste of seeing God face to face."
    },
    {
      "pk": 1900407,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 7,
      "text": "You have put more joy in my heart than when their grain and new wine abound.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/19/104/15'>Ps. 104:15</a>",
      "comment": "True spiritual joy surpasses earthly blessings. Catholic commentators see this as a longing for heavenly union with God, fulfilled in the joy of the saints and anticipated in the Eucharist—'the source and summit of the Christian life.'"
    },
    {
      "pk": 1900408,
      "translation": "AIV",
      "book": 19,
      "chapter": 4,
      "verse": 8,
      "text": "In peace I will both lie down and sleep; for you alone, O LORD, make me dwell in safety.",
      "links": "<a href='/AIV/19/3/5'>Ps. 3:5</a>; <a href='/AIV/19/121/4'>Ps. 121:4</a>",
      "comment": "David’s confidence to sleep peacefully shows trust in God’s providence and sovereignty. The peace of God, which surpasses understanding (Phil. 4:7), is ultimately found in communion with God—a peace prefigured in the Old Covenant and fulfilled in Christ, present sacramentally in the Church."
    }
  ],
  "translatedAt": "2025-12-22T21:21:45.127Z"
}