{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 12,
  "verses": [
    {
      "pk": 23012001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 1,
      "text": "Help, LORD! The faithful are disappearing; the loyal have vanished from among the children of man.",
      "links": "<a href='/AIV/20/1/15'>Prov. 1:15</a>; <a href='/AIV/19/14/2-3'>Ps. 14:2-3</a>",
      "comment": "The psalmist's cry mirrors later themes in the prophets about the remnant of true believers. The 'faithful' here refers to those who remain steadfast in God's covenant. This longing for authentic faith can be seen as a type for the future community Christ will gather (see <a href='/AIV/40/7/13-14'>Matt. 7:13-14</a>)."
    },
    {
      "pk": 23012002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 2,
      "text": "Everyone speaks falsehood with his neighbor; with flattering lips and a double heart they speak.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/24/9/8'>Jer. 9:8</a>",
      "comment": "The psalmist exposes the damage of duplicity and deception in society. The phrase 'double heart' hints at interior division, highlighting the importance of interior integrity aligned with outward confession (<a href='/AIV/59/1/8'>Jas. 1:8</a>). Spiritual readings see hypocrisy as particularly dangerous for those called to unity of faith and purpose."
    },
    {
      "pk": 23012003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 3,
      "text": "May the LORD cut off all flattering lips and every boastful tongue,",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>; <a href='/AIV/20/21/23'>Prov. 21:23</a>",
      "comment": "The psalmist prays for divine judgment upon those whose words are deceitful. This is a call for justice founded on God’s holiness. Lips and tongue are often metaphors for one's inner state (see <a href='/AIV/59/3/6'>Jas. 3:6</a>), pointing toward the tradition of watching over speech as a work of spiritual discipline."
    },
    {
      "pk": 23012004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 4,
      "text": "those who say, 'With our tongue we will prevail; our lips are our own—who is lord over us?'",
      "links": "<a href='/AIV/19/73/8-9'>Ps. 73:8-9</a>; <a href='/AIV/24/17/9'>Jer. 17:9</a>",
      "comment": "This verse identifies the rebellion of sinful human autonomy. Claiming 'our lips are our own' denies God's rightful lordship. Early Christian teachers saw here the consequences of rejecting divinely-given authority and revealed truth."
    },
    {
      "pk": 23012005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 5,
      "text": "'Because the poor are oppressed, because the needy groan, I will now arise,' says the LORD; 'I will place him in safety for which he yearns.'",
      "links": "<a href='/AIV/23/33/10'>Isa. 33:10</a>; <a href='/AIV/19/9/12'>Ps. 9:12</a>",
      "comment": "God’s response shows His concern for the poor and afflicted, echoing themes throughout both Testaments regarding justice and mercy (<a href='/AIV/40/5/3'>Matt. 5:3</a>). Early interpretations see this as a foreshadowing of God’s intervention through Christ, who protects and uplifts the humble."
    },
    {
      "pk": 23012006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 6,
      "text": "The words of the LORD are pure words, like silver refined in a furnace on the ground, purified seven times.",
      "links": "<a href='/AIV/19/18/30'>Ps. 18:30</a>; <a href='/AIV/20/30/5'>Prov. 30:5</a>",
      "comment": "Contrasting human lies, God's promises are utterly pure and trustworthy. The image of silver refined 'seven times' suggests perfection and completeness. Spiritually, the preservation and integrity of God’s word has been upheld throughout history, entrusted to a faithful community (<a href='/AIV/43/17/17'>John 17:17</a>)."
    },
    {
      "pk": 23012007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 7,
      "text": "You, LORD, will keep them; you will guard us from this generation forever.",
      "links": "<a href='/AIV/19/121/7'>Ps. 121:7</a>; <a href='/AIV/19/37/28'>Ps. 37:28</a>",
      "comment": "The assurance of God’s ongoing protection points to His faithfulness despite evil all around. Many understand this as the preservation of the faithful through history, a theme echoed in Christ’s promise that the gates of hell will not prevail against the Church (<a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 23012008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 12,
      "verse": 8,
      "text": "The wicked walk all around, when vileness is exalted among the children of man.",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>; <a href='/AIV/20/28/12'>Prov. 28:12</a>",
      "comment": "The psalm ends with a warning about the increase of evil when truth and virtue are neglected. Throughout history, God has responded to such times by raising up witnesses and guiding His people into truth and unity (<a href='/AIV/62/2/18-19'>1 John 2:18-19</a>). This call to faithfulness remains relevant for all believers today."
    }
  ],
  "translatedAt": "2025-12-24T06:02:31.269Z"
}