{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 113,
  "verses": [
    {
      "pk": 1130001,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 1,
      "text": "Praise the LORD! Praise, O servants of the LORD, praise the name of the LORD.",
      "links": "<a href='/AIV/19/135/1'>Ps. 135:1</a>; <a href='/AIV/19/103/21'>Ps. 103:21</a>",
      "comment": "This verse opens with a call to worship directed specifically to the servants of the LORD, suggesting not just the general people but those consecrated to His service, foreshadowing the importance of sacred ministry and worship."
    },
    {
      "pk": 1130002,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 2,
      "text": "Blessed be the name of the LORD from this time forth and forevermore!",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>; <a href='/AIV/19/115/18'>Ps. 115:18</a>",
      "comment": "The everlasting blessing of God's name echoes throughout later biblical texts, highlighting the eternal nature of worship, which finds fulfillment in perpetual praise—both on earth and in heaven."
    },
    {
      "pk": 1130003,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 3,
      "text": "From the rising of the sun to its setting, the name of the LORD is to be praised.",
      "links": "<a href='/AIV/19/50/1'>Ps. 50:1</a>; <a href='/AIV/39/1/11'>Mal. 1:11</a>",
      "comment": "This universal call to praise, spanning all times and places, hints at the global scope of worship and God's sovereignty over all nations. Malachi 1:11 references incense and a pure offering from 'every place,' pointing toward a future, worldwide worship."
    },
    {
      "pk": 1130004,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 4,
      "text": "The LORD is high above all nations; His glory is above the heavens.",
      "links": "<a href='/AIV/19/99/2'>Ps. 99:2</a>; <a href='/AIV/19/57/5'>Ps. 57:5</a>",
      "comment": "God's transcendence is emphasized—He is sovereign over every nation and even the heavens, pointing to His consistent glory and majesty, which will be fully revealed in Christ's exaltation (see Phil. 2:9-11)."
    },
    {
      "pk": 1130005,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 5,
      "text": "Who is like the LORD our God, who sits enthroned on high,",
      "links": "<a href='/AIV/19/89/6'>Ps. 89:6</a>; <a href='/AIV/19/97/9'>Ps. 97:9</a>",
      "comment": "This rhetorical question affirms God's utter uniqueness and sovereignty. The motif of 'enthronement' is also a theme tied to the heavenly king, prefiguring the messianic reign of Christ."
    },
    {
      "pk": 1130006,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 6,
      "text": "who looks far down to see the heavens and the earth.",
      "links": "<a href='/AIV/19/33/13'>Ps. 33:13-14</a>; <a href='/AIV/19/14/2'>Ps. 14:2</a>",
      "comment": "God's humility and condescension are highlighted; He dwells above all, yet stoops to observe His creation. This foreshadows the mystery that will be fulfilled in Jesus, who 'emptied Himself' (Phil. 2:6-8), revealing divine humility."
    },
    {
      "pk": 1130007,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 7,
      "text": "He raises the poor from the dust and lifts the needy from the ash heap,",
      "links": "<a href='/AIV/19/107/41'>Ps. 107:41</a>; <a href='/AIV/09/2/8'>1 Sam. 2:8</a>",
      "comment": "God’s care for the lowly is a major biblical theme, mirrored in Mary’s Magnificat (Luke 1:52) and Christ’s teachings. This verse points to the reversal in God’s kingdom—exalting the humble."
    },
    {
      "pk": 1130008,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 8,
      "text": "that He may seat them with princes, with the princes of His people.",
      "links": "<a href='/AIV/19/107/41'>Ps. 107:41</a>; <a href='/AIV/42/22/30'>Luke 22:30</a>",
      "comment": "Elevation from humble circumstances to honor foreshadows the divine invitation to share in God’s kingdom—fulfilled in Christ promising thrones to His disciples (Luke 22:30). Spiritual ascent through grace is deeply emphasized here."
    },
    {
      "pk": 1130009,
      "translation": "AIV",
      "book": 19,
      "chapter": 113,
      "verse": 9,
      "text": "He gives the barren woman a home, making her the joyful mother of children. Praise the LORD!",
      "links": "<a href='/AIV/09/1/20'>1 Sam. 1:20</a>; <a href='/AIV/42/1/57'>Luke 1:57</a>",
      "comment": "God’s compassion transforms barrenness into fruitfulness, seen in Hannah and Sarah, and spiritually fulfilled in Mary’s miraculous motherhood. The theme suggests both physical and spiritual fruitfulness granted by divine grace. This closes with a call to praise for all God’s wondrous acts."
    }
  ],
  "translatedAt": "2025-12-23T05:42:33.162Z"
}