{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 86,
  "verses": [
    {
      "pk": 1934301,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 1,
      "text": "Incline your ear, O LORD, and answer me, for I am poor and needy.",
      "links": "<a href='/AIV/19/40/17'>Ps. 40:17</a>; <a href='/AIV/19/102/1'>Ps. 102:1</a>",
      "comment": "David opens in humility, confessing his neediness before God. The plea to 'incline your ear' is a metaphor, not a claim the Lord has a physical ear. Note the posture of humility—essential in all true prayer and echoed through Christian liturgy."
    },
    {
      "pk": 1934302,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 2,
      "text": "Guard my life, for I am devoted to you. You are my God; save your servant who trusts in you.",
      "links": "<a href='/AIV/19/25/20'>Ps. 25:20</a>; <a href='/AIV/19/143/2'>Ps. 143:2</a>",
      "comment": "The phrase 'devoted to you' (Heb. chasid) can be read as 'holy.' Early Christian writers see such devotion as a mark of sanctification—a subtle pointer to the transforming grace outlined in Catholic sacramental theology."
    },
    {
      "pk": 1934303,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 3,
      "text": "Be merciful to me, O Lord, for I call upon you all day long.",
      "links": "<a href='/AIV/19/5/2'>Ps. 5:2</a>; <a href='/AIV/19/55/16-17'>Ps. 55:16–17</a>",
      "comment": "Continual prayer points to the importance of perseverance. The appeal to divine mercy foreshadows the New Testament teaching on God’s mercy in Christ—see <a href='/AIV/42/18/1-8'>Luke 18:1–8</a>."
    },
    {
      "pk": 1934304,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 4,
      "text": "Make the soul of your servant glad, for to you, O Lord, I lift up my soul.",
      "links": "<a href='/AIV/19/25/1'>Ps. 25:1</a>; <a href='/AIV/19/143/8'>Ps. 143:8</a>",
      "comment": "'Lifting up the soul' anticipates Christian themes: in the Mass, the priest says, 'Lift up your hearts.' Such spiritual orientation subtly aligns with Catholic liturgical practice."
    },
    {
      "pk": 1934305,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 5,
      "text": "For you, O Lord, are good and ready to forgive, abounding in mercy to all who call upon you.",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>; <a href='/AIV/19/130/4'>Ps. 130:4</a>",
      "comment": "God's readiness to forgive becomes a key element of Christ's ministry. Catholic theology especially emphasizes the sacrament of reconciliation as the means for this mercy to be encountered personally."
    },
    {
      "pk": 1934306,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 6,
      "text": "Give ear, O LORD, to my prayer; listen to the voice of my supplication.",
      "links": "<a href='/AIV/19/17/1'>Ps. 17:1</a>; <a href='/AIV/19/61/1'>Ps. 61:1</a>",
      "comment": "A universal invitation to prayer, reflected later in the teaching of Jesus on asking and receiving (<a href='/AIV/40/7/7'>Matthew 7:7</a>)."
    },
    {
      "pk": 1934307,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 7,
      "text": "In the day of my trouble, I call upon you, for you will answer me.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/19/20/1'>Ps. 20:1</a>",
      "comment": "David expresses assured faith that God responds to prayer. This confidence is echoed in Christ’s own prayers and promises to his followers."
    },
    {
      "pk": 1934308,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 8,
      "text": "There is no one like you among the gods, O Lord, nor are there any works like yours.",
      "links": "<a href='/AIV/19/89/6'>Ps. 89:6</a>; <a href='/AIV/02/15/11'>Ex. 15:11</a>",
      "comment": "Affirms God's uniqueness, pointing to monotheism. Christologically, this finds its fullness in Jesus, who is God made man (<a href='/AIV/43/1/1-18'>John 1:1–18</a>)."
    },
    {
      "pk": 1934309,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 9,
      "text": "All nations whom you have made shall come and bow down before you, O Lord, and shall glorify your name.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/23/66/18-23'>Isa. 66:18–23</a>",
      "comment": "A prophecy of universal worship. The Catholic Church sees its universality prefigured here, as all peoples are called to worship God—fulfilled in the Great Commission (<a href='/AIV/40/28/19-20'>Matt. 28:19–20</a>)."
    },
    {
      "pk": 1934310,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 10,
      "text": "For you are great and do wondrous deeds; you alone are God.",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>; <a href='/AIV/05/3/24'>Deut. 3:24</a>",
      "comment": "The singular divinity of God is confirmed, echoing the Shema (<a href='/AIV/05/6/4'>Deut. 6:4</a>). The wonders prefigure Christ’s miracles, his wondrous deeds."
    },
    {
      "pk": 1934311,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 11,
      "text": "Teach me your way, O LORD, that I may walk in your truth; give me an undivided heart to fear your name.",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/19/26/3'>Ps. 26:3</a>",
      "comment": "The desire for instruction and unity of heart is reminiscent of discipleship and sanctification, vital to Christian growth. Catholics hold this intention central in prayers for guidance and steadfast faith."
    },
    {
      "pk": 1934312,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 12,
      "text": "I will give thanks to you, O Lord my God, with all my heart, and I will glorify your name forever.",
      "links": "<a href='/AIV/19/9/1'>Ps. 9:1</a>; <a href='/AIV/19/145/1-2'>Ps. 145:1–2</a>",
      "comment": "Praise of God with one's whole heart points to personal devotion, the foundation of all worship and Eucharistic thanksgiving (Eucharistia means 'thanksgiving')."
    },
    {
      "pk": 1934313,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 13,
      "text": "For your mercy toward me is great, and you have delivered my soul from the depths of Sheol.",
      "links": "<a href='/AIV/19/30/3'>Ps. 30:3</a>; <a href='/AIV/19/49/15'>Ps. 49:15</a>",
      "comment": "Deliverance from Sheol hints at the resurrection hope and Christ's descent to the dead (<a href='/AIV/60/3/19'>1 Pet. 3:19</a>), central in the ancient Church's creed."
    },
    {
      "pk": 1934314,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 14,
      "text": "O God, arrogant men have risen up against me, and a band of violent men seeks my life; they do not set you before them.",
      "links": "<a href='/AIV/19/54/3'>Ps. 54:3</a>; <a href='/AIV/19/64/2'>Ps. 64:2</a>",
      "comment": "Opposition by the proud and violent reflects the persecution experienced by the faithful, and ultimately Christ. It foreshadows martyrdom and strengthens calls to unity in the face of adversity."
    },
    {
      "pk": 1934315,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 15,
      "text": "But you, O Lord, are a God compassionate and gracious, slow to anger and abundant in mercy and truth.",
      "links": "<a href='/AIV/02/34/6'>Ex. 34:6</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "The description of God here is foundational to all biblical revelation, found also in Exodus and repeated in Catholic liturgy (e.g., Kyrie Eleison)."
    },
    {
      "pk": 1934316,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 16,
      "text": "Turn to me and be gracious to me; grant your strength to your servant and save the son of your maidservant.",
      "links": "<a href='/AIV/19/116/16'>Ps. 116:16</a>; <a href='/AIV/19/31/16'>Ps. 31:16</a>",
      "comment": "The motif 'son of your maidservant' connects to ancient promises and Marian themes, hinting at the special dignity of being devoted to God's service."
    },
    {
      "pk": 1934317,
      "translation": "AIV",
      "book": 19,
      "chapter": 86,
      "verse": 17,
      "text": "Show me a sign of your favor, so that those who hate me may see and be put to shame, because you, O LORD, have helped me and comforted me.",
      "links": "<a href='/AIV/19/41/11'>Ps. 41:11</a>; <a href='/AIV/19/118/7'>Ps. 118:7</a>",
      "comment": "Asking for a sign is not mere doubt but a desire for God’s visible action. Such signs find fulfillment in Christ’s miracles, with sacramental realities—visible signs of invisible grace—at the center of Catholic faith."
    }
  ],
  "translatedAt": "2025-12-22T21:47:27.098Z"
}