{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 76,
  "verses": [
    {
      "pk": 1976076,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 1,
      "text": "God is known in Judah; his name is great in Israel.",
      "links": "<a href='/AIV/19/9/16'>Ps. 9:16</a>; <a href='/AIV/19/48/1'>Ps. 48:1</a>",
      "comment": "This verse establishes God’s manifest presence among His chosen people. From a broader Catholic perspective, note how the knowledge and worship of God expands beyond the confines of Israel to the Church as the new Israel (see <a href='/AIV/60/2/9'>1 Peter 2:9</a>), subtly paralleling Catholic teaching on universality and fulfillment."
    },
    {
      "pk": 1976077,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 2,
      "text": "His tabernacle is in Salem; his dwelling place is in Zion.",
      "links": "<a href='/AIV/19/132/13'>Ps. 132:13</a>; <a href='/AIV/01/14/18'>Gen. 14:18</a>",
      "comment": "Salem is an ancient name for Jerusalem, symbolizing peace. Zion represents God’s chosen dwelling and points to the importance of sacred space and liturgical worship. Catholic teaching emphasizes God’s dwelling with His people in the Eucharist, echoing the tent of meeting and temple fulfilled in Christ (see <a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 1976078,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 3,
      "text": "There he broke the fiery arrows, the shield, the sword, and all weapons of war.",
      "links": "<a href='/AIV/19/46/9'>Ps. 46:9</a>; <a href='/AIV/23/2/4'>Isa. 2:4</a>",
      "comment": "God is portrayed as the one who defeats enemies and brings peace. Catholic interpretation often sees this as a prefigurement of lasting peace through Christ and the sacraments, a subtle nudge toward the Church's role as the peacemaker among nations."
    },
    {
      "pk": 1976079,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 4,
      "text": "You are radiant and majestic, coming down from the mountains of prey.",
      "links": "<a href='/AIV/19/50/2'>Ps. 50:2</a>; <a href='/AIV/35/3/3'>Hab. 3:3-4</a>",
      "comment": "God’s radiance evokes His glory and presence. The Catholic faith teaches about God's majesty visibly manifested in Christ and sacramental life. The mountains subtly hint at Christ's transfiguration (<a href='/AIV/40/17/1-2'>Matthew 17:1-2</a>), reinforcing Christological implications."
    },
    {
      "pk": 1976080,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 5,
      "text": "The brave of heart were stripped; they slept their last sleep, and none of the mighty men could lift their hands.",
      "links": "<a href='/AIV/02/15/4-5'>Ex. 15:4-5</a>; <a href='/AIV/19/88/5'>Ps. 88:5</a>",
      "comment": "Reference to God's power over the proud and the mighty. This anticipates Christ’s victory over sin and death, which Catholic tradition sees as culminating in the Paschal Mystery (death and resurrection)."
    },
    {
      "pk": 1976081,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 6,
      "text": "At your rebuke, O God of Jacob, both chariot and horse are cast into a deep sleep.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>; <a href='/AIV/02/14/24-25'>Ex. 14:24-25</a>",
      "comment": "God’s rebuke alone undoes the forces of war, pointing to divine authority over human power. The Catholic perspective sees a typology here: God’s ability to defeat Egypt’s chariots foreshadows Christ’s victory secured not by human means, but by sacrifice."
    },
    {
      "pk": 1976082,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 7,
      "text": "You alone are to be feared. Who can stand in your presence when you are angry?",
      "links": "<a href='/AIV/19/130/3'>Ps. 130:3</a>; <a href='/AIV/66/6/17'>Rev. 6:17</a>",
      "comment": "God’s holiness and righteous anger inspire awe. Catholic tradition emphasizes reverence before God, aligning with the historical posture of awe and solemnity in worship, and hints at the need for reconciliation and penance (<a href='/AIV/45/3/23'>Romans 3:23</a>)."
    },
    {
      "pk": 1976083,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 8,
      "text": "From heaven you pronounced judgment; the earth feared and was silent",
      "links": "<a href='/AIV/19/50/4'>Ps. 50:4</a>; <a href='/AIV/65/1/15'>Jude 1:15</a>",
      "comment": "Depicts God’s sovereign judgment over all creation. Catholics read this as anticipation of the Last Judgment, underscoring the reality of accountability and the need for sacramental preparation, such as confession."
    },
    {
      "pk": 1976084,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 9,
      "text": "when God arose to judge, to save all the humble of the earth.",
      "links": "<a href='/AIV/19/72/2'>Ps. 72:2</a>; <a href='/AIV/19/34/18'>Ps. 34:18</a>; <a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "God’s judgment brings salvation to the humble—a theme rooted in both Old and New Testament. Catholic theology highlights humility as foundational for reception of grace (see the Magnificat, <a href='/AIV/42/1/46-55'>Luke 1:46-55</a>)."
    },
    {
      "pk": 1976085,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 10,
      "text": "Surely the wrath of man shall praise you; the remainder of wrath you restrain.",
      "links": "<a href='/AIV/02/9/16'>Ex. 9:16</a>; <a href='/AIV/45/9/17'>Rom. 9:17</a>",
      "comment": "Even human anger and opposition ultimately serve God’s purposes. The Catholic emphasis on God’s sovereignty, even through adversity, can foster deeper trust in Divine Providence and inspire acceptance of suffering as transformative."
    },
    {
      "pk": 1976086,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 11,
      "text": "Make vows to the LORD your God and fulfill them; let all who are around him bring gifts to the One to be feared.",
      "links": "<a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/19/22/25'>Ps. 22:25</a>",
      "comment": "Encourages commitment and offering. Ancient vows and gifts prefigure the Catholic practice of offering prayers, sacrifices, and material support as enduring acts of devotion (see <a href='/AIV/40/2/11'>Matt. 2:11</a>)."
    },
    {
      "pk": 1976087,
      "translation": "AIV",
      "book": 19,
      "chapter": 76,
      "verse": 12,
      "text": "He cuts off the spirit of princes; he is feared by the kings of the earth.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/19/110/5'>Ps. 110:5</a>",
      "comment": "God’s authority over worldly rulers foreshadows Christ the King, a distinctly Catholic feast. This verse draws readers toward recognizing Christ’s universal Kingship, fulfilled in Revelation (<a href='/AIV/66/19/16'>Rev. 19:16</a>)."
    }
  ],
  "translatedAt": "2025-12-22T21:43:46.775Z"
}