{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 143,
  "verses": [
    {
      "pk": 100431,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 1,
      "text": "Hear my prayer, O LORD; give ear to my pleas for mercy! In your faithfulness answer me, in your righteousness.",
      "links": "<a href='/AIV/19/86/1'>Psalm 86:1</a>; <a href='/AIV/19/140/6'>Psalm 140:6</a>; <a href='/AIV/1/18/25'>Genesis 18:25</a>",
      "comment": "David appeals to God's faithfulness and righteousness, underscoring the mercy of the Lord. The term 'righteousness' hints at the foundation for later understanding of justifying grace (see Romans 3:26)."
    },
    {
      "pk": 100432,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 2,
      "text": "Do not enter into judgment with your servant, for no one living is righteous before you.",
      "links": "<a href='/AIV/18/9/2'>Job 9:2</a>; <a href='/AIV/19/130/3'>Psalm 130:3</a>; <a href='/AIV/45/3/23'>Romans 3:23</a>",
      "comment": "This verse recognizes universal human sinfulness, echoed in Paul’s teachings on justification by faith. It hints at the need for grace and mercy, not just works (Romans 3:20-23)."
    },
    {
      "pk": 100433,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 3,
      "text": "For the enemy has pursued my soul, he has crushed my life to the ground, he has made me dwell in darkness like those long dead.",
      "links": "<a href='/AIV/19/88/3-6'>Psalm 88:3–6</a>; <a href='/AIV/24/4/10'>Lamentations 3:6</a>",
      "comment": "David's suffering is depicted in strong language. The darkness motif is later fulfilled and reversed in Christ, who brings light to those in darkness (see Luke 1:78-79)."
    },
    {
      "pk": 100434,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 4,
      "text": "Therefore my spirit faints within me; my heart within me is appalled.",
      "links": "<a href='/AIV/19/142/3'>Psalm 142:3</a>; <a href='/AIV/19/61/2'>Psalm 61:2</a>",
      "comment": "The internal anguish parallels passages on the sufferings of the soul—see also Christ's agony in the Garden (Matthew 26:38)."
    },
    {
      "pk": 100435,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 5,
      "text": "I remember the days of old; I meditate on all you have done; I ponder the work of your hands.",
      "links": "<a href='/AIV/19/77/11-12'>Psalm 77:11–12</a>; <a href='/AIV/19/8/3'>Psalm 8:3</a>",
      "comment": "Reflection on God's past deeds promotes faith, a principle central to faithful meditation and contemplative prayer (see Psalm 119:15)."
    },
    {
      "pk": 100436,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 6,
      "text": "I stretch out my hands to you; my soul thirsts for you like a parched land. Selah.",
      "links": "<a href='/AIV/19/63/1'>Psalm 63:1</a>; <a href='/AIV/19/28/2'>Psalm 28:2</a>; <a href='/AIV/19/42/2'>Psalm 42:2</a>",
      "comment": "The image of thirst for God prefigures the soul’s longing fulfilled in Christ, the living water (see John 4:14; 7:37). 'Stretching out hands' anticipates postures of prayer and worship."
    },
    {
      "pk": 100437,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 7,
      "text": "Answer me quickly, O LORD! My spirit fails. Do not hide your face from me, or I will be like those who go down into the pit.",
      "links": "<a href='/AIV/19/28/1'>Psalm 28:1</a>; <a href='/AIV/19/69/15'>Psalm 69:15</a>",
      "comment": "David fears separation from the presence of God more than death, signaling the vital necessity of communion with God, which finds its ultimate expression in the unity of the Church (see John 17:21-23)."
    },
    {
      "pk": 100438,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 8,
      "text": "Let me hear of your steadfast love in the morning, for in you I trust. Make me know the way I should go, for to you I lift up my soul.",
      "links": "<a href='/AIV/19/90/14'>Psalm 90:14</a>; <a href='/AIV/19/25/1-4'>Psalm 25:1-4</a>",
      "comment": "'Steadfast love' (Hebrew: hesed) is covenant faithfulness—an enduring theme pointing ahead to the new and eternal covenant in Christ (see Luke 1:72)."
    },
    {
      "pk": 100439,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 9,
      "text": "Deliver me, O LORD, from my enemies; I flee to you for refuge.",
      "links": "<a href='/AIV/19/31/1'>Psalm 31:1</a>; <a href='/AIV/19/46/1'>Psalm 46:1</a>",
      "comment": "Trust in God as refuge is fulfilled most perfectly in Christ, our deliverer from sin and evil (see Colossians 1:13)."
    },
    {
      "pk": 100440,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 10,
      "text": "Teach me to do your will, for you are my God! Let your good Spirit lead me on level ground.",
      "links": "<a href='/AIV/19/25/4'>Psalm 25:4</a>; <a href='/AIV/19/51/10-12'>Psalm 51:10-12</a>; <a href='/AIV/45/8/14'>Romans 8:14</a>",
      "comment": "The prayer for guidance from the Spirit points forward to the fuller dwelling of the Holy Spirit promised in the New Covenant (see John 16:13; Acts 2:4). Obedience to God's will is essential to spiritual life."
    },
    {
      "pk": 100441,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 11,
      "text": "For your name’s sake, O LORD, preserve my life! In your righteousness bring my soul out of trouble!",
      "links": "<a href='/AIV/19/23/3'>Psalm 23:3</a>; <a href='/AIV/19/31/17'>Psalm 31:17</a>",
      "comment": "Preservation for the sake of God's name recalls the sanctity of God’s promises and his reputation, later applied to Christ, who prays for his followers in John 17:11-12."
    },
    {
      "pk": 100442,
      "translation": "AIV",
      "book": 19,
      "chapter": 143,
      "verse": 12,
      "text": "And in your steadfast love silence my enemies, and destroy all who afflict my soul, for I am your servant.",
      "links": "<a href='/AIV/19/54/5'>Psalm 54:5</a>; <a href='/AIV/19/6/10'>Psalm 6:10</a>",
      "comment": "'Your servant' emphasizes the humility proper to God’s people. The conclusion is a call for complete trust in the deliverance and vindication found only in the faithful Lord—a motif fulfilled in the ultimate defeat of evil through Christ (see Revelation 20:10)."
    }
  ],
  "translatedAt": "2025-12-23T05:51:03.472Z"
}