{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 24,
  "verses": [
    {
      "pk": 2402401,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 1,
      "text": "The earth belongs to the LORD, and everything in it; the world, and all who live in it.",
      "links": "<a href='/AIV/19/50/12'>Ps. 50:12</a>; <a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/1/14/19'>Gen. 14:19</a>; <a href='/AIV/1/8/22'>Gen. 8:22</a>",
      "comment": "This opening verse affirms God's absolute sovereignty over all creation, a theme that resonates throughout both the Old and New Testaments (see Col. 1:16). Note how the text underscores the Lord's ownership, laying a foundation for stewardship, a principle especially emphasized in the Catholic tradition."
    },
    {
      "pk": 2402402,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 2,
      "text": "For he has founded it upon the seas and established it upon the rivers.",
      "links": "<a href='/AIV/1/1/9-10'>Gen. 1:9–10</a>; <a href='/AIV/19/136/6'>Ps. 136:6</a>",
      "comment": "This verse echoes the creation narrative from Genesis, emphasizing God's creative power over chaotic waters—a common biblical symbol for disorder. The Catholic understanding of God as Creator prepares the way for faith in the sacraments, where God's creative power is continually at work."
    },
    {
      "pk": 2402403,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 3,
      "text": "Who may ascend the hill of the LORD? Who may stand in his holy place?",
      "links": "<a href='/AIV/19/15/1'>Ps. 15:1</a>; <a href='/AIV/19/43/3'>Ps. 43:3</a>; <a href='/AIV/2/3/13'>Ex. 3:13–14</a>",
      "comment": "This rhetorical question introduces the theme of approach to God's presence. The 'hill of the LORD' often refers to Jerusalem or Zion, which Christians later associate with Christ and the heavenly city (Heb. 12:22). The Catholic emphasis on holiness and liturgy finds deep roots here."
    },
    {
      "pk": 2402404,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 4,
      "text": "He who has clean hands and a pure heart, who does not lift up his soul to what is false and does not swear deceitfully.",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/23/33/15'>Isa. 33:15</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "Holiness involves both outward action (clean hands) and inward purity (pure heart). This is echoed by Jesus’ Beatitude (Matt. 5:8). The reference to 'not lifting up the soul to what is false' is protective against idolatry, hinting at the necessity of internal faith and external works—harmonized within Catholic theology."
    },
    {
      "pk": 2402405,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 5,
      "text": "He will receive blessing from the LORD and righteousness from the God of his salvation.",
      "links": "<a href='/AIV/19/112/2'>Ps. 112:2</a>; <a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/45/4/6'>Rom. 4:6</a>",
      "comment": "The text links receiving God's blessing to righteousness and salvation. Catholic interpretation often sees such verses as supporting both faith and participation in God's grace—inward justification being completed by outward action."
    },
    {
      "pk": 2402406,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 6,
      "text": "Such is the generation of those who seek him, who seek the face of the God of Jacob.",
      "links": "<a href='/AIV/19/27/8'>Ps. 27:8</a>; <a href='/AIV/19/105/4'>Ps. 105:4</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "'Seeking the face of God' uses the intimate language of relationship. Catholic tradition has emphasized the communal pursuit of God, and liturgical encounter with his real presence—especially in the Eucharist."
    },
    {
      "pk": 2402407,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 7,
      "text": "Lift up your heads, O gates! Be lifted up, you ancient doors, that the King of glory may come in.",
      "links": "<a href='/AIV/19/118/19-20'>Ps. 118:19–20</a>; <a href='/AIV/23/26/2'>Isa. 26:2</a>; <a href='/AIV/40/21/9'>Matt. 21:9</a>",
      "comment": "This poetic call envisions the coming of the King of glory, historically God entering the sanctuary, but spiritually a prophecy fulfilled in Christ's triumphal entry and his ascension. Liturgically, the Church applies these words in feast days like Ascension and in the Mass."
    },
    {
      "pk": 2402408,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 8,
      "text": "Who is this King of glory? The LORD, strong and mighty, the LORD, mighty in battle.",
      "links": "<a href='/AIV/2/15/3'>Ex. 15:3</a>; <a href='/AIV/19/76/3'>Ps. 76:3</a>; <a href='/AIV/66/19/16'>Rev. 19:16</a>",
      "comment": "The King of glory is identified as the LORD Himself—a strong allusion Christologically to Jesus as the triumphant Lord. This has been seen as prophecy fulfilled in Christ’s victory over sin and death."
    },
    {
      "pk": 2402409,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 9,
      "text": "Lift up your heads, O gates! Lift them up, you ancient doors, that the King of glory may come in.",
      "links": "<a href='/AIV/19/24/7'>Ps. 24:7</a>; <a href='/AIV/19/118/26'>Ps. 118:26</a>",
      "comment": "The repetition intensifies the messianic expectation. In Catholic liturgy, this psalm is chanted at major feasts anticipating Christ’s arrival, subtly encouraging a theology of Christ’s real spiritual and physical presence."
    },
    {
      "pk": 2402410,
      "translation": "AIV",
      "book": 19,
      "chapter": 24,
      "verse": 10,
      "text": "Who is he, this King of glory? The LORD of hosts—he is the King of glory.",
      "links": "<a href='/AIV/19/84/3'>Ps. 84:3</a>; <a href='/AIV/23/6/5'>Isa. 6:5</a>; <a href='/AIV/66/5/12'>Rev. 5:12–13</a>",
      "comment": "The answer to the question ultimately identifies God as 'LORD of hosts', another title applied to Christ in New Testament worship (see Rev. 5:12–13). The unity of Old and New Testaments here suggests the Church’s teaching authority to read the entire Bible in the light of Christ—an interpretive approach foundational to Catholic doctrine."
    }
  ],
  "translatedAt": "2025-12-22T21:27:51.920Z"
}