{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 22,
  "verses": [
    {
      "pk": 22022001,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 1,
      "text": "My God, my God, why have you forsaken me? Why are you so far from saving me, from the words of my groaning?",
      "links": "<a href='/AIV/40/27/46'>Matt. 27:46</a>; <a href='/AIV/41/15/34'>Mark 15:34</a>",
      "comment": "This opening line is directly quoted by Jesus on the cross, signifying fulfilled prophecy. The sense of abandonment reflects Christ's true humanity while also foreshadowing the redemptive suffering for all mankind—a reality lived out in the liturgy of the Church."
    },
    {
      "pk": 22022002,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 2,
      "text": "O my God, I call by day, but you do not answer; and by night, but I find no rest.",
      "links": "<a href='/AIV/18/30/20'>Job 30:20</a>",
      "comment": "This verse brings out a theme of persistent prayer even in distress, which aligns with the tradition of union with Christ's suffering, a concept emphasized in Catholic spirituality."
    },
    {
      "pk": 22022003,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 3,
      "text": "Yet you are holy, enthroned upon the praises of Israel.",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "The psalmist quickly shifts from lament to recognition of God's holiness, a pattern echoed in Catholic liturgical worship."
    },
    {
      "pk": 22022004,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 4,
      "text": "In you our fathers trusted; they trusted, and you delivered them.",
      "links": "<a href='/AIV/02/14/30'>Ex. 14:30</a>; <a href='/AIV/07/2/7'>Judg. 2:7</a>",
      "comment": "A reminder of God’s faithfulness to Israel—a faith fulfilled for all in Christ, recognized as the new and everlasting covenant."
    },
    {
      "pk": 22022005,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 5,
      "text": "To you they cried and were rescued; in you they trusted and were not put to shame.",
      "links": "<a href='/AIV/19/25/3'>Ps. 25:3</a>",
      "comment": "Trust in God never leads to shame—a foreshadowing of faith in Christ as the sure hope. The language prefigures the hope offered in Baptism, which washes away the shame of sin."
    },
    {
      "pk": 22022006,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 6,
      "text": "But I am a worm and not a man, scorned by mankind and despised by the people.",
      "links": "<a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "This echoes the Suffering Servant motif from Isaiah, showing Christ’s humility. The Church reads this as Christ’s identification with the lowest, especially in the Eucharist, which appears humble but is truly the glory of God."
    },
    {
      "pk": 22022007,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 7,
      "text": "All who see me mock me; they make mouths at me; they wag their heads.",
      "links": "<a href='/AIV/40/27/39-43'>Matt. 27:39–43</a>",
      "comment": "A prophecy fulfilled at Calvary when Christ was mocked. The physical gestures described here are seen by the Gospel writers as direct fulfillment during the Passion."
    },
    {
      "pk": 22022008,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 8,
      "text": "'He trusts in the LORD; let him deliver him; let him rescue him, for he delights in him!'",
      "links": "<a href='/AIV/40/27/43'>Matt. 27:43</a>",
      "comment": "These words are echoed by Jesus’ persecutors at the crucifixion, tying again to the Messiah’s suffering and exposing deeper meaning—no deliverance from suffering, but through suffering comes redemption."
    },
    {
      "pk": 22022009,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 9,
      "text": "Yet you are the one who drew me out from the womb; you made me trust at my mother’s breasts.",
      "links": "<a href='/AIV/19/71/6'>Ps. 71:6</a>",
      "comment": "The psalmist acknowledges God’s providence from birth, a theme later applied to Christ’s Incarnation, and in Catholic faith, echoes the veneration of Mary as Theotokos."
    },
    {
      "pk": 22022010,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 10,
      "text": "Upon you was I cast from birth, and from my mother’s womb you have been my God.",
      "links": "<a href='/AIV/19/71/6'>Ps. 71:6</a>",
      "comment": "Shows the continuity of God’s care, and subtly affirms the sanctity of life from conception, a truth held strongly in Catholic doctrine."
    },
    {
      "pk": 22022011,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 11,
      "text": "Do not be far from me, for trouble is near, and there is no one to help.",
      "links": "<a href='/AIV/19/38/21'>Ps. 38:21</a>",
      "comment": "A plea for God’s closeness in suffering—a recurring theme in Lament Psalms and in the passion accounts."
    },
    {
      "pk": 22022012,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 12,
      "text": "Many bulls surround me; strong bulls of Bashan encircle me;",
      "links": "<a href='/AIV/30/4/1'>Amos 4:1</a>",
      "comment": "‘Bulls of Bashan’ are symbols of powerful enemies. Catholic interpreters often see this as an image of Christ surrounded by spiritual and worldly adversaries."
    },
    {
      "pk": 22022013,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 13,
      "text": "They open wide their mouths at me, as a ravening and roaring lion.",
      "links": "<a href='/AIV/19/35/21'>Ps. 35:21</a>",
      "comment": "The animal imagery expresses the intensity of opposition; the roaring lion later becomes an image for Satan (cf. 1 Pet. 5:8)."
    },
    {
      "pk": 22022014,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 14,
      "text": "I am poured out like water, and all my bones are out of joint; my heart is like wax; it is melted within me.",
      "links": "<a href='/AIV/43/19/34'>John 19:34</a>",
      "comment": "Striking physical descriptions here point to the Passion. Being ‘poured out like water’—Catholic tradition sees this as not just physical, but the giving of self, as in the Eucharist. It was fulfilled when Christ's side was pierced and blood and water flowed out."
    },
    {
      "pk": 22022015,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 15,
      "text": "My strength is dried up like a potsherd, and my tongue sticks to my jaws; you lay me in the dust of death.",
      "links": "<a href='/AIV/43/19/28'>John 19:28</a>",
      "comment": "Jesus’ cry ‘I thirst’ on the cross is echoed here. The image of being brought to the 'dust of death' links to humanity’s mortality and the necessity of redemption accomplished in Christ."
    },
    {
      "pk": 22022016,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 16,
      "text": "For dogs surround me; a band of evildoers encircles me; they have pierced my hands and my feet.",
      "links": "<a href='/AIV/43/20/25-27'>John 20:25–27</a>",
      "comment": "This key prophetic image foreshadows Jesus’ crucifixion. The phrase 'pierced my hands and feet'—while textually disputed in the Hebrew—agrees with early Christian and Septuagint tradition, emphasizing the literal fulfillment in Christ's Passion."
    },
    {
      "pk": 22022017,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 17,
      "text": "I can count all my bones—they stare and gloat over me;",
      "links": "<a href='/AIV/19/34/20'>Ps. 34:20</a>; <a href='/AIV/43/19/36'>John 19:36</a>",
      "comment": "None of Christ's bones were broken, fulfilling prophecy (John 19:36); the exposed suffering details foreshadow the realities of Calvary."
    },
    {
      "pk": 22022018,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 18,
      "text": "They divide my garments among themselves, and for my clothing they cast lots.",
      "links": "<a href='/AIV/43/19/23-24'>John 19:23–24</a>",
      "comment": "Explicitly fulfilled at Christ's crucifixion. This shows the unity between Old and New Testament, and how God’s providence extends even to the smallest details."
    },
    {
      "pk": 22022019,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 19,
      "text": "But you, O LORD, do not be far off! O my help, hasten to my aid!",
      "links": "<a href='/AIV/19/70/1'>Ps. 70:1</a>",
      "comment": "A plea for God to quickly come to the aid of the sufferer—a prayer often echoed in the Liturgy of the Hours."
    },
    {
      "pk": 22022020,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 20,
      "text": "Deliver my soul from the sword, my only life from the power of the dog;",
      "links": "<a href='/AIV/19/35/17'>Ps. 35:17</a>",
      "comment": "The psalmist prays for deliverance from deadly enemies, a plea Christ fulfills in his Resurrection—victory through suffering."
    },
    {
      "pk": 22022021,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 21,
      "text": "Save me from the mouth of the lion! From the horns of wild oxen you have answered me.",
      "links": "<a href='/AIV/19/35/17'>Ps. 35:17</a>; <a href='/AIV/55/4/17'>2 Tim. 4:17</a>",
      "comment": "Concludes the lament with hope of rescue—transitioning from suffering to praise. In Catholic liturgy, this movement is reflected in the paschal mystery."
    },
    {
      "pk": 22022022,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 22,
      "text": "I will declare your name to my brothers; in the midst of the congregation I will praise you:",
      "links": "<a href='/AIV/58/2/12'>Heb. 2:12</a>",
      "comment": "Quoted in Hebrews, applying this verse directly to Jesus who leads the faithful in worship. Catholic theology sees this as a prototype of Christ as the true High Priest."
    },
    {
      "pk": 22022023,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 23,
      "text": "You who fear the LORD, praise him! All you offspring of Jacob, glorify him; and stand in awe of him, all you offspring of Israel!",
      "links": "<a href='/AIV/19/135/19-20'>Ps. 135:19–20</a>",
      "comment": "The scope of praise broadens; all the faithful in God’s covenant are summoned. In Catholic view, the Church is the new Israel, composed of all nations."
    },
    {
      "pk": 22022024,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 24,
      "text": "For he has not despised or abhorred the affliction of the afflicted; nor has he hidden his face from him, but when he cried to him, he heard.",
      "links": "<a href='/AIV/19/69/33'>Ps. 69:33</a>",
      "comment": "God’s compassion is highlighted. Suffering is not meaningless but redemptive, a Catholic doctrine central to understanding Christ’s Passion and our participation in it."
    },
    {
      "pk": 22022025,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 25,
      "text": "From you comes my praise in the great congregation; my vows I will perform before those who fear him.",
      "links": "<a href='/AIV/19/40/9-10'>Ps. 40:9–10</a>",
      "comment": "Public praise and vowed offerings—a parallel with the Eucharistic liturgy and the sacramental life of the Church."
    },
    {
      "pk": 22022026,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 26,
      "text": "The poor shall eat and be satisfied; those who seek him shall praise the LORD. May your hearts live forever!",
      "links": "<a href='/AIV/19/69/32'>Ps. 69:32</a>",
      "comment": "This feast anticipates the Eucharist, where the faithful are spiritually fed. The ‘poor’ are blessed—a persistent Gospel theme."
    },
    {
      "pk": 22022027,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 27,
      "text": "All the ends of the earth shall remember and turn to the LORD, and all the families of the nations shall worship before you.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/23/2/2-3'>Isa. 2:2–3</a>",
      "comment": "A prophecy of the worldwide worship brought about through Christ—the Church as the sacrament of unity for all peoples."
    },
    {
      "pk": 22022028,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 28,
      "text": "For dominion belongs to the LORD, and he rules over the nations.",
      "links": "<a href='/AIV/19/47/8'>Ps. 47:8</a>",
      "comment": "God's universal kingship is affirmed—fulfilled in Christ the King, an important Catholic feast."
    },
    {
      "pk": 22022029,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 29,
      "text": "All the prosperous of the earth shall eat and worship; before him shall bow all who go down to the dust, even the one who cannot keep himself alive.",
      "links": "<a href='/AIV/50/2/10'>Phil. 2:10</a>",
      "comment": "Universal worship is envisioned—an allusion to the Resurrection, when every knee shall bow."
    },
    {
      "pk": 22022030,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 30,
      "text": "Descendants shall serve him; the coming generation will be told about the Lord.",
      "links": "<a href='/AIV/19/102/18'>Ps. 102:18</a>",
      "comment": "Perpetuity of God’s praise reflects the Catholic understanding of Tradition—faith handed down anew in every generation."
    },
    {
      "pk": 22022031,
      "translation": "AIV",
      "book": 19,
      "chapter": 22,
      "verse": 31,
      "text": "They will come and announce his righteousness; to a people yet unborn, that he has done it.",
      "links": "<a href='/AIV/23/41/4'>Isa. 41:4</a>",
      "comment": "The final declaration: 'He has done it!'—fulfilled in Christ’s words ‘It is finished’ (John 19:30). The Church continues to proclaim this salvation to all generations through Word and Sacrament."
    }
  ],
  "translatedAt": "2025-12-22T21:27:27.262Z"
}