{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 108,
  "verses": [
    {
      "pk": 1910801,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 1,
      "text": "My heart is steadfast, God; I will sing and make music with all my soul.",
      "links": "<a href='/AIV/19/57/7'>Ps. 57:7</a>; <a href='/AIV/19/30/12'>Ps. 30:12</a>",
      "comment": "This verse mirrors Psalm 57:7, emphasizing complete trust in God and the resolve to worship wholeheartedly. The spiritual interpretation hints at interior transformation, a theme prominent in Christian spirituality."
    },
    {
      "pk": 1910802,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 2,
      "text": "Awake, harp and lyre! I will awaken the dawn.",
      "links": "<a href='/AIV/19/57/8'>Ps. 57:8</a>",
      "comment": "Echoes Psalm 57:8, conveying eagerness to praise God at the earliest hour, showing that true worship involves full engagement of both body and spirit."
    },
    {
      "pk": 1910803,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 3,
      "text": "I will give thanks to you among the peoples, LORD; I will sing praises to you among the nations.",
      "links": "<a href='/AIV/19/18/49'>Ps. 18:49</a>; <a href='/AIV/19/57/9'>Ps. 57:9</a>; <a href='/AIV/45/15/9'>Rom. 15:9</a>",
      "comment": "Global praise anticipates the Messiah drawing all nations to Himself. See Romans 15:9, where this is fulfilled in the gospel extending beyond Israel. This unity of peoples in worship hints at the universal scope of salvation."
    },
    {
      "pk": 1910804,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 4,
      "text": "For your steadfast love is great above the heavens and your faithfulness reaches to the clouds.",
      "links": "<a href='/AIV/19/36/5'>Ps. 36:5</a>; <a href='/AIV/19/57/10'>Ps. 57:10</a>",
      "comment": "God's covenantal love extends beyond human understanding. The steadfast love described here is echoed in John 3:16 and shown perfectly in the person of Christ."
    },
    {
      "pk": 1910805,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 5,
      "text": "Be exalted, O God, above the heavens! Let your glory be over all the earth.",
      "links": "<a href='/AIV/19/57/11'>Ps. 57:11</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Echoes themes of divine majesty and universality. This prayer for worldwide acknowledgment of God anticipates the fullness of God's kingdom."
    },
    {
      "pk": 1910806,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 6,
      "text": "Save us by your right hand and answer me, so that those you love may be delivered.",
      "links": "<a href='/AIV/19/60/5'>Ps. 60:5</a>; <a href='/AIV/19/17/7'>Ps. 17:7</a>",
      "comment": "The 'right hand' is often a symbol of God's power and authority (see Exodus 15:6); spiritual interpretation points to Christ as God's saving hand, through whom deliverance arrives."
    },
    {
      "pk": 1910807,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 7,
      "text": "God has spoken in his holiness: 'With triumph I will divide Shechem and measure out the Valley of Succoth.'",
      "links": "<a href='/AIV/19/60/6'>Ps. 60:6</a>; <a href='/AIV/06/24/32'>Josh. 24:32</a>",
      "comment": "God's declaration of sovereignty over the promised land signifies fulfillment of His promises. Spiritual interpretation points to God's authority to distribute spiritual inheritance in the Church."
    },
    {
      "pk": 1910808,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 8,
      "text": "'Gilead is mine; Manasseh is mine; Ephraim is the helmet for my head; Judah is my scepter.'",
      "links": "<a href='/AIV/19/60/7'>Ps. 60:7</a>; <a href='/AIV/01/49/10'>Gen. 49:10</a>",
      "comment": "These tribal territories symbolize the unity and authority of God's people. Judah as the scepter aligns with Genesis 49:10, a prophecy of the Messiah's royal lineage."
    },
    {
      "pk": 1910809,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 9,
      "text": "'Moab is my washbasin; upon Edom I will cast my shoe; over Philistia I shout in triumph.'",
      "links": "<a href='/AIV/19/60/8'>Ps. 60:8</a>; <a href='/AIV/04/24/17-18'>Num. 24:17–18</a>",
      "comment": "Moab and Edom symbolically subjected; Philistia overcome. This points to God's final victory over His enemies and hints at spiritual subjection of sin and death achieved through Christ."
    },
    {
      "pk": 1910810,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 10,
      "text": "Who will bring me to the fortified city? Who will lead me to Edom?",
      "links": "<a href='/AIV/19/60/9'>Ps. 60:9</a>; <a href='/AIV/10/12/26'>2 Sam. 12:26–31</a>",
      "comment": "Reflects dependence on God for victory. Spiritually, it highlights the need for divine guidance, a motif echoed in the teachings on spiritual warfare (see Ephesians 6:10–17)."
    },
    {
      "pk": 1910811,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 11,
      "text": "Have you not rejected us, God? And do you not go out, God, with our armies?",
      "links": "<a href='/AIV/19/60/10'>Ps. 60:10</a>; <a href='/AIV/07/6/13'>Judg. 6:13</a>",
      "comment": "Recalls moments of divine discipline and apparent abandonment, but underlying is the call to faith and perseverance, seen in Hebrews 12:6."
    },
    {
      "pk": 1910812,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 12,
      "text": "Grant us help against the enemy, for human help is worthless.",
      "links": "<a href='/AIV/19/60/11'>Ps. 60:11</a>; <a href='/AIV/19/146/3'>Ps. 146:3</a>",
      "comment": "Underscores the limitations of human strength. This reliance on divine grace is foundational for Christian life and hints at dependence on the sacraments and prayer for spiritual victory."
    },
    {
      "pk": 1910813,
      "translation": "AIV",
      "book": 19,
      "chapter": 108,
      "verse": 13,
      "text": "With God we shall do valiantly; he will trample down our enemies.",
      "links": "<a href='/AIV/19/60/12'>Ps. 60:12</a>; <a href='/AIV/45/8/37'>Rom. 8:37</a>",
      "comment": "Victory belongs to God and His people; ultimate spiritual victory comes through Christ (see Romans 8:37). This promises both literal deliverance and spiritual triumph over evil in the present age."
    }
  ],
  "translatedAt": "2025-12-23T05:41:15.803Z"
}