{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 11,
  "verses": [
    {
      "pk": 23011001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 1,
      "text": "In the LORD I take refuge. How can you say to my soul, 'Flee to your mountain like a bird'?",
      "links": "<a href='/AIV/19/4/8'>Ps. 4:8</a>; <a href='/AIV/19/16/1'>Ps. 16:1</a>; <a href='/AIV/19/31/1'>Ps. 31:1</a>",
      "comment": "This verse expresses a steadfast trust in the LORD as a place of security, even when others counsel fear or flight. The metaphor of fleeing like a bird alludes to seeking refuge elsewhere, but the psalmist insists true safety is in the LORD. Compare with <a href='/AIV/19/4/8'>Ps. 4:8</a>, which speaks to a similar trust. Here, 'soul' indicates the inner self, showing a deep level of trust beyond outward circumstances—hinting at a spiritual rest that foreshadows Christ's call to find rest in Him (cf. <a href='/AIV/40/11/28'>Matt. 11:28</a>)."
    },
    {
      "pk": 23011002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 2,
      "text": "For behold, the wicked bend the bow; they set their arrow on the string to shoot in darkness at the upright in heart.",
      "links": "<a href='/AIV/19/7/12'>Ps. 7:12</a>; <a href='/AIV/19/37/14'>Ps. 37:14</a>; <a href='/AIV/19/64/3-4'>Ps. 64:3-4</a>",
      "comment": "This describes the threat from the wicked, ready to strike in secrecy against those who are righteous. The phrase 'upright in heart' points to inner righteousness, not just outward actions, a recurring theme fulfilled in Christ and echoed by the Apostles as the character of true followers (<a href='/AIV/40/5/8'>Matt. 5:8</a>). There is also an implicit call to persevere in holiness, even under persecution—a trait emphasized for the faithful community."
    },
    {
      "pk": 23011003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 3,
      "text": "When the foundations are destroyed, what can the righteous do?",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>; <a href='/AIV/23/24/18-20'>Isa. 24:18-20</a>",
      "comment": "This rhetorical question highlights the seriousness of societal collapse. 'Foundations' refers to moral or social order, suggesting that only with proper spiritual foundations can the righteous endure. Early Christian interpreters saw in this verse a foreshadowing of the unshakable foundation that Christ establishes for His people (<a href='/AIV/40/7/24-25'>Matt. 7:24-25</a>), reminding believers to build on solid ground through both faith and good works."
    },
    {
      "pk": 23011004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 4,
      "text": "The LORD is in his holy temple; the LORD's throne is in heaven. His eyes see, his eyelids test the children of man.",
      "links": "<a href='/AIV/19/2/4'>Ps. 2:4</a>; <a href='/AIV/19/103/19'>Ps. 103:19</a>; <a href='/AIV/66/21/22'>Rev. 21:22</a>",
      "comment": "This highlights God's sovereign authority, transcending anything earthly. 'Holy temple' may mean both the earthly sanctuary and the heavenly reality it represents. The LORD's continual gaze and testing of humankind implies ongoing judgment and care, alluding to the idea that worship and sacrifice are to focus on the divine presence, not just earthly symbols. See <a href='/AIV/58/9/24'>Heb. 9:24</a> for the spiritual temple motif fulfilled through Christ's ministry in the heavenly sanctuary."
    },
    {
      "pk": 23011005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 5,
      "text": "The LORD tests the righteous, but his soul hates the wicked and the one who loves violence.",
      "links": "<a href='/AIV/19/7/9'>Ps. 7:9</a>; <a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/20/17/3'>Prov. 17:3</a>",
      "comment": "God allows the righteous to be tested, echoing the tradition of God refining His people like gold (<a href='/AIV/20/17/3'>Prov. 17:3</a>), and promises ultimate vindication. The strong language about hating evil emphasizes God's holiness and His demand for justice, characteristics illuminated in the teachings of Jesus and the apostles (<a href='/AIV/40/25/41'>Matt. 25:41</a>)."
    },
    {
      "pk": 23011006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 6,
      "text": "On the wicked he will rain snares; fire and sulfur and a scorching wind shall be the portion of their cup.",
      "links": "<a href='/AIV/19/18/13'>Ps. 18:13</a>; <a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/1/19/24'>Gen. 19:24</a>",
      "comment": "The imagery recalls God's judgment on Sodom and Gomorrah (<a href='/AIV/1/19/24'>Gen. 19:24</a>). The 'cup' is a biblical symbol for one's destiny or lot, later used by Jesus when referring to His passion (<a href='/AIV/42/22/42'>Luke 22:42</a>). There is a theme here that judgment is a natural consequence for rejecting God's ways, reinforcing the concept of divine justice."
    },
    {
      "pk": 23011007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 11,
      "verse": 7,
      "text": "For the LORD is righteous; he loves righteous deeds; the upright will see his face.",
      "links": "<a href='/AIV/19/17/15'>Ps. 17:15</a>; <a href='/AIV/19/24/6'>Ps. 24:6</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>; <a href='/AIV/66/22/4'>Rev. 22:4</a>",
      "comment": "The promise to 'see his face' foreshadows the ultimate hope of direct communion with the LORD, a theme that is fully realized in New Testament revelation (<a href='/AIV/66/22/4'>Rev. 22:4</a>). The connection between righteousness and seeing God points to both faith and works together, reflecting the all-encompassing call to holiness. There is a spiritual sense here that God's grace draws His people into full and lasting fellowship with Him."
    }
  ],
  "translatedAt": "2025-12-24T06:02:18.064Z"
}