{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 111,
  "verses": [
    {
      "pk": 1110110,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 1,
      "text": "Hallelujah! I will give thanks to the LORD with all my heart, in the company of the upright, in the congregation.",
      "links": "<a href='/AIV/19/9/1'>Ps. 9:1</a>; <a href='/AIV/19/35/18'>Ps. 35:18</a>; <a href='/AIV/19/22/25'>Ps. 22:25</a>",
      "comment": "The psalm begins with a call to praise (Hallelujah). Expressing thanksgiving with 'all my heart' and among the assembly is significant, echoing worship both privately and publicly—a theme fulfilled in Christian tradition, where worship is both personal and communal. The Hebrew 'congregation' ('edah) can point to an assembly gathered for worship, foreshadowing Christian liturgical gatherings."
    },
    {
      "pk": 1110111,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 2,
      "text": "The works of the LORD are great, studied by all who delight in them.",
      "links": "<a href='/AIV/19/92/5'>Ps. 92:5</a>; <a href='/AIV/19/145/4'>Ps. 145:4-6</a>",
      "comment": "This verse highlights meditative study of God's actions. The invitation to contemplate the works of God underlies the importance of tradition, reason, and reflection in faith. All who love God are called to ponder deeply His deeds, aligning faith with understanding (see <a href='/AIV/19/77/12'>Ps. 77:12</a>)."
    },
    {
      "pk": 1110112,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 3,
      "text": "Majesty and splendor are his work, and his righteousness endures forever.",
      "links": "<a href='/AIV/19/145/5'>Ps. 145:5</a>; <a href='/AIV/19/119/142'>Ps. 119:142</a>",
      "comment": "References to God's enduring righteousness are foundational and point to the eternal nature of God’s justice and mercy. These qualities are fully revealed in Christ, the embodiment of God's righteousness (see <a href='/AIV/45/3/21-22'>Rom. 3:21-22</a>)."
    },
    {
      "pk": 1110113,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 4,
      "text": "He has caused his wonders to be remembered; the LORD is gracious and full of compassion.",
      "links": "<a href='/AIV/19/145/8'>Ps. 145:8</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "God’s miracles and saving acts are meant to be recalled continually, which becomes explicit in Christian worship and the eucharist, as Christ commands, 'Do this in remembrance of me.' The line 'gracious and full of compassion' echoes language used throughout the Old Testament for God's mercy."
    },
    {
      "pk": 1110114,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 5,
      "text": "He gives food to those who fear him; he remembers his covenant forever.",
      "links": "<a href='/AIV/19/145/15'>Ps. 145:15</a>; <a href='/AIV/2/16/15'>Ex. 16:15</a>; <a href='/AIV/19/105/8'>Ps. 105:8</a>",
      "comment": "'Food' recalls the manna in the wilderness and points forward to the true bread given by Christ (see <a href='/AIV/43/6/32-35'>John 6:32-35</a>). The eternal covenant reflects the unbroken bond God maintains with humanity, fulfilled in the new covenant."
    },
    {
      "pk": 1110115,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 6,
      "text": "He has shown his people the power of his works, giving them the inheritance of the nations.",
      "links": "<a href='/AIV/19/105/44'>Ps. 105:44</a>; <a href='/AIV/19/2/8'>Ps. 2:8</a>",
      "comment": "The inheritance of the nations is ultimately fulfilled in the kingdom established by Christ, who brings all peoples into one family. Early Christians saw this fulfilled as Gentiles were brought into the promises given to Israel."
    },
    {
      "pk": 1110116,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 7,
      "text": "The works of his hands are faithful and just; all his precepts are trustworthy.",
      "links": "<a href='/AIV/19/119/138'>Ps. 119:138</a>; <a href='/AIV/19/33/4'>Ps. 33:4</a>",
      "comment": "Here, the psalmist connects God’s acts with his revealed commands. The trustworthy precepts are linked to God's moral law, which Christ came not to abolish but to fulfill (<a href='/AIV/40/5/17'>Matt. 5:17</a>), showing the continuity of the Old and New Covenants."
    },
    {
      "pk": 1110117,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 8,
      "text": "They are established forever and ever, enacted in faithfulness and uprightness.",
      "links": "<a href='/AIV/19/119/160'>Ps. 119:160</a>",
      "comment": "God’s statutes are permanent, reflecting the unchanging moral and spiritual truths binding the faithful in every age. This permanence previews the unbroken, living tradition sustained from the beginning of the Church."
    },
    {
      "pk": 1110118,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 9,
      "text": "He sent redemption to his people; he has commanded his covenant forever. Holy and awesome is his name.",
      "links": "<a href='/AIV/19/130/7-8'>Ps. 130:7-8</a>; <a href='/AIV/19/99/3'>Ps. 99:3</a>",
      "comment": "Redemption accomplished through God’s intervention prefigures the ultimate redemption in Christ, who establishes a covenant that will not pass away (<a href='/AIV/58/9/12'>Heb. 9:12</a>). 'Holy and awesome is his name' calls the faithful to reverence the Lord, which the New Testament sees embodied in Christ's saving name."
    },
    {
      "pk": 1110119,
      "translation": "AIV",
      "book": 19,
      "chapter": 111,
      "verse": 10,
      "text": "The fear of the LORD is the beginning of wisdom; all who follow his commandments have good understanding. His praise endures forever.",
      "links": "<a href='/AIV/20/1/7'>Prov. 1:7</a>; <a href='/AIV/19/112/1'>Ps. 112:1</a>",
      "comment": "True wisdom begins with awe and submission to God—a major theme developed throughout Scripture (see <a href='/AIV/59/3/13-17'>James 3:13-17</a>). The link between obedience and understanding prefigures New Testament teaching that love for God is shown in keeping his commandments (<a href='/AIV/43/14/15'>John 14:15</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:42:07.940Z"
}