{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 85,
  "verses": [
    {
      "pk": 1985085,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 1,
      "text": "O LORD, you showed favor to your land; you restored the fortunes of Jacob.",
      "links": "<a href='/AIV/19/126/1'>Ps. 126:1</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "The opening recalls God's gracious dealings with Israel, setting the tone for hope and restoration, foundational themes throughout the Psalms. Jacob stands as the covenant figure, echoing God's faithfulness to His promises."
    },
    {
      "pk": 1985086,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 2,
      "text": "You forgave the guilt of your people; you covered all their sin. Selah.",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1</a>; <a href='/AIV/19/103/12'>Ps. 103:12</a>",
      "comment": "The language of forgiveness and atonement points to God's merciful nature, foreshadowing New Testament redemption in Christ (see Rom. 3:25). The covering of sin evokes liturgical atonement—anticipating the sacramental life of the Church. 'Selah' invites contemplation of this mercy."
    },
    {
      "pk": 1985087,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 3,
      "text": "You withdrew all your wrath; you turned from your burning anger.",
      "links": "<a href='/AIV/19/78/38'>Ps. 78:38</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "God's turning away of wrath shows His justice and mercy in perfect harmony, which Catholic theology interprets through the lens of God's paternal care and the necessity of repentance."
    },
    {
      "pk": 1985088,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 4,
      "text": "Restore us, O God of our salvation, and put away your indignation toward us.",
      "links": "<a href='/AIV/19/80/3'>Ps. 80:3</a>; <a href='/AIV/19/51/12'>Ps. 51:12</a>",
      "comment": "The plea for restoration highlights God as the source of salvation, a theme fulfilled in Christ—the definitive restorer. The Catholic understanding stresses participation in salvation through grace and sacraments."
    },
    {
      "pk": 1985089,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 5,
      "text": "Will you be angry with us forever? Will you prolong your wrath to all generations?",
      "links": "<a href='/AIV/19/74/1'>Ps. 74:1</a>; <a href='/AIV/19/77/7'>Ps. 77:7</a>",
      "comment": "These questions express human longing for relational reconciliation, which is paradigmatic of confessional practice and penance—echoes of Catholic spirituality and trust in God's enduring mercy."
    },
    {
      "pk": 1985090,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 6,
      "text": "Will you not revive us again, that your people may rejoice in you?",
      "links": "<a href='/AIV/19/71/20'>Ps. 71:20</a>; <a href='/AIV/19/80/18'>Ps. 80:18</a>",
      "comment": "Revival is both literal and spiritual, anticipating not only national restoration but the renewal of hearts—a Catholic interpretive tradition recognizes such renewal through the grace poured out in the Church."
    },
    {
      "pk": 1985091,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 7,
      "text": "Show us your steadfast love, LORD, and grant us your salvation.",
      "links": "<a href='/AIV/19/25/6'>Ps. 25:6</a>; <a href='/AIV/19/86/15'>Ps. 86:15</a>",
      "comment": "The Hebrew 'hesed' (steadfast love) underlines covenantal fidelity, which Catholics see fulfilled perfectly in Christ’s sacrifice. Salvation here is comprehensive, touching both temporal and eternal needs."
    },
    {
      "pk": 1985092,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 8,
      "text": "I will listen to what God the LORD will speak, for he will speak peace to his people, to his faithful ones—yet let them not turn back to folly.",
      "links": "<a href='/AIV/19/29/11'>Ps. 29:11</a>; <a href='/AIV/19/34/14'>Ps. 34:14</a>",
      "comment": "Hearing God is central to spiritual life; in Catholic tradition, this includes Scripture and Sacred Tradition. Peace ('shalom') is the presence of fullness in God, warning against relapse into sin—hinting at the call to ongoing conversion."
    },
    {
      "pk": 1985093,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 9,
      "text": "Surely his salvation is near to those who fear him, that glory may dwell in our land.",
      "links": "<a href='/AIV/19/24/7'>Ps. 24:7-10</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Glory dwelling among us alludes to God's Shekinah presence. Catholic liturgy sees this fulfilled most tangibly in the Eucharist, God’s glory manifesting through Christ's real presence."
    },
    {
      "pk": 1985094,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 10,
      "text": "Steadfast love and faithfulness meet; righteousness and peace kiss each other.",
      "links": "<a href='/AIV/19/89/14'>Ps. 89:14</a>; <a href='/AIV/19/72/7'>Ps. 72:7</a>; <a href='/AIV/40/5/9'>Matt. 5:9</a>",
      "comment": "This poetic vision finds fulfillment in Christ—the union of justice and mercy (see Rom. 3:26), especially in the Incarnation and Cross. It's also a picture of the Church as the meeting place of God’s attributes."
    },
    {
      "pk": 1985095,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 11,
      "text": "Faithfulness springs up from the earth, and righteousness looks down from heaven.",
      "links": "<a href='/AIV/19/72/6'>Ps. 72:6</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "An image of vertical and horizontal righteousness, fulfilled as the Word became flesh—heaven meeting earth in Christ (John 1:14). Catholic interpretation sees in this the sacramental reality: God’s grace coming to us physically."
    },
    {
      "pk": 1985096,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 12,
      "text": "Indeed, the LORD will give what is good, and our land will yield its increase.",
      "links": "<a href='/AIV/19/67/6'>Ps. 67:6</a>; <a href='/AIV/19/107/37'>Ps. 107:37</a>",
      "comment": "This touches on God’s providence and blessing, both material and spiritual. In Catholic practice, blessings are sacramental—outward signs of God’s inner grace, a subtle nod to the Church's lived liturgy."
    },
    {
      "pk": 1985097,
      "translation": "AIV",
      "book": 19,
      "chapter": 85,
      "verse": 13,
      "text": "Righteousness will go before him and make a path for his footsteps.",
      "links": "<a href='/AIV/19/89/14'>Ps. 89:14</a>; <a href='/AIV/23/40/3'>Isa. 40:3</a>; <a href='/AIV/40/3/3'>Matt. 3:3</a>",
      "comment": "The final verse is deeply messianic, prefiguring John the Baptist’s message (Isa. 40:3; Matt. 3:3) and the coming of Christ. Catholic tradition reads this as the Church’s call to prepare the way for Christ, both in history and in each believer’s heart."
    }
  ],
  "translatedAt": "2025-12-22T21:47:09.129Z"
}