{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 91,
  "verses": [
    {
      "pk": 23091001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 1,
      "text": "He who dwells in the shelter of the Most High will rest in the shadow of the Almighty.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>; <a href='/AIV/19/121/5'>Ps. 121:5</a>; <a href='/AIV/19/31/20'>Ps. 31:20</a>",
      "comment": "The imagery of 'shelter' and 'shadow' suggests spiritual safety and communion with God, reminiscent of God's protection over His people. The use of 'Most High' and 'Almighty' reflects deep reverence, linking to Genesis 14:18-20. Early Christian interpreters often saw this verse as foreshadowing union with Christ, in whom believers find true refuge."
    },
    {
      "pk": 23091002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 2,
      "text": "I will say to the Lord, 'You are my refuge and my fortress, my God, in whom I trust.'",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/31/3'>Ps. 31:3</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "Trust in God as both 'refuge' and 'fortress' highlights the Psalmist's confidence in divine protection. Understood spiritually, believers are called to profess faith in God as their defender, a disposition deepened through prayer and devotion."
    },
    {
      "pk": 23091003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 3,
      "text": "Surely He will rescue you from the snare of the fowler and from the deadly pestilence.",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>; <a href='/AIV/19/141/9-10'>Ps. 141:9-10</a>",
      "comment": "A 'fowler's snare' represents hidden spiritual dangers, while 'pestilence' suggests destructive evils. Ancient commentators see this as symbolic of deliverance from temptation and spiritual death. The promise points to God's active intervention."
    },
    {
      "pk": 23091004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 4,
      "text": "He will cover you with His feathers; under His wings you will find refuge; His faithfulness is a shield and buckler.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "The tender protection of God's 'wings' recalls motherly care; later fulfilled when Jesus laments over Jerusalem (Matt. 23:37). The imagery of shield and buckler underlines unshakable security offered by God's fidelity."
    },
    {
      "pk": 23091005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 5,
      "text": "You will not fear the terror of the night, nor the arrow that flies by day;",
      "links": "<a href='/AIV/19/121/6'>Ps. 121:6</a>; <a href='/AIV/19/64/4'>Ps. 64:4</a>",
      "comment": "Assurance against both hidden and overt dangers. Traditional interpretation sees spiritual meaning: believers trusting God are guarded against both visible and invisible harms, echoing themes in Ephesians 6:11-16 about the armor of God."
    },
    {
      "pk": 23091006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 6,
      "text": "Nor the pestilence that stalks in darkness, nor the destruction that lays waste at noonday.",
      "links": "<a href='/AIV/19/121/6'>Ps. 121:6</a>; <a href='/AIV/24/14/12'>Jer. 14:12</a>",
      "comment": "'Pestilence' and 'destruction' extend the scope of God's protection to all circumstances. Spiritual commentators interpret this line as promise of deliverance through God's grace, both in times of difficulty and in the face of spiritual evil."
    },
    {
      "pk": 23091007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 7,
      "text": "A thousand may fall at your side, and ten thousand at your right hand, but it will not come near you.",
      "links": "<a href='/AIV/19/3/6'>Ps. 3:6</a>; <a href='/AIV/19/27/3'>Ps. 27:3</a>",
      "comment": "A dramatic affirmation of shielding grace. For believers, this illustrates God's personal care and the promise that faith sets one apart, even amidst widespread calamity. It suggests special favor upon those who abide in Him."
    },
    {
      "pk": 23091008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 8,
      "text": "You will only look with your eyes and see the recompense of the wicked.",
      "links": "<a href='/AIV/19/37/34'>Ps. 37:34</a>; <a href='/AIV/19/92/11'>Ps. 92:11</a>",
      "comment": "Assurance that the faithful will witness justice and the vindication of God. This verse connects to eschatological hopes where God establishes perfect order, hinting at final judgment and the enduring hope in divine justice."
    },
    {
      "pk": 23091009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 9,
      "text": "Because you have made the Lord your dwelling— the Most High, who is my refuge—",
      "links": "<a href='/AIV/19/90/1'>Ps. 90:1</a>; <a href='/AIV/19/71/3'>Ps. 71:3</a>",
      "comment": "Stresses voluntary choice to dwell with God. The idea of God as 'dwelling' touches on both individual and communal aspects of faith, reminiscent of the indwelling Spirit (John 14:23) and the invitation to remain in Christ."
    },
    {
      "pk": 23091010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 10,
      "text": "No evil shall befall you, nor shall any plague come near your tent.",
      "links": "<a href='/AIV/19/121/7'>Ps. 121:7</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/2/12/13'>Exod. 12:13</a>",
      "comment": "Echoes the Passover (Exod. 12:13) where God's protection covers His people. Not merely literal, but points to spiritual safeguarding, reflecting the merits acquired through living a life surrendered to God and the blessings of being set apart."
    },
    {
      "pk": 23091011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 11,
      "text": "For He will command His angels concerning you, to guard you in all your ways.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/40/4/6'>Matt. 4:6</a>; <a href='/AIV/19/103/20'>Ps. 103:20</a>",
      "comment": "Cited by Satan in Jesus’ temptation (Matt. 4:6), this verse points to angelic protection, highlighting the belief in ministering spirits assigned to believers. Can be read as both literal and symbolic of God’s invisible guidance."
    },
    {
      "pk": 23091012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 12,
      "text": "They will lift you up in their hands, so that you will not strike your foot against a stone.",
      "links": "<a href='/AIV/40/4/6'>Matt. 4:6</a>; <a href='/AIV/19/121/3'>Ps. 121:3</a>",
      "comment": "A promise of protection from stumbling—both physically and spiritually. In Christian tradition, this foreshadows the grace given to withstand sin and temptation, especially through divine support and intercessory help."
    },
    {
      "pk": 23091013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 13,
      "text": "You will tread on the lion and the cobra; you will trample the young lion and the serpent underfoot.",
      "links": "<a href='/AIV/19/74/13'>Ps. 74:13</a>; <a href='/AIV/42/10/19'>Luke 10:19</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "Echoes Genesis 3:15 and Luke 10:19, signifying authority given to the faithful over evil. Symbolically, Christ triumphs over Satan and sin; spiritually, followers share this victory through participation in His life."
    },
    {
      "pk": 23091014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 14,
      "text": "'Because he loves Me, I will rescue him; I will protect him, for he knows My name.'",
      "links": "<a href='/AIV/19/9/10'>Ps. 9:10</a>; <a href='/AIV/19/145/18'>Ps. 145:18</a>",
      "comment": "God’s response to faithful love: promise of rescue and protection. ‘Knows My name’ suggests deep relationship and personal devotion, as developed through prayer and continual seeking of God's will."
    },
    {
      "pk": 23091015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 15,
      "text": "When he calls to Me, I will answer him; I will be with him in trouble; I will deliver him and honor him.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/19/34/17'>Ps. 34:17</a>; <a href='/AIV/19/60/12'>Ps. 60:12</a>",
      "comment": "Divine assurance of response to prayer and presence in hardship. The promise to 'honor' reflects God’s intimate compassion and the spiritual elevation of those steadfast in faith, drawing them closer into union with Himself."
    },
    {
      "pk": 23091016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 91,
      "verse": 16,
      "text": "With long life I will satisfy him and show him My salvation.",
      "links": "<a href='/AIV/19/21/4'>Ps. 21:4</a>; <a href='/AIV/19/50/23'>Ps. 50:23</a>; <a href='/AIV/23/52/10'>Isa. 52:10</a>",
      "comment": "'Salvation' viewed spiritually refers to eternal life in communion with God. The promise of 'long life' is fulfillment, not just materially, but ultimately shown in Christ, who brings everlasting life to those who follow Him."
    }
  ],
  "translatedAt": "2025-12-24T06:31:46.938Z"
}