{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 147,
  "verses": [
    {
      "pk": 2147140,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 1,
      "text": "Praise the LORD! For it is good to sing praises to our God; for it is pleasant, and praise is fitting.",
      "links": "<a href='/AIV/19/92/1'>Ps. 92:1</a>; <a href='/AIV/19/135/3'>Ps. 135:3</a>",
      "comment": "The psalm begins with an exhortation to joyful praise. The idea of praise being 'fitting' echoes the human response to God's goodness, a theme central throughout Scripture."
    },
    {
      "pk": 2147141,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 2,
      "text": "The LORD builds up Jerusalem; he gathers the scattered of Israel.",
      "links": "<a href='/AIV/23/11/12'>Isa. 11:12</a>; <a href='/AIV/19/102/16'>Ps. 102:16</a>",
      "comment": "God's gathering of Israel foresees the fulfillment of promises of restoration. Spiritually, building Jerusalem hints at God's plan to unite His people, prefiguring the Church as spiritual Israel (see Eph. 2:19-22)."
    },
    {
      "pk": 2147142,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 3,
      "text": "He heals the brokenhearted, and binds up their wounds.",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>; <a href='/AIV/42/4/18'>Luke 4:18</a>",
      "comment": "This verse foreshadows Christ’s ministry to the wounded and the broken, as quoted by Jesus in Luke 4:18, showing the fulfillment of prophecy and highlighting God’s merciful compassion."
    },
    {
      "pk": 2147143,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 4,
      "text": "He counts the number of the stars; he gives names to all of them.",
      "links": "<a href='/AIV/01/15/5'>Gen. 15:5</a>; <a href='/AIV/23/40/26'>Isa. 40:26</a>",
      "comment": "God’s sovereignty and intimate care are shown in His knowledge of creation, recalling His covenant with Abraham and promises reaching fulfillment in Christ."
    },
    {
      "pk": 2147144,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 5,
      "text": "Great is our Lord, and abundant in power; his understanding is beyond measure.",
      "links": "<a href='/AIV/19/145/3'>Ps. 145:3</a>; <a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "Echoing God’s infinite wisdom as seen in both Old and New Testaments; such descriptions encourage awe and humble trust."
    },
    {
      "pk": 2147145,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 6,
      "text": "The LORD lifts up the humble; he casts the wicked down to the ground.",
      "links": "<a href='/AIV/19/146/8-9'>Ps. 146:8-9</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "A theme reminiscent of Christ’s teaching: those who are humble are lifted up, foreshadowing the reversal of worldly status in God’s kingdom."
    },
    {
      "pk": 2147146,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 7,
      "text": "Sing to the LORD with thanksgiving; make melody to our God on the harp.",
      "links": "<a href='/AIV/19/33/2'>Ps. 33:2</a>; <a href='/AIV/19/95/2'>Ps. 95:2</a>",
      "comment": "The worship of God in song and thanksgiving is a practice that continues from temple worship to the ongoing tradition of liturgical praise."
    },
    {
      "pk": 2147147,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 8,
      "text": "He covers the heavens with clouds, prepares rain for the earth, makes grass grow on the hills.",
      "links": "<a href='/AIV/18/5/10'>Job 5:10</a>; <a href='/AIV/40/5/45'>Matt. 5:45</a>",
      "comment": "God’s providence in nature points to His sustaining power; an image often used to highlight His continual care."
    },
    {
      "pk": 2147148,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 9,
      "text": "He gives to the beasts their food, and to the young ravens that cry.",
      "links": "<a href='/AIV/18/38/41'>Job 38:41</a>; <a href='/AIV/40/6/26'>Matt. 6:26</a>",
      "comment": "A reminder of God’s intimate provision and concern for all creation, paralleling Jesus' teaching on God’s care."
    },
    {
      "pk": 2147149,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 10,
      "text": "He does not delight in the strength of the horse nor take pleasure in the legs of a man.",
      "links": "<a href='/AIV/19/33/16-17'>Ps. 33:16-17</a>",
      "comment": "God’s favor is not earned by physical strength or human achievement, contrasting with worldly measures of value."
    },
    {
      "pk": 2147150,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 11,
      "text": "The LORD takes pleasure in those who fear him, in those who hope in his steadfast love.",
      "links": "<a href='/AIV/19/33/18'>Ps. 33:18</a>; <a href='/AIV/20/8/13'>Prov. 8:13</a>",
      "comment": "Emphasizes reverence and trust in God above all else; the theme of faith and hope is central to the Christian life."
    },
    {
      "pk": 2147151,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 12,
      "text": "Praise the LORD, O Jerusalem! Praise your God, O Zion!",
      "links": "<a href='/AIV/19/135/21'>Ps. 135:21</a>; <a href='/AIV/23/12/6'>Isa. 12:6</a>",
      "comment": "A call to worship addressed to God’s chosen city, now spiritually understood as representing those united in worship."
    },
    {
      "pk": 2147152,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 13,
      "text": "For he strengthens the bars of your gates; he blesses your children within you.",
      "links": "<a href='/AIV/19/122/7'>Ps. 122:7</a>; <a href='/AIV/05/28/4'>Deut. 28:4</a>",
      "comment": "God’s protection and blessing extend to community, prefiguring divine safeguarding of believers and their families."
    },
    {
      "pk": 2147153,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 14,
      "text": "He makes peace within your borders; he fills you with the finest wheat.",
      "links": "<a href='/AIV/19/81/16'>Ps. 81:16</a>; <a href='/AIV/19/132/15'>Ps. 132:15</a>",
      "comment": "Speaks of both physical and spiritual peace and provision—a theme fulfilled in Christ, the true Bread from heaven (John 6:32-35)."
    },
    {
      "pk": 2147154,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 15,
      "text": "He sends out his command to the earth; his word runs swiftly.",
      "links": "<a href='/AIV/19/33/9'>Ps. 33:9</a>; <a href='/AIV/23/55/11'>Isa. 55:11</a>",
      "comment": "God’s Word is active and effective, a concept central to understanding the power of Scripture and its fulfillment in the living Word, Christ."
    },
    {
      "pk": 2147155,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 16,
      "text": "He gives snow like wool; he scatters frost like ashes.",
      "links": "<a href='/AIV/18/37/6'>Job 37:6</a>",
      "comment": "God’s control over nature symbolizes purity and transformation, both literal and spiritual."
    },
    {
      "pk": 2147156,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 17,
      "text": "He throws down his hail like crumbs; who can withstand his cold?",
      "links": "<a href='/AIV/02/9/24'>Ex. 9:24</a>",
      "comment": "Shows God’s power and the limitations of human strength in the face of His might."
    },
    {
      "pk": 2147157,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 18,
      "text": "He sends out his word and melts them; he causes his wind to blow, and the waters flow.",
      "links": "<a href='/AIV/19/107/20'>Ps. 107:20</a>; <a href='/AIV/19/104/7'>Ps. 104:7'>",
      "comment": "The power of God’s word is able to change and renew all creation, echoing themes of spiritual renewal and the efficacy of God’s commands."
    },
    {
      "pk": 2147158,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 19,
      "text": "He declares his word to Jacob, his statutes and ordinances to Israel.",
      "links": "<a href='/AIV/19/103/7'>Ps. 103:7</a>; <a href='/AIV/02/24/12'>Ex. 24:12</a>",
      "comment": "Revelation was given to God’s chosen, signifying a privileged intimacy and responsibility, seen also in Christ’s giving of new commands to His followers."
    },
    {
      "pk": 2147159,
      "translation": "AIV",
      "book": 19,
      "chapter": 147,
      "verse": 20,
      "text": "He has not dealt thus with any other nation; they do not know his ordinances. Praise the LORD!",
      "links": "<a href='/AIV/05/4/7-8'>Deut. 4:7-8</a>; <a href='/AIV/45/9/4'>Rom. 9:4</a>",
      "comment": "God’s unique covenant relates to Israel, but through Christ, this blessing is extended to all nations (see Gal. 3:28), fulfilling the promise of inclusion and unity under God’s one people."
    }
  ],
  "translatedAt": "2025-12-23T05:52:05.145Z"
}