{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 96,
  "verses": [
    {
      "pk": 1960961,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 1,
      "text": "Sing to the Lord a new song! Sing to the Lord, all the earth!",
      "links": "<a href='/AIV/19/33/3'>Ps. 33:3</a>; <a href='/AIV/23/42/10'>Isa. 42:10</a>; <a href='/AIV/66/5/9'>Rev. 5:9</a>",
      "comment": "A call to all the world to sing a 'new song' to the Lord. In the wider biblical context, this foreshadows the inclusion of the Gentiles, fulfilled in Christ (see Revelation 5:9)."
    },
    {
      "pk": 1960962,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 2,
      "text": "Sing to the Lord, bless his name! Proclaim his salvation day after day.",
      "links": "<a href='/AIV/19/68/32'>Ps. 68:32</a>; <a href='/AIV/19/13/6'>Ps. 13:6</a>",
      "comment": "The command to proclaim God's salvation daily prefigures the continuous, unceasing praise and worship, which in the Catholic tradition is reflected in the daily Mass and the Liturgy of the Hours."
    },
    {
      "pk": 1960963,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 3,
      "text": "Declare his glory among the nations, his wonders among all peoples!",
      "links": "<a href='/AIV/19/105/1'>Ps. 105:1</a>; <a href='/AIV/23/12/4'>Isa. 12:4</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "A clear call to mission, which in the New Testament becomes the Great Commission (Matthew 28:19). This worldwide declaration is fully realized in the Church established by Christ to extend to all nations."
    },
    {
      "pk": 1960964,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 4,
      "text": "For the Lord is great and greatly to be praised; he is to be feared above all gods.",
      "links": "<a href='/AIV/19/95/3'>Ps. 95:3</a>; <a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/97/7'>Ps. 97:7</a>",
      "comment": "God's supremacy over all so-called gods is declared. In the ancient context, this was a declaration of Yahweh's uniqueness. In Catholic theology, Christ is confessed as true God and true man, sharing fully in this same divine greatness."
    },
    {
      "pk": 1960965,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 5,
      "text": "For all the gods of the peoples are idols, but the Lord made the heavens.",
      "links": "<a href='/AIV/19/115/4'>Ps. 115:4</a>; <a href='/AIV/19/135/15'>Ps. 135:15</a>; <a href='/AIV/19/102/25'>Ps. 102:25</a>",
      "comment": "A clear contrast: idols are nothing, but the Lord is Creator. The creative power of God underlies the Catholic understanding of the sacraments, which transform creation and confer real grace."
    },
    {
      "pk": 1960966,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 6,
      "text": "Honor and majesty are before him; strength and beauty fill his sanctuary.",
      "links": "<a href='/AIV/19/21/5'>Ps. 21:5</a>; <a href='/AIV/19/29/2'>Ps. 29:2</a>",
      "comment": "'Sanctuary' can mean the earthly temple and, in the Christian era, the heavenly liturgy (cf. Revelation 21). Catholic tradition sees in this a reference to the Church as the dwelling place of God's glory."
    },
    {
      "pk": 1960967,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 7,
      "text": "Ascribe to the Lord, O families of the peoples, ascribe to the Lord glory and strength.",
      "links": "<a href='/AIV/19/29/1'>Ps. 29:1</a>; <a href='/AIV/13/16/28'>1 Chron. 16:28</a>",
      "comment": "'Families of the peoples' is an early indication that the whole world is called to worship God, which the Church Fathers saw as the Catholic (universal) Church's mission."
    },
    {
      "pk": 1960968,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 8,
      "text": "Ascribe to the Lord the glory due his name; bring an offering and enter his courts.",
      "links": "<a href='/AIV/19/29/2'>Ps. 29:2</a>; <a href='/AIV/19/66/13'>Ps. 66:13</a>",
      "comment": "Bringing offerings and entering God's courts points to worship involving both heart and action. Catholics see this as fulfilled most fully in the Eucharist, the perpetual offering made present in every Mass."
    },
    {
      "pk": 1960969,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 9,
      "text": "Worship the Lord in the splendor of holiness; tremble before him, all the earth.",
      "links": "<a href='/AIV/19/29/2'>Ps. 29:2</a>; <a href='/AIV/19/99/1'>Ps. 99:1</a>; <a href='/AIV/19/110/3'>Ps. 110:3</a>",
      "comment": "The 'splendor of holiness' refers to the reverence and awe due to God's presence, as seen in Catholic liturgy with its beauty and solemnity."
    },
    {
      "pk": 1960970,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 10,
      "text": "Say among the nations: 'The Lord reigns! The world is firmly established, it cannot be moved; he will judge the peoples with equity.'",
      "links": "<a href='/AIV/19/93/1'>Ps. 93:1</a>; <a href='/AIV/19/9/8'>Ps. 9:8</a>",
      "comment": "This verse proclaims God's kingship and coming judgment. In Christian faith, it is fulfilled in Christ the King, who reigns and will judge at his coming (cf. Matthew 25:31-46)."
    },
    {
      "pk": 1960971,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 11,
      "text": "Let the heavens rejoice, and let the earth be glad; let the sea roar, and all that fills it;",
      "links": "<a href='/AIV/19/98/7'>Ps. 98:7</a>; <a href='/AIV/19/148/7'>Ps. 148:7</a>",
      "comment": "All creation is called to rejoice, anticipating God's renewal of all things (see Romans 8:19-22). Catholic tradition emphasizes this cosmic dimension in worship and the sacraments."
    },
    {
      "pk": 1960972,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 12,
      "text": "let the field be joyful, and all that is in it! Then all the trees of the forest will sing for joy",
      "links": "<a href='/AIV/19/98/8'>Ps. 98:8</a>; <a href='/AIV/23/55/12'>Isa. 55:12</a>",
      "comment": "Imagery of creation rejoicing hints at the restoration of all things. This is echoed in Isaiah and finds its ultimate fulfillment in the resurrection—body and soul—affirmed in the Catholic creeds."
    },
    {
      "pk": 1960973,
      "translation": "AIV",
      "book": 19,
      "chapter": 96,
      "verse": 13,
      "text": "before the Lord, for he comes. For he comes to judge the earth. He will judge the world in righteousness, and the peoples with his faithfulness.",
      "links": "<a href='/AIV/19/58/11'>Ps. 58:11</a>; <a href='/AIV/19/98/9'>Ps. 98:9</a>; <a href='/AIV/44/10/42'>Acts 10:42</a>; <a href='/AIV/55/4/1'>2 Tim. 4:1</a>",
      "comment": "The coming of the Lord to judge is an expectation fulfilled in Christ's second coming (Acts 10:42; 2 Tim 4:1). Catholic doctrine emphasizes the 'general judgment' and the hope of the resurrection."
    }
  ],
  "translatedAt": "2025-12-22T21:50:23.933Z"
}