{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 98,
  "verses": [
    {
      "pk": 1939801,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 1,
      "text": "Sing to the LORD a new song, for He has done marvelous things! His right hand and His holy arm have brought Him victory.",
      "links": "<a href='/AIV/19/33/3'>Ps. 33:3</a>; <a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/19/118/15-16'>Ps. 118:15–16</a>; <a href='/AIV/2/15/6'>Ex. 15:6</a>",
      "comment": "The phrase 'new song' often celebrates God's saving acts (see Ps. 96:1). The 'right hand' and 'holy arm' indicate God's power working in history, which Christians understand fulfilled in Christ's resurrection (Rom. 6:4). 'Marvelous things' subtly point to the unfolding plan of salvation culminating in Christ, hinted at throughout the Psalms and historically understood in the Church's liturgy."
    },
    {
      "pk": 1939802,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 2,
      "text": "The LORD has made His salvation known; He has revealed His righteousness in the sight of the nations.",
      "links": "<a href='/AIV/19/98/3'>Ps. 98:3</a>; <a href='/AIV/23/52/10'>Isa. 52:10</a>; <a href='/AIV/45/1/17'>Rom. 1:17</a>",
      "comment": "God’s salvation and righteousness are revealed not just to Israel but to all nations, which Christians see fulfilled in the Gentiles coming to faith (Eph. 3:6). The Catholic liturgical tradition also sees this fulfilled in the worldwide proclamation of the Gospel—an idea deeply rooted in apostolic succession."
    },
    {
      "pk": 1939803,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 3,
      "text": "He has remembered His steadfast love and faithfulness to the house of Israel; all the ends of the earth have seen the salvation of our God.",
      "links": "<a href='/AIV/19/105/8'>Ps. 105:8</a>; <a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/42/2/32'>Luke 2:32</a>",
      "comment": "God’s 'remembering' is His faithfulness to His covenant, fulfilled ultimately in Christ. The extension to 'all the ends of the earth' invites reflection on mission (Mt. 28:19) and the universality of the Church—something that Catholic tradition emphasizes in the very meaning of 'catholic' (universal)."
    },
    {
      "pk": 1939804,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 4,
      "text": "Shout for joy to the LORD, all the earth; burst into jubilant praise and sing!",
      "links": "<a href='/AIV/19/100/1'>Ps. 100:1</a>; <a href='/AIV/23/44/23'>Isa. 44:23</a>",
      "comment": "Public, liturgical praise is pictured here—anticipating the Christian practice of worship that transcends borders and times. In Catholic tradition, this finds further fulfillment in the mass where all nations praise God together."
    },
    {
      "pk": 1939805,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 5,
      "text": "Sing praises to the LORD with the harp, with the harp and the sound of song!",
      "links": "<a href='/AIV/19/33/2'>Ps. 33:2</a>; <a href='/AIV/19/144/9'>Ps. 144:9</a>",
      "comment": "Music is an essential part of biblical worship, and the Church (especially in early tradition and the Psalter in the Liturgy of the Hours) continues this pattern. The setting echoes the beauty and reverence of worship found in the Church’s liturgy."
    },
    {
      "pk": 1939806,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 6,
      "text": "With trumpets and the sound of the ram’s horn make a joyful noise before the King, the LORD!",
      "links": "<a href='/AIV/19/47/5'>Ps. 47:5</a>; <a href='/AIV/19/150/3'>Ps. 150:3</a>",
      "comment": "King imagery in the Psalms anticipates Christ the King (John 18:37; Rev. 19:16), recognized universally in Christian worship. Catholic liturgy richly uses such imagery during feast days for Christ the King."
    },
    {
      "pk": 1939807,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 7,
      "text": "Let the sea roar, and all that fills it; the world, and all who live in it!",
      "links": "<a href='/AIV/19/96/11'>Ps. 96:11</a>; <a href='/AIV/19/66/1-2'>Ps. 66:1–2</a>",
      "comment": "All creation is called to praise God—pointing to a cosmic scope of redemption (Rom. 8:22), fulfilled in Christ and reflected in the sacramental worldview of the Church, which sees all creation as ordered to God's glory."
    },
    {
      "pk": 1939808,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 8,
      "text": "Let the rivers clap their hands; let the hills sing for joy together",
      "links": "<a href='/AIV/23/55/12'>Isa. 55:12</a>; <a href='/AIV/19/96/12'>Ps. 96:12</a>",
      "comment": "Creation personified in worship points spiritually to the restoration and renewal brought by God's saving action, which for Catholics finds visible expression in the sacraments, especially baptism, symbolized by rivers and water."
    },
    {
      "pk": 1939809,
      "translation": "AIV",
      "book": 19,
      "chapter": 98,
      "verse": 9,
      "text": "before the LORD, for He comes to judge the earth. He will judge the world with righteousness and the peoples with equity.",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>; <a href='/AIV/44/10/42'>Acts 10:42</a>; <a href='/AIV/50/2/10-11'>Phil. 2:10–11</a>",
      "comment": "The coming judgment is a core theme, fulfilled in Christ's Second Coming. Catholic tradition highlights the Last Judgment, seen as both personal and cosmic. Christ’s authority as Judge is also alluded to in New Testament passages, underlining the Church’s role in preparing humanity for His return through the means of grace."
    }
  ],
  "translatedAt": "2025-12-22T21:50:52.253Z"
}