{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 17,
  "verses": [
    {
      "pk": 23017001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 1,
      "text": "Hear, O LORD, a just cause; listen to my cry. Give ear to my prayer from lips without deceit.",
      "links": "<a href='/AIV/19/86/6'>Ps. 86:6</a>; <a href='/AIV/23/59/1-2'>Isa. 59:1-2</a>",
      "comment": "David appeals to God as the righteous Judge. Emphasizes prayer from sincerity rather than hypocrisy—a key theme in worship (see Isa. 59:1-2). Also suggests a foreshadowing of the blamelessness attributed to Christ, who prayed without deceit (1 Pet. 2:22)."
    },
    {
      "pk": 23017002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 2,
      "text": "Let my vindication come from your presence; let your eyes see what is right.",
      "links": "<a href='/AIV/19/26/1'>Ps. 26:1</a>; <a href='/AIV/19/7/8'>Ps. 7:8</a>",
      "comment": "The psalmist trusts God alone to judge him rightly. Notice the importance of God's presence as the source of justification, hinting at the importance of God's mediation and the idea of coming before God through established means."
    },
    {
      "pk": 23017003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 3,
      "text": "You have examined my heart; you have visited me by night; you have tested me and found nothing. I have resolved that my mouth will not sin.",
      "links": "<a href='/AIV/19/139/23'>Ps. 139:23</a>; <a href='/AIV/18/23/10'>Job 23:10</a>",
      "comment": "David boldly claims innocence, echoing themes of God searching the heart (cf. Ps. 139:23). This resonates with the transformative power of spiritual examination. Also foreshadows Christ, who was without sin in word or action (Heb. 4:15)."
    },
    {
      "pk": 23017004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 4,
      "text": "As for what people do, by the word of your lips I have avoided the ways of the violent.",
      "links": "<a href='/AIV/19/119/9-11'>Ps. 119:9-11</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Obedience to God's word guards one against evil paths. The emphasis on the 'word' subtly hints at the necessity of adhering not only to scripture but to the full counsel received through divine tradition and teaching."
    },
    {
      "pk": 23017005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 5,
      "text": "My steps have held fast to your paths; my feet have not slipped.",
      "links": "<a href='/AIV/19/18/36'>Ps. 18:36</a>; <a href='/AIV/19/37/31'>Ps. 37:31</a>",
      "comment": "Walking firmly in God's ways is a persistent theme in scripture—see Ps. 18:36. The idea of God's path aligns with the concept of an ordered spiritual journey and pilgrimage, suggesting guidance beyond individual interpretation."
    },
    {
      "pk": 23017006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 6,
      "text": "I call upon you, O God, for you will answer me; incline your ear to me and hear my words.",
      "links": "<a href='/AIV/19/4/3'>Ps. 4:3</a>; <a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "The psalmist expresses confidence that God hears the prayers of the righteous (Ps. 34:17). It suggests the effectiveness of persistent prayer, a practice Christ and the apostles all encouraged (Luke 18:1)."
    },
    {
      "pk": 23017007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 7,
      "text": "Show your marvelous steadfast love, you who save by your right hand those who take refuge in you from their enemies.",
      "links": "<a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "'Steadfast love' (hesed) is a central covenantal term in the Old Testament. God's 'right hand' points to His power and is often associated with salvation—fulfilled supremely in Christ (Acts 2:33). The idea of finding refuge in God reflects the safety found in union with His chosen people."
    },
    {
      "pk": 23017008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 8,
      "text": "Keep me as the apple of your eye; hide me under the shadow of your wings,",
      "links": "<a href='/AIV/05/32/10'>Deut. 32:10</a>; <a href='/AIV/19/91/4'>Ps. 91:4</a>",
      "comment": "The image of being the 'apple of your eye' and under God's wings intends intimacy and protection. This foreshadows Jesus' longing to gather Jerusalem under His wings (Matt. 23:37), highlighting the spiritual safety in God's household."
    },
    {
      "pk": 23017009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 9,
      "text": "from the wicked who oppress me, from my deadly enemies who surround me.",
      "links": "<a href='/AIV/19/22/12-13'>Ps. 22:12-13</a>",
      "comment": "This echoes other psalms where the righteous are endangered by surrounding enemies (see Ps. 22). There is also a typological aspect: Christ Himself was surrounded by enemies, both spiritually and physically leading up to the passion."
    },
    {
      "pk": 23017010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 10,
      "text": "They have closed their hearts to mercy; with their mouths they speak arrogantly.",
      "links": "<a href='/AIV/19/73/8-9'>Ps. 73:8-9</a>",
      "comment": "A hardened heart prevents one from receiving God's grace. The pattern of pride and rebellion is a warning: openness and humility are necessary for true communion with God and His people."
    },
    {
      "pk": 23017011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 11,
      "text": "They now surround our steps; they have set their eyes to throw us down to the ground.",
      "links": "<a href='/AIV/19/140/5'>Ps. 140:5</a>",
      "comment": "The threat is real and persistent, showing the necessity of perseverance and vigilance—a frequent command in both Old and New Testaments (cf. 1 Pet. 5:8)."
    },
    {
      "pk": 23017012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 12,
      "text": "He is like a lion eager to tear, a young lion lurking in secret places.",
      "links": "<a href='/AIV/19/10/9'>Ps. 10:9</a>; <a href='/AIV/60/5/8'>1 Pet. 5:8</a>",
      "comment": "The adversary as a lion is echoed in the New Testament: Satan is described similarly (1 Pet. 5:8). The imagery encourages Christians to remember they must resist temptation and rely on God’s protection."
    },
    {
      "pk": 23017013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 13,
      "text": "Arise, O LORD! Confront him, bring him low. Deliver my soul from the wicked by your sword,",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/35/1'>Ps. 35:1</a>",
      "comment": "David’s call for God’s intervention demonstrates the proper response to evil: trust in divine justice rather than personal revenge. God’s sword here symbolizes His authority and might, further fulfilled in the final judgment (Rev. 19:15)."
    },
    {
      "pk": 23017014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 14,
      "text": "from men, by your hand, O LORD— from men of the world whose portion is in this life. You fill their bellies with your treasure; their children are satisfied, and they leave their abundance to their children.",
      "links": "<a href='/AIV/19/49/6-11'>Ps. 49:6-11</a>; <a href='/AIV/42/12/20-21'>Luke 12:20-21</a>",
      "comment": "This verse draws a strong contrast between those who seek earthly rewards and those whose hope is in God. It subtly encourages detachment from worldly goods and highlights the enduring value of spiritual inheritance."
    },
    {
      "pk": 23017015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 17,
      "verse": 15,
      "text": "But as for me, I shall behold your face in righteousness; when I awake, I shall be satisfied with your likeness.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/13/13/12'>1 Cor. 13:12</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "The psalmist’s hope climaxes in gazing upon God's face—language that foreshadows the hope of resurrected life and seeing God ‘face to face’ (1 Cor. 13:12, 1 John 3:2). Spiritual tradition has long seen in this verse a promise of communion with God, not only in this life but especially in the next, dwelling with Him in righteousness."
    }
  ],
  "translatedAt": "2025-12-24T06:03:50.326Z"
}