{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 143,
  "verses": [
    {
      "pk": 23143001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 1,
      "text": "LORD, hear my prayer; listen to my pleas in your faithfulness; in your righteousness, answer me.",
      "links": "<a href='/AIV/19/86/6'>Ps. 86:6</a>; <a href='/AIV/19/102/1'>Ps. 102:1</a>",
      "comment": "David appeals to God's righteousness and faithfulness as the basis for answered prayer. The word 'faithfulness' points to God’s absolute reliability, prefiguring the trust believers have in Christ’s intercession (Heb. 7:25)."
    },
    {
      "pk": 23143002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 2,
      "text": "Do not bring your servant into judgment, for no one living is righteous before you.",
      "links": "<a href='/AIV/18/4/17'>Job 4:17</a>; <a href='/AIV/45/3/10'>Rom. 3:10</a>",
      "comment": "The universality of sin is acknowledged here (‘no one living is righteous’), supporting the doctrine that all need God's grace and mercy. Paul cites this in Romans to show justification comes not from works but from God’s gracious gift."
    },
    {
      "pk": 23143003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 3,
      "text": "For the enemy pursues my soul; he has crushed my life to the ground; he has made me dwell in darkness like those long dead.",
      "links": "<a href='/AIV/19/88/3-6'>Ps. 88:3-6</a>",
      "comment": "David’s intense suffering mirrors Jesus’ own passion, as he experienced rejection and darkness for our sake (Mt. 26:38; Isa. 53:3-5), inviting a christological interpretation of persecution."
    },
    {
      "pk": 23143004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 4,
      "text": "Therefore, my spirit faints within me; my heart within me is desolate.",
      "links": "<a href='/AIV/19/142/3'>Ps. 142:3</a>; <a href='/AIV/19/77/3'>Ps. 77:3</a>",
      "comment": "Desolation and spiritual dryness often lead believers to deeper trust in God. The language here has been embraced in Christian tradition as a model for persevering prayer during spiritual struggles."
    },
    {
      "pk": 23143005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 5,
      "text": "I remember the days of old; I meditate on all you have done; I reflect on the work of your hands.",
      "links": "<a href='/AIV/19/77/11-12'>Ps. 77:11-12</a>; <a href='/AIV/19/104/24'>Ps. 104:24</a>",
      "comment": "Recollection of God's past deeds sustains faith. The practice of meditating on salvation history leads believers to deeper devotion, emphasizing the importance of remembering God's mighty works, a core aspect of Christian worship."
    },
    {
      "pk": 23143006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 6,
      "text": "I stretch out my hands to you; my soul thirsts for you like a parched land. Selah",
      "links": "<a href='/AIV/19/63/1'>Ps. 63:1</a>; <a href='/AIV/19/42/2'>Ps. 42:2</a>",
      "comment": "The physical gesture of stretching out hands is an ancient form of prayer. The soul’s thirst for God is echoed by Christ on the cross (Jn. 19:28), inviting believers into a longing for union with God."
    },
    {
      "pk": 23143007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 7,
      "text": "Answer me quickly, LORD! My spirit fails! Do not hide your face from me, or I will be like those who go down to the pit.",
      "links": "<a href='/AIV/19/13/3'>Ps. 13:3</a>; <a href='/AIV/19/27/9'>Ps. 27:9</a>",
      "comment": "David dramatically pleads for God’s presence. The phrase ‘hide your face’ expresses the terror of separation from God, which Christ himself endured for humanity (Mt. 27:46)."
    },
    {
      "pk": 23143008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 8,
      "text": "Let me hear of your steadfast love in the morning, for I trust in you. Show me the way I should go, for I lift up my soul to you.",
      "links": "<a href='/AIV/19/25/1'>Ps. 25:1</a>; <a href='/AIV/19/25/4'>Ps. 25:4</a>",
      "comment": "Morning prayer tradition draws from verses like this. Trust and guidance are linked, reflecting Jesus’ teaching to pray ‘your will be done’ (Mt. 6:10)."
    },
    {
      "pk": 23143009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 9,
      "text": "Deliver me from my enemies, LORD! I flee to you for refuge.",
      "links": "<a href='/AIV/19/31/1-2'>Ps. 31:1-2</a>",
      "comment": "God as refuge is a central motif, fulfilled perfectly in Christ, who provides ultimate deliverance (Col. 1:13-14). Seeking God for protection is a sign of humility and dependence."
    },
    {
      "pk": 23143010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 10,
      "text": "Teach me to do your will, for you are my God! Let your good Spirit lead me on level ground.",
      "links": "<a href='/AIV/19/25/4-5'>Ps. 25:4-5</a>; <a href='/AIV/19/51/10-11'>Ps. 51:10-11</a>",
      "comment": "A prayer for inner transformation by God’s Spirit anticipates New Testament teaching on sanctification (Gal. 5:16). God’s Spirit is traditionally understood as guiding the entire community of believers toward truth."
    },
    {
      "pk": 23143011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 11,
      "text": "For your name’s sake, LORD, preserve my life. In your righteousness, bring my soul out of trouble.",
      "links": "<a href='/AIV/19/25/11'>Ps. 25:11</a>; <a href='/AIV/19/31/1'>Ps. 31:1</a>",
      "comment": "'For your name’s sake' signals that God acts not only for the benefit of his servants but also to reveal his glory to others, echoing Jesus’ prayer in John 12:28."
    },
    {
      "pk": 23143012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 143,
      "verse": 12,
      "text": "And in your steadfast love, silence my enemies; destroy all those who afflict my soul, for I am your servant.",
      "links": "<a href='/AIV/19/6/10'>Ps. 6:10</a>; <a href='/AIV/19/136/24'>Ps. 136:24</a>",
      "comment": "Justice and mercy are linked here—God’s loyal love brings salvation and vindication. The identification as ‘your servant’ is taken up by Christ himself (Phil. 2:7), forming the model for Christian life and prayer."
    }
  ],
  "translatedAt": "2025-12-24T06:47:57.420Z"
}