{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 141,
  "verses": [
    {
      "pk": 21014101,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 1,
      "text": "O LORD, I call to you; come quickly to me. Listen to my voice when I call to you.",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/19/69/16-17'>Ps. 69:16–17</a>",
      "comment": "David urgently seeks the LORD's immediate response. The faithful are encouraged to approach God with boldness and trust, reflecting a close relationship with Him (see also Hebrews 4:16)."
    },
    {
      "pk": 21014102,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 2,
      "text": "Let my prayer be set before you as incense, the lifting up of my hands as the evening sacrifice.",
      "links": "<a href='/AIV/19/141/2'>Rev. 8:3-4</a>; <a href='/AIV/19/141/2'>Exod. 30:7-8</a>",
      "comment": "The reference to incense and sacrifice hints at a liturgical structure of worship, foreshadowing the importance of prayers offered at set times. This parallels prayers as spiritual offerings in the New Covenant (cf. Revelation 8:3-4; Romans 12:1)."
    },
    {
      "pk": 21014103,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 3,
      "text": "Set a guard, LORD, over my mouth; keep watch over the door of my lips.",
      "links": "<a href='/AIV/19/39/1'>Ps. 39:1</a>; <a href='/AIV/19/141/3'>James 3:2-10</a>",
      "comment": "David prays for self-control in speech. This echoes wisdom on the power of the tongue (see James 3:2-10), reminding believers of the need for purity in word and action."
    },
    {
      "pk": 21014104,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 4,
      "text": "Do not incline my heart to any evil thing, to practice wicked deeds with those who work iniquity, and do not let me eat of their delicacies.",
      "links": "<a href='/AIV/19/119/36'>Ps. 119:36</a>; <a href='/AIV/20/23/6'>Prov. 23:6</a>",
      "comment": "Here is a prayer for an upright heart, recognizing the danger of being led astray by sinful company or pleasures. Scripture consistently warns against joining with evildoers (1 Corinthians 15:33)."
    },
    {
      "pk": 21014105,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 5,
      "text": "Let the righteous strike me—it shall be kindness; let him rebuke me—it shall be oil for my head. Let my head not refuse it. For still my prayer is against their evil deeds.",
      "links": "<a href='/AIV/20/27/6'>Prov. 27:6</a>; <a href='/AIV/19/141/5'>Ps. 141:5</a>",
      "comment": "Accepting correction from the righteous is seen as a blessing, not an offense. Loving rebuke is depicted as a gracious help toward holiness (see Proverbs 27:6; Hebrews 12:11)."
    },
    {
      "pk": 21014106,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 6,
      "text": "When their judges are thrown down from the cliffs, then they will hear my words, for they are pleasant.",
      "links": "<a href='/AIV/19/37/17'>Ps. 37:17</a>; <a href='/AIV/19/58/10'>Ps. 58:10</a>",
      "comment": "A plea for vindication, anticipating that those who oppose righteousness will eventually recognize the truth. The language recalls God's justice visiting the wicked."
    },
    {
      "pk": 21014107,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 7,
      "text": "As when one plows and breaks up the earth, so our bones are scattered at the mouth of Sheol.",
      "links": "<a href='/AIV/19/44/19'>Ps. 44:19</a>; <a href='/AIV/26/37/1-3'>Ezek. 37:1-3</a>",
      "comment": "This vivid imagery of death and separation points ahead to a hope for resurrection, as later fulfilled in Christ’s victory over the grave (Ezekiel 37; 1 Corinthians 15:54)."
    },
    {
      "pk": 21014108,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 8,
      "text": "But my eyes are toward you, LORD God. In you I take refuge; leave not my soul defenseless.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>; <a href='/AIV/19/141/8'>Ps. 123:1</a>",
      "comment": "Even in despair, the psalmist’s hope is fixed on God for protection and salvation. The soul’s trust in God alone foreshadows unwavering faith in Him as the only true refuge."
    },
    {
      "pk": 21014109,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 9,
      "text": "Keep me from the trap they have set for me, from the snares of evildoers.",
      "links": "<a href='/AIV/19/140/5'>Ps. 140:5</a>; <a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "A petition for divine deliverance from the plots of the wicked, reminding believers to seek God’s help against all spiritual dangers (cf. Matthew 6:13)."
    },
    {
      "pk": 21014110,
      "translation": "AIV",
      "book": 19,
      "chapter": 141,
      "verse": 10,
      "text": "Let the wicked fall into their own nets, while I pass by safely.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/19/35/8'>Ps. 35:8</a>",
      "comment": "A final prayer for justice: the traps set by the wicked will catch them instead. This poetic justice anticipates God’s ultimate victory over evil. Spiritually, it echoes trust in the LORD’s providence guiding the righteous through trials."
    }
  ],
  "translatedAt": "2025-12-23T05:50:36.404Z"
}