{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 131,
  "verses": [
    {
      "pk": 23131001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 131,
      "verse": 1,
      "text": "Lord, my heart is not proud, nor my eyes lifted up; I do not concern myself with things too great or too marvelous for me.",
      "links": "<a href='/AIV/20/15/33'>Prov. 15:33</a>; <a href='/AIV/19/101/5'>Ps. 101:5</a>; <a href='/AIV/19/76/10'>Ps. 76:10</a>",
      "comment": "This verse expresses humility before God, a central theme in the Psalms and wisdom literature. The psalmist admits his limitations and willingly submits to the Lord, reflecting the attitude encouraged throughout Scripture (see Philippians 2:5-8). There is significance in interior humility as a spiritual discipline, as Christ Himself modeled humble obedience in his Incarnation (Phil. 2:6-11)."
    },
    {
      "pk": 23131002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 131,
      "verse": 2,
      "text": "Indeed, I have calmed and quieted my soul; like a weaned child with its mother, like a weaned child is my soul within me.",
      "links": "<a href='/AIV/19/62/1'>Ps. 62:1</a>; <a href='/AIV/19/116/7'>Ps. 116:7</a>; <a href='/AIV/19/42/5'>Ps. 42:5</a>",
      "comment": "Here the psalmist uses the imagery of a weaned child to show a deep trust and rest in God, not demanding but patiently waiting. The spiritual interpretation encourages believers to strive for such quiet confidence in God. This echoes the invitation of Christ to childlike trust (Mark 10:15, Matthew 18:3) and points toward the soul’s need for a motherly embrace, which theologians interpret as the comforting presence of God and the nurturing found in the community of believers."
    },
    {
      "pk": 23131003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 131,
      "verse": 3,
      "text": "Israel, hope in the Lord from this time forth and forever.",
      "links": "<a href='/AIV/19/130/7'>Ps. 130:7</a>; <a href='/AIV/19/71/5'>Ps. 71:5</a>; <a href='/AIV/45/15/12'>Rom. 15:12</a>",
      "comment": "The call for Israel to hope in the Lord is both corporate and eternal, tying the personal trust of the psalmist to the communal faith of God’s people—past, present, and future. This hope ultimately finds its fulfillment in the Messiah and the enduring faith of the Church across generations (Hebrews 6:18-19). The invitation to ‘forever’ reveals God’s eternal covenant and the continuity of faith experienced through liturgy and tradition."
    }
  ],
  "translatedAt": "2025-12-24T06:44:17.730Z"
}