{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 141,
  "verses": [
    {
      "pk": 23141001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 1,
      "text": "O Lord, I call to You; come quickly to me. Listen to my voice when I cry out to You.",
      "links": "<a href='/AIV/19/27/7'>Ps. 27:7</a>; <a href='/AIV/19/130/1'>Ps. 130:1</a>",
      "comment": "David's urgent prayer shows the believer's confidence that God hears in times of need. The plea for God to come quickly highlights an intimate relationship, emphasizing trust in God's constant presence (cf. <a href='/AIV/19/34/15'>Ps. 34:15</a>). Christ Himself also cried out to the Father in prayer, especially in Gethsemane, showing us the importance of calling to God fervently (<a href='/AIV/40/26/39'>Matt. 26:39</a>)."
    },
    {
      "pk": 23141002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 2,
      "text": "May my prayer be set before You like incense, and the lifting up of my hands like the evening sacrifice.",
      "links": "<a href='/AIV/02/30/7-8'>Ex. 30:7-8</a>; <a href='/AIV/19/140/2'>Ps. 140:2</a>; <a href='/AIV/66/5/8'>Rev. 5:8</a>",
      "comment": "Prayer compared to incense reflects a sacrificial, worshipful attitude, mirroring the temple rites (cf. <a href='/AIV/42/1/9-10'>Luke 1:9-10</a>). The evening sacrifice points to regular, established patterns of worship and devotion—an early sign of liturgical prayer observed by the faithful. Incense is later connected with the prayers of the saints in the New Testament (<a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>). The gesture of lifted hands prefigures the posture of worship and blessing handed down through apostolic tradition."
    },
    {
      "pk": 23141003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 3,
      "text": "Set a guard, O Lord, over my mouth; keep watch over the door of my lips.",
      "links": "<a href='/AIV/19/39/1'>Ps. 39:1</a>; <a href='/AIV/59/3/2'>Jas. 3:2</a>",
      "comment": "David asks for God’s help in controlling his speech, an area repeatedly stressed in Scripture. James elaborates on the need to tame the tongue, highlighting speech as an essential aspect of a holy life. This verse underlines human reliance on divine grace to live righteously, trusting God to perfect what is weak in us (cf. <a href='/AIV/23/6/5-7'>Isa. 6:5-7</a>)."
    },
    {
      "pk": 23141004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 4,
      "text": "Do not let my heart incline to any evil thing, to practice wicked deeds with men who do iniquity; and let me not eat of their delicacies.",
      "links": "<a href='/AIV/20/1/10-15'>Prov. 1:10-15</a>; <a href='/AIV/19/26/4-5'>Ps. 26:4-5</a>",
      "comment": "David pleads for protection from not only evil acts but even the desire to participate. Separation from sinners and their ‘delicacies’ hints at the need for spiritual discipline and the avoidance of scandal. This reflects a call to holiness, resisting both external and internal temptations (cf. <a href='/AIV/40/6/13'>Matt. 6:13</a>), and aligns with later apostolic instructions to avoid fellowship with persistent sinners (<a href='/AIV/46/5/11'>1 Cor. 5:11</a>)."
    },
    {
      "pk": 23141005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 5,
      "text": "Let the righteous strike me—it is a kindness; let him rebuke me—it is oil for my head; let my head not refuse it. For still my prayer is against the evil deeds of the wicked.",
      "links": "<a href='/AIV/20/27/6'>Prov. 27:6</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "Correction by the righteous is seen as mercy, likened to holy anointing oil, reminiscent of the consecration of priests and kings. Openness to rebuke shows humility and accountability within the faith community, echoing Christ’s call to fraternal correction (<a href='/AIV/40/18/15'>Matt. 18:15</a>). The reference to oil evokes themes of anointing, grace, and healing, which later takes deeper meaning in New Testament sacramental life (<a href='/AIV/59/5/14'>Jas. 5:14</a>)."
    },
    {
      "pk": 23141006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 6,
      "text": "When their rulers are thrown down from the cliffs, they will listen to my words, for they are pleasant.",
      "links": "<a href='/AIV/04/16/31-33'>Num. 16:31-33</a>; <a href='/AIV/19/64/8'>Ps. 64:8</a>",
      "comment": "This verse may refer to judgment against wicked leaders (see Korah’s rebellion in <a href='/AIV/04/16/31-33'>Num. 16:31-33</a>), indicating God’s justice. The psalmist’s confidence that his words will be recognized as good suggests that divine truth will ultimately prevail. God’s faithful servants may be opposed but are ultimately vindicated."
    },
    {
      "pk": 23141007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 7,
      "text": "Just as when one plows and breaks up the earth, so our bones are scattered at the mouth of Sheol.",
      "links": "<a href='/AIV/19/44/19'>Ps. 44:19</a>; <a href='/AIV/26/37/1-2'>Ezek. 37:1-2</a>",
      "comment": "Imagery of death and hardship is used to show utter vulnerability—yet it foreshadows hope: scattered bones at Sheol's mouth echo resurrection themes brought to fullness in Christ (<a href='/AIV/26/37/12-14'>Ezek. 37:12-14</a>; <a href='/AIV/46/15/52'>1 Cor. 15:52</a>). The plowing of the earth evokes burial and resurrection motifs."
    },
    {
      "pk": 23141008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 8,
      "text": "But my eyes are fixed on You, O Lord GOD; in You I take refuge—do not leave my soul defenseless.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>; <a href='/AIV/58/12/2'>Heb. 12:2</a>",
      "comment": "David’s steadfast focus on God, even in suffering, is a model for Christians. The plea for protection of the soul anticipates prayers for perseverance in grace and ultimate salvation. It echoes perseverance in faith through adversity, a theme later developed (<a href='/AIV/43/6/37-40'>John 6:37-40</a>)."
    },
    {
      "pk": 23141009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 9,
      "text": "Keep me from the trap laid for me, from the snares of those who do evil.",
      "links": "<a href='/AIV/19/140/5'>Ps. 140:5</a>; <a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "Evil scheming against the righteous is a recurring motif, fulfilled supremely in the betrayal of Christ (cf. <a href='/AIV/43/18/3'>John 18:3</a>). The image of escape from snares also recalls victory over sin and spiritual enemies, affirming God’s providential care."
    },
    {
      "pk": 23141010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 141,
      "verse": 10,
      "text": "Let the wicked fall into their own nets while I escape safely.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15-16</a>; <a href='/AIV/19/9/15'>Ps. 9:15</a>",
      "comment": "The reversal of the wicked’s designs is a theme throughout the Psalms, often seen as poetic justice (cf. <a href='/AIV/20/26/27'>Prov. 26:27</a>). God’s protection ensures His faithful ones are preserved. This finds spiritual fulfillment in the triumph of Christ, who overcomes evil and death itself, securing deliverance for His people."
    }
  ],
  "translatedAt": "2025-12-24T06:47:29.650Z"
}