{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 126,
  "verses": [
    {
      "pk": 2012601,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 1,
      "text": "When the LORD restored the fortunes of Zion, we were like those who dream.",
      "links": "<a href='/AIV/23/35/10'>Isa. 35:10</a>; <a href='/AIV/19/85/1'>Ps. 85:1</a>",
      "comment": "This verse recalls God's past deliverance of His people, likening their joy to the wonder of awakening from a dream. The term 'restored the fortunes' suggests a complete reversal of exile or hardship, echoing themes of divine restoration and redemption throughout Scripture. The return from exile points forward to Christ's ultimate restoration of humanity through His Resurrection. See <a href='/AIV/42/24/44-47'>Luke 24:44–47</a> for the fulfillment of promises in Christ."
    },
    {
      "pk": 2012602,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 2,
      "text": "Then our mouths were filled with laughter, and our tongues with shouts of joy. Then it was said among the nations, 'The LORD has done great things for them.'",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>; <a href='/AIV/20/17/22'>Prov. 17:22</a>",
      "comment": "God's works become publicly known, even among the nations, showing that His salvation is meant for all to witness. The joy experienced by God's people models the spiritual joy found in union with Christ, and the global proclamation mirrors the universal mission of the Church. See <a href='/AIV/44/2/47'>Acts 2:47</a> for New Testament parallels of God's favor made known among the peoples."
    },
    {
      "pk": 2012603,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 3,
      "text": "The LORD has done great things for us; we are glad.",
      "links": "<a href='/AIV/19/98/1'>Ps. 98:1</a>; <a href='/AIV/19/116/7'>Ps. 116:7</a>",
      "comment": "A response of thankfulness and joy for God's works. The language of gladness highlights the inward spiritual renewal that follows God's interventions, prefiguring the joy of salvation found in Christ. The repetition emphasizes genuine gratitude in worship, which finds its fullest expression in the liturgical life of the people of God."
    },
    {
      "pk": 2012604,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 4,
      "text": "Restore our fortunes, O LORD, like streams in the Negeb.",
      "links": "<a href='/AIV/19/85/4'>Ps. 85:4</a>; <a href='/AIV/23/44/3'>Isa. 44:3</a>",
      "comment": "Petitioning for continual renewal, the image of streams in the Negeb—an arid region—suggests sudden, miraculous abundance. This is an Old Testament precursor to the New Covenant, in which God pours out His Spirit to bring life to barren souls (see <a href='/AIV/43/7/37-39'>John 7:37–39</a>). The verse also carries a sacramental undertone: just as streams restore dryness, grace restores spiritual drought."
    },
    {
      "pk": 2012605,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 5,
      "text": "Those who sow in tears will reap with shouts of joy.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/48/6/7'>Gal. 6:7</a>",
      "comment": "The principle of sorrow transformed into joy reflects both literal agricultural cycles and spiritual truths. Patient endurance in suffering yields a harvest of blessing—a theme fulfilled in Christ's Passion and Resurrection. Spiritual interpretation points toward the discipline of prayer, penance, and trust, often foundational in the life of faith and essential for deep conversion."
    },
    {
      "pk": 2012606,
      "translation": "AIV",
      "book": 19,
      "chapter": 126,
      "verse": 6,
      "text": "He who goes out weeping, carrying seed to sow, will surely return with shouts of joy, carrying his sheaves.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/40/13/3-23'>Matt. 13:3–23</a>",
      "comment": "The final verse emphasizes the certainty of reward for faithfulness. It parallels Jesus’ parable of the sower (Matthew 13), where perseverance in spreading the Word, despite trials, brings forth an abundant harvest. Literally, it promises hope to those in hardship; spiritually, it encourages steadfastness in faith and sacrificial living, a hallmark of the apostolic tradition and ongoing sanctification."
    }
  ],
  "translatedAt": "2025-12-23T05:46:57.933Z"
}