{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 48,
  "verses": [
    {
      "pk": 1948048,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 1,
      "text": "Great is the LORD, and greatly to be praised in the city of our God, on His holy mountain.",
      "links": "<a href='/AIV/19/87/1-3'>Ps. 87:1–3</a>; <a href='/AIV/19/46/4'>Ps. 46:4</a>",
      "comment": "The focus on 'holy mountain' echoes the significance of Jerusalem as a spiritual center, foreshadowing the Church founded by Christ as the new spiritual Zion (Heb. 12:22)."
    },
    {
      "pk": 1948049,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 2,
      "text": "Beautiful in elevation, the joy of the whole earth, Mount Zion, on the northern side, the city of the great King.",
      "links": "<a href='/AIV/19/2/6'>Ps. 2:6</a>; <a href='/AIV/40/5/35'>Matt. 5:35</a>",
      "comment": "Calling Zion 'the city of the great King' finds its fulfillment in Jesus who calls God the 'great King' (Matt. 5:35), Christologically linking Jerusalem, the earthly city, with the heavenly Jerusalem (Rev. 21:2)."
    },
    {
      "pk": 1948050,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 3,
      "text": "God, in her palaces, has made Himself known as a fortress.",
      "links": "<a href='/AIV/19/46/7'>Ps. 46:7</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "God’s presence within Zion as a fortress echoes the theme of divine protection found elsewhere in the Psalms. The language subtly prefigures the Church as spiritual refuge (Matt. 16:18)."
    },
    {
      "pk": 1948051,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 4,
      "text": "For see, the kings assembled, they advanced together.",
      "links": "<a href='/AIV/19/2/2'>Ps. 2:2</a>; <a href='/AIV/12/11/8'>2 Kings 11:8</a>",
      "comment": "Imagery of kings gathering suggests opposition to God and His people, invoking Psalm 2, which is messianic and points toward Christ's victory over worldly powers."
    },
    {
      "pk": 1948052,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 5,
      "text": "They saw it, and so they marveled; they were alarmed, they fled in panic.",
      "links": "<a href='/AIV/19/68/12'>Ps. 68:12</a>; <a href='/AIV/19/83/15'>Ps. 83:15</a>",
      "comment": "The surprise and retreat of the kings illustrate God’s defense of His people, a foreshadowing of Christ's triumph over evil."
    },
    {
      "pk": 1948053,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 6,
      "text": "Trembling took hold of them there, anguish like a woman in labor.",
      "links": "<a href='/AIV/19/18/4-5'>Ps. 18:4–5</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "The image of labor pangs is regularly used in Scripture for judgement or spiritual crisis, subtly connecting to the pain leading up to new spiritual birth, as seen in Christ (John 16:21)."
    },
    {
      "pk": 1948054,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 7,
      "text": "With an east wind You shatter the ships of Tarshish.",
      "links": "<a href='/AIV/23/2/16'>Isa. 2:16</a>; <a href='/AIV/26/27/25'>Ezek. 27:25'>Ezek. 27:25</a>",
      "comment": "God's sovereignty over mighty nations and trade powers is demonstrated, foreshadowing Christ’s authority over all creation. The use of direct divine agency signals the Catholic emphasis on God’s providence."
    },
    {
      "pk": 1948055,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 8,
      "text": "As we have heard, so we have seen in the city of the LORD of hosts, in the city of our God: God will establish it forever.",
      "links": "<a href='/AIV/19/87/5'>Ps. 87:5</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "God’s promise to establish Zion forever foreshadows the perpetuity of the Church (Matt. 16:18), subtly hinting at the Catholic teaching on the indefectibility of the Church."
    },
    {
      "pk": 1948056,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 9,
      "text": "We have meditated on Your steadfast love, O God, in the midst of Your temple.",
      "links": "<a href='/AIV/19/26/8'>Ps. 26:8</a>; <a href='/AIV/19/5/7'>Ps. 5:7</a>",
      "comment": "The act of worship in the temple prefigures the sacraments and liturgical worship in the Church, connecting the idea of God's dwelling with the Eucharist and living presence in Catholic theology."
    },
    {
      "pk": 1948057,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 10,
      "text": "As Your name, O God, so is Your praise to the ends of the earth; Your right hand is filled with righteousness.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/46/1/30'>1 Cor. 1:30</a>",
      "comment": "The worldwide scope of God’s praise anticipates the universal mission of the Church; 'right hand' as righteousness is also a Christological image (Rom. 1:17)."
    },
    {
      "pk": 1948058,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 11,
      "text": "Let Mount Zion be glad! Let the daughters of Judah rejoice because of Your judgments.",
      "links": "<a href='/AIV/19/97/8'>Ps. 97:8</a>; <a href='/AIV/19/96/10'>Ps. 96:10</a>",
      "comment": "The joy of God's people over divine justice is a theme fulfilled in Christ’s ultimate victory. The spiritual interpretation sees Zion as the Church, rejoicing in salvation."
    },
    {
      "pk": 1948059,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 12,
      "text": "Walk about Zion, go around her, count her towers.",
      "links": "<a href='/AIV/19/122/3'>Ps. 122:3</a>; <a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "The invitation to examine Zion’s strength foreshadows spiritual reflection on the foundations of the Church—her teaching, apostolic succession, and visible unity in Catholic doctrine."
    },
    {
      "pk": 1948060,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 13,
      "text": "Consider her ramparts, inspect her palaces, so that you may tell it to the next generation.",
      "links": "<a href='/AIV/19/22/30'>Ps. 22:30</a>; <a href='/AIV/19/78/4'>Ps. 78:4</a>",
      "comment": "The continuity of faith through generations reflects Catholic emphasis on sacred tradition and the transmission of truth within the Church community (2 Thess. 2:15)."
    },
    {
      "pk": 1948061,
      "translation": "AIV",
      "book": 19,
      "chapter": 48,
      "verse": 14,
      "text": "For this God is our God forever and ever; He will guide us beyond death.",
      "links": "<a href='/AIV/19/73/24'>Ps. 73:24</a>; <a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "God's guidance beyond death hints at Catholic teaching on the communion of saints and the hope of eternal life with God—a promise fulfilled in Christ’s resurrection (John 11:25–26)."
    }
  ],
  "translatedAt": "2025-12-22T21:35:15.003Z"
}