{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 116,
  "verses": [
    {
      "pk": 23116001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 1,
      "text": "I love the LORD, because He hears my voice and my pleas for mercy.",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>; <a href='/AIV/19/18/6'>Ps. 18:6</a>",
      "comment": "This opening declaration is both personal and intimate, emphasizing a loving relationship with God based on His responsiveness to prayer. The Hebrew uses 'I love' as an uncommon word here, expressing a devoted attachment. The verse hints at the importance of prayer as a dialogue, establishing early the vital connection with God through direct supplication, a theme that is further emphasized in Jesus' teachings about prayer (see <a href='/AIV/40/6/6'>Matt. 6:6</a>)."
    },
    {
      "pk": 23116002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 2,
      "text": "Because He has inclined His ear to me, I will call upon Him as long as I live.",
      "links": "<a href='/AIV/19/86/7'>Ps. 86:7</a>; <a href='/AIV/19/91/15'>Ps. 91:15</a>",
      "comment": "God’s readiness to listen is compared to Him bending down to hear—communicating His intimate concern. The psalmist’s lifelong commitment to prayer echoes the concept of ongoing, persevering faith. There is also a foreshadowing of persistence in prayer, as seen in the parables of Jesus (<a href='/AIV/42/18/1'>Luke 18:1</a>)."
    },
    {
      "pk": 23116003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 3,
      "text": "The cords of death surrounded me, and the terrors of Sheol seized me; I found trouble and sorrow.",
      "links": "<a href='/AIV/19/18/4-5'>Ps. 18:4-5</a>; <a href='/AIV/32/2/2'>Jon. 2:2</a>",
      "comment": "Describes an experience close to death—'Sheol' refers to the realm of the dead. The imagery evokes both physical and spiritual peril, reflecting human vulnerability. Notice how the cry for deliverance aligns with Christ’s own suffering and descent into death before His resurrection, prefiguring Christian hope (<a href='/AIV/40/12/40'>Matt. 12:40</a>)."
    },
    {
      "pk": 23116004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 4,
      "text": "Then I called on the name of the LORD: 'O LORD, deliver my soul!'",
      "links": "<a href='/AIV/19/54/1'>Ps. 54:1</a>; <a href='/AIV/45/10/13'>Rom. 10:13</a>",
      "comment": "The urgency of the prayer for deliverance expresses dependence on God alone. 'Calling on the name of the LORD' carries sacramental overtones—a sincere invocation with faith. Paul cites this phrase as a statement of salvation open to all who trust in God (<a href='/AIV/45/10/13'>Rom. 10:13</a>)."
    },
    {
      "pk": 23116005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 5,
      "text": "Gracious is the LORD, and righteous; our God is merciful.",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>; <a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "Here, God is described with three key attributes: gracious, just, and merciful. This combination hints at the balance between God's justice and His compassion—a motif deeply woven throughout salvation history and understood to reach its fullness in Christ's redemptive act (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 23116006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 6,
      "text": "The LORD guards the simple; I was brought low, and He saved me.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/19/138/6'>Ps. 138:6</a>",
      "comment": "'Simple' does not mean 'foolish,' but rather 'humble' or 'childlike.' Divine protection is reserved for those who approach Him in sincerity. Jesus calls His disciples to childlike faith (<a href='/AIV/40/18/3'>Matt. 18:3</a>), suggesting that humility opens the way for God's saving action."
    },
    {
      "pk": 23116007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 7,
      "text": "Return to your rest, O my soul, for the LORD has dealt bountifully with you.",
      "links": "<a href='/AIV/19/62/5'>Ps. 62:5</a>; <a href='/AIV/19/13/6'>Ps. 13:6</a>",
      "comment": "The psalmist speaks to his own soul, urging it to find peace in God’s care. The language reflects the spiritual rest later promised by Jesus to the weary (<a href='/AIV/40/11/28'>Matt. 11:28</a>). This also has overtones of spiritual peace found uniquely in unity with God."
    },
    {
      "pk": 23116008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 8,
      "text": "For You have rescued my soul from death, my eyes from tears, my feet from stumbling;",
      "links": "<a href='/AIV/19/56/13'>Ps. 56:13</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "The triple deliverance—life, sight, and walk—is holistic salvation. The language foreshadows final redemption and the banishing of sorrow, which is fulfilled eschatologically in Christ and the New Creation (<a href='/AIV/66/21/4'>Rev. 21:4</a>)."
    },
    {
      "pk": 23116009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 9,
      "text": "I will walk before the LORD in the land of the living.",
      "links": "<a href='/AIV/19/27/13'>Ps. 27:13</a>; <a href='/AIV/19/56/13'>Ps. 56:13</a>",
      "comment": "This verse echoes faithful living in God’s presence. 'Land of the living' has both immediate and eternal significance, pointing to resurrection hope—walking with God into everlasting life (<a href='/AIV/43/11/25'>John 11:25</a>)."
    },
    {
      "pk": 23116010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 10,
      "text": "I believed, therefore I spoke; I was greatly afflicted.",
      "links": "<a href='/AIV/47/4/13'>2 Cor. 4:13</a>; <a href='/AIV/19/32/3'>Ps. 32:3</a>",
      "comment": "Faith precedes confession. Paul uses this verse to teach that authentic faith inevitably gives birth to testimony—even in affliction. This relates to the principle that suffering refines and deepens belief (<a href='/AIV/60/1/6-7'>1 Pet. 1:6-7</a>)."
    },
    {
      "pk": 23116011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 11,
      "text": "I said in my distress, 'All men are liars.'",
      "links": "<a href='/AIV/19/14/3'>Ps. 14:3</a>; <a href='/AIV/45/3/4'>Rom. 3:4</a>",
      "comment": "The psalmist’s despair at human unreliability accentuates God’s trustworthiness. Echoes Paul’s argument that 'God is true, though every man a liar,' underscoring the necessity of divine authority above all human claims (<a href='/AIV/45/3/4'>Rom. 3:4</a>)."
    },
    {
      "pk": 23116012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 12,
      "text": "What shall I return to the LORD for all His goodness toward me?",
      "links": "<a href='/AIV/19/103/2'>Ps. 103:2</a>; <a href='/AIV/19/116/17'>Ps. 116:17</a>",
      "comment": "A rhetorical question. The psalmist contemplates a fitting response to God's abundant grace. This opens reflection on gratitude, sacrifice, and worship as the proper human answer to divine beneficence—hinting at the principle of freely offered sacrifice (see <a href='/AIV/58/13/15'>Heb. 13:15</a>)."
    },
    {
      "pk": 23116013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 13,
      "text": "I will lift up the cup of salvation and call on the name of the LORD.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/40/26/27'>Matt. 26:27</a>",
      "comment": "The 'cup of salvation' is a potent symbol, closely tied to thanksgiving offerings and later to the Eucharistic cup used by Jesus at the Last Supper. This cup is an act of worship but also points spiritually toward Christ’s saving blood, linking old covenant thanksgiving with the new covenant sacramental life."
    },
    {
      "pk": 23116014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 14,
      "text": "I will pay my vows to the LORD in the presence of all His people.",
      "links": "<a href='/AIV/19/22/25'>Ps. 22:25</a>; <a href='/AIV/19/116/18'>Ps. 116:18</a>",
      "comment": "Faith is not purely private—the vow is fulfilled in public worship, assembling the community. This anticipates the visible, unified congregation of believers gathered for shared worship, echoing Christ’s establishment of His Church for collective thanksgiving and sacrifice (<a href='/AIV/44/2/42'>Acts 2:42</a>)."
    },
    {
      "pk": 23116015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 15,
      "text": "Precious in the sight of the LORD is the death of His saints.",
      "links": "<a href='/AIV/66/14/13'>Rev. 14:13</a>; <a href='/AIV/19/72/14'>Ps. 72:14</a>",
      "comment": "The death of the faithful is described as 'precious.' This verse is significant for understanding the reverence shown to martyrs and those who die in holiness. It points toward eternal life promised to the faithful, and the sacred memory of the righteous that forms a part of the spiritual heritage of the Church; compare the teaching on the communion of saints (<a href='/AIV/66/14/13'>Rev. 14:13</a>)."
    },
    {
      "pk": 23116016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 16,
      "text": "O LORD, truly I am Your servant; I am Your servant, the son of Your handmaid. You have loosed my bonds.",
      "links": "<a href='/AIV/19/86/16'>Ps. 86:16</a>; <a href='/AIV/42/1/38'>Luke 1:38</a>",
      "comment": "Twice affirming servanthood, the psalmist recognizes freedom gifted by God. 'Son of Your handmaid' is a phrase later echoed by Mary in the Gospel of Luke, tying the motif of servanthood to the highest form found in Christ and His mother. Spiritual freedom and filial devotion are underscored."
    },
    {
      "pk": 23116017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 17,
      "text": "I will offer to You the sacrifice of thanksgiving and call upon the name of the LORD.",
      "links": "<a href='/AIV/19/107/22'>Ps. 107:22</a>; <a href='/AIV/58/13/15'>Heb. 13:15</a>",
      "comment": "Thanksgiving as sacrifice points toward the liturgical act of gratitude. This links the Old Testament thanksgiving offering with the new covenant practice of continual praise. Sacrificial thanksgiving is both outward act and inward disposition, foreshadowing New Testament worship."
    },
    {
      "pk": 23116018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 18,
      "text": "I will pay my vows to the LORD in the presence of all His people,",
      "links": "<a href='/AIV/19/22/25'>Ps. 22:25</a>; <a href='/AIV/19/116/14'>Ps. 116:14</a>",
      "comment": "Repetition stresses the importance of communal worship. Vows are fulfilled publicly, which resonates with the structure of worship instituted by Christ—a people set apart in unity and shared devotion. The verse supports the spiritual significance of gathering for shared worship."
    },
    {
      "pk": 23116019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 116,
      "verse": 19,
      "text": "in the courts of the house of the LORD, in your midst, O Jerusalem. Praise the LORD!",
      "links": "<a href='/AIV/19/84/1-2'>Ps. 84:1-2</a>; <a href='/AIV/19/122/1-2'>Ps. 122:1-2</a>",
      "comment": "Final praise is rooted in worship at a sacred place—'courts of the house of the LORD,' Jerusalem being the heart of gathered worship and spiritual presence. Jerusalem is emblematic of the ultimate unity and worship that God desires. In Christian interpretation, God's dwelling with His people finds its highest form in the gathered Church and the heavenly Jerusalem (<a href='/AIV/66/21/2'>Rev. 21:2</a>)."
    }
  ],
  "translatedAt": "2025-12-24T06:40:51.019Z"
}