{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 33,
  "verses": [
    {
      "pk": 3303301,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 1,
      "text": "Rejoice in the LORD, you righteous! Praise is fitting for the upright.",
      "links": "<a href='/AIV/19/32/11'>Psalm 32:11</a>; <a href='/AIV/19/97/12'>Psalm 97:12</a>",
      "comment": "The psalm opens with a call to worship from the just. Here, the Catholic tradition often sees the 'righteous' as those justified by grace through the sacraments, hinting at a communal worship that is deeply connected to participation in the liturgy."
    },
    {
      "pk": 3303302,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 2,
      "text": "Give thanks to the LORD with the lyre; make music to Him on a ten-stringed harp.",
      "links": "<a href='/AIV/19/92/3'>Psalm 92:3</a>; <a href='/AIV/19/144/9'>Psalm 144:9</a>",
      "comment": "Musical worship is not only an external expression; in Catholic liturgy, the use of instruments and song draws the worshiper to deeper participation in the mystery of Christ."
    },
    {
      "pk": 3303303,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 3,
      "text": "Sing to Him a new song; play skillfully with joyful shouts.",
      "links": "<a href='/AIV/19/96/1'>Psalm 96:1</a>; <a href='/AIV/19/98/1'>Psalm 98:1</a>",
      "comment": "The 'new song' is often seen as a symbol of renewed life in Christ (cf. Revelation 5:9). The renewal theme resonates with Catholic theology on the transformation through the sacraments."
    },
    {
      "pk": 3303304,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 4,
      "text": "For the word of the LORD is right, and all His works are done in faithfulness.",
      "links": "<a href='/AIV/19/111/7'>Psalm 111:7</a>",
      "comment": "God’s word here foreshadows the Word made flesh (John 1:1). The Catholic tradition links the reliability of God's word to both Scripture and Tradition as channels of revelation."
    },
    {
      "pk": 3303305,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 5,
      "text": "He loves righteousness and justice; the earth is full of the LORD’s unfailing love.",
      "links": "<a href='/AIV/19/119/64'>Psalm 119:64</a>; <a href='/AIV/19/36/5'>Psalm 36:5</a>",
      "comment": "The overflowing love ('hesed') reflects the Catholic understanding of divine grace permeating creation, not just a select group."
    },
    {
      "pk": 3303306,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 6,
      "text": "By the word of the LORD the heavens were made, and by the breath of His mouth all their host.",
      "links": "<a href='/AIV/1/1/3'>Genesis 1:3</a>; <a href='/AIV/19/104/30'>Psalm 104:30</a>; <a href='/AIV/43/1/3'>John 1:3</a>",
      "comment": "The creative word ('dabar') anticipates Christ, the Divine Word (John 1:1-3). Catholics see this as support for the doctrine that all creation is sustained in Christ."
    },
    {
      "pk": 3303307,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 7,
      "text": "He gathers the waters of the sea as a heap; He puts the deeps in storehouses.",
      "links": "<a href='/AIV/1/1/9-10'>Genesis 1:9-10</a>; <a href='/AIV/19/104/9'>Psalm 104:9</a>",
      "comment": "God’s mastery over the cosmic waters is a sign of His lordship and power, echoing Catholic liturgical prayers that remember creation and the symbolism of water in baptism."
    },
    {
      "pk": 3303308,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 8,
      "text": "Let all the earth fear the LORD; let all the inhabitants of the world stand in awe of Him.",
      "links": "<a href='/AIV/19/22/23'>Psalm 22:23</a>; <a href='/AIV/19/67/7'>Psalm 67:7</a>",
      "comment": "All nations are called to reverence God. In Catholic thought, this hints at the universality of the Church’s mission and salvation (cf. Matthew 28:19)."
    },
    {
      "pk": 3303309,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 9,
      "text": "For He spoke, and it came to be; He commanded, and it stood firm.",
      "links": "<a href='/AIV/1/1/3'>Genesis 1:3</a>; <a href='/AIV/19/148/5'>Psalm 148:5</a>",
      "comment": "God’s power to create by His word prefigures the spoken words of Christ and the efficacious nature of sacramental words in Catholic tradition."
    },
    {
      "pk": 3303310,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 10,
      "text": "The LORD brings the counsel of the nations to nothing; He frustrates the plans of the peoples.",
      "links": "<a href='/AIV/23/8/10'>Isaiah 8:10</a>; <a href='/AIV/19/2/1'>Psalm 2:1</a>",
      "comment": "God's sovereignty over world affairs is a reminder of His providence. In Catholic thought, history unfolds under God’s guidance, often contrary to human designs."
    },
    {
      "pk": 3303311,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 11,
      "text": "The counsel of the LORD stands forever, the plans of His heart to all generations.",
      "links": "<a href='/AIV/19/33/10'>Psalm 33:10</a>; <a href='/AIV/19/102/12'>Psalm 102:12</a>",
      "comment": "The permanence of God’s will echoes the Catholic teaching on the enduring faithfulness of God’s covenant—a covenant sealed and fulfilled in Christ."
    },
    {
      "pk": 3303312,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 12,
      "text": "Blessed is the nation whose God is the LORD, the people He has chosen as His inheritance.",
      "links": "<a href='/AIV/19/144/15'>Psalm 144:15</a>; <a href='/AIV/5/7/6'>Deuteronomy 7:6</a>",
      "comment": "Israel as God’s chosen nation is a type of the Church, the new people of God, as taught in Catholic doctrine (cf. 1 Peter 2:9)."
    },
    {
      "pk": 3303313,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 13,
      "text": "The LORD looks down from heaven; He sees all the children of mankind.",
      "links": "<a href='/AIV/19/14/2'>Psalm 14:2</a>; <a href='/AIV/19/102/19'>Psalm 102:19</a>",
      "comment": "God’s universal gaze points toward the dignity of every human as taught in the doctrine of creation."
    },
    {
      "pk": 3303314,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 14,
      "text": "From where He dwells, He looks out on all the inhabitants of the earth.",
      "links": "<a href='/AIV/19/11/4'>Psalm 11:4</a>",
      "comment": "The psalm emphasizes God’s transcendence but also His immanence, a theme developed in Catholic spirituality."
    },
    {
      "pk": 3303315,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 15,
      "text": "He forms the hearts of all; He observes all their deeds.",
      "links": "<a href='/AIV/20/21/2'>Proverbs 21:2</a>; <a href='/AIV/1/6/5'>Genesis 6:5</a>",
      "comment": "God’s shaping of the human heart corresponds to Catholic teaching on prevenient grace and the transformative work of sanctification."
    },
    {
      "pk": 3303316,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 16,
      "text": "No king is saved by the size of his army; no warrior escapes by his great strength.",
      "links": "<a href='/AIV/9/17/47'>1 Samuel 17:47</a>; <a href='/AIV/19/44/6'>Psalm 44:6</a>",
      "comment": "Human resources are inadequate for salvation; true reliance must be on God—anticipating the Catholic view of salvation not by works alone, but by grace."
    },
    {
      "pk": 3303317,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 17,
      "text": "The horse is a false hope for salvation; by its great might it cannot rescue.",
      "links": "<a href='/AIV/20/21/31'>Proverbs 21:31</a>; <a href='/AIV/19/20/7'>Psalm 20:7</a>",
      "comment": "Earthly powers cannot save; Catholics see in this the necessity of supernatural means, such as the sacraments and prayer."
    },
    {
      "pk": 3303318,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 18,
      "text": "Behold, the eye of the LORD is on those who fear Him, on those who hope in His lovingkindness,",
      "links": "<a href='/AIV/19/34/15'>Psalm 34:15</a>; <a href='/AIV/19/147/11'>Psalm 147:11</a>",
      "comment": "'Fear' and 'hope' go together; Catholic doctrine upholds both reverent awe (filial fear) and trust in God's mercy as essential virtues."
    },
    {
      "pk": 3303319,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 19,
      "text": "that He may deliver their soul from death, and keep them alive in famine.",
      "links": "<a href='/AIV/19/34/22'>Psalm 34:22</a>; <a href='/AIV/2/23/25'>Exodus 23:25</a>",
      "comment": "Deliverance from death here is physical but points toward spiritual salvation in Christ, fulfilled most fully through the resurrection—at the center of Catholic faith."
    },
    {
      "pk": 3303320,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 20,
      "text": "Our soul waits for the LORD; He is our help and our shield.",
      "links": "<a href='/AIV/19/3/3'>Psalm 3:3</a>; <a href='/AIV/19/115/9'>Psalm 115:9</a>",
      "comment": "'Waits' denotes hopeful trust—a quality the Catholic Church sees as cultivated especially in the community gathered in prayer and sacraments."
    },
    {
      "pk": 3303321,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 21,
      "text": "For our heart rejoices in Him, because we trust in His holy Name.",
      "links": "<a href='/AIV/19/13/5'>Psalm 13:5</a>; <a href='/AIV/19/9/10'>Psalm 9:10</a>",
      "comment": "'Holy Name' hints at a deeper revelation in Christ (cf. Philippians 2:9–11), and the Catholic devotion to the Holy Name reflects this same confidence."
    },
    {
      "pk": 3303322,
      "translation": "AIV",
      "book": 19,
      "chapter": 33,
      "verse": 22,
      "text": "Let Your lovingkindness, O LORD, be upon us, even as we hope in You.",
      "links": "<a href='/AIV/19/33/18'>Psalm 33:18</a>; <a href='/AIV/19/6/4'>Psalm 6:4</a>",
      "comment": "The final prayer unites hope and God's steadfast love—a classic emphasis in Catholic spirituality, cultivated in the Eucharist, which is the source and summit of Christian hope."
    }
  ],
  "translatedAt": "2025-12-22T21:30:30.727Z"
}