{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 56,
  "verses": [
    {
      "pk": 5005601,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 1,
      "text": "Be gracious to me, O God, for people trample me; all day long they attack and oppress me.",
      "links": "<a href='/AIV/19/57/1'>Ps. 57:1</a>; <a href='/AIV/19/86/3'>Ps. 86:3</a>",
      "comment": "The plea for grace in distress directly echoes David’s recurring petitions throughout the Psalms. The language underscores total reliance upon God's mercy, a theme foundational to Catholic soteriology promoting grace as central to salvation."
    },
    {
      "pk": 5005602,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 2,
      "text": "My enemies pursue me all day long; many attack me from on high.",
      "links": "<a href='/AIV/19/69/4'>Ps. 69:4</a>; <a href='/AIV/19/143/3'>Ps. 143:3</a>",
      "comment": "David's enemies are relentless, highlighting the ongoing spiritual struggle Christians face (cf. Eph. 6:12). Catholic commentators see such persecution as refining faith, much as trials purify the soul for sanctification."
    },
    {
      "pk": 5005603,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 3,
      "text": "When I am afraid, I put my trust in you.",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>; <a href='/AIV/19/112/7'>Ps. 112:7</a>",
      "comment": "Trusting God amid fear points to the virtue of faith. Catholics emphasize that such faith is not mere intellectual assent, but also expressed in prayer and sacramental life. Protestants also value sola fide, but the Psalm hints at a deeper communal and liturgical reliance."
    },
    {
      "pk": 5005604,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 4,
      "text": "In God, whose word I praise— in God I trust; I shall not be afraid. What can mere mortals do to me?",
      "links": "<a href='/AIV/19/118/6'>Ps. 118:6</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "The theme that human threats are impotent compared to God's power is essential for Christians facing persecution. The phrase 'whose word I praise' prefigures the reverence for sacred Scripture, later formalized in Catholic liturgy and the value of oral tradition."
    },
    {
      "pk": 5005605,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 5,
      "text": "All day long they twist my words; they conspire against me for evil.",
      "links": "<a href='/AIV/19/41/7'>Ps. 41:7</a>; <a href='/AIV/42/11/54'>Luke 11:54</a>",
      "comment": "Enemies twisting words echoes the accusations Jesus faced (see Luke 11:54) and points towards the fulfillment in Christ's Passion. The malicious distortion of truth also recalls the Church’s later defense of apostolic teaching against heresy."
    },
    {
      "pk": 5005606,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 6,
      "text": "They gather, they hide, they watch my steps, as they wait for my life.",
      "links": "<a href='/AIV/19/10/8'>Ps. 10:8</a>; <a href='/AIV/43/7/1'>John 7:1</a>",
      "comment": "The Psalmist’s experience of being watched and hunted is a foreshadowing of Christ’s persecutors; it models for Christians the need for vigilance and perseverance, virtues extolled in Catholic spiritual tradition."
    },
    {
      "pk": 5005607,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 7,
      "text": "For their evil, will they escape? In your anger cast down the peoples, O God.",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/19/7/6'>Ps. 7:6</a>",
      "comment": "The Psalmist requests divine justice, revealing both the mercy and justice of God—a balance emphasized in Catholic doctrine. God's judgment is petitioned, reminding believers to seek both forgiveness and righteousness."
    },
    {
      "pk": 5005608,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 8,
      "text": "You have counted my wanderings; put my tears in your bottle. Are they not in your book?",
      "links": "<a href='/AIV/19/139/3'>Ps. 139:3</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "God’s personal care for each sorrow (‘your bottle’) resonates with the Church’s understanding of divine providence and the sanctity of human suffering. The ‘book’ is reminiscent of the Book of Life (Rev. 21:4), subtly supporting the Catholic tradition of God remembering the faithful through personal acts and intercession."
    },
    {
      "pk": 5005609,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 9,
      "text": "Then my enemies will turn back in the day I call. This I know: God is for me.",
      "links": "<a href='/AIV/19/38/15'>Ps. 38:15</a>; <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "Confidence that God is ‘for’ his people prefigures Paul in Romans 8:31. Catholics reflect on God’s advocacy through both Christ and His Church, viewing prayer as communal and intercessory—a subtle hint at the value of the Communion of Saints."
    },
    {
      "pk": 5005610,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 10,
      "text": "In God, whose word I praise, in the LORD, whose word I praise,",
      "links": "<a href='/AIV/19/119/89'>Ps. 119:89</a>; <a href='/AIV/19/138/2'>Ps. 138:2</a>",
      "comment": "Doubling the praise for God’s 'Word' highlights reverence for divine revelation. Catholics understand the ‘word’ as not only written Scripture, but also tradition preserved through liturgy and the teaching authority of the Church (Magisterium)."
    },
    {
      "pk": 5005611,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 11,
      "text": "in God I trust; I shall not be afraid. What can man do to me?",
      "links": "<a href='/AIV/19/118/6'>Ps. 118:6</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "Repeats the reliance on God rather than fearing humanity. Catholic mystics have frequently written about this detachment from worldly threats—echoing the Psalmist, and appearing in Jesus’ teaching to 'fear not' (Matt. 10:28)."
    },
    {
      "pk": 5005612,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 12,
      "text": "I must keep the vows I made to you, O God; I will render thank offerings to you.",
      "links": "<a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/19/61/8'>Ps. 61:8</a>",
      "comment": "The mention of vows and thank offerings points to sacrificial worship. In Catholicism this is spiritually fulfilled at the Eucharist, understood as the new and perfect thanksgiving (cf. Ps. 50:14). Subtly, the Psalm prefigures sacramental living."
    },
    {
      "pk": 5005613,
      "translation": "AIV",
      "book": 19,
      "chapter": 56,
      "verse": 13,
      "text": "For you have delivered my soul from death, yes, my feet from stumbling, that I may walk before God in the light of life.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/43/8/12'>John 8:12</a>; <a href='/AIV/62/1/7'>1 John 1:7</a>",
      "comment": "God’s deliverance from death and enabling to 'walk in the light' foreshadows the resurrection and life offered through Jesus Christ (cf. John 8:12), integrating both literal and spiritual meanings. Catholic theology finds here a basis for the doctrine of sanctifying grace, which enables believers to ‘walk before God’ in holiness. The phrase parallels the Church’s teaching on salvation as both a deliverance and a lifelong pilgrimage in grace."
    }
  ],
  "translatedAt": "2025-12-22T21:37:33.373Z"
}