{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 41,
  "verses": [
    {
      "pk": 4104101,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 1,
      "text": "Blessed is the one who cares for the poor; the LORD will deliver him in the day of trouble.",
      "links": "<a href='/AIV/19/82/3'>Ps. 82:3</a>; <a href='/AIV/20/14/21'>Prov. 14:21</a>",
      "comment": "The blessing attached to caring for the poor points toward works of mercy. In Catholic tradition, these are essential for living out faith (see Jas. 2:14-17), subtly affirming that faith and works go together."
    },
    {
      "pk": 4104102,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 2,
      "text": "The LORD will protect him and preserve his life; he will be blessed in the land. You will not give him up to the desire of his enemies.",
      "links": "<a href='/AIV/19/37/40'>Ps. 37:40</a>; <a href='/AIV/19/27/5'>Ps. 27:5</a>",
      "comment": "This verse implies divine protection and blessing, echoing the Catholic emphasis on God’s providence through saints and the community of believers."
    },
    {
      "pk": 4104103,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 3,
      "text": "The LORD will strengthen him on his sickbed; in his illness, you restore him to health.",
      "links": "<a href='/AIV/19/147/3'>Ps. 147:3</a>; <a href='/AIV/19/6/2'>Ps. 6:2</a>",
      "comment": "God’s restorative work during sickness echoes the sacramental theology of Catholicism, especially the Anointing of the Sick (see Jas. 5:14-15). God's care is tangible."
    },
    {
      "pk": 4104104,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 4,
      "text": "I said, 'O LORD, be gracious to me; heal my soul, for I have sinned against you.'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>; <a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "The psalmist confesses sin and seeks mercy—a foreshadowing of sacramental confession (see 1 Jn. 1:9). The Catholic view of ongoing repentance aligns closely here."
    },
    {
      "pk": 4104105,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 5,
      "text": "My enemies speak evil of me, saying, 'When will he die and his name perish?'",
      "links": "<a href='/AIV/19/35/19'>Ps. 35:19</a>; <a href='/AIV/19/38/12'>Ps. 38:12</a>",
      "comment": "Suffering at the hands of enemies mirrors Christ’s own experience (see Jn. 15:25). The righteous often face persecution, a theme the Church teaches as sharing in Christ’s suffering."
    },
    {
      "pk": 4104106,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 6,
      "text": "And if one comes to see me, he speaks falsely; his heart gathers wickedness; when he goes out, he tells it abroad.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>; <a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "False friends and slander foreshadow Judas’ betrayal of Jesus (see Jn. 13:18, with Ps. 41:9 cited directly), highlighting prophetic elements fulfilled in Christ."
    },
    {
      "pk": 4104107,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 7,
      "text": "All who hate me whisper together against me; they imagine the worst for me.",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/19/38/12'>Ps. 38:12</a>",
      "comment": "Communal opposition is a recurring motif in the Psalms and in the Passion narratives, subtly connecting personal suffering to participation in Christ’s suffering."
    },
    {
      "pk": 4104108,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 8,
      "text": "'A deadly thing has been poured out on him; he will not rise again from where he lies.'",
      "links": "<a href='/AIV/19/71/20'>Ps. 71:20</a>; <a href='/AIV/19/88/3-4'>Ps. 88:3-4</a>",
      "comment": "This imagery of death and hopelessness echoes Christ’s passion and hints at resurrection—especially when read next to verse 10, where recovery is sought."
    },
    {
      "pk": 4104109,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 9,
      "text": "Even my close friend, whom I trusted, who ate my bread, has lifted his heel against me.",
      "links": "<a href='/AIV/43/13/18'>John 13:18</a>; <a href='/AIV/19/55/12-14'>Ps. 55:12-14</a>",
      "comment": "Direct prophecy: Jesus cites this in John 13:18 regarding Judas. The shared bread is highly significant sacramentally in Catholic theology, connecting with the Eucharist."
    },
    {
      "pk": 4104110,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 10,
      "text": "But you, O LORD, be gracious to me, and raise me up, that I may repay them.",
      "links": "<a href='/AIV/19/27/6'>Ps. 27:6</a>; <a href='/AIV/19/71/20'>Ps. 71:20</a>",
      "comment": "The plea to be raised up has both literal (restoration from illness) and spiritual (resurrection) undertones. The concept of restoration is deeply Catholic, touching on forgiveness and spiritual renewal."
    },
    {
      "pk": 4104111,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 11,
      "text": "By this I know that you delight in me: my enemy does not triumph over me.",
      "links": "<a href='/AIV/19/18/19'>Ps. 18:19</a>; <a href='/AIV/19/30/1'>Ps. 30:1</a>",
      "comment": "Divine favor is indicated by victory over enemies. Catholic tradition sees such triumph as the fruit of grace and perseverance, not just personal effort."
    },
    {
      "pk": 4104112,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 12,
      "text": "As for me, you uphold me in my integrity and set me before your face forever.",
      "links": "<a href='/AIV/19/17/15'>Ps. 17:15</a>; <a href='/AIV/19/37/18'>Ps. 37:18</a>",
      "comment": "Being set before God's face forever evokes the Catholic understanding of the beatific vision—final and eternal union with God."
    },
    {
      "pk": 4104113,
      "translation": "AIV",
      "book": 19,
      "chapter": 41,
      "verse": 13,
      "text": "Blessed be the LORD, the God of Israel, from everlasting to everlasting! Amen and Amen.",
      "links": "<a href='/AIV/19/106/48'>Ps. 106:48</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>",
      "comment": "Doxology concluding Book I of Psalms. The twofold 'Amen' foreshadows Catholic liturgical formulae and emphasizes communal agreement in worship."
    }
  ],
  "translatedAt": "2025-12-22T21:33:21.764Z"
}