{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 59,
  "verses": [
    {
      "pk": 1959001,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 1,
      "text": "Deliver me from my enemies, O my God; protect me from those who rise up against me.",
      "links": "<a href='/AIV/19/18/48'>Ps. 18:48</a>; <a href='/AIV/19/56/1'>Ps. 56:1</a>",
      "comment": "David begins this psalm as a prayer for deliverance, trusting God's protection against external threats. The language echoes the confidence of God’s power over evil, much like the Church’s appeal to God’s defense against persecution."
    },
    {
      "pk": 1959002,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 2,
      "text": "Rescue me from those who work evil, and save me from men of bloodshed.",
      "links": "<a href='/AIV/19/26/9-10'>Ps. 26:9–10</a>; <a href='/AIV/19/140/1'>Ps. 140:1</a>",
      "comment": "The theme of rescue from sinners and evildoers prefigures Christ’s prayer in John 17:15 (<a href='/AIV/43/17/15'>John 17:15</a>), asking protection from the evil one. The spiritual dimension points to the Church’s continual supplication for deliverance from sin through sacramental means."
    },
    {
      "pk": 1959003,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 3,
      "text": "For behold, they lie in wait for my life; fierce men stir against me, not for any fault or sin of mine, O LORD.",
      "links": "<a href='/AIV/19/56/6'>Ps. 56:6</a>; <a href='/AIV/09/19/11'>1 Sam. 19:11</a>",
      "comment": "This context refers to Saul sending men to watch David’s house (<a href='/AIV/09/19/11'>1 Sam. 19:11</a>). Innocence in suffering is a theme later found in Christ’s Passion (<a href='/AIV/40/27/19-23'>Matt. 27:19, 23</a>)."
    },
    {
      "pk": 1959004,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 4,
      "text": "Without any fault they run and prepare themselves. Awake to meet me, and see!",
      "links": "<a href='/AIV/19/35/23'>Ps. 35:23</a>",
      "comment": "David asks God to act, showing confident expectation. Note the repeated biblical motif of God ‘arising’, as in Ps. 35:23. The plea anticipates the liturgical invocation in Mass and the necessity of God’s intervention through grace."
    },
    {
      "pk": 1959005,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 5,
      "text": "You, O LORD God of hosts, God of Israel, awake to punish all the nations. Do not be gracious to any wicked traitors.",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/83/18'>Ps. 83:18</a>; <a href='/AIV/19/140/8'>Ps. 140:8</a>",
      "comment": "God’s justice is highlighted. The mention of ‘all the nations’ prepares the way for the universal scope of salvation, which will be fulfilled in Christ’s redemptive work for both Jew and Gentile (<a href='/AIV/45/3/29-30'>Rom. 3:29–30</a>)."
    },
    {
      "pk": 1959006,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 6,
      "text": "They return at evening, snarling like dogs, and go around the city.",
      "links": "<a href='/AIV/19/22/16'>Ps. 22:16</a>; <a href='/AIV/19/59/14'>Ps. 59:14</a>",
      "comment": "‘Dogs’ often represent impure or pagan aggressors (<a href='/AIV/19/22/16'>Ps. 22:16</a>). The image of surrounding at night alludes to spiritual darkness, a motif continued in Christ’s night-time suffering and trial."
    },
    {
      "pk": 1959007,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 7,
      "text": "See what they spew from their mouths: swords are on their lips, for they say, 'Who hears?'",
      "links": "<a href='/AIV/19/10/11'>Ps. 10:11</a>; <a href='/AIV/19/12/4'>Ps. 12:4</a>",
      "comment": "Words as ‘swords’ emphasize the destructive power of speech. Catholics see this as an underlying reason for the discipline of the tongue and the significance of penance for sins of word."
    },
    {
      "pk": 1959008,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 8,
      "text": "But You, O LORD, will laugh at them; You hold all nations in derision.",
      "links": "<a href='/AIV/19/2/4'>Ps. 2:4</a>",
      "comment": "God’s sovereignty and transcendence over all nations is clear. Compare with Ps. 2:4. This sovereignty is later manifested fully in Christ the King, whose reign is over all peoples."
    },
    {
      "pk": 1959009,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 9,
      "text": "O my Strength, I watch for You; for You, O God, are my fortress.",
      "links": "<a href='/AIV/19/18/1-2'>Ps. 18:1–2</a>; <a href='/AIV/19/59/17'>Ps. 59:17</a>",
      "comment": "David uses titles for God that are foundational for later Christian theology: ‘fortress’ and ‘strength’ point to reliance on God alone—a principle affirmed in Catholic teaching on grace and the sacraments."
    },
    {
      "pk": 1959010,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 10,
      "text": "My God in His steadfast love will meet me; God will let me look in triumph on my enemies.",
      "links": "<a href='/AIV/19/21/8'>Ps. 21:8</a>; <a href='/AIV/19/59/17'>Ps. 59:17</a>",
      "comment": "The centrality of 'steadfast love' (hesed) anticipates the New Testament revelation of God’s mercy in Christ. The notion of meeting points subtly at the Eucharist—God coming to meet his people."
    },
    {
      "pk": 1959011,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 11,
      "text": "Do not kill them, lest my people forget; make them wander by Your power, and bring them down, O Lord our shield.",
      "links": "<a href='/AIV/19/83/17'>Ps. 83:17</a>",
      "comment": "Rather than swift destruction, David asks for God's justice to be a lesson to his people. The spiritual interpretation aligns with the Catholic understanding of God's chastisement as a tool for conversion and growth in holiness."
    },
    {
      "pk": 1959012,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 12,
      "text": "For the sin of their mouth, the words of their lips, let them be caught in their pride. For the curses and lies they utter.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15–16</a>; <a href='/AIV/19/109/2-3'>Ps. 109:2–3</a>",
      "comment": "This verse demonstrates the serious consequences of pride and lying, highlighting the frequent biblical warnings against these sins (<a href='/AIV/20/16/18'>Prov. 16:18</a>)."
    },
    {
      "pk": 1959013,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 13,
      "text": "Consume them in wrath; consume them till they are no more, so that they shall know that God rules over Jacob to the ends of the earth.",
      "links": "<a href='/AIV/19/46/10'>Ps. 46:10</a>; <a href='/AIV/19/83/18'>Ps. 83:18</a>",
      "comment": "The desire for evil’s defeat points ultimately to the final victory of Christ—see <a href='/AIV/66/19/15'>Rev. 19:15</a>. 'To the ends of the earth' echoes the Church's universal mission (cf. Acts 1:8)."
    },
    {
      "pk": 1959014,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 14,
      "text": "They return at evening, snarling like dogs, and wander about the city.",
      "links": "<a href='/AIV/19/59/6'>Ps. 59:6</a>; <a href='/AIV/19/22/16'>Ps. 22:16</a>",
      "comment": "Repetition for emphasis: the enemies' persistence speaks to ongoing spiritual warfare. The motif of wandering and restlessness is picked up in the Church's teaching on mortal sin and alienation from grace."
    },
    {
      "pk": 1959015,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 15,
      "text": "They wander about for food and growl if they are not satisfied.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "The imagery contrasts with those who seek the Lord, whom He sustains. In a sacramental view, Christ Himself is the ‘bread of life’ for all who hunger after righteousness (<a href='/AIV/43/6/35'>John 6:35</a>)."
    },
    {
      "pk": 1959016,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 16,
      "text": "But I will sing of Your strength; I will sing aloud of Your steadfast love in the morning. For You have been my fortress and my refuge in the day of my distress.",
      "links": "<a href='/AIV/19/46/1'>Ps. 46:1</a>; <a href='/AIV/19/59/9'>Ps. 59:9</a>",
      "comment": "Morning praise after night suffering prefigures Resurrection joy. Church tradition holds the morning as a time for prayer, mirrored in liturgical hours, linking personal prayer to the communal worship of God."
    },
    {
      "pk": 1959017,
      "translation": "AIV",
      "book": 19,
      "chapter": 59,
      "verse": 17,
      "text": "O my Strength, I will sing praises to You, for You, O God, are my fortress, the God who shows me steadfast love.",
      "links": "<a href='/AIV/19/18/1-2'>Ps. 18:1–2</a>; <a href='/AIV/19/59/9'>Ps. 59:9</a>",
      "comment": "The psalm concludes with triumphant praise, celebrating God’s protection and love. 'Steadfast love' is the repeated theme, fulfilled in the New Covenant through Christ. The emphasis on song and praise is foundational for the Church’s liturgy and the Mass."
    }
  ],
  "translatedAt": "2025-12-22T21:38:34.192Z"
}