{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 135,
  "verses": [
    {
      "pk": 1913501,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 1,
      "text": "Praise the LORD! Praise the name of the LORD; give praise, you servants of the LORD,",
      "links": "<a href='/AIV/19/113/1'>Ps. 113:1</a>; <a href='/AIV/19/134/1'>Ps. 134:1</a>",
      "comment": "The psalm begins as a call to worship, specifically directed to those who serve in the temple, anticipating the role of a set-apart, ordained ministry in the worship life of the people of God."
    },
    {
      "pk": 1913502,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 2,
      "text": "who stand in the house of the LORD, in the courts of the house of our God!",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>; <a href='/AIV/19/92/13'>Ps. 92:13</a>",
      "comment": "The focus on the house and courts of God underlines the continuity of worship centered at a holy place, pointing forward to forms of worship that emphasize God’s enduring presence in His sanctuary."
    },
    {
      "pk": 1913503,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 3,
      "text": "Praise the LORD, for the LORD is good; sing praises to his name, for it is pleasant!",
      "links": "<a href='/AIV/19/100/5'>Ps. 100:5</a>; <a href='/AIV/19/147/1'>Ps. 147:1</a>",
      "comment": "Emphasizes both the goodness of God and the inherent joy and beauty of worship—a foundational principle for both Old and New Testament worship."
    },
    {
      "pk": 1913504,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 4,
      "text": "For the LORD has chosen Jacob for himself, Israel as his treasured possession.",
      "links": "<a href='/AIV/05/7/6'>Deut. 7:6</a>; <a href='/AIV/19/33/12'>Ps. 33:12</a>",
      "comment": "The doctrine of divine election is clear here—God freely chooses and treasures His people (cf. <a href='/AIV/60/2/9'>1 Peter 2:9</a>), pointing to a communal identity rooted in being set apart and specially chosen."
    },
    {
      "pk": 1913505,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 5,
      "text": "For I know that the LORD is great, and our Lord is above all gods.",
      "links": "<a href='/AIV/19/86/8-10'>Ps. 86:8-10</a>; <a href='/AIV/19/97/9'>Ps. 97:9</a>",
      "comment": "Affirms monotheism and God’s supremacy over any so-called gods, which ties into later developments in Christian doctrine emphasizing the one true God revealed most fully in Christ."
    },
    {
      "pk": 1913506,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 6,
      "text": "Whatever the LORD pleases, he does, in heaven and on earth, in the seas and all the deeps.",
      "links": "<a href='/AIV/19/115/3'>Ps. 115:3</a>; <a href='/AIV/27/4/35'>Dan. 4:35</a>",
      "comment": "God’s absolute sovereignty and creative power are stressed—echoing the creation account and anticipating an understanding of providence that shapes Christian confidence in God’s will being active everywhere."
    },
    {
      "pk": 1913507,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 7,
      "text": "He causes the clouds to rise from the ends of the earth; he makes lightning for the rain and brings forth the wind from his storehouses.",
      "links": "<a href='/AIV/24/10/13'>Jer. 10:13</a>; <a href='/AIV/19/104/3-4'>Ps. 104:3-4</a>",
      "comment": "Highlights God’s ongoing governance of creation, connecting to biblical themes of God’s creative Word sustaining the world (see <a href='/AIV/58/1/3'>Heb. 1:3</a>)."
    },
    {
      "pk": 1913508,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 8,
      "text": "He struck down the firstborn of Egypt, both of man and beast;",
      "links": "<a href='/AIV/02/12/29-30'>Ex. 12:29-30</a>",
      "comment": "A reference to the Exodus, showing God’s ability to judge and redeem—foreshadowing deliverance themes found in the New Testament."
    },
    {
      "pk": 1913509,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 9,
      "text": "He sent signs and wonders into your midst, O Egypt, upon Pharaoh and all his servants.",
      "links": "<a href='/AIV/02/7/3'>Ex. 7:3</a>; <a href='/AIV/19/78/43'>Ps. 78:43</a>",
      "comment": "Recalls the miracles during the Exodus, reinforcing trust in God’s power and the importance of remembering the acts of God in salvation history."
    },
    {
      "pk": 1913510,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 10,
      "text": "He struck down many nations and killed mighty kings,",
      "links": "<a href='/AIV/04/21/24'>Num. 21:24</a>; <a href='/AIV/05/29/7'>Deut. 29:7</a>",
      "comment": "Highlights God’s judgment on the nations for the sake of His people, prefiguring Christ’s victory over sin and spiritual enemies."
    },
    {
      "pk": 1913511,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 11,
      "text": "Sihon, king of the Amorites, and Og, king of Bashan, and all the kingdoms of Canaan,",
      "links": "<a href='/AIV/04/21/21-35'>Num. 21:21–35</a>; <a href='/AIV/05/3/1-11'>Deut. 3:1–11</a>",
      "comment": "Specific examples of God’s deliverance for Israel, showing how God works through history to fulfill His promises."
    },
    {
      "pk": 1913512,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 12,
      "text": "and gave their land as a heritage, a heritage to Israel his people.",
      "links": "<a href='/AIV/06/11/23'>Josh. 11:23</a>; <a href='/AIV/19/136/21-22'>Ps. 136:21-22</a>",
      "comment": "Emphasizes inheritance, which has both literal and spiritual significance—pointing forward to the promise of a lasting heritage and unity for the people of God."
    },
    {
      "pk": 1913513,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 13,
      "text": "Your name, O LORD, endures forever, your fame, O LORD, throughout all generations.",
      "links": "<a href='/AIV/19/102/12'>Ps. 102:12</a>; <a href='/AIV/02/3/15'>Ex. 3:15</a>",
      "comment": "God’s eternal name points to His unchanging nature, anticipating Jesus’ own claim to share in God’s eternal identity (<a href='/AIV/43/8/58'>John 8:58</a>)."
    },
    {
      "pk": 1913514,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 14,
      "text": "For the LORD will vindicate his people and have compassion on his servants.",
      "links": "<a href='/AIV/05/32/36'>Deut. 32:36</a>; <a href='/AIV/19/90/13'>Ps. 90:13</a>",
      "comment": "Underscores God’s faithfulness and mercy. The Lord’s compassion connects to New Testament passages where Jesus is moved by compassion for God’s people."
    },
    {
      "pk": 1913515,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 15,
      "text": "The idols of the nations are silver and gold, the work of human hands.",
      "links": "<a href='/AIV/19/115/4'>Ps. 115:4</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "Contrasts the living God with lifeless idols, reinforcing the necessity of worship directed towards the true God in the way He establishes."
    },
    {
      "pk": 1913516,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 16,
      "text": "They have mouths, but do not speak; they have eyes, but do not see;",
      "links": "<a href='/AIV/19/115/5'>Ps. 115:5</a>; <a href='/AIV/23/46/7'>Isa. 46:7</a>",
      "comment": "Human-made idols are powerless, in contrast to the living, speaking God, who continues to reveal Himself to His people throughout salvation history."
    },
    {
      "pk": 1913517,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 17,
      "text": "they have ears, but do not hear, nor is there any breath in their mouths.",
      "links": "<a href='/AIV/19/115/6'>Ps. 115:6</a>; <a href='/AIV/24/10/14'>Jer. 10:14</a>",
      "comment": "The theme of lifelessness in idols prepares for a fuller revelation of the God who, by His Spirit, gives life and breath, preparing for the New Covenant understanding."
    },
    {
      "pk": 1913518,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 18,
      "text": "Those who make them become like them, so do all who trust in them.",
      "links": "<a href='/AIV/19/115/8'>Ps. 115:8</a>",
      "comment": "Spiritual principle: people grow to resemble what they worship, underscoring the importance of rightly ordered worship and fidelity to the living God."
    },
    {
      "pk": 1913519,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 19,
      "text": "O house of Israel, bless the LORD! O house of Aaron, bless the LORD!",
      "links": "<a href='/AIV/19/115/12'>Ps. 115:12</a>; <a href='/AIV/19/118/3'>Ps. 118:3</a>",
      "comment": "All the people, including the priestly house of Aaron, are called to bless God, hinting toward God’s design of an enduring, ordered priesthood."
    },
    {
      "pk": 1913520,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 20,
      "text": "O house of Levi, bless the LORD! You who fear the LORD, bless the LORD!",
      "links": "<a href='/AIV/19/22/23'>Ps. 22:23</a>; <a href='/AIV/19/135/1-2'>Ps. 135:1-2</a>",
      "comment": "God’s blessing is to be proclaimed by both those specifically set apart for sacred service and by all the faithful, pointing to unity in the worshiping community."
    },
    {
      "pk": 1913521,
      "translation": "AIV",
      "book": 19,
      "chapter": 135,
      "verse": 21,
      "text": "Blessed be the LORD from Zion, he who dwells in Jerusalem! Praise the LORD!",
      "links": "<a href='/AIV/19/134/3'>Ps. 134:3</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "Ends by situating God’s dwelling in Zion/Jerusalem, a foreshadowing of God’s special presence among His people, fulfilled in the New Testament as Christ establishes the community of believers as the place where God dwells most fully."
    }
  ],
  "translatedAt": "2025-12-23T05:48:46.662Z"
}