{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 78,
  "verses": [
    {
      "pk": 1978078,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 1,
      "text": "Give ear, my people, to my teaching; incline your ears to the words of my mouth.",
      "links": "<a href='/AIV/19/49/1'>Ps. 49:1</a>; <a href='/AIV/19/81/8'>Ps. 81:8</a>",
      "comment": "The psalm opens with a call to listen carefully, reminiscent of the way Jesus calls his listeners to hear and understand his parables. The Catholic Church often emphasizes the importance of both Scripture and Tradition as sources of teaching, resonating with this admonition to pay heed."
    },
    {
      "pk": 1978079,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 2,
      "text": "I will open my mouth in a parable; I will utter hidden things, things from of old—",
      "links": "<a href='/AIV/40/13/35'>Matt. 13:35</a>; <a href='/AIV/19/49/4'>Ps. 49:4</a>",
      "comment": "This verse is directly applied to Christ in Matthew 13:35, showing the fulfillment of messianic prophecy. Christ as the new teacher utters mysteries, inviting us to enter more deeply into understanding Scripture, much as the Church does in her catechesis."
    },
    {
      "pk": 1978080,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 3,
      "text": "things that we have heard and known, that our fathers have told us.",
      "links": "<a href='/AIV/19/44/1'>Ps. 44:1</a>; <a href='/AIV/20/4/1'>Prov. 4:1'>",
      "comment": "The transmission of faith and knowledge from generation to generation echoes the Catholic understanding of apostolic succession and tradition."
    },
    {
      "pk": 1978081,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 4,
      "text": "We will not hide them from their children, but tell the next generation the praises of the LORD, his power, and the wondrous works that he has done.",
      "links": "<a href='/AIV/19/145/4'>Ps. 145:4</a>; <a href='/AIV/02/13/8-9'>Ex. 13:8–9</a>",
      "comment": "Passing down the deeds of God to children is a responsibility in both Testaments, connecting to Deuteronomy 6:7. This idea finds its fulfillment in family life and catechesis, both central to Catholic practice."
    },
    {
      "pk": 1978082,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 5,
      "text": "He established a testimony in Jacob and set a law in Israel, which he commanded our fathers to teach their children,",
      "links": "<a href='/AIV/05/06/7'>Deut. 6:7</a>; <a href='/AIV/19/19/7'>Ps. 19:7</a>",
      "comment": "The giving of the Law to Israel marks a unique moment, showing God's commitment to his people, hinting at the covenantal structure that finds its fullness in Christ and the new covenant administered sacramentally."
    },
    {
      "pk": 1978083,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 6,
      "text": "so that the next generation might know them, even the children yet to be born, and they in turn would tell their children.",
      "links": "<a href='/AIV/19/102/18'>Ps. 102:18</a>; <a href='/AIV/05/04/9'>Deut. 4:9</a>",
      "comment": "The continuity of faith is highlighted, analogously to the Church’s continuous preaching and the safeguarding of doctrines through generations."
    },
    {
      "pk": 1978084,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 7,
      "text": "So that they should set their hope in God and not forget the works of God, but keep his commandments.",
      "links": "<a href='/AIV/05/08/11'>Deut. 8:11</a>; <a href='/AIV/19/103/2'>Ps. 103:2</a>",
      "comment": "Setting hope in God is both an act and attitude, prepared by remembering his deeds and keeping his commands—a theme continued in the Church's encouragement to not merely recall but live according to God’s will."
    },
    {
      "pk": 1978085,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 8,
      "text": "And they should not be like their fathers, a stubborn and rebellious generation, a generation whose hearts were not loyal, and whose spirits were not faithful to God.",
      "links": "<a href='/AIV/04/14/22'>Num. 14:22</a>; <a href='/AIV/19/106/7'>Ps. 106:7</a>",
      "comment": "The Church calls for conversion of heart, turning from stubbornness to faithfulness, as seen in penitential practices and confession, which renew our loyalty."
    },
    {
      "pk": 1978086,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 9,
      "text": "The sons of Ephraim, armed with bows, turned back on the day of battle.",
      "links": "<a href='/AIV/01/48/17-19'>Gen. 48:17–19</a>; <a href='/AIV/19/80/2'>Ps. 80:2</a>",
      "comment": "Ephraim’s failure to stand firm suggests the need for courage and fidelity. This connects spiritually to perseverance in faith, often emphasized in Catholic spirituality."
    },
    {
      "pk": 1978087,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 10,
      "text": "They did not keep God's covenant and refused to walk in his law.",
      "links": "<a href='/AIV/26/16/61'>Ezek. 16:61</a>; <a href='/AIV/19/50/16'>Ps. 50:16</a>",
      "comment": "Disobedience to the covenant is a recurring theme. The verse implies the need for both understanding and living the law, foreshadowing the new covenant and the call to life in Christ and the Church."
    },
    {
      "pk": 1978088,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 11,
      "text": "They forgot his deeds and the wonders that he had shown them.",
      "links": "<a href='/AIV/19/106/13'>Ps. 106:13</a>; <a href='/AIV/19/105/5'>Ps. 105:5</a>",
      "comment": "Forgetting God's works leads to spiritual amnesia; liturgical remembrance in the Mass is meant to keep the wonders of God always before the Church."
    },
    {
      "pk": 1978089,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 12,
      "text": "In the sight of their fathers, he worked wonders in the land of Egypt, in the field of Zoan.",
      "links": "<a href='/AIV/02/07/8'>Ex. 7:8</a>; <a href='/AIV/19/105/27'>Ps. 105:27</a>",
      "comment": "God’s wonders in Egypt recall the Exodus, foundational for understanding redemption, with spiritual ramifications in the Church’s understanding of salvation through Christ."
    },
    {
      "pk": 1978090,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 13,
      "text": "He divided the sea and brought them through; he made the waters stand like a heap.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21–22</a>; <a href='/AIV/19/106/9'>Ps. 106:9</a>",
      "comment": "The parting of the sea is a type of Christian baptism, as noted by early Church fathers and Catholic theology, emphasizing the symbolic passage from slavery to freedom."
    },
    {
      "pk": 1978091,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 14,
      "text": "By day he led them with a cloud, and all night with a fiery light.",
      "links": "<a href='/AIV/02/13/21'>Ex. 13:21</a>; <a href='/AIV/19/105/39'>Ps. 105:39</a>",
      "comment": "Guidance by cloud and fire prefigures the guidance of the Holy Spirit for the People of God, and in Catholic teaching, guidance through the Church and her sacraments."
    },
    {
      "pk": 1978092,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 15,
      "text": "He split rocks in the wilderness and gave them abundant water to drink from the depths.",
      "links": "<a href='/AIV/02/17/6'>Ex. 17:6</a>; <a href='/AIV/04/20/11'>Num. 20:11</a>",
      "comment": "The water from the rock is understood by Paul as a type of Christ (1 Cor. 10:4), prefiguring the life-giving water that is grace. Catholic tradition sees this linked to the sacraments."
    },
    {
      "pk": 1978093,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 16,
      "text": "He brought forth streams from the rock and made water flow down like rivers.",
      "links": "<a href='/AIV/19/105/41'>Ps. 105:41</a>; <a href='/AIV/23/48/21'>Isa. 48:21</a>",
      "comment": "Abundant water flowing from the rock highlights God’s generosity, and in spiritual tradition, points toward the Eucharist as a source of life."
    },
    {
      "pk": 1978094,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 17,
      "text": "Yet they continued to sin against him, rebelling against the Most High in the desert.",
      "links": "<a href='/AIV/19/106/13'>Ps. 106:13</a>; <a href='/AIV/04/14/2'>Num. 14:2</a>",
      "comment": "Rebellion despite miracles is a recurring scriptural warning, urging conversion and trust—themes central in Catholic call to repentance and penance."
    },
    {
      "pk": 1978095,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 18,
      "text": "They tested God in their hearts by demanding food according to their desires.",
      "links": "<a href='/AIV/04/11/4'>Num. 11:4</a>; <a href='/AIV/19/106/14'>Ps. 106:14</a>",
      "comment": "Testing God by seeking desires over faith is a warning. The Church teaches temperance and trust, encouraging discipline, especially through fasting."
    },
    {
      "pk": 1978096,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 19,
      "text": "They spoke against God, saying, 'Can God prepare a table in the wilderness?'",
      "links": "<a href='/AIV/02/16/3'>Ex. 16:3</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "This echoes doubt about God’s providence, yet God “prepares a table,” analogous to the Eucharistic feast provided in the Mass even amid the desert of this world."
    },
    {
      "pk": 1978097,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 20,
      "text": "He struck the rock, and water gushed out, and streams overflowed; but can he also give bread or provide meat for his people?",
      "links": "<a href='/AIV/02/17/6'>Ex. 17:6</a>; <a href='/AIV/04/11/13'>Num. 11:13</a>",
      "comment": "The question of bread foreshadows the greater miracle of the Eucharist as the true bread from heaven given to God’s people."
    },
    {
      "pk": 1978098,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 21,
      "text": "Therefore, when the LORD heard, he was angry; fire broke out against Jacob, and his anger rose against Israel,",
      "links": "<a href='/AIV/04/11/1'>Num. 11:1</a>; <a href='/AIV/19/106/18'>Ps. 106:18</a>",
      "comment": "Divine anger is a sign of broken covenant, yet even discipline is intended to call Israel back. The Church understands discipline as corrective, pointing always to reconciliation."
    },
    {
      "pk": 1978099,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 22,
      "text": "because they did not believe in God and did not trust in his salvation.",
      "links": "<a href='/AIV/19/106/24'>Ps. 106:24</a>; <a href='/AIV/58/03/19'>Heb. 3:19</a>",
      "comment": "Lack of faith leads to disobedience, as explained by Paul in Hebrews 3:19, emphasizing belief and trust in salvation offered, a Catholic call to full faith."
    },
    {
      "pk": 1978100,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 23,
      "text": "Yet he commanded the skies above and opened the doors of heaven.",
      "links": "<a href='/AIV/19/105/40'>Ps. 105:40</a>; <a href='/AIV/02/16/4'>Ex. 16:4</a>",
      "comment": "Opening the doors of heaven points to God’s miraculous provision, anticipated finally in the incarnation and sacramental life of the Church."
    },
    {
      "pk": 1978101,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 24,
      "text": "He rained down manna for them to eat and gave them the bread of heaven.",
      "links": "<a href='/AIV/02/16/15'>Ex. 16:15</a>; <a href='/AIV/19/105/40'>Ps. 105:40</a>; <a href='/AIV/43/06/31-35'>John 6:31–35</a>",
      "comment": "Manna as bread from heaven is a clear type of the Eucharist, especially as Christ identifies Himself as the true bread in John 6, which the Church upholds as the literal presence of Christ."
    },
    {
      "pk": 1978102,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 25,
      "text": "Man ate the bread of angels; he sent them food in abundance.",
      "links": "<a href='/AIV/19/105/40'>Ps. 105:40</a>; <a href='/AIV/43/06/51'>John 6:51</a>",
      "comment": "‘Bread of angels’ is a phrase used in Catholic liturgy for the Eucharist, indicating the spiritual nourishment given by Christ."
    },
    {
      "pk": 1978103,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 26,
      "text": "He caused the east wind to blow in the heavens, and by his power he led out the south wind;",
      "links": "<a href='/AIV/04/11/31'>Num. 11:31</a>",
      "comment": "God’s control over nature shows His sovereignty; linking to God’s providence present in the Church's understanding of the world."
    },
    {
      "pk": 1978104,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 27,
      "text": "he rained flesh upon them like dust, winged birds like the sand of the seas;",
      "links": "<a href='/AIV/02/16/13'>Ex. 16:13</a>; <a href='/AIV/04/11/31'>Num. 11:31</a>",
      "comment": "Provision of meat as quail again highlights God’s generosity, underlying sacramental implications of God providing for spiritual and physical needs."
    },
    {
      "pk": 1978105,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 28,
      "text": "He let them fall in the midst of their camp, all around their dwellings.",
      "links": "<a href='/AIV/04/11/32'>Num. 11:32</a>",
      "comment": "The abundance of meat shows not only provision but a test of the people’s faithfulness and moderation."
    },
    {
      "pk": 1978106,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 29,
      "text": "So they ate and were well filled, for he gave them what they craved.",
      "links": "<a href='/AIV/04/11/33'>Num. 11:33</a>",
      "comment": "Satisfaction of cravings is not always an unmitigated good; it serves as a warning about the dangers of disordered desire, a point of spiritual formation."
    },
    {
      "pk": 1978107,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 30,
      "text": "But before they had satisfied their desire, while the food was still in their mouths,",
      "links": "<a href='/AIV/04/11/33'>Num. 11:33</a>",
      "comment": "This passage prepares for a lesson in consequences—a theme embedded in Church teaching on sin, forgiveness, and penance."
    },
    {
      "pk": 1978108,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 31,
      "text": "the anger of God rose against them, and he killed the strongest among them, laying low the young men of Israel.",
      "links": "<a href='/AIV/04/11/34'>Num. 11:34</a>; <a href='/AIV/19/106/15'>Ps. 106:15</a>",
      "comment": "God’s discipline is severe when His gifts are abused; a call to reverential awe and respect for God’s abundance, paralleled in Church practice surrounding the Eucharist."
    },
    {
      "pk": 1978109,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 32,
      "text": "Despite all this, they still sinned and did not believe in his wonders.",
      "links": "<a href='/AIV/19/106/24-25'>Ps. 106:24–25</a>",
      "comment": "Persistent unbelief despite miracles calls for repentance and faith, a theme taught strongly in the Catholic faith."
    },
    {
      "pk": 1978110,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 33,
      "text": "So he made their days vanish like a breath, and their years in terror.",
      "links": "<a href='/AIV/19/90/5-9'>Ps. 90:5–9</a>; <a href='/AIV/04/14/29'>Num. 14:29</a>",
      "comment": "Shortened lives as judgment on faithlessness reflects the seriousness of life before God. Spiritual meaning encompasses the need to ‘number our days’ as in Catholic tradition."
    },
    {
      "pk": 1978111,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 34,
      "text": "When he killed them, they sought him; they repented and sought earnestly for God.",
      "links": "<a href='/AIV/19/106/44'>Ps. 106:44</a>; <a href='/AIV/07/03/9'>Judg. 3:9</a>",
      "comment": "Chastisement leads to repentance—a dynamic central to Catholic understanding of contrition and confession."
    },
    {
      "pk": 1978112,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 35,
      "text": "They remembered that God was their rock, the Most High God their Redeemer.",
      "links": "<a href='/AIV/19/19/14'>Ps. 19:14</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Recognizing God as Redeemer points ahead to Christ, who fully embodies this title; a foundational Catholic and Christian truth."
    },
    {
      "pk": 1978113,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 36,
      "text": "But they flattered him with their mouths and lied to him with their tongues.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>; <a href='/AIV/19/62/4'>Ps. 62:4</a>",
      "comment": "Outward expressions without interior conversion are seen as hypocrisy, a theme addressed by both Christ and the Church Fathers."
    },
    {
      "pk": 1978114,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 37,
      "text": "Their hearts were not steadfast; they were not faithful to his covenant.",
      "links": "<a href='/AIV/19/78/8'>Ps. 78:8</a>; <a href='/AIV/19/119/80'>Ps. 119:80</a>",
      "comment": "The steadfast heart is the goal; the Catholic tradition calls for ongoing conversion through grace, the sacraments, and perseverance."
    },
    {
      "pk": 1978115,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 38,
      "text": "Yet he, being compassionate, forgave their sin and did not destroy them; many times he turned his anger aside and did not stir up all his wrath.",
      "links": "<a href='/AIV/19/106/43-45'>Ps. 106:43–45</a>; <a href='/AIV/19/103/8-10'>Ps. 103:8–10</a>",
      "comment": "God’s mercy is central to Catholic theology, especially in sacramental reconciliation—the forgiveness of sins through contrition and confession."
    },
    {
      "pk": 1978116,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 39,
      "text": "He remembered that they were but flesh, a passing breath that does not return.",
      "links": "<a href='/AIV/19/103/14-16'>Ps. 103:14–16</a>; <a href='/AIV/23/40/6'>Isa. 40:6</a>",
      "comment": "Human frailty is noted; the Church urges dependence upon grace to overcome weakness."
    },
    {
      "pk": 1978117,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 40,
      "text": "How often they rebelled against him in the wilderness and grieved him in the desert!",
      "links": "<a href='/AIV/19/106/7'>Ps. 106:7</a>; <a href='/AIV/04/14/22'>Num. 14:22</a>",
      "comment": "Rebellion grieves God; ongoing repentance and conversion are needed, as taught by the Church."
    },
    {
      "pk": 1978118,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 41,
      "text": "Again and again they tested God and provoked the Holy One of Israel.",
      "links": "<a href='/AIV/19/106/14'>Ps. 106:14</a>; <a href='/AIV/04/14/22'>Num. 14:22</a>",
      "comment": "The title ‘Holy One of Israel’ is later applied to Christ, connecting the Old Testament to fulfillment in the New."
    },
    {
      "pk": 1978119,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 42,
      "text": "They did not remember his power or the day when he redeemed them from the enemy,",
      "links": "<a href='/AIV/02/13/3'>Ex. 13:3</a>; <a href='/AIV/19/106/10'>Ps. 106:10</a>",
      "comment": "Memory of redemption is crucial for faith, hence the Church’s remembrance and thanksgiving (‘Eucharistia’) in worship."
    },
    {
      "pk": 1978120,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 43,
      "text": "when he displayed his signs in Egypt and his wonders in the fields of Zoan.",
      "links": "<a href='/AIV/02/07/3'>Ex. 7:3</a>; <a href='/AIV/19/105/27'>Ps. 105:27</a>",
      "comment": "Works in Egypt are foundational; their remembrance is recapitulated in Catholic liturgy especially at Easter."
    },
    {
      "pk": 1978121,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 44,
      "text": "He turned their rivers to blood, so they could not drink from their streams.",
      "links": "<a href='/AIV/02/07/20-21'>Ex. 7:20–21</a>; <a href='/AIV/19/105/29'>Ps. 105:29</a>",
      "comment": "The plagues demonstrate God’s judgment and power to save; a repeated motif in Sacred Scripture."
    },
    {
      "pk": 1978122,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 45,
      "text": "He sent among them swarms of flies that devoured them, and frogs that ruined them.",
      "links": "<a href='/AIV/02/08/24'>Ex. 8:24</a>; <a href='/AIV/02/08/6'>Ex. 8:6</a>",
      "comment": "Plagues continue the theme of judgment and redemption, showing the seriousness of opposing God."
    },
    {
      "pk": 1978123,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 46,
      "text": "He gave their crops to the grasshopper and the fruit of their labor to locusts.",
      "links": "<a href='/AIV/02/10/12'>Ex. 10:12</a>; <a href='/AIV/19/105/34'>Ps. 105:34</a>",
      "comment": "Economic judgment is God’s right; all is under His sovereignty—Church teaching affirms stewardship and reliance."
    },
    {
      "pk": 1978124,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 47,
      "text": "He destroyed their vines with hail and their sycamore trees with frost.",
      "links": "<a href='/AIV/02/09/25'>Ex. 9:25</a>; <a href='/AIV/19/105/33'>Ps. 105:33</a>",
      "comment": "Nature obeys God’s commands, reflecting His absolute kingship—church teaching calls all creation to glorify Him."
    },
    {
      "pk": 1978125,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 48,
      "text": "He gave over their cattle to hail and their flocks to lightning bolts.",
      "links": "<a href='/AIV/02/09/6'>Ex. 9:6</a>; <a href='/AIV/19/105/32'>Ps. 105:32</a>",
      "comment": "Further judgment on Egypt reveals God's justice, and calls us to recognize accountability in life."
    },
    {
      "pk": 1978126,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 49,
      "text": "He unleashed against them his fierce anger, wrath, indignation, and distress—a band of destroying angels.",
      "links": "<a href='/AIV/02/12/23'>Ex. 12:23</a>",
      "comment": "Destroying angels signal divine intervention, often interpreted by the Church as reality of angelic beings and spiritual warfare."
    },
    {
      "pk": 1978127,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 50,
      "text": "He made a path for his anger; he did not spare their souls from death but gave their lives over to the plague.",
      "links": "<a href='/AIV/02/12/29'>Ex. 12:29</a>",
      "comment": "Judgement acts as a warning; the Church calls for vigilance and humble dependence on God’s mercy."
    },
    {
      "pk": 1978128,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 51,
      "text": "He struck down every firstborn in Egypt, the firstfruits of their strength in the tents of Ham.",
      "links": "<a href='/AIV/02/12/29'>Ex. 12:29</a>; <a href='/AIV/19/105/36'>Ps. 105:36</a>",
      "comment": "The destruction of the firstborn prefigures God sparing the faithful by the Passover lamb, a type of Christ’s sacrifice in Catholic doctrine."
    },
    {
      "pk": 1978129,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 52,
      "text": "Then he led out his people like sheep and guided them in the wilderness like a flock.",
      "links": "<a href='/AIV/19/77/20'>Ps. 77:20</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Shepherd imagery later finds fulfillment in Christ, the Good Shepherd, whose Church shepherds the faithful through the sacraments."
    },
    {
      "pk": 1978130,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 53,
      "text": "He led them safely, and they were not afraid; but the sea engulfed their enemies.",
      "links": "<a href='/AIV/02/14/29-30'>Ex. 14:29–30</a>",
      "comment": "God’s protection is absolute for those who trust and obey, foreshadowing baptism’s deliverance from sin and death."
    },
    {
      "pk": 1978131,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 54,
      "text": "He brought them to his holy land, to the mountain his right hand had acquired.",
      "links": "<a href='/AIV/02/15/17'>Ex. 15:17</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "‘Holy land’ finds deeper meaning in the Church’s teaching about our pilgrimage toward heaven, the true Promised Land."
    },
    {
      "pk": 1978132,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 55,
      "text": "He drove out nations before them, allotted them an inheritance by tribal lines, and settled the tribes of Israel in their tents.",
      "links": "<a href='/AIV/07/02/6'>Judg. 2:6</a>; <a href='/AIV/06/21/43'>Josh. 21:43</a>",
      "comment": "Inheritance and settlement anticipate the Church’s theology of being adopted sons and daughters, co-heirs through Christ."
    },
    {
      "pk": 1978133,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 56,
      "text": "Yet they tested and rebelled against the Most High God and did not keep his testimonies.",
      "links": "<a href='/AIV/19/106/13'>Ps. 106:13</a>; <a href='/AIV/07/02/12'>Judg. 2:12</a>",
      "comment": "Rebellion as a recurring pattern is a reminder to practice ongoing repentance and strive for holiness, central in Catholic spirituality."
    },
    {
      "pk": 1978134,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 57,
      "text": "They turned away and acted treacherously like their fathers; they twisted like a deceitful bow.",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Treacherous turning aside underlines the need for conversion not only in word but in deed, a major Catholic theme."
    },
    {
      "pk": 1978135,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 58,
      "text": "They provoked him to anger with their high places and aroused his jealousy with their idols.",
      "links": "<a href='/AIV/26/06/3'>Ezek. 6:3</a>; <a href='/AIV/07/10/6'>Judg. 10:6</a>",
      "comment": "Idolatry is spiritual adultery. The Church calls for exclusive worship of God, warning against modern forms of idolatry."
    },
    {
      "pk": 1978136,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 59,
      "text": "When God heard, he was enraged; he utterly rejected Israel.",
      "links": "<a href='/AIV/24/07/15'>Jer. 7:15</a>; <a href='/AIV/19/106/40'>Ps. 106:40</a>",
      "comment": "Rejection is never final in God’s plan. Catholic teaching emphasizes reconciliation and restoration—ultimately fulfilled in Christ and the Church."
    },
    {
      "pk": 1978137,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 60,
      "text": "He abandoned the tabernacle at Shiloh, the tent where he had dwelled among mankind.",
      "links": "<a href='/AIV/09/04/11'>1 Sam. 4:11</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "Loss of the tabernacle signifies a shift; the Church understands fulfillment in the Incarnation—God ‘tabernacles’ among us in Christ."
    },
    {
      "pk": 1978138,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 61,
      "text": "He gave up his strength to captivity and his glory to the hand of the adversary.",
      "links": "<a href='/AIV/09/04/17'>1 Sam. 4:17</a>; <a href='/AIV/19/63/2'>Ps. 63:2</a>",
      "comment": "The loss anticipates restoration through Christ’s victory over death and sin—the Church’s central proclamation."
    },
    {
      "pk": 1978139,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 62,
      "text": "He delivered his people over to the sword and vented his fury on their inheritance.",
      "links": "<a href='/AIV/09/04/10'>1 Sam. 4:10</a>; <a href='/AIV/19/106/40'>Ps. 106:40</a>",
      "comment": "Judgment falls, but always points to eventual restoration and mercy, as realized in Christ."
    },
    {
      "pk": 1978140,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 63,
      "text": "Fire devoured their young men, and their young women had no marriage songs.",
      "links": "<a href='/AIV/25/05/14'>Lam. 5:14</a>; <a href='/AIV/09/04/12'>1 Sam. 4:12</a>",
      "comment": "Judgment on the people results in sorrow; mourning leads to conversion—core to Catholic penitential seasons."
    },
    {
      "pk": 1978141,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 64,
      "text": "Their priests fell by the sword, and their widows could not weep.",
      "links": "<a href='/AIV/09/04/11'>1 Sam. 4:11</a>",
      "comment": "Loss of priests shows broken worship and need for reconciliation—a theme taken up by the priesthood of Christ in the Church."
    },
    {
      "pk": 1978142,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 65,
      "text": "Then the Lord awoke as from sleep, like a warrior shouting because of wine.",
      "links": "<a href='/AIV/19/44/23'>Ps. 44:23</a>; <a href='/AIV/23/51/9'>Isa. 51:9</a>",
      "comment": "God’s awakening signals decisive intervention—paralleling Christ’s resurrection and God’s active presence in history."
    },
    {
      "pk": 1978143,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 66,
      "text": "He struck down his adversaries and put them to everlasting shame.",
      "links": "<a href='/AIV/19/83/17'>Ps. 83:17</a>; <a href='/AIV/09/05/6'>1 Sam. 5:6</a>",
      "comment": "God’s justice is complete; ultimate victory over enemies is found in Christ’s triumph over sin and death."
    },
    {
      "pk": 1978144,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 67,
      "text": "He rejected the tent of Joseph and did not choose the tribe of Ephraim,",
      "links": "<a href='/AIV/09/16/12-13'>1 Sam. 16:12–13</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "Shift from Ephraim to Judah signals the messianic promise fulfilled in Christ, a central Catholic belief."
    },
    {
      "pk": 1978145,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 68,
      "text": "but he chose the tribe of Judah, Mount Zion, which he loves.",
      "links": "<a href='/AIV/19/87/2'>Ps. 87:2</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "Choosing Judah and Zion connects to the Davidic Covenant and ultimately to Christ, the fulfillment of all messianic hope."
    },
    {
      "pk": 1978146,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 69,
      "text": "He built his sanctuary like the heights, like the earth he established forever.",
      "links": "<a href='/AIV/14/02/1'>2 Chr. 2:1</a>; <a href='/AIV/19/24/7'>Ps. 24:7</a>",
      "comment": "The sanctuary’s permanence points spiritually to the Church as the enduring temple of God’s presence through Christ."
    },
    {
      "pk": 1978147,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 70,
      "text": "He chose David his servant and took him from the sheepfolds;",
      "links": "<a href='/AIV/09/16/11-12'>1 Sam. 16:11–12</a>; <a href='/AIV/19/89/20'>Ps. 89:20</a>",
      "comment": "David’s choosing prefigures Christ as the Shepherd-King, and the priesthood established in service."
    },
    {
      "pk": 1978148,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 71,
      "text": "From tending the nursing ewes, he brought him to be shepherd over Jacob his people, over Israel his inheritance.",
      "links": "<a href='/AIV/19/77/20'>Ps. 77:20</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "Shepherd imagery culminates in Christ and continues in the Church’s leaders who shepherd the faithful."
    },
    {
      "pk": 1978149,
      "translation": "AIV",
      "book": 19,
      "chapter": 78,
      "verse": 72,
      "text": "With an upright heart he shepherded them and guided them with skillful hands.",
      "links": "<a href='/AIV/19/89/20-21'>Ps. 89:20–21</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "David’s just leadership anticipates the ideal King, Christ. The Church continues this shepherding mission through her priests and bishops."
    }
  ],
  "translatedAt": "2025-12-22T21:45:09.228Z"
}