{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 13,
  "verses": [
    {
      "pk": 201301,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 1,
      "text": "How long, O LORD? Will You forget me forever? How long will You hide Your face from me?",
      "links": "<a href='/AIV/19/10/1'>Ps. 10:1</a>; <a href='/AIV/18/13/24'>Job 13:24</a>",
      "comment": "David urgently calls out to the LORD in a moment of deep distress, expressing the feeling of abandonment similar to other laments (see Ps. 10:1; Job 13:24). The phrase 'hide Your face' is a biblical way of saying God withholds His favor or presence (Num. 6:25)."
    },
    {
      "pk": 201302,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 2,
      "text": "How long must I take counsel in my soul and have sorrow in my heart each day? How long shall my enemy be exalted over me?",
      "links": "<a href='/AIV/19/42/9'>Ps. 42:9</a>; <a href='/AIV/19/6/3'>Ps. 6:3</a>",
      "comment": "The repetition of 'How long' emphasizes the depth and duration of David’s suffering. Spiritual and physical enemies are often types, pointing towards the greater warfare against sin and death (see Ps. 42:9)."
    },
    {
      "pk": 201303,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 3,
      "text": "Look upon me and answer, O LORD my God! Give light to my eyes, or I will sleep in death;",
      "links": "<a href='/AIV/19/18/28'>Ps. 18:28</a>; <a href='/AIV/19/38/10'>Ps. 38:10</a>",
      "comment": "'Give light to my eyes' is a prayer for renewed spiritual and physical vitality (cf. Ps. 18:28). Here, the presence of God is not merely desired for comfort but is vital for life itself—a sign of deeper communion with God."
    },
    {
      "pk": 201304,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 4,
      "text": "lest my enemy say, 'I have prevailed over him,' and my foes rejoice because I am shaken.",
      "links": "<a href='/AIV/19/35/19'>Ps. 35:19</a>; <a href='/AIV/19/41/11'>Ps. 41:11</a>",
      "comment": "David fears that God’s apparent absence will lead to his enemies’ triumph and mockery, a motif fulfilled ultimately in Christ, who was mocked by His enemies (Matt. 27:41–43) yet conquered through apparent defeat."
    },
    {
      "pk": 201305,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 5,
      "text": "But I have trusted in Your steadfast love; my heart will rejoice in Your salvation.",
      "links": "<a href='/AIV/19/31/7'>Ps. 31:7</a>; <a href='/AIV/19/33/21'>Ps. 33:21</a>",
      "comment": "In contrast to despair, faith in God’s faithful, covenant love becomes the ground for hope and joy. Salvation here points forward to deliverance not only from temporal troubles but also as a prophetic anticipation of ultimate salvation through Christ (cf. Luke 1:68–69)."
    },
    {
      "pk": 201306,
      "translation": "AIV",
      "book": 19,
      "chapter": 13,
      "verse": 6,
      "text": "I will sing to the LORD, because He has dealt bountifully with me.",
      "links": "<a href='/AIV/19/116/7'>Ps. 116:7</a>; <a href='/AIV/19/103/2'>Ps. 103:2</a>",
      "comment": "The psalm concludes in praise and thanksgiving, showing the power of turning lament into worship through trust in God’s faithfulness. Singing to the LORD highlights the continuity of worship as central to ongoing spiritual life—a tradition preserved in the universal Christian liturgy."
    }
  ],
  "translatedAt": "2025-12-23T05:34:53.271Z"
}