{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 76,
  "verses": [
    {
      "pk": 23076001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 1,
      "text": "God is known in Judah; his name is great in Israel.",
      "links": "<a href='/AIV/19/48/1'>Ps. 48:1</a>; <a href='/AIV/19/114/2'>Ps. 114:2</a>",
      "comment": "The people of Judah and Israel specially recognize God's greatness. Cross-references highlight God's presence among His chosen people, tying to broader themes of election and divine revelation."
    },
    {
      "pk": 23076002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 2,
      "text": "His tent is in Salem; his dwelling place is in Zion.",
      "links": "<a href='/AIV/01/14/18'>Gen. 14:18</a>; <a href='/AIV/19/87/2'>Ps. 87:2</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "Salem refers to Jerusalem, and Zion becomes a spiritual focal point in scripture. This hints at the future significance of Jerusalem as the spiritual center for worship and divine presence. Early Christian readings link Zion with the establishment of worship modeled after heavenly realities (see Heb. 12:22)."
    },
    {
      "pk": 23076003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 3,
      "text": "There he shattered the flaming arrows, the shield, the sword, and the weapons of war.",
      "links": "<a href='/AIV/19/46/9'>Ps. 46:9</a>; <a href='/AIV/23/2/4'>Isa. 2:4</a>",
      "comment": "God is depicted as divine warrior whose power makes human striving in battle futile. The spiritual meaning points to God's ultimate victory over evil, prefiguring the peace brought by Christ’s redemption."
    },
    {
      "pk": 23076004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 4,
      "text": "You are resplendent, more majestic than the mountains full of prey.",
      "links": "<a href='/AIV/19/68/35'>Ps. 68:35</a>; <a href='/AIV/19/104/1'>Ps. 104:1</a>",
      "comment": "The glory of God far exceeds even the power of kings and nations (symbolized by 'mountains of prey'). The image foreshadows the splendor of Christ’s kingship, surpassing earthly dominion."
    },
    {
      "pk": 23076005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 5,
      "text": "The brave-hearted lie plundered, they sleep their last sleep; none of the warriors could lift their hands.",
      "links": "<a href='/AIV/02/15/1-5'>Ex. 15:1-5</a>; <a href='/AIV/19/78/65-66'>Ps. 78:65-66</a>",
      "comment": "God's victory brings even the strongest to defeat and powerlessness. This recalls the motif of God’s sovereignty over life and death, pointing to the finality of divine judgment. Typologically, this prefigures Christ’s triumph over sin and death."
    },
    {
      "pk": 23076006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 6,
      "text": "At your rebuke, God of Jacob, both rider and horse lay stunned.",
      "links": "<a href='/AIV/02/14/24-27'>Ex. 14:24-27</a>; <a href='/AIV/19/80/1'>Ps. 80:1</a>",
      "comment": "Imagery of God intervening directly recalls the Exodus narrative. This demonstrates the power of His word above all earthly powers, reinforcing trust in divine protection and authority."
    },
    {
      "pk": 23076007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 7,
      "text": "You alone are to be feared; who can stand before you when your anger is aroused?",
      "links": "<a href='/AIV/05/10/17'>Deut. 10:17</a>; <a href='/AIV/19/130/3'>Ps. 130:3</a>; <a href='/AIV/66/6/17'>Rev. 6:17</a>",
      "comment": "Here God’s absolute holiness and authority are emphasized, a theme echoed through all scripture and pointing to believers’ reverence toward the divine. The theme prepares for NT depictions of judgment before the throne (see Revelation)."
    },
    {
      "pk": 23076008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 8,
      "text": "From heaven, you pronounced judgment; the earth feared and was still",
      "links": "<a href='/AIV/19/50/4'>Ps. 50:4</a>; <a href='/AIV/36/3/8'>Zeph. 3:8</a>",
      "comment": "God’s judgment inspires awe and silence on earth. The heavenly source of judgment echoes themes of divine authority from above, prefiguring Christ’s coming as Judge (see Matthew 25:31-32)."
    },
    {
      "pk": 23076009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 9,
      "text": "when you rose up to bring justice, to save all the humble of the earth.",
      "links": "<a href='/AIV/19/72/4'>Ps. 72:4</a>; <a href='/AIV/19/149/4'>Ps. 149:4</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "God defends the humble and delivers justice, revealing a recurring biblical principle: humility before God brings salvation and mercy. A spiritual interpretation points toward Christ's teaching on humility and exaltation."
    },
    {
      "pk": 23076010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 10,
      "text": "Surely the anger of man will praise you; the survivors of your wrath will wear it as an ornament.",
      "links": "<a href='/AIV/02/9/12-16'>Ex. 9:12-16</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>",
      "comment": "Even human opposition ultimately serves to glorify God. The reference to survivors wearing wrath highlights God’s transforming justice; His mercy amid judgment shapes and beautifies His people, an implicit call to seek refuge in divine grace."
    },
    {
      "pk": 23076011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 11,
      "text": "Make vows to the LORD your God and fulfill them; let all around bring gifts to him who is to be feared.",
      "links": "<a href='/AIV/03/27/2'>Lev. 27:2</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/19/96/8'>Ps. 96:8</a>",
      "comment": "Faithful worship includes fulfilling vows and bringing offerings, a key aspect of Old Testament and ongoing Christian spirituality. The giving of gifts and vows is a persistent biblical pattern, later re-emphasized in the New Testament as acts of devotion and worship before God."
    },
    {
      "pk": 23076012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 76,
      "verse": 12,
      "text": "He cuts off the spirit of princes; he is feared by the kings of the earth.",
      "links": "<a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>; <a href='/AIV/19/110/5'>Ps. 110:5</a>",
      "comment": "God holds ultimate authority over worldly rulers, foreshadowing Christ’s sovereign kingship and final judgment. Spiritual readings recognize submission before divine rule as a mark of true faith, echoing themes fulfilled in the gospel’s call to discipleship and reverence."
    }
  ],
  "translatedAt": "2025-12-24T06:25:19.380Z"
}