{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 31,
  "verses": [
    {
      "pk": 23031001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 1,
      "text": "In you, O LORD, I seek refuge; let me never be put to shame. Deliver me in your righteousness.",
      "links": "<a href='/AIV/19/25/2'>Ps. 25:2</a>; <a href='/AIV/19/71/1'>Ps. 71:1</a>",
      "comment": "The verse expresses complete trust in God's protection, a theme found throughout the Psalms. The idea of seeking refuge recalls spiritual sanctuary and trusting fully in the Lord's saving power, prefiguring Christ as the ultimate refuge. The phrase 'deliver me in your righteousness' points to the necessity of God's grace for salvation."
    },
    {
      "pk": 23031002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 2,
      "text": "Incline your ear to me; rescue me quickly. Be for me a strong rock, a fortress to save me.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/71/3'>Ps. 71:3</a>",
      "comment": "God is addressed as a 'strong rock' and 'fortress,' terms that indicate the firm foundation of Divine protection and imply the presence of a spiritual dwelling or sanctuary. Christ is referred to as both rock and foundation in the New Testament (<a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 23031003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 3,
      "text": "For you are my rock and my fortress; for the sake of your name, lead me and guide me.",
      "links": "<a href='/AIV/19/23/3'>Ps. 23:3</a>; <a href='/AIV/19/143/10'>Ps. 143:10</a>",
      "comment": "Being led and guided for the sake of God's name foreshadows Christ who glorifies the Father and leads His people. The repetition of 'rock' and 'fortress' emphasizes the unchanging and protective nature of God."
    },
    {
      "pk": 23031004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 4,
      "text": "Free me from the net that they have secretly set for me, for you are my refuge.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>; <a href='/AIV/19/71/4'>Ps. 71:4</a>",
      "comment": "The net is a metaphor for the traps of evil and temptation. God as 'refuge' continues the sanctuary imagery, where those who trust are kept safe. This mirrors spiritual protection and salvation through divine intervention."
    },
    {
      "pk": 23031005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 5,
      "text": "Into your hand I commit my spirit; you redeem me, O LORD, faithful God.",
      "links": "<a href='/AIV/42/23/46'>Luke 23:46</a>; <a href='/AIV/19/16/10'>Ps. 16:10</a>",
      "comment": "These words were spoken by Jesus on the cross (<a href='/AIV/42/23/46'>Luke 23:46</a>). The phrase 'commit my spirit' reveals absolute surrender to God, a Christological prophecy fulfilled at the Crucifixion, highlighting both literal and spiritual meanings: entrusting one’s life and soul to God’s care."
    },
    {
      "pk": 23031006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 6,
      "text": "I hate those who cling to worthless idols, but I trust wholly in the LORD.",
      "links": "<a href='/AIV/19/97/7'>Ps. 97:7</a>; <a href='/AIV/19/115/8'>Ps. 115:8</a>",
      "comment": "Idolatry is rejected in favor of trusting the one true God. This verse urges complete devotion, which later becomes foundational to keeping the faith pure and centered on God alone."
    },
    {
      "pk": 23031007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 7,
      "text": "I will rejoice and be glad in your steadfast love, because you have seen my affliction; you have known the troubles of my soul.",
      "links": "<a href='/AIV/19/13/5'>Ps. 13:5</a>; <a href='/AIV/19/90/14'>Ps. 90:14</a>",
      "comment": "The focus on steadfast love (Hebrew: 'hesed') echoes the covenant love, unconditional and enduring. God knows personal suffering and responds, hinting at Christ’s compassion and intimate knowledge of our sorrows."
    },
    {
      "pk": 23031008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 8,
      "text": "You have not handed me over to the enemy, but have set my feet in a wide place.",
      "links": "<a href='/AIV/19/18/19'>Ps. 18:19</a>; <a href='/AIV/19/66/12'>Ps. 66:12</a>",
      "comment": "The 'wide place' signifies deliverance, security, and freedom, reminiscent of being led out of danger and into the fullness of life God offers. This plays into Old Testament images of God rescuing Israel and the theme of spiritual liberation."
    },
    {
      "pk": 23031009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 9,
      "text": "Be gracious to me, O LORD, for I am in distress; my eyes are wasted with grief, my soul and my body also.",
      "links": "<a href='/AIV/19/6/7'>Ps. 6:7</a>; <a href='/AIV/19/38/9'>Ps. 38:9</a>",
      "comment": "Total dependence on God in human frailty and suffering. There's a holistic mention here (eye, soul, body), implying the need for healing that encompasses both physical and spiritual restoration."
    },
    {
      "pk": 23031010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 10,
      "text": "For my life is spent with sorrow, and my years with sighing; my strength fails because of my iniquity, and my bones waste away.",
      "links": "<a href='/AIV/19/32/3'>Ps. 32:3</a>; <a href='/AIV/19/39/2'>Ps. 39:2</a>",
      "comment": "This verse introduces the effect of personal sin ('my iniquity') as a factor in suffering and weakness, underscoring humanity's need for grace and forgiveness."
    },
    {
      "pk": 23031011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 11,
      "text": "Because of all my adversaries I am a reproach, especially to my neighbors, and an object of dread to my acquaintances; those who see me outside flee from me.",
      "links": "<a href='/AIV/19/38/11'>Ps. 38:11</a>; <a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "The sense of abandonment and social rejection prefigures Christ, who was shunned by many during His Passion (<a href='/AIV/23/53/3'>Isaiah 53:3</a>). This links the psalmist’s suffering with Christ’s rejection and isolation."
    },
    {
      "pk": 23031012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 12,
      "text": "I am forgotten like one dead, out of mind; I have become like a broken vessel.",
      "links": "<a href='/AIV/19/88/5'>Ps. 88:5</a>; <a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "The broken vessel metaphor signals both abandonment and humility before God. Christ’s humiliation and rejection are mirrored spiritually here, inviting deeper meditation on surrender and the redemptive value of suffering."
    },
    {
      "pk": 23031013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 13,
      "text": "For I hear the whispering of many—terror on every side!—as they scheme together against me, plotting to take my life.",
      "links": "<a href='/AIV/19/27/12'>Ps. 27:12</a>; <a href='/AIV/19/41/7'>Ps. 41:7</a>",
      "comment": "The plotting of enemies around the psalmist directly reflects the way Christ’s adversaries schemed against Him. Suffering and conspiracy precede divine intervention, foreshadowing the trials before redemption."
    },
    {
      "pk": 23031014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 14,
      "text": "But I trust in you, O LORD; I say, 'You are my God.'",
      "links": "<a href='/AIV/19/16/2'>Ps. 16:2</a>; <a href='/AIV/19/31/6'>Ps. 31:6</a>",
      "comment": "Trust and confessing the Lord as God is the bedrock of faith. This echoes the profession of faith central to Christian belief and prepares for the deeper revelation of God’s identity in the New Testament."
    },
    {
      "pk": 23031015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 15,
      "text": "My times are in your hand; deliver me from the hands of my enemies and from those pursuing me.",
      "links": "<a href='/AIV/19/37/5'>Ps. 37:5</a>; <a href='/AIV/19/71/4'>Ps. 71:4</a>",
      "comment": "Recognizing one’s life and destiny as governed by God points toward Divine Providence and sovereignty, essential to spiritual trust. This devotion fosters acceptance of God’s will."
    },
    {
      "pk": 23031016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 16,
      "text": "Let your face shine upon your servant; save me in your steadfast love.",
      "links": "<a href='/AIV/04/6/25'>Num. 6:25</a>; <a href='/AIV/19/80/3'>Ps. 80:3</a>",
      "comment": "The shining of God's face is a sign of blessing and favor, often invoked in liturgical blessing. The appeal to steadfast love reiterates God’s covenant mercy, showing the importance of grace over merit."
    },
    {
      "pk": 23031017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 17,
      "text": "Let me not be put to shame, O LORD, for I call upon you; but let the wicked be put to shame; let them be silent in Sheol.",
      "links": "<a href='/AIV/19/6/10'>Ps. 6:10</a>; <a href='/AIV/19/115/17'>Ps. 115:17</a>",
      "comment": "The psalmist prays for vindication and judgment. Being 'put to shame' references the distinction between those who follow God and those who oppose Him, hinting at the final justice and eschatological hope."
    },
    {
      "pk": 23031018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 18,
      "text": "Let lying lips be silenced, which speak arrogantly against the righteous with pride and contempt.",
      "links": "<a href='/AIV/19/12/3'>Ps. 12:3</a>; <a href='/AIV/19/109/2'>Ps. 109:2</a>",
      "comment": "Condemnation of pride and falsehood reasserts God's holiness and the need for humility. Silence of evil voices anticipates the judgment at the end of time, where the righteous are justified."
    },
    {
      "pk": 23031019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 19,
      "text": "How great is your goodness, which you have stored up for those who fear you, and worked for those who take refuge in you, in the sight of everyone!",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/19/147/11'>Ps. 147:11</a>",
      "comment": "God’s goodness and reward are abundant for those seeking refuge, both privately and publicly. This hints at the spiritual treasures promised to the faithful and the importance of reverent fear."
    },
    {
      "pk": 23031020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 20,
      "text": "You hide them in the shelter of your presence, safe from the plots of men; you conceal them in your tent from accusing tongues.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>; <a href='/AIV/19/61/4'>Ps. 61:4</a>",
      "comment": "'Shelter' and 'tent' suggest God’s holy abode, where His people are protected. This foreshadows the spiritual security found in communion with the Divine presence, and spiritual shelter within sacred community."
    },
    {
      "pk": 23031021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 21,
      "text": "Blessed be the LORD, for He has shown his steadfast love wonderfully to me when I was besieged, in a fortified city.",
      "links": "<a href='/AIV/19/17/7'>Ps. 17:7</a>; <a href='/AIV/19/28/6'>Ps. 28:6</a>",
      "comment": "Divine help in crisis is celebrated. The 'fortified city' imagery links to the safety found in God’s kingdom, prefiguring the spiritual city and sanctuary for all believers."
    },
    {
      "pk": 23031022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 22,
      "text": "I said in my alarm, 'I am cut off from your sight.' Yet you heard my cry when I called to you for help.",
      "links": "<a href='/AIV/19/116/2'>Ps. 116:2</a>; <a href='/AIV/19/142/4'>Ps. 142:4</a>",
      "comment": "Moments of despair do not separate the faithful from God’s mercy. The assurance of God hearing and responding strengthens trust and highlights the importance of persistent prayer."
    },
    {
      "pk": 23031023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 23,
      "text": "Love the LORD, all you his saints! The LORD preserves the faithful, but abundantly repays the one who acts in pride.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>; <a href='/AIV/19/145/20'>Ps. 145:20</a>",
      "comment": "'Saints' refers to those sanctified and set apart for God, a community called to love and fidelity. Faithful preservation stands in contrast to the fate of the proud, again underscoring humility."
    },
    {
      "pk": 23031024,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 31,
      "verse": 24,
      "text": "Be strong, and let your heart take courage, all you who hope in the LORD.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "The final verse is a rallying call to steadfast faith and hope, reminiscent of Christ’s exhortation to his disciples (<a href='/AIV/43/16/33'>John 16:33</a>). Both literal and spiritual meanings call believers to perseverance, echoing the journey of sanctification within the spiritual community."
    }
  ],
  "translatedAt": "2025-12-24T06:08:48.195Z"
}