{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 19,
  "verses": [
    {
      "pk": 1901901,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 1,
      "text": "The heavens declare the glory of God; the skies proclaim the work of His hands.",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/19/97/6'>Ps. 97:6</a>; <a href='/AIV/19/8/1-3'>Ps. 8:1–3</a>; <a href='/AIV/45/1/20'>Rom. 1:20</a>",
      "comment": "The word for 'heavens' (shamayim) signifies not only the sky but all of the created cosmos declaring God's glory. Paul references this in Romans 1:20, noting that creation reveals God's invisible attributes."
    },
    {
      "pk": 1901902,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 2,
      "text": "Day after day pours out speech, and night after night reveals knowledge.",
      "links": "<a href='/AIV/19/74/16'>Ps. 74:16</a>; <a href='/AIV/19/104/19'>Ps. 104:19</a>",
      "comment": "Creation continually and unceasingly reveals the knowledge of God. The repetition day and night suggests the universality and constancy of God's self-revelation."
    },
    {
      "pk": 1901903,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 3,
      "text": "There is no speech, nor are there words; their voice is not heard.",
      "links": "<a href='/AIV/19/29/3-9'>Ps. 29:3–9</a>; <a href='/AIV/45/10/18'>Rom. 10:18</a>",
      "comment": "Though creation's language is silent, it is universally understood. Paul applies this verse in Romans 10:18 to the global proclamation of the Gospel—an early pattern of the Church's universal mission."
    },
    {
      "pk": 1901904,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 4,
      "text": "Their voice goes out through all the earth, and their words to the end of the world. In them He has set a tent for the sun,",
      "links": "<a href='/AIV/19/104/2'>Ps. 104:2</a>; <a href='/AIV/45/10/18'>Rom. 10:18</a>",
      "comment": "The Gospel’s worldwide proclamation is foreshadowed here; Paul alludes to this verse in Romans 10:18, supporting the Catholic understanding of the Apostolic Church’s universality."
    },
    {
      "pk": 1901905,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 5,
      "text": "which comes out like a bridegroom from his chamber, and rejoices like a champion to run his course.",
      "links": "<a href='/AIV/19/45/1'>Ps. 45:1</a>; <a href='/AIV/40/9/15'>Matt. 9:15</a>; <a href='/AIV/43/3/29'>John 3:29</a>",
      "comment": "The sun, figuratively as a bridegroom, prefigures Christ, the Bridegroom of the Church (see John 3:29). The joyful 'race' is reminiscent of Christ's mission, which brings light to the world."
    },
    {
      "pk": 1901906,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 6,
      "text": "Its rising is from one end of the heavens, and its circuit to the other end, and nothing is hidden from its heat.",
      "links": "<a href='/AIV/19/104/19-22'>Ps. 104:19–22</a>",
      "comment": "The universality of the sun’s light reflects the universality of Christ’s grace, echoed in the Church's worldwide mission."
    },
    {
      "pk": 1901907,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 7,
      "text": "The law of the LORD is perfect, restoring the soul; the testimony of the LORD is trustworthy, making wise the simple.",
      "links": "<a href='/AIV/19/119/1-2'>Ps. 119:1–2</a>; <a href='/AIV/19/119/130'>Ps. 119:130</a>; <a href='/AIV/2/20/1'>Ex. 20:1</a>",
      "comment": "The 'law' (torah) does not just refer to rules but to God's full instruction—fulfilled ultimately in Christ who perfectly restores souls, a central theme of Catholic sacramental teaching."
    },
    {
      "pk": 1901908,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 8,
      "text": "The precepts of the LORD are upright, rejoicing the heart; the commandment of the LORD is pure, enlightening the eyes.",
      "links": "<a href='/AIV/19/119/32'>Ps. 119:32</a>; <a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "Scripture here links upright living not with burden, but with joy and enlightenment, which are gifts of God's grace through His Word and, by extension, His Church."
    },
    {
      "pk": 1901909,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 9,
      "text": "The fear of the LORD is pure, enduring forever. The rules of the LORD are true and altogether righteous.",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>; <a href='/AIV/19/119/160'>Ps. 119:160</a>",
      "comment": "This verse connects reverence for God ('fear') with purity and constancy, hallmarks of true worship, reflected in the Church's liturgical tradition."
    },
    {
      "pk": 1901910,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 10,
      "text": "They are more desirable than gold, even much pure gold; sweeter also than honey and drippings from the honeycomb.",
      "links": "<a href='/AIV/19/119/72'>Ps. 119:72</a>; <a href='/AIV/19/119/103'>Ps. 119:103</a>",
      "comment": "God's commandments are valued above material wealth and pleasure—hinting at the Catholic emphasis on the spiritual over the temporal."
    },
    {
      "pk": 1901911,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 11,
      "text": "By them Your servant is warned; in keeping them there is great reward.",
      "links": "<a href='/AIV/19/18/23'>Ps. 18:23</a>; <a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "God’s commandments both warn and promise reward for obedience, foreshadowing Jesus' teaching on reward in the heavenly kingdom (cf. Matt. 5:12)."
    },
    {
      "pk": 1901912,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 12,
      "text": "Who can discern his own errors? Cleanse me from hidden faults.",
      "links": "<a href='/AIV/19/139/23-24'>Ps. 139:23–24</a>; <a href='/AIV/1/6/5'>Gen. 6:5</a>",
      "comment": "The psalmist recognizes the need for God’s grace to purify even those sins we cannot perceive—a theme realized in Catholic sacramental confession."
    },
    {
      "pk": 1901913,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 13,
      "text": "Keep back Your servant also from willful sins; let them not rule over me. Then I shall be blameless and innocent of great transgression.",
      "links": "<a href='/AIV/19/119/133'>Ps. 119:133</a>; <a href='/AIV/19/32/2'>Ps. 32:2</a>",
      "comment": "Distinction between hidden and willful sins relates to Catholic teaching on mortal and venial sin—a call to seek God’s grace and remain blameless through repentance."
    },
    {
      "pk": 1901914,
      "translation": "AIV",
      "book": 19,
      "chapter": 19,
      "verse": 14,
      "text": "Let the words of my mouth and the meditation of my heart be acceptable in Your sight, O LORD, my rock and my redeemer.",
      "links": "<a href='/AIV/54/1/5'>1 Tim. 1:5</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "The language 'acceptable in Your sight' echoes the Catholic liturgy’s plea for purity of thought and deed. Identifying God as 'my rock and my redeemer' foreshadows the New Testament’s portrayal of Christ as Redeemer (see 1 Pet. 1:18–19)."
    }
  ],
  "translatedAt": "2025-12-22T21:26:21.162Z"
}