{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 125,
  "verses": [
    {
      "pk": 23125001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 125,
      "verse": 1,
      "text": "Those who trust in the LORD are like Mount Zion, which cannot be shaken, but remains forever.",
      "links": "<a href='/AIV/23/46/5'>Ps. 46:5</a>; <a href='/AIV/23/121/1'>Ps. 121:1</a>; <a href='/AIV/23/87/1'>Ps. 87:1</a>",
      "comment": "The enduring stability of Mount Zion is used as a metaphor for the unshakable security of believers who trust in the LORD. Zion often represents God's chosen place, further foreshadowing the permanent establishment of God's people, both the earthly city Jerusalem and the spiritual assembly of believers (see Hebrews 12:22)."
    },
    {
      "pk": 23125002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 125,
      "verse": 2,
      "text": "As the mountains surround Jerusalem, so the LORD surrounds His people, from this time forth and forevermore.",
      "links": "<a href='/AIV/23/34/7'>Ps. 34:7</a>; <a href='/AIV/23/121/2-8'>Ps. 121:2-8</a>",
      "comment": "The imagery of mountains encircling Jerusalem signifies divine protection that is both absolute and enduring. There is a spiritual interpretation here of God's continual guarding of His people not only physically, but also spiritually, promising lasting communion and safeguarding (see John 10:27-30)."
    },
    {
      "pk": 23125003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 125,
      "verse": 3,
      "text": "For the scepter of wickedness will not rest on the land allotted to the righteous, so that the righteous may not stretch out their hands to wrongdoing.",
      "links": "<a href='/AIV/23/37/17'>Ps. 37:17</a>; <a href='/AIV/23/16/5-6'>Ps. 16:5-6</a>; <a href='/AIV/20/29/2'>Prov. 29:2</a>",
      "comment": "This verse expresses assurance that evil will not dominate God's inheritance. The implication has both literal (Israel's land) and spiritual application (the inheritance of God's holy people). Note the high expectation of perseverance and moral steadfastness for those called to holiness (see 1 Peter 1:15-16)."
    },
    {
      "pk": 23125004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 125,
      "verse": 4,
      "text": "Do good, O LORD, to those who are good, and to those who are upright in their hearts.",
      "links": "<a href='/AIV/23/73/1'>Ps. 73:1</a>; <a href='/AIV/23/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/40/5/8'>Matt. 5:8</a>",
      "comment": "A prayer that God would bless the righteous, especially those pure in heart. This ties to the spiritual transformation required for true goodness, foreshadowing Christ’s teaching in the Sermon on the Mount where the pure in heart see God, and points toward the necessity of internal holiness through God's grace."
    },
    {
      "pk": 23125005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 125,
      "verse": 5,
      "text": "But as for those who turn aside to crooked ways, the LORD will drive them away with the evildoers. Peace be upon Israel.",
      "links": "<a href='/AIV/23/1/6'>Ps. 1:6</a>; <a href='/AIV/23/128/6'>Ps. 128:6</a>; <a href='/AIV/40/7/13-14'>Matt. 7:13-14</a>",
      "comment": "The distinction between the righteous and the wicked here is clear and includes both their destiny and unity with God's people. The closing blessing, 'Peace be upon Israel,' hints at deeper spiritual harmony promised to the true Israel of God, later fulfilled in Christ and extended to all those united in faith (see Galatians 6:16)."
    }
  ],
  "translatedAt": "2025-12-24T06:43:04.881Z"
}