{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 14,
  "verses": [
    {
      "pk": 22014001,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 1,
      "text": "The fool says in his heart, \"There is no God.\" They are corrupt; they do abominable deeds. There is no one who does good.",
      "links": "<a href='/AIV/53/3/2'>Rom. 3:10-12</a>; <a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "Paul quotes this passage in Romans, emphasizing universal human sinfulness. The word 'abominable' stresses the gravity of their wrongdoing. The heart, in Hebrew thought, means the inner self, not just emotions."
    },
    {
      "pk": 22014002,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 2,
      "text": "The LORD looks down from heaven on the children of man to see if there are any who understand, any who seek God.",
      "links": "<a href='/AIV/19/33/13-15'>Ps. 33:13–15</a>; <a href='/AIV/19/11/4'>Ps. 11:4</a>",
      "comment": "God’s search for those who seek Him echoes His initiative in salvation history. This shows both God’s transcendence (He looks from heaven) and His immanence (He cares for humanity)."
    },
    {
      "pk": 22014003,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 3,
      "text": "They have all turned aside; together they have become corrupt. There is no one who does good, not even one.",
      "links": "<a href='/AIV/53/3/12'>Rom. 3:12</a>; <a href='/AIV/19/53/3'>Ps. 53:3</a>",
      "comment": "This verse underlines original sin and universal need for redemption. It is a key verse used by Paul to describe fallen humanity’s condition, highlighting our need for grace and undeserved mercy."
    },
    {
      "pk": 22014004,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 4,
      "text": "Do all these evildoers know nothing? They devour my people as though eating bread; they do not call on the LORD.",
      "links": "<a href='/AIV/19/53/4'>Ps. 53:4</a>; <a href='/AIV/33/3/3'>Mic. 3:3</a>",
      "comment": "Eating bread is an idiom for constant action. 'My people' implies a definite group set apart by God, prefiguring the visible community of faithful believers. Not calling on the LORD points to neglect of true worship."
    },
    {
      "pk": 22014005,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 5,
      "text": "There they are, filled with terror, for God is with the generation of the righteous.",
      "links": "<a href='/AIV/19/53/5'>Ps. 53:5</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s presence brings fear to the wicked but comfort to the righteous. This verse anticipates God’s promise to be with His people—a theme fulfilled in Christ’s promise to be with believers always (Matt. 28:20)."
    },
    {
      "pk": 22014006,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 6,
      "text": "You evildoers frustrate the plans of the poor, but the LORD is their refuge.",
      "links": "<a href='/AIV/19/12/5'>Ps. 12:5</a>; <a href='/AIV/19/9/9'>Ps. 9:9</a>",
      "comment": "The Lord’s care for the poor is a constant biblical theme, pointing to spiritual and material protection found in God alone. The idea of God as 'refuge' is a spiritual assurance central to faith."
    },
    {
      "pk": 22014007,
      "translation": "AIV",
      "book": 19,
      "chapter": 14,
      "verse": 7,
      "text": "Oh, that salvation for Israel would come out of Zion! When the LORD restores the fortunes of his people, let Jacob rejoice, let Israel be glad.",
      "links": "<a href='/AIV/40/21/9'>Matt. 21:9</a>; <a href='/AIV/45/11/26'>Rom. 11:26</a>",
      "comment": "Salvation coming from Zion foreshadows the coming of the Messiah from the holy city, as fulfilled in the New Testament. The restoration of God’s people points to ultimate redemption and the joy of the faithful gathered together, reflecting the hope of resurrection and the unity of believers."
    }
  ],
  "translatedAt": "2025-12-23T05:35:04.356Z"
}