{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 101,
  "verses": [
    {
      "pk": 2010101,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 1,
      "text": "I will sing of mercy and justice; to you, LORD, I will make music.",
      "links": "<a href='/AIV/19/89/1'>Ps. 89:1</a>; <a href='/AIV/19/36/5'>Ps. 36:5</a>",
      "comment": "The psalmist begins by declaring his intent to praise God for both His steadfast love (mercy) and justice. The union of mercy and justice reflects the fullness of God’s character, pointing prophetically to the work of Christ, in whom mercy and justice meet (see <a href='/AIV/45/3/26'>Rom. 3:26</a> where God is both just and the justifier)."
    },
    {
      "pk": 2010102,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 2,
      "text": "I will pay attention to the way that is blameless. When will you come to me? I will walk within my house with a blameless heart.",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/19/18/23'>Ps. 18:23</a>",
      "comment": "The psalmist commits to moral integrity in all areas, even within his own household. The question 'When will you come to me?' expresses a longing for God’s presence, which is fulfilled in Christ dwelling among us (<a href='/AIV/43/1/14'>John 1:14</a>). The spiritual discipline of seeking a pure life prepares the soul to receive God intimately."
    },
    {
      "pk": 2010103,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 3,
      "text": "I will not set before my eyes anything that is worthless. I hate the works of those who turn aside; it shall not cling to me.",
      "links": "<a href='/AIV/19/119/37'>Ps. 119:37</a>; <a href='/AIV/19/26/4'>Ps. 26:4</a>",
      "comment": "Personal holiness means avoiding evil influences. The resolve to shun anything worthless suggests vigilance over what one consumes and who one associates with, a theme that aligns with the teaching to keep the heart pure (<a href='/AIV/40/5/8'>Matt. 5:8</a>)."
    },
    {
      "pk": 2010104,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 4,
      "text": "A crooked heart will be far from me; I will not know evil.",
      "links": "<a href='/AIV/19/119/115'>Ps. 119:115</a>; <a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "Rejecting wicked thoughts and separating oneself from evil is essential for spiritual growth. This echoes the call to ongoing conversion of the heart, emphasizing the pursuit of holiness as a journey in the Christian life (<a href='/AIV/58/12/14'>Heb. 12:14</a>)."
    },
    {
      "pk": 2010105,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 5,
      "text": "Whoever slanders his neighbor in secret, I will silence; whoever is arrogant and proud, I will not endure.",
      "links": "<a href='/AIV/19/15/3'>Ps. 15:3</a>; <a href='/AIV/20/6/16-19'>Prov. 6:16–19</a>",
      "comment": "Slander and pride damage unity. The psalmist’s intolerance for these sins hints at the importance of unity and holiness among God’s people, seen later in Christ’s command to love one another (<a href='/AIV/43/13/34'>John 13:34</a>)."
    },
    {
      "pk": 2010106,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 6,
      "text": "My eyes will be on the faithful of the land, so that they may dwell with me; he who walks in a blameless way will serve me.",
      "links": "<a href='/AIV/19/15/1-2'>Ps. 15:1–2</a>; <a href='/AIV/19/18/25'>Ps. 18:25</a>",
      "comment": "Favor is shown to the faithful, emphasizing the blessedness of living righteously and the communal nature of serving God—a foretaste of the unity of God’s people in the new covenant (<a href='/AIV/44/2/42-47'>Acts 2:42–47</a>)."
    },
    {
      "pk": 2010107,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 7,
      "text": "No one who practices deceit will dwell within my house; no one who speaks lies will stand in my presence.",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>; <a href='/AIV/66/21/8'>Rev. 21:8</a>",
      "comment": "Truthfulness is required for communion with God. Only those who reject lies and deceit may remain in fellowship, paralleling the call to ongoing confession and renewal (<a href='/AIV/62/1/9'>1 John 1:9</a>)."
    },
    {
      "pk": 2010108,
      "translation": "AIV",
      "book": 19,
      "chapter": 101,
      "verse": 8,
      "text": "Every morning I will destroy all the wicked of the land, cutting off all evildoers from the city of the LORD.",
      "links": "<a href='/AIV/19/46/4'>Ps. 46:4</a>; <a href='/AIV/23/1/26'>Isa. 1:26</a>",
      "comment": "Daily commitment to rooting out evil reflects ongoing moral vigilance and purification, anticipating the final establishment of God’s holy city. This foreshadows the New Jerusalem, where nothing unclean shall enter (<a href='/AIV/66/21/27'>Rev. 21:27</a>)."
    }
  ],
  "translatedAt": "2025-12-23T05:37:14.434Z"
}