{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 150,
  "verses": [
    {
      "pk": 1500060,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 1,
      "text": "Praise the LORD! Praise God in His sanctuary; praise Him in His mighty heaven.",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>; <a href='/AIV/19/20/2'>Ps. 20:2</a>; <a href='/AIV/19/148/1'>Ps. 148:1</a>",
      "comment": "The location of praise—God’s sanctuary and heaven—reflects both earthly worship and the worship taking place in heaven. Spiritual and literal dimensions unite here, hinting toward the importance of God’s dwelling among His people and the heavenly liturgy. For believers, this points to reverent liturgical worship and participating in the worship of angels and saints."
    },
    {
      "pk": 1500061,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 2,
      "text": "Praise Him for His mighty deeds; praise Him according to His excellent greatness.",
      "links": "<a href='/AIV/19/145/4'>Ps. 145:4</a>; <a href='/AIV/19/66/3'>Ps. 66:3</a>",
      "comment": "Mighty deeds recall the acts of salvation in both Old and New Testaments, including creation, exodus, and the resurrection of Christ. His 'excellent greatness' points to God’s transcendent glory, inviting us to celebrate His divine attributes and salvific works—central to Christian worship."
    },
    {
      "pk": 1500062,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 3,
      "text": "Praise Him with the blast of the trumpet; praise Him with the harp and lyre.",
      "links": "<a href='/AIV/19/98/6'>Ps. 98:6</a>; <a href='/AIV/19/33/2'>Ps. 33:2</a>",
      "comment": "The use of musical instruments in worship highlights the harmony of human talents offered to God. Trumpet and harp were central to temple worship, and their inclusion here encourages integrating physical expressions into spiritual praise—a theme continued in apostolic teachings regarding unity in worship."
    },
    {
      "pk": 1500063,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 4,
      "text": "Praise Him with tambourine and dance; praise Him with strings and pipe.",
      "links": "<a href='/AIV/19/149/3'>Ps. 149:3</a>; <a href='/AIV/02/15/20'>Ex. 15:20</a>",
      "comment": "Dance and instruments reflect a fully engaged worship, body and soul, reminiscent of Miriam leading the people after crossing the Red Sea. The tradition of worshiping God with all faculties has roots in both the Old Testament and early Christian tradition."
    },
    {
      "pk": 1500064,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 5,
      "text": "Praise Him with loud cymbals; praise Him with resounding cymbals.",
      "links": "<a href='/AIV/19/81/2'>Ps. 81:2</a>; <a href='/AIV/13/15/16'>1 Chron. 15:16</a>",
      "comment": "The mention of loud and resounding cymbals points to the celebratory aspect of worship, not just quiet contemplation but also joyful proclamation. This foreshadows the joy expressed by the multitude in Revelation, worshiping with every voice and instrument before God’s throne."
    },
    {
      "pk": 1500065,
      "translation": "AIV",
      "book": 19,
      "chapter": 150,
      "verse": 6,
      "text": "Let everything that has breath praise the LORD! Praise the LORD!",
      "links": "<a href='/AIV/19/148/5'>Ps. 148:5</a>; <a href='/AIV/23/42/10'>Isa. 42:10</a>; <a href='/AIV/41/16/15'>Mark 16:15</a>",
      "comment": "All creation is summoned to give praise—this is both a literal and spiritual call to worship, fulfilled in Christ’s command to proclaim the Gospel to all people. The phrase underscores the universality of God’s glory, inviting every living thing into Scripture-founded, communal worship. In liturgical context, it finds echo in the unity of voices lifted together before God."
    }
  ],
  "translatedAt": "2025-12-23T05:52:38.833Z"
}