{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 108,
  "verses": [
    {
      "pk": 23108001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 1,
      "text": "My heart is steadfast, O God; I will sing and make melody with all my soul.",
      "links": "<a href='/AIV/19/57/7'>Ps. 57:7</a>; <a href='/AIV/19/138/1'>Ps. 138:1</a>",
      "comment": "The psalmist begins by affirming a steady and worshipful heart, echoing similar declarations from other psalms. The soul’s involvement hints at a holistic offering to God, an early echo of the biblical call to worship with one’s whole being, reminiscent of the unity between interior devotion and exterior worship."
    },
    {
      "pk": 23108002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 2,
      "text": "Awake, harp and lyre! I will awaken the dawn.",
      "links": "<a href='/AIV/19/57/8'>Ps. 57:8</a>; <a href='/AIV/19/92/2'>Ps. 92:2</a>",
      "comment": "The mention of musical instruments highlights both individual and communal praise. The phrase 'awaken the dawn' suggests the priority of honoring God at the start of each day, pointing to the value of daily liturgical prayer."
    },
    {
      "pk": 23108003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 3,
      "text": "I will thank you among the peoples, O LORD; I will sing praises to you among the nations.",
      "links": "<a href='/AIV/19/57/9'>Ps. 57:9</a>; <a href='/AIV/19/18/49'>Ps. 18:49</a>; <a href='/AIV/19/117/1'>Ps. 117:1</a>",
      "comment": "Praise is meant to be public and universal, transcending cultural boundaries. This foreshadows the mission to all nations and the unity of all believers in worship, an early glimpse of what Christ will fulfill. See also Rom. 15:9."
    },
    {
      "pk": 23108004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 4,
      "text": "For your steadfast love is greater than the heavens, and your faithfulness reaches to the clouds.",
      "links": "<a href='/AIV/19/57/10'>Ps. 57:10</a>; <a href='/AIV/19/36/5'>Ps. 36:5</a>; <a href='/AIV/19/103/11'>Ps. 103:11</a>",
      "comment": "God’s love and faithfulness are seen as infinite, stretching beyond human comprehension. This verse echoes key attributes of God later fully revealed in Christ, whose sacrifice is the supreme act of steadfast love."
    },
    {
      "pk": 23108005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 5,
      "text": "Rise above the heavens, O God, and let your glory cover all the earth.",
      "links": "<a href='/AIV/19/57/11'>Ps. 57:11</a>; <a href='/AIV/19/113/4'>Ps. 113:4</a>",
      "comment": "The exaltation of God above the heavens anticipates the revelation of God’s glory to all mankind through the Incarnation. The emphasis on glory filling the earth calls to mind the worldwide spread of true worship."
    },
    {
      "pk": 23108006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 6,
      "text": "So that your beloved ones may be saved; save with your right hand and answer me.",
      "links": "<a href='/AIV/19/60/5'>Ps. 60:5</a>; <a href='/AIV/19/17/7'>Ps. 17:7</a>",
      "comment": "A prayer for salvation of the faithful, often called God’s ‘beloved’. The reference to God’s ‘right hand’ is a biblical image associated with deliverance and authority (see Ex. 15:6, Mt. 26:64). Historically, this foreshadows Christ seated at the right hand of God interceding for his people."
    },
    {
      "pk": 23108007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 7,
      "text": "God has spoken in his holiness: 'I will divide up Shechem and measure off the Valley of Succoth.'",
      "links": "<a href='/AIV/19/60/6'>Ps. 60:6</a>; <a href='/AIV/06/17/7'>Josh. 17:7'>",
      "comment": "Quoting God's covenant speech, the psalm shows divine control and ownership of the land. The setting apart of places underlines God’s authority to order His people and fulfill His promises—an idea developed more fully with the sacramental ordering of the Church."
    },
    {
      "pk": 23108008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 8,
      "text": "Gilead is mine, Manasseh is mine; Ephraim is my helmet, Judah my scepter.",
      "links": "<a href='/AIV/19/60/7'>Ps. 60:7</a>; <a href='/AIV/18/19/9'>Job 19:9</a>",
      "comment": "These tribal regions are claimed by God. The symbolic roles—Ephraim as helmet (protection) and Judah as scepter (kingship)—point to both God’s protection and the royal lineage, which culminates in Jesus, son of David (Mt. 1:1), King and High Priest."
    },
    {
      "pk": 23108009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 9,
      "text": "Moab is my washbasin; upon Edom I throw my sandal; over Philistia I shout in triumph.",
      "links": "<a href='/AIV/19/60/8'>Ps. 60:8</a>; <a href='/AIV/19/83/6'>Ps. 83:6</a>",
      "comment": "These statements represent God's sovereignty over enemy nations. The sandal-thrown at Edom echoes ancient customs to symbolize conquest or claim—a typology picked up in the New Testament as the nations become subject to Christ’s reign (see Ps. 2:8-9)."
    },
    {
      "pk": 23108010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 10,
      "text": "Who will bring me to the fortified city? Who will lead me to Edom?",
      "links": "<a href='/AIV/19/60/9'>Ps. 60:9</a>; <a href='/AIV/07/1/2'>Judg. 1:2</a>",
      "comment": "The psalmist calls for divine guidance to victories that seem otherwise unattainable, a reminder to trust God's leadership even in matters of conquest and spiritual progress."
    },
    {
      "pk": 23108011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 11,
      "text": "Have you not rejected us, O God? You do not go forth with our armies.",
      "links": "<a href='/AIV/19/44/9'>Ps. 44:9</a>; <a href='/AIV/19/74/1'>Ps. 74:1</a>",
      "comment": "There is spiritual honesty in acknowledging times of perceived divine absence. The recognition of dependence on God’s presence prepares the heart for sincere repentance and return—a central theme throughout Scripture."
    },
    {
      "pk": 23108012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 12,
      "text": "Grant us help against the enemy, for the help of man is worthless.",
      "links": "<a href='/AIV/19/60/11'>Ps. 60:11</a>; <a href='/AIV/19/146/3'>Ps. 146:3</a>",
      "comment": "The psalmist declares that true help comes from God alone, not from human strength. This foreshadows spiritual dependence found in the life of Christ and the call to trust in divine grace above human works."
    },
    {
      "pk": 23108013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 108,
      "verse": 13,
      "text": "With God we shall do valiantly; and he will tread down our enemies.",
      "links": "<a href='/AIV/19/60/12'>Ps. 60:12</a>; <a href='/AIV/03/26/7'>Lev. 26:7</a>",
      "comment": "Faith leads to victory through God’s action, not human power. The crushing of enemies is both a literal historic reference and a spiritual prophecy, fulfilled in Christ who defeats sin and death, and extends victory to all who belong to Him through the visible communion of the Church."
    }
  ],
  "translatedAt": "2025-12-24T06:38:30.949Z"
}