{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 54,
  "verses": [
    {
      "pk": 23054001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 1,
      "text": "God, save me by your name, and vindicate me by your power.",
      "links": "<a href='/AIV/19/20/1'>Ps. 20:1</a>; <a href='/AIV/19/44/26'>Ps. 44:26</a>",
      "comment": "David appeals to God's name and power for salvation. In biblical thought, God's 'name' represents His presence and authority. This foreshadows Christ, who saves by His own name (Acts 4:12). The trust in divine power aligns with authentic faith that relies not on human strength but God’s."
    },
    {
      "pk": 23054002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 2,
      "text": "Hear my prayer, God; listen to the words of my mouth.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/19/5/1-2'>Ps. 5:1-2</a>",
      "comment": "The Psalmist's plea underscores the intimacy of prayer and the expectation that God listens. Prayer is always presented as directed to God Himself, a vital part of personal and community worship. This persistent prayer reflects the faith of the righteous (James 5:16), and the importance of praying with trust."
    },
    {
      "pk": 23054003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 3,
      "text": "For strangers have risen up against me, and violent men seek my life; they do not set God before them.",
      "links": "<a href='/AIV/19/86/14'>Ps. 86:14</a>; <a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "David describes his persecutors as 'strangers'—those outside the fellowship of God’s people. They are violent and act without reverence for God. This echoes the plight of Christ, who was rejected and suffered at the hands of sinners (Luke 22:63-71). The language recalls the biblical teaching that separation from God leads to violence and disorder."
    },
    {
      "pk": 23054004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 4,
      "text": "Surely, God is my helper; the Lord is the one who sustains my soul.",
      "links": "<a href='/AIV/19/118/6-7'>Ps. 118:6-7</a>; <a href='/AIV/58/13/6'>Heb. 13:6</a>",
      "comment": "Affirming the Lord as helper and sustainer is crucial to both individual trust and the united faith of the Church. God’s personal support is the basis for fearless living (Hebrews 13:6). David’s words point to the relationship God desires—with His people relying on Him, and His faithfulness sustaining them."
    },
    {
      "pk": 23054005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 5,
      "text": "He will repay evil to my enemies; in your faithfulness, put an end to them.",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/20/25/21-22'>Prov. 25:21-22</a>",
      "comment": "Divine justice is entrusted to God, not human vengeance (cf. Romans 12:19). David embodies the faith that ultimate justice comes from God’s faithfulness. This principle forms the scriptural foundation for praying for one’s enemies, leaving judgment to God, and the call to mercy alongside justice."
    },
    {
      "pk": 23054006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 6,
      "text": "With a freewill offering I will sacrifice to you; I will praise your name, Lord, for it is good.",
      "links": "<a href='/AIV/19/50/14'>Ps. 50:14</a>; <a href='/AIV/19/116/17'>Ps. 116:17</a>",
      "comment": "The Psalmist’s response to salvation is a ‘freewill offering’ and praise. Sacrifice was central to worship, and voluntary offerings expressed love and gratitude. In the New Testament, this is fulfilled in Christ’s self-offering and in the Church’s sacramental worship (Hebrews 13:15-16). Notice the trust that God’s name itself is worthy of all praise—pointing towards the worship centered on God’s revealed name."
    },
    {
      "pk": 23054007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 54,
      "verse": 7,
      "text": "For he has delivered me from every trouble, and my eyes have looked in triumph on my enemies.",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/19/112/8'>Ps. 112:8</a>",
      "comment": "David looks back in gratitude at God’s deliverance. The past acts of salvation inspire future trust. This ‘deliverance’ language connects to the biblical theme of God’s people being saved from evil—fulfilled in Christ’s victory over sin, death, and spiritual enemies (Colossians 2:15). Final triumph and vindication are a hope kept alive in the common liturgical life and worship of all believers."
    }
  ],
  "translatedAt": "2025-12-24T06:17:25.197Z"
}