{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 42,
  "verses": [
    {
      "pk": 4204201,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 1,
      "text": "As the deer pants for streams of water, so my soul pants for you, O God.",
      "links": "<a href='/AIV/63/2/15'>Song 2:15</a>; <a href='/AIV/19/63/1'>Ps. 63:1</a>",
      "comment": "This poetic image expresses deep longing for God, hinting at the soul's thirst for union with Him. The deer traditionally symbolizes the pursuit of spiritual life, which later Church Fathers, like Augustine, interpreted as man's longing for grace found especially in the sacramental life of the Church."
    },
    {
      "pk": 4204202,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 2,
      "text": "My soul thirsts for God, for the living God. When shall I come and appear before God?",
      "links": "<a href='/AIV/19/84/2'>Ps. 84:2</a>; <a href='/AIV/19/63/2'>Ps. 63:2</a>",
      "comment": "Longing to appear before God reflects Israel’s tradition of temple worship. Catholics see a type of the Eucharist here, where believers come into God's presence. Cf. John 6:51 for the fulfillment in Christ offering himself as the 'living bread.'"
    },
    {
      "pk": 4204203,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 3,
      "text": "My tears have been my food day and night, while they say to me all day long, 'Where is your God?'",
      "links": "<a href='/AIV/19/79/10'>Ps. 79:10</a>; <a href='/AIV/19/115/2'>Ps. 115:2</a>",
      "comment": "The psalmist's suffering and the taunts of enemies echo the passion of Christ. Early Christians saw in such verses a prophecy of Christ’s sorrow and his being mocked on the cross (<a href='/AIV/19/22/8'>Ps. 22:8</a>)."
    },
    {
      "pk": 4204204,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 4,
      "text": "These things I remember as I pour out my soul: how I would go with the multitude, leading them in procession to the house of God, with shouts of joy and praise, a festival throng.",
      "links": "<a href='/AIV/19/55/14'>Ps. 55:14</a>; <a href='/AIV/19/122/1'>Ps. 122:1</a>",
      "comment": "This verse recalls communal worship, a foreshadowing of Christian liturgy. The festival procession finds its New Testament echo in the people of God gathering for the Mass—interpreted as a foretaste of heavenly worship (<a href='/AIV/66/7/9-10'>Rev. 7:9-10</a>)."
    },
    {
      "pk": 4204205,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 5,
      "text": "Why are you cast down, O my soul, and why are you in turmoil within me? Hope in God; for I shall again praise Him, my salvation and my God.",
      "links": "<a href='/AIV/19/43/5'>Ps. 43:5</a>; <a href='/AIV/19/27/13-14'>Ps. 27:13–14</a>",
      "comment": "An exhortation to interior hope that resonates with later Christian teachings on perseverance, especially through trial. The repeated refrain underscores the need for steadfast faith, akin to the virtue of hope, which is so central to Catholic teaching."
    },
    {
      "pk": 4204206,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 6,
      "text": "O my God, my soul is downcast within me; therefore I will remember you from the land of the Jordan, and of Hermon, from Mount Mizar.",
      "links": "<a href='/AIV/19/77/11'>Ps. 77:11</a>; <a href='/AIV/19/61/2'>Ps. 61:2</a>",
      "comment": "The psalmist recalls God even in exile, signifying that God's presence transcends place—an idea fulfilled in Christ, who is present wherever the faithful gather, especially in the sacraments (<a href='/AIV/40/18/20'>Matt. 18:20</a>)."
    },
    {
      "pk": 4204207,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 7,
      "text": "Deep calls to deep at the sound of your waterfalls; all your waves and breakers have swept over me.",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>; <a href='/AIV/32/2/3'>Jonah 2:3</a>",
      "comment": "A metaphor for overwhelming distress, frequently employed in both prayer and mystical theology to describe how God’s mysteries are beyond us. Catholic mystics saw 'deep calls to deep' as the soul yearning for God’s infinite depths—satisfied chiefly, they believed, through the sacramental life."
    },
    {
      "pk": 4204208,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 8,
      "text": "By day the LORD commands his steadfast love, and at night his song is with me, a prayer to the God of my life.",
      "links": "<a href='/AIV/19/63/6'>Ps. 63:6</a>; <a href='/AIV/19/16/7'>Ps. 16:7</a>",
      "comment": "God’s love and constant presence are central. The tradition of daily prayers (e.g., Liturgy of the Hours) echoed here, shows continuity from the Old Testament practice to the full Christian life—especially in Catholic devotional practice."
    },
    {
      "pk": 4204209,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 9,
      "text": "I say to God, my Rock: 'Why have you forgotten me? Why do I go mourning because of the oppression of the enemy?'",
      "links": "<a href='/AIV/19/31/3'>Ps. 31:3</a>; <a href='/AIV/19/10/1'>Ps. 10:1</a>",
      "comment": "The cry, 'Why have you forgotten me?' anticipates the words of Christ on the cross (<a href='/AIV/19/22/1'>Ps. 22:1</a>; <a href='/AIV/41/15/34'>Mark 15:34</a>). Protestants and Catholics both note the foreshadowing of Christ’s passion here."
    },
    {
      "pk": 4204210,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 10,
      "text": "As with a deadly wound in my bones, my adversaries taunt me, while they say to me all day long, 'Where is your God?'",
      "links": "<a href='/AIV/19/22/7-8'>Ps. 22:7–8</a>; <a href='/AIV/19/79/10'>Ps. 79:10</a>",
      "comment": "The taunt 'Where is your God?' matches the scorn poured on Jesus during his crucifixion, which both Catholics and Protestants understand as fulfillment of messianic prophecy (cf. <a href='/AIV/19/22/7-8'>Ps. 22:7–8</a>)."
    },
    {
      "pk": 4204211,
      "translation": "AIV",
      "book": 19,
      "chapter": 42,
      "verse": 11,
      "text": "Why are you cast down, O my soul, and why are you in turmoil within me? Hope in God; for I shall again praise Him, my salvation and my God.",
      "links": "<a href='/AIV/19/43/5'>Ps. 43:5</a>; <a href='/AIV/19/27/13-14'>Ps. 27:13–14</a>",
      "comment": "The final repeated refrain, a call to hope, reflects the need for persistence in faith—encouraged by the Church throughout the ages, notably through communal prayer, confession, the Mass, and the assurance of God’s grace."
    }
  ],
  "translatedAt": "2025-12-22T21:33:36.910Z"
}