{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 9,
  "verses": [
    {
      "pk": 290901,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 1,
      "text": "I will give thanks to the LORD with my whole heart; I will recount all your wonderful deeds.",
      "links": "<a href='/AIV/19/111/1'>Psalm 111:1</a>; <a href='/AIV/19/26/7'>Psalm 26:7</a>",
      "comment": "David's thanksgiving reflects wholehearted devotion. Note the idea of using one's whole heart, which in Catholic tradition is echoed in the call for the faithful to love God with the entirety of their being, as in the Eucharist."
    },
    {
      "pk": 290902,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 2,
      "text": "I will be glad and rejoice in you; I will sing praise to your name, O Most High.",
      "links": "<a href='/AIV/19/21/13'>Psalm 21:13</a>; <a href='/AIV/19/47/6'>Psalm 47:6</a>",
      "comment": "Praising God connects both to Jewish worship and to Christian liturgy, especially the Mass, which continues the tradition of singing praise (cf. Revelation 5:8-10)."
    },
    {
      "pk": 290903,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 3,
      "text": "When my enemies turn back, they stumble and perish before your presence.",
      "links": "<a href='/AIV/19/27/2'>Psalm 27:2</a>",
      "comment": "God's presence brings victory and judgment. Early Church Fathers saw references to Christ's ultimate victory over sin and Satan here (cf. Colossians 2:15)."
    },
    {
      "pk": 290904,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 4,
      "text": "For you have upheld my right and my cause; you have sat on the throne judging righteously.",
      "links": "<a href='/AIV/19/7/8'>Psalm 7:8</a>; <a href='/AIV/19/96/13'>Psalm 96:13</a>",
      "comment": "The 'throne' and just judgment are seen by Catholics as a foreshadowing of Christ as the universal judge (cf. Matthew 25:31-32)."
    },
    {
      "pk": 290905,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 5,
      "text": "You have rebuked the nations, you have destroyed the wicked; you have blotted out their name forever and ever.",
      "links": "<a href='/AIV/19/109/13'>Psalm 109:13</a>; <a href='/AIV/19/69/28'>Psalm 69:28</a>",
      "comment": "Blotting out names hints at the concept of the Book of Life (cf. Revelation 3:5) and God's ultimate authority."
    },
    {
      "pk": 290906,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 6,
      "text": "The enemy came to an end in everlasting ruins; their cities you have uprooted; their memory has perished with them.",
      "links": "<a href='/AIV/19/34/21'>Psalm 34:21</a>",
      "comment": "Ruins and uprooted cities show the finality of God's judgment. The concept of the mortal enemy perishing recalls spiritual battles Christians face (cf. Ephesians 6:12)."
    },
    {
      "pk": 290907,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 7,
      "text": "But the LORD sits enthroned forever; he has established his throne for judgment.",
      "links": "<a href='/AIV/19/29/10'>Psalm 29:10</a>; <a href='/AIV/19/103/19'>Psalm 103:19</a>",
      "comment": "God’s kingship endures forever, a type for Christ's eternal reign, spoken of explicitly in the New Testament (cf. Luke 1:33)."
    },
    {
      "pk": 290908,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 8,
      "text": "He judges the world in righteousness; he governs the peoples with equity.",
      "links": "<a href='/AIV/19/96/10'>Psalm 96:10</a>; <a href='/AIV/19/98/9'>Psalm 98:9</a>",
      "comment": "God's just rule anticipates Christ as the righteous judge of all nations (cf. Acts 17:31). Catholic teaching stresses this universal scope of salvation."
    },
    {
      "pk": 290909,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 9,
      "text": "The LORD is a refuge for the oppressed, a stronghold in times of trouble.",
      "links": "<a href='/AIV/19/46/1'>Psalm 46:1</a>; <a href='/AIV/19/37/39'>Psalm 37:39</a>",
      "comment": "God’s protection for the afflicted has deep resonance with the Catholic emphasis on the Church as a refuge and source of grace."
    },
    {
      "pk": 290910,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 10,
      "text": "Those who know your name put their trust in you, for you, O LORD, have not forsaken those who seek you.",
      "links": "<a href='/AIV/19/22/24'>Psalm 22:24</a>; <a href='/AIV/19/34/4'>Psalm 34:4</a>",
      "comment": "Knowing God's name and seeking Him is a call echoed throughout Catholic spirituality, especially in the lives of the saints."
    },
    {
      "pk": 290911,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 11,
      "text": "Sing praises to the LORD, who sits enthroned in Zion! Declare among the peoples his deeds!",
      "links": "<a href='/AIV/19/132/13'>Psalm 132:13</a>; <a href='/AIV/19/96/3'>Psalm 96:3</a>",
      "comment": "Zion is both literal (Jerusalem) and spiritual (the Church, the new Jerusalem, cf. Hebrews 12:22–23). Declaring God's deeds reflects the missionary mandate."
    },
    {
      "pk": 290912,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 12,
      "text": "For he who avenges blood remembers them; he does not forget the cry of the afflicted.",
      "links": "<a href='/AIV/19/94/1'>Psalm 94:1</a>; <a href='/AIV/19/72/14'>Psalm 72:14</a>",
      "comment": "God’s justice to the oppressed prefigures Christ’s concern for the poor and afflicted. See also Luke 4:18."
    },
    {
      "pk": 290913,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 13,
      "text": "Be gracious to me, O LORD! See my affliction from those who hate me, you who lift me up from the gates of death,",
      "links": "<a href='/AIV/19/86/16'>Psalm 86:16</a>; <a href='/AIV/19/30/3'>Psalm 30:3</a>",
      "comment": "The plea for grace and deliverance is reminiscent of the need for God’s ongoing mercy, a major theme in Catholic liturgy (see Kyrie, eleison)."
    },
    {
      "pk": 290914,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 14,
      "text": "that I may recount all your praises, in the gates of the daughter of Zion, I will rejoice in your salvation.",
      "links": "<a href='/AIV/19/13/5'>Psalm 13:5</a>; <a href='/AIV/19/118/19'>Psalm 118:19</a>",
      "comment": "'Salvation' here is Yeshua, a term some see as foreshadowing Christ’s saving work, especially realized in the Church as the new Zion."
    },
    {
      "pk": 290915,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 15,
      "text": "The nations have sunk in the pit that they made; in the net that they hid, their own foot has been caught.",
      "links": "<a href='/AIV/19/7/15'>Psalm 7:15</a>; <a href='/AIV/19/35/8'>Psalm 35:8</a>",
      "comment": "Much like in Proverbs, evil often backfires on the wicked. Catholic doctrine understands this as part of divine justice."
    },
    {
      "pk": 290916,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 16,
      "text": "The LORD has made himself known, he has executed judgment; the wicked are snared in the work of their own hands. Higgaion. Selah.",
      "links": "<a href='/AIV/19/7/16'>Psalm 7:16</a>",
      "comment": "God’s revelation of Himself through judgment foreshadows the fuller revelation in Christ (cf. John 1:18). 'Higgaion. Selah' likely a musical or liturgical note, underlining the worship context—Catholic liturgy has deep roots in the Psalms."
    },
    {
      "pk": 290917,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 17,
      "text": "The wicked shall return to Sheol, all the nations that forget God.",
      "links": "<a href='/AIV/19/9/5'>Psalm 9:5</a>; <a href='/AIV/20/14/32'>Proverbs 14:32</a>",
      "comment": "'Sheol' is the realm of the dead. Catholic theology would later clarify this as part of its teachings on the afterlife, which includes purgatory and hell, though here the reference is general judgment."
    },
    {
      "pk": 290918,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 18,
      "text": "For the needy shall not always be forgotten, and the hope of the poor shall not perish forever.",
      "links": "<a href='/AIV/19/12/5'>Psalm 12:5</a>; <a href='/AIV/19/34/6'>Psalm 34:6</a>",
      "comment": "Defense of the poor is a recurring theme. The Church’s social teaching on care for the poor is rooted in such passages."
    },
    {
      "pk": 290919,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 19,
      "text": "Arise, O LORD! Let not man prevail; let the nations be judged before you!",
      "links": "<a href='/AIV/19/10/12'>Psalm 10:12</a>; <a href='/AIV/19/82/8'>Psalm 82:8</a>",
      "comment": "A prayer for God’s intervention and ultimate justice. Catholics pray for the final coming of Christ where this justice will be made perfect."
    },
    {
      "pk": 290920,
      "translation": "AIV",
      "book": 19,
      "chapter": 9,
      "verse": 20,
      "text": "Put fear in them, O LORD! Let the nations know they are but men. Selah.",
      "links": "<a href='/AIV/19/59/13'>Psalm 59:13</a>; <a href='/AIV/23/2/22'>Isaiah 2:22</a>",
      "comment": "An appeal for humility among nations. The concept of 'holy fear' (cf. Isaiah 11:2-3) is considered a gift of the Holy Spirit in Catholic teaching, as opposed to mere servile fear."
    }
  ],
  "translatedAt": "2025-12-22T21:23:09.923Z"
}