{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 6,
  "verses": [
    {
      "pk": 23006001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 1,
      "text": "Lord, do not rebuke me in your anger, nor discipline me in your wrath.",
      "links": "<a href='/AIV/18/5/17'>Job 5:17</a>; <a href='/AIV/19/38/1'>Ps. 38:1</a>; <a href='/AIV/19/118/18'>Ps. 118:18</a>; <a href='/AIV/20/3/12'>Prov. 3:12</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "The Psalmist opens with a plea for God's mercy, distinguishing between the Lord's corrective discipline (out of love) and wrath (out of judgment). See also Heb. 12:6, where divine discipline is a sign of sonship. The use of 'Lord' (YHWH) deserves attention as a personal prayer, and prefigures Christ's own prayers for mercy on behalf of humanity."
    },
    {
      "pk": 23006002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 2,
      "text": "Be merciful to me, Lord, for I am weak; heal me, Lord, for my bones are troubled.",
      "links": "<a href='/AIV/19/38/3'>Ps. 38:3</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/10/13/39'>2 Sam. 13:39</a>",
      "comment": "Human weakness and the need for divine healing are emphasized here. The Psalmist approaches God seeking merciful healing, foreshadowing Christ as the divine physician (see Matt. 9:12). This verse can be seen as a prayer both for physical and spiritual healing, hinting at the sacramental ministry Christ would later establish through his apostles."
    },
    {
      "pk": 23006003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 3,
      "text": "My soul is greatly troubled, but you, Lord—how long?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>; <a href='/AIV/35/1/2'>Hab. 1:2</a>; <a href='/AIV/40/26/38'>Matt. 26:38</a>",
      "comment": "The deep spiritual distress here reminds us of Christ’s own agony in Gethsemane (Matt. 26:38). The Psalmist’s longing for God’s consolation illustrates the soul’s journey toward union with God, encouraging ongoing prayer and perseverance, especially in times of spiritual trial."
    },
    {
      "pk": 23006004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 4,
      "text": "Turn, Lord, deliver my soul; save me because of your faithful love.",
      "links": "<a href='/AIV/19/31/16'>Ps. 31:16</a>; <a href='/AIV/19/44/26'>Ps. 44:26</a>; <a href='/AIV/19/143/11'>Ps. 143:11</a>",
      "comment": "God’s saving action is rooted in His steadfast love (hesed), which reflects His covenant faithfulness. For Christians, this faithful love is ultimately fulfilled in Jesus’ saving work. The plea for deliverance presupposes trust in God's promises."
    },
    {
      "pk": 23006005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 5,
      "text": "For in death there is no remembrance of you; in the grave, who will give you thanks?",
      "links": "<a href='/AIV/19/30/9'>Ps. 30:9</a>; <a href='/AIV/19/88/10-12'>Ps. 88:10-12</a>; <a href='/AIV/23/38/18-19'>Isa. 38:18-19</a>",
      "comment": "This verse expresses the Old Testament view of Sheol as a place where praise of God is silenced. As revelation progressed, God's plan for resurrection and eternal life became clearer; see 2 Tim. 1:10. The Psalmist’s argument highlights the importance of public worship and thanksgiving."
    },
    {
      "pk": 23006006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 6,
      "text": "I am worn out from my groaning; all night long I flood my bed with weeping and drench my couch with tears.",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/19/77/2'>Ps. 77:2</a>; <a href='/AIV/25/2/18'>Lam. 2:18</a>",
      "comment": "The Psalmist’s sorrow is intense, indicating real spiritual and emotional suffering. Authentic lamentation in prayer is an ancient tradition, matched by Jesus' own tears over Jerusalem and suffering on the Cross (see Luke 19:41; Heb. 5:7)."
    },
    {
      "pk": 23006007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 7,
      "text": "My eyes grow weak with sorrow; they fail because of all my foes.",
      "links": "<a href='/AIV/19/31/9'>Ps. 31:9</a>; <a href='/AIV/19/88/9'>Ps. 88:9</a>; <a href='/AIV/19/119/82'>Ps. 119:82</a>",
      "comment": "Suffering at the hands of enemies intensifies the Psalmist's distress. The ‘eyes’ symbolize spiritual perception, and their weakness suggests the effect of prolonged suffering. This foreshadows Christ’s endurance of opposition for the sake of God’s plan (see Heb. 12:3)."
    },
    {
      "pk": 23006008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 8,
      "text": "Depart from me, all you evildoers, for the Lord has heard the sound of my weeping.",
      "links": "<a href='/AIV/19/34/15-16'>Ps. 34:15-16</a>; <a href='/AIV/19/139/19'>Ps. 139:19</a>; <a href='/AIV/40/7/23'>Matt. 7:23</a>",
      "comment": "The Psalmist expresses new confidence in God's response. The phrase 'Depart from me, all you evildoers' directly anticipates Jesus’ words in Matt. 7:23, where judgment is linked to righteousness and obedience. God’s attentive ear to the suffering reminds us of the power of persistent prayer."
    },
    {
      "pk": 23006009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 9,
      "text": "The Lord has heard my plea; the Lord accepts my prayer.",
      "links": "<a href='/AIV/19/3/4'>Ps. 3:4</a>; <a href='/AIV/19/28/6'>Ps. 28:6</a>; <a href='/AIV/19/116/1'>Ps. 116:1</a>",
      "comment": "Confidence in God’s response to prayer arises from genuine faith and humility. Acceptance of the Psalmist’s prayer points toward a tradition of communal and individual intercessory prayer, which remains central in Christian worship and spiritual life."
    },
    {
      "pk": 23006010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 6,
      "verse": 10,
      "text": "All my enemies will be ashamed and deeply troubled; they will turn back and suddenly be put to shame.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/19/83/16'>Ps. 83:16</a>; <a href='/AIV/23/41/11'>Isa. 41:11</a>",
      "comment": "The Psalm ends with hope in God’s righteous judgment. The reversal of the enemies’ fortunes is a theme fulfilled in Christ's victory over sin and death. The sudden vindication is a reminder of ultimate justice and the future resurrection promised to the faithful."
    }
  ],
  "translatedAt": "2025-12-24T06:00:37.366Z"
}