{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 121,
  "verses": [
    {
      "pk": 1936800,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 1,
      "text": "I lift up my eyes to the mountains—where does my help come from?",
      "links": "<a href='/AIV/19/123/1'>Ps. 123:1</a>; <a href='/AIV/19/125/2'>Ps. 125:2</a>",
      "comment": "The image of lifting one’s eyes to the hills is often seen as a gesture of seeking divine assistance, not merely from creation but from the Creator. In some interpretations, 'mountains' symbolize God's presence and steadfastness (cf. Ps. 125:2)."
    },
    {
      "pk": 1936801,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 2,
      "text": "My help comes from the LORD, the Maker of heaven and earth.",
      "links": "<a href='/AIV/19/124/8'>Ps. 124:8</a>; <a href='/AIV/1/1/1'>Gen. 1:1</a>",
      "comment": "The affirmation of God as Creator explicitly connects to the beginning of Genesis (Gen. 1:1). This verse emphasizes the Lord’s omnipotence and personal providence, a theme echoed in the Christological understanding of God’s ongoing care (cf. Col. 1:16-17)."
    },
    {
      "pk": 1936802,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 3,
      "text": "He will not let your foot slip; He who watches over you will not slumber.",
      "links": "<a href='/AIV/19/91/11-12'>Ps. 91:11–12</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "God’s constant vigilance is highlighted here. There is a deep spiritual assurance for believers in the Lord’s unceasing protection. Compare with Psalm 91:11–12, which later Christian tradition applied to Christ during the temptation narrative (Matt. 4:6)."
    },
    {
      "pk": 1936803,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 4,
      "text": "Indeed, He who watches over Israel will neither slumber nor sleep.",
      "links": "<a href='/AIV/19/28/9'>Ps. 28:9</a>; <a href='/AIV/19/102/16'>Ps. 102:16</a>",
      "comment": "Israel is often a type of the chosen people, a concept spiritually fulfilled in the Church (Rom. 9:6–8). God’s tireless care for His people echoes the covenantal relationship established with Abraham and fulfilled in Christ."
    },
    {
      "pk": 1936804,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 5,
      "text": "The LORD is your keeper; the LORD is your shade on your right hand.",
      "links": "<a href='/AIV/19/16/8'>Ps. 16:8</a>; <a href='/AIV/19/109/31'>Ps. 109:31</a>",
      "comment": "The 'shade on your right hand' alludes to protection and favor. As shade shelters from harm, so the Lord guards His people, a foreshadowing of the spiritual protection given through Christ’s mediation (John 10:28)."
    },
    {
      "pk": 1936805,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 6,
      "text": "The sun will not strike you by day, nor the moon by night.",
      "links": "<a href='/AIV/19/91/5-6'>Ps. 91:5–6</a>; <a href='/AIV/23/49/10'>Isa. 49:10</a>",
      "comment": "This language denotes protection from all natural and possibly supernatural harm, reinforcing the Lord’s comprehensive guardianship. Consider Isaiah 49:10, where such imagery is used of messianic salvation and the restoration of God’s people."
    },
    {
      "pk": 1936806,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 7,
      "text": "The LORD will keep you from all evil; He will guard your life.",
      "links": "<a href='/AIV/19/41/2'>Ps. 41:2</a>; <a href='/AIV/19/140/1'>Ps. 140:1</a>",
      "comment": "The promise of spiritual and physical protection is understood as a sign of God’s grace. Many Church Fathers understood this as both literal and symbolic: spiritual preservation foreshadowed in God’s protection of His people is realized fully in the salvation offered through Christ."
    },
    {
      "pk": 1936807,
      "translation": "AIV",
      "book": 19,
      "chapter": 121,
      "verse": 8,
      "text": "The LORD will watch over your going out and your coming in, from this time forth and forever.",
      "links": "<a href='/AIV/19/128/8'>Ps. 128:8</a>; <a href='/AIV/5/28/6'>Deut. 28:6</a>",
      "comment": "This perpetual protection recalls Deuteronomy 28:6 and echoes God’s covenantal promises. The phrase 'forever' subtly points to the doctrine of ongoing grace and perseverance, which is interpreted spiritually as both earthly and eternal safeguarding through God’s work in His people."
    }
  ],
  "translatedAt": "2025-12-23T05:46:05.917Z"
}