{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 39,
  "verses": [
    {
      "pk": 1933913,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 1,
      "text": "I said, 'I will guard my ways, so that I may not sin with my tongue; I will keep a muzzle on my mouth while the wicked are before me.'",
      "links": "<a href='/AIV/19/141/3'>Psalm 141:3</a>; <a href='/AIV/59/3/2'>James 3:2</a>",
      "comment": "David resolves to restrain himself, especially his speech, in the presence of those who oppose God. The idea of guarding the tongue is echoed in James 3:2, underscoring the weight of speech in Christian morality, and prefigures Christ's silent submission before His accusers (<a href='/AIV/40/27/12-14'>Matthew 27:12–14</a>). Catholic tradition sees disciplined speech as a virtue developed in community and spiritual practice."
    },
    {
      "pk": 1933914,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 2,
      "text": "I was silent and mute; I held my peace, even from good, but my distress grew worse.",
      "links": "<a href='/AIV/19/32/3'>Psalm 32:3</a>",
      "comment": "David’s silence causes inner anguish. The literal and spiritual senses suggest that the suppression of truth or prayer leads to spiritual suffering. This points towards the necessity of confession—an important practice in Catholic spirituality (<a href='/AIV/19/32/5'>Psalm 32:5</a>)."
    },
    {
      "pk": 1933915,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 3,
      "text": "My heart burned within me; as I meditated, the fire burned. Then I spoke with my tongue:",
      "links": "<a href='/AIV/19/77/6'>Psalm 77:6</a>; <a href='/AIV/24/20/9'>Jeremiah 20:9</a>",
      "comment": "The inner fire caused by silence is reminiscent of Jeremiah’s burning word—a divine urge to speak truth. This burning can represent the Holy Spirit’s prompting, a concept also emphasized in Catholic pneumatology."
    },
    {
      "pk": 1933916,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 4,
      "text": "LORD, make me know my end and what is the measure of my days; let me know how fleeting I am.",
      "links": "<a href='/AIV/19/90/12'>Psalm 90:12</a>; <a href='/AIV/18/14/1-2'>Job 14:1–2</a>",
      "comment": "David asks God to remind him of mortality. This humility before the brevity of life reflects the Catholic doctrine of 'memento mori,' encouraging regular reflection on death as a way of growing in holiness."
    },
    {
      "pk": 1933917,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 5,
      "text": "Behold, you have made my days a few handbreadths, and my lifetime is as nothing before you. Surely every person stands as a mere breath. Selah.",
      "links": "<a href='/AIV/19/144/4'>Psalm 144:4</a>; <a href='/AIV/18/7/7'>Job 7:7</a>",
      "comment": "'Breath' here translates ‘hebel’—vanity or vapor. Life is transient and insignificant compared to God. 'Selah' marks a pause for meditation, which aligns with the liturgical tradition of contemplation found in Catholicism."
    },
    {
      "pk": 1933918,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 6,
      "text": "Surely each person walks as a shadow. Surely they make an uproar for nothing; they heap up wealth, not knowing who will gather it.",
      "links": "<a href='/AIV/21/2/18-19'>Ecclesiastes 2:18–19</a>; <a href='/AIV/18/27/16-17'>Job 27:16–17</a>",
      "comment": "Echoes themes of Ecclesiastes: the vanity of earthly pursuits. Heaping up wealth is futile; only eternal treasures matter (cf. <a href='/AIV/40/6/19-21'>Matthew 6:19–21</a>). The Catholic tradition stresses detachment and stewardship of material goods."
    },
    {
      "pk": 1933919,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 7,
      "text": "And now, Lord, what do I wait for? My hope is in you.",
      "links": "<a href='/AIV/19/130/5'>Psalm 130:5</a>; <a href='/AIV/36/3/8'>Zephaniah 3:8</a>",
      "comment": "Shifting from despair to hope in the Lord expresses genuine faith. The Catholic virtue of hope finds its roots in such scriptural meditations, culminating in Christ—our ultimate hope."
    },
    {
      "pk": 1933920,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 8,
      "text": "Deliver me from all my transgressions. Do not make me the scorn of fools.",
      "links": "<a href='/AIV/19/38/4'>Psalm 38:4</a>; <a href='/AIV/19/79/9-10'>Psalm 79:9–10</a>",
      "comment": "Here is a direct plea for forgiveness—a precursor to sacramental confession. David associates sin with shame before others, which is highlighted in Catholic teachings on reconciliation and penance."
    },
    {
      "pk": 1933921,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 9,
      "text": "I am mute; I do not open my mouth, for it is you who have done it.",
      "links": "<a href='/AIV/19/38/13'>Psalm 38:13</a>; <a href='/AIV/23/53/7'>Isaiah 53:7</a>",
      "comment": "David’s silence before God’s actions foreshadows Christ's silent suffering before His accusers (<a href='/AIV/40/27/12-14'>Matthew 27:12–14</a>) and the fulfillment in <a href='/AIV/23/53/7'>Isaiah 53:7</a>. This 'suffering servant' motif is central to Catholic understanding of Christ’s atonement and submission."
    },
    {
      "pk": 1933922,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 10,
      "text": "Remove your stroke from me; I am worn out by the blow of your hand.",
      "links": "<a href='/AIV/19/38/2'>Psalm 38:2</a>; <a href='/AIV/18/23/2'>Job 23:2</a>",
      "comment": "God’s discipline exhausts David, showing the gravity of divine correction. Catholic teaching interprets such suffering as a means towards spiritual purification, similar to the doctrine of purgatory."
    },
    {
      "pk": 1933923,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 11,
      "text": "When you discipline a person with rebukes for sin, you consume his beauty like a moth; surely everyone is a mere breath. Selah.",
      "links": "<a href='/AIV/19/90/10'>Psalm 90:10</a>; <a href='/AIV/18/13/28'>Job 13:28</a>",
      "comment": "Discipline reduces human splendor to nothing. This verse links to themes of mortality and the ephemeral nature of beauty, encouraging humility—a virtue central to Catholic formation."
    },
    {
      "pk": 1933924,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 12,
      "text": "Hear my prayer, LORD, and give ear to my cry; do not be silent at my tears. For I am a stranger with you, a temporary resident, like all my ancestors.",
      "links": "<a href='/AIV/19/119/19'>Psalm 119:19</a>; <a href='/AIV/58/11/13'>Hebrews 11:13</a>",
      "comment": "David appeals to God’s mercy, acknowledging his transient life. 'Stranger' and 'resident' draw on pilgrimage imagery, foundational in Catholic spiritual pilgrimage and the church’s tradition of journeying towards God."
    },
    {
      "pk": 1933925,
      "translation": "AIV",
      "book": 19,
      "chapter": 39,
      "verse": 13,
      "text": "Return your gaze from me, so that I may be cheered again, before I depart and am no more.",
      "links": "<a href='/AIV/19/13/3'>Psalm 13:3</a>; <a href='/AIV/18/7/21'>Job 7:21</a>",
      "comment": "David requests relief before death, confirming the reality of human frailty. Catholic tradition relates this to prayers for the dying, emphasizing the need for God’s mercy at the end—especially through the sacraments and prayers for a holy death."
    }
  ],
  "translatedAt": "2025-12-22T21:32:56.958Z"
}