{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 149,
  "verses": [
    {
      "pk": 1949140,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 1,
      "text": "Praise the LORD! Sing to the LORD a new song, his praise in the assembly of the faithful.",
      "links": "<a href='/AIV/19/33/3'>Ps. 33:3</a>; <a href='/AIV/19/40/3'>Ps. 40:3</a>; <a href='/AIV/19/148/14'>Ps. 148:14</a>",
      "comment": "The phrase 'assembly of the faithful' echoes themes of communal worship and liturgical praise, anticipating later Christian practice of gathered worship. The motif of a 'new song' signifies renewal and ongoing revelation."
    },
    {
      "pk": 1949141,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 2,
      "text": "Let Israel rejoice in their Maker; let the children of Zion exult in their King.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/23/12/6'>Isa. 12:6</a>; <a href='/AIV/19/47/6-7'>Ps. 47:6–7</a>",
      "comment": "This verse identifies God as both Creator and King, preparing for the recognition of Jesus Christ as both divine and royal (cf. John 1:3; Matt. 21:5). 'Children of Zion' suggests the special status of God’s people, later fulfilled in the Church."
    },
    {
      "pk": 1949142,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 3,
      "text": "Let them praise his name with dancing, making music to him with tambourine and lyre.",
      "links": "<a href='/AIV/19/150/4'>Ps. 150:4</a>; <a href='/AIV/19/68/25'>Ps. 68:25</a>; <a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "Worship is meant to be expressed with joy and the whole person. Physical acts and music in worship point toward the sacramental nature of later Christian liturgy and communal celebration."
    },
    {
      "pk": 1949143,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 4,
      "text": "For the LORD takes pleasure in his people; he adorns the humble with salvation.",
      "links": "<a href='/AIV/19/147/11'>Ps. 147:11</a>; <a href='/AIV/19/140/13'>Ps. 140:13</a>; <a href='/AIV/23/61/10'>Isa. 61:10</a>",
      "comment": "God’s delight in his people and his gift of salvation to the humble prefigures the teaching that grace is given to the lowly and that true righteousness is found in humility before God (cf. Matt. 5:3; Luke 1:52)."
    },
    {
      "pk": 1949144,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 5,
      "text": "Let the faithful exult in glory; let them sing for joy on their beds.",
      "links": "<a href='/AIV/19/63/6'>Ps. 63:6</a>; <a href='/AIV/19/132/16'>Ps. 132:16</a>",
      "comment": "Rejoicing even in private, believers are called to constant praise. The reference to ‘beds’ suggests that worship and communion with God encompass all areas of life, laying groundwork for continuous prayer and devotion."
    },
    {
      "pk": 1949145,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 6,
      "text": "Let the high praises of God be in their mouths and a double-edged sword in their hands,",
      "links": "<a href='/AIV/19/66/17'>Ps. 66:17</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>; <a href='/AIV/49/6/17'>Eph. 6:17</a>",
      "comment": "The double-edged sword symbolizes both the zeal for justice and the power of God's word (see Heb. 4:12; Eph. 6:17). This connection is deepened in Christian teaching where the Word of God is living and active."
    },
    {
      "pk": 1949146,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 7,
      "text": "to execute vengeance on the nations and punishments on the peoples,",
      "links": "<a href='/AIV/19/2/8-9'>Ps. 2:8–9</a>; <a href='/AIV/19/110/6'>Ps. 110:6</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "God’s justice is exercised, yet always within his sovereign plan of redemption. These verses foreshadow the work of Christ as judge (cf. Rev. 19:15; Acts 17:31)."
    },
    {
      "pk": 1949147,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 8,
      "text": "to bind their kings with chains and their nobles with iron fetters,",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "This illustrates God’s authority over the powers of the world, reflecting messianic themes of Christ’s reign over all earthly kings (cf. Ps. 2:9; Rev. 19:16)."
    },
    {
      "pk": 1949148,
      "translation": "AIV",
      "book": 19,
      "chapter": 149,
      "verse": 9,
      "text": "to execute on them the written judgment— this honor is for all his faithful ones. Praise the LORD!",
      "links": "<a href='/AIV/27/7/22'>Dan. 7:22</a>; <a href='/AIV/19/148/14'>Ps. 148:14</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "The faithful—God’s worshiping people—share in the privilege of participating in his divine justice, anticipated in prophecy and fulfilled in Christ’s final victory (cf. Dan. 7:22; Rev. 20:4). The idea of sharing in judgment and glory hints at the communal and sacramental dimension of salvation."
    }
  ],
  "translatedAt": "2025-12-23T05:52:30.929Z"
}