{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 148,
  "verses": [
    {
      "pk": 20148001,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 1,
      "text": "Praise the LORD! Praise the LORD from the heavens; praise Him in the heights!",
      "links": "<a href='/AIV/19/103/20'>Ps. 103:20</a>; <a href='/AIV/19/150/1'>Ps. 150:1</a>",
      "comment": "This call to praise begins in the heavens, summoning all the angelic hosts and celestial beings. The repetition emphasizes the universal scope of worship directed to God."
    },
    {
      "pk": 20148002,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 2,
      "text": "Praise Him, all His angels; praise Him, all His armies.",
      "links": "<a href='/AIV/19/103/21'>Ps. 103:21</a>; <a href='/AIV/18/38/7'>Job 38:7</a>",
      "comment": "The angels and 'armies' (or hosts) reference the spiritual beings who serve and worship God. The heavenly worship points to the harmony of creation and anticipates the unity of worship seen in the visions of heaven in <a href='/AIV/66/4/8-11'>Rev. 4:8-11</a>."
    },
    {
      "pk": 20148003,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 3,
      "text": "Praise Him, sun and moon; praise Him, all you shining stars!",
      "links": "<a href='/AIV/01/1/14-16'>Gen. 1:14-16</a>; <a href='/AIV/19/19/1'>Ps. 19:1</a>",
      "comment": "Even the physical elements of creation are called to honor God. The sun, moon, and stars, created by His word, bear witness to His glory. This affirms God's sovereignty over creation as seen in <a href='/AIV/19/19/1'>Ps. 19:1</a> and subtly reminds us of the theological importance of visible signs in worship."
    },
    {
      "pk": 20148004,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 4,
      "text": "Praise Him, highest heavens and you waters above the skies!",
      "links": "<a href='/AIV/01/1/7'>Gen. 1:7</a>; <a href='/AIV/19/68/33'>Ps. 68:33</a>",
      "comment": "The 'highest heavens' and 'waters above' recall the creation narrative. Every realm, seen and unseen, participates in creation's worship, offering glimpses of unity between material and spiritual realities."
    },
    {
      "pk": 20148005,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 5,
      "text": "Let them praise the name of the LORD, for He commanded and they were created.",
      "links": "<a href='/AIV/01/1/1-3'>Gen. 1:1-3</a>; <a href='/AIV/19/33/9'>Ps. 33:9</a>",
      "comment": "The act of creation by divine command highlights God's absolute authority and creative power. Every entity owes its existence to God's word, hinting at the significance of God's spoken Word, later revealed in Christ (<a href='/AIV/43/1/1-3'>John 1:1-3</a>)."
    },
    {
      "pk": 20148006,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 6,
      "text": "He established them forever and ever; He set a decree and it will not pass away.",
      "links": "<a href='/AIV/19/119/89-91'>Ps. 119:89-91</a>",
      "comment": "Creation is sustained and governed by God’s unchanging command, reflecting divine order and permanence. This everlasting decree affirms the reliability of God’s promises and the enduring nature of His covenant."
    },
    {
      "pk": 20148007,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 7,
      "text": "Praise the LORD from the earth, you great sea creatures and all deeps,",
      "links": "<a href='/AIV/01/1/21'>Gen. 1:21</a>; <a href='/AIV/19/104/25-26'>Ps. 104:25-26</a>",
      "comment": "Praise now rises from the earth, beginning with the depths and their mysterious creatures, underscoring the comprehensive reach of God’s glory across creation."
    },
    {
      "pk": 20148008,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 8,
      "text": "fire and hail, snow and mist, stormy wind yielding His word,",
      "links": "<a href='/AIV/19/147/15-18'>Ps. 147:15-18</a>",
      "comment": "Natural forces respond to God’s command, displaying the order and obedience of creation. Such elements become instruments serving the divine will, a subtle parallel to sacraments—visible means through which God acts."
    },
    {
      "pk": 20148009,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 9,
      "text": "mountains and all hills, fruit trees and all cedars,",
      "links": "<a href='/AIV/01/1/11-12'>Gen. 1:11-12</a>",
      "comment": "Everything from majestic mountains to fruitful trees reflects God’s creativity and abundance. There is a special emphasis on fruitfulness and growth, themes later fulfilled spiritually in the fruit of the Spirit (<a href='/AIV/48/5/22-23'>Gal. 5:22-23</a>)."
    },
    {
      "pk": 20148010,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 10,
      "text": "beasts and all livestock, crawling things and flying birds,",
      "links": "<a href='/AIV/01/1/24-25'>Gen. 1:24-25</a>; <a href='/AIV/19/50/10-11'>Ps. 50:10-11</a>",
      "comment": "This verse further includes every living creature, demonstrating the universal call to praise. The breadth of creation’s worship reflects the church’s openness and unity, encompassing all peoples and all things."
    },
    {
      "pk": 20148011,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 11,
      "text": "kings of the earth and all peoples, princes and all rulers of the earth,",
      "links": "<a href='/AIV/19/2/10'>Ps. 2:10</a>; <a href='/AIV/19/72/10-11'>Ps. 72:10-11</a>",
      "comment": "Both rulers and ordinary people are summoned to worship, making clear that no one is exempt. The reference to kings aligns with prophecies of global acknowledgment of God’s reign (<a href='/AIV/19/2/10-12'>Ps. 2:10-12</a>), later fulfilled in Christ."
    },
    {
      "pk": 20148012,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 12,
      "text": "young men and maidens together, old men and children!",
      "links": "<a href='/AIV/29/2/28'>Joel 2:28</a>; <a href='/AIV/42/18/16'>Luke 18:16</a>",
      "comment": "All ages and genders are included, reflecting the universal scope of the call to worship. This echoes the promise of God’s Spirit poured out on all humanity (<a href='/AIV/44/2/17'>Acts 2:17</a>), and the importance of spiritual formation in every life stage."
    },
    {
      "pk": 20148013,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 13,
      "text": "Let them praise the name of the LORD, for His name alone is exalted; His majesty is above earth and heaven.",
      "links": "<a href='/AIV/19/113/4'>Ps. 113:4</a>; <a href='/AIV/19/8/1'>Ps. 8:1</a>",
      "comment": "God’s name is uniquely holy and lifted above all creation. His glory covers all realms, anticipating ultimate worship in His presence as described in the New Testament (<a href='/AIV/50/2/9-11'>Phil. 2:9-11</a>)."
    },
    {
      "pk": 20148014,
      "translation": "AIV",
      "book": 19,
      "chapter": 148,
      "verse": 14,
      "text": "He has raised up a horn for His people, the praise of all His faithful, for the children of Israel, the people close to Him. Praise the LORD!",
      "links": "<a href='/AIV/42/1/69'>Luke 1:69</a>; <a href='/AIV/19/132/17'>Ps. 132:17</a>",
      "comment": "The 'horn' is a symbol of strength and power. This ultimately points to the Messiah—Jesus—who is the fulfillment of God’s saving promise. The verse highlights God's special relationship with His chosen people, and by extension, the gathering of God’s faithful into the covenant family."
    }
  ],
  "translatedAt": "2025-12-23T05:52:20.021Z"
}