{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 23,
  "verses": [
    {
      "pk": 2302301,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 1,
      "text": "The LORD is my shepherd; I lack nothing.",
      "links": "<a href='/AIV/40/9/36'>Matt. 9:36</a>; <a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "The image of God as a shepherd is both literal and profoundly christological, anticipating Jesus’s claim in John 10:11 to be the Good Shepherd. The original Hebrew indicates not simply 'I shall not want', but full sufficiency flowing from trust in God’s providence—a truth deeply enriched in Catholic theology, particularly in the idea of supernatural grace supplied through the sacraments."
    },
    {
      "pk": 2302302,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 2,
      "text": "He makes me lie down in green pastures; he leads me beside quiet waters.",
      "links": "<a href='/AIV/19/46/4'>Ps. 46:4</a>; <a href='/AIV/19/65/9-13'>Ps. 65:9–13</a>",
      "comment": "These pastoral images evoke Eden—God's abundant provision and peace. The quiet waters are reminiscent of spiritual renewal, interpreted by many Church Fathers as baptismal imagery (see Ps. 46:4); subtly affirming the necessity and grace of sacramental life, which is central in Catholic doctrine but sometimes less emphasized in Protestant circles."
    },
    {
      "pk": 2302303,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 3,
      "text": "He restores my soul. He leads me in paths of righteousness for his name’s sake.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/19/5/8'>Ps. 5:8</a>; <a href='/AIV/45/8/28-30'>Rom. 8:28–30</a>",
      "comment": "Restoration of the soul signifies full spiritual healing, an ongoing sanctification found richly in Catholic teaching on confession and spiritual growth. 'For his name’s sake' grounds our righteousness not in ourselves but in God's own covenant faithfulness—pointing ahead to Christ, whose name is above every name (<a href='/AIV/50/2/9'>Phil. 2:9</a>)."
    },
    {
      "pk": 2302304,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 4,
      "text": "Even though I walk through the valley of deep darkness, I will fear no evil, for you are with me; your rod and your staff, they comfort me.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/19/91/5-6'>Ps. 91:5–6</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "The journey through darkness echoes life’s trials and the assurance of divine presence—fulfilled in Christ’s promise, 'I am with you always' (Matt. 28:20). The 'rod and staff' are symbols of both protection and guidance, paralleling the Church’s role in shepherding souls faithfully; historical Catholic interpretation sees the comforting staff as symbolic of the Church's sacramental support, especially in times of suffering."
    },
    {
      "pk": 2302305,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 5,
      "text": "You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup overflows.",
      "links": "<a href='/AIV/19/16/5'>Ps. 16:5</a>; <a href='/AIV/19/92/10'>Ps. 92:10</a>; <a href='/AIV/42/22/19-20'>Luke 22:19–20</a>",
      "comment": "The prepared table often prefigures the Eucharist—a subtle but essential Catholic interpretation—wherein believers share in Christ’s banquet even amidst adversity. Anointing with oil signals kingship, priesthood, and healing (see Ps. 92:10; James 5:14), which together hint at the Catholic sacramental life and the richness of liturgical worship around the altar."
    },
    {
      "pk": 2302306,
      "translation": "AIV",
      "book": 19,
      "chapter": 23,
      "verse": 6,
      "text": "Surely goodness and mercy will pursue me all the days of my life, and I will dwell in the house of the LORD forever.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>; <a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "The promise of dwelling in God’s house forever moves beyond the earthly Temple to eternal life with God—a hope fulfilled in the heavenly liturgy (Rev. 21:3). Catholic tradition interprets 'goodness and mercy' as the ongoing, active grace pursued through the Church’s sacramental ministry. The word 'forever' emphasizes the Church’s teaching on the communion of saints and everlasting fellowship with God."
    }
  ],
  "translatedAt": "2025-12-22T21:27:36.863Z"
}