{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 27,
  "verses": [
    {
      "pk": 1940271,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 1,
      "text": "The LORD is my light and my salvation; whom shall I fear? The LORD is the refuge of my life; of whom shall I be afraid?",
      "links": "<a href='/AIV/18/29/3'>Job 29:3</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Light and salvation are messianic themes that foreshadow Christ (see John 8:12). The language emphasizes personal trust in God as both protector and savior."
    },
    {
      "pk": 1940272,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 2,
      "text": "When evildoers come against me to devour my flesh, my adversaries and my enemies, it is they who stumble and fall.",
      "links": "<a href='/AIV/19/118/12-13'>Ps. 118:12–13</a>",
      "comment": "The imagery of enemies falling recalls God's protection in battle, as seen throughout the Psalms. The deliverance here prefigures victory over evil in Christ."
    },
    {
      "pk": 1940273,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 3,
      "text": "Though an army encamps against me, my heart will not fear; though war rises against me, yet will I be confident.",
      "links": "<a href='/AIV/19/3/6'>Ps. 3:6</a>; <a href='/AIV/19/56/4'>Ps. 56:4</a>",
      "comment": "The steadfastness expressed here is rooted in faith; see also Philippians 4:6-7, where peace is a fruit of trust in God."
    },
    {
      "pk": 1940274,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 4,
      "text": "One thing I have asked of the LORD; this I seek: that I may dwell in the house of the LORD all the days of my life, to gaze upon the beauty of the LORD and to meditate in His temple.",
      "links": "<a href='/AIV/19/23/6'>Ps. 23:6</a>; <a href='/AIV/19/84/4'>Ps. 84:4</a>",
      "comment": "Desire for God's house foreshadows the Church, the new temple (see 1 Cor. 3:16). Early Christians often saw this as symbolic of the perpetual presence of God, realized most fully in the Eucharist."
    },
    {
      "pk": 1940275,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 5,
      "text": "For He will hide me in His shelter in the day of trouble; He will conceal me under the cover of His tent; He will lift me high upon a rock.",
      "links": "<a href='/AIV/19/31/20'>Ps. 31:20</a>; <a href='/AIV/19/40/2'>Ps. 40:2</a>",
      "comment": "The 'rock' prefigures Christ, our foundation (see 1 Cor. 10:4; Matt. 16:18). Shelter imagery is common for God's protection and is echoed in Marian devotion in Catholic tradition."
    },
    {
      "pk": 1940276,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 6,
      "text": "And now my head will be lifted above my enemies all around me, and I will offer sacrifices in His tent with shouts of joy; I will sing and make melody to the LORD.",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/19/107/22'>Ps. 107:22</a>",
      "comment": "The offering of sacrifice in the temple anticipates Christian worship (Hebrews 13:15). Catholics see this fulfilled in the perpetual sacrifice of the Mass."
    },
    {
      "pk": 1940277,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 7,
      "text": "Hear, O LORD, when I cry aloud; be gracious to me and answer me.",
      "links": "<a href='/AIV/19/6/9'>Ps. 6:9</a>",
      "comment": "A direct plea for God’s response; this echoes constant prayer in Christian life (see Phil. 4:6; Luke 18:1)."
    },
    {
      "pk": 1940278,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 8,
      "text": "My heart says to you, 'Seek His face!' Your face, LORD, I will seek.",
      "links": "<a href='/AIV/19/24/6'>Ps. 24:6</a>; <a href='/AIV/19/105/4'>Ps. 105:4</a>",
      "comment": "To seek God’s face indicates a deep desire for His presence. In Catholic spirituality, 'seeking God’s face' is tied to contemplation and adoration, as seen in Eucharistic devotion."
    },
    {
      "pk": 1940279,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 9,
      "text": "Do not hide your face from me; do not turn your servant away in anger; you are my help. Do not abandon me or forsake me, O God of my salvation!",
      "links": "<a href='/AIV/19/22/24'>Ps. 22:24</a>; <a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "The plea not to be forsaken echoes Christ’s words on the cross (Matt. 27:46, Ps. 22:1). Assurance of God's steadfastness supports Catholic teaching on perseverance of the saints."
    },
    {
      "pk": 1940280,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 10,
      "text": "Though my father and my mother forsake me, the LORD will take me in.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/23/49/15'>Isa. 49:15</a>",
      "comment": "God’s fatherly love surpasses even that of earthly parents (cf. Luke 11:13). Catholics believe the Church, as Mother, reflects this divine care."
    },
    {
      "pk": 1940281,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 11,
      "text": "Teach me your way, O LORD, and lead me on a level path because of my enemies.",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/19/5/8'>Ps. 5:8</a>",
      "comment": "Asking guidance recalls discipleship. For many, the magisterium (Church teaching authority) is seen as the safeguard for correct guidance."
    },
    {
      "pk": 1940282,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 12,
      "text": "Do not give me over to the desire of my adversaries, for false witnesses have risen against me, and they breathe out violence.",
      "links": "<a href='/AIV/19/35/11'>Ps. 35:11</a>; <a href='/AIV/40/26/59-60'>Matt. 26:59-60</a>",
      "comment": "The mention of false witnesses points to the Passion of Christ (Matt. 26:59-60), aligning the psalm with Christ's own sufferings and underscoring the prophetic nature of this passage."
    },
    {
      "pk": 1940283,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 13,
      "text": "I believe that I will see the goodness of the LORD in the land of the living.",
      "links": "<a href='/AIV/19/52/5'>Ps. 52:5</a>; <a href='/AIV/19/116/9'>Ps. 116:9</a>",
      "comment": "This is an affirmation of hope, both in this life and the next—a recurring theme in Christian theology. The language ties to faith in the resurrection and the communion of saints."
    },
    {
      "pk": 1940284,
      "translation": "AIV",
      "book": 19,
      "chapter": 27,
      "verse": 14,
      "text": "Wait for the LORD; be strong, and let your heart take courage; yes, wait for the LORD!",
      "links": "<a href='/AIV/19/31/24'>Ps. 31:24</a>; <a href='/AIV/23/40/31'>Isa. 40:31</a>",
      "comment": "Waiting for the Lord underscores the virtue of hope. Catholic doctrine sees this as linked to perseverance and trust in God's grace, aided by prayer and the sacraments."
    }
  ],
  "translatedAt": "2025-12-22T21:28:56.334Z"
}