{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 6,
  "verses": [
    {
      "pk": 2106001,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 1,
      "text": "LORD, do not rebuke me in Your anger, nor discipline me in Your wrath.",
      "links": "<a href='/AIV/19/38/1'>Ps. 38:1</a>; <a href='/AIV/19/118/18'>Ps. 118:18</a>; <a href='/AIV/20/3/11-12'>Prov. 3:11-12</a>; <a href='/AIV/58/12/5-6'>Heb. 12:5-6</a>",
      "comment": "David pleads for moderation in God's chastisement, recognizing His Fatherly discipline (cf. Heb. 12:5-6). In Catholic tradition, this echoes the concept of temporal punishment and the need for God's mercy beyond strict justice."
    },
    {
      "pk": 2106002,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 2,
      "text": "Show mercy to me, LORD, for I am weak; heal me, LORD, for my bones are trembling.",
      "links": "<a href='/AIV/19/41/4'>Ps. 41:4</a>; <a href='/AIV/19/51/1'>Ps. 51:1</a>; <a href='/AIV/19/147/3'>Ps. 147:3</a>",
      "comment": "The appeal for healing includes both physical and spiritual distress. The language foreshadows Christ as the ultimate healer (cf. Matt. 9:12–13), a key theme in Catholic sacramental theology (see Anointing of the Sick)."
    },
    {
      "pk": 2106003,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 3,
      "text": "My soul is greatly shaken; but You, LORD—how long?",
      "links": "<a href='/AIV/19/13/1-2'>Ps. 13:1-2</a>; <a href='/AIV/19/42/5'>Ps. 42:5</a>",
      "comment": "David voices the classic lament, 'How long?'—a prayer found throughout the Psalms. The Catholic liturgy preserves this tone of trust in suffering, integrating body and soul."
    },
    {
      "pk": 2106004,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 4,
      "text": "Return, LORD, deliver my soul; save me because of Your steadfast love.",
      "links": "<a href='/AIV/19/31/16'>Ps. 31:16</a>; <a href='/AIV/19/54/1'>Ps. 54:1</a>",
      "comment": "The 'steadfast love' (Hebrew: 'hesed') is God’s covenant loyalty—a foundation of Catholic soteriology emphasizing grace through God's faithful promises and the means of salvation provided in the Church."
    },
    {
      "pk": 2106005,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 5,
      "text": "For in death there is no remembrance of You; in Sheol, who will give You thanks?",
      "links": "<a href='/AIV/19/30/9'>Ps. 30:9</a>; <a href='/AIV/16/9/5'>Neh. 9:5</a>; <a href='/AIV/23/38/18-19'>Isa. 38:18-19</a>",
      "comment": "The ancient Hebrew view sees Sheol as a place where praise is absent. Christian (and specifically Catholic) theology understands this lament in light of Christ’s victory over death (cf. 2 Tim. 1:10) and the Communion of Saints, emphasizing prayers for the dead."
    },
    {
      "pk": 2106006,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 6,
      "text": "I am weary with my groaning; all night I flood my bed with weeping, I drench my couch with tears.",
      "links": "<a href='/AIV/19/39/12'>Ps. 39:12</a>; <a href='/AIV/19/77/2'>Ps. 77:2</a>",
      "comment": "An intense description of sorrow, often read allegorically in patristic tradition as repentance for sin—a key Catholic theme in the Sacrament of Confession."
    },
    {
      "pk": 2106007,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 7,
      "text": "My eye has grown dim with grief; it grows weak because of all my enemies.",
      "links": "<a href='/AIV/19/31/9'>Ps. 31:9</a>; <a href='/AIV/19/88/9'>Ps. 88:9</a>",
      "comment": "Sorrows seen through the eyes echo Jesus' lament over Jerusalem (Luke 19:41). The Catholic devotional practice of weeping for sin ('gift of tears') has precedent in this verse."
    },
    {
      "pk": 2106008,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 8,
      "text": "Away from me, all you who do evil, for the LORD has heard the sound of my weeping.",
      "links": "<a href='/AIV/19/34/15-16'>Ps. 34:15–16</a>; <a href='/AIV/40/7/23'>Matt. 7:23</a>; <a href='/AIV/42/13/27'>Luke 13:27</a>",
      "comment": "Jesus quotes this wording in Matthew 7:23 and Luke 13:27, linking David’s prayer with Christ’s own authoritative teaching. The theme of separation from evil aligns with the Catholic understanding of purification (cf. Purgatory)."
    },
    {
      "pk": 2106009,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 9,
      "text": "The LORD has heard my plea, the LORD accepts my prayer.",
      "links": "<a href='/AIV/19/28/6'>Ps. 28:6</a>; <a href='/AIV/19/145/19'>Ps. 145:19</a>",
      "comment": "Confidence in answered prayer demonstrates faith in God’s fatherly care. Catholic tradition encourages both personal and communal prayer (cf. intercession through saints)."
    },
    {
      "pk": 2106010,
      "translation": "AIV",
      "book": 19,
      "chapter": 6,
      "verse": 10,
      "text": "All my enemies will be ashamed and greatly troubled; they will turn back and be put to shame in a moment.",
      "links": "<a href='/AIV/19/35/4'>Ps. 35:4</a>; <a href='/AIV/19/83/17'>Ps. 83:17</a>",
      "comment": "God's vindication points forward to the final judgment. The certainty of God’s justice is affirmed in both Testaments and underlines the eschatological hope deeply rooted in Catholic teaching."
    }
  ],
  "translatedAt": "2025-12-22T21:22:18.575Z"
}