{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 132,
  "verses": [
    {
      "pk": 1932132,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 1,
      "text": "LORD, remember David and all his hardships;",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>; <a href='/AIV/19/89/19-37'>Ps. 89:19–37</a>",
      "comment": "The psalm begins by invoking the LORD to remember David’s faithfulness and struggles. The focus on David prepares the reader for reflections on God's promises to his house."
    },
    {
      "pk": 1932133,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 2,
      "text": "how he swore to the LORD, and vowed to the Mighty One of Jacob:",
      "links": "<a href='/AIV/01/49/24'>Gen. 49:24</a>; <a href='/AIV/30/8/7'>Amos 8:7</a>",
      "comment": "\"Mighty One of Jacob\" is an ancient title for God, establishing a connection between God’s power and His fidelity to the patriarchs. David’s vow shows the seriousness with which he treated worship."
    },
    {
      "pk": 1932134,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 3,
      "text": "\"I will not enter my house or get into my bed,",
      "links": "",
      "comment": "David’s intention is urgent and passionate—he refuses comfort until he fulfills his vow to God. This demonstrates the priority of worship before personal comfort."
    },
    {
      "pk": 1932135,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 4,
      "text": "I will not give sleep to my eyes or slumber to my eyelids,",
      "links": "<a href='/AIV/20/6/4'>Prov. 6:4</a>",
      "comment": "This intensifies David’s determination. Dedication to God’s house is shown as more important than even the basic needs of life."
    },
    {
      "pk": 1932136,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 5,
      "text": "until I find a place for the LORD, a dwelling for the Mighty One of Jacob.\"",
      "links": "<a href='/AIV/10/7/2'>2 Sam. 7:2</a>; <a href='/AIV/02/25/8'>Ex. 25:8</a>",
      "comment": "David’s goal is to build a permanent sanctuary, which is later realized in the Temple built by his son Solomon. In New Testament terms, this points to Christ as the true Temple (<a href='/AIV/43/2/19-22'>John 2:19–22</a>)."
    },
    {
      "pk": 1932137,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 6,
      "text": "Look, we heard of it in Ephrathah; we found it in the fields of Jaar.",
      "links": "<a href='/AIV/09/7/1'>1 Sam. 7:1</a>",
      "comment": "\"Ephrathah\" refers to the region around Bethlehem; \"fields of Jaar\" refers to Kiriath-Jearim, where the ark was kept. The search for the ark symbolizes the search for God's presence."
    },
    {
      "pk": 1932138,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 7,
      "text": "Let us enter his dwelling; let us worship at his footstool.",
      "links": "<a href='/AIV/19/99/5'>Ps. 99:5</a>; <a href='/AIV/13/28/2'>1 Chr. 28:2</a>",
      "comment": "\"His footstool\" refers to the ark or the Temple—these are loci of God’s special presence among His people. Reverence for worship is emphasized."
    },
    {
      "pk": 1932139,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 8,
      "text": "Arise, O LORD, and go to your resting place, you and the ark of your might.",
      "links": "<a href='/AIV/04/10/35'>Num. 10:35</a>; <a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "This echoes the words spoken when the ark set out in the wilderness. The presence of God within the ark foreshadows Christ’s incarnation—God coming to dwell among His people."
    },
    {
      "pk": 1932140,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 9,
      "text": "Let your priests be clothed with righteousness, and let your saints shout for joy.",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/19/30/4'>Ps. 30:4</a>",
      "comment": "Priestly righteousness and joyful saints call to mind the importance of holiness among God’s ministers and people—hinting at the continuity of sacred ministry across covenants."
    },
    {
      "pk": 1932141,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 10,
      "text": "For the sake of your servant David, do not reject your anointed one.",
      "links": "<a href='/AIV/10/7/13-16'>2 Sam. 7:13–16</a>; <a href='/AIV/19/89/38-39'>Ps. 89:38–39</a>",
      "comment": "God’s faithfulness to David’s line is rooted in covenant promises. ‘Anointed one’ (Messiah/Christ) links directly to Jesus as the fulfillment (<a href='/AIV/42/1/69'>Luke 1:69</a>), making this a messianic prophecy."
    },
    {
      "pk": 1932142,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 11,
      "text": "The LORD swore to David a sure oath, from which he will not turn back: ‘One of your own offspring I will place on your throne.’",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>; <a href='/AIV/42/1/32-33'>Luke 1:32–33</a>",
      "comment": "The unbreakable oath points ahead to the ultimate King from David’s line—fulfilling prophecies realized in Christ who reigns forever. This combines both literal and spiritual fulfillment."
    },
    {
      "pk": 1932143,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 12,
      "text": "\"If your sons keep my covenant and my testimonies that I shall teach them, their sons also forever shall sit on your throne.\"",
      "links": "<a href='/AIV/10/7/15-16'>2 Sam. 7:15–16</a>; <a href='/AIV/19/89/30-37'>Ps. 89:30–37</a>",
      "comment": "The role of faithfulness and obedience is highlighted. Transmission of faith by teaching is key for the promises to endure. The spiritual lineage continues in those obeying God."
    },
    {
      "pk": 1932144,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 13,
      "text": "For the LORD has chosen Zion; he has desired it for his dwelling:",
      "links": "<a href='/AIV/19/78/68'>Ps. 78:68</a>; <a href='/AIV/19/87/2'>Ps. 87:2</a>",
      "comment": "God’s choice of Zion (Jerusalem) as His everlasting dwelling signifies a unique place of divine presence and worship, prefiguring the unity and authority of the one holy assembly."
    },
    {
      "pk": 1932145,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 14,
      "text": "\"This is my resting place forever; here I will dwell, for I have desired it.",
      "links": "<a href='/AIV/19/68/16'>Ps. 68:16</a>",
      "comment": "God’s intent to dwell forever among His people points toward the enduring presence of God—which finds its highest meaning in God dwelling fully with humanity in Christ and His Church."
    },
    {
      "pk": 1932146,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 15,
      "text": "I will abundantly bless her provisions; I will satisfy her poor with bread.",
      "links": "<a href='/AIV/19/147/14'>Ps. 147:14</a>; <a href='/AIV/40/14/19-20'>Matt. 14:19–20</a>",
      "comment": "God’s care for the poor alludes to material and spiritual nourishment—foreshadowing the Eucharistic overtones as Christ feeds His Church with living bread."
    },
    {
      "pk": 1932147,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 16,
      "text": "I will clothe her priests with salvation, and her saints will shout aloud for joy.",
      "links": "<a href='/AIV/19/106/5'>Ps. 106:5</a>; <a href='/AIV/23/61/10'>Isa. 61:10</a>",
      "comment": "‘Clothe with salvation’ points to the holiness and mission of those serving in God’s house. Joy follows because salvation is realized in God’s sanctuary."
    },
    {
      "pk": 1932148,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 17,
      "text": "There I will make a horn to sprout for David; I have prepared a lamp for my anointed one.",
      "links": "<a href='/AIV/42/1/69'>Luke 1:69</a>; <a href='/AIV/19/18/28'>Ps. 18:28</a>",
      "comment": "‘Horn’ symbolizes strength or kingly power and ‘lamp’ resembles continuity of David’s line—fulfilled in the Messiah. The visible succession of leaders in God’s people is suggested."
    },
    {
      "pk": 1932149,
      "translation": "AIV",
      "book": 19,
      "chapter": 132,
      "verse": 18,
      "text": "His enemies I will clothe with shame, but on him his crown will shine.\"",
      "links": "<a href='/AIV/19/89/44'>Ps. 89:44</a>; <a href='/AIV/23/62/3'>Isa. 62:3</a>",
      "comment": "God’s ultimate victory is assured for the anointed king, who is crowned with enduring glory. This puts focus on both Christ’s triumph and the visible sign of authority vested in His chosen leadership."
    }
  ],
  "translatedAt": "2025-12-23T05:48:11.575Z"
}