{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 131,
  "verses": [
    {
      "pk": 3121310,
      "translation": "AIV",
      "book": 19,
      "chapter": 131,
      "verse": 1,
      "text": "O LORD, my heart is not proud, nor my eyes lifted up high. I do not concern myself with things too great or too wonderful for me.",
      "links": "<a href='/AIV/19/101/5'>Ps. 101:5</a>; <a href='/AIV/18/42/3'>Job 42:3</a>; <a href='/AIV/20/30/32'>Prov. 30:32</a>",
      "comment": "The verse reflects a humble approach before God, rejecting pride and self-exaltation. The phrase 'things too great or too wonderful for me' is a Hebrew idiom implying submission and trust in the divine mysteries—a prelude to spiritual maturity and obedience (see <a href='/AIV/18/42/3'>Job 42:3</a>; <a href='/AIV/20/30/32'>Prov. 30:32</a>). This humility echoes Christ's own humility (see <a href='/AIV/50/2/5-8'>Philippians 2:5-8</a>), inviting believers to imitate His example."
    },
    {
      "pk": 3121311,
      "translation": "AIV",
      "book": 19,
      "chapter": 131,
      "verse": 2,
      "text": "Instead, I have calmed and quieted my soul, like a weaned child with its mother; like a weaned child is my soul within me.",
      "links": "<a href='/AIV/23/66/12-13'>Isa. 66:12-13</a>; <a href='/AIV/40/18/3-4'>Matt. 18:3-4</a>",
      "comment": "The image of a 'weaned child' expresses serene trust and deep rest in God's presence, moving beyond the anxieties of self-will. This image is drawn on elsewhere (<a href='/AIV/23/66/13'>Isaiah 66:13</a>), depicting God’s nurturing care. In the New Testament, Jesus uses the image of a child as the model for entering the Kingdom (<a href='/AIV/40/18/3-4'>Matthew 18:3-4</a>), affirming the value of dependent trust and spiritual littleness. The spiritual tradition sees this as a call to detachment from the world and deeper spiritual communion."
    },
    {
      "pk": 3121312,
      "translation": "AIV",
      "book": 19,
      "chapter": 131,
      "verse": 3,
      "text": "O Israel, hope in the LORD from now and forevermore.",
      "links": "<a href='/AIV/19/130/7'>Ps. 130:7</a>; <a href='/AIV/23/40/31'>Isa. 40:31</a>; <a href='/AIV/60/1/13'>1 Pet. 1:13</a>",
      "comment": "The psalmist exhorts the whole people to entrust themselves to God perpetually. Like verse 3 of Psalm 130, hope is anchored in the Lord’s covenantal faithfulness and mercy. Spiritually, this is an invitation to persevere in faith, looking ahead to the promises fulfilled in Christ (see <a href='/AIV/19/130/7'>Ps. 130:7</a>, <a href='/AIV/60/1/13'>1 Peter 1:13</a>), and recognizing the necessity of ongoing hope grounded in God’s unchanging love, which is often mediated through the community and sacraments."
    }
  ],
  "translatedAt": "2025-12-23T05:47:43.657Z"
}