{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 137,
  "verses": [
    {
      "pk": 2013701,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 1,
      "text": "By the rivers of Babylon, there we sat down and wept, when we remembered Zion.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/19/42/4'>Ps. 42:4</a>",
      "comment": "This verse situates the psalm during the Babylonian exile, expressing yearning for Jerusalem. Zion here points to both a physical place and, in spiritual interpretation, the heavenly city—the ultimate home for God's people. The tears recall the lament over the loss of the presence of God in the temple, prefiguring the Christian longing for union with God."
    },
    {
      "pk": 2013702,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 2,
      "text": "On the willows in the midst of it we hung up our harps.",
      "links": "<a href='/AIV/19/81/2'>Ps. 81:2</a>",
      "comment": "Hanging up the harps symbolizes deep mourning and loss of joyful worship. Harps, associated with temple praise, now silent, indicate a profound separation from sacred worship. Many church fathers saw in this a longing for full liturgical worship—fulfilled later in the restored temple and ultimately in the Church's worship."
    },
    {
      "pk": 2013703,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 3,
      "text": "For there our captors demanded songs of us, and our tormentors asked for mirth, saying, 'Sing us one of the songs of Zion!'",
      "links": "<a href='/AIV/19/74/10'>Ps. 74:10</a>; <a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "This acknowledges the pain of being forced to celebrate in exile. The captors’ request is both mockery and provocation, intensifying the grief. Spiritual interpretation draws parallels between exile from Zion and spiritual exile—separation from communion with God."
    },
    {
      "pk": 2013704,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 4,
      "text": "How can we sing the LORD’s song in a foreign land?",
      "links": "<a href='/AIV/19/119/54'>Ps. 119:54</a>",
      "comment": "This rhetorical question highlights the impossibility of offering true worship apart from the place God appointed. It underscores the importance of sacred place and order in worship ordained by God—a point of emphasis in apostolic tradition regarding the structure of worship."
    },
    {
      "pk": 2013705,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 5,
      "text": "If I forget you, O Jerusalem, let my right hand forget its skill!",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/1/49/15'>Gen. 49:15</a>",
      "comment": "Jerusalem is remembered not just as a city but the spiritual heart of God’s people, where God dwells among them. The psalmist invokes a curse on himself if he forgets, illustrating the centrality of Jerusalem—foreshadowing importance of spiritual centers in later revelation."
    },
    {
      "pk": 2013706,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 6,
      "text": "Let my tongue cling to the roof of my mouth, if I do not remember you, if I do not set Jerusalem above my highest joy.",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>",
      "comment": "Jerusalem is considered the greatest joy, even more than any earthly delight. For Christians, this points toward the heavenly Jerusalem (see Hebrews 12:22), hinting at the call to seek the city where God is forever present."
    },
    {
      "pk": 2013707,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 7,
      "text": "Remember, O LORD, against the sons of Edom the day of Jerusalem’s fall, when they said, 'Tear it down! Tear it down, to its very foundations!'",
      "links": "<a href='/AIV/25/4/21-22'>Lam. 4:21–22</a>; <a href='/AIV/31/1/10-14'>Obad. 1:10-14</a>",
      "comment": "The Edomites supported Jerusalem’s destruction, which is condemned by the psalmist. The prayer for God’s justice here reflects a call for God to defend His people, while foreshadowing Jesus' command to pray for those who persecute—a pattern of moving from justice to mercy in salvation history."
    },
    {
      "pk": 2013708,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 8,
      "text": "O daughter of Babylon, doomed to be destroyed, blessed is he who repays you as you have done to us!",
      "links": "<a href='/AIV/23/13/16'>Isa. 13:16</a>; <a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/66/18/2'>Rev. 18:2</a>",
      "comment": "Babylon represents the worldly power opposed to God’s people, as developed through Scripture (see Revelation 18). The severity of this blessing is an appeal for God's justice, also reminding readers of the ultimate victory of God over all that opposes Him; spiritually, it reminds us to long for final deliverance from sin and evil."
    },
    {
      "pk": 2013709,
      "translation": "AIV",
      "book": 19,
      "chapter": 137,
      "verse": 9,
      "text": "Blessed is he who takes your little ones and dashes them against the rock!",
      "links": "<a href='/AIV/23/13/16'>Isa. 13:16</a>; <a href='/AIV/19/58/10'>Ps. 58:10</a>",
      "comment": "This harsh imprecatory verse expresses the depth of sorrow and desire for justice felt in exile. Allegorically, many early Christian commentators interpreted it as a call to destroy evil and sinful inclinations early—‘little ones’—so they do not grow into greater sins. The ‘rock’ can be read as Christ (1 Cor. 10:4), on whom we must utterly defeat sin."
    }
  ],
  "translatedAt": "2025-12-23T05:49:35.247Z"
}