{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 125,
  "verses": [
    {
      "pk": 5012501,
      "translation": "AIV",
      "book": 19,
      "chapter": 125,
      "verse": 1,
      "text": "Those who trust in the LORD are like Mount Zion, which cannot be shaken, but stands firm forever.",
      "links": "<a href='/AIV/19/46/5'>Ps. 46:5</a>; <a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "This verse highlights the security and permanence of those who rely on God, drawing a parallel to Mount Zion’s enduring stability. The spiritual interpretation refers to the unshakeable nature of the Church, established on divine promise. Spiritual Zion also points ahead to the heavenly Jerusalem, referenced in Hebrews 12:22. Trust in the LORD is seen as foundational for both personal faith and the wider believing community."
    },
    {
      "pk": 5012502,
      "translation": "AIV",
      "book": 19,
      "chapter": 125,
      "verse": 2,
      "text": "As the mountains surround Jerusalem, so the LORD surrounds His people, both now and forever.",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "Here the image of God's protective presence encircling His people is emphasized. The mountains around Jerusalem were a natural defense, just as God defends those who are His from spiritual dangers. This can be interpreted not just as individual protection but a safeguarding of the entire community of believers through every generation."
    },
    {
      "pk": 5012503,
      "translation": "AIV",
      "book": 19,
      "chapter": 125,
      "verse": 3,
      "text": "For the scepter of wickedness shall not remain over the land allotted to the righteous, lest the righteous stretch out their hands to do evil.",
      "links": "<a href='/AIV/19/94/20'>Ps. 94:20</a>; <a href='/AIV/20/13/13'>Prov. 13:13</a>; <a href='/AIV/23/60/18'>Isa. 60:18</a>",
      "comment": "This verse promises that enduring rule by the wicked over the promised land and the faithful is not God's intention. God’s providence ultimately protects His people from corrupting influences. The spiritual meaning points to the divine care in maintaining moral integrity among the faithful, and the promise that evil will not triumph over those set apart for God."
    },
    {
      "pk": 5012504,
      "translation": "AIV",
      "book": 19,
      "chapter": 125,
      "verse": 4,
      "text": "Do good, O LORD, to those who are good, to those who are upright in heart.",
      "links": "<a href='/AIV/19/73/1'>Ps. 73:1</a>; <a href='/AIV/19/41/12'>Ps. 41:12</a>; <a href='/AIV/19/37/3'>Ps. 37:3</a>",
      "comment": "This is an appeal for God's active favor upon the righteous. The upright in heart not only act rightly but are internally transformed by divine grace, echoing the deep spiritual renewal promised to God’s people. Both the literal and spiritual readings converge in showing that goodness comes from the heart aligned with God."
    },
    {
      "pk": 5012505,
      "translation": "AIV",
      "book": 19,
      "chapter": 125,
      "verse": 5,
      "text": "But those who turn aside to crooked ways, the LORD will lead away with evildoers; peace be upon Israel.",
      "links": "<a href='/AIV/19/128/6'>Ps. 128:6</a>; <a href='/AIV/19/73/27'>Ps. 73:27</a>; <a href='/AIV/19/85/8'>Ps. 85:8</a>",
      "comment": "A sober warning: those who stray into twisted paths will share the fate of the wicked. However, the prayer for peace upon Israel—often interpreted as both temporal well-being and fullness of spiritual blessing—concludes the psalm. In New Testament light, ‘peace upon Israel’ resonates with the promised peace to the people of God, including all who are incorporated into spiritual Israel through Christ (Gal 6:16)."
    }
  ],
  "translatedAt": "2025-12-23T05:46:48.515Z"
}