{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 97,
  "verses": [
    {
      "pk": 19970971,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 1,
      "text": "The LORD reigns; let the earth rejoice; let the many islands be glad.",
      "links": "<a href='/ESV/19/96/10'>Ps. 96:10</a>; <a href='/ESV/19/99/1'>Ps. 99:1</a>",
      "comment": "The theme of God’s sovereign kingship is central; 'LORD' refers to Yahweh, linking this Psalm to the affirmation of God’s authority over all nations and creation—precursor for Christ’s reign (cf. Revelation 19:6). The 'islands' symbolize distant peoples, an early hint of the universality of salvation."
    },
    {
      "pk": 19970972,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 2,
      "text": "Clouds and thick darkness surround Him; righteousness and justice are the foundation of His throne.",
      "links": "<a href='/ESV/19/89/14'>Ps. 89:14</a>; <a href='/ESV/19/18/9'>Ps. 18:9-11</a>",
      "comment": "The imagery of clouds and darkness signifies God’s majesty and mystery, recalling Sinai (Exodus 19:16). The foundation of God’s authority is justice and righteousness, deep themes in both Protestant and Catholic traditions concerning God’s nature."
    },
    {
      "pk": 19970973,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 3,
      "text": "Fire goes before Him and consumes His enemies on every side.",
      "links": "<a href='/ESV/19/50/3'>Ps. 50:3</a>; <a href='/ESV/02/19/18'>Ex. 19:18</a>",
      "comment": "Fire represents judgment and purification, common motifs in OT theophanies and fulfilled in Christ as the judge (Matthew 25:31-46), as interpreted in both Catholic and broader Christian eschatology."
    },
    {
      "pk": 19970974,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 4,
      "text": "His lightning lights up the world; the earth sees and trembles.",
      "links": "<a href='/ESV/19/77/18'>Ps. 77:18</a>; <a href='/ESV/19/104/32'>Ps. 104:32</a>",
      "comment": "The power of God is visible to all; fearsomeness of His presence anticipates the trembling of nations before Christ (Philippians 2:10)."
    },
    {
      "pk": 19970975,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 5,
      "text": "The mountains melt like wax before the LORD, before the Lord of all the earth.",
      "links": "<a href='/ESV/19/68/2'>Ps. 68:2</a>; <a href='/ESV/19/46/6'>Ps. 46:6'</a>",
      "comment": "Power over creation is emphasized; God’s sovereignty extends everywhere, a theme echoed in Catholic teaching on the universal kingship of Christ (cf. Colossians 1:16-17)."
    },
    {
      "pk": 19970976,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 6,
      "text": "The heavens proclaim His righteousness, and all peoples see His glory.",
      "links": "<a href='/ESV/19/19/1'>Ps. 19:1</a>; <a href='/ESV/19/50/6'>Ps. 50:6</a>",
      "comment": "Creation itself reveals God’s character, anticipating Romans 1:20. In Catholic tradition, natural revelation points to God, but complete revelation comes through Christ and the Church."
    },
    {
      "pk": 19970977,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 7,
      "text": "All who worship idols are put to shame, those who boast in worthless gods. Worship Him, all you gods!",
      "links": "<a href='/ESV/19/86/8-10'>Ps. 86:8-10</a>; <a href='/ESV/45/1/23'>Rom. 1:23</a>",
      "comment": "The futility of idolatry stands in contrast to true worship of God. Hebrews 1:6 applies verse 7 to Christ, indicating His divinity, subtly supporting the Catholic emphasis on veneration and worship rightly ordered toward God and His saints."
    },
    {
      "pk": 19970978,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 8,
      "text": "Zion hears and is glad, and the daughters of Judah rejoice because of Your judgments, LORD.",
      "links": "<a href='/ESV/19/48/11'>Ps. 48:11</a>; <a href='/ESV/19/102/21'>Ps. 102:21</a>",
      "comment": "Zion represents the Church and the fulfillment of God’s promises; joy in divine justice is a theme echoed in liturgical worship."
    },
    {
      "pk": 19970979,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 9,
      "text": "For You, LORD, are most high above all the earth; You are exalted far above all gods.",
      "links": "<a href='/ESV/19/83/18'>Ps. 83:18</a>; <a href='/ESV/19/95/3'>Ps. 95:3</a>",
      "comment": "God’s uniqueness is highlighted. The phrase 'above all gods' affirms monotheism and prefigures the full revelation of divine supremacy in Christ."
    },
    {
      "pk": 19970980,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 10,
      "text": "You who love the LORD, hate evil! He preserves the lives of His saints; He delivers them from the hand of the wicked.",
      "links": "<a href='/ESV/20/8/13'>Prov. 8:13</a>; <a href='/ESV/19/34/17-19'>Ps. 34:17-19</a>",
      "comment": "The call to hate evil and God’s protection of His 'saints' (Hebrew: 'holy ones'). Catholic tradition gives particular emphasis to saints as examples of holy living and as intercessors."
    },
    {
      "pk": 19970981,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 11,
      "text": "Light is sown for the righteous and joy for the upright in heart.",
      "links": "<a href='/ESV/19/112/4'>Ps. 112:4</a>; <a href='/ESV/18/22/28'>Job 22:28'</a>",
      "comment": "Light and joy are rewards for faithful living, pointing toward Christ’s resurrection and the Catholic sacramental economy as a participation in the life of grace."
    },
    {
      "pk": 19970982,
      "translation": "AIV",
      "book": 19,
      "chapter": 97,
      "verse": 12,
      "text": "Rejoice in the LORD, you righteous, and give thanks to His holy name.",
      "links": "<a href='/ESV/19/30/4'>Ps. 30:4</a>; <a href='/ESV/19/103/1'>Ps. 103:1</a>",
      "comment": "The exhortation to rejoice and give thanks culminates the Psalm. Thanksgiving and praise form the core of Christian liturgy in the Catholic Church (cf. Eucharist means thanksgiving), gently affirming traditional Catholic worship practice as the logical fulfillment of the Psalm's call."
    }
  ],
  "translatedAt": "2025-12-22T21:50:35.977Z"
}