{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 114,
  "verses": [
    {
      "pk": 20021140,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 1,
      "text": "When Israel went out from Egypt, the house of Jacob from a people of strange language,",
      "links": "<a href='/AIV/2/12/41'>Exod. 12:41</a>; <a href='/AIV/2/13/3'>Exod. 13:3</a>",
      "comment": "This opening verse recalls the Exodus, a foundational event in the faith. The phrase 'a people of strange language' emphasizes Israel's distinctness and God's call to bring them out from foreign oppression. See <a href='/AIV/70/7/6'>Isaiah 28:11</a> for a spiritual application of foreign tongues."
    },
    {
      "pk": 20021141,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 2,
      "text": "Judah became his sanctuary, Israel his dominion.",
      "links": "<a href='/AIV/2/19/6'>Exod. 19:6</a>; <a href='/AIV/19/78/68-71'>Ps. 78:68-71</a>",
      "comment": "A reference to the unique status of Judah and Israel as God’s holy people and chosen domain. Note the sacramental undertone: God sets apart a people and a place for his dwelling. Cf. <a href='/AIV/1/28/17'>Gen. 28:17</a>."
    },
    {
      "pk": 20021142,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 3,
      "text": "The sea looked and fled; the Jordan turned back.",
      "links": "<a href='/AIV/2/14/21-22'>Exod. 14:21-22</a>; <a href='/AIV/6/3/14-17'>Josh. 3:14-17</a>",
      "comment": "This recounts the miracles at the Red Sea and the Jordan River, where waters parted before God's people. This is both literal history and a foreshadowing of spiritual cleansing and new beginnings, as fulfilled in Christian baptism. See also <a href='/AIV/46/10/1-2'>1 Cor. 10:1-2</a>."
    },
    {
      "pk": 20021143,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 4,
      "text": "The mountains skipped like rams, the hills like lambs.",
      "links": "<a href='/AIV/2/19/18'>Exod. 19:18</a>; <a href='/AIV/19/29/6'>Ps. 29:6</a>",
      "comment": "A poetic description of the earth responding to God's presence. The figurative language expresses creation’s awe and submission. Compare with <a href='/AIV/65/1/5'>Jude 1:5</a> who links these events to the Lord’s authority."
    },
    {
      "pk": 20021144,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 5,
      "text": "Why is it, O sea, that you flee? O Jordan, that you turn back?",
      "links": "<a href='/AIV/2/14/21'>Exod. 14:21</a>; <a href='/AIV/6/3/16'>Josh. 3:16</a>",
      "comment": "A rhetorical question, pointing to God’s overwhelming power over nature. This invites the reader to reflect on divine intervention as an ongoing reality—God acts decisively for his people."
    },
    {
      "pk": 20021145,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 6,
      "text": "O mountains, that you skip like rams? O hills, like lambs?",
      "links": "<a href='/AIV/19/29/6'>Ps. 29:6</a>; <a href='/AIV/34/1/5'>Nahum 1:5</a>",
      "comment": "Another repetition for poetic emphasis, highlighting creation’s obedience to its Creator. Spiritual interpretation: all creation moves in response to the presence of the Lord (see <a href='/AIV/45/8/19-22'>Rom. 8:19-22</a>)."
    },
    {
      "pk": 20021146,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 7,
      "text": "Tremble, O earth, at the presence of the Lord, at the presence of the God of Jacob,",
      "links": "<a href='/AIV/2/19/16-18'>Exod. 19:16-18</a>; <a href='/AIV/19/97/4-5'>Ps. 97:4-5</a>",
      "comment": "The earth shudders before God’s manifest presence. This reveals both God’s majesty and his closeness to his people. The phrase 'the Lord' is a title for God’s unique personal identity, anticipating the ultimate revelation in the Incarnation."
    },
    {
      "pk": 20021147,
      "translation": "AIV",
      "book": 19,
      "chapter": 114,
      "verse": 8,
      "text": "who turns the rock into a pool of water, the flint into a spring of water.",
      "links": "<a href='/AIV/2/17/6'>Exod. 17:6</a>; <a href='/AIV/4/20/11'>Num. 20:11</a>; <a href='/AIV/46/10/4'>1 Cor. 10:4</a>",
      "comment": "God provides water from the rock, sustaining his people. This miracle prefigures the spiritual sustenance given through Christ, whom the Apostle Paul calls 'the Rock.' See <a href='/AIV/46/10/4'>1 Cor. 10:4</a>. The church has always seen this as a type of spiritual nourishment—bread and living water—offered continually to God’s people."
    }
  ],
  "translatedAt": "2025-12-23T05:42:44.849Z"
}