{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 123,
  "verses": [
    {
      "pk": 2012301,
      "translation": "AIV",
      "book": 19,
      "chapter": 123,
      "verse": 1,
      "text": "To you I lift up my eyes, the One enthroned in the heavens.",
      "links": "<a href='/AIV/19/121/1'>Ps. 121:1</a>; <a href='/AIV/11/8/30'>1 Kgs. 8:30</a>",
      "comment": "The psalmist begins with an act of devotion and upward focus, acknowledging God as the sovereign King dwelling above all. This upward movement expresses both humility and hope, anticipating spiritual ascent and worship. The image of lifting eyes is echoed elsewhere in the psalms and signifies trust and petition (see Ps. 121:1)."
    },
    {
      "pk": 2012302,
      "translation": "AIV",
      "book": 19,
      "chapter": 123,
      "verse": 2,
      "text": "Look—as the eyes of servants look to the hand of their master, as the eyes of a maid to the hand of her mistress, so our eyes look to the LORD our God, until he shows us mercy.",
      "links": "<a href='/AIV/19/25/15'>Ps. 25:15</a>; <a href='/AIV/19/102/13'>Ps. 102:13</a>",
      "comment": "Here, a posture of humble dependence is symbolized by servants looking to their master's hand, representing expectation and obedience. The recurring request for mercy hints at reliance on God's gracious initiative—a theme fulfilled in Christ's sacrificial ministry (cf. Matt. 5:7; Luke 1:50–54). The image also foreshadows the attitude believers are called to hold in the presence of God, especially during worship."
    },
    {
      "pk": 2012303,
      "translation": "AIV",
      "book": 19,
      "chapter": 123,
      "verse": 3,
      "text": "Have mercy on us, LORD, have mercy on us, for we have had more than enough contempt.",
      "links": "<a href='/AIV/19/4/1-3'>Ps. 4:1–3</a>; <a href='/AIV/19/86/16'>Ps. 86:16</a>",
      "comment": "The repeated plea for mercy emphasizes the people's vulnerability and dependence on divine compassion. The motif of enduring scorn recalls the suffering of God's anointed ones and foreshadows Christ’s endurance of ridicule (see Isa. 53:3; Heb. 12:2-3). The spiritual interpretation includes the soul's longing for deliverance from the contempt of the world."
    },
    {
      "pk": 2012304,
      "translation": "AIV",
      "book": 19,
      "chapter": 123,
      "verse": 4,
      "text": "Our soul has had more than enough of the mockery of those at ease, of the contempt of the proud.",
      "links": "<a href='/AIV/19/119/51'>Ps. 119:51</a>; <a href='/AIV/23/32/9'>Isa. 32:9</a>",
      "comment": "This verse highlights the affliction and mockery experienced by the faithful, often from those who live in comfort and pride. It resonates with the New Testament’s call to embrace humility (see Matt. 5:11) and bears a spiritual significance in reminding believers that endurance through hardship is closely tied to spiritual growth and deeper communion with God. The Old Testament pattern of suffering servants reaches fulfillment in Christ, who was despised and rejected, yet glorified by God (cf. Phil. 2:8–11)."
    }
  ],
  "translatedAt": "2025-12-23T05:46:28.925Z"
}