{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 3,
  "verses": [
    {
      "pk": 1903001,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 1,
      "text": "O LORD, how many are my foes! Many are rising against me;",
      "links": "<a href='/AIV/10/15/13-14'>2 Sam. 15:13-14</a>; <a href='/AIV/19/69/4'>Ps. 69:4</a>",
      "comment": "David cries out to God during his flight from Absalom (cf. 2 Sam. 15). The emphasis on the multitude of enemies shows both external pressure and internal distress. This is often seen as typological of Christ surrounded by adversaries (Ps. 22:16), reinforcing how the righteous may suffer but trust in the LORD."
    },
    {
      "pk": 1903002,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 2,
      "text": "Many are saying of my soul, 'There is no salvation for him in God.' Selah.",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/40/27/43'>Matt. 27:43</a>",
      "comment": "The doubters mock David's trust in God, echoing the sentiment hurled at Jesus on the Cross (Matt. 27:43). 'Selah' invites reflection on this challenge of faith. The verse suggests reliance on God's grace even when others doubt, aligning with Catholic teaching that salvation is ultimately God's gift."
    },
    {
      "pk": 1903003,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 3,
      "text": "But you, O LORD, are a shield around me, my glory, and the One who lifts up my head.",
      "links": "<a href='/AIV/19/28/7'>Ps. 28:7</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Here David shifts from despair to trust. God is both protector and source of dignity. Catholic reflection sees the 'shield' as God's providential care, with overtones of the sacraments as channels of God's protection and grace. The language foreshadows Christ's vindication and resurrection."
    },
    {
      "pk": 1903004,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 4,
      "text": "I cried aloud to the LORD, and He answered me from His holy mountain. Selah.",
      "links": "<a href='/AIV/19/2/6'>Ps. 2:6</a>; <a href='/AIV/19/20/2'>Ps. 20:2</a>",
      "comment": "'Holy mountain' refers to Zion, God's dwelling place (Ps. 2:6), symbolizing the union of heaven and earth. The Catholic tradition sees this imagery fulfilled in the Church, which mediates God's presence to the world, especially seen in the liturgy and Eucharist. David's confidence points toward Christ's prayerful trust in the Father."
    },
    {
      "pk": 1903005,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 5,
      "text": "I lay down and slept; I woke again, for the LORD sustained me.",
      "links": "<a href='/AIV/19/4/8'>Ps. 4:8</a>; <a href='/AIV/19/121/3-4'>Ps. 121:3-4</a>",
      "comment": "David rests securely in God's care despite danger, a metaphor for trust even in death and resurrection. Early Christians saw in this verse a prefiguring of Christ's burial and rising, and Catholics may understand it as assurance given in hope and the spiritual rest found in grace."
    },
    {
      "pk": 1903006,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 6,
      "text": "I will not be afraid of many thousands of people who have set themselves against me all around.",
      "links": "<a href='/AIV/19/27/3'>Ps. 27:3</a>; <a href='/AIV/19/118/6'>Ps. 118:6</a>",
      "comment": "David's bold statement of faith models unwavering trust in God's protection. The literal meaning offers assurance in danger, while spiritually, it reminds believers of the Church's endurance amid opposition, echoing the courage of the saints who trusted God's deliverance."
    },
    {
      "pk": 1903007,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 7,
      "text": "Arise, O LORD! Save me, O my God! For you strike all my enemies on the cheek; you break the teeth of the wicked.",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/58/6'>Ps. 58:6</a>",
      "comment": "David calls for God's intervention. The language is vivid, expressing complete victory over evil. Catholics may find resonance with prayers to the saints to intercede for protection and with God's direct action through the Church's sacraments. Christologically, 'Arise' hints at resurrection and ultimate vindication."
    },
    {
      "pk": 1903008,
      "translation": "AIV",
      "book": 19,
      "chapter": 3,
      "verse": 8,
      "text": "Salvation belongs to the LORD; Your blessing be on Your people. Selah.",
      "links": "<a href='/AIV/19/62/1'>Ps. 62:1</a>; <a href='/AIV/45/10/13'>Rom. 10:13</a>",
      "comment": "The Psalm ends affirming that salvation is God's alone, a theme central to both Protestant and Catholic theology, though Catholics emphasize the participation in God's blessing through the Church and its sacraments. 'Selah' invites prayerful contemplation of communal blessing and the mystery of salvation extended to God's people."
    }
  ],
  "translatedAt": "2025-12-22T21:21:30.650Z"
}