{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 55,
  "verses": [
    {
      "pk": 23055001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 1,
      "text": "Give ear to my prayer, O God, and do not hide yourself from my plea for mercy.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/19/28/1'>Ps. 28:1</a>",
      "comment": "A personal plea, showing the psalmist's confidence that God is always accessible and attentive to prayers. This intimacy with God echoes Christ's own prayers (see Mark 14:36), and encourages believers to open their hearts when seeking divine help."
    },
    {
      "pk": 23055002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 2,
      "text": "Listen to me and answer me! I am restless in my complaint, and I moan.",
      "links": "<a href='/AIV/19/6/3'>Ps. 6:3</a>; <a href='/AIV/19/77/1-3'>Ps. 77:1-3</a>",
      "comment": "The psalmist's urgency and honesty emphasizes how God desires authentic communication, not mere formality. Complaining or lamenting in the Lord’s presence is biblically endorsed (see Lamentations 2:19)."
    },
    {
      "pk": 23055003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 3,
      "text": "Because of the voice of the enemy, because of the oppression of the wicked. For they bring down trouble upon me, and in anger they harbor hatred against me.",
      "links": "<a href='/AIV/19/41/5'>Ps. 41:5</a>; <a href='/AIV/19/64/2'>Ps. 64:2</a>",
      "comment": "This distress reflects the trials faced by the righteous amid persecution. The language foreshadows the experience of Christ with His enemies (see John 15:18)."
    },
    {
      "pk": 23055004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 4,
      "text": "My heart trembles within me, and the terrors of death have fallen upon me.",
      "links": "<a href='/AIV/19/116/3'>Ps. 116:3</a>; <a href='/AIV/42/22/44'>Luke 22:44</a>",
      "comment": "The psalmist’s anguish connects to Jesus’ agony in Gethsemane, highlighting how suffering and fear are not opposed to holiness but rather moments to unite our hearts more closely to God."
    },
    {
      "pk": 23055005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 5,
      "text": "Fear and trembling have gripped me, and horror has overwhelmed me.",
      "links": "<a href='/AIV/19/18/4-5'>Ps. 18:4-5</a>; <a href='/AIV/41/14/33-34'>Mark 14:33-34</a>",
      "comment": "Strong emotions are honestly described. This resonates with Christ’s own distress before the Passion (Mark 14:33-34), validating the full range of human feelings in the life of faith."
    },
    {
      "pk": 23055006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 6,
      "text": "I said, 'Oh, that I had wings like a dove! I would fly away and be at rest.'",
      "links": "<a href='/AIV/19/11/1'>Ps. 11:1</a>",
      "comment": "The longing for escape speaks to the human desire for peace. This foreshadows the Christian hope for final rest and points to heavenly realities (see Hebrews 4:9)."
    },
    {
      "pk": 23055007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 7,
      "text": "Yes, I would wander far away; I would lodge in the desert. Selah.",
      "links": "<a href='/AIV/19/107/4'>Ps. 107:4</a>",
      "comment": "Selah invites the reader to pause and reflect. The idea of retreating to the wilderness is part of the biblical tradition (see Luke 5:16), symbolizing withdrawal for deeper spiritual encounter."
    },
    {
      "pk": 23055008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 8,
      "text": "I would hurry to find shelter from the raging wind and storm.",
      "links": "<a href='/AIV/19/57/1'>Ps. 57:1</a>",
      "comment": "Seeking refuge from trial prefigures Christ as the ultimate shelter from sin and chaos, as fulfilled in the New Covenant (see Matthew 11:28)."
    },
    {
      "pk": 23055009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 9,
      "text": "Destroy, O Lord, and divide their tongues, for I see violence and strife in the city.",
      "links": "<a href='/AIV/01/11/7'>Gen. 11:7</a>; <a href='/AIV/19/59/6'>Ps. 59:6</a>",
      "comment": "A request for confusion among the wicked, referencing Babel (Genesis 11:7). This shows God’s sovereignty in dispersing evil and preventing conspiracies against the righteous."
    },
    {
      "pk": 23055010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 10,
      "text": "Day and night they go around on its walls, and wickedness and trouble are within it.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Describes a city besieged by evil. This can be a metaphor for spiritual vigilance within the Church and the soul (cf. 1 Peter 5:8)."
    },
    {
      "pk": 23055011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 11,
      "text": "Destruction is within it; oppression and deceit do not depart from its marketplace.",
      "links": "<a href='/AIV/19/5/9'>Ps. 5:9</a>",
      "comment": "Public places are filled with corruption, showing the universal need for God’s redemption and the call to authentic community grounded in truth."
    },
    {
      "pk": 23055012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 12,
      "text": "For it is not an enemy who taunts me—then I could bear it; it is not an adversary who deals insolently with me—then I could hide from him.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/43/13/18'>John 13:18</a>",
      "comment": "Betrayal by a friend echoes Judas’ betrayal of Jesus (John 13:18), highlighting the pain within close relationships and the mystery of suffering within the faithful."
    },
    {
      "pk": 23055013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 13,
      "text": "But it is you, a man my equal, my companion, my close friend.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "The most painful betrayal comes from within the circle of trust—a foreshadowing of the betrayal of Christ by an apostle from His own Twelve."
    },
    {
      "pk": 23055014,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 14,
      "text": "We who took sweet counsel together, and walked to the house of God in company.",
      "links": "<a href='/AIV/19/42/4'>Ps. 42:4</a>",
      "comment": "Shared worship deepened the pain of betrayal, recalling how within God’s own people division can occur—yet God remains faithful to His promises, building one unified flock (John 10:16)."
    },
    {
      "pk": 23055015,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 15,
      "text": "Let death seize them; let them go down alive to the grave, for evil is in their dwelling place and within them.",
      "links": "<a href='/AIV/04/16/30-33'>Num. 16:30-33</a>",
      "comment": "A severe imprecation reminiscent of the judgment on Korah’s rebellion. Reminds the faithful of the seriousness of internal sin and the reality of divine justice (cf. Acts 5:1-11)."
    },
    {
      "pk": 23055016,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 16,
      "text": "But I call to God, and the LORD will save me.",
      "links": "<a href='/AIV/19/18/3'>Ps. 18:3</a>; <a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "Despite betrayal and danger, confidence turns to God. This shows the importance of perseverance and trust in divine deliverance, as commended throughout Scripture."
    },
    {
      "pk": 23055017,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 17,
      "text": "Evening, morning, and at noon I utter my complaint and moan, and He hears my voice.",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>; <a href='/AIV/19/88/1'>Ps. 88:1</a>",
      "comment": "The triple daily prayer mirrors Daniel’s practice and still inspires the Church’s tradition of set prayer times, inviting all believers into continual communion with God (cf. 1 Thessalonians 5:17)."
    },
    {
      "pk": 23055018,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 18,
      "text": "He redeems my soul in peace from the battle that was against me, for many were arrayed against me.",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>; <a href='/AIV/19/56/13'>Ps. 56:13</a>",
      "comment": "The promise of peace even amid conflict foreshadows Christ as the Redeemer, who conquers by His sacrifice and brings the true and lasting peace (John 14:27)."
    },
    {
      "pk": 23055019,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 19,
      "text": "God will hear and humble them—He who sits enthroned from of old—Selah. Because they do not change and do not fear God.",
      "links": "<a href='/AIV/19/102/12'>Ps. 102:12</a>; <a href='/AIV/05/32/27'>Deut. 32:27</a>",
      "comment": "God’s unchanging majesty contrasts with rebellious humanity. The reference to God enthroned hints at the eternal kingship fulfilled in Christ (Hebrews 1:8)."
    },
    {
      "pk": 23055020,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 20,
      "text": "My companion stretched out his hand against his friends; he violated his covenant.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "The broken covenant points to the gravity of betrayal after fellowship—themes fulfilled in the New Testament by Judas and the Last Supper’s significance for ongoing Christian worship and unity."
    },
    {
      "pk": 23055021,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 21,
      "text": "His speech was smooth as butter, yet war was in his heart. His words were softer than oil, yet they were drawn swords.",
      "links": "<a href='/AIV/20/5/3'>Prov. 5:3</a>; <a href='/AIV/19/28/3'>Ps. 28:3</a>",
      "comment": "Hypocrisy and deceit are exposed. Faithful interpretation sees the importance of both external and internal integrity, as called for by Christ (Matthew 15:8)."
    },
    {
      "pk": 23055022,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 22,
      "text": "Cast your burden on the LORD, and He will sustain you; He will never let the righteous be moved.",
      "links": "<a href='/AIV/60/5/7'>1 Pet. 5:7</a>; <a href='/AIV/19/37/24'>Ps. 37:24</a>",
      "comment": "A call to trust and surrender to God—cited in 1 Peter 5:7, reinforcing the continual biblical invitation to depend on divine providence both physically and spiritually, and not solely on personal effort."
    },
    {
      "pk": 23055023,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 55,
      "verse": 23,
      "text": "But You, O God, will bring them down to the pit of destruction; men of blood and deceit shall not live out half their days. But I will trust in You.",
      "links": "<a href='/AIV/19/94/13'>Ps. 94:13</a>; <a href='/AIV/19/73/18'>Ps. 73:18-19</a>",
      "comment": "Ends with assurance in divine justice and personal trust. The psalmist models hope even when surrounded by betrayal—a lesson emphasized by the saints and early Christian testimony, urging believers to place final trust in God’s judgment and mercy."
    }
  ],
  "translatedAt": "2025-12-24T06:17:51.781Z"
}