{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 142,
  "verses": [
    {
      "pk": 1427001,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 1,
      "text": "With my voice I cry out to the LORD; with my voice I plead for mercy to the LORD.",
      "links": "<a href='/AIV/19/77/1'>Ps. 77:1</a>; <a href='/AIV/19/34/6'>Ps. 34:6</a>",
      "comment": "The text emphasizes personal, vocal prayer addressed directly to God, showing the importance of crying out in times of need. Notice the repetition of 'with my voice,' signifying earnest and heartfelt supplication, a theme reflected throughout the book of Psalms and echoed in liturgical traditions embracing vocal prayer as a means of communion with God."
    },
    {
      "pk": 1427002,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 2,
      "text": "I pour out my complaint before him; I declare my trouble before him.",
      "links": "<a href='/AIV/19/62/8'>Ps. 62:8</a>; <a href='/AIV/19/102/1'>Ps. 102:1</a>",
      "comment": "The psalmist expresses complete honesty before God, showing that every trouble and complaint can be brought openly in prayer. This sets a precedent for freely unburdening one’s heart before the Lord, underlining the human need for confession and trust in God's attentive presence."
    },
    {
      "pk": 1427003,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 3,
      "text": "When my spirit is overwhelmed within me, you know my path. In the way I walk, they have hidden a trap for me.",
      "links": "<a href='/AIV/19/61/2'>Ps. 61:2</a>; <a href='/AIV/19/140/5'>Ps. 140:5</a>",
      "comment": "This verse shows God’s intimate knowledge of each person’s path, even during despair. The mention of hidden traps points to spiritual warfare and the reality of opposition against the faithful, foreshadowing the trials faced by Christ (see <a href='/AIV/43/11/53'>John 11:53</a>), and highlighting the importance of trust in divine guidance over personal strength."
    },
    {
      "pk": 1427004,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 4,
      "text": "Look to my right hand and see: no one is concerned for me. There is no refuge for me; no one cares for my soul.",
      "links": "<a href='/AIV/19/69/20'>Ps. 69:20</a>; <a href='/AIV/23/63/5'>Isa. 63:5</a>",
      "comment": "The psalmist’s loneliness and abandonment foreshadow Christ’s suffering and isolation during his passion (see <a href='/AIV/40/26/56'>Matt. 26:56</a>). Ultimately, this points toward God as the only true refuge and source of consolation when human support fails."
    },
    {
      "pk": 1427005,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 5,
      "text": "I cry to you, O LORD; I say, ‘You are my refuge, my portion in the land of the living.’",
      "links": "<a href='/AIV/19/16/5'>Ps. 16:5</a>; <a href='/AIV/19/73/26'>Ps. 73:26</a>",
      "comment": "Declaring the LORD as one’s 'portion' links to Israelite inheritance imagery, signifying that God himself is the believer’s true possession and source of hope. This foreshadows the spiritual inheritance made available through Christ, received through grace and ongoing participation in the life of the Church."
    },
    {
      "pk": 1427006,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 6,
      "text": "Attend to my cry, for I am brought very low. Deliver me from those who pursue me, for they are too strong for me.",
      "links": "<a href='/AIV/19/17/9'>Ps. 17:9</a>; <a href='/AIV/19/143/3'>Ps. 143:3</a>",
      "comment": "Recognizing his own weakness, the psalmist appeals to God for deliverance. This humble admission of dependence points to the Christian call to rely not on self, but on divine grace. The plea for rescue echoes throughout both Old and New Testaments, and is fulfilled most perfectly in Christ’s victory over spiritual enemies."
    },
    {
      "pk": 1427007,
      "translation": "AIV",
      "book": 19,
      "chapter": 142,
      "verse": 7,
      "text": "Bring my soul out of prison, so I may give thanks to your name. The righteous will surround me, for you will deal bountifully with me.",
      "links": "<a href='/AIV/19/107/14'>Ps. 107:14</a>; <a href='/AIV/44/12/7'>Acts 12:7</a>",
      "comment": "The image of being released from prison is both literal and figurative, prefiguring spiritual liberation found in Christ (see <a href='/AIV/42/4/18'>Luke 4:18</a>). The thanksgiving and gathering of the righteous points toward communal worship and sharing in the fullness of God’s blessings, anticipated in the assembly of the faithful and sacramental life."
    }
  ],
  "translatedAt": "2025-12-23T05:50:47.694Z"
}