{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 79,
  "verses": [
    {
      "pk": 23079001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 1,
      "text": "O God, the nations have entered Your inheritance; they have defiled Your holy temple; they have made Jerusalem a heap of ruins.",
      "links": "<a href='/AIV/19/74/3-7'>Ps. 74:3-7</a>; <a href='/AIV/25/1/10'>Lam. 1:10</a>",
      "comment": "This verse laments the desecration of the temple, which echoes the destruction of Jerusalem by foreign powers. The language points to the deep connection between God's people and the place of worship, foreshadowing the New Testament's teaching on the Church as the dwelling place of God (see 1 Cor. 3:16)."
    },
    {
      "pk": 23079002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 2,
      "text": "They have given the dead bodies of Your servants as food for the birds of the heavens, the flesh of Your faithful to the beasts of the earth.",
      "links": "<a href='/AIV/24/7/33'>Jer. 7:33</a>; <a href='/AIV/19/44/22'>Ps. 44:22</a>",
      "comment": "This image of judgment recalls the curses for breaking covenant (Deut. 28:26). The faithful suffering is later echoed in the sacrificial offering of Christ (Rom. 8:36-37)."
    },
    {
      "pk": 23079003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 3,
      "text": "They have poured out their blood like water all around Jerusalem, and there was no one to bury them.",
      "links": "<a href='/AIV/25/2/21'>Lam. 2:21</a>; <a href='/AIV/24/14/16'>Jer. 14:16</a>",
      "comment": "The lack of burial is a sign of utter devastation in Israelite culture. Blood poured out can anticipate the outpouring of Christ’s blood which brings true restoration and redemption (Heb. 9:13-14)."
    },
    {
      "pk": 23079004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 4,
      "text": "We have become a reproach to our neighbors, mocked and scorned by those around us.",
      "links": "<a href='/AIV/19/44/13-14'>Ps. 44:13-14</a>; <a href='/AIV/25/2/15'>Lam. 2:15</a>",
      "comment": "This theme of reproach and scorn is fulfilled in Christ, who Himself became despised and rejected (Isaiah 53:3), uniting Himself with the suffering of God’s people."
    },
    {
      "pk": 23079005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 5,
      "text": "How long, O LORD? Will You be angry forever? Will Your jealousy burn like fire?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>; <a href='/AIV/24/21/12'>Jer. 21:12</a>",
      "comment": "The phrase 'How long?' appears throughout the Psalms as God’s people seek His mercy. Divine jealousy points to God’s passionate love for covenant faithfulness, which is ultimately fulfilled in the New Covenant established by Christ."
    },
    {
      "pk": 23079006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 6,
      "text": "Pour out Your wrath on the nations that do not know You, and on kingdoms that do not call on Your name.",
      "links": "<a href='/AIV/24/10/25'>Jer. 10:25</a>; <a href='/AIV/19/69/24'>Ps. 69:24</a>",
      "comment": "Here, judgment is called upon nations outside Israel, anticipating the messianic hope where all nations are called to worship the one true God (see Matt. 28:19)."
    },
    {
      "pk": 23079007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 7,
      "text": "For they have devoured Jacob and laid waste his dwelling place.",
      "links": "<a href='/AIV/25/2/2'>Lam. 2:2</a>; <a href='/AIV/19/53/4'>Ps. 53:4</a>",
      "comment": "Jacob refers to the people of Israel. The physical devastation of their land points towards the need for a spiritual restoration accomplished in the promised Messiah."
    },
    {
      "pk": 23079008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 8,
      "text": "Do not remember against us the iniquities of our ancestors; let Your compassion come quickly to meet us, for we are brought very low.",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>; <a href='/AIV/27/9/16'>Dan. 9:16</a>",
      "comment": "The plea for forgiveness of ancestral sins foreshadows Christ’s atoning work and the merciful ongoing mediation for believers (1 John 2:1-2)."
    },
    {
      "pk": 23079009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 9,
      "text": "Help us, O God of our salvation, for the glory of Your name; deliver us and atone for our sins, for Your name’s sake.",
      "links": "<a href='/AIV/19/25/11'>Ps. 25:11</a>; <a href='/AIV/26/36/22'>Ezek. 36:22</a>",
      "comment": "A heartfelt prayer for atonement reflects the sacrificial system, but ultimately finds fulfillment in the once-for-all sacrifice of Christ (Hebrews 10:10)."
    },
    {
      "pk": 23079010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 10,
      "text": "Why should the nations say, 'Where is their God?' Let the avenging of the outpoured blood of Your servants be known among the nations before our eyes.",
      "links": "<a href='/AIV/19/115/2'>Ps. 115:2</a>; <a href='/AIV/05/32/43'>Deut. 32:43</a>",
      "comment": "The psalmist’s passion for God’s reputation is realized in the vindication of Christ and the visible sign of God’s presence among His people in the world."
    },
    {
      "pk": 23079011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 11,
      "text": "Let the groaning of the prisoners come before You; according to the greatness of Your power, preserve those doomed to die.",
      "links": "<a href='/AIV/19/102/20'>Ps. 102:20</a>; <a href='/AIV/23/42/7'>Isa. 42:7</a>",
      "comment": "God’s concern for prisoners prefigures the deliverance brought about by Christ, liberating those in bondage to sin and death (Luke 4:18)."
    },
    {
      "pk": 23079012,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 12,
      "text": "And return to our neighbors sevenfold into their lap the reproach with which they have reproached you, O Lord.",
      "links": "<a href='/AIV/01/04/15'>Gen. 4:15</a>; <a href='/AIV/07/16/28'>Judg. 16:28</a>",
      "comment": "Retribution is sought, but in light of the New Testament, Christ teaches forgiveness even in the face of reproach, revealing the call to mercy and justice together (Luke 6:27-28)."
    },
    {
      "pk": 23079013,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 79,
      "verse": 13,
      "text": "Then we Your people, the sheep of Your pasture, will give thanks to You forever; from generation to generation we will proclaim Your praise.",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>; <a href='/AIV/23/40/11'>Isa. 40:11</a>",
      "comment": "God’s people as sheep is a powerful image fulfilled in Christ the Good Shepherd (John 10:11), who cares for, gathers, and feeds His flock, inviting the redeemed to an unending praise."
    }
  ],
  "translatedAt": "2025-12-24T06:27:17.433Z"
}