{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 57,
  "verses": [
    {
      "pk": 23057001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 1,
      "text": "Be gracious to me, O God, be gracious to me, for in you my soul takes refuge; in the shadow of your wings I will take refuge, until destruction passes by.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "David uses the imagery of taking refuge under God's wings, echoing the cherubim in the sanctuary (see Ps. 17:8). This phrase shows how God’s protection is both personal and covenantal. Jesus himself alludes to this in Matthew 23:37, where he desires to gather Jerusalem's children 'as a hen gathers her brood under her wings.' This displays a typological foreshadowing of Christ as the fulfillment of David's prayer and of the safety found in communion with God through his chosen instruments."
    },
    {
      "pk": 23057002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 2,
      "text": "I cry out to God Most High, to God who accomplishes all things for me.",
      "links": "<a href='/AIV/19/56/9'>Ps. 56:9</a>; <a href='/AIV/19/138/8'>Ps. 138:8</a>",
      "comment": "The title 'God Most High' (El Elyon) emphasizes God’s sovereignty and authority. David acknowledges God as the one who ultimately brings about his deliverance and fulfills his purposes, a theme later perfected in the person and mission of Christ, who said, 'I have come down from heaven, not to do my own will but the will of him who sent me' (see John 6:38)."
    },
    {
      "pk": 23057003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 3,
      "text": "He will send from heaven and save me; he will put to shame him who tramples on me. God will send out his steadfast love and his faithfulness.",
      "links": "<a href='/AIV/19/40/11'>Ps. 40:11</a>; <a href='/AIV/19/144/7'>Ps. 144:7</a>",
      "comment": "'Steadfast love and faithfulness' (chesed ve-emet) are key terms in covenant theology. They are later personified in Christ (see John 1:14, 'full of grace and truth'). The sending from heaven also alludes to God's direct intervention, which in Christian doctrine is ultimately fulfilled in the incarnation, when God sent his Son to save humanity."
    },
    {
      "pk": 23057004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 4,
      "text": "My soul is among lions; I lie among those who devour—men whose teeth are spears and arrows, whose tongues are sharp swords.",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/52/2-4'>Ps. 52:2-4</a>",
      "comment": "David poetically describes his persecutors as wild beasts and their words as weapons. This echoes the sufferings of the righteous, especially that of Christ in his passion (see Ps. 22:13, which the Gospels apply to Jesus). The emphasis on slander and violent speech highlights the seriousness of sins of the tongue, a theme also picked up in the New Testament (James 3:6-8)."
    },
    {
      "pk": 23057005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 5,
      "text": "Be exalted, O God, above the heavens! Let your glory be over all the earth!",
      "links": "<a href='/AIV/19/108/5'>Ps. 108:5</a>; <a href='/AIV/19/8/1'>Ps. 8:1</a>",
      "comment": "This refrain (repeated in verse 11) expresses David’s desire for God's universal reign. The exaltation of God above the heavens points to the ultimate kingship of God, an idea fulfilled in Christ’s ascension and rule at the right hand of the Father (Ephesians 1:20-22)."
    },
    {
      "pk": 23057006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 6,
      "text": "They set a net for my steps; my soul was bowed down. They dug a pit in my path, but they have fallen into it themselves.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/19/9/15'>Ps. 9:15-16</a>",
      "comment": "The idea of the wicked falling into the very trap they set is common in biblical justice (see Ps. 7:15, 9:15). This pattern of divine vindication is seen in Daniel’s deliverance from the lions (Dan. 6:24) and reaches its height in Christ’s resurrection, where death and evil are defeated precisely at the moment they seemed to triumph."
    },
    {
      "pk": 23057007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 7,
      "text": "My heart is steadfast, O God, my heart is steadfast! I will sing, and make music.",
      "links": "<a href='/AIV/19/108/1'>Ps. 108:1</a>; <a href='/AIV/19/112/7'>Ps. 112:7</a>",
      "comment": "David’s repetition emphasizes his unwavering trust, even amid trouble. The call to sing and make music anticipates the Church’s enduring tradition of worship through song, aligning believers in praise, unity, and perseverance."
    },
    {
      "pk": 23057008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 8,
      "text": "Awake, my glory! Awake, harp and lyre! I will awaken the dawn.",
      "links": "<a href='/AIV/19/108/2'>Ps. 108:2</a>; <a href='/AIV/19/30/12'>Ps. 30:12</a>",
      "comment": "'My glory' refers to the soul or inner self. The psalmist calls his entire being and his instruments to praise God. The reference to 'awakening the dawn' symbolizes beginning the day with worship, a rhythm maintained in communal liturgical prayer and devotional life."
    },
    {
      "pk": 23057009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 9,
      "text": "I will give thanks to you, O Lord, among the peoples; I will sing praise to you among the nations.",
      "links": "<a href='/AIV/19/18/49'>Ps. 18:49</a>; <a href='/AIV/19/96/3'>Ps. 96:3</a>",
      "comment": "This verse anticipates the worldwide mission of God's people to glorify him among all nations (compare Ps. 96:3). Paul cites similar language as a prophecy of the gospel’s inclusion of the Gentiles (Romans 15:9). Here, worship is both local and global, pointing to the unity of believers across the world."
    },
    {
      "pk": 23057010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 10,
      "text": "For your steadfast love is great to the heavens, your faithfulness to the clouds.",
      "links": "<a href='/AIV/19/36/5'>Ps. 36:5</a>; <a href='/AIV/19/103/11'>Ps. 103:11</a>",
      "comment": "'Steadfast love' (chesed) and 'faithfulness' (emet) are attributes of God repeatedly celebrated in the psalms. Their greatness reaches the heavens and the clouds, signifying their infinite scope—a love and faithfulness fulfilled and revealed most perfectly in the new covenant."
    },
    {
      "pk": 23057011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 57,
      "verse": 11,
      "text": "Be exalted, O God, above the heavens! Let your glory be over all the earth!",
      "links": "<a href='/AIV/19/57/5'>Ps. 57:5</a>; <a href='/AIV/19/108/5'>Ps. 108:5</a>",
      "comment": "This closing refrain re-emphasizes the ultimate purpose of God's acts: his own glory, manifest for all creation. In Christian theology, this is brought to fruition in Christ, who brings all things into unity under God’s universal reign (Ephesians 1:10). Such exaltation is the goal of all Christian worship and the mission of the Church."
    }
  ],
  "translatedAt": "2025-12-24T06:18:34.594Z"
}