{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 45,
  "verses": [
    {
      "pk": 4504501,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 1,
      "text": "My heart overflows with a good theme; I address my verses to the king; my tongue is the pen of a skillful scribe.",
      "links": "<a href='/AIV/40/1/23'>Matt. 1:23</a>; <a href='/AIV/19/72/20'>Ps. 72:20</a>",
      "comment": "This psalm is unique as a royal wedding song, but Christian tradition sees a deeper prophetic meaning, with the 'king' prophetically pointing toward Christ, the true King and Messiah."
    },
    {
      "pk": 4504502,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 2,
      "text": "You are more handsome than the sons of men; grace is poured out upon your lips; therefore God has blessed you forever.",
      "links": "<a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/42/4/22'>Luke 4:22</a>",
      "comment": "Applied literally to an earthly king, but Christian interpretation sees this as foreshadowing Christ, whose gracious words (cf. Luke 4:22) and divine favor set Him apart. Notably, this hints at the Incarnation."
    },
    {
      "pk": 4504503,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 3,
      "text": "Gird your sword upon your thigh, O mighty one, in your splendor and majesty.",
      "links": "<a href='/AIV/19/110/2'>Ps. 110:2</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "This martial imagery connects to Christ as victorious warrior (see Revelation 19:11-16). The psalm’s language foreshadows Christ’s kingly and priestly role."
    },
    {
      "pk": 4504504,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 4,
      "text": "In your majesty ride out victoriously for the cause of truth and meekness and righteousness; let your right hand accomplish awesome deeds.",
      "links": "<a href='/AIV/23/11/4'>Isa. 11:4</a>; <a href='/AIV/19/72/2'>Ps. 72:2</a>",
      "comment": "Describes the king's mission as one of righteousness and meekness—qualities ultimately fulfilled in Christ, who is both mighty and humble (Matthew 21:5; Philippians 2:8)."
    },
    {
      "pk": 4504505,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 5,
      "text": "Your arrows are sharp—peoples fall under you—the enemies of the king fall in the heart of the king’s enemies.",
      "links": "<a href='/AIV/19/21/12'>Ps. 21:12</a>; <a href='/AIV/66/6/2'>Rev. 6:2</a>",
      "comment": "A royal victory image. Many see a typological reading as Christ conquering spiritual enemies—sin and death—at the Cross."
    },
    {
      "pk": 4504506,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 6,
      "text": "Your throne, O God, is forever and ever; the scepter of your kingdom is a scepter of justice.",
      "links": "<a href='/AIV/58/1/8'>Heb. 1:8</a>; <a href='/AIV/19/93/2'>Ps. 93:2</a>",
      "comment": "A clear reference to divine kingship. Quoted in Hebrews 1:8 as directly referring to Christ’s divinity. This verse has strong doctrinal significance for the Trinity and the eternal kingship of the Son."
    },
    {
      "pk": 4504507,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 7,
      "text": "You have loved righteousness and hated wickedness; therefore God, your God, has anointed you with the oil of gladness above your companions.",
      "links": "<a href='/AIV/58/1/9'>Heb. 1:9</a>; <a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Anoints the king above others—literally Solomon, but fully Christ, the true Anointed One (Messiah). “God, your God” hints at a distinction within the Godhead—a text foundational for the doctrine of the Trinity."
    },
    {
      "pk": 4504508,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 8,
      "text": "All your garments are fragrant with myrrh and aloes and cassia; from palaces of ivory stringed instruments make you glad.",
      "links": "<a href='/AIV/43/19/39'>John 19:39</a>; <a href='/AIV/22/4/14'>Song 4:14</a>",
      "comment": "Imagery of lavish royal wedding. Catholic interpretation often sees in the perfumes (myrrh/aloe) a hint of Christ’s burial (John 19:39) and royal priestly ministry."
    },
    {
      "pk": 4504509,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 9,
      "text": "Daughters of kings are among your ladies of honor; at your right hand stands the queen in gold of Ophir.",
      "links": "<a href='/AIV/11/10/11'>1 Kings 10:11</a>; <a href='/AIV/66/12/1'>Rev. 12:1</a>",
      "comment": "Traditionally about a royal bride. Christian typology connects the queen to Mary (Mother of Jesus) in her exalted place (cf. Rev 12:1, Queen of Heaven). This forms part of Catholic Marian theology."
    },
    {
      "pk": 4504510,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 10,
      "text": "Listen, daughter, and pay attention; forget your people and your father’s house.",
      "links": "<a href='/AIV/19/21/11'>Ps. 21:11</a>; <a href='/AIV/01/2/24'>Gen. 2:24</a>",
      "comment": "Bride imagery, also evoking Israel (and the Church) leaving old ties for union with the king (Christ). This prefigures the Church’s vocation to spiritual union and Marian themes (Mary as Daughter Zion)."
    },
    {
      "pk": 4504511,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 11,
      "text": "And the king will desire your beauty; since he is your lord, bow to him.",
      "links": "<a href='/AIV/66/21/2'>Rev. 21:2</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "A call for the bride’s reverence and devotion. Early Christians saw the Church and Mary as spiritual brides of Christ. The language of worship and submission connects to Catholic teachings on the Church’s relationship with Christ."
    },
    {
      "pk": 4504512,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 12,
      "text": "The daughter of Tyre will come with a gift; the richest of the people will seek your favor.",
      "links": "<a href='/AIV/19/72/10'>Ps. 72:10</a>; <a href='/AIV/40/2/11'>Matt. 2:11</a>",
      "comment": "Foreigners bringing gifts to the king. Echoes nations coming to Christ (cf. Epiphany: Matt 2:11), a sign of the Church’s catholicity (universal mission)."
    },
    {
      "pk": 4504513,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 13,
      "text": "All glorious is the king’s daughter within; her clothing is threaded with gold.",
      "links": "<a href='/AIV/66/19/8'>Rev. 19:8</a>; <a href='/AIV/22/1/4'>Song 1:4</a>",
      "comment": "Describes the inner glory and outward beauty of the bride. Early and Catholic tradition have seen this both as the Church sanctified by Christ and as a Marian figure (Mary clothed with grace; cf. Immaculate Conception themes)."
    },
    {
      "pk": 4504514,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 14,
      "text": "In embroidered garments she is led to the king; her virgin companions follow her, brought to you.",
      "links": "<a href='/AIV/40/25/1'>Matt. 25:1</a>; <a href='/AIV/66/14/4'>Rev. 14:4</a>",
      "comment": "Procession of the bride and virgins—a symbol of the Church and saints. The imagery supports both literal historic context and a broader spiritual/catholic understanding of consecrated virginity and the special role of Mary."
    },
    {
      "pk": 4504515,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 15,
      "text": "With gladness and joy they are led along as they enter the palace of the king.",
      "links": "<a href='/AIV/66/19/7'>Rev. 19:7</a>; <a href='/AIV/19/16/11'>Ps. 16:11</a>",
      "comment": "Wedding imagery prefiguring the heavenly marriage feast (see Revelation 19:7), which Catholics emphasize as the ultimate fulfillment celebrated in the Eucharist (heavenly liturgy on earth)."
    },
    {
      "pk": 4504516,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 16,
      "text": "In place of your fathers will be your sons; you will make them princes in all the earth.",
      "links": "<a href='/AIV/01/17/6'>Gen. 17:6</a>; <a href='/AIV/19/72/17'>Ps. 72:17</a>",
      "comment": "Legacy of the king: sons as princes. Spiritually, this hints at the Church’s offspring (believers) and apostolic succession—a theme prominent in Catholic tradition (see Acts 1:20–26)."
    },
    {
      "pk": 4504517,
      "translation": "AIV",
      "book": 19,
      "chapter": 45,
      "verse": 17,
      "text": "I will cause your name to be remembered in all generations; therefore the peoples will praise you forever and ever.",
      "links": "<a href='/AIV/19/72/17'>Ps. 72:17</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "The perpetuity of the king’s (i.e. Christ’s) name and praise. For Catholics, verses like these justify Marian devotion as her memory is also called ‘blessed through all generations’ (Luke 1:48), tying this psalm to both Christ and Mary."
    }
  ],
  "translatedAt": "2025-12-22T21:34:37.508Z"
}