{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 63,
  "verses": [
    {
      "pk": 1963000,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 1,
      "text": "O God, you are my God; I seek you early. My soul thirsts for you, my flesh longs for you, in a dry and weary land where there is no water.",
      "links": "<a href='/AIV/19/42/1-2'>Ps. 42:1–2</a>; <a href='/AIV/19/143/6'>Ps. 143:6</a>",
      "comment": "The language here captures the depth of desire for God's presence, echoing spiritual thirst as in Ps. 42. The Hebrew verb for 'seek' implies earnest longing, fitting both literal and mystical interpretations of union with God."
    },
    {
      "pk": 1963001,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 2,
      "text": "So I have looked upon you in the sanctuary, beholding your power and your glory.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/19/17/15'>Ps. 17:15</a>",
      "comment": "Reference to the sanctuary foreshadows worship both in Jerusalem's Temple and, in Christian typology, in Christ's body (John 2:19). The mention of beholding God's glory hints at the beatific vision, a key Catholic doctrine."
    },
    {
      "pk": 1963002,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 3,
      "text": "Because your steadfast love is better than life, my lips will praise you.",
      "links": "<a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/138/2'>Ps. 138:2</a>",
      "comment": "The Hebrew 'chesed' (steadfast love) is central to God's covenant. This verse connects to John's teaching that God is love (1 John 4:8), and to the Catholic emphasis on the primacy of divine charity."
    },
    {
      "pk": 1963003,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 4,
      "text": "So I will bless you as long as I live; in your name I will lift up my hands.",
      "links": "<a href='/AIV/19/104/33'>Ps. 104:33</a>; <a href='/AIV/19/134/2'>Ps. 134:2</a>",
      "comment": "Lifting hands in prayer has liturgical connotations, linked to bodily worship as in Catholic tradition. Blessing God all life long echoes the call to perseverance in faith."
    },
    {
      "pk": 1963004,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 5,
      "text": "My soul will be satisfied as with fat and rich food, and my mouth will praise you with joyful lips.",
      "links": "<a href='/AIV/19/36/8'>Ps. 36:8</a>; <a href='/AIV/19/65/4'>Ps. 65:4</a>",
      "comment": "Satisfaction from God is compared to a feast. This anticipates Eucharistic themes: true fullness comes from communion with God (see John 6:35)."
    },
    {
      "pk": 1963005,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 6,
      "text": "When I remember you upon my bed, and meditate on you in the watches of the night;",
      "links": "<a href='/AIV/19/4/4'>Ps. 4:4</a>; <a href='/AIV/19/119/148'>Ps. 119:148</a>",
      "comment": "Meditating on God day and night recalls the practice of continual prayer established in monastic and liturgical life (cf. 1 Thess. 5:17)."
    },
    {
      "pk": 1963006,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 7,
      "text": "because you have been my help, and in the shadow of your wings I will sing for joy.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/61/4'>Ps. 61:4</a>",
      "comment": "‘Shadow of your wings’ implies God's maternal protection, which the Church often likens to the care of Holy Mother Church."
    },
    {
      "pk": 1963007,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 8,
      "text": "My soul clings to you; your right hand upholds me.",
      "links": "<a href='/AIV/19/63/3'>Ps. 63:3</a>; <a href='/AIV/19/63/6'>Ps. 63:6</a>",
      "comment": "Clinging to God and being upheld by his right hand prefigure the doctrine of cooperating with grace—a theme developed especially in Catholic soteriology (Phil. 2:12–13)."
    },
    {
      "pk": 1963008,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 9,
      "text": "But those who seek to destroy my soul will go down into the depths of the earth.",
      "links": "<a href='/AIV/19/55/23'>Ps. 55:23</a>; <a href='/AIV/19/88/6'>Ps. 88:6</a>",
      "comment": "The fate of the wicked is here depicted physically and spiritually, pointing to divine justice and a foreshadowing of judgment."
    },
    {
      "pk": 1963009,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 10,
      "text": "They will be given over to the power of the sword; they will be a portion for jackals.",
      "links": "<a href='/AIV/19/44/10-11'>Ps. 44:10–11</a>; <a href='/AIV/19/79/2'>Ps. 79:2</a>",
      "comment": "Imagery of abandonment to wild beasts is a common prophecy motif symbolizing defeat—a reminder that full security is found only in God."
    },
    {
      "pk": 1963010,
      "translation": "AIV",
      "book": 19,
      "chapter": 63,
      "verse": 11,
      "text": "But the king will rejoice in God; everyone who swears by him will exult, for the mouths of liars will be stopped.",
      "links": "<a href='/AIV/19/21/1'>Ps. 21:1</a>; <a href='/AIV/19/107/42'>Ps. 107:42</a>",
      "comment": "The reference to the king likely refers to David, but carries a messianic hope fulfilled in Christ, the true King (see Luke 1:32–33). The victory over lies reflects ultimate truth in Christ and His Church."
    }
  ],
  "translatedAt": "2025-12-22T21:39:29.700Z"
}