{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 36,
  "verses": [
    {
      "pk": 1933600,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 1,
      "text": "An oracle of transgression speaks within the heart of the wicked; there is no fear of God before his eyes.",
      "links": "<a href='/AIV/53/3/3'>Rom. 3:18</a>; <a href='/AIV/19/10/4'>Ps. 10:4</a>",
      "comment": "The psalm begins with a prophetic insight or 'oracle' into human sinfulness. Paul quotes this verse in Romans 3:18, linking original sin and the necessity for grace. Notice the 'fear of God' missing—a recurring theme in Catholic spirituality, notably in the Seven Gifts of the Holy Spirit."
    },
    {
      "pk": 1933601,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 2,
      "text": "For he flatters himself in his own eyes, that his iniquity cannot be found out and hated.",
      "links": "<a href='/AIV/19/49/18'>Ps. 49:18</a>",
      "comment": "Self-deception leads one away from repentance. Catholic tradition emphasizes examination of conscience, which helps uncover hidden sins, guiding believers towards confession and reconciliation."
    },
    {
      "pk": 1933602,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 3,
      "text": "The words of his mouth are wickedness and deceit; he has ceased to act wisely and do good.",
      "links": "<a href='/AIV/19/52/1-4'>Ps. 52:1-4</a>; <a href='/AIV/19/10/7'>Ps. 10:7</a>",
      "comment": "Sin affects speech and actions. Catholic teaching affirms that both faith and works express true piety, aligning with James 2:17."
    },
    {
      "pk": 1933603,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 4,
      "text": "He plots wickedness on his bed; he sets himself on a path that is not good; he does not reject evil.",
      "links": "<a href='/AIV/19/4/4'>Ps. 4:4</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "The psalmist describes a willful persistence in evil. The Catholic understanding of free will includes the power to cooperate with or resist grace."
    },
    {
      "pk": 1933604,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 5,
      "text": "Your steadfast love, O LORD, reaches to the heavens, your faithfulness to the skies.",
      "links": "<a href='/AIV/19/57/10'>Ps. 57:10</a>; <a href='/AIV/19/103/11'>Ps. 103:11</a>",
      "comment": "God’s love and faithfulness are incomparably vast. This echoes the Catholic belief in God’s infinite mercy, often reflected in devotion to the Sacred Heart of Jesus."
    },
    {
      "pk": 1933605,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 6,
      "text": "Your righteousness is like the mountains of God; your judgments are like the great deep; O LORD, you preserve man and beast.",
      "links": "<a href='/AIV/19/71/19'>Ps. 71:19</a>; <a href='/AIV/19/104/6'>Ps. 104:6</a>",
      "comment": "God’s justice is both majestic and mysterious. The preservation of all creatures highlights sacramental realities, such as blessing of animals and the Catholic vision of creation redeemed."
    },
    {
      "pk": 1933606,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 7,
      "text": "How precious is your steadfast love, O God! The children of mankind take refuge in the shadow of your wings.",
      "links": "<a href='/AIV/19/91/4'>Ps. 91:4</a>; <a href='/AIV/19/17/8'>Ps. 17:8</a>",
      "comment": "The image of shelter under God’s wings hints at sacramental protection, prefiguring Christ's words in <a href='/AIV/40/23/37'>Matt. 23:37</a>. Catholics read this as God gathering people under the Church, his body."
    },
    {
      "pk": 1933607,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 8,
      "text": "They feast on the abundance of your house, and you give them drink from the river of your delights.",
      "links": "<a href='/AIV/19/65/4'>Ps. 65:4</a>; <a href='/AIV/19/46/4'>Ps. 46:4</a>",
      "comment": "The imagery of feasting and drinking from God’s house is eucharistic; Catholics see here a veiled prophecy of the Eucharist, the true feast and living water (<a href='/AIV/43/6/35'>John 6:35</a>)."
    },
    {
      "pk": 1933608,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 9,
      "text": "For with you is the fountain of life; in your light we see light.",
      "links": "<a href='/AIV/43/1/4'>John 1:4</a>; <a href='/AIV/20/13/14'>Prov. 13:14</a>",
      "comment": "A strong Christological theme—Jesus as the light and source of life (<a href='/AIV/43/8/12'>John 8:12</a>). Catholic theology affirms that Christ himself is the font of life, especially through sacramental grace."
    },
    {
      "pk": 1933609,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 10,
      "text": "Continue your steadfast love to those who know you, and your righteousness to the upright in heart.",
      "links": "<a href='/AIV/19/103/17'>Ps. 103:17</a>; <a href='/AIV/19/24/4'>Ps. 24:4</a>",
      "comment": "Perseverance in grace is a Catholic doctrine reinforced here. The upright in heart must continually seek God, echoing the need for ongoing conversion and sanctification."
    },
    {
      "pk": 1933610,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 11,
      "text": "Let not the foot of arrogance come upon me, nor the hand of the wicked drive me away.",
      "links": "<a href='/AIV/19/5/8'>Ps. 5:8</a>; <a href='/AIV/19/119/133'>Ps. 119:133</a>",
      "comment": "Praying against pride and evil, the psalmist anticipates the humility needed for sanctification—a key virtue in Catholic asceticism."
    },
    {
      "pk": 1933611,
      "translation": "AIV",
      "book": 19,
      "chapter": 36,
      "verse": 12,
      "text": "There the evildoers have fallen; they have been thrown down and cannot rise.",
      "links": "<a href='/AIV/19/35/8'>Ps. 35:8</a>; <a href='/AIV/19/140/10'>Ps. 140:10</a>",
      "comment": "Divine judgment is final upon the unrepentant. Catholic teaching on mortal sin and final perseverance is suggested: without grace, there is no rising from spiritual death."
    }
  ],
  "translatedAt": "2025-12-22T21:31:39.525Z"
}