{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 58,
  "verses": [
    {
      "pk": 1958058,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 1,
      "text": "Do you indeed speak righteousness, O you rulers? Do you judge uprightly, O sons of man?",
      "links": "<a href='/AIV/19/82/1'>Ps. 82:1</a>; <a href='/AIV/23/10/1'>Isa. 10:1–2</a>",
      "comment": "The psalm opens by questioning the integrity of those in authority. The original Hebrew word translated as 'rulers' can also mean 'silent ones,' suggesting a rebuke of both unjust leaders and silent bystanders. The appeal to justice echoes God's own role as judge, seen throughout scripture."
    },
    {
      "pk": 1958059,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 2,
      "text": "No, in your hearts you work wickedness; you weigh out the violence of your hands in the earth.",
      "links": "<a href='/AIV/19/94/20'>Ps. 94:20</a>; <a href='/AIV/19/28/3'>Ps. 28:3</a>",
      "comment": "David accuses corrupt leaders of injustice that springs from within. The language of 'weighing out' suggests deliberate action—evil that is chosen rather than accidental. This reflects the fallen nature of man (cf. Genesis 6:5), reminding us of the need for redemption."
    },
    {
      "pk": 1958060,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 3,
      "text": "The wicked are estranged from the womb; they go astray from birth, speaking lies.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>; <a href='/AIV/19/14/3'>Ps. 14:3</a>",
      "comment": "This verse highlights the doctrine of original sin—man's tendency toward evil from birth (Rom. 5:12). The Catholic Church teaches that baptism cleanses us from this condition, a teaching that has strong scriptural roots. See <a href='/AIV/45/5/12'>Romans 5:12</a> and the Catholic Catechism 404."
    },
    {
      "pk": 1958061,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 4,
      "text": "Their poison is like the poison of a serpent, like a deaf viper that stops its ear,",
      "links": "<a href='/AIV/19/140/3'>Ps. 140:3</a>; <a href='/AIV/1/3/13-15'>Gen. 3:13–15</a>",
      "comment": "The imagery of serpents recalls the serpent in Eden (Gen. 3) and sets up a typology fulfilled in Christ crushing the serpent's head. The stubbornness of the wicked is likened to a serpent that cannot be charmed—resistant even to the call of God."
    },
    {
      "pk": 1958062,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 5,
      "text": "which will not listen to the voice of charmers, no matter how skillful their spells.",
      "links": "<a href='/AIV/21/10/11'>Eccl. 10:11</a>",
      "comment": "Unrepentant sinners harden their hearts, refusing even the most persuasive warnings. Similarly, Jesus spoke of those with 'ears but do not hear' (Matt. 13:13), reinforcing both the reality of human freedom and the danger of unchecked sin."
    },
    {
      "pk": 1958063,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 6,
      "text": "O God, break the teeth in their mouths; tear out the fangs of the young lions, O LORD!",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/19/57/4'>Ps. 57:4</a>",
      "comment": "This is an imprecatory prayer calling for judgment on the wicked—seen as a call for justice. The Church reads these passages as prophetic of Christ's victory over evil (Heb. 2:14), and at a spiritual level, a model for praying against the power of sin."
    },
    {
      "pk": 1958064,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 7,
      "text": "Let them vanish like water that runs away; when he bends the bow, let his arrows be cut off.",
      "links": "<a href='/AIV/19/37/2'>Ps. 37:2</a>; <a href='/AIV/19/64/3'>Ps. 64:3–7</a>",
      "comment": "The language of vanishing water points to the transience of evil. God’s ultimate justice is certain. Symbolically, the powerless arrows recall Ephesians 6:16 ('flaming darts of the evil one'), which cannot harm the faithful."
    },
    {
      "pk": 1958065,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 8,
      "text": "Let them be like a snail that melts away as it moves, like a stillborn child who never sees the sun.",
      "links": "<a href='/AIV/19/39/11'>Ps. 39:11</a>",
      "comment": "Vivid imagery again underscores the futility and fleeting nature of evil. The loss of life before seeing the sun can also be read as a longing for participation in the true Light of Christ (John 1:9)."
    },
    {
      "pk": 1958066,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 9,
      "text": "Before your pots can feel the heat of thorns, he will sweep them away alive, like a whirlwind.",
      "links": "<a href='/AIV/19/118/12'>Ps. 118:12</a>; <a href='/AIV/18/21/18'>Job 21:18</a>",
      "comment": "Judgment will come swiftly, even before the wicked can settle or enjoy their plans. This again points to the certainty of divine justice, as echoed in the prophetic and apocalyptic warnings of both Old and New Testaments."
    },
    {
      "pk": 1958067,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 10,
      "text": "The righteous will rejoice when he sees the vengeance; he will wash his feet in the blood of the wicked.",
      "links": "<a href='/AIV/19/64/10'>Ps. 64:10</a>; <a href='/AIV/19/68/23'>Ps. 68:23</a>",
      "comment": "This strong language expresses relief at wickedness being judged. Traditionally, the Church reads vengeance in light of Christ’s redemption, where evil’s power is destroyed not by human force, but through the victory of Christ (Rom. 12:19). The washing imagery hints at sacramental cleansing, anticipating the Church’s sacramental life."
    },
    {
      "pk": 1958068,
      "translation": "AIV",
      "book": 19,
      "chapter": 58,
      "verse": 11,
      "text": "So mankind will say, 'Surely there is a reward for the righteous; surely there is a God who judges on the earth.'",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/19/73/18-20'>Ps. 73:18–20</a>",
      "comment": "The psalm concludes with a proclamation: God is active as judge and vindicator. The New Testament reiterates this truth (‘He will come to judge the living and the dead’) in the Apostles’ Creed, which both Catholics and Protestants profess. Full understanding of God’s judgment and reward is found in the Church’s longstanding eschatological hope."
    }
  ],
  "translatedAt": "2025-12-22T21:38:11.485Z"
}