{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 46,
  "verses": [
    {
      "pk": 23046001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 1,
      "text": "God is our refuge and strength, a help always found in times of trouble.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/91/2'>Ps. 91:2</a>; <a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "This verse emphasizes God's protection and constant presence, echoing themes of salvation seen throughout Scripture. The triple expression of God as 'refuge,' 'strength,' and 'help' prefigures Christ as our ultimate protector in the New Testament. The literal meaning matches closely with the Hebrew. The spiritual interpretation suggests God dwells with and defends His people—both individually and, in a deeper sense, corporately as His Church."
    },
    {
      "pk": 23046002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 2,
      "text": "Therefore we will not fear, though the earth shakes and the mountains fall into the heart of the sea;",
      "links": "<a href='/AIV/19/125/1-2'>Ps. 125:1-2</a>; <a href='/AIV/40/24/7'>Matt. 24:7</a>",
      "comment": "The imagery of upheaval reflects both physical calamity and spiritual trials. Christians are exhorted not to fear, trusting in God's sovereignty. The reference to mountains falling can be seen literally, but also figuratively as upheaval against God’s people, which cannot ultimately threaten His Church, protected by divine grace."
    },
    {
      "pk": 23046003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 3,
      "text": "though its waters roar and foam, and the mountains tremble at its surge. Selah.",
      "links": "<a href='/AIV/19/93/3-4'>Ps. 93:3-4</a>; <a href='/AIV/19/104/7'>Ps. 104:7</a>",
      "comment": "The roaring waters and trembling mountains depict turmoil, alive in the lives of believers but overcome by faith. ‘Selah’ invites reflection on God’s unshaken stability. The connection to other Psalms reinforces the littoral and spiritual sense: God's authority over chaos is a recurring biblical theme."
    },
    {
      "pk": 23046004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 4,
      "text": "There is a river whose streams make glad the city of God, the holy dwelling place of the Most High.",
      "links": "<a href='/AIV/19/36/8'>Ps. 36:8</a>; <a href='/AIV/26/47/1-12'>Ezek. 47:1-12</a>; <a href='/AIV/66/22/1-2'>Rev. 22:1-2</a>",
      "comment": "The river symbolizes divine grace and the life-giving presence of God, a theme expanded in Ezekiel and Revelation as the waters flowing from God's sanctuary. Spiritually, it's a foretaste of the new Jerusalem and the sacramental life—the way divine grace flows to believers through the Church’s ministry and worship."
    },
    {
      "pk": 23046005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 5,
      "text": "God is in her midst; she will not be shaken. God will help her when morning dawns.",
      "links": "<a href='/AIV/19/48/1-8'>Ps. 48:1-8</a>; <a href='/AIV/25/3/23'>Lam. 3:23</a>",
      "comment": "'Her' refers to God's city, often taken as Jerusalem or, in a spiritual sense, the community of believers united in worship. The assurance of God's abiding presence is central—His help coming 'when morning dawns' evokes divine intervention and renewal, hinting at resurrection themes."
    },
    {
      "pk": 23046006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 6,
      "text": "The nations roar, kingdoms totter; he lifts his voice, the earth melts.",
      "links": "<a href='/AIV/19/2/1-5'>Ps. 2:1-5</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "God’s supreme authority is shown as nations rage in vain—echoing the passion narratives where worldly powers challenge Christ, but ultimately are subdued. God's word brings decisive judgment, reflecting Old and New Testament affirmations of Christ's return and universal dominion."
    },
    {
      "pk": 23046007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 7,
      "text": "The Lord of hosts is with us; the God of Jacob is our stronghold. Selah.",
      "links": "<a href='/AIV/19/24/10'>Ps. 24:10</a>; <a href='/AIV/19/91/9'>Ps. 91:9</a>; <a href='/AIV/40/1/23'>Matt. 1:23</a>",
      "comment": "'Lord of hosts' underscores God’s kingship over both angels and creation. The reference to 'the God of Jacob' identifies a covenantal relationship, ultimately realized in Christ’s incarnation—'God with us.' The phrase 'Selah' again invites meditation on God's steadfast protection for His people."
    },
    {
      "pk": 23046008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 8,
      "text": "Come, behold the works of the Lord, who has brought desolations upon the earth.",
      "links": "<a href='/AIV/19/66/5'>Ps. 66:5</a>; <a href='/AIV/19/74/12-17'>Ps. 74:12-17</a>",
      "comment": "A call to witness God's mighty acts—both judgment and deliverance. The invitation to 'behold' connects with Christ’s miracles and the ongoing works of God through history. Spiritually, it suggests recognizing God's powerful movements throughout salvation history and liturgy."
    },
    {
      "pk": 23046009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 9,
      "text": "He makes wars cease to the end of the earth. He breaks the bow and shatters the spear; he burns the shields with fire.",
      "links": "<a href='/AIV/23/2/4'>Isa. 2:4</a>; <a href='/AIV/33/4/3'>Mic. 4:3</a>",
      "comment": "God’s peace is comprehensive and world-encompassing, fulfilled in Christ and in the unity established among believers. The imagery of breaking weapons points to the promise of peace found in prophetic books, and finds spiritual fulfillment in the reconciling work of Christ."
    },
    {
      "pk": 23046010,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 10,
      "text": "\"Be still, and know that I am God. I will be exalted among the nations, I will be exalted in the earth.\"",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>; <a href='/AIV/43/8/58'>John 8:58</a>",
      "comment": "This command invites both trust and worship. ‘Be still’ suggests the contemplative life and recognizing God's sovereignty—predating Christ’s self-identification as 'I AM.' The verse anticipates the spread of God’s glory through all nations, a prophecy fulfilled as Christ’s kingdom extends over the earth."
    },
    {
      "pk": 23046011,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 46,
      "verse": 11,
      "text": "The Lord of hosts is with us; the God of Jacob is our stronghold. Selah.",
      "links": "<a href='/AIV/19/46/7'>Ps. 46:7</a>; <a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "A repetition for emphasis, affirming God's abiding presence from generation to generation. The refrain encourages believers to find refuge in the Lord, recalling God's personal covenant, and calls to mind Christ's promise of eternal presence amidst His gathered flock."
    }
  ],
  "translatedAt": "2025-12-24T06:14:36.097Z"
}