{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 61,
  "verses": [
    {
      "pk": 1961061,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 1,
      "text": "Hear my cry, O God; listen to my prayer.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/19/55/1'>Ps. 55:1</a>",
      "comment": "David appeals to God, emphasizing God's personal attentiveness. The repetition of 'cry' and 'prayer' underscores the earnestness, echoing how God is directly invoked—a pattern often found in liturgical traditions. Catholics and Protestants agree on God's hearing of prayer, though the persistent appeal here subtly hints at the value of vocal, communal prayer as practiced in the Church."
    },
    {
      "pk": 1961062,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 2,
      "text": "From the end of the earth I call to you when my heart is faint; lead me to the rock that is higher than I.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/42/6'>Ps. 42:6</a>; <a href='/AIV/23/32/2'>Isa. 32:2</a>",
      "comment": "The phrase 'rock that is higher than I' symbolizes divine refuge and stability—pointing ahead to Christ as our rock (<a href='/AIV/40/7/24'>Matt. 7:24</a>). David's sense of distance from God is a powerful expression of our need for mediation and intercession, reflected in the Catholic understanding of the saints and Church as conduits to God."
    },
    {
      "pk": 1961063,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 3,
      "text": "For you have been my refuge, a strong tower against the enemy.",
      "links": "<a href='/AIV/19/31/3'>Ps. 31:3</a>; <a href='/AIV/19/59/16'>Ps. 59:16</a>; <a href='/AIV/20/18/10'>Prov. 18:10</a>",
      "comment": "God as 'refuge' and 'strong tower' is a recurring biblical image. This has been seen as both a literal defense and an allegorical reference to Christ and the Church as our shelter and protector—a subtle nod to the Catholic view of the ecclesial community as a spiritual stronghold."
    },
    {
      "pk": 1961064,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 4,
      "text": "Let me dwell in your tent forever; let me take refuge in the shelter of your wings. Selah.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/91/4'>Ps. 91:4</a>",
      "comment": "David wishes to 'dwell in your tent,' evoking imagery of the Tabernacle and, by extension, the Temple—a foreshadowing of the Church as God's dwelling among us (see <a href='/AIV/43/1/14'>John 1:14</a>). The 'wings' represent intimate protection, paralleling Marian and sacramental themes in Catholic theology."
    },
    {
      "pk": 1961065,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 5,
      "text": "For you, O God, have heard my vows; you have given me the heritage of those who fear your name.",
      "links": "<a href='/AIV/19/56/12'>Ps. 56:12</a>; <a href='/AIV/19/119/111'>Ps. 119:111</a>",
      "comment": "The 'vows' refer to promises made to God, commonly fulfilled in worship settings. 'Heritage' links to the inheritance of the faithful—pointing spiritually to the Communion of Saints and the Church's sacramental life, with strong resonance in Catholic tradition."
    },
    {
      "pk": 1961066,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 6,
      "text": "Prolong the king’s life; may his years be for many generations.",
      "links": "<a href='/AIV/19/21/4'>Ps. 21:4</a>; <a href='/AIV/10/7/13'>2 Sam. 7:13</a>",
      "comment": "David's prayer for the king points toward the promise of an everlasting kingdom—a prophetic anticipation of the Messiah, Jesus Christ, who fulfills this promise (<a href='/AIV/42/1/33'>Luke 1:33</a>). Catholics see this as a reference to the Davidic covenant and Christ's kingship, continuing visibly in the Church’s sacramental and apostolic succession."
    },
    {
      "pk": 1961067,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 7,
      "text": "May he sit enthroned before God forever; appoint steadfast love and faithfulness to guard him.",
      "links": "<a href='/AIV/19/89/4'>Ps. 89:4</a>; <a href='/AIV/19/21/7'>Ps. 21:7</a>",
      "comment": "The perpetual throne is messianic, culminating in Christ's eternal priesthood and kingship (<a href='/AIV/58/7/17'>Heb. 7:17</a>). 'Steadfast love and faithfulness' recall covenant language; Catholic theology emphasizes Christ as the high priest who remains forever in the presence of God."
    },
    {
      "pk": 1961068,
      "translation": "AIV",
      "book": 19,
      "chapter": 61,
      "verse": 8,
      "text": "So I will ever sing praise to your name, fulfilling my vows day after day.",
      "links": "<a href='/AIV/19/30/12'>Ps. 30:12</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>",
      "comment": "Continual praise and fulfilling vows reflect both individual and liturgical worship. Catholic tradition, with its daily Mass and prayers, carries this principle forward—hinting at how the Church's sacramental life is a fulfillment of this devotion, emphasizing the importance of sustained worship."
    }
  ],
  "translatedAt": "2025-12-22T21:39:08.014Z"
}