{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 15,
  "verses": [
    {
      "pk": 1950015,
      "translation": "AIV",
      "book": 19,
      "chapter": 15,
      "verse": 1,
      "text": "O LORD, who may dwell in your tent? Who may live on your holy mountain?",
      "links": "<a href='/AIV/24/7/4'>Jer. 7:4</a>; <a href='/AIV/19/24/3'>Ps. 24:3</a>",
      "comment": "This verse opens with a question about who is worthy to enter God's presence. The image of the 'tent' refers to the tabernacle (see Exod. 25:8), God's dwelling among His people, and 'holy mountain' points to Jerusalem (Zion) as the center of worship. The verse highlights God's holiness and the requirements for intimacy with Him, which will be unfolded in the following verses. Compare to Psalm 24:3, which asks a similar question."
    },
    {
      "pk": 1950016,
      "translation": "AIV",
      "book": 19,
      "chapter": 15,
      "verse": 2,
      "text": "He who walks blamelessly and does what is right and speaks truth from his heart;",
      "links": "<a href='/AIV/19/18/23'>Ps. 18:23</a>; <a href='/AIV/49/4/1'>Eph. 4:1</a>",
      "comment": "The conditions given are both moral and interior: true relationship with God requires upright action and inner truth. The word 'blameless' often refers to wholeheartedness, not mere external compliance (see Gen. 17:1). 'Blamelessness' is later fully realized in Christ, who fulfills the Law perfectly (Heb. 4:15)."
    },
    {
      "pk": 1950017,
      "translation": "AIV",
      "book": 19,
      "chapter": 15,
      "verse": 3,
      "text": "who does not slander with his tongue, nor does evil to his neighbor, nor casts reproach upon his friend;",
      "links": "<a href='/AIV/19/34/13'>Ps. 34:13</a>; <a href='/AIV/19/101/5'>Ps. 101:5</a>; <a href='/AIV/40/7/1'>Matt. 7:1</a>",
      "comment": "The focus is on sins of speech and action toward others, reflecting the deep ethical concern of the Scriptures. Note the call to charity and restraint from gossip or harm, echoing the Law's commands (Lev. 19:16-18). Jesus expands this ethic in the Sermon on the Mount (Matt. 5:21-26)."
    },
    {
      "pk": 1950018,
      "translation": "AIV",
      "book": 19,
      "chapter": 15,
      "verse": 4,
      "text": "in whose eyes a vile person is despised, but who honors those who fear the LORD; who swears to his own hurt and does not change;",
      "links": "<a href='/AIV/19/119/63'>Ps. 119:63</a>; <a href='/AIV/40/5/37'>Matt. 5:37</a>",
      "comment": "There is a call to discernment, valuing those who honor the Lord over those who reject Him. Faithful integrity is emphasized—keeping one’s word even when it is costly. Jesus deepens this in Matthew 5:37, urging absolute honesty flowing from a transformed heart."
    },
    {
      "pk": 1950019,
      "translation": "AIV",
      "book": 19,
      "chapter": 15,
      "verse": 5,
      "text": "who does not put out his money at interest, nor takes a bribe against the innocent. He who does these things will never be shaken.",
      "links": "<a href='/AIV/2/22/25'>Ex. 22:25</a>; <a href='/AIV/19/112/6'>Ps. 112:6</a>",
      "comment": "The prohibition against lending at interest and taking bribes reflects a social justice rooted in love of neighbor (see Exod. 22:25). The promise that 'he will never be shaken' points to security in God for those who follow His statutes, ultimately realized in Christ, the unshakable cornerstone (Isa. 28:16; Eph. 2:20). In the tradition of the Church, these ethical demands also have a spiritual sense—calling believers to trust in God above earthly gain and to safeguard innocence and justice."
    }
  ],
  "translatedAt": "2025-12-23T05:35:16.390Z"
}