{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 104,
  "verses": [
    {
      "pk": 2504101,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 1,
      "text": "Bless the LORD, O my soul! O LORD my God, You are very great; You are clothed with honor and majesty,",
      "links": "<a href='/AIV/19/103/1'>Ps. 103:1</a>; <a href='/AIV/66/4/11'>Rev. 4:11</a>",
      "comment": "The psalmist begins with praise, recognizing God's splendor. The soul is called to worship, echoing Psalm 103:1. The majestic imagery can remind readers of the glory ascribed to God throughout Scripture (Revelation 4:11)."
    },
    {
      "pk": 2504102,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 2,
      "text": "covering Yourself with light as with a garment, stretching out the heavens like a curtain;",
      "links": "<a href='/AIV/01/1/3'>Gen. 1:3</a>; <a href='/AIV/23/40/22'>Isa. 40:22</a>",
      "comment": "God's light, seen as His very garment, points to His unapproachable holiness (cf. 1 Tim. 6:16). The image of stretching out the heavens alludes to Genesis creation and the sovereignty of God over all."
    },
    {
      "pk": 2504103,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 3,
      "text": "He lays the beams of His upper chambers on the waters; He makes the clouds His chariot; He walks on the wings of the wind;",
      "links": "<a href='/AIV/10/22/11'>2 Sam. 22:11</a>; <a href='/AIV/19/18/10'>Ps. 18:10</a>",
      "comment": "God is pictured as ruling from above, using the elements in His service. The heavens are His dwelling, and all of nature obeys Him, underlining His transcendence and immanence."
    },
    {
      "pk": 2504104,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 4,
      "text": "He makes His angels spirits, His ministers a flaming fire.",
      "links": "<a href='/AIV/58/1/7'>Heb. 1:7</a>; <a href='/AIV/19/148/8'>Ps. 148:8</a>",
      "comment": "Quoted in Hebrews 1:7 to show the superiority of Christ over angels. Angels are here described as instruments of God's will, both spiritual (wind) and powerful (fire). This points to the spiritual reality behind creation."
    },
    {
      "pk": 2504105,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 5,
      "text": "He established the earth on its foundations, so it should never be moved.",
      "links": "<a href='/AIV/19/93/1'>Ps. 93:1</a>; <a href='/AIV/20/8/29'>Prov. 8:29</a>",
      "comment": "God's creative power is displayed in the stability of the earth. The permanence of creation reveals God's faithfulness. Spiritually, this foundation echoes God's unchanging plan."
    },
    {
      "pk": 2504106,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 6,
      "text": "You covered it with the deep as with a garment; the waters stood above the mountains.",
      "links": "<a href='/AIV/01/1/2'>Gen. 1:2</a>; <a href='/AIV/01/7/19'>Gen. 7:19</a>",
      "comment": "This recalls the initial creation when water covered everything. It also echoes the flood narrative (Genesis 7:19), showing God's sovereignty over chaos and judgment."
    },
    {
      "pk": 2504107,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 7,
      "text": "At Your rebuke they fled; at the sound of Your thunder they hurried away.",
      "links": "<a href='/AIV/02/14/21'>Ex. 14:21</a>; <a href='/AIV/19/77/16'>Ps. 77:16-18</a>",
      "comment": "God commands the waters by His word. His authority over creation is total. This reflects the same power Christ used when calming the storm (Mark 4:39)."
    },
    {
      "pk": 2504108,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 8,
      "text": "The mountains rose, the valleys sank down to the place that You appointed for them.",
      "links": "<a href='/AIV/01/8/1'>Gen. 8:1</a>; <a href='/AIV/18/38/8-11'>Job 38:8-11</a>",
      "comment": "The forming of mountains and valleys shows God's order. His will shapes the world. There is both a literal and spiritual ordering in God's providence."
    },
    {
      "pk": 2504109,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 9,
      "text": "You set a boundary that they should not pass, so that they might not again cover the earth.",
      "links": "<a href='/AIV/01/9/11'>Gen. 9:11,15'>Gen. 9:15</a>",
      "comment": "God's covenant after the flood is implied. Boundaries show His mercy and promise regarding the stability of creation. The flood prefigures later rites of cleansing and renewal."
    },
    {
      "pk": 2504110,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 10,
      "text": "You make springs gush forth in the valleys; they flow between the hills;",
      "links": "<a href='/AIV/19/107/35'>Ps. 107:35</a>",
      "comment": "God provides for the earth's refreshment and sustenance. Springs are symbols of life and blessing, later used to refer to spiritual renewal (cf. John 4:14)."
    },
    {
      "pk": 2504111,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 11,
      "text": "They give drink to every beast of the field; the wild donkeys quench their thirst.",
      "links": "<a href='/AIV/18/38/41'>Job 38:41</a>",
      "comment": "God cares even for the wild animals. His providence extends to all creation, reflecting His compassion and order."
    },
    {
      "pk": 2504112,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 12,
      "text": "Beside them the birds of the heavens dwell; they sing among the branches.",
      "links": "<a href='/AIV/40/6/26'>Matt. 6:26</a>",
      "comment": "The imagery of birds thriving by God's provision is echoed by Jesus (Matthew 6:26), teaching trust in God's providence."
    },
    {
      "pk": 2504113,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 13,
      "text": "From Your lofty abode You water the mountains; the earth is satisfied with the fruit of Your work.",
      "links": "<a href='/AIV/05/11/11'>Deut. 11:11-12</a>",
      "comment": "God provides rain, sustaining all life. The fruitfulness of the earth testifies to God's ongoing care and blessing, much as the Eucharist is spiritual food flowing from heaven."
    },
    {
      "pk": 2504114,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 14,
      "text": "You cause the grass to grow for the livestock and plants for people to cultivate, that they may bring forth food from the earth",
      "links": "<a href='/AIV/01/1/29'>Gen. 1:29-30</a>",
      "comment": "All created things serve God's plan to sustain man and beast alike. Agriculture is a participation in God's provision and reflects stewardship over creation."
    },
    {
      "pk": 2504115,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 15,
      "text": "and wine to gladden the heart of man, oil to make his face shine, and bread to strengthen man's heart.",
      "links": "<a href='/AIV/07/9/13'>Judg. 9:13</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "Wine, oil, and bread are staples and play a role in sacred rituals. These gifts point beyond mere sustenance—food and drink used in worship and as symbols of joy, anointing, and communion."
    },
    {
      "pk": 2504116,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 16,
      "text": "The trees of the LORD are watered abundantly, the cedars of Lebanon that He planted.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "Even mighty trees depend on God's provision. Lebanon's cedars symbolized strength and constancy, qualities attributed to the faithful in the spiritual tradition."
    },
    {
      "pk": 2504117,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 17,
      "text": "In them the birds build their nests; the stork has her home in the fir trees.",
      "links": "<a href='/AIV/03/11/19'>Lev. 11:19</a>",
      "comment": "God's care is seen in His detailed provision for all creatures. Every part of creation, from great to small, finds its place in His plan."
    },
    {
      "pk": 2504118,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 18,
      "text": "The high mountains are for the wild goats; the rocks are a refuge for the rock badgers.",
      "links": "<a href='/AIV/20/30/26'>Prov. 30:26</a>",
      "comment": "Natural order reveals God's wisdom. The specific habitats for creatures highlight the diversity and intentional arrangement of creation."
    },
    {
      "pk": 2504119,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 19,
      "text": "He made the moon for the appointed times; the sun knows its going down.",
      "links": "<a href='/AIV/01/1/14'>Gen. 1:14-16</a>",
      "comment": "Moon and sun regulate time, recurring themes throughout Scripture (feasts, Sabbaths). This order prefigures the liturgical cycles given by God to His people."
    },
    {
      "pk": 2504120,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 20,
      "text": "You make darkness, and it is night, when all the beasts of the forest creep about.",
      "links": "<a href='/AIV/01/1/5'>Gen. 1:5</a>",
      "comment": "Darkness and night, regulated by God, give rhythm to life. The nocturnal cycle shows God's wisdom for both rest and activity."
    },
    {
      "pk": 2504121,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 21,
      "text": "The young lions roar for their prey, seeking their food from God.",
      "links": "<a href='/AIV/18/38/39-41'>Job 38:39-41</a>",
      "comment": "Even fierce creatures depend on God for their needs. Nothing in creation is independent from the Creator's care."
    },
    {
      "pk": 2504122,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 22,
      "text": "When the sun rises, they get away and lie down in their dens.",
      "links": "<a href='/AIV/19/50/10-11'>Ps. 50:10-11</a>",
      "comment": "The balance of activity and rest in creation is orchestrated by God, pointing to the divine wisdom in even the smallest rhythms of nature."
    },
    {
      "pk": 2504123,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 23,
      "text": "Man goes out to his work and to his labor until the evening.",
      "links": "<a href='/AIV/01/3/19'>Gen. 3:19</a>",
      "comment": "Human labor, while a consequence of the fall, is dignified and integrated into the created order. Work is thus seen as a means of participation in God's creative activity."
    },
    {
      "pk": 2504124,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 24,
      "text": "O LORD, how many are Your works! In wisdom You have made them all; the earth is full of Your creatures.",
      "links": "<a href='/AIV/20/3/19'>Prov. 3:19-20</a>",
      "comment": "God's creative wisdom is praised here. Creation's order reflects a deeper spiritual harmony, all things pointing back to the Creator."
    },
    {
      "pk": 2504125,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 25,
      "text": "Here is the sea, great and wide, which teems with countless living things, both small and large.",
      "links": "<a href='/AIV/01/1/20-21'>Gen. 1:20-21</a>",
      "comment": "The vastness and abundance of life in the sea serve as further testimony to God's creativity and power."
    },
    {
      "pk": 2504126,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 26,
      "text": "There go the ships, and Leviathan, which You formed to play in it.",
      "links": "<a href='/AIV/18/41/1'>Job 41:1</a>; <a href='/AIV/19/74/14'>Ps. 74:14</a>",
      "comment": "'Leviathan' points to a mysterious sea creature, representing both God's creative power and, in some traditions, the defeat of evil (Ps. 74:14)."
    },
    {
      "pk": 2504127,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 27,
      "text": "These all wait for You, to give them their food in due season.",
      "links": "<a href='/AIV/19/145/15'>Ps. 145:15-16</a>",
      "comment": "All creatures are dependent on God. This total reliance prefigures the Christian understanding of daily dependence on God's providence."
    },
    {
      "pk": 2504128,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 28,
      "text": "When You give it to them, they gather it up; when You open Your hand, they are filled with good things.",
      "links": "<a href='/AIV/19/145/16'>Ps. 145:16</a>",
      "comment": "All abundance comes from God's open hand. This mirrors Jesus' teaching on the Father's generosity (Matthew 7:11)."
    },
    {
      "pk": 2504129,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 29,
      "text": "When You hide Your face, they are dismayed; when You take away their breath, they die and return to their dust.",
      "links": "<a href='/AIV/01/3/19'>Gen. 3:19</a>; <a href='/AIV/19/30/7'>Ps. 30:7</a>",
      "comment": "Life is utterly in God's hands. Breath (spirit) is a key word here—God is the source of all life and existence; death is the return to dust, alluding to Genesis 3:19."
    },
    {
      "pk": 2504130,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 30,
      "text": "When You send forth Your Spirit, they are created, and You renew the face of the ground.",
      "links": "<a href='/AIV/01/2/7'>Gen. 2:7</a>; <a href='/AIV/26/37/6'>Ezek. 37:6,9</a>",
      "comment": "A reference to the Spirit's creative power, echoed at Pentecost (Acts 2:1-4) and the new birth in Christ. The renewing of the earth spiritually prefigures regeneration."
    },
    {
      "pk": 2504131,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 31,
      "text": "May the glory of the LORD endure forever; may the LORD rejoice in His works,",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "A prayer for God's glory to be eternal. His joy in creation points to God delighting in what He has made, paralleling the joy Christ promises in the new creation."
    },
    {
      "pk": 2504132,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 32,
      "text": "who looks on the earth and it trembles, who touches the mountains and they smoke!",
      "links": "<a href='/AIV/02/19/18'>Ex. 19:18</a>",
      "comment": "God's majesty is such that the earth trembles at His glance. This recalls events such as Sinai, where God's presence was accompanied by smoke and trembling."
    },
    {
      "pk": 2504133,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 33,
      "text": "I will sing to the LORD as long as I live; I will sing praise to my God while I have my being.",
      "links": "<a href='/AIV/19/146/2'>Ps. 146:2</a>",
      "comment": "A vow of lifelong praise. Worship is an enduring response to God's goodness—a theme throughout both Old and New Testaments."
    },
    {
      "pk": 2504134,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 34,
      "text": "May my meditation be pleasing to Him, for I rejoice in the LORD.",
      "links": "<a href='/AIV/19/19/14'>Ps. 19:14</a>",
      "comment": "The desire for one's thoughts to please God points to the inner life of devotion. Rejoicing in the Lord is a mark of spiritual maturity (cf. Philippians 4:4)."
    },
    {
      "pk": 2504135,
      "translation": "AIV",
      "book": 19,
      "chapter": 104,
      "verse": 35,
      "text": "Let sinners be consumed from the earth, and let the wicked be no more! Bless the LORD, O my soul! Praise the LORD!",
      "links": "<a href='/AIV/19/103/1'>Ps. 103:1</a>; <a href='/AIV/66/19/1'>Rev. 19:1-2</a>",
      "comment": "The removal of sin brings about the harmony of creation. The psalm closes where it began—with personal and communal praise. For Christians, the final purification of the world is realized through Christ, who overcomes sin and brings all creation into a renewed praise (Rev. 19:1-2)."
    }
  ],
  "translatedAt": "2025-12-23T05:38:46.238Z"
}