{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 57,
  "verses": [
    {
      "pk": 3015701,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 1,
      "text": "Be merciful to me, O God, be merciful to me, for my soul takes refuge in You; and in the shadow of Your wings I will take shelter until the trouble has passed by.",
      "links": "<a href='/AIV/19/17/8'>Ps. 17:8</a>; <a href='/AIV/19/36/7'>Ps. 36:7</a>; <a href='/AIV/19/91/4'>Ps. 91:4</a>",
      "comment": "The metaphor of seeking refuge under God's wings is a recurrent theme throughout the Psalms, pointing to His nurturing protection. Some Church Fathers saw in this a symbol for Mary's maternal protection given to the Church by Christ, prefiguring Catholic thought on the intercession of the saints."
    },
    {
      "pk": 3015702,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 2,
      "text": "I cry out to God Most High, to God who accomplishes all things for me.",
      "links": "<a href='/AIV/19/56/9'>Ps. 56:9</a>; <a href='/AIV/19/138/8'>Ps. 138:8</a>",
      "comment": "God Most High is a title emphasizing God's sovereignty. The phrase 'who accomplishes all things for me' echoes a confidence in Divine Providence—akin to the Catholic understanding of God working in both visible and hidden ways, often through sacraments and means not always apparent to human eyes."
    },
    {
      "pk": 3015703,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 3,
      "text": "He will send from heaven and save me; He rebukes the one who tramples on me. God will send out His steadfast love and His faithfulness.",
      "links": "<a href='/AIV/19/18/16'>Ps. 18:16</a>; <a href='/AIV/19/61/7'>Ps. 61:7</a>; <a href='/AIV/19/36/5'>Ps. 36:5</a>",
      "comment": "'Steadfast love and faithfulness' (Hebrew: hesed and emet) are key covenant terms, forming the bedrock of God's promises—fulfilled in Christ (see <a href='/AIV/43/1/14'>John 1:14</a>) whose incarnation unites divine mercy and faithfulness. This recalls the Catholic understanding of covenants fulfilled through the mediation of Christ and His Church."
    },
    {
      "pk": 3015704,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 4,
      "text": "My soul is in the midst of lions; I lie among those who devour—men whose teeth are spears and arrows, whose tongues are sharp swords.",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/57/6'>Ps. 57:6</a>; <a href='/AIV/19/120/4'>Ps. 120:4</a>",
      "comment": "Imagery of wild beasts and weapons represents the threats faced by the righteous. Like Christ surrounded by enemies (<a href='/AIV/19/22/13-16'>Ps. 22:13–16</a>), the psalmist experiences suffering as redemptive—an idea resonating with the Catholic emphasis on suffering united to Christ's Passion."
    },
    {
      "pk": 3015705,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 5,
      "text": "Be exalted, O God, above the heavens! Let Your glory be over all the earth!",
      "links": "<a href='/AIV/19/108/5'>Ps. 108:5</a>; <a href='/AIV/19/8/1'>Ps. 8:1</a>",
      "comment": "This refrain repeats in verse 11 (a liturgical structure), foreshadowing the universality of God's kingship—proclaimed in the Mass as 'Glory to God in the highest,' reflecting Catholic liturgical continuity."
    },
    {
      "pk": 3015706,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 6,
      "text": "They spread a net for my steps; my soul was bowed down. They dug a pit before me, but they have fallen into it themselves.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/19/9/15'>Ps. 9:15</a>",
      "comment": "God's justice often turns the plots of the wicked back on themselves. This reflects the theme of divine retribution, but also Christ's teaching to trust in God's vindication rather than personal vengeance."
    },
    {
      "pk": 3015707,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 7,
      "text": "My heart is steadfast, O God, my heart is steadfast! I will sing and make melody.",
      "links": "<a href='/AIV/19/16/9'>Ps. 16:9</a>; <a href='/AIV/19/108/1'>Ps. 108:1</a>",
      "comment": "'Steadfast' implies unwavering faith. The repetition intensifies the psalmist's resolve. Singing praise reflects the importance of worship and liturgy for spiritual endurance—a central Catholic notion."
    },
    {
      "pk": 3015708,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 8,
      "text": "Awake, my glory! Awake, harp and lyre! I will awaken the dawn.",
      "links": "<a href='/AIV/19/108/2'>Ps. 108:2</a>; <a href='/AIV/19/30/12'>Ps. 30:12</a>",
      "comment": "The reference to 'glory' signifies the soul or inmost self. Use of music in worship is highlighted, anticipating the later Catholic encouragement of beauty and the arts in liturgy."
    },
    {
      "pk": 3015709,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 9,
      "text": "I will give thanks to You, O Lord, among the peoples; I will sing praises to You among the nations.",
      "links": "<a href='/AIV/19/18/49'>Ps. 18:49</a>; <a href='/AIV/19/117/1'>Ps. 117:1</a>",
      "comment": "The psalmist anticipates that God's praise will reach the Gentiles. Paul cites this in <a href='/AIV/45/15/9'>Romans 15:9</a> as fulfilled in Christ, underscoring the Church's mission to the whole world—a key Catholic principle."
    },
    {
      "pk": 3015710,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 10,
      "text": "For Your steadfast love is great up to the heavens, Your faithfulness to the clouds.",
      "links": "<a href='/AIV/19/36/5'>Ps. 36:5</a>; <a href='/AIV/19/103/11'>Ps. 103:11</a>",
      "comment": "'Steadfast love' (hesed) and 'faithfulness' (emet) are repeated from verse 3, poetically emphasizing God's boundless mercy—a quality Catholics seek to emulate in devotion to the Sacred Heart of Jesus."
    },
    {
      "pk": 3015711,
      "translation": "AIV",
      "book": 19,
      "chapter": 57,
      "verse": 11,
      "text": "Be exalted, O God, above the heavens! Let Your glory be over all the earth!",
      "links": "<a href='/AIV/19/57/5'>Ps. 57:5</a>; <a href='/AIV/19/113/4'>Ps. 113:4</a>",
      "comment": "The bookend refrain points to the liturgical nature of the psalm—much like Catholic worship, the repetitive invocations draw the soul heavenward, culminating in a universal call to glorify God."
    }
  ],
  "translatedAt": "2025-12-22T21:37:54.283Z"
}