{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 5,
  "verses": [
    {
      "pk": 2000051,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 1,
      "text": "Give ear to my words, O LORD; consider my groaning.",
      "links": "<a href='/AIV/19/4/1'>Ps. 4:1</a>; <a href='/AIV/18/16/20'>Job 16:20</a>",
      "comment": "The psalmist appeals to God's attentive listening, showing intimate prayer. The word 'groaning' may refer to both words and unspoken prayers, much like the tradition of meditative prayer found in the Psalms and Church practice (cf. Romans 8:26)."
    },
    {
      "pk": 2000052,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 2,
      "text": "Listen to the sound of my cry, my King and my God, for to you I pray.",
      "links": "<a href='/AIV/19/84/3'>Ps. 84:3</a>; <a href='/AIV/19/3/4'>Ps. 3:4</a>",
      "comment": "David addresses the LORD as both King and God, foreshadowing Christ the King (John 18:37). The personal appeal reflects a close, ongoing relationship with God, fundamental in both Catholic and broader Christian prayer traditions."
    },
    {
      "pk": 2000053,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 3,
      "text": "O LORD, in the morning you hear my voice; in the morning I prepare a sacrifice for you and watch.",
      "links": "<a href='/AIV/19/130/6'>Ps. 130:6</a>; <a href='/AIV/19/55/17'>Ps. 55:17</a>",
      "comment": "The reference to 'prepare a sacrifice' (some manuscripts: 'lay my request before you') subtly alludes to liturgical worship and the importance of daily prayer, reminiscent of the Catholic tradition of the Liturgy of the Hours."
    },
    {
      "pk": 2000054,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 4,
      "text": "For you are not a God who delights in wickedness; evil may not dwell with you.",
      "links": "<a href='/AIV/19/34/16'>Ps. 34:16</a>; <a href='/AIV/35/1/13'>Hab. 1:13</a>",
      "comment": "This statement underlines God's holiness and absolute separation from sin, highlighting the need for repentance and purification before approaching God—a theme that resonates with the sacramental life of confession."
    },
    {
      "pk": 2000055,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 5,
      "text": "The boastful will not stand before your eyes; you hate all workers of iniquity.",
      "links": "<a href='/AIV/19/1/5'>Ps. 1:5</a>; <a href='/AIV/19/101/7'>Ps. 101:7</a>",
      "comment": "God's justice is highlighted: those persisting in pride and sin cannot endure in His presence. This points forward to the final judgment (Matthew 25:31–46), and the call to humility through grace."
    },
    {
      "pk": 2000056,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 6,
      "text": "You destroy those who speak lies; the LORD abhors the bloodthirsty and deceitful man.",
      "links": "<a href='/AIV/19/55/23'>Ps. 55:23</a>; <a href='/AIV/19/43/1'>Ps. 43:1</a>",
      "comment": "God's active opposition against evil is evident. The destruction of liars and violent men reflects His divine justice, which, in catholic thought, coexists with His mercy (cf. Luke 1:50)."
    },
    {
      "pk": 2000057,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 7,
      "text": "But I, through the abundance of your steadfast love, will enter your house; I will bow down toward your holy temple in fear of you.",
      "links": "<a href='/AIV/19/26/8'>Ps. 26:8</a>; <a href='/AIV/19/138/2'>Ps. 138:2</a>",
      "comment": "Entrance to God's house is by divine mercy, not human merit. 'House' and 'temple' evoke the Church as the dwelling place of God (Ephesians 2:19-22)—an implicit encouragement for worship within the visible Church."
    },
    {
      "pk": 2000058,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 8,
      "text": "Lead me, O LORD, in your righteousness because of my enemies; make your way straight before me.",
      "links": "<a href='/AIV/19/27/11'>Ps. 27:11</a>; <a href='/AIV/19/143/10'>Ps. 143:10</a>",
      "comment": "Divine guidance is pleaded for in the face of opposition, an image fulfilled in Christ's promise to guide the Church into all truth (John 16:13)."
    },
    {
      "pk": 2000059,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 9,
      "text": "For there is no truth in their mouth; their inmost self is destruction; their throat is an open grave; they flatter with their tongue.",
      "links": "<a href='/AIV/45/3/13'>Romans 3:13</a>; <a href='/AIV/19/52/2'>Ps. 52:2</a>",
      "comment": "Paul quotes this verse in Romans 3:13 to show universal human sinfulness and the need for a Savior. The Catholic understanding underscores original sin and the necessity of grace and sacramental life."
    },
    {
      "pk": 2000060,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 10,
      "text": "Declare them guilty, O God; let them fall by their own counsels; because of their many transgressions cast them out, for they have rebelled against you.",
      "links": "<a href='/AIV/19/7/13'>Ps. 7:13</a>; <a href='/AIV/19/9/16'>Ps. 9:16</a>",
      "comment": "A request for divine justice, which anticipates the distinction between justice and mercy found in Catholic moral teaching and the tradition of intercessory prayer for the lost."
    },
    {
      "pk": 2000061,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 11,
      "text": "But let all who take refuge in you rejoice; let them ever sing for joy, and spread your protection over them, that those who love your name may exult in you.",
      "links": "<a href='/AIV/19/2/12'>Ps. 2:12</a>; <a href='/AIV/19/40/16'>Ps. 40:16</a>",
      "comment": "God’s protective care leads to joy for those who seek Him. Catholic spirituality emphasizes joy in the Lord, experienced especially in the sacraments, where God’s refuge is tangibly present."
    },
    {
      "pk": 2000062,
      "translation": "AIV",
      "book": 19,
      "chapter": 5,
      "verse": 12,
      "text": "For you bless the righteous, O LORD; you cover him with favor as with a shield.",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/19/30/7'>Ps. 30:7</a>",
      "comment": "Divine blessing and favor are given to the just. In Catholic theology, grace (favor) is mediated through the Church, and the Old Testament language here foreshadows the blessings received in Christ, especially through the sacramental life."
    }
  ],
  "translatedAt": "2025-12-22T21:22:01.724Z"
}