{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 122,
  "verses": [
    {
      "pk": 2231201,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 1,
      "text": "I was glad when they said to me, 'Let us go to the house of the LORD!'",
      "links": "<a href='/AIV/2/23/17'>Exodus 23:17</a>; <a href='/AIV/19/27/4'>Psalm 27:4</a>",
      "comment": "The reference to the 'house of the LORD' reflects the importance of worshipping in God's designated place with the people of God. See also Psalm 27:4 for a similar desire. The joy in communal worship prefigures the gathering of God's people in unity, anticipating the ultimate fulfillment in Christ, who is the true Temple (John 2:19-21)."
    },
    {
      "pk": 2231202,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 2,
      "text": "Our feet are standing within your gates, O Jerusalem.",
      "links": "<a href='/AIV/19/48/12'>Psalm 48:12</a>; <a href='/AIV/19/87/2'>Psalm 87:2</a>",
      "comment": "The entrance into Jerusalem signifies arrival at the place of God's presence. For the faithful, this points both to the historical city and its spiritual meaning: the Church as the new Jerusalem (Hebrews 12:22)."
    },
    {
      "pk": 2231203,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 3,
      "text": "Jerusalem, built as a city that is firmly joined together,",
      "links": "<a href='/AIV/19/48/2'>Psalm 48:2</a>; <a href='/AIV/19/147/2'>Psalm 147:2</a>",
      "comment": "Jerusalem's unity serves as a type of the spiritual unity that God desires among His people, foreshadowing the unity Christ prayed for (John 17:21). This justifies the importance of visible, structured unity in worship and faith."
    },
    {
      "pk": 2231204,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 4,
      "text": "to which the tribes go up, the tribes of the LORD, as a decree for Israel, to give thanks to the name of the LORD.",
      "links": "<a href='/AIV/5/16/16'>Deuteronomy 16:16</a>; <a href='/AIV/19/100/4'>Psalm 100:4</a>",
      "comment": "This verse highlights the mandated pilgrimages (see Deut 16:16), underscoring the expectation of embodied, corporate worship. The practice of giving thanks as a united body foreshadows the eternal worship of God by all nations."
    },
    {
      "pk": 2231205,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 5,
      "text": "For there the thrones of judgment were set, the thrones of the house of David.",
      "links": "<a href='/AIV/10/8/15'>2 Samuel 8:15</a>; <a href='/AIV/19/89/14'>Psalm 89:14</a>",
      "comment": "Jerusalem was the location of both worship and just judgment. The king's throne being there signifies a divinely appointed authority, fulfilled most perfectly in Christ, the Son of David, who reigns in justice (Luke 1:32-33)."
    },
    {
      "pk": 2231206,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 6,
      "text": "Pray for the peace of Jerusalem! 'May those who love you be secure.'",
      "links": "<a href='/AIV/19/51/18'>Psalm 51:18</a>; <a href='/AIV/23/66/10'>Isaiah 66:10</a>",
      "comment": "The call to pray for Jerusalem's peace highlights the connection between prayer and blessing upon God's people. Spiritually, this is an urging to pray for the well-being and unity of the Church and all believers."
    },
    {
      "pk": 2231207,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 7,
      "text": "May peace be within your walls and security within your citadels.",
      "links": "<a href='/AIV/19/48/13'>Psalm 48:13</a>",
      "comment": "While originally referring to physical Jerusalem, this blessing for peace and security is interpreted by many as pointing also to a spiritual peace found in God's family, which Christ alone can give (John 14:27)."
    },
    {
      "pk": 2231208,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 8,
      "text": "For the sake of my brothers and friends, I will say, 'Peace be within you.'",
      "links": "<a href='/AIV/19/122/6'>Psalm 122:6</a>; <a href='/AIV/19/133/1'>Psalm 133:1</a>",
      "comment": "The psalmist's concern for others' well-being reinforces the communal nature of faith—our concern for peace is not only personal but also for the whole community of believers."
    },
    {
      "pk": 2231209,
      "translation": "AIV",
      "book": 19,
      "chapter": 122,
      "verse": 9,
      "text": "For the sake of the house of the LORD our God, I will seek your good.",
      "links": "<a href='/AIV/19/84/10'>Psalm 84:10</a>; <a href='/AIV/19/26/8'>Psalm 26:8</a>",
      "comment": "The psalm closes by connecting love for Jerusalem with devotion to God Himself. The welfare of God's city—and the place where He is worshipped—is tied to seeking God's will and good for His people, a principle handed down through the ages and fulfilled in the Church that Christ established (Matthew 16:18)."
    }
  ],
  "translatedAt": "2025-12-23T05:46:20.635Z"
}