{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 7,
  "verses": [
    {
      "pk": 1907001,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 1,
      "text": "O LORD my God, in You I take refuge; save me from all who pursue me and deliver me,",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/19/31/1'>Ps. 31:1</a>",
      "comment": "The Psalmist appeals directly to God as his refuge, expressing personal reliance and trust. The phrase 'save me' echoes salvation language common throughout Scripture, which under Catholic understanding, begins in this life and is perfected through grace and sacraments."
    },
    {
      "pk": 1907002,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 2,
      "text": "lest they tear me apart like a lion, dragging me away with no one to rescue.",
      "links": "<a href='/AIV/19/22/13'>Ps. 22:13</a>; <a href='/AIV/19/57/4'>Ps. 57:4</a>",
      "comment": "The imagery of a hostile enemy as a lion is used elsewhere, notably foreshadowing Christ's suffering (see Ps. 22:13). The need for a rescuer resonates with Catholic teaching about mediators and the unique role of Christ and, by implication, His Church and saints as intercessors."
    },
    {
      "pk": 1907003,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 3,
      "text": "O LORD my God, if I have done this, if there is injustice on my hands,",
      "links": "<a href='/AIV/18/22/5'>Job 22:5</a>; <a href='/AIV/19/26/1-2'>Ps. 26:1-2</a>",
      "comment": "The psalmist calls for examination of conscience—integral to Catholic life and sacramental confession. This admission seeks truth in self-examination before God, paralleling the penitential prayers and the preparation for reconciliation."
    },
    {
      "pk": 1907004,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 4,
      "text": "if I have repaid evil to anyone at peace with me, or have plundered my adversary without cause,",
      "links": "<a href='/AIV/19/35/13-14'>Ps. 35:13-14</a>; <a href='/AIV/20/17/13'>Prov. 17:13</a>",
      "comment": "Refers to restitution and justice, which Catholic tradition emphasizes as part of true repentance. Physical actions must align with contrite heart, reminiscent of the necessity of penance and making amends prescribed by the Church."
    },
    {
      "pk": 1907005,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 5,
      "text": "then let my enemy pursue and overtake me; let him trample my life to the ground and lay my honor in the dust. Selah.",
      "links": "<a href='/AIV/19/41/11'>Ps. 41:11</a>; <a href='/AIV/19/44/25'>Ps. 44:25</a>",
      "comment": "The willingness to accept consequences if guilty bears resemblance to Catholic acceptance of penance and humility before God. 'Selah' suggests pausing for contemplation, similar to the reflective attitude encouraged before confession."
    },
    {
      "pk": 1907006,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 6,
      "text": "Arise, O LORD, in Your anger; lift Yourself up against the rage of my enemies. Awaken for me the judgment You have commanded.",
      "links": "<a href='/AIV/19/3/7'>Ps. 3:7</a>; <a href='/AIV/19/35/23'>Ps. 35:23</a>",
      "comment": "David calls upon God's justice. The language evokes the Last Judgment, a core Catholic teaching, highlighting both God's justice and mercy. Judgment is a matter of both temporal justice and eternal consequence."
    },
    {
      "pk": 1907007,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 7,
      "text": "Let the assembly of peoples surround You; and over them return on high.",
      "links": "<a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/19/68/33'>Ps. 68:33</a>",
      "comment": "The 'assembly of peoples' hints at God's universal kingship and the gathering of worshippers, suggestive of the Catholic view of the universal Church assembled around the altar, participating in heavenly worship."
    },
    {
      "pk": 1907008,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 8,
      "text": "The LORD will judge the peoples; judge me, O LORD, according to my righteousness and according to the integrity that is in me.",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/19/18/20'>Ps. 18:20</a>",
      "comment": "Judgment by God is affirmed. The Catholic tradition stresses both faith and works ('righteousness'), not mere imputed righteousness. Integrity here implies authentic holiness, not just outward observance."
    },
    {
      "pk": 1907009,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 9,
      "text": "Oh, let the evil of the wicked cease, and may You establish the righteous—You who try the hearts and minds, O righteous God.",
      "links": "<a href='/AIV/19/11/4'>Ps. 11:4</a>; <a href='/AIV/19/139/23'>Ps. 139:23</a>",
      "comment": "God's intimate knowledge of human thoughts and desires forms the basis for spiritual direction, examination of conscience, and the transformative grace found in the sacraments."
    },
    {
      "pk": 1907010,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 10,
      "text": "My shield is with God, who saves the upright in heart.",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/19/18/30'>Ps. 18:30</a>",
      "comment": "The image of God as shield is recurrent, evoking sacramental protection, especially through the Eucharist and confession, notably taught in Catholic catechesis as spiritual armor."
    },
    {
      "pk": 1907011,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 11,
      "text": "God is a righteous judge, and a God who has indignation every day.",
      "links": "<a href='/AIV/19/5/4'>Ps. 5:4</a>; <a href='/AIV/19/50/6'>Ps. 50:6</a>",
      "comment": "Affirms God's continuous judgment. Catholic doctrine teaches God’s justice and mercy are unceasing, and His indignation against sin motivates the call to repentance and seeking forgiveness through the Church."
    },
    {
      "pk": 1907012,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 12,
      "text": "If a man does not repent, God will sharpen His sword; He has bent His bow and made it ready.",
      "links": "<a href='/AIV/19/11/2'>Ps. 11:2</a>; <a href='/AIV/19/64/3'>Ps. 64:3</a>",
      "comment": "Repentance is essential, exactly as emphasized by the Catholic sacrament of reconciliation, which alone avails against divine justice. The imagery warns of real consequences for unrepented sin."
    },
    {
      "pk": 1907013,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 13,
      "text": "He has prepared His deadly instruments; He makes His arrows fiery shafts.",
      "links": "<a href='/AIV/19/21/12'>Ps. 21:12</a>; <a href='/AIV/19/38/2'>Ps. 38:2</a>",
      "comment": "God's active preparation against the wicked highlights both justice and retribution, a feature present within Catholic eschatology regarding the reality of hell and purgatory."
    },
    {
      "pk": 1907014,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 14,
      "text": "Behold, the wicked is pregnant with evil, conceives trouble, and gives birth to deceit.",
      "links": "<a href='/AIV/19/36/2-4'>Ps. 36:2-4</a>; <a href='/AIV/59/1/15'>James 1:15</a>",
      "comment": "The birth imagery suggesting a process of evil is paralleled in James 1:15. Catholics view sin as personal and communal, often passed on and always in need of healing through sacramental grace."
    },
    {
      "pk": 1907015,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 15,
      "text": "He digs a pit and makes it deep, and falls into the trap he made.",
      "links": "<a href='/AIV/19/9/15'>Ps. 9:15</a>; <a href='/AIV/20/26/27'>Prov. 26:27</a>",
      "comment": "Classic biblical justice: evil rebounds on its perpetrator. Through Catholic tradition, this image is also interpreted as the effect of sin leading to spiritual death unless rescued by grace."
    },
    {
      "pk": 1907016,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 16,
      "text": "His trouble returns upon his own head, and his violence comes down on his own scalp.",
      "links": "<a href='/AIV/19/94/23'>Ps. 94:23</a>; <a href='/AIV/20/5/22'>Prov. 5:22'</a>",
      "comment": "Reinforces the theme of divine retribution. Catholic teaching links this to the concept of temporal and eternal consequences for sin, motivating continuous conversion and reliance on sacramental grace."
    },
    {
      "pk": 1907017,
      "translation": "AIV",
      "book": 19,
      "chapter": 7,
      "verse": 17,
      "text": "I will give thanks to the LORD for His righteousness; I will sing praise to the name of the LORD Most High.",
      "links": "<a href='/AIV/19/9/2'>Ps. 9:2</a>; <a href='/AIV/19/47/6'>Ps. 47:6</a>",
      "comment": "Praise is the climax, central to Catholic liturgy and worship. Singing thanks and praise corresponds to the Catholic emphasis on the Mass as the highest form of worship—celebrating God's justice and love, anticipating the gathering of all Christians into one visible Church."
    }
  ],
  "translatedAt": "2025-12-22T21:22:35.009Z"
}