{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 8,
  "verses": [
    {
      "pk": 23008001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 1,
      "text": "O LORD, our Lord, how majestic is Your Name in all the earth! You have set Your glory above the heavens.",
      "links": "<a href='/AIV/19/113/4'>Ps. 113:4</a>; <a href='/AIV/19/148/13'>Ps. 148:13</a>",
      "comment": "The repetition of 'LORD' and 'our Lord' points to God's universal kingship, both transcendent and personal. The phrase 'Your glory above the heavens' emphasizes His supreme majesty. Echoes of creation praise (see Ps. 113:4, Ps. 148:13). This verse opens with a declaration of worship, linking the glory of God's name to His creative authority—an image later revealed in the person of Christ (see John 17:6)."
    },
    {
      "pk": 23008002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 2,
      "text": "From the mouths of infants and nursing babies You have established strength, because of Your foes, to silence the enemy and the avenger.",
      "links": "<a href='/AIV/40/21/16'>Matt. 21:16</a>; <a href='/AIV/19/118/14'>Ps. 118:14</a>",
      "comment": "This verse shows God's power through weakness—the praise of children confounds the enemy. Quoted by Jesus in Matt. 21:16, indicating a deeper fulfillment in Christ. The reference to praise from the humble reveals the spiritual principle that God works through unexpected vessels, foreshadowing His plan of salvation through humility and obedience."
    },
    {
      "pk": 23008003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 3,
      "text": "When I look at Your heavens, the work of Your fingers, the moon and the stars, which You have set in place:",
      "links": "<a href='/AIV/19/19/1'>Ps. 19:1</a>; <a href='/AIV/18/26/7'>Job 26:7</a>",
      "comment": "Here, the psalmist ponders God's creation, implying intimate craftsmanship ('fingers'). This phrase emphasizes both God's transcendence and His attentive care. Cross-reference Psalm 19:1 for the heavens declaring God's glory—a theme later understood by Christians as pointing to divine order and wisdom."
    },
    {
      "pk": 23008004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 4,
      "text": "What is man that You are mindful of him, and the son of man that You care for him?",
      "links": "<a href='/AIV/58/2/6'>Heb. 2:6</a>; <a href='/AIV/19/144/3'>Ps. 144:3</a>",
      "comment": "This verse marvels at human insignificance compared to creation. Quoted in Hebrews 2:6, applying it to Christ as the true 'Son of Man.' The phrase hints at both literal humanity and a deeper spiritual truth—God's concern for mankind is ultimately revealed through the Incarnation (see Heb. 2:6–9)."
    },
    {
      "pk": 23008005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 5,
      "text": "You made him a little lower than the heavenly beings, and crowned him with glory and honor.",
      "links": "<a href='/AIV/19/21/5'>Ps. 21:5</a>; <a href='/AIV/58/2/7'>Heb. 2:7</a>",
      "comment": "Traditionally translated 'angels,' but rendered here as 'heavenly beings' (Hebrew: 'Elohim'). The verse affirms mankind's elevated position as steward of creation, crowned with dignity. In Hebrews 2, this is interpreted with reference to Christ's exaltation after humility, establishing a pattern of suffering and future glorification. Both literal rule and spiritual exaltation are in view."
    },
    {
      "pk": 23008006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 6,
      "text": "You made him ruler over the works of Your hands; You put all things under his feet:",
      "links": "<a href='/AIV/19/104/24'>Ps. 104:24</a>; <a href='/AIV/46/15/27'>1 Cor. 15:27</a>",
      "comment": "Echoes Genesis 1:26–28, mankind's dominion over creation. Paul cites this in 1 Corinthians 15:27, applying the phrase 'under his feet' to Christ's cosmic rule. The dual sense: man's stewardship and Christ’s ultimate lordship. This verse is a subtle nod to the structure of spiritual authority and order in God’s design."
    },
    {
      "pk": 23008007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 7,
      "text": "All sheep and oxen, and also the beasts of the field,",
      "links": "<a href='/AIV/19/50/10'>Ps. 50:10</a>; <a href='/AIV/01/1/24'>Gen. 1:24</a>",
      "comment": "Lists the created order under human authority—domestic animals and wild creatures. Reinforces stewardship, blending practical care with spiritual responsibility. The enumeration reflects the created hierarchy, suggesting a divinely instituted order."
    },
    {
      "pk": 23008008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 8,
      "text": "the birds of the heavens, and the fish of the sea, whatever passes along the paths of the seas.",
      "links": "<a href='/AIV/01/1/26'>Gen. 1:26</a>; <a href='/AIV/19/104/25'>Ps. 104:25</a>",
      "comment": "Completes the picture of creation under man's charge, showing the extent of dominion. In spiritual interpretation, this points towards universal stewardship and, typologically, to Christ’s comprehensive authority over all realms, including those 'passing through the seas.'"
    },
    {
      "pk": 23008009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 8,
      "verse": 9,
      "text": "O LORD, our Lord, how majestic is Your Name in all the earth!",
      "links": "<a href='/AIV/19/8/1'>Ps. 8:1</a>; <a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "This concluding refrain recapitulates verse 1, uniting the psalm in worship. Repeated praise emphasizes God’s glory and the everlasting nature of His Name. Its cyclical structure echoes the liturgical rhythm in worship, which historically points to a continual offering of praise—a sign of the unity of creation and worship as one."
    }
  ],
  "translatedAt": "2025-12-24T06:01:07.383Z"
}