{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 117,
  "verses": [
    {
      "pk": 301171,
      "translation": "AIV",
      "book": 19,
      "chapter": 117,
      "verse": 1,
      "text": "Praise the LORD, all you nations! Extol him, all you peoples!",
      "links": "<a href='/AIV/19/66/4'>Ps. 66:4</a>; <a href='/AIV/19/100/1'>Ps. 100:1</a>; <a href='/AIV/45/15/11'>Rom. 15:11</a>",
      "comment": "This verse is a universal call to worship, inviting all nations and peoples to praise the LORD. Notably, Paul cites this verse in Romans 15:11 to emphasize the inclusion of the Gentiles in God’s salvation plan. The praise is directed to the LORD (Yahweh), highlighting divine sovereignty over all mankind, which finds spiritual fulfillment in Christ’s command to make disciples of all nations (<a href='/AIV/40/28/19'>Matt. 28:19</a>). This broad invitation reflects an understanding of the unity of God’s people across the world—a theme important for understanding the church as a worldwide family, gathered in worship and praise."
    },
    {
      "pk": 301172,
      "translation": "AIV",
      "book": 19,
      "chapter": 117,
      "verse": 2,
      "text": "For his steadfast love toward us is mighty, and the faithfulness of the LORD endures forever. Praise the LORD!",
      "links": "<a href='/AIV/19/100/5'>Ps. 100:5</a>; <a href='/AIV/19/106/1'>Ps. 106:1</a>; <a href='/AIV/19/118/1'>Ps. 118:1</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "God’s steadfast love (Hebrew: ‘hesed’) and enduring truth form the foundation for praise. The unbreakable commitment of the LORD to his people is expressed here, with language that echoes God’s covenant faithfulness throughout the Old Testament (<a href='/AIV/19/100/5'>Ps. 100:5</a>) and finds ultimate fulfillment in the life, death, and resurrection of Jesus Christ (<a href='/AIV/43/3/16'>John 3:16</a>). The call to praise is thus both literal and spiritual: believers are drawn into the mystery of God’s enduring love, which is fully revealed in Christ and continued through the worshipping community. The repeated exhortation to praise the LORD underscores a liturgical response—a perpetual praise that unites believers in both time and eternity."
    }
  ],
  "translatedAt": "2025-12-23T05:43:29.055Z"
}