{
  "book": 23,
  "bookName": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 98,
  "verses": [
    {
      "pk": 23098001,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 1,
      "text": "Sing to the LORD a new song, for he has done marvelous things; his right hand and his holy arm have brought him victory.",
      "links": "<a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/02/15/6'>Ex. 15:6</a>; <a href='/AIV/23/52/10'>Isa. 52:10</a>",
      "comment": "The command to sing a new song often signals a new act of salvation or deliverance by God, anticipating the coming of the Messiah. The reference to the 'right hand' and 'holy arm' symbolizes God's power; see also Isaiah 52:10, where God's arm uncovers salvation for all nations. Christians interpret these images as pointing to Jesus, whose victory over sin is the ultimate marvel (Col. 2:15)."
    },
    {
      "pk": 23098002,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 2,
      "text": "The LORD has made known his salvation; he has revealed his righteousness in the sight of the nations.",
      "links": "<a href='/AIV/23/56/1'>Isa. 56:1</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "God's salvation becomes public for all nations, echoing the themes of universality in the prophets and later in the mission of Jesus (Luke 2:32). The righteousness of God is not concealed but manifest, both in the history of Israel and in the saving work of Christ."
    },
    {
      "pk": 23098003,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 3,
      "text": "He has remembered his steadfast love and faithfulness to the house of Israel; all the ends of the earth have seen the salvation of our God.",
      "links": "<a href='/AIV/01/22/18'>Gen. 22:18</a>; <a href='/AIV/19/96/3'>Ps. 96:3</a>; <a href='/AIV/42/2/32'>Luke 2:32</a>",
      "comment": "The steadfast love ('hesed') and faithfulness God shows to Israel are the foundation of his covenant, seen fulfilled ultimately in Christ (Luke 1:72). The view to 'all the ends of the earth' hints at the worldwide scope of salvation (Acts 13:47), supporting a vision for unity of all peoples in faith."
    },
    {
      "pk": 23098004,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 4,
      "text": "Shout for joy to the LORD, all the earth; break forth, rejoice, and sing praises!",
      "links": "<a href='/AIV/19/66/1'>Ps. 66:1</a>; <a href='/AIV/19/100/1'>Ps. 100:1</a>",
      "comment": "The joyful command extends to all people, inviting universal worship. The phrase 'break forth' suggests the fullness of praise, resembling the celebration seen in worship liturgy with music and song."
    },
    {
      "pk": 23098005,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 5,
      "text": "Sing praises to the LORD with the lyre, with the lyre and the sound of melody!",
      "links": "<a href='/AIV/19/33/2'>Ps. 33:2</a>; <a href='/AIV/19/92/3'>Ps. 92:3</a>",
      "comment": "Musical instruments are not only aids to worship but express the holiness of praise. The call for melody and instruments prefigures the ongoing tradition of sacred music, emphasizing reverence and beauty in worship."
    },
    {
      "pk": 23098006,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 6,
      "text": "With trumpets and the sound of the horn, shout joyfully before the King, the LORD!",
      "links": "<a href='/AIV/19/47/5'>Ps. 47:5</a>; <a href='/AIV/19/95/3'>Ps. 95:3</a>",
      "comment": "Trumpets and horns were used in ancient Israel to celebrate God's kingship and presence. Calling the LORD 'King' affirms his sovereign rule over all, anticipating the fulfillment in Christ the King (John 18:37; Rev. 19:16)."
    },
    {
      "pk": 23098007,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 7,
      "text": "Let the sea roar, and all that fills it; the world and those who dwell in it!",
      "links": "<a href='/AIV/19/96/11'>Ps. 96:11</a>; <a href='/AIV/19/93/3-4'>Ps. 93:3-4</a>",
      "comment": "Creation itself is summoned to praise, showing the cosmos ordered towards worship. The sea and all living things respond to the Creator's redemption, yoking natural order with spiritual praise."
    },
    {
      "pk": 23098008,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 8,
      "text": "Let the rivers clap their hands; let the hills sing together for joy",
      "links": "<a href='/AIV/23/55/12'>Isa. 55:12</a>; <a href='/AIV/19/65/12-13'>Ps. 65:12-13</a>",
      "comment": "Rivers clapping and hills singing portray the harmony of creation under God's reign, symbolizing the peace and joy brought through redemption. Nature joins in the liturgical chorus, a foreshadowing of the renewal of all things."
    },
    {
      "pk": 23098009,
      "translation": "AIV",
      "book": 23,
      "bookName": "Psalms",
      "bookAbbreviation": "Ps",
      "chapter": 98,
      "verse": 9,
      "text": "before the LORD, for he comes to judge the earth. He will judge the world in righteousness, and the peoples with fairness.",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>; <a href='/AIV/40/25/31-32'>Matt. 25:31-32</a>; <a href='/AIV/45/2/6-11'>Rom. 2:6-11</a>",
      "comment": "God's coming judgment underlines the hope of final justice and restoration. The righteous judgment anticipates the eschatological role of Christ as Judge (Acts 17:31), inspiring hope for true justice and the fulfillment of God's promises for all nations, uniting believers under one faith in his coming kingdom."
    }
  ],
  "translatedAt": "2025-12-24T06:33:43.575Z"
}