{
  "book": "Psalms",
  "bookAbbreviation": "Ps",
  "chapter": 89,
  "verses": [
    {
      "pk": 4008901,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 1,
      "text": "I will sing of the Lord's steadfast love forever; with my mouth I will make known your faithfulness to all generations.",
      "links": "<a href='/AIV/19/36/5'>Ps. 36:5</a>; <a href='/AIV/19/100/5'>Ps. 100:5</a>",
      "comment": "The Hebrew word for 'steadfast love' is 'hesed', which points to God's covenantal mercy. Christians see this as anticipating the New Covenant in Christ."
    },
    {
      "pk": 4008902,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 2,
      "text": "For I said, 'Steadfast love will be built up forever; in the heavens you will establish your faithfulness.'",
      "links": "<a href='/AIV/19/85/10'>Ps. 85:10</a>",
      "comment": "God’s faithfulness is portrayed as enduring, fulfilled in Christ, the Son enthroned in heaven. See Hebrews 6:19–20 about Jesus as our anchor in heaven."
    },
    {
      "pk": 4008903,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 3,
      "text": "You said, 'I have made a covenant with my chosen one; I have sworn to David my servant:'",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>; <a href='/AIV/19/132/11'>Ps. 132:11</a>",
      "comment": "This is a reference to the Davidic Covenant, solemnized in 2 Samuel 7. This covenant finds its ultimate fulfillment in Jesus, David’s descendant (Luke 1:32–33)."
    },
    {
      "pk": 4008904,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 4,
      "text": "'I will establish your offspring forever, and build up your throne for all generations.' Selah",
      "links": "<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>; <a href='/AIV/19/132/12'>Ps. 132:12</a>",
      "comment": "The perpetual throne is seen by Christians as a prophecy of Christ’s eternal kingship. Catholic tradition sees the Church as the visible continuation of this reign."
    },
    {
      "pk": 4008905,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 5,
      "text": "Let the heavens praise your wonders, O Lord, your faithfulness in the assembly of the holy ones!",
      "links": "<a href='/AIV/19/29/1'>Ps. 29:1</a>",
      "comment": "The assembly of the holy ones may subtly foreshadow the communion of saints—a key Catholic doctrine connecting heaven and earth."
    },
    {
      "pk": 4008906,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 6,
      "text": "For who in the skies can be compared to the Lord? Who among the sons of God is like the Lord?",
      "links": "<a href='/AIV/19/113/5'>Ps. 113:5</a>; <a href='/AIV/18/1/6'>Job 1:6</a>",
      "comment": "'Sons of God' likely refers to angelic beings, showing God's supremacy over all celestial creatures."
    },
    {
      "pk": 4008907,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 7,
      "text": "A God greatly to be feared in the council of the holy ones, and awesome above all who are around him?",
      "links": "<a href='/AIV/02/15/11'>Ex. 15:11</a>",
      "comment": "The heavenly council motif can be linked to the worship of God in the heavenly liturgy (see Revelation 4)."
    },
    {
      "pk": 4008908,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 8,
      "text": "O Lord God of hosts, who is mighty as you are, O Lord, with your faithfulness all around you?",
      "links": "<a href='/AIV/24/10/6'>Jer. 10:6</a>",
      "comment": "'God of hosts' stresses God's command over angelic armies—a heavenly dimension celebrated in the Mass."
    },
    {
      "pk": 4008909,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 9,
      "text": "You rule the raging of the sea; when its waves rise, you still them.",
      "links": "<a href='/AIV/19/107/29'>Ps. 107:29</a>; <a href='/AIV/41/4/39'>Mark 4:39</a>",
      "comment": "Jesus calming the sea echoes this verse, attesting to His divinity (see Mark 4:39), fulfilling what is attributed here to the Lord alone."
    },
    {
      "pk": 4008910,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 10,
      "text": "You crushed Rahab like a corpse; you scattered your enemies with your mighty arm.",
      "links": "<a href='/AIV/18/9/13'>Job 9:13</a>; <a href='/AIV/02/14/27-28'>Ex. 14:27-28</a>",
      "comment": "'Rahab' here symbolizes Egypt. God’s victory is re-presented in every age—Catholic liturgy interprets these mighty acts as types pointing to Christ’s Paschal victory."
    },
    {
      "pk": 4008911,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 11,
      "text": "The heavens are yours; the earth also is yours; the world and all that is in it, you have founded them.",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "All creation belongs to God—a truth reflected in the Church’s teaching on the goodness of creation (cf. Genesis 1, CCC 299)."
    },
    {
      "pk": 4008912,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 12,
      "text": "North and south, you have created them; Tabor and Hermon joyously praise your name.",
      "links": "<a href='/AIV/19/133/3'>Ps. 133:3</a>",
      "comment": "Mount Tabor, later, is the place of the Transfiguration of Jesus (cf. Matthew 17:1-8), revealing Christ's glory."
    },
    {
      "pk": 4008913,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 13,
      "text": "You have a mighty arm; strong is your hand, high your right hand.",
      "links": "<a href='/AIV/02/6/6'>Ex. 6:6</a>",
      "comment": "God’s right hand symbolizes strength and salvation (see Acts 2:33, Christ exalted to God’s right hand)."
    },
    {
      "pk": 4008914,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 14,
      "text": "Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>",
      "comment": "These are the defining attributes of God’s reign—which Catholics see embodied in Christ’s Kingdom present in the Church (Luke 17:21)."
    },
    {
      "pk": 4008915,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 15,
      "text": "Blessed are the people who know the festal shout, who walk, O Lord, in the light of your face,",
      "links": "<a href='/AIV/19/4/6'>Ps. 4:6</a>",
      "comment": "'Festal shout' hints at liturgical celebration—a central aspect of Catholic worship as an ongoing heavenly reality (see Hebrews 12:22-24)."
    },
    {
      "pk": 4008916,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 16,
      "text": "who exult in your name all the day and in your righteousness are exalted.",
      "links": "<a href='/AIV/19/44/8'>Ps. 44:8</a>",
      "comment": "True righteousness comes from union with God—a doctrine developed in New Testament justification (see Romans 3:22)."
    },
    {
      "pk": 4008917,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 17,
      "text": "For you are the glory of their strength; by your favor our horn is exalted.",
      "links": "<a href='/AIV/19/75/10'>Ps. 75:10</a>",
      "comment": "'Horn' symbolizes strength and kingship, ultimately fulfilled in Christ (Luke 1:69: 'He has raised up a horn of salvation…')."
    },
    {
      "pk": 4008918,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 18,
      "text": "For our shield belongs to the Lord, our king to the Holy One of Israel.",
      "links": "<a href='/AIV/19/47/9'>Ps. 47:9</a>",
      "comment": "The kings of Israel are anointed to prefigure Christ, the true Messiah (cf. Hebrews 1:8)."
    },
    {
      "pk": 4008919,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 19,
      "text": "Of old you spoke in a vision to your godly one, and said: 'I have granted help to one who is mighty; I have exalted one chosen from the people.'",
      "links": "<a href='/AIV/19/78/70-71'>Ps. 78:70-71</a>",
      "comment": "‘Godly one’ (Hebrew: chasid) may refer to Samuel or David, but more perfectly, prefigures Christ God’s Chosen One (Luke 23:35)."
    },
    {
      "pk": 4008920,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 20,
      "text": "I have found David my servant; with my holy oil I have anointed him,",
      "links": "<a href='/AIV/09/16/12-13'>1 Sam. 16:12-13</a>",
      "comment": "David’s anointing with holy oil prefigures Christ (Greek ‘Christos’ = Anointed One), and sacramental anointing in Christian practice (see 2 Cor. 1:21)."
    },
    {
      "pk": 4008921,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 21,
      "text": "so that my hand shall be established with him; my arm also shall strengthen him.",
      "links": "<a href='/AIV/19/18/35'>Ps. 18:35</a>",
      "comment": "Christ is upheld by the Father in His mission; Christians are upheld by grace."
    },
    {
      "pk": 4008922,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 22,
      "text": "The enemy shall not outwit him; the wicked shall not humble him.",
      "links": "<a href='/AIV/10/7/10-11'>2 Sam 7:10-11</a>",
      "comment": "Final security is assured in God’s anointed—applied spiritually to Jesus who defeats all spiritual enemies."
    },
    {
      "pk": 4008923,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 23,
      "text": "I will crush his foes before him and strike down those who hate him.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Fulfilled in Christ (cf. 1 Cor. 15:25), who reigns until all enemies are put under His feet."
    },
    {
      "pk": 4008924,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 24,
      "text": "My faithfulness and my steadfast love shall be with him, and in my name his horn shall be exalted.",
      "links": "<a href='/AIV/19/18/50'>Ps. 18:50</a>",
      "comment": "‘Horn’ again points to Christ’s victory and exulted status as Messiah and High Priest."
    },
    {
      "pk": 4008925,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 25,
      "text": "I will set his hand on the sea and his right hand on the rivers.",
      "links": "<a href='/AIV/10/8/3'>2 Sam. 8:3</a>",
      "comment": "Universal dominion promised to David’s heir points forward to the cosmic reign of Christ (see Matthew 28:18)."
    },
    {
      "pk": 4008926,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 26,
      "text": "He shall cry to me, 'You are my Father, my God, and the Rock of my salvation.'",
      "links": "<a href='/AIV/43/20/17'>John 20:17</a>",
      "comment": "Jesus openly refers to God as Father—unique intimacy that Christians share by adoption (see Gal. 4:6)."
    },
    {
      "pk": 4008927,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 27,
      "text": "And I will make him the firstborn, the highest of the kings of the earth.",
      "links": "<a href='/AIV/51/1/15-18'>Col. 1:15-18</a>",
      "comment": "‘Firstborn’ is a royal title; see how Paul applies this explicitly to Jesus (Colossians 1:15) as the Head of creation and the Church."
    },
    {
      "pk": 4008928,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 28,
      "text": "My steadfast love I will keep for him forever, and my covenant will stand firm for him.",
      "links": "<a href='/AIV/19/89/34'>Ps. 89:34</a>",
      "comment": "God’s everlasting covenant is finally revealed in Christ and the New Covenant (see Hebrews 13:20)."
    },
    {
      "pk": 4008929,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 29,
      "text": "I will establish his offspring forever and his throne as the days of the heavens.",
      "links": "<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "This messianic promise is fulfilled in Jesus’ eternal kingship—the Catholic understanding sees the Church as sharing in this ongoing reign."
    },
    {
      "pk": 4008930,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 30,
      "text": "If his children forsake my law and do not walk according to my rules,",
      "links": "<a href='/AIV/19/132/12'>Ps. 132:12</a>",
      "comment": "God’s covenant is conditional for the heirs—showing need for perseverance and faithfulness, key themes in Catholic life (see Philippians 2:12)."
    },
    {
      "pk": 4008931,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 31,
      "text": "if they violate my statutes and do not keep my commandments,",
      "links": "<a href='/AIV/03/26/14-15'>Lev. 26:14-15</a>",
      "comment": "Obedience is expected in response to God’s love, foreshadowing the moral life of the Christian (see John 14:15)."
    },
    {
      "pk": 4008932,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 32,
      "text": "then I will punish their transgression with the rod and their iniquity with stripes,",
      "links": "<a href='/AIV/10/7/14'>2 Sam. 7:14</a>",
      "comment": "God disciplines His people for their good; similar to how the Church teaches correction leads to holiness (cf. Hebrews 12:6)."
    },
    {
      "pk": 4008933,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 33,
      "text": "but I will not remove from him my steadfast love or be false to my faithfulness.",
      "links": "<a href='/AIV/19/89/28'>Ps. 89:28</a>",
      "comment": "God’s mercy endures—especially in the Incarnation, Sacraments, and ongoing forgiveness within the Church."
    },
    {
      "pk": 4008934,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 34,
      "text": "I will not violate my covenant or alter the word that went forth from my lips.",
      "links": "<a href='/AIV/04/23/19'>Num. 23:19</a>",
      "comment": "God’s promises are irrevocable, a foundation of Christian assurance."
    },
    {
      "pk": 4008935,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 35,
      "text": "Once for all I have sworn by my holiness; I will not lie to David.",
      "links": "<a href='/AIV/58/6/13-18'>Heb. 6:13-18</a>",
      "comment": "A solemn oath guaranteed by God Himself—Christ's priesthood is described in similar terms ('once for all', Hebrews 7:27)."
    },
    {
      "pk": 4008936,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 36,
      "text": "His offspring shall endure forever, his throne as long as the sun before me.",
      "links": "<a href='/AIV/19/72/17'>Ps. 72:17</a>",
      "comment": "God promises a never-ending line culminating in the everlasting reign of Christ."
    },
    {
      "pk": 4008937,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 37,
      "text": "Like the moon it shall be established forever, a faithful witness in the skies.” Selah",
      "links": "<a href='/AIV/01/1/16'>Gen. 1:16</a>",
      "comment": "The moon is a visible sign—a theme echoed in sacramental theology, where visible signs communicate God's covenant faithfulness."
    },
    {
      "pk": 4008938,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 38,
      "text": "But now you have cast off and rejected; you are full of wrath against your anointed.",
      "links": "<a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "This is the lament over apparent rejection—a tension resolved in Christ who bears God’s wrath, yet is vindicated in resurrection."
    },
    {
      "pk": 4008939,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 39,
      "text": "You have renounced the covenant with your servant; you have defiled his crown in the dust.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Earthly Israel's throne falls, but the messianic hope persists—a hope realized spiritually in the Messiah."
    },
    {
      "pk": 4008940,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 40,
      "text": "You have breached all his walls; you have laid his strongholds in ruins.",
      "links": "<a href='/AIV/25/2/2'>Lam. 2:2</a>",
      "comment": "The destruction is part of God’s discipline, understood in Christian thought as a call to repentance and renewal."
    },
    {
      "pk": 4008941,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 41,
      "text": "All who pass by plunder him; he has become the scorn of his neighbors.",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "The humiliation of the king points forward to Christ’s suffering and rejection (see Luke 23:35)."
    },
    {
      "pk": 4008942,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 42,
      "text": "You have exalted the right hand of his foes; you have made all his enemies rejoice.",
      "links": "<a href='/AIV/25/1/5'>Lam. 1:5</a>",
      "comment": "God allows enemies to triumph for a time—a mysterious aspect of divine providence."
    },
    {
      "pk": 4008943,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 43,
      "text": "You have also turned back the edge of his sword, and you have not made him stand in battle.",
      "links": "<a href='/AIV/19/44/9-10'>Ps. 44:9-10</a>",
      "comment": "God’s presence is essential for victory—echoes the Church’s teaching on the necessity of grace."
    },
    {
      "pk": 4008944,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 44,
      "text": "You have made his splendor to cease and cast his throne to the ground.",
      "links": "<a href='/AIV/19/89/39'>Ps. 89:39</a>",
      "comment": "Loss of earthly splendor contrasts with Christ’s spiritual exaltation 'on the wood of the Cross' (see Philippians 2:8-9)."
    },
    {
      "pk": 4008945,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 45,
      "text": "You have cut short the days of his youth; you have covered him with shame. Selah",
      "links": "<a href='/AIV/23/53/3'>Isa. 53:3</a>",
      "comment": "Imagery of the humiliated king is seen fulfilled in Christ, the suffering servant."
    },
    {
      "pk": 4008946,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 46,
      "text": "How long, O Lord? Will you hide yourself forever? How long will your wrath burn like fire?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>",
      "comment": "A heartfelt lament that turns into hope. Catholic spirituality sees value in such honest prayer (see Lamentations 3:21-24)."
    },
    {
      "pk": 4008947,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 47,
      "text": "Remember how short my time is! For what vanity you have created all the children of man!",
      "links": "<a href='/AIV/19/39/4-5'>Ps. 39:4-5</a>",
      "comment": "A reflection on mortality, preparing the way for the Christian hope in resurrection."
    },
    {
      "pk": 4008948,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 48,
      "text": "What man can live and never see death? Who can deliver his soul from the power of Sheol? Selah",
      "links": "<a href='/AIV/19/49/7-9'>Ps. 49:7-9</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "A rhetorical question answered only by Christ, who conquers death (cf. John 11:25, 'I am the resurrection and the life')."
    },
    {
      "pk": 4008949,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 49,
      "text": "Lord, where is your steadfast love of old, which by your faithfulness you swore to David?",
      "links": "<a href='/AIV/19/89/2-4'>Ps. 89:2-4</a>",
      "comment": "A recalled longing for God’s faithfulness, fulfilled mystically in Christ and sacramentally in the Eucharist."
    },
    {
      "pk": 4008950,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 50,
      "text": "Remember, O Lord, how your servants are mocked, and how I bear in my heart the insults of all the many nations,",
      "links": "<a href='/AIV/19/69/7'>Ps. 69:7</a>",
      "comment": "Suffering for God’s sake is seen as redemptive and participation in Christ’s passion—a central tenet of Christian life."
    },
    {
      "pk": 4008951,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 51,
      "text": "with which your enemies mock, O Lord, with which they mock the footsteps of your anointed.",
      "links": "<a href='/AIV/40/27/29'>Matt. 27:29</a>",
      "comment": "Prophetic of the mocking of Christ on His way to Calvary—fulfilled in the events of the Passion."
    },
    {
      "pk": 4008952,
      "translation": "AIV",
      "book": 19,
      "chapter": 89,
      "verse": 52,
      "text": "Blessed be the Lord forever! Amen and Amen.",
      "links": "<a href='/AIV/19/41/13'>Ps. 41:13</a>",
      "comment": "A doxology closes the psalm. Early Christian liturgy (like the Catholic Mass) still ends with 'Amen,' showing continuity with the worship of Israel."
    }
  ],
  "translatedAt": "2025-12-22T21:48:32.285Z"
}