{
  "book": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 2,
  "verses": [
    {
      "pk": 2019201,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 1,
      "text": "Therefore, rid yourselves of all malice, all deceit, hypocrisy, envy, and every kind of slander.",
      "links": "<a href='/AIV/49/4/31'>Eph. 4:31</a>; <a href='/AIV/58/12/1'>Heb. 12:1</a>",
      "comment": "Peter urges believers to remove sinful attitudes and actions, reflecting the call to inner transformation seen throughout Scripture. The list highlights how communal holiness is essential for the life of the Church."
    },
    {
      "pk": 2019202,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 2,
      "text": "Like newborn babies, crave pure spiritual milk, so that by it you may grow up to salvation,",
      "links": "<a href='/AIV/46/3/2'>1 Cor. 3:2</a>; <a href='/AIV/58/5/13'>Heb. 5:13-14</a>",
      "comment": "Spiritual nourishment leads to growth and maturity in faith, drawing parallels with sacramental and scriptural sustenance. Peter’s language emphasizes the necessity of 'growing up,' not remaining stagnant."
    },
    {
      "pk": 2019203,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 3,
      "text": "if indeed you have tasted that the Lord is good.",
      "links": "<a href='/AIV/19/34/8'>Psalm 34:8</a>",
      "comment": "'Tasting' recalls intimate spiritual experience and ties Old Testament praise for God's goodness directly to Christ, aligning him as the source of salvation."
    },
    {
      "pk": 2019204,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 4,
      "text": "As you come to him, a living stone, rejected by men but chosen and precious in God's sight,",
      "links": "<a href='/AIV/19/118/22'>Psalm 118:22</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>",
      "comment": "Peter refers to Christ as the foundational 'living stone.' This imagery supports high christology, linking Jesus directly to messianic prophecy about the cornerstone."
    },
    {
      "pk": 2019205,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 5,
      "text": "you yourselves, like living stones, are being built up as a spiritual house, to be a holy priesthood, offering spiritual sacrifices acceptable to God through Jesus Christ.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/66/1/6'>Rev. 1:6</a>",
      "comment": "All believers are a 'holy priesthood'—a concept with Old Testament roots, but expanded here to include all in Christ. Note the language of spiritual sacrifice and priesthood, supporting the visible, united community and priestly ministry established by Christ."
    },
    {
      "pk": 2019206,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 6,
      "text": "For it stands in Scripture: 'See, I lay in Zion a chosen and precious cornerstone, and whoever trusts in him will not be put to shame.'",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/45/9/33'>Rom. 9:33</a>",
      "comment": "Peter quotes Isaiah’s prophecy of the cornerstone, identifying Christ as the fulfillment. Trust in him brings assurance, not shame—a foundational truth binding Old and New Covenant believers together."
    },
    {
      "pk": 2019207,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 7,
      "text": "So to you who believe, this stone is precious; but to those who do not believe, 'The stone the builders rejected has become the cornerstone.'",
      "links": "<a href='/AIV/19/118/22'>Psalm 118:22</a>; <a href='/AIV/40/21/42'>Matt. 21:42</a>",
      "comment": "Echoing Psalm 118, Peter points out that belief makes Christ precious, while rejection fulfills the prophecy of the rejected stone. This supports the continuity of God’s plan."
    },
    {
      "pk": 2019208,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 8,
      "text": "And, 'A stone that causes people to stumble, and a rock that makes them fall.' They stumble because they disobey the word, as they were destined to.",
      "links": "<a href='/AIV/23/8/14'>Isa. 8:14</a>; <a href='/AIV/45/9/32'>Rom. 9:32'</a>",
      "comment": "Christ, while the true foundation, is also a stumbling block for some. Theological tension between God’s sovereignty and human responsibility surfaces here, with both literal and spiritual implications."
    },
    {
      "pk": 2019209,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 9,
      "text": "But you are a chosen race, a royal priesthood, a holy nation, a people for his own possession, so that you may proclaim the excellencies of him who called you out of darkness into his marvelous light.",
      "links": "<a href='/AIV/2/19/6'>Ex. 19:6</a>; <a href='/AIV/23/43/20'>Isa. 43:20-21</a>",
      "comment": "Peter draws on Israelite language, applying it to those in Christ. The idea of a 'royal priesthood' and 'holy nation' points to God’s visible, unified people—meant to be distinct and called to proclaim the Gospel."
    },
    {
      "pk": 2019210,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 10,
      "text": "Once you were not a people, but now you are God's people; once you had not received mercy, but now you have received mercy.",
      "links": "<a href='/AIV/28/2/23'>Hos. 2:23</a>; <a href='/AIV/45/9/25'>Rom. 9:25'</a>",
      "comment": "Fulfillment of Hosea’s prophecy—Gentiles are now part of God’s covenant people, showing the expansive mercy and plan of God through Christ."
    },
    {
      "pk": 2019211,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 11,
      "text": "Beloved, I urge you as foreigners and exiles to abstain from desires of the flesh, which wage war against your soul.",
      "links": "<a href='/AIV/58/11/13'>Heb. 11:13</a>; <a href='/AIV/48/5/16-17'>Gal. 5:16-17</a>",
      "comment": "Spiritual identity as 'exiles' connects to the biblical theme of pilgrimage. The struggle against sinful desires is ongoing, requiring vigilance and self-discipline—a call to live uniquely as a set-apart people."
    },
    {
      "pk": 2019212,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 12,
      "text": "Conduct yourselves honorably among the nations, so that when they speak against you as evildoers, they may see your good works and glorify God on the day he visits.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/50/2/15'>Phil. 2:15'</a>",
      "comment": "Echoes of Jesus’ Sermon on the Mount—the call to let works testify to faith. Faith is shown in visible actions, anticipating both the present and future vindication by God."
    },
    {
      "pk": 2019213,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 13,
      "text": "Submit yourselves for the Lord's sake to every human institution—whether to the emperor as supreme authority,",
      "links": "<a href='/AIV/45/13/1-2'>Rom. 13:1-2</a>",
      "comment": "Christians are called to respect legitimate authority, living out faithful citizenship as a witness. God’s sovereignty is acknowledged even over secular rulers."
    },
    {
      "pk": 2019214,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 14,
      "text": "or to governors sent by him to punish evildoers and to praise those who do good.",
      "links": "<a href='/AIV/45/13/3'>Rom. 13:3</a>",
      "comment": "Governance serves a godly purpose when it rewards good and restrains evil. Peter presents civil order as providential."
    },
    {
      "pk": 2019215,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 15,
      "text": "For this is the will of God, that by doing good you should silence the ignorance of foolish people.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "Living uprightly is a defense against slander. Good deeds not only reflect Christ’s character but answer criticism, suggesting the apologetic value of holiness."
    },
    {
      "pk": 2019216,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 16,
      "text": "Live as free people, yet do not use your freedom as a cover-up for evil, but as servants of God.",
      "links": "<a href='/AIV/48/5/13'>Gal. 5:13</a>",
      "comment": "Christian freedom is for service, not license. The balance of liberty and obedience is central to authentic discipleship."
    },
    {
      "pk": 2019217,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 17,
      "text": "Honor everyone. Love the brothers and sisters. Fear God. Honor the emperor.",
      "links": "<a href='/AIV/19/119/63'>Ps. 119:63</a>; <a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "Peter provides a summary of Christian ethics: universal respect, special love for the faithful, reverence for God, and civic honor—a unified witness to the world."
    },
    {
      "pk": 2019218,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 18,
      "text": "Servants, be subject to your masters with all respect, not only to those who are good and gentle, but also to those who are unjust.",
      "links": "<a href='/AIV/49/6/5'>Eph. 6:5</a>; <a href='/AIV/51/3/22'>Col. 3:22</a>",
      "comment": "Submission even in difficult circumstances is praised; Christian suffering when done for righteousness reflects Christ’s own path, pointing towards redemptive suffering."
    },
    {
      "pk": 2019219,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 19,
      "text": "For this is commendable, if because of conscience toward God one endures suffering unjustly.",
      "links": "<a href='/AIV/40/5/10'>Matt. 5:10</a>",
      "comment": "Enduring unjust suffering is considered grace-filled when done with a Godward orientation. It echoes teachings of Jesus about blessedness in persecution."
    },
    {
      "pk": 2019220,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 20,
      "text": "For what credit is it if, when you sin and are punished, you endure it? But if you do good and suffer for it, and endure, this is pleasing before God.",
      "links": "<a href='/AIV/40/5/44'>Matt. 5:44</a>",
      "comment": "True virtue is seen when suffering is endured for righteousness. Peter exalts redemptive suffering, prefiguring the spiritual value traditionally recognized by the Church."
    },
    {
      "pk": 2019221,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 21,
      "text": "For to this you were called, because Christ suffered for you, leaving you an example, that you should follow in his steps.",
      "links": "<a href='/AIV/40/16/24'>Matt. 16:24</a>; <a href='/AIV/43/13/15'>John 13:15</a>",
      "comment": "Christ’s suffering is both redemptive and exemplary. Peter teaches a path of imitation—following Christ, even in suffering, is central to Christian discipleship."
    },
    {
      "pk": 2019222,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 22,
      "text": "He committed no sin, and no deceit was found in his mouth.",
      "links": "<a href='/AIV/23/53/9'>Isa. 53:9</a>; <a href='/AIV/43/8/46'>John 8:46</a>",
      "comment": "Peter alludes to Isaiah’s Suffering Servant—Jesus’ sinlessness highlights his role as perfect sacrifice, a high christological affirmation."
    },
    {
      "pk": 2019223,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 23,
      "text": "When he was insulted, he did not retaliate; when he suffered, he made no threats, but entrusted himself to the one who judges justly.",
      "links": "<a href='/AIV/23/53/7'>Isa. 53:7</a>; <a href='/AIV/40/27/14'>Matt. 27:14</a>",
      "comment": "Christ’s silent suffering fulfills prophecy and models trust in God’s justice, tying Jesus’ Passion to Old Testament forecasts and the theme of vindication."
    },
    {
      "pk": 2019224,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 24,
      "text": "He himself bore our sins in his body on the tree, so that we might die to sin and live for righteousness. By his wounds you have been healed.",
      "links": "<a href='/AIV/23/53/5'>Isa. 53:5-6</a>; <a href='/AIV/48/3/13'>Gal. 3:13</a>",
      "comment": "Peter combines Isaiah’s prophecy with sacrificial imagery: Christ’s atoning death brings healing and sanctification. The connection to the 'tree' recalls both the curse (Deut. 21:23) and redemption."
    },
    {
      "pk": 2019225,
      "translation": "AIV",
      "book": 60,
      "chapter": 2,
      "verse": 25,
      "text": "For you were like sheep going astray, but now you have returned to the Shepherd and Overseer of your souls.",
      "links": "<a href='/AIV/23/53/6'>Isa. 53:6</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Peter concludes with the shepherd motif: Jesus is the ultimate guide and guardian for believers. Return and reconciliation is emphasized, deepening the spiritual meaning of Christ’s leadership and care for his flock."
    }
  ],
  "translatedAt": "2025-12-23T04:14:58.303Z"
}