{
  "book": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 3,
  "verses": [
    {
      "pk": 1943001,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 1,
      "text": "In the same way, wives, submit yourselves to your own husbands, so that even if some do not obey the word, they may be won over without a word by the conduct of their wives,",
      "links": "<a href='/AIV/49/5/22'>Eph. 5:22</a>; <a href='/AIV/51/3/18'>Col. 3:18</a>",
      "comment": "Peter encourages Christian wives to witness through their respectful lives. The idea of gentle submission is consistent with the order seen in creation (cf. Genesis 2:18). The concept of 'winning over' through action, not just words, also hints at the transformative power of grace."
    },
    {
      "pk": 1943002,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 2,
      "text": "when they see your pure and respectful conduct.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "The power of example is highlighted. This fits with the teaching that good works can glorify God and influence others spiritually and morally."
    },
    {
      "pk": 1943003,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 3,
      "text": "Do not let your beauty come from outward adornment—such as braided hair, gold jewelry, or fine clothes—",
      "links": "<a href='/AIV/23/3/16-24'>Isa. 3:16–24</a>",
      "comment": "External beauty is not condemned, but the priority is the inner person. This echoes Old Testament teaching about humility and modesty."
    },
    {
      "pk": 1943004,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 4,
      "text": "but let it be the hidden person of the heart, with the lasting beauty of a gentle and quiet spirit, which is precious in God’s sight.",
      "links": "<a href='/AIV/19/51/6'>Ps. 51:6</a>",
      "comment": "Holiness and inner virtue are regarded as precious by God. The 'hidden person of the heart' points towards spiritual renewal, an important New Testament theme."
    },
    {
      "pk": 1943005,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 5,
      "text": "For this is how holy women of the past who hoped in God used to adorn themselves, submitting to their own husbands.",
      "links": "<a href='/AIV/01/18/12'>Gen. 18:12</a>",
      "comment": "Peter looks back to Old Testament women as models of faith and virtue, showing continuity between the covenants and the value of tradition."
    },
    {
      "pk": 1943006,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 6,
      "text": "Just as Sarah obeyed Abraham, calling him lord. You are her daughters if you do what is good and do not fear anything that is frightening.",
      "links": "<a href='/AIV/01/18/12'>Gen. 18:12</a>; <a href='/AIV/58/11/11'>Heb. 11:11</a>",
      "comment": "Sarah is upheld as a model for honoring her husband. The theme of spiritual ancestry and courageous faith is present, as in the Pauline letters."
    },
    {
      "pk": 1943007,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 7,
      "text": "Likewise, husbands, live with your wives in understanding, giving honor to the woman as the weaker vessel, since they are heirs with you of the grace of life, so that your prayers may not be hindered.",
      "links": "<a href='/AIV/49/5/25'>Eph. 5:25</a>; <a href='/AIV/51/3/19'>Col. 3:19</a>",
      "comment": "The equality in salvation ('heirs of grace') is noted, alongside the different roles. The reference to prayers points to the spiritual unity and mutual respect meant for marriage."
    },
    {
      "pk": 1943008,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 8,
      "text": "Finally, all of you, have unity of mind, sympathy, love for one another, compassion, and humility.",
      "links": "<a href='/AIV/50/2/2'>Phil. 2:2</a>; <a href='/AIV/43/17/21'>John 17:21</a>",
      "comment": "Peter calls for community unity, love, and humility—virtues foundational for the apostolic church. Spiritual unity is a significant theme in Jesus’ prayer in John 17."
    },
    {
      "pk": 1943009,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 9,
      "text": "Do not repay evil for evil or insult for insult, but on the contrary, bless, for to this you were called, so that you may inherit a blessing.",
      "links": "<a href='/AIV/40/5/44'>Matt. 5:44</a>; <a href='/AIV/45/12/17'>Rom. 12:17</a>",
      "comment": "Christ’s teaching on loving enemies is echoed here. The inheritance of blessing is seen as grace received in Christ and lived out in community."
    },
    {
      "pk": 1943010,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 10,
      "text": "For, 'Whoever desires to love life and see good days, let him keep his tongue from evil and his lips from speaking deceit;",
      "links": "<a href='/AIV/19/34/12-13'>Ps. 34:12–13</a>",
      "comment": "Peter quotes Psalm 34, linking Old Testament wisdom to new covenant life. The practical aspect of holiness is stressed."
    },
    {
      "pk": 1943011,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 11,
      "text": "Let him turn away from evil and do good; let him seek peace and pursue it.'",
      "links": "<a href='/AIV/19/34/14'>Ps. 34:14</a>",
      "comment": "Further Old Testament ties. Peace is an active pursuit, resonating with Jesus' Beatitudes and teachings on peacemaking."
    },
    {
      "pk": 1943012,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 12,
      "text": "For the eyes of the Lord are on the righteous, and his ears are attentive to their prayer. But the face of the Lord is against those who do evil.",
      "links": "<a href='/AIV/19/34/15-16'>Ps. 34:15–16</a>",
      "comment": "Assurance of God’s care for the faithful, echoing the Psalms. Highlights the importance of righteousness for effective prayer."
    },
    {
      "pk": 1943013,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 13,
      "text": "Who then will harm you if you are zealous for what is good?",
      "links": "<a href='/AIV/23/50/9'>Isa. 50:9</a>; <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "Speaks to providence and divine protection—echoing Paul’s confidence in Romans 8 and Isaiah’s assurance for the godly."
    },
    {
      "pk": 1943014,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 14,
      "text": "But even if you should suffer for righteousness’ sake, you are blessed. Do not fear their threats or be troubled,",
      "links": "<a href='/AIV/40/5/10-12'>Matt. 5:10–12</a>; <a href='/AIV/23/8/12'>Isa. 8:12</a>",
      "comment": "Peter links suffering with blessing. Jesus’ teaching on the blessedness of the persecuted is referenced. Courage in suffering is key for the Christian life."
    },
    {
      "pk": 1943015,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 15,
      "text": "but honor Christ as Lord in your hearts, always being ready to make a defense to anyone who asks you for a reason for the hope that is in you, yet do this with gentleness and respect.",
      "links": "<a href='/AIV/23/8/13'>Isa. 8:13</a>; <a href='/AIV/45/10/9'>Rom. 10:9</a>",
      "comment": "Acknowledging Jesus as Lord is an explicit affirmation of his divinity (cf. Romans 10:9). The call to apologetics (‘make a defense’) highlights reasoned faith and gentleness."
    },
    {
      "pk": 1943016,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 16,
      "text": "Keep a clear conscience, so that when you are slandered, those who attack your good behavior in Christ may be put to shame.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "Integrity and holiness are meant to be a testimony to Christ. Being ‘in Christ’ is central—a spiritual reality and mystical union."
    },
    {
      "pk": 1943017,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 17,
      "text": "For it is better to suffer for doing good, if that should be God’s will, than for doing evil.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>",
      "comment": "Suffering according to God’s will is redemptive, echoing Paul’s theology of suffering and union with Christ’s passion."
    },
    {
      "pk": 1943018,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 18,
      "text": "For Christ also suffered once for sins, the Righteous for the unrighteous, that he might bring you to God, being put to death in the flesh but made alive in the spirit,",
      "links": "<a href='/AIV/45/5/6-8'>Rom. 5:6–8</a>; <a href='/AIV/23/53/11'>Isa. 53:11</a>",
      "comment": "This verse encapsulates Christ’s substitutionary atonement (‘the righteous for the unrighteous’)—fulfilling Isaiah 53 and Pauline doctrine. His being made alive ‘in the spirit’ also points to spiritual realities beyond mere physical resurrection."
    },
    {
      "pk": 1943019,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 19,
      "text": "in which he went and preached to the spirits in prison,",
      "links": "<a href='/AIV/23/49/9'>Isa. 49:9</a>; <a href='/AIV/19/68/18'>Ps. 68:18</a>",
      "comment": "Mystery surrounds Christ’s proclamation to ‘spirits in prison’. This has been interpreted as Christ’s victory announcement to the dead, supporting traditions of Christ’s descent and the fullness of redemption."
    },
    {
      "pk": 1943020,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 20,
      "text": "who disobeyed long ago, when God waited patiently in the days of Noah while the ark was being built. In it only a few people, eight in all, were saved through water.",
      "links": "<a href='/AIV/01/6/5-18'>Gen. 6:5–18</a>; <a href='/AIV/58/11/7'>Heb. 11:7</a>",
      "comment": "Noah’s deliverance through water is a template for salvation themes. Water as symbolic of cleansing and rebirth connects to baptism—see verse 21."
    },
    {
      "pk": 1943021,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 21,
      "text": "Baptism, which corresponds to this, now saves you—not by removing dirt from the body but as a pledge of a clear conscience toward God—through the resurrection of Jesus Christ,",
      "links": "<a href='/AIV/40/28/19'>Matt. 28:19</a>; <a href='/AIV/45/6/4'>Rom. 6:4</a>",
      "comment": "Peter affirms that baptism saves—not as a mere external act but by spiritual transformation linked to Christ's resurrection. This passage underlines the sacramental means of grace and the necessity of baptism as instituted and commanded by Christ."
    },
    {
      "pk": 1943022,
      "translation": "AIV",
      "book": 60,
      "chapter": 3,
      "verse": 22,
      "text": "who has gone into heaven and is at the right hand of God, with angels, authorities, and powers subject to him.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/58/1/3'>Heb. 1:3</a>; <a href='/AIV/41/16/19'>Mark 16:19</a>",
      "comment": "Christ’s ascension and session at God’s right hand fulfill Old Testament prophecy (Psalm 110:1). His rule over all spiritual powers is an explicit affirmation of his divinity and lordship."
    }
  ],
  "translatedAt": "2025-12-23T04:15:20.579Z"
}