{
  "book": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 1,
  "verses": [
    {
      "pk": 5101001,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 1,
      "text": "Peter, an apostle of Jesus Christ, to those who are chosen exiles of the Dispersion in Pontus, Galatia, Cappadocia, Asia, and Bithynia,",
      "links": "<a href='/AIV/44/2/9'>Acts 2:9</a>;<a href='/AIV/59/1/1'>James 1:1</a>",
      "comment": "Peter, as an eyewitness and leader among the apostles, writes to Christians living in various regions. 'Exiles' refers to believers whose true home is in heaven (Heb. 11:13–16). The sense of 'chosen' points to God's initiative in salvation, foreshadowing themes of grace and God's plan."
    },
    {
      "pk": 5101002,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 2,
      "text": "according to the foreknowledge of God the Father, in the sanctification of the Spirit, for obedience and sprinkling with the blood of Jesus Christ: May grace and peace be multiplied to you.",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4–5</a>;<a href='/AIV/02/24/8'>Ex. 24:8</a>;<a href='/AIV/58/12/24'>Heb. 12:24</a>",
      "comment": "Here, the three Persons of the Trinity are named, emphasizing God's action in salvation: the Father's choice, the Spirit's sanctifying work, and Jesus' redemptive blood. The imagery of 'sprinkling with blood' (Ex. 24:8) echoes initiation into the covenant, prefigured in the Old Testament and fully realized in Christ."
    },
    {
      "pk": 5101003,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 3,
      "text": "Blessed be the God and Father of our Lord Jesus Christ! According to his great mercy, he has caused us to be born again to a living hope through the resurrection of Jesus Christ from the dead,",
      "links": "<a href='/AIV/43/3/3'>John 3:3</a>;<a href='/AIV/47/5/17'>2 Cor. 5:17</a>;<a href='/AIV/52/1/3'>1 Thess. 1:3</a>",
      "comment": "Peter emphasizes God as the author of our new birth, linked directly to Christ’s Resurrection. Being 'born again' is a supernatural work (John 3:3), showing that salvation is more than a decision—it's a re-creation effected by God."
    },
    {
      "pk": 5101004,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 4,
      "text": "into an inheritance that is eternal, undefiled, and unfading, kept in heaven for you,",
      "links": "<a href='/AIV/51/1/5'>Col. 1:5</a>;<a href='/AIV/40/6/20'>Matt. 6:20</a>",
      "comment": "The 'inheritance' is secure and everlasting, contrasting with earthly possessions. The safekeeping in heaven implies a present reality and future fulfillment, echoing Jesus’ teaching (Matt. 6:20) and connecting to the hope Christians possess."
    },
    {
      "pk": 5101005,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 5,
      "text": "who are guarded by God’s power through faith for a salvation ready to be revealed in the last time.",
      "links": "<a href='/AIV/50/1/6'>Phil. 1:6</a>;<a href='/AIV/45/8/18'>Rom. 8:18</a>",
      "comment": "God’s ongoing protection keeps believers spiritually secure. Salvation here has both present and future aspects; it is experienced now and revealed fully at the end. Faith is both a response and a sustaining gift."
    },
    {
      "pk": 5101006,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 6,
      "text": "In this you rejoice, though now for a short time, if necessary, you are grieved by various trials,",
      "links": "<a href='/AIV/45/5/2-3'>Rom. 5:2-3</a>;<a href='/AIV/43/16/33'>John 16:33</a>",
      "comment": "Believers can rejoice because of future glory, even in trials. Suffering has purpose—producing endurance and testing faith (Rom. 5:2–3)."
    },
    {
      "pk": 5101007,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 7,
      "text": "so that the proven genuineness of your faith—more precious than gold that perishes though refined by fire—may be found to result in praise, glory, and honor at the revelation of Jesus Christ.",
      "links": "<a href='/AIV/18/23/10'>Job 23:10</a>;<a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "Faith is compared to gold, tested by fire to reveal its value. God’s final judgment brings ultimate recognition for genuine faith. Note also the emphasis on praise at Christ’s return, pointing Christians toward heavenly reward."
    },
    {
      "pk": 5101008,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 8,
      "text": "Though you have not seen him, you love him. Though not now seeing him, yet believing in him, you rejoice with a joy inexpressible and filled with glory,",
      "links": "<a href='/AIV/43/20/29'>John 20:29</a>;<a href='/AIV/47/5/7'>2 Cor. 5:7</a>",
      "comment": "Peter addresses faith in Jesus without seeing Him physically (John 20:29), highlighting the blessing of faith and the joy that comes with it."
    },
    {
      "pk": 5101009,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 9,
      "text": "receiving the outcome of your faith, the salvation of your souls.",
      "links": "<a href='/AIV/45/1/16'>Rom. 1:16</a>;<a href='/AIV/58/10/39'>Heb. 10:39</a>",
      "comment": "Salvation is both a present possession and a future promise. 'Salvation of your souls' encompasses the fullness of redemption, not only of the spirit but ultimately of the whole person."
    },
    {
      "pk": 5101010,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 10,
      "text": "Concerning this salvation, the prophets who prophesied about the grace that was to come to you searched and investigated carefully,",
      "links": "<a href='/AIV/23/53/11'>Isa. 53:11</a>;<a href='/AIV/27/12/4'>Dan. 12:4</a>",
      "comment": "Old Testament prophets anticipated the grace now fully revealed in Christ. Their prophecies are fulfilled in the New Covenant, affirming the unity of Scripture and God’s overarching plan."
    },
    {
      "pk": 5101011,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 11,
      "text": "inquiring what person or time the Spirit of Christ within them was indicating when predicting the sufferings of Christ and the glories that would follow.",
      "links": "<a href='/AIV/23/53/3-12'>Isa. 53:3-12</a>;<a href='/AIV/19/22/1-31'>Ps. 22:1-31</a>",
      "comment": "The 'Spirit of Christ' indicates Christ’s preexistence (see John 1:1) and divinity. The prophets saw glimpses of the Messiah’s suffering and victory, showing the continuity between Old and New Testaments."
    },
    {
      "pk": 5101012,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 12,
      "text": "It was revealed to them that they were not serving themselves, but you, in the things which now have been announced to you through those who preached the gospel to you by the Holy Spirit sent from heaven—things into which angels desire to look.",
      "links": "<a href='/AIV/40/13/17'>Matt. 13:17</a>;<a href='/AIV/58/2/16'>Heb. 2:16</a>",
      "comment": "The gospel is the fulfillment of prophetic anticipation. The Spirit’s work through preachers continues the mission of the prophets. The mystery of salvation is so profound that even angels long to understand it."
    },
    {
      "pk": 5101013,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 13,
      "text": "Therefore, prepare your minds for action, be sober-minded, and set your hope fully on the grace being brought to you at the revelation of Jesus Christ.",
      "links": "<a href='/AIV/49/6/14'>Eph. 6:14</a>;<a href='/AIV/46/15/34'>1 Cor. 15:34</a>",
      "comment": "Active, disciplined minds are necessary for walking in hope. ‘Sober-minded’ emphasizes spiritual vigilance, and setting hope on future grace shows both present effort and future expectation."
    },
    {
      "pk": 5101014,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 14,
      "text": "As obedient children, do not be shaped by the desires you once had in your ignorance,",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>",
      "comment": "Obedience is linked to new identity as God’s children. The transformation involves not conforming to previous sinful patterns—a call to repentance and ongoing conversion."
    },
    {
      "pk": 5101015,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 15,
      "text": "but as he who called you is holy, you also be holy in all your conduct,",
      "links": "<a href='/AIV/03/11/44'>Lev. 11:44</a>;<a href='/AIV/40/5/48'>Matt. 5:48</a>",
      "comment": "Holiness is not simply avoidance of sin, but active reflection of God's own character. This is both a command and a promise, for God supplies the grace to be made holy."
    },
    {
      "pk": 5101016,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 16,
      "text": "because it is written, 'You shall be holy, for I am holy.'",
      "links": "<a href='/AIV/03/11/44'>Lev. 11:44</a>;<a href='/AIV/03/19/2'>Lev. 19:2</a>",
      "comment": "Peter directly quotes the Old Testament law to show continuity between Israel's call and the Christian call. Holiness is a central theme God intends for all His people."
    },
    {
      "pk": 5101017,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 17,
      "text": "And if you call on the Father who judges impartially according to each one’s deeds, conduct yourselves with reverent fear throughout your days of exile,",
      "links": "<a href='/AIV/19/62/12'>Ps. 62:12</a>;<a href='/AIV/45/2/6'>Rom. 2:6</a>",
      "comment": "Judgment is based on deeds, emphasizing that faith and works are inseparable in Christian living. Reverent fear reflects awe and respect before God, not terror. 'Days of exile' recalls the theme that our true citizenship is elsewhere."
    },
    {
      "pk": 5101018,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 18,
      "text": "knowing that you were ransomed from the futile ways inherited from your ancestors, not with perishable things such as silver or gold,",
      "links": "<a href='/AIV/23/52/3'>Isa. 52:3</a>",
      "comment": "Redemption is described economically, in contrast to earthly wealth. The Christian’s deliverance from sin is far more valuable, and cannot be purchased with money or earthly means."
    },
    {
      "pk": 5101019,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 19,
      "text": "but with the precious blood of Christ, like that of a lamb without blemish or spot.",
      "links": "<a href='/AIV/02/12/5'>Ex. 12:5</a>;<a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "Christ is the Passover Lamb, fulfilling the Old Testament sacrifices. His sinlessness ('without blemish') points to both His divinity and the sufficiency of His sacrifice."
    },
    {
      "pk": 5101020,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 20,
      "text": "He was foreknown before the foundation of the world but was revealed in these last times for your sake.",
      "links": "<a href='/AIV/43/17/24'>John 17:24</a>;<a href='/AIV/55/1/9-10'>2 Tim. 1:9-10</a>",
      "comment": "The eternal plan of God centers on Christ, who is both preexistent and revealed in history. Salvation’s universal scope is emphasized here."
    },
    {
      "pk": 5101021,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 21,
      "text": "Through him you are believers in God, who raised him from the dead and gave him glory, so that your faith and hope are in God.",
      "links": "<a href='/AIV/45/4/24'>Rom. 4:24</a>;<a href='/AIV/43/17/5'>John 17:5</a>",
      "comment": "Faith in God is specifically through Jesus, who is both Risen Lord and glorified Messiah. The Resurrection is foundational to Christian hope."
    },
    {
      "pk": 5101022,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 22,
      "text": "Having purified your souls by your obedience to the truth for a sincere brotherly love, love one another earnestly from a pure heart,",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>;<a href='/AIV/45/12/10'>Rom. 12:10</a>",
      "comment": "Obedience to the truth leads to genuine love—a key mark of true Christianity. This commandment echoes Christ's new command to love (John 13:34)."
    },
    {
      "pk": 5101023,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 23,
      "text": "since you have been born again, not of perishable seed but of imperishable, through the living and enduring word of God.",
      "links": "<a href='/AIV/59/1/18'>James 1:18</a>;<a href='/AIV/43/1/13'>John 1:13</a>",
      "comment": "The new birth comes through the word of God, which is living and eternal. Spiritual rebirth is contrasted with natural birth, highlighting its supernatural character."
    },
    {
      "pk": 5101024,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 24,
      "text": "For, 'All flesh is like grass, and all its glory like the flower of grass. The grass withers, and the flower falls,",
      "links": "<a href='/AIV/23/40/6-8'>Isa. 40:6–8</a>",
      "comment": "Peter quotes Isaiah to emphasize the temporary nature of human life compared to the enduring word of God. This contrast urges believers to fix their lives on what is eternal."
    },
    {
      "pk": 5101025,
      "translation": "AIV",
      "book": 60,
      "chapter": 1,
      "verse": 25,
      "text": "but the word of the Lord remains forever.' And this is the word that was proclaimed to you as good news.",
      "links": "<a href='/AIV/23/40/8'>Isa. 40:8</a>;<a href='/AIV/40/24/35'>Matt. 24:35</a>",
      "comment": "The gospel is identified as the eternal word of God, unchanging and enduring for all generations. The proclamation of this word is the foundation of faith, inviting trust in God’s continuing and authoritative revelation."
    }
  ],
  "translatedAt": "2025-12-23T04:14:35.875Z"
}