{
  "book": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 4,
  "verses": [
    {
      "pk": 1940101,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 1,
      "text": "Therefore, since Christ suffered in the flesh, arm yourselves also with the same resolve, because the one who has suffered in the flesh has ceased from sin,",
      "links": "<a href='/AIV/45/6/6-7'>Rom. 6:6-7</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "Peter calls believers to imitate Christ's attitude in suffering. The phrase 'has ceased from sin' indicates a decisive break with the power of sin, pointing to sanctification. Note the Christological focus on sharing in Christ's suffering (Phil. 3:10)."
    },
    {
      "pk": 1940102,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 2,
      "text": "so as to live the rest of the time in the flesh no longer for human desires but for the will of God.",
      "links": "<a href='/AIV/48/2/20'>Gal. 2:20</a>; <a href='/AIV/45/6/11-13'>Rom. 6:11-13</a>",
      "comment": "The believer’s life is no longer dominated by worldly desires but is oriented toward obedience to God’s will, reflecting true conversion and transformation (see Rom. 12:1-2)."
    },
    {
      "pk": 1940103,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 3,
      "text": "For you have spent enough time in the past doing what the Gentiles choose to do: living in sensuality, lusts, drunkenness, carousing, drinking parties, and detestable idolatries.",
      "links": "<a href='/AIV/56/3/3'>Titus 3:3</a>; <a href='/AIV/49/5/18'>Eph. 5:18</a>",
      "comment": "Contrasts the believer's former pagan lifestyle with their new calling. The mention of 'detestable idolatries' may hint at not only literal idol worship but the idolatry of sinful habits (Eph. 2:1-3)."
    },
    {
      "pk": 1940104,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 4,
      "text": "They are surprised that you do not join them in the same flood of reckless living, and so they maligned you.",
      "links": "<a href='/AIV/43/15/19'>John 15:19</a>; <a href='/AIV/50/3/20'>Phil. 3:20</a>",
      "comment": "Social exclusion and slander were common consequences for Christians who rejected pagan norms. This echoes Jesus' warning that the world would hate His disciples (John 15:19)."
    },
    {
      "pk": 1940105,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 5,
      "text": "But they will give account to Him who is ready to judge the living and the dead.",
      "links": "<a href='/AIV/44/10/42'>Acts 10:42</a>; <a href='/AIV/55/4/1'>2 Tim. 4:1</a>",
      "comment": "Final judgment is emphasized here. The phrase 'judge the living and the dead' alludes to the universal scope of Christ's authority as Judge (Acts 10:42), and hints at the importance of vigilance and faithfulness."
    },
    {
      "pk": 1940106,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 6,
      "text": "For this reason the gospel was preached even to those who are now dead, so that though judged in the flesh as men, they might live in the spirit according to God.",
      "links": "<a href='/AIV/60/3/19'>1 Pet. 3:19</a>; <a href='/AIV/43/5/25'>John 5:25</a>",
      "comment": "Refers either to the spiritually dead or those believers who have died physically. The emphasis is that the gospel brings life beyond physical death (cf. John 5:25; see also the possibility of a post-mortem proclamation per tradition)."
    },
    {
      "pk": 1940107,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 7,
      "text": "The end of all things is near; therefore be self-controlled and sober-minded for prayer.",
      "links": "<a href='/AIV/45/13/12'>Rom. 13:12</a>; <a href='/AIV/46/7/29'>1 Cor. 7:29</a>",
      "comment": "Peter urges readiness for Christ’s return, linking vigilance, clear-mindedness, and prayer. Living with eschatological hope is a mark of authentic Christian life."
    },
    {
      "pk": 1940108,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 8,
      "text": "Above all, keep loving one another earnestly, for love covers a multitude of sins.",
      "links": "<a href='/AIV/20/10/12'>Prov. 10:12</a>; <a href='/AIV/40/22/37-39'>Matt. 22:37-39</a>",
      "comment": "Peter echoes the primacy of love, referencing Proverbs 10:12. Love unites and mends the community, reflecting the command of Jesus for His followers to love as a sign of true discipleship."
    },
    {
      "pk": 1940109,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 9,
      "text": "Offer hospitality to one another without grumbling.",
      "links": "<a href='/AIV/58/13/2'>Heb. 13:2</a>; <a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "Christian love is put into practice through hospitality. Showing kindness reflects the teaching of Jesus about welcoming others as we would Him (Matt. 25:35)."
    },
    {
      "pk": 1940110,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 10,
      "text": "As each has received a gift, use it to serve one another, as good stewards of God’s varied grace.",
      "links": "<a href='/AIV/46/12/4-11'>1 Cor. 12:4-11</a>; <a href='/AIV/45/12/6-8'>Rom. 12:6-8</a>",
      "comment": "Spiritual gifts are to be used in service to the community, reflecting divine grace. The stewardship motif suggests a responsibility for God’s gifts—a subtle allusion to the value of tradition and ordered service."
    },
    {
      "pk": 1940111,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 11,
      "text": "If anyone speaks, let it be as one who speaks the oracles of God; if anyone serves, let it be with the strength that God supplies, so that in everything God may be glorified through Jesus Christ, to whom belong glory and power forever and ever. Amen.",
      "links": "<a href='/AIV/45/11/36'>Rom. 11:36</a>; <a href='/AIV/65/1/25'>Jude 1:25</a>",
      "comment": "Christian ministry is not self-powered but is for God's glory and comes through His grace in Christ. All gifts and actions are to culminate in worship and the exaltation of Christ (cf. Rom. 11:36)."
    },
    {
      "pk": 1940112,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 12,
      "text": "Beloved, do not be surprised at the fiery trial when it comes upon you to test you, as though something strange were happening to you.",
      "links": "<a href='/AIV/59/1/2-3'>Jas. 1:2-3</a>; <a href='/AIV/40/5/11-12'>Matt. 5:11-12</a>",
      "comment": "Trials and persecution are to be expected. Suffering, in the Christian view, purifies faith and unites the believer more closely with Christ (see Jas. 1:2-3)."
    },
    {
      "pk": 1940113,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 13,
      "text": "But rejoice as you share in Christ’s sufferings, so that you may also rejoice and be glad when His glory is revealed.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/40/5/12'>Matt. 5:12</a>",
      "comment": "Participation in Christ’s sufferings is a clear mark of union with Him; it leads to future joy at His return, reinforcing a theology of redemptive suffering."
    },
    {
      "pk": 1940114,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 14,
      "text": "If you are insulted for the name of Christ, you are blessed, because the Spirit of glory and of God rests upon you.",
      "links": "<a href='/AIV/40/5/11'>Matt. 5:11</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>",
      "comment": "Echoing the Beatitudes (Matt. 5:11), Peter assures believers that insults for Christ’s sake are evidence of the Spirit’s presence—a hint of the special grace given to those who suffer for the faith."
    },
    {
      "pk": 1940115,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 15,
      "text": "Let none of you suffer as a murderer or a thief or an evildoer or as a meddler.",
      "links": "<a href='/AIV/52/4/11'>1 Thess. 4:11</a>; <a href='/AIV/45/13/13'>Rom. 13:13</a>",
      "comment": "Not all suffering is a mark of faith; only suffering for righteousness' sake is blessed. Suffering deserved for wrongdoing is not considered godly suffering."
    },
    {
      "pk": 1940116,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 16,
      "text": "Yet if anyone suffers as a Christian, let him not be ashamed, but let him glorify God in that name.",
      "links": "<a href='/AIV/44/5/41'>Acts 5:41</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "Suffering for the name of Christ is an honor and an opportunity to publicly glorify God—a call to boldness in witness."
    },
    {
      "pk": 1940117,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 17,
      "text": "For it is time for judgment to begin at the household of God; and if it begins with us, what will be the outcome for those who do not obey the gospel of God?",
      "links": "<a href='/AIV/26/9/6'>Ezek. 9:6</a>; <a href='/AIV/45/2/8'>Rom. 2:8</a>",
      "comment": "Judgment begins with God’s people—a call to holiness. God purifies His people first (Ezek. 9:6), implying order and governance within the household."
    },
    {
      "pk": 1940118,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 18,
      "text": "And if the righteous is scarcely saved, what will become of the ungodly and the sinner?",
      "links": "<a href='/AIV/20/11/31'>Prov. 11:31</a>; <a href='/AIV/45/9/29'>Rom. 9:29</a>",
      "comment": "Quoting Proverbs 11:31, Peter intensifies the warning: salvation is not taken for granted, and discipline is a part of the path for the righteous."
    },
    {
      "pk": 1940119,
      "translation": "AIV",
      "book": 60,
      "chapter": 4,
      "verse": 19,
      "text": "So then let those who suffer according to God’s will entrust their souls to a faithful Creator while doing good.",
      "links": "<a href='/AIV/19/31/5'>Ps. 31:5</a>; <a href='/AIV/42/23/46'>Luke 23:46</a>",
      "comment": "The encouragement to entrust oneself to God echoes Jesus’ own dying words (Luke 23:46), a model of perfect trust in divine providence and perseverance in good works, even in suffering."
    }
  ],
  "translatedAt": "2025-12-23T04:15:43.237Z"
}