{
  "book": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 5,
  "verses": [
    {
      "pk": 43051001,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 1,
      "text": "So I urge the elders among you, as a fellow elder and a witness of the sufferings of Christ, and also a sharer in the glory that will be revealed:",
      "links": "<a href='/AIV/42/24/48'>Luke 24:48</a>; <a href='/AIV/44/1/8'>Acts 1:8</a>",
      "comment": "Peter addresses the leaders (elders) of the church, affirming his authority as an eyewitness of Jesus' suffering and the coming glory. The reference to sharing in future glory points to the incorruptible reward promised to those who persevere."
    },
    {
      "pk": 43051002,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 2,
      "text": "Shepherd the flock of God that is among you, serving as overseers—not under compulsion, but willingly, as God wants; not for shameful gain, but eagerly;",
      "links": "<a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/44/20/28'>Acts 20:28</a>",
      "comment": "Peter instructs the elders to act as true shepherds after the example of Christ, caring for God’s people. The term 'overseers' (episkopoi) highlights the role of authority and spiritual guidance in the early church (cf. Acts 20:28)."
    },
    {
      "pk": 43051003,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 3,
      "text": "not as those who lord it over those entrusted to you, but being examples to the flock.",
      "links": "<a href='/AIV/40/20/25-28'>Matt. 20:25–28</a>; <a href='/AIV/50/3/17'>Phil. 3:17</a>",
      "comment": "Christian leadership is marked by humility and service, not domination—reflecting Christ's words about servant leadership (<a href='/AIV/40/20/25-28'>Matt. 20:25–28</a>)."
    },
    {
      "pk": 43051004,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 4,
      "text": "And when the Chief Shepherd appears, you will receive the unfading crown of glory.",
      "links": "<a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/46/9/25'>1 Cor. 9:25</a>",
      "comment": "The 'Chief Shepherd' is a title for Christ, emphasizing His supreme authority over all church leaders. The 'crown of glory' points toward the future reward for the faithful. The shepherd imagery underscores the unity and hierarchy in God's people."
    },
    {
      "pk": 43051005,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 5,
      "text": "Likewise, you who are younger, submit yourselves to the elders. And all of you, clothe yourselves with humility toward one another, for ‘God resists the proud but gives grace to the humble.’",
      "links": "<a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "Obedience to Church authority and mutual humility are central to Christian life. Peter references Proverbs 3:34, showing continuity with Old Testament wisdom. Submission to elder authority, practiced with humility, maintains harmony and order in the church."
    },
    {
      "pk": 43051006,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 6,
      "text": "Humble yourselves, therefore, under the mighty hand of God, so that He may lift you up at the proper time.",
      "links": "<a href='/AIV/42/14/11'>Luke 14:11</a>; <a href='/AIV/18/22/29'>Job 22:29</a>",
      "comment": "Humility before God leads to eventual exaltation—a principle both Christ and the Old Testament teach. Trust in divine timing is key; God exalts the humble in His perfect will."
    },
    {
      "pk": 43051007,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 7,
      "text": "Cast all your anxieties on Him, because He cares for you.",
      "links": "<a href='/AIV/19/55/22'>Ps. 55:22</a>; <a href='/AIV/40/6/25-34'>Matt. 6:25–34</a>",
      "comment": "Believers are invited to entrust every worry to God, confident of His fatherly care. Echoes the theme of trust found throughout both Old and New Testaments."
    },
    {
      "pk": 43051008,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 8,
      "text": "Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion, seeking whom he may devour.",
      "links": "<a href='/AIV/18/1/7'>Job 1:7</a>; <a href='/AIV/49/6/11-12'>Eph. 6:11–12</a>",
      "comment": "A reminder that spiritual vigilance is essential—the devil seeks to destroy faith, echoing the image from Job and reinforcing the need for steadfastness and spiritual armor (<a href='/AIV/49/6/11-12'>Eph. 6:11–12</a>)."
    },
    {
      "pk": 43051009,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 9,
      "text": "Resist him, firm in your faith, knowing that the same kinds of sufferings are being experienced by your fellow believers throughout the world.",
      "links": "<a href='/AIV/59/4/7'>James 4:7</a>; <a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "All believers share in spiritual warfare and perseverance through suffering. Peter emphasizes solidarity and perseverance—key marks of the universal Church."
    },
    {
      "pk": 43051010,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 10,
      "text": "And after you have suffered a little while, the God of all grace, who has called you to His eternal glory in Christ, will Himself restore, establish, strengthen, and settle you.",
      "links": "<a href='/AIV/45/8/17-18'>Rom. 8:17–18</a>; <a href='/AIV/52/2/12'>1 Thess. 2:12</a>",
      "comment": "Suffering is temporary but leads to glory. God’s personal intervention assures believers of complete restoration. Such promises are fulfilled in Christ’s victory (cf. <a href='/AIV/45/8/17-18'>Rom. 8:17–18</a>)."
    },
    {
      "pk": 43051011,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 11,
      "text": "To Him be the power forever and ever. Amen.",
      "links": "<a href='/AIV/65/1/25'>Jude 1:25</a>; <a href='/AIV/50/4/20'>Phil. 4:20</a>",
      "comment": "A doxology glorifying God for His sovereign power and eternal rule, consistent with many expressions of worship in Scripture."
    },
    {
      "pk": 43051012,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 12,
      "text": "By Silvanus, a faithful brother as I consider him, I have written to you briefly, encouraging and testifying that this is the true grace of God. Stand firm in it.",
      "links": "<a href='/AIV/44/15/22'>Acts 15:22</a>; <a href='/AIV/53/1/1'>2 Thess. 1:1</a>",
      "comment": "Silvanus (Silas) serves as messenger and scribe. Peter’s summary reminds the church that the gracious gospel they received is authentic and worth standing firm in. Note the early use of trusted leaders to preserve and transmit apostolic teaching."
    },
    {
      "pk": 43051013,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 13,
      "text": "She who is in Babylon, chosen together with you, greets you, and so does my son Mark.",
      "links": "<a href='/AIV/44/12/12'>Acts 12:12</a>; <a href='/AIV/64/1/1'>2 John 1:1</a>",
      "comment": "‘Babylon’ is likely a symbolic reference to Rome—the center of early Christian witness and suffering. Mark, here called Peter’s ‘son’, is likely the evangelist, showing how apostolic leadership affirms and mentors future generations."
    },
    {
      "pk": 43051014,
      "translation": "AIV",
      "book": 60,
      "chapter": 5,
      "verse": 14,
      "text": "Greet one another with a kiss of love. Peace to you all who are in Christ.",
      "links": "<a href='/AIV/45/16/16'>Rom. 16:16</a>; <a href='/AIV/46/16/20'>1 Cor. 16:20</a>",
      "comment": "The 'kiss of love' was an expression of Christian unity and charity. This concluding blessing of peace reflects Christ’s gift of peace to His people. These ancient customs fostered visible unity among believers (see also <a href='/AIV/45/16/16'>Rom. 16:16</a>)."
    }
  ],
  "translatedAt": "2025-12-23T04:16:08.350Z"
}