{
  "book": 67,
  "bookName": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 5,
  "verses": [
    {
      "pk": 67005001,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 1,
      "text": "So I urge the elders among you, as a fellow elder and as a witness of the sufferings of Christ, and as one who will share in the glory that is about to be revealed:",
      "links": "<a href='/AIV/44/1/8'>Acts 1:8</a>; <a href='/AIV/60/4/13'>1 Pet. 4:13</a>",
      "comment": "Peter identifies himself as an elder, emphasizing shared leadership but also witness to Christ’s passion—a unique apostolic role. The glory refers to the future revelation, pointing towards the resurrection and eschatological hope."
    },
    {
      "pk": 67005002,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 2,
      "text": "Shepherd the flock of God that is among you, watching over them—not under compulsion, but willingly, as God desires; not for shameful gain, but eagerly.",
      "links": "<a href='/AIV/43/21/15-17'>John 21:15-17</a>; <a href='/AIV/26/34/2-4'>Ezek. 34:2-4</a>",
      "comment": "The shepherd imagery recalls Christ’s commission to Peter (John 21), denoting spiritual oversight. Leading should reflect love and selfless service, echoing God’s heart for His people."
    },
    {
      "pk": 67005003,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 3,
      "text": "Do not domineer over those entrusted to you, but be examples to the flock.",
      "links": "<a href='/AIV/40/20/25-28'>Matt. 20:25-28</a>; <a href='/AIV/54/4/12'>1 Tim. 4:12</a>",
      "comment": "Spiritual authority should be shown through humble example, mirroring Christ’s servant leadership. The reference to being entrusted hints at a visible, structured leadership."
    },
    {
      "pk": 67005004,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 4,
      "text": "And when the Chief Shepherd appears, you will receive the unfading crown of glory.",
      "links": "<a href='/AIV/43/10/14'>John 10:14</a>; <a href='/AIV/55/4/8'>2 Tim. 4:8</a>",
      "comment": "Christ is the Chief Shepherd—the leader of all leaders. His return will bring reward to faithful servants. The term ‘unfading’ points towards eternal life and the imperishable nature of the soul’s reward."
    },
    {
      "pk": 67005005,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 5,
      "text": "Likewise, you who are younger, submit yourselves to the elders. And all of you, clothe yourselves with humility toward one another, because, ‘God opposes the proud but gives grace to the humble.’",
      "links": "<a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "Peter teaches humility and order—spiritual authority and submission, grounded in the Old Testament principle of grace for the humble. This echoes a structured community with roles and mutual respect."
    },
    {
      "pk": 67005006,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 6,
      "text": "Humble yourselves, therefore, under the mighty hand of God, so that He may exalt you at the proper time.",
      "links": "<a href='/AIV/18/22/29'>Job 22:29</a>; <a href='/AIV/40/23/12'>Matt. 23:12</a>",
      "comment": "True exaltation comes from God, not self-promotion. Humility in submission invites divine blessing—in spiritual tradition, humility has been seen as a path to sainthood."
    },
    {
      "pk": 67005007,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 7,
      "text": "Cast all your anxiety upon Him, because He cares for you.",
      "links": "<a href='/AIV/19/55/22'>Ps. 55:22</a>; <a href='/AIV/40/6/25-34'>Matt. 6:25-34</a>",
      "comment": "Entrusting worries to God is a call to childlike trust. Classic spiritual interpretation sees this as an invitation to a prayerful surrender—living faith that God is intimately involved in our lives."
    },
    {
      "pk": 67005008,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 8,
      "text": "Be sober-minded, be watchful. Your adversary the devil prowls around like a roaring lion, seeking someone to devour.",
      "links": "<a href='/AIV/18/1/7'>Job 1:7</a>; <a href='/AIV/42/22/31'>Luke 22:31</a>",
      "comment": "The reality of spiritual warfare is highlighted; vigilance and sobriety are necessary virtues. The lion imagery recalls spiritual testing and the importance of communal protection."
    },
    {
      "pk": 67005009,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 9,
      "text": "Resist him, standing firm in the faith, knowing that your brothers and sisters throughout the world are undergoing the same kinds of suffering.",
      "links": "<a href='/AIV/59/4/7'>James 4:7</a>; <a href='/AIV/45/8/17'>Rom. 8:17</a>",
      "comment": "Solidarity in suffering links all believers mystically together. The ‘faith’ here refers not simply to belief, but to the lived tradition handed down by the apostles. Note the global, unified community facing the same trials."
    },
    {
      "pk": 67005010,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 10,
      "text": "And after you have suffered a little while, the God of all grace, who has called you into His eternal glory in Christ, will Himself restore, confirm, strengthen, and establish you.",
      "links": "<a href='/AIV/47/4/17'>2 Cor. 4:17</a>; <a href='/AIV/52/2/12'>1 Thess. 2:12</a>",
      "comment": "God’s call to eternal glory in Christ points to a promise beyond earthly life, with restoration and confirmation offered by God Himself. Spiritual tradition sees this as predestination to glory."
    },
    {
      "pk": 67005011,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 11,
      "text": "To Him be dominion forever and ever. Amen.",
      "links": "<a href='/AIV/66/1/6'>Rev. 1:6</a>; <a href='/AIV/19/145/13'>Ps. 145:13</a>",
      "comment": "Christ’s divine dominion is affirmed, recognizing Him as eternal King. The doxology is notable for its high Christology, reinforcing the worship and honor due to Him."
    },
    {
      "pk": 67005012,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 12,
      "text": "By Silvanus, a faithful brother as I consider him, I have written to you briefly, exhorting and testifying that this is the true grace of God. Stand firm in it.",
      "links": "<a href='/AIV/44/15/22'>Acts 15:22</a>; <a href='/AIV/47/1/19'>2 Cor. 1:19</a>",
      "comment": "Silvanus is known as an apostolic companion, indicating the letter’s authority and continuity of teaching. ‘True grace’ suggests a singular apostolic tradition to be kept steadfastly."
    },
    {
      "pk": 67005013,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 13,
      "text": "She who is in Babylon, chosen together with you, greets you, and so does my son Mark.",
      "links": "<a href='/AIV/44/12/12'>Acts 12:12</a>; <a href='/AIV/55/4/11'>2 Tim. 4:11</a>",
      "comment": "‘Babylon’ is often understood symbolically for Rome, highlighting the universality of the church and shared election among believers. Mark’s mention reinforces continuity of apostolic witness."
    },
    {
      "pk": 67005014,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 5,
      "verse": 14,
      "text": "Greet one another with a kiss of love. Peace to all of you who are in Christ.",
      "links": "<a href='/AIV/45/16/16'>Rom. 16:16</a>; <a href='/AIV/49/6/23'>Eph. 6:23</a>",
      "comment": "The kiss of love symbolizes deep spiritual unity and peace—the fellowship of believers united in Christ, practiced from the earliest days as a sign of communion and peace."
    }
  ],
  "translatedAt": "2025-12-24T12:28:21.219Z"
}