{
  "book": 67,
  "bookName": "1 Peter",
  "bookAbbreviation": "1Pet",
  "chapter": 4,
  "verses": [
    {
      "pk": 67004001,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 1,
      "text": "Therefore, since Christ suffered in the flesh, arm yourselves also with the same purpose, because whoever has suffered in the flesh has finished with sin,",
      "links": "<a href='/AIV/60/2/21-24'>1Pet. 2:21-24</a>; <a href='/AIV/45/6/6-7'>Rom. 6:6-7</a>",
      "comment": "This verse calls Christians to imitate Christ by being ready to suffer, understanding that suffering for doing good is a participation in Christ's redemptive work. As Christ's suffering brought victory over sin, so the believer's willingness shares in that spiritual transformation. The spiritual emphasis is on conformity to Christ; the natural consequence is a turning from sin, as seen also in Paul’s teaching."
    },
    {
      "pk": 67004002,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 2,
      "text": "so as to live the rest of his time in the flesh no longer for human desires, but for the will of God.",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>; <a href='/AIV/48/2/20'>Gal. 2:20</a>",
      "comment": "Here, believers are called to a life oriented around pleasing God rather than following selfish passions. The underlying meaning is a transformation by grace, a theme prominent in apostolic tradition, showing sanctification is not a one-time event but an ongoing choice."
    },
    {
      "pk": 67004003,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 3,
      "text": "For the time that is past is enough for doing what the Gentiles want to do—living in sensuality, passions, drunkenness, orgies, drinking parties, and lawless idolatry.",
      "links": "<a href='/AIV/49/5/18'>Eph. 5:18</a>; <a href='/AIV/52/4/5'>1Thess. 4:5</a>; <a href='/AIV/45/13/13'>Rom. 13:13</a>",
      "comment": "Peter contrasts the former pagan lifestyle with the new life in Christ. The litany of sins reflects Greco-Roman practices, but also a spiritual call to repentance and turning toward holiness. Implicit is the idea that the believer enters a holy community and leaves behind disorder."
    },
    {
      "pk": 67004004,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 4,
      "text": "They are surprised that you do not join them in the same flood of wild living, and they slander you.",
      "links": "<a href='/AIV/46/6/11'>1Cor. 6:11</a>; <a href='/AIV/60/2/12'>1Pet. 2:12</a>",
      "comment": "Early Christians often faced misunderstanding and mockery for their new way of living. The phrase 'flood of wild living' suggests chaos in contrast to the ordered life of grace. The opposition further sets the believer apart as belonging to God’s church."
    },
    {
      "pk": 67004005,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 5,
      "text": "But they will have to give an account to him who is ready to judge the living and the dead.",
      "links": "<a href='/AIV/55/4/1'>2Tim. 4:1</a>; <a href='/AIV/40/25/31-32'>Matt. 25:31-32</a>",
      "comment": "The sober warning here points to the final judgment. Christ is portrayed as the coming judge, a high christological teaching signifying His divine authority over all people, living and dead. The concept of accountability transcends earthly divisions."
    },
    {
      "pk": 67004006,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 6,
      "text": "For this is why the gospel was preached even to those who are now dead, that though judged in the flesh as humans, they might live in the spirit before God.",
      "links": "<a href='/AIV/60/3/19'>1Pet. 3:19</a>; <a href='/AIV/43/5/25'>John 5:25</a>",
      "comment": "This verse reflects the mysterious preaching to the dead, bridging the justice and mercy of God. The spiritual meaning refers to the hope of eternal life through Christ. The phrase supports the unity of the church—across the living and the dead—who share in the hope of resurrection."
    },
    {
      "pk": 67004007,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 7,
      "text": "The end of all things is near; therefore be self-controlled and alert for the sake of your prayers.",
      "links": "<a href='/AIV/45/13/11'>Rom. 13:11</a>; <a href='/AIV/46/7/29'>1Cor. 7:29</a>",
      "comment": "Awareness of the end times calls for a disciplined, prayerful life. Prayer is central in drawing near to God—this echoes the ancient pattern of corporate and individual prayer at the heart of Christian living."
    },
    {
      "pk": 67004008,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 8,
      "text": "Above all, keep loving one another earnestly, because love covers over a multitude of sins.",
      "links": "<a href='/AIV/20/10/12'>Prov. 10:12</a>; <a href='/AIV/43/13/34-35'>John 13:34-35</a>",
      "comment": "Love is placed as the highest virtue, echoing Jesus’ command. The citation from Proverbs gives an Old Testament anchor to the foundational unity of the church, where forgiveness is exercised within a holy community."
    },
    {
      "pk": 67004009,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 9,
      "text": "Be hospitable to one another without complaining.",
      "links": "<a href='/AIV/58/13/2'>Heb. 13:2</a>; <a href='/AIV/60/3/8'>1Pet. 3:8</a>",
      "comment": "Practicing hospitality is a mark of true faith. Early believers opened their homes for worship and caring for others, reflecting the communal nature and mutual support within the church."
    },
    {
      "pk": 67004010,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 10,
      "text": "As each has received a gift, use it to serve one another, as good stewards of God’s varied grace.",
      "links": "<a href='/AIV/46/12/7'>1Cor. 12:7</a>; <a href='/AIV/45/12/6'>Rom. 12:6</a>",
      "comment": "Every believer receives spiritual gifts, not for self, but for building up others. Spiritual gifts are distributed so the whole church is supplied and Christ is glorified through harmonious service—a consistent teaching tracing to the apostles."
    },
    {
      "pk": 67004011,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 11,
      "text": "If anyone speaks, let him speak as one speaking the very words of God. If anyone serves, let him serve by the strength that God supplies, so that in everything God may be glorified through Jesus Christ. To him belong glory and power forever and ever. Amen.",
      "links": "<a href='/AIV/45/11/36'>Rom. 11:36</a>; <a href='/AIV/54/6/16'>1Tim. 6:16</a>",
      "comment": "All ministries, whether speaking or serving, should point to God’s glory. The closing doxology elevates Christ’s role as the one through whom all true worship flows—a clear affirmation of Christ’s divinity."
    },
    {
      "pk": 67004012,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 12,
      "text": "Beloved, do not be surprised at the fiery ordeal among you, which comes to test you, as though something strange were happening to you.",
      "links": "<a href='/AIV/59/1/2-3'>James 1:2-3</a>; <a href='/AIV/18/23/10'>Job 23:10</a>",
      "comment": "Persecution and trials are expected in Christian life. Such tests refine faith, similar to the spiritual ‘testing by fire’ imagery found in the Old Testament. Suffering is not a sign of failure but of God’s sanctifying work."
    },
    {
      "pk": 67004013,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 13,
      "text": "But to the extent that you share in Christ’s sufferings, rejoice, so that when his glory is revealed you may also rejoice with exceeding joy.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/40/5/12'>Matt. 5:12</a>",
      "comment": "Suffering with Christ is participation in His redemptive work. The promise here is future joy at Christ’s return, linking present trials with hope and the reward of final glory—a theme woven throughout apostolic teaching."
    },
    {
      "pk": 67004014,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 14,
      "text": "If you are insulted for the name of Christ, you are blessed, because the Spirit of glory and of God rests upon you.",
      "links": "<a href='/AIV/40/5/11'>Matt. 5:11</a>; <a href='/AIV/44/7/55'>Acts 7:55</a>",
      "comment": "Suffering for Christ is a sign of blessing. The Spirit resting upon the believer is reminiscent of Old Testament prophets, indicating God's special favor is seen especially in those enduring persecution for the faith."
    },
    {
      "pk": 67004015,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 15,
      "text": "But let none of you suffer as a murderer, a thief, an evildoer, or as a meddler.",
      "links": "<a href='/AIV/60/2/20'>1Pet. 2:20</a>",
      "comment": "Not all suffering is meritorious; Peter distinguishes between suffering for righteousness and for wrongdoing. The moral life is an expected fruit of living in God's grace."
    },
    {
      "pk": 67004016,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 16,
      "text": "But if anyone suffers as a Christian, let him not be ashamed, but let him glorify God in that name.",
      "links": "<a href='/AIV/44/11/26'>Acts 11:26</a>; <a href='/AIV/55/1/8'>2Tim. 1:8</a>",
      "comment": "The term 'Christian' was originally a term of reproach, but Peter reclaims it as one of honor. Suffering for Christ brings glory to God and strengthens the identity of the one, holy, and apostolic church founded in Christ."
    },
    {
      "pk": 67004017,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 17,
      "text": "For it is time for judgment to begin at the household of God; and if it begins with us, what will be the outcome for those who do not obey the gospel of God?",
      "links": "<a href='/AIV/26/9/6'>Ezek. 9:6</a>; <a href='/AIV/45/2/9'>Rom. 2:9</a>",
      "comment": "Peter stresses the priority of God’s people in the divine plan; the church is purified first, before judgment falls on the world. Spiritual discipline and repentance are continual aspects of faithful living."
    },
    {
      "pk": 67004018,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 18,
      "text": "And if it is hard for the righteous to be saved, what will become of the ungodly and the sinner?",
      "links": "<a href='/AIV/20/11/31'>Prov. 11:31</a>",
      "comment": "Quoting the Greek version of Proverbs, this is a grave reminder to pursue holiness. Salvation is a gift, but it is also something worked out with effort and fear, as Paul notes. Holiness is a process, not a guarantee by simple profession."
    },
    {
      "pk": 67004019,
      "translation": "AIV",
      "book": 67,
      "bookName": "1 Peter",
      "bookAbbreviation": "1Pet",
      "chapter": 4,
      "verse": 19,
      "text": "So then, let those who suffer according to God’s will entrust their souls to their faithful Creator while doing good.",
      "links": "<a href='/AIV/19/31/5'>Ps. 31:5</a>; <a href='/AIV/60/2/23'>1Pet. 2:23</a>",
      "comment": "In the face of suffering, trust in God’s loving providence is essential. The call to persevere in doing good, despite hardship, is connected to Christ’s own example and the lifestyle of the apostles, whose full union with Christ is seen as participation in His suffering and victory."
    }
  ],
  "translatedAt": "2025-12-24T12:28:05.756Z"
}