{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 11,
  "verses": [
    {
      "pk": 20011001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 1,
      "text": "Now the king of Egypt gathered a great army, like sand on the shore of the sea, and many ships, and sought to seize Alexander’s kingdom by deception, and add it to his own.",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>; <a href='/AIV/19/139/18'>Ps. 139:18</a>",
      "comment": "The king of Egypt here refers to Ptolemy VI Philometor. 'Sand on the shore' is an Old Testament image for an uncountable multitude (see Gen. 22:17). The pattern of nations rising against each other, even through deception, mirrors prophecies of turmoil before the full establishment of God’s reign."
    },
    {
      "pk": 20011002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 2,
      "text": "He went into Syria with words of peace, and the people opened their gates to him, for King Alexander had commanded them to come out to meet him, because he was his father-in-law.",
      "links": "<a href='/AIV/20/10/51'>1Macc 10:51</a>",
      "comment": "Alexander's marriage alliance with Ptolemy initially seems to secure peace. Political marriages often appear in Old Testament narratives as ways to secure kingdoms (cf. Solomon in 1 Kgs 11:1-2); yet these often led to unforeseen conflicts. The theme underscores the difference between temporal and eternal peace."
    },
    {
      "pk": 20011003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 3,
      "text": "But as soon as he entered the cities, Ptolemy stationed soldiers in every city.",
      "links": "<a href='/AIV/09/08/11-18'>1 Sam. 8:11-18</a>",
      "comment": "Here, trust is betrayed as Ptolemy moves to occupy Alexander’s cities. The motif echoes Samuel's warning about kings seizing what is not theirs. The instability of earthly rulers points to the need for a kingdom not of this world (cf. John 18:36)."
    },
    {
      "pk": 20011004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 4,
      "text": "When he came near Azotus, they showed him the temple of Dagon burned, Azotus and its suburbs destroyed, the corpses scattered, and the charred remains of those whom Jonathan had burned in the battle.",
      "links": "<a href='/AIV/20/10/84'>1Macc 10:84</a>; <a href='/AIV/07/16/23'>Judg. 16:23</a>",
      "comment": "Jonathan’s prior destruction of the false god Dagon’s temple is reminiscent of Samson’s actions (Judges 16). The victory over idols shows Israel’s call to pure worship, prefiguring the purification of the temple and even hints of the New Testament fulfillment in the cleansing of the Temple by Christ."
    },
    {
      "pk": 20011005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 5,
      "text": "They piled up the bodies around his way; he praised them for it, but kept silent.",
      "links": "<a href='/AIV/20/10/83-84'>1Macc 10:83-84</a>",
      "comment": "This solemn depiction of judgment prefigures final accountability before God, which receives fuller revelation in later Scripture (see Matt. 25:31-46). Ptolemy's silence over judgment is a foil to God's righteous judgment."
    },
    {
      "pk": 20011006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 6,
      "text": "Then Jonathan met the king at Joppa with splendor, and they greeted one another and spent the night there.",
      "links": "<a href='/AIV/20/10/60'>1Macc 10:60</a>",
      "comment": "Joppa was a significant port (cf. Jonah 1:3; Acts 10:5). This meeting demonstrates the ongoing political activity of faithful leaders interacting with the powers of this world, paralleling the faithful remnant who interact but do not compromise with larger empires."
    },
    {
      "pk": 20011007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 7,
      "text": "Jonathan walked with the king as far as the river, and the king returned to his lodging; but Jonathan went back to Jerusalem.",
      "links": "<a href='/AIV/20/10/87'>1Macc 10:87</a>",
      "comment": "Jonathan’s loyalty to Jerusalem, returning immediately after his diplomatic meeting, highlights his devotion to Zion, the center of true worship (see Ps. 137:5-6)."
    },
    {
      "pk": 20011008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 8,
      "text": "But the king took control of the coastal cities up to Seleucia by the sea, devising evil plans against Alexander.",
      "links": "",
      "comment": "Ptolemy's further conquests show the relentless ambitions of earthly kings, contrasting with faithful servants who seek peace and justice. The use of ‘evil plans’ alludes to Psalm 2 where kings plot in vain against the Lord’s anointed."
    },
    {
      "pk": 20011009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 9,
      "text": "He sent ambassadors to King Demetrius, offering these words: 'Come, let us make a covenant between us. I will give you my daughter, whom Alexander has, and you will reign over your father's kingdom.'",
      "links": "",
      "comment": "Covenant language emphasizes the gravity of these political maneuvers, echoing but distorting the biblical covenants. Human covenants, apart from God, often fail, foreshadowing the ultimate unbreakable covenant in Christ (see Hebrews 8:6)."
    },
    {
      "pk": 20011010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 10,
      "text": "For I am sorry I gave my daughter to him, for he has sought to kill me.",
      "links": "",
      "comment": "The reversal of political allegiances is a recurring theme. The sorrow over the marriage recalls similar sentiments in the accounts of Saul and David (1 Samuel 18–19), suggesting that trust placed in human arrangements without God’s blessing leads to trouble."
    },
    {
      "pk": 20011011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 11,
      "text": "He slandered Alexander, because he coveted his kingdom.",
      "links": "<a href='/AIV/09/18/8-9'>1 Sam. 18:8-9</a>",
      "comment": "Covetousness here brings to mind the tenth commandment (Exodus 20:17). The seeking of kingdoms parallels spiritual warfare—a call to seek the kingdom of God first (Matt. 6:33)."
    },
    {
      "pk": 20011012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 12,
      "text": "He took back his daughter from Alexander and gave her to Demetrius, breaking with Alexander and making their enmity clear.",
      "links": "",
      "comment": "The shifting alliances foreshadow the instability of human kingdoms. New Testament fulfillment comes as Christ establishes unity where the world is divided (cf. Eph. 2:14)."
    },
    {
      "pk": 20011013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 13,
      "text": "Then Ptolemy entered Antioch and placed the crown of Asia upon his own head. Thus he placed two crowns on his head, that of Egypt and Asia.",
      "links": "",
      "comment": "The quest for double kingship alludes to ancient ambitions to unite lands under a single ruler. Biblically, Christ alone rightly wears many crowns (Rev. 19:12), symbolizing ultimate kingship."
    },
    {
      "pk": 20011014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 14,
      "text": "King Alexander was in Cilicia at this time, because the people there had rebelled.",
      "links": "",
      "comment": "Alexander’s distracted absence during anti-his rebellion highlights how fragile earthly authority is compared to the sovereign rule of God (Daniel 2:21)."
    },
    {
      "pk": 20011015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 15,
      "text": "When Ptolemy learned this, he sent an army with many chariots and cavalry against him, and came upon him in Cilicia.",
      "links": "",
      "comment": "The familiar pattern of political betrayal and war underscores the recurring theme of human frailty. The deployment of chariots recalls Egyptian power (Exodus 14:6-7)."
    },
    {
      "pk": 20011016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 16,
      "text": "Alexander fled, and the king pursued him and captured him.",
      "links": "",
      "comment": "No escape from justice—a notion seen throughout Scripture. Yet earthly justice is temporal; true and final justice is in God’s hands (Heb. 9:27)."
    },
    {
      "pk": 20011017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 17,
      "text": "He sent word to King Ptolemy in Egypt that Alexander had fled.",
      "links": "",
      "comment": "Communication between ancient kings was a key tactic in maintaining and shifting power. This smaller detail shows the political calculations even amid open warfare."
    },
    {
      "pk": 20011018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 18,
      "text": "Ptolemy’s forces pursued and overtook him. Alexander was captured and brought to Ptolemy, who killed him.",
      "links": "",
      "comment": "The fate of Alexander is a warning that alliances formed outside of God’s will lead to ruin, reinforcing the biblical wisdom of trusting in God and not princes (Ps. 146:3)."
    },
    {
      "pk": 20011019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 19,
      "text": "Ptolemy ruled over the cities of Asia; he set garrisons in each city.",
      "links": "",
      "comment": "Earthly dominion is fleeting; the true city of God will need no garrisons, but will be protected by God Himself (Rev. 21:2-27)."
    },
    {
      "pk": 20011020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 20,
      "text": "But he heard that Demetrius had raised up other forces against him.",
      "links": "",
      "comment": "Even new rulers must constantly watch for rivals. The lack of peace mirrors Christ’s words about division in the world until the final establishment of his kingdom (Matt. 24:6-7)."
    },
    {
      "pk": 20011021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 21,
      "text": "Ptolemy was troubled at heart, returned to Egypt, and died there in the one hundred forty-third year.",
      "links": "",
      "comment": "Human glory fails; Ptolemy’s reign ends in insecurity and death. The dating reflects the Seleucid era, which provides historical grounding—a reminder that God’s interventions occur in real time and history."
    },
    {
      "pk": 20011022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 22,
      "text": "In those days Jonathan gathered those from Judea to attack the citadel in Jerusalem, and they made many siege engines against it.",
      "links": "<a href='/AIV/20/02/45'>1Macc 2:45</a>",
      "comment": "Jonathan’s leadership reflects the ongoing struggle for the holy city. The construction of siege engines illustrates Israel’s ongoing quest for religious and national freedom, fulfilled in spiritual freedom through Christ (cf. John 8:36)."
    },
    {
      "pk": 20011023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 23,
      "text": "Some lawless men, who hated their own people, went to King Demetrius and told him that Jonathan was besieging the citadel.",
      "links": "",
      "comment": "Internal betrayal is a repeating theme (cf. Judas in the Gospels). Those called 'lawless' point to the dangers of division among God’s people. Unity is often stressed in later New Testament writings (Phil. 2:2-3)."
    },
    {
      "pk": 20011024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 24,
      "text": "When he heard this, Demetrius was enraged; at once he marched toward Ptolemais. He summoned Jonathan to stop the siege, giving him orders to meet with him in haste.",
      "links": "",
      "comment": "Political power reacts swiftly to threats, and the use of orders and haste mirrors the urgent dealings of rulers in later scriptural history."
    },
    {
      "pk": 20011025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 25,
      "text": "But when Jonathan heard this, he gave orders to continue the siege, and then, with elders and priests of Israel, he put himself in danger.",
      "links": "",
      "comment": "Jonathan’s obedience to God was balanced by wisdom. The mention of priests with elders foreshadows the importance of spiritual and communal leadership visible throughout the Old and New Testaments (Acts 15:6)."
    },
    {
      "pk": 20011026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 26,
      "text": "Taking silver, gold, garments, and many other presents, he went to the king at Ptolemais; he found favor with him.",
      "links": "<a href='/AIV/01/32/20'>Gen. 32:20</a>",
      "comment": "The tradition of bringing gifts to seek favor echoes Jacob’s actions before meeting Esau, showing a blend of tact and trust in God."
    },
    {
      "pk": 20011027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 27,
      "text": "Though some wicked men from his own people made accusations against him,",
      "links": "<a href='/AIV/20/11/23'>1Macc 11:23</a>; <a href='/AIV/02/16/2'>Ex. 16:2</a>",
      "comment": "Much like Moses faced opposition from his own people, Jonathan experiences betrayal. True leadership is often marked by suffering and endurance, as later seen in Christ (John 1:11)."
    },
    {
      "pk": 20011028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 28,
      "text": "the king treated him just as his predecessors had done, and raised him up before all his friends.",
      "links": "<a href='/AIV/20/10/65-66'>1Macc 10:65-66</a>",
      "comment": "Jonathan’s honor before the king foreshadows the vindication of God’s servants. The New Testament teaches that those who humble themselves will be exalted (Luke 14:11)."
    },
    {
      "pk": 20011029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 29,
      "text": "He confirmed him as high priest and all the honors he had been granted before, and gave him authority over the four prefectures.",
      "links": "<a href='/AIV/20/10/20'>1Macc 10:20</a>",
      "comment": "Jonathan’s elevation as high priest manifests the ongoing connection between spiritual and political leadership among God’s people—anticipating the union of kingship and priesthood in Christ (cf. Hebrews 7:17)."
    },
    {
      "pk": 20011030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 30,
      "text": "He wrote for him to be adorned in purple and gold, and that he should be addressed as one of the King's Friends.",
      "links": "",
      "comment": "This clothing recalls symbolic priestly garments (Exod. 28:4), and the title 'King’s Friend' prefigures Jesus’ own words: ‘I call you friends’ (John 15:15)."
    },
    {
      "pk": 20011031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 31,
      "text": "He also wrote for him the following: 'I confirm you in all the honors you have received.'",
      "links": "",
      "comment": "Official documentation affirms Jonathan's role, suggesting the importance of written tradition and apostolic succession for continuity—a principle maintained later in the Church."
    },
    {
      "pk": 20011032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 32,
      "text": "'Any official who accuses you without my order will be subject to punishment.'",
      "links": "",
      "comment": "Protection for God’s servants is a recurring motif (cf. Ps. 105:15); it hints at the authority and safeguarding the Lord gives to those entrusted with leading his people."
    },
    {
      "pk": 20011033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 33,
      "text": "The king ordered the tributes of Samaria and Galilee to be given to Jonathan, as payment for his service.",
      "links": "",
      "comment": "The tribute granted recalls the biblical theme of God’s people receiving their inheritance. Galilee's later association with Jesus is noteworthy (Matt. 4:15)."
    },
    {
      "pk": 20011034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 34,
      "text": "He wrote: 'I release you and all the priests from the annual tribute, taxes on produce, and land taxes. Instead, let you and the temple receive these contributions.'",
      "links": "<a href='/AIV/03/27/30'>Lev. 27:30</a>",
      "comment": "Release from taxation for priests and the temple recalls tithing and how God provides for his house through the gifts of his people—a principle continued in supporting ministers of worship."
    },
    {
      "pk": 20011035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 35,
      "text": "'Instead, pay these directly each year to those who are dedicated to services in Jerusalem, for they are entrusted with the holy services.'",
      "links": "",
      "comment": "The care for those set apart for holy service anticipates later church structures, with dedicated ministers supported by the faithful."
    },
    {
      "pk": 20011036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 36,
      "text": "'None of them are to be taken captive or prosecuted for any reason, and no authority has the right to make any decree against them.'",
      "links": "",
      "comment": "Offering sanctuary and protection to those in service to God is underscored. This protection, morally and legally, finds resonance in the New Testament principle of pastoral oversight (cf. 1 Tim. 5:17-19)."
    },
    {
      "pk": 20011037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 37,
      "text": "'Write this to be recorded and let a copy be kept in the temple, so that Jonathan may have it as a testimony and remembrance.'",
      "links": "",
      "comment": "The practice of keeping written records for remembrance reflects the emphasis on tradition and the importance of sacred writings for continuity and authority."
    },
    {
      "pk": 20011038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 38,
      "text": "When Jonathan saw all was peaceful, he sent chosen men to settle Judea and to build and repair its walls.",
      "links": "",
      "comment": "Wall-building echoes Nehemiah’s actions (Neh. 2:17); securing the city reflects preparing a people for the coming Messiah who himself will be the unbreakable wall (Eph. 2:20)."
    },
    {
      "pk": 20011039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 39,
      "text": "However, Trypho, a follower of Alexander, conspired to become king and seized Antioch.",
      "links": "",
      "comment": "Earthly plots never cease, showing the ongoing need for a trustworthy and legitimate ruler—a theme ultimately fulfilled in Jesus, the King of Kings."
    },
    {
      "pk": 20011040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 40,
      "text": "He placed the young son of Alexander on the throne and called him Antiochus, naming him king. He kept him under strict guard, seeking to gain control himself.",
      "links": "",
      "comment": "The manipulation of royal succession is a sign of the instability of worldly thrones. The true Son, entrusted and revealed at the right time, is secure in eternity (Ps. 2:7)."
    },
    {
      "pk": 20011041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 41,
      "text": "Jonathan learned of these events; he sent ambassadors to the king honoring him, confirming his alliances.",
      "links": "",
      "comment": "Jonathan seeks ongoing peace, displaying both prudence and the importance of legitimate alliances. Faithfulness in politics mirrors faithfulness in spiritual matters."
    },
    {
      "pk": 20011042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 42,
      "text": "He sent with them silver and gold, and gifts, and requested great honors for himself.",
      "links": "",
      "comment": "Offering gifts was a mark of honor (compare with the Magi bringing gifts, Matt. 2:11)."
    },
    {
      "pk": 20011043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 43,
      "text": "But Trypho deceived the king young Antiochus, and seized him.",
      "links": "",
      "comment": "Trypho’s deception emphasizes the theme of false leaders and usurpers. Scripture repeatedly warns against wolves in sheep’s clothing (Matt. 7:15)."
    },
    {
      "pk": 20011044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 44,
      "text": "He took over Antioch and sent out letters to all his provinces, demanding their support.",
      "links": "",
      "comment": "The call for allegiance under usurpation contrasts with the call to follow true authority, ultimately realized in Christ (Matt. 28:18-20)."
    },
    {
      "pk": 20011045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 45,
      "text": "He sent troops and captured Demetrius, bringing him to Trypho.",
      "links": "",
      "comment": "Worldly power is shown to be unstable; yet it is God who sets up and removes kings (Dan. 2:21)."
    },
    {
      "pk": 20011046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 46,
      "text": "Jonathan then sent to Trypho, asking that the garrisons at the citadel in Jerusalem and the other strongholds be surrendered, for they were harassing Israel.",
      "links": "",
      "comment": "The desire for the complete liberation of the land is in line with biblical accounts of cleansing the territory from foreign oppression. This total devotion is a shadow of spiritual liberation in Christ (Gal. 5:1)."
    },
    {
      "pk": 20011047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 47,
      "text": "Trypho sent word to Jonathan, ‘I will do this for you and your people. I will even make you and your nation honored by the king.’",
      "links": "",
      "comment": "Words of peace and favor can conceal ulterior motives—a trope seen throughout Scripture (cf. Neh. 6:2)."
    },
    {
      "pk": 20011048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 48,
      "text": "He added, ‘Send silver and gold and troops as payment, and I will remove the garrisons and return you control of the citadel.’",
      "links": "",
      "comment": "The recurring motif of bribes and tributes reflects the cost of freedom—contrasted with Christ, who gives true freedom as a gift (Rom. 6:23)."
    },
    {
      "pk": 20011049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 49,
      "text": "But Jonathan did not trust him, for he knew he was speaking deceitfully to him.",
      "links": "<a href='/AIV/20/12/46'>1Macc 12:46</a>",
      "comment": "Discernment is crucial for God’s people; Jonathan’s wisdom recalls Christ’s admonition to be wise as serpents and innocent as doves (Matt. 10:16)."
    },
    {
      "pk": 20011050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 50,
      "text": "So he sent the money and troops, but Trypho broke his promise and did not release the citadel.",
      "links": "",
      "comment": "The faithlessness of men is set against God’s faithfulness. Jesus alone fulfills every promise (2 Cor. 1:20)."
    },
    {
      "pk": 20011051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 51,
      "text": "He marched against Jonathan in the plain of Asor with a large army.",
      "links": "",
      "comment": "The subsequent confrontation emphasizes the theme of testing and perseverance, familiar to God’s people throughout history."
    },
    {
      "pk": 20011052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 52,
      "text": "Jonathan left his brother Simon in the country, while he himself encamped against the city.",
      "links": "",
      "comment": "Jonathan dividing his responsibilities shows wisdom and trust—Simon’s later leadership will be key in this period of Israel’s history."
    },
    {
      "pk": 20011053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 53,
      "text": "Then Simon encamped against Beth-zur, attacking it for many days, and shut them in.",
      "links": "<a href='/AIV/20/04/29'>1Macc 4:29</a>",
      "comment": "The perseverance of Simon reflects the steady leadership necessary for God’s people. Beth-zur’s strategic location underscores the importance of spiritual strongholds."
    },
    {
      "pk": 20011054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 54,
      "text": "They asked for peace, and he granted it. He drove them out and took the city, stationing a garrison there.",
      "links": "",
      "comment": "The enactment of true peace comes not by mere words but by righteous action. Simon’s conduct prefigures Christ’s rightful restoring of order (cf. Luke 1:74-75)."
    },
    {
      "pk": 20011055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 55,
      "text": "Jonathan and his army camped by the water of Gennesar, and early in the morning they went into the plain of Hazor.",
      "links": "",
      "comment": "The mention of Gennesar connects this location with the Sea of Galilee, prominent in Jesus’ ministry."
    },
    {
      "pk": 20011056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 56,
      "text": "But Trypho’s army moved out of camp to face them, all ready for battle; the cavalry was a strong force on their right side.",
      "links": "",
      "comment": "Battle imagery throughout Scripture symbolizes both visible and spiritual warfare (Eph. 6:12)."
    },
    {
      "pk": 20011057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 57,
      "text": "Fearing the strength of the cavalry, Jonathan’s infantry did not dare go through the lines to the other side, so the cavalry encircled his men and shot arrows at the army all day.",
      "links": "",
      "comment": "Surrounded by hostile forces, God’s people are often shown to rely on the Lord for deliverance (Ps. 118:10-14)."
    },
    {
      "pk": 20011058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 58,
      "text": "But they remained firm in their positions, and the cavalry grew weary.",
      "links": "",
      "comment": "Endurance in battle foreshadows the perseverance of the saints, a key spiritual virtue (James 1:12)."
    },
    {
      "pk": 20011059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 59,
      "text": "Then Simon and his forces advanced from their positions, charging into the ranks of the enemy, routing them, and making them flee.",
      "links": "",
      "comment": "Simon’s courage and tactical acumen deliver victory here, emphasizing that God can bring victory through faithful leaders—seen preeminently in Christ."
    },
    {
      "pk": 20011060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 60,
      "text": "Many were killed; those remaining fled into the fortress.",
      "links": "",
      "comment": "God’s judgment is manifest in the defeat of the enemy; those who resist God’s people find no lasting refuge."
    },
    {
      "pk": 20011061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 61,
      "text": "At that time Jonathan sent ambassadors to the king, asking for pardon for those in Judea, and for all that happened at Gazara, Joppa, and Jerusalem.",
      "links": "",
      "comment": "Jonathan’s advocacy for his people mirrors the priestly role as intercessor—prefiguring Christ as the Great High Priest and mediator (1 Tim. 2:5)."
    },
    {
      "pk": 20011062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 62,
      "text": "The king graciously granted all his requests and confirmed his authority as ruler.",
      "links": "",
      "comment": "Earthly rulers’ willingness to forgive at the appeal of God’s leaders points towards the grace and mercy God shows to his people through appointed intercessors."
    },
    {
      "pk": 20011063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 63,
      "text": "Jonathan and his men encamped at Jerusalem; they began to rebuild the city and restore its fortifications.",
      "links": "<a href='/AIV/16/02/17'>Neh. 2:17</a>",
      "comment": "Restoration of Jerusalem’s walls is a continuing theme symbolizing renewal and hope, ultimately fulfilled in the New Jerusalem (Rev. 21:2)."
    },
    {
      "pk": 20011064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 64,
      "text": "He also set watchtowers in Judea, and fortified the land against invading powers.",
      "links": "",
      "comment": "Set apart leaders fortify and protect God’s people. Spiritual fortification is echoed in the call to wear the armor of God (Eph. 6:11)."
    },
    {
      "pk": 20011065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 65,
      "text": "But Simon went to Gaza, besieged it, and surrounded the city; he built a siege tower and brought it close to the city, attacking and capturing a tower.",
      "links": "",
      "comment": "Simon’s further conquests highlight the methodical reclaiming of God’s promised land, demonstrating faithful leadership and perseverance."
    },
    {
      "pk": 20011066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 66,
      "text": "Those in the siege tower rushed into the city, causing a great panic and alarm.",
      "links": "",
      "comment": "The sudden fear gripping the city symbolizes judgment's swiftness. Those far from God are always caught unprepared when his justice arrives."
    },
    {
      "pk": 20011067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 67,
      "text": "The people of the city, along with their wives and children, climbed the walls, tearing their garments and begging Simon for peace.",
      "links": "",
      "comment": "Signs of distress and pleas for mercy echo many biblical narratives where repentance leads to the hope of relief."
    },
    {
      "pk": 20011068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 68,
      "text": "They said, 'Deal with us according to your mercy, and do not punish us with the full severity of your wrath.'",
      "links": "<a href='/AIV/10/24/14'>2 Sam. 24:14</a>",
      "comment": "Their request for mercy rather than wrath echoes the biblical concept that God's mercy triumphs over judgment for the repentant."
    },
    {
      "pk": 20011069,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 69,
      "text": "So Simon treated them peacefully and put them out of the city, took possession of the city, and cleansed the houses where idols had been found.",
      "links": "",
      "comment": "Simon’s mercy and cleansing of idolatry show a zeal for pure worship. Cleansing rituals prefigure Christ’s cleansing of the temple (John 2:15)."
    },
    {
      "pk": 20011070,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 70,
      "text": "He entered the city with hymns and praise, blessing the Lord.",
      "links": "<a href='/AIV/02/15/1'>Exod. 15:1</a>; <a href='/AIV/19/118/1'>Ps. 118:1</a>",
      "comment": "Praise following victory resonates with the great biblical celebrations after rescue and deliverance."
    },
    {
      "pk": 20011071,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 71,
      "text": "He removed unclean things from it, and all who remained were cleansed from their uncleanness.",
      "links": "<a href='/AIV/03/15/31'>Lev. 15:31</a>",
      "comment": "Cleansing here refers not just to physical but ritual purity. This anticipation of Christ's one perfect sacrifice points to the definitive cleansing offered by his blood."
    },
    {
      "pk": 20011072,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 72,
      "text": "He stationed men to keep the city, and fortified it, making it a stronghold for himself.",
      "links": "",
      "comment": "The keeping of the city points to the principle of spiritual guardianship, central to apostolic ministry in the New Testament."
    },
    {
      "pk": 20011073,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 73,
      "text": "Jonathan and his men returned to Jerusalem in peace and glory.",
      "links": "",
      "comment": "Returning in peace and glory is an image of faithful leadership, reminiscent of Christ's exaltation and the peace he gives to his Church (John 14:27)."
    },
    {
      "pk": 20011074,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 11,
      "verse": 74,
      "text": "In those days King Demetrius assembled a new army and marched into Judea across the plain toward the mountain heights.",
      "links": "",
      "comment": "The persistence of enemies shows that until the final coming of God’s King, the faithful will remain in struggle—yet the ultimate victory is assured in Christ’s return (Rev. 19:11-16)."
    }
  ],
  "translatedAt": "2025-12-24T05:24:45.632Z"
}