{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 8,
  "verses": [
    {
      "pk": 20008001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 1,
      "text": "Judas heard of the fame of the Romans, how they were powerful and looked kindly on all who allied with them, making agreements of friendship with those who came to them.",
      "links": "<a href='/AIV/42/2/1-3'>Luke 2:1-3</a>; <a href='/AIV/27/7/8'>Daniel 7:8</a>",
      "comment": "The mention of Rome foreshadows its future significance in salvation history, especially in the New Testament era, highlighting God's providential guidance through earthly kingdoms."
    },
    {
      "pk": 20008002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 2,
      "text": "He was told of their battles and the great deeds they had done against the Gauls, how they had conquered and made them submit.",
      "links": "<a href='/AIV/27/2/40'>Daniel 2:40</a>",
      "comment": "The historical context underscores the might of Rome and prepares the reader for understanding world powers in biblical prophecy."
    },
    {
      "pk": 20008003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 3,
      "text": "He was also told how they overcame other kingdoms far away and brought rulers who had risen up against them down, and how they made even greater kings pay them tribute.",
      "links": "<a href='/AIV/27/7/23'>Daniel 7:23</a>",
      "comment": "Rome's expansion echoes the biblical theme of empires rising and falling by God's allowance, seen in the prophetic writings."
    },
    {
      "pk": 20008004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 4,
      "text": "And how they destroyed Philip, king of Macedonia, and Perses, ruler of the Cypriots, who fought against them.",
      "links": "<a href='/AIV/27/11/29-30'>Daniel 11:29-30</a>",
      "comment": "This shows God’s control over world history, using even non-Israelite kingdoms to accomplish His purposes."
    },
    {
      "pk": 20008005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 5,
      "text": "He also heard how Antiochus the Great, king of Asia, had attacked them with a hundred and twenty elephants, with cavalry, chariots, and a great army, but they defeated him and took him captive.",
      "links": "<a href='/AIV/27/8/9-11'>Daniel 8:9-11</a>",
      "comment": "The military prowess of the Romans is described to emphasize their dominance, ultimately subject to God's sovereign will."
    },
    {
      "pk": 20008006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 6,
      "text": "And how they took possession of his lands and conquered India, Media, and Lydia, and gave these regions to King Eumenes.",
      "links": "<a href='/AIV/27/8/5-8'>Daniel 8:5-8</a>",
      "comment": "Eumenes’ receipt of territories marks the changing fortunes of kings, reminding followers that authority is given by God (cf. Romans 13:1)."
    },
    {
      "pk": 20008007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 7,
      "text": "He was told of the Greeks, how they planned to come against them, but this was made known, and the Romans went out to fight and routed them; many of their men died and were taken captive. They forced the Greeks to pay tribute.",
      "links": "<a href='/AIV/27/7/6'>Daniel 7:6</a>",
      "comment": "The persistent defense and victory parallel the enduring nature of God’s people, called to remain steadfast in faith."
    },
    {
      "pk": 20008008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 8,
      "text": "The Romans seized their strongholds and took their lands, subduing others far away and near; those who rose up against them they destroyed.",
      "links": "<a href='/AIV/27/2/44'>Daniel 2:44</a>",
      "comment": "Rome’s conquests serve as a backdrop for understanding how God prepares human history for His divine interventions."
    },
    {
      "pk": 20008009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 9,
      "text": "But their policy was that none of them would become king or wear a crown; instead, they held council all together and governed every year, appointing one man to lead them and rule over their affairs.",
      "links": "<a href='/AIV/20/11/14'>Proverbs 11:14</a>",
      "comment": "Collective leadership recalls the importance of unity and shared governance, a principle reflected in both the early Church and apostolic tradition."
    },
    {
      "pk": 20008010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 10,
      "text": "They were very prosperous in everything they did, and their government was respected.",
      "links": "<a href='/AIV/19/1/3'>Psalm 1:3</a>",
      "comment": "This prosperity is achieved through wise counsel, echoing wisdom literature about the blessings of godly leadership."
    },
    {
      "pk": 20008011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 11,
      "text": "None of them was arrogant or tried to dominate another; instead, every man looked out for his neighbor’s welfare.",
      "links": "<a href='/AIV/40/22/39'>Matthew 22:39</a>",
      "comment": "This echoes Christ’s teaching to love one’s neighbor as oneself, foundational for Christian ethics."
    },
    {
      "pk": 20008012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 12,
      "text": "They made agreements and alliances with other nations and those around them, and those who wished to ally with them must submit to their decrees.",
      "links": "<a href='/AIV/46/6/1'>1 Corinthians 6:1</a>",
      "comment": "The Romans’ covenantal practices set a precedent for legal and spiritual order within communities."
    },
    {
      "pk": 20008013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 13,
      "text": "They kept faith with their allies, honoring their treaties. No one ever tried to break their terms.",
      "links": "<a href='/AIV/19/15/4'>Psalm 15:4</a>",
      "comment": "Faithfulness to covenant reflects the spiritual call to integrity, so prominent in the life of God’s people."
    },
    {
      "pk": 20008014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 14,
      "text": "He was told how far they excelled all others in greatness; none could match their political wisdom.",
      "links": "<a href='/AIV/11/3/12'>1 Kings 3:12</a>",
      "comment": "Political wisdom here highlights the value of discernment, like Solomon’s, for governing the people of God."
    },
    {
      "pk": 20008015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 15,
      "text": "They built a senate chamber where every day 320 senators deliberated on the welfare of their people, ensuring good government.",
      "links": "<a href='/AIV/20/15/22'>Proverbs 15:22</a>",
      "comment": "Assembly for communal decision-making points to the importance of councils — a model the Church would later embrace for doctrine and unity."
    },
    {
      "pk": 20008016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 16,
      "text": "They entrusted their nation to one person chosen yearly to lead and command their armies.",
      "links": "<a href='/AIV/18/29/15'>Job 29:15'>",
      "comment": "Leadership appointment highlights order and accountability, principles key in spiritual and ecclesiastic structures."
    },
    {
      "pk": 20008017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 17,
      "text": "Judas chose Eupolemus son of John, son of Accos, and Jason son of Eleazar; he sent them to Rome to establish friendship and alliance with Rome.",
      "links": "<a href='/AIV/55/4/9-11'>2 Timothy 4:9-11</a>",
      "comment": "The sending of envoys recalls the apostolic mission to bring the gospel to the nations, reflecting spiritual diplomacy."
    },
    {
      "pk": 20008018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 18,
      "text": "Judas wanted the Romans to be allies in case hostile powers, especially the kingdom of Greece, threatened to oppress Israel.",
      "links": "<a href='/AIV/19/121/6'>Psalm 121:6</a>",
      "comment": "Seeking alliance for protection models prudent engagement with temporal authorities, while trusting ultimately in God’s providence."
    },
    {
      "pk": 20008019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 19,
      "text": "The ambassadors traveled to Rome — a long journey — and entered the Roman senate where they spoke:",
      "links": "<a href='/AIV/44/28/17'>Acts 28:17</a>",
      "comment": "This journey foreshadows apostolic travels, reminding believers of the universal mission entrusted to Christ’s followers."
    },
    {
      "pk": 20008020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 20,
      "text": "\"Judas, also called Maccabeus, and his brothers and the people of the Jews sent us to make alliance and peace with you, to be counted among your allies and friends.\"",
      "links": "<a href='/AIV/19/122/8'>Psalm 122:8</a>",
      "comment": "Peace and fellowship with others are valued in both Testaments, seen as a fruit of salvation and a sign of God’s kingdom."
    },
    {
      "pk": 20008021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 21,
      "text": "The Romans accepted their words, offering peace, and recorded this request in their archives.",
      "links": "<a href='/AIV/23/2/1-5'>Isaiah 2:1-5</a>",
      "comment": "Archival record-keeping for covenants mirrors biblical emphasis on the lasting nature of God’s promises and spiritual covenants."
    },
    {
      "pk": 20008022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 22,
      "text": "These are the words inscribed: \"May it be auspicious for the Romans and Jews to form an alliance, to help each other if attacked.\"",
      "links": "<a href='/AIV/21/4/10-12'>Ecclesiastes 4:10-12</a>",
      "comment": "Scriptural wisdom encourages solidarity among believers, and with righteous nations, for mutual support."
    },
    {
      "pk": 20008023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 23,
      "text": "\"If war is brought upon the Romans or any of their allies anywhere, the Jews will come to their aid, as needed, without giving help to the attackers.\"",
      "links": "<a href='/AIV/19/20/2'>Psalm 20:2</a>",
      "comment": "A mutual defense pact mirrors spiritual solidarity found among those who share a common covenant."
    },
    {
      "pk": 20008024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 24,
      "text": "\"Similarly, if war comes upon the Jews or their allies, the Romans will help as necessary, without providing support to the opposing side.\"",
      "links": "<a href='/AIV/19/46/1'>Psalm 46:1</a>",
      "comment": "This reflects the virtue of loyalty among God’s people, essential for spiritual brotherhood."
    },
    {
      "pk": 20008025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 25,
      "text": "\"Such help, if given, will not involve monetary tribute or armed assistance, as decided by both parties.\"",
      "links": "<a href='/AIV/19/37/21'>Psalm 37:21</a>",
      "comment": "The clarity of duty and support is a model for both civil and ecclesial relationships."
    },
    {
      "pk": 20008026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 26,
      "text": "\"The agreement stands: If either fights in their home country, the other won’t supply grain, arms, money, or ships, as decided mutually.",
      "links": "<a href='/AIV/20/21/1'>Proverbs 21:1</a>",
      "comment": "Wise boundaries in covenants reflect prudence, a key spiritual virtue for living in community."
    },
    {
      "pk": 20008027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 27,
      "text": "\"They’ll honor each other’s agreements in good faith and without deceit.\"",
      "links": "<a href='/AIV/19/101/7'>Psalm 101:7</a>",
      "comment": "Sin destroys trust; honesty is fundamental in all alliances and relationships, just as God honors His covenants."
    },
    {
      "pk": 20008028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 28,
      "text": "\"Regarding these matters, Romans and Jews have set terms, and if both parties wish to amend them later, they can do so by mutual counsel and agreement.\"",
      "links": "<a href='/AIV/44/15/6'>Acts 15:6</a>",
      "comment": "This open discussion and amendment process reminds us of Church councils for discerning and clarifying doctrine."
    },
    {
      "pk": 20008029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 29,
      "text": "\"Whatever they decide together is binding for both, and what was previously agreed remains firm until altered by consensus.\"",
      "links": "<a href='/AIV/40/18/18'>Matthew 18:18</a>",
      "comment": "Binding decisions by agreement foreshadow Church authority to bind and loose, as given by Christ to His apostles."
    },
    {
      "pk": 20008030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 30,
      "text": "As for the harm done by King Demetrius to the Jews, the Romans commanded: 'No complaint should be made about prior wrongs.'",
      "links": "<a href='/AIV/40/6/14'>Matthew 6:14</a>",
      "comment": "The call to not hold grievances supports the teaching to forgive others, embodied in Christ’s prayer and commands."
    },
    {
      "pk": 20008031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 31,
      "text": "After hearing these matters, the Romans sent envoys, writing to the kings in the region to tell them: 'Why have you oppressed our friends and allies?'",
      "links": "<a href='/AIV/19/82/6'>Psalm 82:6</a>",
      "comment": "Advocacy for allies demonstrates the justice and protection God calls rulers to provide, foreshadowing Christ’s defense of His Church."
    },
    {
      "pk": 20008032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 8,
      "verse": 32,
      "text": "The message was delivered to Demetrius; the Romans ordered him to stop harassing the Jews — if he didn’t obey, they would make war against him, by land and sea.",
      "links": "<a href='/AIV/19/2/12'>Psalm 2:12</a>",
      "comment": "This final act reveals firm resolve to defend the faithful. Like Rome’s intervention, God’s protection over His chosen ones is unwavering, a principle later fully realized in Christ’s enduring guidance over His Church."
    }
  ],
  "translatedAt": "2025-12-24T05:19:44.404Z"
}