{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 5,
  "verses": [
    {
      "pk": 20005001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 1,
      "text": "When it was reported to the surrounding nations that the altar had been rebuilt and the sanctuary restored as before, they were greatly angered.",
      "links": "<a href='/AIV/13/22/19'>1 Chr 22:19</a>; <a href='/AIV/16/4/1-3'>Neh 4:1-3</a>",
      "comment": "The nations' anger at the restoration of the temple mirrors hostility toward the re-establishment of true worship, a theme common throughout Salvation History."
    },
    {
      "pk": 20005002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 2,
      "text": "They decided to destroy the descendants of Jacob who were among them and began to kill and drive out the people.",
      "links": "<a href='/AIV/02/01/8-10'>Ex 1:8-10</a>; <a href='/AIV/19/83/4'>Ps 83:4</a>",
      "comment": "Here we see again the threat of annihilation, which recalls Pharaoh's oppressive plans in Exodus."
    },
    {
      "pk": 20005003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 3,
      "text": "Then Judas fought against the sons of Esau in Idumea, at Acrabatene, because they besieged Israel. He struck them with a strong blow, humbled them, and took their possessions.",
      "links": "<a href='/AIV/07/01/1-4'>Judg 1:1-4</a>",
      "comment": "Judas acts as a deliverer, much like the Judges of Israel. The defeat of Edom (Esau's descendants) fulfills prior prophecies about enmity between Jacob and Esau."
    },
    {
      "pk": 20005004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 4,
      "text": "He also remembered the sons of Baean, who were a snare and a stumbling block to the people by lying in ambush for them on the roads.",
      "links": "<a href='/AIV/07/02/3'>Judg 2:3</a>",
      "comment": "Ambushes and snares recall Israel's constant struggle against enemies seeking to lead them astray or destroy them, both physically and spiritually."
    },
    {
      "pk": 20005005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 5,
      "text": "So they were shut up by him in their towers, and he encamped against them, destroyed them completely, and burned their towers with fire, along with all who were in them.",
      "links": "<a href='/AIV/06/11/11'>Josh 11:11</a>",
      "comment": "Complete destruction reflects the concept of herem (setting apart for destruction) seen in Joshua; such acts are a sign of holiness and separation from evil for the community."
    },
    {
      "pk": 20005006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 6,
      "text": "Then he crossed over to the Ammonites, where he found a strong army and many people, with Timothy as their leader.",
      "links": "<a href='/AIV/07/11/32-33'>Judg 11:32-33</a>",
      "comment": "Timothy is a prominent adversary; the opposition of surrounding nations demonstrates the pressure on God's people to remain faithful even against overwhelming odds."
    },
    {
      "pk": 20005007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 7,
      "text": "He engaged them in many battles, defeated them, and struck them down. He captured Jazer and its villages, then returned to Judea.",
      "links": "<a href='/AIV/06/13/25'>Josh 13:25</a>",
      "comment": "By reclaiming territory, Judas continues the work of Joshua—a sign of God’s promise being fulfilled through faithful leaders."
    },
    {
      "pk": 20005008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 8,
      "text": "The Gentiles in Gilead gathered together against the Israelites living in their land, to destroy them. But they fled to the stronghold at Dathema.",
      "links": "<a href='/AIV/07/10/17-18'>Judg 10:17-18</a>",
      "comment": "The attack on the Israelites in Gilead foreshadows later persecutions of the faithful throughout the centuries."
    },
    {
      "pk": 20005009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 9,
      "text": "They sent letters to Judas and his brothers, saying, 'The Gentiles around us are gathering to destroy us. They are preparing to come and take the stronghold where we have fled. Timothy leads their army.'",
      "links": "<a href='/AIV/16/6/9'>Neh 6:9</a>",
      "comment": "Seeking aid from Judah's leader shows a spiritual hierarchy, which is a foreshadowing of the intercession and unity within Christ's Church."
    },
    {
      "pk": 20005010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 10,
      "text": "\"Come and deliver us from their hands. Many of us have already fallen.\"",
      "links": "<a href='/AIV/10/15/14'>2 Sam 15:14</a>",
      "comment": "This plea is reminiscent of prayers for deliverance throughout scripture, highlighting dependency on God's chosen leaders."
    },
    {
      "pk": 20005011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 11,
      "text": "\"All our countrymen who were in Tob have been annihilated; the enemy captured their women and children, took their goods, and killed there about a thousand men.\"",
      "links": "<a href='/AIV/07/21/10-11'>Judg 21:10-11</a>",
      "comment": "The massacre at Tob echoes tragic moments when Israelite communities are seemingly abandoned but God ultimately acts through faithful leaders."
    },
    {
      "pk": 20005012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 12,
      "text": "While these letters were being read, other messengers came with similar reports from Galilee, saying,",
      "links": "<a href='/AIV/11/17/23'>1 Kgs 17:23</a>",
      "comment": "Parallel distress in different regions underscores a coordinated assault—pointing to the unity the faithful need in times of tribulation."
    },
    {
      "pk": 20005013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 13,
      "text": "\"People from Ptolemais, Tyre, and Sidon, and all Galilee of the Gentiles, are gathering to destroy us.\"",
      "links": "<a href='/AIV/10/23/27'>2 Sam 23:27</a>",
      "comment": "Notice the unity of Gentile opposition. The faithful's unity, in contrast, is essential to survival."
    },
    {
      "pk": 20005014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 14,
      "text": "When Judas and the people heard these words, they assembled a large council to determine what to do for their troubled brothers who were oppressed by their enemies.",
      "links": "<a href='/AIV/02/18/17-23'>Ex 18:17-23</a>",
      "comment": "The assembly’s deliberation highlights the principle of conciliar decision-making, an ancient tradition for the people of God."
    },
    {
      "pk": 20005015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 15,
      "text": "Judas said to his brother Simon, 'Choose men for yourself and go to rescue your countrymen in Galilee. I and my brother Jonathan will go to Gilead.'",
      "links": "<a href='/AIV/07/08/1'>Judg 8:1</a>",
      "comment": "Division of leadership responsibilities is reminiscent of Moses and Joshua leading the tribes in separate directions as God's plan unfolds."
    },
    {
      "pk": 20005016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 16,
      "text": "He left Joseph, son of Zechariah, and Azariah, as commanders of the rest of the army, with the people, to guard Judea.",
      "links": "<a href='/AIV/14/17/8-9'>2 Chr 17:8-9</a>",
      "comment": "Delegation of authority shows orderly governance and obedient hierarchy—reflecting God’s design for His people’s leadership."
    },
    {
      "pk": 20005017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 17,
      "text": "And he commanded them, 'Take charge of this people, and do not engage in battle with the Gentiles until we return.'",
      "links": "<a href='/AIV/09/13/8-14'>1 Sam 13:8-14</a>",
      "comment": "Obedience to guidance from above is critical; Saul’s impatience is a negative contrast, while submission to proper leadership is blessed."
    },
    {
      "pk": 20005018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 18,
      "text": "Simon was given three thousand men to go into Galilee, and Judas eight thousand men for Gilead.",
      "links": "<a href='/AIV/07/07/7'>Judg 7:7</a>",
      "comment": "God uses dedicated minorities—small, faithful groups accomplish mighty works when inspired by God."
    },
    {
      "pk": 20005019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 19,
      "text": "Simon went to Galilee, engaged in many battles with the Gentiles, and the Gentiles were defeated before him.",
      "links": "<a href='/AIV/02/17/11'>Ex 17:11</a>",
      "comment": "Victory is achieved when leaders are faithful and obedient. The pattern mirrors that of Moses interceding during battle."
    },
    {
      "pk": 20005020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 20,
      "text": "He pursued them to the gates of Ptolemais. About three thousand Gentiles fell, and he took their spoil.",
      "links": "<a href='/AIV/06/10/20'>Josh 10:20</a>",
      "comment": "The pursuit to Ptolemais shows relentless defense of God’s people; tangible rewards for faithfulness echo Old Testament justice."
    },
    {
      "pk": 20005021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 21,
      "text": "He took with him those Jews who were in Galilee and Arbatta, along with their women, children, and all their belongings, and brought them with great rejoicing to Judea.",
      "links": "<a href='/AIV/14/20/27'>2 Chr 20:27</a>",
      "comment": "The restoration of exiles with rejoicing mirrors Israel’s return from captivity (see Isaiah 35:10), a foreshadow of messianic deliverance."
    },
    {
      "pk": 20005022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 22,
      "text": "Judas Maccabeus and his brother Jonathan crossed the Jordan and journeyed for three days into the wilderness.",
      "links": "<a href='/AIV/06/03/17'>Josh 3:17</a>",
      "comment": "Crossing the Jordan reproduces the entrance into the Promised Land, invoking God’s faithfulness to His covenant people."
    },
    {
      "pk": 20005023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 23,
      "text": "There they met with the Nabateans, who received them peacefully and told them all that had happened to their people in Gilead:",
      "links": "<a href='/AIV/01/21/22-34'>Gen 21:22-34</a>",
      "comment": "The peaceful welcome recalls Abraham’s experiences; Gentiles who bless Israel are themselves blessed (see Genesis 12:3)."
    },
    {
      "pk": 20005024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 24,
      "text": "\"Many are trapped in Bozrah, Bosor, Alema, Chaspho, Maked, and Carnaim—large and fortified cities.\"",
      "links": "<a href='/AIV/23/34/6'>Isa 34:6</a>",
      "comment": "Being trapped in fortified cities is a common Old Testament symbol for those who are besieged and in need of deliverance."
    },
    {
      "pk": 20005025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 25,
      "text": "\"Some have been taken captive in the other cities of Gilead. The enemy is making preparations to attack these strongholds tomorrow, to seize and destroy all the people inside.\"",
      "links": "<a href='/AIV/16/4/7-8'>Neh 4:7-8</a>",
      "comment": "Brink of catastrophe is a repeated biblical motif—yet God often intervenes at the darkest hour."
    },
    {
      "pk": 20005026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 26,
      "text": "Upon hearing this, Judas and his army left quickly by the wilderness road toward Bozrah. He took the city by surprise, and put all the males to the sword, then took all their possessions and set it on fire.",
      "links": "<a href='/AIV/06/08/24-29'>Josh 8:24-29</a>",
      "comment": "Again, the total destruction mimics holy wars in Joshua—set apart for God and as a warning against idolatry."
    },
    {
      "pk": 20005027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 27,
      "text": "He left at night, marched until they reached the stronghold. By morning he found them being attacked and destroyed by their enemies.",
      "links": "<a href='/AIV/07/07/19-22'>Judg 7:19-22</a>",
      "comment": "Dawn attacks evoke Gideon's victory—success due to faith and timing under divine leadership."
    },
    {
      "pk": 20005028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 28,
      "text": "Judas' men cried out and lifted their voices in prayer. Then he gave the signal, and they entered the city under cover of night.",
      "links": "<a href='/AIV/06/06/16'>Josh 6:16</a>",
      "comment": "Prayer before battle—acting and praying together—reveals that victory comes from both God’s grace and human cooperation with it."
    },
    {
      "pk": 20005029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 29,
      "text": "They struck down the enemy and killed them, then rescued those who were inside.",
      "links": "<a href='/AIV/09/11/11'>1 Sam 11:11</a>",
      "comment": "Rescue by force echoes Old Testament 'types' of deliverance—God saving His people physically as a foreshadow of ultimate spiritual salvation."
    },
    {
      "pk": 20005030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 30,
      "text": "Then Judas and his army, together with all the rescued, moved on to Alema. They fought, captured it, and killed every male there. They carried away the spoil and burned the city.",
      "links": "<a href='/AIV/06/06/24'>Josh 6:24</a>",
      "comment": "This pattern—battle, victory, spoil, and destruction—resembles the wars of conquest under Joshua."
    },
    {
      "pk": 20005031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 31,
      "text": "He moved quickly and captured Chaspho, Maked, Bosor, and the other cities of Gilead.",
      "links": "<a href='/AIV/06/12/7-24'>Josh 12:7-24</a>",
      "comment": "The taking of multiple cities stands as a sign of God’s favor on unified, resolute action among His people."
    },
    {
      "pk": 20005032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 32,
      "text": "After these battles, Timothy gathered another army and camped opposite Raphon, across the stream.",
      "links": "<a href='/AIV/07/12/1-4'>Judg 12:1-4</a>",
      "comment": "The persistence of enemies even after defeat teaches the need for ongoing vigilance and spiritual warfare."
    },
    {
      "pk": 20005033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 33,
      "text": "Judas sent men to spy on the camp and they reported, 'All the Gentiles around us have joined him; it is a very large army.'",
      "links": "<a href='/AIV/04/13/1-3'>Num 13:1-3</a>",
      "comment": "Sending out spies recalls Moses' method before entering Canaan. Information and prudence are not opposed to faith."
    },
    {
      "pk": 20005034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 34,
      "text": "They have hired Arab mercenaries as allies, and they have encamped across the stream, ready to attack you in the morning.\"",
      "links": "<a href='/AIV/07/06/33'>Judg 6:33</a>",
      "comment": "The use of mercenaries demonstrates the lengths to which enemies will go to defeat God’s people."
    },
    {
      "pk": 20005035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 35,
      "text": "Judas went to meet them with his army. He saw that the river was between them, and he told his men, 'Do not be afraid of their numbers; let us bravely cross and attack them on the other side.'",
      "links": "<a href='/AIV/06/03/7'>Josh 3:7</a>",
      "comment": "Crossing a river to meet the enemy bravely displays trust in God, reminiscent of Joshua's crossing into the promised land."
    },
    {
      "pk": 20005036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 36,
      "text": "\"With God’s help, we will defeat them.' So Judas crossed first with his men, and the entire enemy army fled before them.",
      "links": "<a href='/AIV/06/10/10-11'>Josh 10:10-11</a>",
      "comment": "The victory arises from faith in God's help rather than earthly might, a recurring biblical principle."
    },
    {
      "pk": 20005037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 37,
      "text": "They pursued them as far as Carnaim, where about three thousand men fell.",
      "links": "<a href='/AIV/07/04/16'>Judg 4:16</a>",
      "comment": "The rout of enemies who oppose the faithful is a sign of divine vindication for those who trust in God."
    },
    {
      "pk": 20005038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 38,
      "text": "Judas then gathered the Jews of Gilead, great and small, with their women, children, and possessions, and led them to Judea with joy.",
      "links": "<a href='/AIV/12/25/9'>2 Kgs 25:9</a>",
      "comment": "Gathering the exiles prefigures the ultimate gathering of God's people in unity—a major biblical hope fulfilled in Christ."
    },
    {
      "pk": 20005039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 39,
      "text": "When they reached Ephron, a large and well-fortified city on their way, the city gate was shut against them. They had to go around it, but the city would not let them pass.",
      "links": "<a href='/AIV/07/01/27-36'>Judg 1:27-36</a>",
      "comment": "Obstacles arise even during deliverance; cooperation with God's plan sometimes requires forceful action."
    },
    {
      "pk": 20005040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 40,
      "text": "So Judas sent them a peaceful message, saying, 'We wish to pass through your land to get back to our own country. No harm will be done; we will simply pass through.' But they would not open the gates.",
      "links": "<a href='/AIV/04/20/14-17'>Num 20:14-17</a>",
      "comment": "This echoes Moses’ request to Edom—denying passage to pilgrims brings judgment, a warning for those who resist God’s redemptive plan."
    },
    {
      "pk": 20005041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 41,
      "text": "So they assembled and attacked the city. Because the people resisted, he set it to the sword.",
      "links": "<a href='/AIV/06/10/28-39'>Josh 10:28-39</a>",
      "comment": "Resistance against God's people’s legitimate authority leads to downfall; acknowledgment of legitimate leadership is essential in God's order."
    },
    {
      "pk": 20005042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 42,
      "text": "He then took the city, killed every male, seized their possessions, and marched through the city over the dead.",
      "links": "<a href='/AIV/06/06/21'>Josh 6:21</a>",
      "comment": "Such severity is difficult for modern readers but reflects the historical context and the seriousness of rebellion in salvation history."
    },
    {
      "pk": 20005043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 43,
      "text": "Judas and his army crossed the Jordan to the wide plain opposite Beth-shan.",
      "links": "<a href='/AIV/06/12/1'>Josh 12:1</a>",
      "comment": "Returning to Judea recalls earlier passages about entering the land—restoration and homecoming."
    },
    {
      "pk": 20005044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 44,
      "text": "Judas kept gathering every remaining straggler who had been left behind and marched with them to Judea. They all returned safely and joyfully, blessing God who had delivered them from their enemies.",
      "links": "<a href='/AIV/19/126/1-3'>Ps 126:1-3</a>",
      "comment": "Deliverance and safe return are always accompanied by praise—a foreshadowing of eschatological salvation in Christ."
    },
    {
      "pk": 20005045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 45,
      "text": "While Judas and Jonathan were in Gilead, Joseph son of Zechariah and Azariah, commanders left behind, heard of the military victories.",
      "links": "<a href='/AIV/06/22/10-12'>Josh 22:10-12</a>",
      "comment": "Hearing of successes without heeding orders gives a lesson in humility and the dangers of pride."
    },
    {
      "pk": 20005046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 46,
      "text": "They decided to make a name for themselves and so led their army to Jamnia.",
      "links": "<a href='/AIV/01/11/4'>Gen 11:4</a>",
      "comment": "The ambition to seek glory apart from God’s command mirrors the pride at Babel, which leads to disaster."
    },
    {
      "pk": 20005047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 47,
      "text": "Gorgias and his men went out of the city to face them in battle.",
      "links": "<a href='/AIV/09/13/17-23'>1 Sam 13:17-23</a>",
      "comment": "Independent action in disregard for leadership exposes the community to defeat."
    },
    {
      "pk": 20005048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 48,
      "text": "Joseph and Azariah were routed and chased as far as the borders of Judea, and about two thousand of their men fell that day.",
      "links": "<a href='/AIV/06/07/5'>Josh 7:5</a>",
      "comment": "Disaster from disobedience to established authority teaches the gravity of breaking unity for selfish ambitions."
    },
    {
      "pk": 20005049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 49,
      "text": "The people suffered great loss, because they did not obey Judas and his brothers, thinking to achieve glory for themselves.",
      "links": "<a href='/AIV/09/15/19-23'>1 Sam 15:19-23</a>",
      "comment": "Obedience is better than sacrifice—humility and submission to legitimate leaders is a hallmark of God’s people."
    },
    {
      "pk": 20005050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 50,
      "text": "Meanwhile, Judas and his brothers returned from Gilead to the land of Judea with joy, because they had escaped harm.",
      "links": "<a href='/AIV/19/68/19-20'>Ps 68:19-20</a>",
      "comment": "The joy in returning points to God as the source of true protection and deliverance."
    },
    {
      "pk": 20005051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 51,
      "text": "They also recounted in detail everything that had happened to them and to those who came back from exile.",
      "links": "<a href='/AIV/16/8/13-15'>Neh 8:13-15</a>",
      "comment": "Sharing testaments of God’s work builds the faith and unity of the redeemed."
    },
    {
      "pk": 20005052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 52,
      "text": "And they gave thanks and praised the Lord, who had shown them mercy and delivered them from their enemies.",
      "links": "<a href='/AIV/19/118/14'>Ps 118:14</a>; <a href='/AIV/23/12/2'>Isa 12:2</a>",
      "comment": "Praise for deliverance points to the ultimate redemption in Christ, the Deliverer promised throughout Scripture."
    },
    {
      "pk": 20005053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 53,
      "text": "When the days of the festival of Booths came, they celebrated in joy, remembering how not long before they had lived among the Gentiles, like animals in caves.",
      "links": "<a href='/AIV/03/23/33-43'>Lev 23:33-43</a>",
      "comment": "The feast of Booths is both historical and symbolic, demonstrating God’s faithfulness in restoring his people and calling for joyful commemoration."
    },
    {
      "pk": 20005054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 54,
      "text": "So they carried branches with leaves and beautiful palms, singing psalms of thanksgiving to God, who had delivered them from the dangers that threatened them.",
      "links": "<a href='/AIV/19/118/25-27'>Ps 118:25-27</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "The use of palms anticipates Christ's triumphal entry, when salvation is fully revealed in the New Covenant."
    },
    {
      "pk": 20005055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 55,
      "text": "Joseph and Azariah were defeated when they did not follow the orders of Judas and his brothers, thinking to perform valiant deeds.",
      "links": "<a href='/AIV/43/21/21-23'>John 21:21-23</a>",
      "comment": "Disobedience—not humility or selfless love—results in failure, echoing Christ’s teaching on servant leadership."
    },
    {
      "pk": 20005056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 56,
      "text": "But they did not belong to the family by which deliverance came to Israel.",
      "links": "<a href='/AIV/04/16/8-10'>Num 16:8-10</a>",
      "comment": "God specially marks out individuals and lines for particular roles—a sign that legitimate authority and succession are part of His plan."
    },
    {
      "pk": 20005057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 57,
      "text": "These men were greatly celebrated in Israel, but they were not of the same lineage and received no share in success.",
      "links": "<a href='/AIV/09/13/14'>1 Sam 13:14</a>",
      "comment": "Position and success in the community come not just by self-effort but by inheritance and proper appointment."
    },
    {
      "pk": 20005058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 58,
      "text": "In those days, a great assembly gathered against Israel, all those living in the land—Philistia, Edom, and Samaria—because Jews returned from exile to their land and rebuilt the sanctuary.",
      "links": "<a href='/AIV/15/4/1-3'>Ezra 4:1-3</a>",
      "comment": "Those resenting the rebuilding of the sanctuary are foreshadowing opposition to restoration and renewal in the people of God."
    },
    {
      "pk": 20005059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 59,
      "text": "When Judas and his brothers saw that troubles multiplied, they went to the sanctuary and pleaded for mercy.",
      "links": "<a href='/AIV/19/77/1-2'>Ps 77:1-2</a>",
      "comment": "Turning to prayer in times of crisis models true discipleship—prayer before battle is a principle Jesus Himself fulfilled (Mark 1:35)."
    },
    {
      "pk": 20005060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 60,
      "text": "They put on sackcloth, covered their heads with ashes, bowed their faces toward the ground, and prayed for God's mercy over the calamities that had come.",
      "links": "<a href='/AIV/27/09/3'>Dan 9:3</a>",
      "comment": "Acts of humility, penance, and intercession reveal heart attitudes required to receive God’s grace."
    },
    {
      "pk": 20005061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 61,
      "text": "They sounded the trumpets and cried out to Heaven.",
      "links": "<a href='/AIV/06/06/4-5'>Josh 6:4-5</a>",
      "comment": "Trumpets announce both judgment and deliverance—Israel’s battle is fought both spiritually and physically."
    },
    {
      "pk": 20005062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 62,
      "text": "Then they attacked their enemies and defeated them, crushing the Gentiles who had assembled against them.",
      "links": "<a href='/AIV/06/10/10'>Josh 10:10</a>",
      "comment": "Victory follows prayer and penance. God’s people, united and humble, overcome even overwhelming opposition."
    },
    {
      "pk": 20005063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 63,
      "text": "On the twenty-third day of the second month, they returned home with praise and palm branches, harps, cymbals, lyres, and hymns. They gave thanks to Him who had shown them great victory and delivered Israel from their enemies.",
      "links": "<a href='/AIV/16/12/27'>Neh 12:27</a>; <a href='/AIV/19/150/3-5'>Ps 150:3-5</a>",
      "comment": "Victory parades and liturgical music point ahead to the celebratory worship in the Church’s liturgy, which is both earthly and heavenly."
    },
    {
      "pk": 20005064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 64,
      "text": "A great deliverance was accomplished and divine help was given to Israel in that day.",
      "links": "<a href='/AIV/02/14/30'>Ex 14:30</a>",
      "comment": "The phrase 'divine help' (Greek: soteria) anticipates the salvation brought finally by Christ—the true Savior of Israel and all nations."
    },
    {
      "pk": 20005065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 65,
      "text": "Those who survived told Lysias all that had happened.",
      "links": "<a href='/AIV/02/18/8'>Ex 18:8</a>",
      "comment": "Sharing the events with the enemy commander closes this chapter, inviting reflection on the witness of God’s faithfulness in the face of opposition."
    },
    {
      "pk": 20005066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 66,
      "text": "When he heard it, he was greatly angered, but because he lacked the power to oppose them, he retreated and went back to Antioch.",
      "links": "<a href='/AIV/02/15/14-17'>Ex 15:14-17</a>",
      "comment": "God’s power is shown over those who rage against His people. Even the mightiest are powerless compared to His will."
    },
    {
      "pk": 20005067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 67,
      "text": "So Judas and his brothers remained in Judea, and nothing further happened to threaten them until the fiftieth year, when the faithful were gathered together in Jerusalem.",
      "links": "<a href='/AIV/03/25/8-10'>Lev 25:8-10</a>",
      "comment": "The reference to the ‘fiftieth year’ (Jubilee) signifies a sacred time of restoration and liberty for God’s people, fulfilled spiritually in Christ."
    },
    {
      "pk": 20005068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 68,
      "text": "They worshipped God joyfully, offering sacrifices of thanksgiving, and celebrated the restoration of the sanctuary for many days.",
      "links": "<a href='/AIV/19/107/22'>Ps 107:22</a>; <a href='/AIV/13/16/4'>1 Chr 16:4</a>",
      "comment": "Liturgical worship, sacrifice, and joyful celebration in the sanctuary anticipate the perfect worship brought by Christ, who fulfills all types and sacrifices."
    }
  ],
  "translatedAt": "2025-12-24T05:17:21.402Z"
}