{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 13,
  "verses": [
    {
      "pk": 20013001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 1,
      "text": "When Simon heard that Trypho was gathering a large army to invade the land of Judah and destroy it,",
      "links": "<a href='/AIV/20/12/39'>1Macc 12:39</a>; <a href='/AIV/20/13/31'>1Macc 13:31</a>",
      "comment": "This opening verse sets the political scene, with the ruler Trypho threatening Judah. This historical context underscores the repeated persecution faced by the people of God, reminiscent of earlier Old Testament experiences (<a href='/AIV/2/1/8-14'>Exod. 1:8-14</a>)."
    },
    {
      "pk": 20013002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 2,
      "text": "he saw that the people were trembling with fear and went up to Jerusalem. He gathered the people together,",
      "links": "<a href='/AIV/20/4/30'>1Macc 4:30</a>; <a href='/AIV/20/14/27'>1Macc 14:27</a>",
      "comment": "Simon responds as a leader, gathering and encouraging the people. This evokes the image of a shepherd caring for his flock, a theme taken up in the messianic prophecies (<a href='/AIV/23/40/11'>Isa. 40:11</a>)."
    },
    {
      "pk": 20013003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 3,
      "text": "encouraged them and said to them, “You yourselves know all that I and my brothers and the house of my father have done for the laws and the sanctuary;",
      "links": "<a href='/AIV/20/2/50-61'>1Macc 2:50-61</a>",
      "comment": "Simon's words recall Israel's tradition of remembrance and faithfulness. This mirrors the call to 'remember' in salvation history (<a href='/AIV/5/8/2'>Deut. 8:2</a>). Simon's focus on the laws and the sanctuary foreshadows the importance of faithfulness to sacred tradition and holy places."
    },
    {
      "pk": 20013004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 4,
      "text": "the wars and the troubles that we have seen.",
      "links": "<a href='/AIV/19/44/1-26'>Ps. 44:1-26</a>",
      "comment": "Simon's reference to tribulation aligns with the Old Testament tradition, reminding God's people that suffering and persecution are part of the journey toward redemption."
    },
    {
      "pk": 20013005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 5,
      "text": "For this reason all my brothers have perished for the sake of Israel, and I alone am left.",
      "links": "<a href='/AIV/20/2/70'>1Macc 2:70</a>; <a href='/AIV/20/9/18'>1Macc 9:18</a>",
      "comment": "Here Simon stands as a solitary leader, reminiscent of Moses and Elijah, each of whom stood alone for God in times of crisis (<a href='/AIV/2/32/32'>Exod. 32:32</a>; <a href='/AIV/11/19/10'>1 Kings 19:10</a>)."
    },
    {
      "pk": 20013006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 6,
      "text": "But now, far be it from me to spare my own life in any time of distress, for I am not better than my brothers.",
      "links": "<a href='/AIV/11/19/4'>1 Kings 19:4</a>",
      "comment": "Simon's humility and willingness to die for his people anticipates later Christian ideals of self-sacrifice, fulfilled perfectly in Christ (<a href='/AIV/40/20/28'>Matt. 20:28</a>)."
    },
    {
      "pk": 20013007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 7,
      "text": "But I will avenge my people and the sanctuary and your wives and children, for all the nations have gathered out of hatred to destroy us.",
      "links": "<a href='/AIV/20/2/67-68'>1Macc 2:67-68</a>",
      "comment": "The defense of the people, temple, and families alludes to their duty to protect God's heritage and sacred institutions."
    },
    {
      "pk": 20013008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 8,
      "text": "The spirit of the people was rekindled as they heard these words,",
      "links": "<a href='/AIV/7/6/34'>Judg. 6:34</a>",
      "comment": "The true leader inspires hope, a principle seen throughout salvation history. This idea resonates with those commissioning leaders to guide the people in faith (<a href='/AIV/6/1/9'>Josh. 1:9</a>)."
    },
    {
      "pk": 20013009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 9,
      "text": "and they answered with a loud voice, saying, “You are our leader in place of Judas and Jonathan your brother.",
      "links": "<a href='/AIV/20/9/31'>1Macc 9:31</a>",
      "comment": "The succession of leadership foreshadows the importance of orderly transmission of authority among God's people, a theme echoed in both Old and New Testaments (<a href='/AIV/4/27/18-23'>Num. 27:18-23</a>; <a href='/AIV/44/1/24-26'>Acts 1:24-26</a>)."
    },
    {
      "pk": 20013010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 10,
      "text": "Conduct our wars, and whatever you command us we will do.”",
      "links": "<a href='/AIV/4/27/20'>Num. 27:20</a>",
      "comment": "The people's obedience to their divinely appointed leader reflects the call to submit to God's chosen representatives."
    },
    {
      "pk": 20013011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 11,
      "text": "So he gathered together all the warriors and hurried to complete the walls of Jerusalem, and he fortified it on every side.",
      "links": "<a href='/AIV/16/3/15'>Neh. 3:15</a>",
      "comment": "The construction and defense of Jerusalem is reminiscent of Nehemiah's rebuilding. Fortifying the city and sanctuary reflects a concern for sacred space, later fulfilled by Jesus (see <a href='/AIV/40/21/12-13'>Matt. 21:12-13</a>)."
    },
    {
      "pk": 20013012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 12,
      "text": "He sent Jonathan, son of Absalom, with a large army to Joppa, who drove out those who were in it and remained there.",
      "links": "<a href='/AIV/6/19/28'>Josh. 19:28</a>",
      "comment": "Capturing Joppa was important for strategic trade and communication. This conquest highlights the ongoing need to secure the land given by God."
    },
    {
      "pk": 20013013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 13,
      "text": "Trypho left Ptolemais with a large army to enter the land of Judah, and Simon with his army faced him everywhere he went.",
      "links": "<a href='/AIV/20/12/48'>1Macc 12:48</a>",
      "comment": "Trypho's movements typify the continual external threats against God's people, a theme prevalent in Israel's history."
    },
    {
      "pk": 20013014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 14,
      "text": "Those who were in the fortress kept sending messengers to Trypho, urging him to come to them by way of the hill country, but he sent a detachment of horsemen.",
      "links": "<a href='/AIV/20/12/36'>1Macc 12:36</a>",
      "comment": "Divided loyalties among the people often lead to further conflict. The fortress represents remaining strongholds of foreign influence within the land."
    },
    {
      "pk": 20013015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 15,
      "text": "But Simon knew that they planned to take him by deceit and attacked them. He suffered defeat, and his army fled to the fortress.",
      "links": "",
      "comment": "The struggle here shows the reality of loss and setback in God's providential plan. Yet, Simon's discernment of deceit is an example of wise leadership (<a href='/AIV/20/12/40'>1Macc 12:40</a>)."
    },
    {
      "pk": 20013016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 16,
      "text": "Trypho mounted his cavalry to enter the land, but Simon blocked every road and passage in the hill country.",
      "links": "",
      "comment": "Simon's effective strategies in defense exemplify prudent stewardship, reminiscent of biblical exhortations to be wise like serpents (<a href='/AIV/40/10/16'>Matt. 10:16</a>)."
    },
    {
      "pk": 20013017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 17,
      "text": "The fortress sent messengers to Trypho with supplies,",
      "links": "",
      "comment": "The effort to resupply the fortress highlights the importance of material support and unity in difficult times."
    },
    {
      "pk": 20013018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 18,
      "text": "but Simon took all of them and all that they had, and Trypho and his cavalry could not get into the country.",
      "links": "",
      "comment": "Through God's providence, the enemy is cut off. God uses human leaders to frustrate the schemes of the unrighteous."
    },
    {
      "pk": 20013019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 19,
      "text": "Trypho sent envoys to Simon, saying, “You are holding Jonathan, your brother, as a prisoner.",
      "links": "<a href='/AIV/20/12/48'>1Macc 12:48</a>",
      "comment": "This is a deceitful move, intending to manipulate Simon. The theme of betrayal and capture is significant throughout Scripture (see Joseph: <a href='/AIV/1/39/20'>Gen. 39:20</a>)."
    },
    {
      "pk": 20013020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 20,
      "text": "If you will send us one hundred talents of silver and two of his sons as hostages, so that he will not escape when released, we will release him.”",
      "links": "",
      "comment": "Trypho's demands are a form of extortion, leveraging family ties and money, calling to mind similar situations in the Old Testament (<a href='/AIV/1/42/37'>Gen. 42:37</a>)."
    },
    {
      "pk": 20013021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 21,
      "text": "Although Simon knew they were speaking deceitfully, he sent the money and the boys, lest he incur great hostility from the people.",
      "links": "",
      "comment": "Simon's actions demonstrate prudence and concern for the people's welfare, balancing justice and mercy."
    },
    {
      "pk": 20013022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 22,
      "text": "But Trypho deceived him and did not release Jonathan.",
      "links": "<a href='/AIV/20/12/48'>1Macc 12:48</a>",
      "comment": "Once again, the motif of betrayal is strong, a theme culminating in the betrayal of Christ by Judas Iscariot (<a href='/AIV/40/26/48-50'>Matt. 26:48-50</a>)."
    },
    {
      "pk": 20013023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 23,
      "text": "After these events, Trypho invaded the land to destroy it, and he made a circuit along the road to Adora. But Simon and his army followed him everywhere he went.",
      "links": "",
      "comment": "The ongoing struggle reflects the spiritual warfare present in every age, calling for perseverance and constant vigilance (<a href='/AIV/49/6/12-13'>Eph. 6:12-13</a>)."
    },
    {
      "pk": 20013024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 24,
      "text": "Those in the fortress kept sending envoys to Trypho, urging him to bring them supplies,",
      "links": "",
      "comment": "Persistent attempts to aid the enemy suggest the danger of divided allegiances among the people of God."
    },
    {
      "pk": 20013025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 25,
      "text": "but Simon gave orders that they be opposed and that he not give them supplies.",
      "links": "",
      "comment": "Simon's instruction emphasizes the need for uncompromising fidelity in times of conflict."
    },
    {
      "pk": 20013026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 26,
      "text": "He trusted in God, and he captured all their horses and weaponry.",
      "links": "",
      "comment": "Trust in divine providence brings victory. This is a recurring lesson throughout salvation history (<a href='/AIV/7/7/15'>Judg. 7:15</a>)."
    },
    {
      "pk": 20013027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 27,
      "text": "He destroyed Trypho’s entire force and seized all his possessions.",
      "links": "",
      "comment": "The complete victory is attributed to God's blessing on his chosen leader, echoing the defeat of Israel's foes in earlier Scriptures."
    },
    {
      "pk": 20013028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 28,
      "text": "He freed Jonathan from the city of Adora, and brought him back to Jerusalem with honor.",
      "links": "<a href='/AIV/20/12/39'>1Macc 12:39</a>",
      "comment": "The restoration and honor of Jonathan is a foretaste of resurrection and vindication, ultimately fulfilled in Christ (<a href='/AIV/40/28/6'>Matt. 28:6</a>)."
    },
    {
      "pk": 20013029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 29,
      "text": "He buried him in his family tomb in Modein, and the whole of Israel mourned him with great lamentation.",
      "links": "<a href='/AIV/20/2/70'>1Macc 2:70</a>",
      "comment": "Proper burial is an important act of piety, foreshadowing respect for the body and the hope of resurrection (<a href='/AIV/43/19/41-42'>John 19:41-42</a>)."
    },
    {
      "pk": 20013030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 30,
      "text": "Simon built a monument over the grave of his father and brothers, making it high so that it could be seen, polished stone both inside and out.",
      "links": "",
      "comment": "The act of building monuments in honor of faithful ancestors signifies the abiding importance of tradition and continuity among God's people."
    },
    {
      "pk": 20013031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 31,
      "text": "He set up seven pyramids, one opposite another, for his father and his mother and his four brothers.",
      "links": "",
      "comment": "Memorials for the departed serve to remind all generations of the sacrifices made for faith."
    },
    {
      "pk": 20013032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 32,
      "text": "He surrounded the pyramids with great columns, and on the columns he set up suits of armor for a lasting memorial, and beside the armor, carved ships, for all who sail the sea to see.",
      "links": "",
      "comment": "Armament and ships as memorials unite military and maritime images, signifying the universality of God's victories and their impact on all nations."
    },
    {
      "pk": 20013033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 33,
      "text": "This tomb which he made at Modein is there to this day.",
      "links": "",
      "comment": "The enduring tomb shows the importance of memory and concrete signs in passing on the faith."
    },
    {
      "pk": 20013034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 34,
      "text": "Trypho dealt treacherously with young King Antiochus and killed him.",
      "links": "<a href='/AIV/20/12/54'>1Macc 12:54</a>",
      "comment": "The betrayal and murder of Antiochus reflects the instability of worldly power compared to God's enduring rule."
    },
    {
      "pk": 20013035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 35,
      "text": "He reigned in his place and put on the crown of Asia; he brought great calamity on the land.",
      "links": "",
      "comment": "The usurpation of authority often brings suffering, teaching the importance of rightful leadership, a theme fulfilled in the eternal kingship of Christ (<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>)."
    },
    {
      "pk": 20013036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 36,
      "text": "But Simon built the forts of Judea, increased their defenses with high towers, great walls, gates, and bars, and stored supplies within them.",
      "links": "<a href='/AIV/14/14/7'>2 Chr. 14:7</a>",
      "comment": "Strengthening the land is not just about physical defense, but also about spiritual and communal security."
    },
    {
      "pk": 20013037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 37,
      "text": "Simon sent envoys to King Demetrius to ask for the remission of taxes, since all the hardships Trypho had caused had left the land devastated.",
      "links": "",
      "comment": "Diplomatic efforts point to the necessity of seeking both peace and justice for the well-being of God's people."
    },
    {
      "pk": 20013038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 38,
      "text": "King Demetrius granted his request and wrote a letter saying,",
      "links": "<a href='/AIV/20/11/34'>1Macc 11:34</a>",
      "comment": "The king's letter is an official recognition, reminiscent of pagan kings who benefited God's people (see <a href='/AIV/15/1/2-4'>Ezra 1:2-4</a>)."
    },
    {
      "pk": 20013039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 39,
      "text": "“King Demetrius to Simon, the high priest and friend of kings, and to the elders and the nation of the Jews, greetings.",
      "links": "",
      "comment": "Simon is now recognized as high priest and leader, demonstrating God's faithfulness in raising up faithful mediators for His people."
    },
    {
      "pk": 20013040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 40,
      "text": "We have received the golden crown and the palm which you sent us, and we are ready to grant you a great peace and write to our officials to remit the payments you owe us.",
      "links": "",
      "comment": "The receiving of gifts and promises of peace echoes biblical traditions of tribute and covenant between nations (<a href='/AIV/11/5/1'>1 Kings 5:1</a>)."
    },
    {
      "pk": 20013041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 41,
      "text": "Every obligation that we have released from you, stretching back from this day and for the future as well.",
      "links": "",
      "comment": "Remission of debt symbolizes Jubilee themes of freedom and restoration (<a href='/AIV/3/25/10'>Lev. 25:10</a>; <a href='/AIV/42/4/18-19'>Luke 4:18-19</a>)."
    },
    {
      "pk": 20013042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 42,
      "text": "Let it be known to all that Jews are now free and that their part among us stands canceled, as well as any crown tax that was due.",
      "links": "",
      "comment": "True freedom for the people of God is always a divine work, often accomplished through faithful leaders."
    },
    {
      "pk": 20013043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 43,
      "text": "If any of you chooses to enroll in our army, let them do so. Let peace exist between us and you.”",
      "links": "",
      "comment": "The possibility of Jews serving in foreign military forces highlights themes of dual citizenship—earthly and heavenly (see <a href='/AIV/50/3/20'>Phil. 3:20</a>)."
    },
    {
      "pk": 20013044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 44,
      "text": "In the one hundred and seventieth year, the yoke of foreign nations was removed from Israel.",
      "links": "",
      "comment": "The breaking of oppression alludes to divine deliverance and foreshadows the ultimate liberation in Christ."
    },
    {
      "pk": 20013045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 45,
      "text": "The people began to write in their documents and official records, ‘In the first year of Simon, the great high priest, general, and leader of the Jews.’",
      "links": "",
      "comment": "Simon is formally acknowledged; such offices point to the typological fulfillment in the one true High Priest (see <a href='/AIV/58/4/14'>Heb. 4:14</a>)."
    },
    {
      "pk": 20013046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 46,
      "text": "In those days Simon camped against Gazara and surrounded it with his army. He made a siege engine and brought it up against the city.",
      "links": "",
      "comment": "The use of siege engines demonstrates tactical development and resourcefulness in Israel's leaders."
    },
    {
      "pk": 20013047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 47,
      "text": "He struck one tower and took it; those who were in the siege engine rushed into the city, causing great confusion.",
      "links": "",
      "comment": "This victory shows God's providential aid in battles, as Israel turns the tide against their enemies."
    },
    {
      "pk": 20013048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 48,
      "text": "The people of the city, with their wives and children, went up on the wall with their clothes torn, crying out to Simon for mercy.",
      "links": "",
      "comment": "The plea for mercy points to God's mercy in salvation history. Torn clothes are signs of repentance (<a href='/AIV/32/3/6'>Jon. 3:6</a>)."
    },
    {
      "pk": 20013049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 49,
      "text": "They said, 'Treat us not as our wickedness deserves, but show us mercy.'",
      "links": "",
      "comment": "The explicit appeal to mercy transcends justice, echoing God's dealings with humanity (<a href='/AIV/19/103/10'>Ps. 103:10</a>)."
    },
    {
      "pk": 20013050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 50,
      "text": "So Simon reached an agreement with them and ceased his attack, but he expelled them from the city and cleansed the houses in which there had been idols, purifying them.",
      "links": "",
      "comment": "Simon’s cleansing mirrors the necessity of purifying the community from idolatry, paving the way for true worship (<a href='/AIV/4/33/52'>Num. 33:52</a>), a theme fulfilled in the new covenant community."
    },
    {
      "pk": 20013051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 51,
      "text": "He entered it with singing and praise, blessing the Lord with harps, cymbals, and lyres. He appointed that day as a day of great rejoicing and celebration.",
      "links": "<a href='/AIV/19/30/11'>Ps. 30:11</a>",
      "comment": "Worship with music and thanksgiving points to the integral role of liturgy in the worship of God."
    },
    {
      "pk": 20013052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 52,
      "text": "He fortified the city of Gazara, appointed its governor, and placed men there to keep it.",
      "links": "",
      "comment": "The assigning of governance reflects order and stewardship within the community, foreshadowing the order of the apostolic community in the Church."
    },
    {
      "pk": 20013053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 13,
      "verse": 53,
      "text": "Simon and his men returned to Jerusalem with joy and praise, because the Lord had made them prosper.",
      "links": "<a href='/AIV/19/98/1-3'>Ps. 98:1-3</a>",
      "comment": "The return to Jerusalem with rejoicing highlights the theme of restoration and the importance of worshiping God with gratitude. This story prefigures the triumphant entry of Christ into Jerusalem."
    }
  ],
  "translatedAt": "2025-12-24T05:26:34.219Z"
}