{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 9,
  "verses": [
    {
      "pk": 20009001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 1,
      "text": "When Demetrius heard that Nicanor and his army had fallen in battle, he sent Bacchides and Alcimus again into the land of Judah, together with the right wing of his army.",
      "links": "<a href='/AIV/20/7/26'>1Macc 7:26</a>; <a href='/AIV/20/7/43'>1Macc 7:43</a>",
      "comment": "Demetrius’ continuing aggression mirrors earlier oppressions of God's people, but also foreshadows later persecutions seen throughout Scripture; Bacchides and Alcimus, both prominent in past resistance, are again instruments of hardship for the faithful remnant."
    },
    {
      "pk": 20009002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 2,
      "text": "They traveled by the road to Gilgal, and they camped against Mesaloth in Arbela. They captured it and killed many people.",
      "links": "",
      "comment": "The violence in Mesaloth reflects the historic tension between invaders and Israel's own faithfulness (cf. Judges 2:14). The passage underlines the cost of holding to the covenant in the face of opposition."
    },
    {
      "pk": 20009003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 3,
      "text": "In the first month of the one hundred and fifty-second year, they encamped opposite Jerusalem.",
      "links": "<a href='/AIV/20/1/10'>1Macc 1:10</a>",
      "comment": "Here, the text provides a historical marker, anchoring the account around 160 BC, a detail echoed elsewhere in biblical history to stress the reality and sequence of events. The repeated attacks on Jerusalem mirror the city’s role as a central place of worship (Ps 122:6)."
    },
    {
      "pk": 20009004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 4,
      "text": "But they moved from there and marched toward Berea with twenty thousand men and two thousand cavalry.",
      "links": "",
      "comment": "The overwhelming numbers highlight the dire odds Israel’s defenders face, reminiscent of David’s clashes with larger forces (1 Sam 17). The trust in God in the face of superior armies is a recurring biblical theme."
    },
    {
      "pk": 20009005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 5,
      "text": "Judas was encamped at Elasa with about three thousand select men.",
      "links": "<a href='/AIV/20/4/29'>1Macc 4:29</a>",
      "comment": "Judas’ leadership of a small, dedicated force mirrors the pattern of God working through a faithful remnant (Judges 7:7, Gideon's three hundred)."
    },
    {
      "pk": 20009006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 6,
      "text": "When they saw the size of the enemy army, their hearts were shaken, and many slipped away from the camp. Only eight hundred men remained.",
      "links": "<a href='/AIV/7/7/3-7'>Judg 7:3-7</a>",
      "comment": "Fear causes desertion, but the Lord often brings victory with a small, faithful group. This echoes the spiritual reality that God does not need great numbers, only willing hearts."
    },
    {
      "pk": 20009007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 7,
      "text": "When Judas saw that his army had slipped away and that the battle pressed heavily upon him, his heart was troubled because he had no time to assemble them.",
      "links": "",
      "comment": "Judas’ concern recalls Moses and Joshua’s challenges in stirring courage among a fearful people (Deut 31:6-8)."
    },
    {
      "pk": 20009008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 8,
      "text": "However, he said to those who remained, 'Let us rise up and go to our enemies. Perhaps we can fight them.'",
      "links": "<a href='/AIV/6/14/6'>Josh 14:6</a>",
      "comment": "Judas demonstrates courageous leadership—a motif fulfilled ultimately in Christ’s willingness to stand before overwhelming opposition (John 18:4)."
    },
    {
      "pk": 20009009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 9,
      "text": "But they begged him, saying, 'We do not have the strength; let us rather try to save our lives now. We will return with our kin and fight, for we are too few.'",
      "links": "",
      "comment": "The human tendency to fear and seek self-preservation is juxtaposed against the call to sacrificial perseverance—an echo of Jesus in Gethsemane (Matt 26:39)."
    },
    {
      "pk": 20009010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 10,
      "text": "But Judas said, 'Far be it from us to do such a thing, to run away from them. If our time has come, let us die bravely for our brothers, and not leave a stain on our honor.'",
      "links": "<a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Judas’ willingness to lay down his life echoes Christ’s teaching in laying down one’s life for others—a principle later embodied perfectly by Jesus (cf. <a href='/AIV/43/15/13'>John 15:13</a>)."
    },
    {
      "pk": 20009011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 11,
      "text": "Then the enemy’s army marched out from the camp to engage them. Those with Bacchides were drawn up in line of battle. The trumpets sounded.",
      "links": "<a href='/AIV/6/6/20'>Josh 6:20</a>",
      "comment": "The use of trumpets recalls Israel’s holy wars; music signals both military engagement and sacred action (cf. Num 10:9; Josh 6:20)."
    },
    {
      "pk": 20009012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 12,
      "text": "The right wing advanced, with Bacchides at the front, and the phalanx followed them. All the braves with Judas were struck down.",
      "links": "",
      "comment": "The phalanx signals the professional military might arrayed against God’s faithful. The fall of Judas’ companions echoes Old Testament martyrs and foreshadows the need for hope in resurrection (Dan 12:2)."
    },
    {
      "pk": 20009013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 13,
      "text": "Judas saw that his army was shattered, and that victory had slipped from him, but he remained firm in heart.",
      "links": "",
      "comment": "Even in apparent defeat, the perseverance of Judas reflects a trust in justice and ultimate vindication—holding fast as did Job and the prophets (Job 13:15; Heb 11:35)."
    },
    {
      "pk": 20009014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 14,
      "text": "Turning back, he charged into the enemy and was killed, falling in battle.",
      "links": "<a href='/AIV/20/2/66'>1Macc 2:66</a>;<a href='/AIV/9/31/4'>1 Sam 31:4</a>",
      "comment": "Judas’ heroic death invites comparison to the death of Saul, but here seen for a noble cause—laying down his life for the Law and his people."
    },
    {
      "pk": 20009015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 15,
      "text": "When Jonathan and Simon took up their brother Judas, they buried him in the tomb of his ancestors in Modein.",
      "links": "<a href='/AIV/20/2/70'>1Macc 2:70</a>",
      "comment": "Burial with one's ancestors underlines the continuity of the covenant, and the respect for the body mirrors later Christian theological views regarding the dignity of burial (cf. Gen 25:9)."
    },
    {
      "pk": 20009016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 16,
      "text": "They wept for him, and all Israel greatly mourned him for many days.",
      "links": "<a href='/AIV/10/1/12'>2 Sam 1:12</a>",
      "comment": "Public mourning for the just leader aligns with Old Testament traditions, highlighting the bond between the leader and the people—a shepherd to the flock (Num 27:17)."
    },
    {
      "pk": 20009017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 17,
      "text": "They mourned for Judas, saying, 'How the mighty has fallen, the savior of Israel!'",
      "links": "<a href='/AIV/10/1/19'>2 Sam 1:19</a>",
      "comment": "Their lament recalls David's for Saul and Jonathan, underlining Judas as a deliverer for his people—a type also pointing beyond himself to the coming One who would truly deliver Israel (<a href='/AIV/23/53/5'>Isa 53:5</a>)."
    },
    {
      "pk": 20009018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 18,
      "text": "The rest of Judas’ companions fled to safety.",
      "links": "",
      "comment": "The scattering of the disciples of Judas prefigures times of trial when the righteous are dispersed—a motif also seen after Jesus’ arrest (Mark 14:50)."
    },
    {
      "pk": 20009019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 19,
      "text": "Bacchides captured those who deserted the people, and he executed many of them.",
      "links": "",
      "comment": "Judas' opponents show no mercy even to the weak. The penalty for desertion here stands as a sobering warning against abandonment of the people of God."
    },
    {
      "pk": 20009020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 20,
      "text": "Bacchides then took control of the land and appointed overseers over all the cities.",
      "links": "<a href='/AIV/20/1/51'>1Macc 1:51</a>",
      "comment": "The imposition of foreign control echoes Israel’s periodic subjugation, setting the stage for calls for new leadership."
    },
    {
      "pk": 20009021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 21,
      "text": "He selected lawless men, and they hunted down the friends of Judas, bringing them before Bacchides, who punished and mocked them.",
      "links": "<a href='/AIV/19/2/1-3'>Ps 2:1-3</a>",
      "comment": "The 'lawless men' stand in opposition to God's way, reminiscent of Psalm 2’s warning about those who resist the Lord’s Anointed."
    },
    {
      "pk": 20009022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 22,
      "text": "A great trial came upon Israel in those days: every leader and friend of Judas was hunted down. There was severe famine.",
      "links": "<a href='/AIV/11/18/2'>1 Kings 18:2</a>",
      "comment": "Periods of trial and famine recall other seasons of purification in Israel’s history, and emphasize reliance not on human strength, but divine provision."
    },
    {
      "pk": 20009023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 23,
      "text": "There was a great distress in the land.",
      "links": "<a href='/AIV/23/8/22'>Isa 8:22</a>",
      "comment": "This summary heightens the sense of suffering and anticipation of deliverance, a concept central to biblical hope."
    },
    {
      "pk": 20009024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 24,
      "text": "The enemies triumphed and suppressed Israel; those loyal to the law fled into hiding.",
      "links": "<a href='/AIV/58/11/37-38'>Heb 11:37-38</a>",
      "comment": "The persecution of the righteous, a motif carried into the New Testament (Heb 11), points to the value of martyrdom and steadfastness."
    },
    {
      "pk": 20009025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 25,
      "text": "But Jonathan, the son of Mattathias, and Simon, gathered those who were left and became leaders in the place of Judas their brother.",
      "links": "<a href='/AIV/20/2/65-66'>1Macc 2:65-66</a>",
      "comment": "A chain of godly leadership is maintained, paralleling the importance of succession and continuity in God's people."
    },
    {
      "pk": 20009026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 26,
      "text": "Jonathan learned of Bacchides’ search for him, and he and his brother Simon and all his followers went into the wilderness of Tekoa and camped by the waters of Asphar.",
      "links": "<a href='/AIV/10/23/24'>2 Sam 23:24</a>",
      "comment": "Seeking refuge in the wilderness is an ongoing biblical theme (see David in 1 Sam 23), often a place of both purgation and divine encounter."
    },
    {
      "pk": 20009027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 27,
      "text": "Bacchides learned of this on the Sabbath day, and he brought his army across the Jordan.",
      "links": "",
      "comment": "Attacking on the Sabbath was seen as particularly ungodly, emphasizing the disregard for the law by Israel’s oppressors, and deepening the people’s suffering."
    },
    {
      "pk": 20009028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 28,
      "text": "Then Bacchides called together all his allies and assembled those loyal to him in Judea.",
      "links": "",
      "comment": "Local collaborators worsen the plight, reflecting a recurring theme—the temptation to compromise with power at the cost of fidelity to God."
    },
    {
      "pk": 20009029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 29,
      "text": "He made camp against Bethbasi and besieged it for many days. He made engines of war.",
      "links": "",
      "comment": "Siege warfare and the use of engines underlines the cruel tools deployed to suppress Israel. Bethbasi becomes a new point of resistance."
    },
    {
      "pk": 20009030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 30,
      "text": "The besieged came out, burned the engines, and fought bravely.",
      "links": "",
      "comment": "Fighting with courage despite hopeless circumstances illuminates a recurring biblical theme—the valor of the remnant."
    },
    {
      "pk": 20009031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 31,
      "text": "Jonathan and his brother Simon and their men withdrew into the wilderness, and Bacchides destroyed their supplies.",
      "links": "",
      "comment": "Destruction of supplies intensifies their suffering, but the motif of retreat to the wilderness recalls Israel’s past and the way God sustains his people through scarcity (Ex 16:4)."
    },
    {
      "pk": 20009032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 32,
      "text": "Bacchides pursued them for many days. Jonathan and Simon, and those with them, moved secretly into the wilderness so that their pursuers did not find them.",
      "links": "",
      "comment": "Divine protection in the wilderness recurs throughout Scripture, prefiguring New Testament themes of being 'hidden with Christ in God' (Col 3:3)."
    },
    {
      "pk": 20009033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 33,
      "text": "At that time, Alcimus ordered the destruction of the altar wall within the inner court of the sanctuary. He sought to abolish the ancient practices.",
      "links": "<a href='/AIV/20/4/43'>1Macc 4:43</a>",
      "comment": "The attack on the Temple's sanctity highlights the centrality of true worship, pointing forward to the need for authentic, unbroken worship of the one true God."
    },
    {
      "pk": 20009034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 34,
      "text": "But Alcimus was struck, and his plans were hindered. His mouth was stopped, he was paralyzed, and could speak no more, nor give orders concerning his house.",
      "links": "",
      "comment": "Alcimus’ sudden affliction is reminiscent of divine intervention seen elsewhere, such as the judgment on Nebuchadnezzar (<a href='/AIV/27/4/31'>Dan 4:31</a>). The sanctity of God’s house is jealously guarded by the Lord."
    },
    {
      "pk": 20009035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 35,
      "text": "Alcimus died with great torment.",
      "links": "",
      "comment": "Judgment comes swiftly to those who defile the worship of God, a pattern consistent from Leviticus to Acts (cf. Lev 10:2; Acts 5:5)."
    },
    {
      "pk": 20009036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 36,
      "text": "When Bacchides saw that Alcimus was dead, he returned to the king. And the land of Judah was quiet for two years.",
      "links": "",
      "comment": "A temporary peace follows the departure of oppressors, but biblical history shows such peace is always fragile where the hearts of the people are divided."
    },
    {
      "pk": 20009037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 37,
      "text": "But in the second year, the lawless men in southern Israel plotted to remove Jonathan and his followers.",
      "links": "",
      "comment": "Internal dissent—the greatest threats often come from within the community, not from external enemies."
    },
    {
      "pk": 20009038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 38,
      "text": "They went to Bacchides and persuaded him to return.",
      "links": "",
      "comment": "Those who love power and status above truth routinely seek alliances with unjust rulers, a temptation warned against throughout Scripture."
    },
    {
      "pk": 20009039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 39,
      "text": "Bacchides sent army commanders to the south, saying, 'Let us make a covenant with Jonathan, or we cannot defeat him.'",
      "links": "",
      "comment": "This reveals Jonathan’s growing influence and the political acumen required for leadership, reminiscent of David’s negotiation with Saul (1 Sam 18–20)."
    },
    {
      "pk": 20009040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 40,
      "text": "When Jonathan learned of the plot against him, he sent his brother John, a leader of the people, to ask their friends the Nabateans for permission to store their goods with them.",
      "links": "",
      "comment": "Seeking help from neighboring allies in times of distress recalls Abraham’s interactions with foreign tribes (Gen 14:13)."
    },
    {
      "pk": 20009041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 41,
      "text": "But the sons of Jambri from Medeba went out and seized John and everything he had, then departed.",
      "links": "",
      "comment": "Betrayal by supposed allies is a recurring theme in biblical history, reinforcing the warning to trust ultimately in God."
    },
    {
      "pk": 20009042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 42,
      "text": "After these events, they brought the news of John’s death and the loss of property to Jonathan and his brother Simon.",
      "links": "",
      "comment": "The loss of kin and wealth compounds the suffering of Israel’s leaders, but also spurs them on to respond."
    },
    {
      "pk": 20009043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 43,
      "text": "They mourned him deeply.",
      "links": "",
      "comment": "Continued mourning reflects the heaviness the righteous endure, but also sets the stage for later hope."
    },
    {
      "pk": 20009044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 44,
      "text": "Afterward, Jonathan and Simon went out to avenge their brother’s death, and they went up the road to Bethbasi.",
      "links": "",
      "comment": "The quest for justice after betrayal demonstrates the necessity of vindication and accountability within the community."
    },
    {
      "pk": 20009045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 45,
      "text": "There they sat in hiding for three days.",
      "links": "",
      "comment": "A three-day period often precedes rescue or transformation in the Scriptures (Jon 1:17; Matt 12:40), foreshadowing resurrection themes."
    },
    {
      "pk": 20009046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 46,
      "text": "Looking up, they saw a great crowd with much baggage coming to celebrate a wedding, and with them was the bridegroom’s party, and his friends met them with drums and musicians.",
      "links": "",
      "comment": "The festivity here forms a stark contrast to the violence of the age. Weddings often symbolize hope, covenant, and restoration in both the Old and New Testaments (see John 2)."
    },
    {
      "pk": 20009047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 47,
      "text": "They rose up from their hiding place and attacked them, killing many and the rest fled to the mountains. They seized all their spoils.",
      "links": "",
      "comment": "The sudden reversal demonstrates that God can grant victory even from a place of grief. There is also an admonition to righteous justice."
    },
    {
      "pk": 20009048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 48,
      "text": "They recovered John’s possessions, and the wedding feast was turned into mourning, and the sound of music into lamentation.",
      "links": "",
      "comment": "This echoes prophetic language (Amos 8:10), where times of joy are turned to sorrow as consequences of injustice."
    },
    {
      "pk": 20009049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 49,
      "text": "After taking full revenge on the murderers of their brother, they returned to the swamp country of the Jordan.",
      "links": "",
      "comment": "The motif of just vengeance maintains social order, pointing toward the New Testament theme of ultimate justice (Rom 12:19)."
    },
    {
      "pk": 20009050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 50,
      "text": "Bacchides heard of what had happened, and he came on the Sabbath to the banks of the Jordan with a large force.",
      "links": "",
      "comment": "Repeated violation of the Sabbath by foreign rulers underscores disregard for God’s law (Ex 31:14)."
    },
    {
      "pk": 20009051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 51,
      "text": "He built strongholds in Jericho, Emmaus, Beth-horon, Bethel, Timnath, Pharathon, and Tephon, with high walls, gates, and bars, and he placed garrisons in them to harass Israel.",
      "links": "<a href='/AIV/6/10/5'>Josh 10:5</a>",
      "comment": "Occupation of Israel’s centers with garrisons alludes to past occupations yet further signals the exhaustion of Israel’s autonomy."
    },
    {
      "pk": 20009052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 52,
      "text": "He stationed armed men at Bethzur, Gazara, and the citadel in Jerusalem. He also sent men to reinforce the forts in the region.",
      "links": "",
      "comment": "The continued militarization of Israel's sacred places highlights ongoing spiritual warfare imagery present throughout the Bible."
    },
    {
      "pk": 20009053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 53,
      "text": "He persecuted the sons of Israel; he hunted down those loyal to the Law and destroyed them at the word of the king.",
      "links": "<a href='/AIV/26/21/32'>Ezek 21:32</a>",
      "comment": "The explicit targeting of the faithful connects to broader biblical themes of persecution and suffering for righteousness’ sake (Matt 5:10)."
    },
    {
      "pk": 20009054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 54,
      "text": "Jonathan and Simon, and those with them, withdrew to Bethbasi in the wilderness, and they rebuilt what had been torn down there.",
      "links": "",
      "comment": "Restoration of what is destroyed stands as a great biblical hope, foreseen in prophets like Isaiah (Isa 61:4)."
    },
    {
      "pk": 20009055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 55,
      "text": "Bacchides heard this and assembled all his forces, and he sent orders to his allies in Judea.",
      "links": "",
      "comment": "Even as evil regroups, faithfulness and rebuilding persist as fundamental virtues for God's people."
    },
    {
      "pk": 20009056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 56,
      "text": "He came and camped against Bethbasi; he fought against it for many days with engines of war.",
      "links": "",
      "comment": "The intensity of the siege mirrors other biblical episodes, recalling the need for perseverance in hardship (James 1:12)."
    },
    {
      "pk": 20009057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 57,
      "text": "Jonathan left his brother Simon in the city, then went out into the country with a few men.",
      "links": "",
      "comment": "Dividing leadership for strategic purposes demonstrates wisdom, a gift from God in battle (see Exod 17:9-13)."
    },
    {
      "pk": 20009058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 58,
      "text": "He struck down Odomera and his brothers, and the sons of Phasiron in their tents.",
      "links": "",
      "comment": "Striking swiftly, Jonathan displays the courage of Israel’s earlier judges."
    },
    {
      "pk": 20009059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 59,
      "text": "They began to grow stronger.",
      "links": "",
      "comment": "Despite adversity, a faithful remnant sees God's favor, as so often in the biblical record."
    },
    {
      "pk": 20009060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 60,
      "text": "But Simon and his men were hard-pressed in the city because they were surrounded, and Bacchides’ men prepared to attack them on the Sabbath.",
      "links": "",
      "comment": "Testing the righteous on the Sabbath draws a parallel to Christ’s own confrontations and the theme of fulfilling, not abolishing, the Law (Matt 12:8)."
    },
    {
      "pk": 20009061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 61,
      "text": "They called out to Jonathan, urging him to risk his life for their brothers.",
      "links": "",
      "comment": "The request for self-sacrifice highlights the call to servant leadership—a foreshadowing of Christ’s own sacrificial love."
    },
    {
      "pk": 20009062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 62,
      "text": "So Jonathan left his camp with ten men. He struck down in anger the rear of the enemy, and his men destroyed a large force.",
      "links": "",
      "comment": "Bold action, even with few, is a recurring sign that God may work through the humble to defeat the proud."
    },
    {
      "pk": 20009063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 63,
      "text": "But Bacchides realized this, gathered his remaining forces, and brought up his army with engines of war.",
      "links": "",
      "comment": "Despite temporary setbacks, evil does not easily surrender, underlining the perseverance required of the faithful."
    },
    {
      "pk": 20009064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 64,
      "text": "Jonathan, Simon, and their men recognized the danger, and withdrew into the wilderness at Bethbasi. They rebuilt what was torn down and fortified the place.",
      "links": "",
      "comment": "Building up in the wilderness is a symbol of hope amid adversity, and the virtue of perseverance in the faith."
    },
    {
      "pk": 20009065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 65,
      "text": "Bacchides delayed his attack on the Sabbath, but still harassed them constantly.",
      "links": "",
      "comment": "Divine providence sometimes restrains enemies; partial observance of the Sabbath is noted even by their pursuers."
    },
    {
      "pk": 20009066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 66,
      "text": "He left others to continue the siege, and withdrew to his own land.",
      "links": "",
      "comment": "Persistence in persecution, even from afar, is reminiscent of other times when God's people are constantly tested."
    },
    {
      "pk": 20009067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 67,
      "text": "Jonathan and Simon and their followers remained, continuing to live at Bethbasi. Simon rebuilt it and made it stronger than before.",
      "links": "",
      "comment": "The rebuilding of Bethbasi signals faithfulness to the covenant, a theme fulfilled in Christ who builds the true Temple (John 2:19)."
    },
    {
      "pk": 20009068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 68,
      "text": "But Bacchides, seeing their strength, broke his covenant with them and dealt harshly with them.",
      "links": "",
      "comment": "A broken covenant by a foreign leader stands in sharp contrast to the faithfulness of God, who always keeps His promises."
    },
    {
      "pk": 20009069,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 69,
      "text": "He swore an oath and took hostages from among the sons of the country, sending them to the citadel at Jerusalem.",
      "links": "",
      "comment": "Oaths and hostages were characteristic tools of the era; the text here hints how human power fails to substitute for true peace based on justice and law."
    },
    {
      "pk": 20009070,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 70,
      "text": "Soon after, he left the land, and did not return again.",
      "links": "",
      "comment": "The departure of Bacchides is a turning point, opening the door for eventual restoration."
    },
    {
      "pk": 20009071,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 71,
      "text": "Peace was established in Israel for a time, and Jonathan dwelt at Michmash, where he began to judge the people and drive out the wicked from Israel.",
      "links": "<a href='/AIV/9/7/16'>1 Sam 7:16</a>",
      "comment": "Jonathan's judgeship echoes that of earlier biblical leaders—God’s plan often continues through righteous governance."
    },
    {
      "pk": 20009072,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 72,
      "text": "He renewed justice among the people, and those who had fled returned to their homes. Peace finally prevailed in Israel.",
      "links": "",
      "comment": "Restoration and peace are major biblical themes, pointing to the messianic hope fulfilled in Christ, who is both Judge and Prince of Peace."
    },
    {
      "pk": 20009073,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 73,
      "text": "So Jonathan and Simon, and all who were with them, settled securely at Bethbasi. They rebuilt and dwelt there, and the people rejoiced.",
      "links": "",
      "comment": "In the end, the community's restoration and joy echo the greater promises of God’s kingdom—where perseverance, renewal, and unity are blessed."
    }
  ],
  "translatedAt": "2025-12-24T05:21:17.820Z"
}