{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 16,
  "verses": [
    {
      "pk": 20016001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 1,
      "text": "Now John went up from Gazara and told Simon, his father, what Cendebeus was doing.",
      "links": "<a href='/AIV/20/15/39'>1Macc 15:39</a>",
      "comment": "Here John brings news of Cendebeus, showing the importance of vigilant leadership. The preservation of Israel often depended on sons bearing responsibility for their father's work, anticipating similar themes of succession and spiritual warfare as seen in 2 Tim. 2:2."
    },
    {
      "pk": 20016002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 2,
      "text": "Simon called his two older sons, Judas and John, and said to them: 'My brothers and I, and my father's house, have fought the battles of Israel from our youth to this day, and often we have succeeded in saving Israel.'",
      "links": "<a href='/AIV/7/6/12'>Judg 6:12</a>; <a href='/AIV/13/12/15'>1Chr 12:15</a>",
      "comment": "Simon’s speech highlights faithfulness through generations, similar to biblical calls for perseverance (<a href='/AIV/58/12/1'>Heb. 12:1</a>). The continuity of leadership foreshadows the unity of the church passed from one generation to the next."
    },
    {
      "pk": 20016003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 3,
      "text": "'But now I have grown old, and you, by God's mercy, are of mature age. Take my place and my brother’s, and go out and fight for our nation; and may the help that comes from heaven go with you.'",
      "links": "<a href='/AIV/6/1/7'>Josh 1:7</a>; <a href='/AIV/10/10/12'>2Sam 10:12</a>",
      "comment": "Simon entrusts leadership to his sons, relying on divine help. This is a key example of apostolic succession in leadership, where appointed leaders carry on the mission of their predecessors."
    },
    {
      "pk": 20016004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 4,
      "text": "Then he chose twenty thousand of the best soldiers and cavalry, and they set out for Cendebeus. They camped by Modin.",
      "links": "<a href='/AIV/20/2/1'>1Macc 2:1</a>",
      "comment": "Simon’s selection of a strong force mirrors the notion of the church as a well-ordered body, advancing with discipline and unity (cf. <a href='/AIV/46/14/40'>1 Cor 14:40</a>)."
    },
    {
      "pk": 20016005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 5,
      "text": "They set out at night and marched as far as the plain. Cendebeus was camped with his army at Kedron.",
      "links": "<a href='/AIV/9/15/23'>1Sam 15:23</a>",
      "comment": "The element of a night march brings to mind biblical episodes of divine strategy (<a href='/AIV/6/8/9'>Josh 8:9-10</a>)."
    },
    {
      "pk": 20016006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 6,
      "text": "John placed his troops in ambush, while his brother went forward with the main force.",
      "links": "<a href='/AIV/6/8/2'>Josh 8:2</a>",
      "comment": "Ambush tactics echo Old Testament precedents for holy warfare, where strategy and obedience to God work together."
    },
    {
      "pk": 20016007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 7,
      "text": "When all Cendebeus’s men came out into the plain, the main army attacked, and many of them fell. The rest fled to the stronghold.",
      "links": "<a href='/AIV/7/20/16'>Judg 20:16</a>",
      "comment": "Victory is both a result of bravery and God’s providence, a recurring biblical theme (see <a href='/AIV/19/44/3'>Psalm 44:3</a>)."
    },
    {
      "pk": 20016008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 8,
      "text": "Judas, John’s brother, was wounded in the battle, but John pursued the enemy until he reached Kedron, which Cendebeus had fortified.",
      "links": "<a href='/AIV/14/26/14'>2Chr 26:14</a>",
      "comment": "Even in victory, suffering among leaders reminds us that the righteous may endure tribulation for a greater cause—pointing to Christ’s suffering in salvation’s plan."
    },
    {
      "pk": 20016009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 9,
      "text": "Some of those who fled fell by the sword; the rest reached the fortified city.",
      "links": "<a href='/AIV/6/10/20'>Josh 10:20</a>",
      "comment": "The enemy’s flight recalls the ultimate futility of opposition to the chosen people, paralleling the church’s promise of victory over the gates of hell (<a href='/AIV/40/16/18'>Matt 16:18</a>)."
    },
    {
      "pk": 20016010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 10,
      "text": "John then returned to Gazara and reported to his father all that Cendebeus had done.",
      "links": "<a href='/AIV/20/13/53'>1Macc 13:53</a>",
      "comment": "Reporting back to his father reinforces the biblical virtue of obedience and accountability (see <a href='/AIV/51/3/20'>Col 3:20</a>)."
    },
    {
      "pk": 20016011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 11,
      "text": "Now Ptolemy, the son of Abubus, had been appointed governor in the plain of Jericho. He had much silver and gold,",
      "links": "<a href='/AIV/20/13/53'>1Macc 13:53</a>; <a href='/AIV/6/18/21'>Josh 18:21</a>",
      "comment": "Ptolemy’s position and wealth remind us of recurring biblical warnings on the dangers and temptations of power (<a href='/AIV/54/6/10'>1 Tim 6:10</a>)."
    },
    {
      "pk": 20016012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 12,
      "text": "for he was the high priest’s son-in-law.",
      "links": "<a href='/AIV/20/10/58'>1Macc 10:58</a>",
      "comment": "This family tie shows how political and religious roles intertwined, anticipating the significance of spiritual authority entrusted to specific leaders."
    },
    {
      "pk": 20016013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 13,
      "text": "But his heart grew proud, and he plotted to seize leadership by treachery.",
      "links": "<a href='/AIV/10/15/12'>2Sam 15:12</a>",
      "comment": "Ptolemy’s betrayal echoes figures such as Absalom (2 Sam 15), warning against rebellion against God’s chosen leaders. This scene encourages fidelity toward God’s established order."
    },
    {
      "pk": 20016014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 14,
      "text": "As Simon was making the rounds through the cities in the country, caring for their needs, he went down to Jericho—he and his sons, Mattathias and Judas, in the one hundred seventy-seventh year, in the eleventh month (which is the month Shebat).",
      "links": "<a href='/AIV/16/5/14'>Neh 5:14</a>; <a href='/AIV/26/1/2'>Ezek 1:2</a>",
      "comment": "Simon's pastoral care for the cities illustrates the shepherding role vested in spiritual leaders; this pattern would later be fulfilled by the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>)."
    },
    {
      "pk": 20016015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 15,
      "text": "The son of Abubus welcomed them with deceit in a little fortress called Dok that he had built. He spread a grand feast, but he had men hidden there.",
      "links": "<a href='/AIV/19/41/9'>Ps 41:9</a>; <a href='/AIV/20/13/53'>1Macc 13:53</a>",
      "comment": "This event parallels betrayals of trust in scripture (see Judas in Luke 22:48). The true leader faces betrayal as Christ did, reinforcing the cost of sacrificial leadership."
    },
    {
      "pk": 20016016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 16,
      "text": "When Simon and his sons became drunk, Ptolemy and his men rose up, took their weapons, and rushed upon Simon in the banquet hall, killing him and his two sons, and some of his servants.",
      "links": "<a href='/AIV/10/20/9-10'>2Sam 20:9-10</a>; <a href='/AIV/40/26/47-50'>Matt 26:47-50</a>",
      "comment": "The murder during a banquet underlines the depth of the betrayal. The connection to betrayal in the New Testament is striking, giving a foreshadowing of the ultimate sacrifice."
    },
    {
      "pk": 20016017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 17,
      "text": "By this mighty act of treachery, Ptolemy gained control of the district.",
      "links": "<a href='/AIV/7/9/23-24'>Judg 9:23-24</a>",
      "comment": "Seizing power through murder stands in opposition to the way of true authority, which comes legitimately and with sacrifice, often seen in the life and death of biblical leaders and Christ."
    },
    {
      "pk": 20016018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 18,
      "text": "He wrote a report and sent it to the king, that he might send to his aid troops to give him the cities and the country.",
      "links": "<a href='/AIV/20/11/52'>1Macc 11:52</a>; <a href='/AIV/20/15/15-16'>1Macc 15:15-16</a>",
      "comment": "Ptolemy’s alignment with foreign power for his own gain illustrates the dangers of depending on worldly authorities rather than trusting in the divine order."
    },
    {
      "pk": 20016019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 19,
      "text": "He sent others to Gazara to kill John. He sent letters to commanders to seize him, and he sent troops to Gazara to finish off John.",
      "links": "<a href='/AIV/11/19/2'>1Kgs 19:2</a>",
      "comment": "The ongoing attempts to kill the rightful heir are reminiscent of the consistent attacks on anointed figures in Israel’s history, paralleling efforts to destroy God’s chosen."
    },
    {
      "pk": 20016020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 20,
      "text": "But he suspected them, and they were unable to overcome him.",
      "links": "<a href='/AIV/10/17/17'>2Sam 17:17-21</a>; <a href='/AIV/44/23/12-22'>Acts 23:12-22</a>",
      "comment": "John’s discernment represents the wisdom needed by leaders, a gift of the Holy Spirit that ensures protection of the faithful."
    },
    {
      "pk": 20016021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 21,
      "text": "John captured and put to death the men sent to kill him, for he had discovered their plot.",
      "links": "<a href='/AIV/16/6/10-14'>Neh 6:10-14</a>",
      "comment": "Leaders sometimes must enact justice for the safety of the community, modeling rightly-ordered authority under God’s law."
    },
    {
      "pk": 20016022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 22,
      "text": "The rest of the acts of John, his wars, and the brave deeds he did, and the rebuilding of the walls, are written in the chronicles of his high priesthood, from the time he became high priest after his father.",
      "links": "<a href='/AIV/14/35/27'>2Chr 35:27</a>; <a href='/AIV/16/12/27'>Neh 12:27</a>",
      "comment": "The preservation of John’s deeds in sacred records mirrors the role of tradition and the passing down of the acts of God’s leaders for later generations, showing how oral and written tradition were both crucial in forming the faith."
    },
    {
      "pk": 20016023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 23,
      "text": "Thus the people mourned greatly for Simon and for his sons.",
      "links": "<a href='/AIV/10/1/12'>2Sam 1:12</a>",
      "comment": "Communal mourning for righteous leaders is a sign of their true impact—symbolic of how loss is felt keenly among God’s people, much like the apostles grieved after the Lord’s Passion (<a href='/AIV/41/16/10'>Mark 16:10</a>)."
    },
    {
      "pk": 20016024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 16,
      "verse": 24,
      "text": "These things happened in the one hundred seventy-seventh year, in the eleventh month, which is Shebat.",
      "links": "<a href='/AIV/26/1/2'>Ezek 1:2</a>; <a href='/AIV/37/1/15'>Hag 1:15</a>",
      "comment": "The specific dating of these events strengthens the historical reliability of Scripture, and demonstrates God’s work in concrete times and places. The recording of dates for salvation history finds its fulfillment in the coming of Christ in the fullness of time (<a href='/AIV/48/4/4'>Gal 4:4</a>)."
    }
  ],
  "translatedAt": "2025-12-24T05:28:30.416Z"
}