{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 10,
  "verses": [
    {
      "pk": 20010001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 1,
      "text": "In the one hundred and sixtieth year, Alexander, son of Antiochus Epiphanes, went up and captured Ptolemais. The inhabitants welcomed him, and he reigned there.",
      "links": "<a href='/AIV/20/1/10'>1Macc 1:10</a>",
      "comment": "The Alexander here is also known as Alexander Balas, who claimed to be the rightful king, rivaling Demetrius. The political intrigue of this period sets the stage for Israel's interaction with foreign powers."
    },
    {
      "pk": 20010002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 2,
      "text": "When King Demetrius heard of it, he gathered a very large army and marched out to meet him in battle.",
      "links": "<a href='/AIV/20/10/1'>1Macc 10:1</a>",
      "comment": "Demetrius seeks to defend his claim to the throne. The competition for political power will draw Israel into larger events, showing the vulnerability of God's people when not united."
    },
    {
      "pk": 20010003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 3,
      "text": "Demetrius also sent letters to Jonathan with words of peace, to honor him.",
      "links": "<a href='/AIV/20/9/73'>1Macc 9:73</a>",
      "comment": "Jonathan, as leader of Israel, is courted by foreign kings for political alliances. Leadership in Israel continues through appointed holy successors."
    },
    {
      "pk": 20010004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 4,
      "text": "For Demetrius said, 'Let us reach out to him before he makes a treaty with Alexander against us.'",
      "links": "<a href='/AIV/20/10/53'>1Macc 10:53</a>",
      "comment": "Demetrius seeks to prevent any alliance between Jonathan and Alexander. This shows the significance of the people of God in world politics, and their role as a mediating presence."
    },
    {
      "pk": 20010005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 5,
      "text": "Otherwise, he will remember all the wrongs we have done to him, his brothers, and his nation.'",
      "links": "<a href='/AIV/20/7/27'>1Macc 7:27</a>",
      "comment": "Demetrius confesses his previous mistreatment of Jonathan and the Jews, highlighting Israel's suffering under pagan kings, yet also their strategic importance."
    },
    {
      "pk": 20010006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 6,
      "text": "So Demetrius gave Jonathan permission to gather an army and to supply himself with arms, and he authorized him to become his ally. He also commanded that they hand over the hostages held in Jerusalem's citadel.",
      "links": "<a href='/AIV/20/10/32'>1Macc 10:32</a>",
      "comment": "Jonathan is granted military and civil privileges, showing the increasing acceptance of Jewish leadership. The release of hostages is a sign of repentance and trust—symbolic of reconciliation."
    },
    {
      "pk": 20010007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 7,
      "text": "Jonathan returned the hostages to their parents.",
      "links": "<a href='/AIV/20/10/6'>1Macc 10:6</a>",
      "comment": "Jonathan acts mercifully and restores families, reflecting the importance of reconciliation, echoing Christ's teaching on forgiveness (<a href='/AIV/40/6/14-15'>Matt 6:14-15</a>)."
    },
    {
      "pk": 20010008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 8,
      "text": "Upon hearing this, the people in Jerusalem and the rest of Judea were greatly encouraged, because Demetrius had granted them freedom from oppression.",
      "links": "<a href='/AIV/20/10/6'>1Macc 10:6</a>",
      "comment": "The joy over relief from oppression highlights hope and the yearning for just rulers, foreshadowing messianic hopes (<a href='/AIV/23/9/6-7'>Isa 9:6-7</a>)."
    },
    {
      "pk": 20010009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 9,
      "text": "So Jonathan took up residence in Jerusalem, and began to rebuild and restore the city.",
      "links": "<a href='/AIV/16/3/8'>Neh 3:8</a>",
      "comment": "The rebuilding of Jerusalem is reminiscent of Nehemiah and shows ongoing concern for both temporal and spiritual restoration."
    },
    {
      "pk": 20010010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 10,
      "text": "He called together those who were rebuilding the walls, and set up fortifications around Mount Zion.",
      "links": "<a href='/AIV/19/48/2-3'>Ps 48:2-3</a>",
      "comment": "The fortification of Mount Zion recalls the city’s spiritual significance, notably as the dwelling place of God (<a href='/AIV/19/132/13-14'>Ps 132:13-14</a>)."
    },
    {
      "pk": 20010011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 11,
      "text": "People everywhere were restoring the city—each man with what strength he had.",
      "links": "<a href='/AIV/16/3/28'>Neh 3:28</a>",
      "comment": "Community cooperation in restoring the holy city signals unity and piety, virtues that would mark the renewed people."
    },
    {
      "pk": 20010012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 12,
      "text": "But the foreigners in the strongholds built by Bacchides fled.",
      "links": "<a href='/AIV/20/9/50'>1Macc 9:50</a>",
      "comment": "With the withdrawal of foreign garrisons, Israel regains more freedom, and the land is purified from pagan influences—a typological fulfillment of the call to holiness (<a href='/AIV/3/20/26'>Lev 20:26</a>)."
    },
    {
      "pk": 20010013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 13,
      "text": "They abandoned their posts and returned to their own lands.",
      "links": "<a href='/AIV/16/4/7'>Neh 4:7</a>",
      "comment": "The retreat of the foreign occupiers signifies God's providence in defending His people."
    },
    {
      "pk": 20010014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 14,
      "text": "However, in Beth-zur, some who had abandoned the Law and the commands of God remained, because Beth-zur was their stronghold.",
      "links": "<a href='/AIV/20/6/21'>1Macc 6:21</a>",
      "comment": "Beth-zur, a place of rebellion, contrasts with the restored Jerusalem, highlighting the consequences of apostasy."
    },
    {
      "pk": 20010015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 15,
      "text": "King Alexander sent ambassadors to Jonathan with the message of peace, honoring him.",
      "links": "<a href='/AIV/20/10/3'>1Macc 10:3</a>",
      "comment": "Both rival kings seeking Jonathan's favor show the respect commanded by faithful leadership. Israel's leaders play a vital role on the world stage."
    },
    {
      "pk": 20010016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 16,
      "text": "For he said, 'Let us make peace with him before Demetrius does, to secure his friendship.'",
      "links": "",
      "comment": "Alexander also seeks an alliance, revealing the political competition for Israel’s alliance—again, Israel is a priestly nation (Ex 19:6), mediating among nations."
    },
    {
      "pk": 20010017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 17,
      "text": "So he sent him a letter, expressing kindness and honor.",
      "links": "",
      "comment": "The tone and manner reflect the esteem for Jonathan as both religious and political leader."
    },
    {
      "pk": 20010018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 18,
      "text": "The king said: 'I appoint you as high priest of your nation. You are to be called the king’s friend.'",
      "links": "",
      "comment": "Being named high priest by a foreign king is a great honor and gives Jonathan spiritual authority. The notion of high priestly succession points to the continuity of sacred leadership."
    },
    {
      "pk": 20010019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 19,
      "text": "He also sent him a purple robe and a golden crown. 'You are to join our side and keep our interests with us.'",
      "links": "<a href='/AIV/27/5/7'>Dan 5:7</a>",
      "comment": "The purple robe and golden crown symbolize both civil authority and spiritual dignity. These symbols later appear in Christ’s Passion (cf. John 19:2), pointing allegorically toward true kingship."
    },
    {
      "pk": 20010020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 20,
      "text": "So Jonathan put on the holy vestments in the seventh month of the one hundred sixty-first year, at the Feast of Tabernacles, and gathered an army and supplied it with arms in abundance.",
      "links": "<a href='/AIV/3/23/34'>Lev 23:34</a>",
      "comment": "Jonathan acts in a liturgical setting—his leadership and the religious feasts are united, reinforcing the importance of both worship and governance."
    },
    {
      "pk": 20010021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 21,
      "text": "Many men who had previously deserted to the Philistines or defected from the Law, returned and rallied to his side once they saw his authority and the unity of Israel.",
      "links": "",
      "comment": "Jonathan’s legitimate authority, both spiritual and civil, restores unity. This highlights the importance of faithful leadership in gathering the scattered (cf. John 11:52)."
    },
    {
      "pk": 20010022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 22,
      "text": "When King Demetrius heard these reports, he was troubled and said,",
      "links": "",
      "comment": "Demetrius recognizes Jonathan’s growing power and unity of Israel as a threat (cf. Exod 1:9-10)."
    },
    {
      "pk": 20010023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 23,
      "text": "'Why have we allowed Alexander to gain control before us, gaining a strong alliance with the Jews, and thus securing increasing military strength?'",
      "links": "",
      "comment": "The foreign kings’ anxiety over Israel’s alliances affirms Israel’s strategic and spiritual significance among the nations."
    },
    {
      "pk": 20010024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 24,
      "text": "'I will write now to Jonathan with even more honorable terms than before, so that he will be in our camp and support us against our enemies.'",
      "links": "",
      "comment": "Demetrius plans to outbid Alexander, displaying the recurring theme of royal patronage of the high priesthood and Israel’s leaders."
    },
    {
      "pk": 20010025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 25,
      "text": "So Demetrius wrote to Jonathan as follows: 'I confirm both you and your nation in a covenant, as a sign of friendship and peace.'",
      "links": "",
      "comment": "Official covenant language echoes Old Testament treaties, underlining the enduring concept of Israel as a covenant people."
    },
    {
      "pk": 20010026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 26,
      "text": "'As you have remained faithful to us, you have kept your covenant obligations and acted in loyalty toward us, so now we reward you accordingly.'",
      "links": "<a href='/AIV/20/2/22'>1Macc 2:22</a>",
      "comment": "Faithfulness in covenant is rewarded, reinforcing the importance of perseverance and steadfastness."
    },
    {
      "pk": 20010027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 27,
      "text": "'We release you, and all Jews, from every tribute and tax, as well as from the annual payment of the crown.'",
      "links": "",
      "comment": "Exemption from tribute harks back to royal grants of the Persian period, enabling the people to focus on God’s worship (<a href='/AIV/15/7/24'>Ezra 7:24</a>)."
    },
    {
      "pk": 20010028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 28,
      "text": "'All grants we have previously bestowed to you remain in effect.'",
      "links": "",
      "comment": "Previous privileges are ratified, establishing legal and religious stability. Continuity of grant highlights the importance of tradition and chain of authority."
    },
    {
      "pk": 20010029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 29,
      "text": "'I also permit you to mint your own coinage, as is currently allowed; that your nation and Jerusalem may prosper.'",
      "links": "",
      "comment": "The right to mint coinage is a sign of sovereignty and stewardship. Monetary independence points to lasting stability and leadership."
    },
    {
      "pk": 20010030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 30,
      "text": "'Let Jerusalem and its territories, the tithes and taxes due to me, be remitted from this day forward.'",
      "links": "<a href='/AIV/15/7/24'>Ezra 7:24</a>",
      "comment": "Remission of tithes and taxes supports worship and temple restoration, echoing previous divine laws for sustaining the priesthood."
    },
    {
      "pk": 20010031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 31,
      "text": "'I cede control of the citadel in Jerusalem to the high priest, so as to host the guards of your choosing.'",
      "links": "",
      "comment": "Control of the citadel reflects the full restoration of religious jurisdiction to God’s chosen leadership."
    },
    {
      "pk": 20010032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 32,
      "text": "'Any trespass against the holy place, or against Jerusalem, will be subject to the king’s pardon.'",
      "links": "",
      "comment": "Special legal status given to the Temple and holy city draws attention to the sanctuary’s unique place within Israel."
    },
    {
      "pk": 20010033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 33,
      "text": "'I release all Jews taken captive from any part of my kingdom; all are to be set free immediately without payment.'",
      "links": "<a href='/AIV/20/1/41'>1Macc 1:41</a>",
      "comment": "Release of captives reflects the biblical jubilee and foreshadows Christ's liberation of those enslaved by sin (<a href='/AIV/3/25/10'>Lev 25:10</a>)."
    },
    {
      "pk": 20010034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 34,
      "text": "'No one is permitted, under any pretense, to interfere with or destroy your sacred institutions.'",
      "links": "",
      "comment": "Protection of customs and worship affirms the principle of religious liberty, a theme carried forward into the New Testament (cf. Acts 5:29)."
    },
    {
      "pk": 20010035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 35,
      "text": "'Let the city and its territory be recognized as free and holy, forever, without any tax or tribute.'",
      "links": "",
      "comment": "Jerusalem is declared free and holy, language reminiscent of prophecies about the city’s restoration and sanctity (<a href='/AIV/38/14/20-21'>Zech 14:20-21</a>)."
    },
    {
      "pk": 20010036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 36,
      "text": "'I restore you the right to assemble an army and to construct and maintain strongholds.'",
      "links": "",
      "comment": "The delegated right to bear arms and build defenses ensures Israel's security and self-governance."
    },
    {
      "pk": 20010037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 37,
      "text": "'Every official position within these boundaries must be filled by men from among your nation.'",
      "links": "",
      "comment": "Self-rule is a mark of national maturity and God's blessing, as seen in other biblical promises to Israel."
    },
    {
      "pk": 20010038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 38,
      "text": "'Let Ptolemais and its region be granted to your nation as a gift, in exchange for services rendered to the king.'",
      "links": "",
      "comment": "Ptolemais, a significant coastal city, is handed to the Jews, increasing Israel’s influence and trade."
    },
    {
      "pk": 20010039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 39,
      "text": "'If any former concession made to me is uncertain, it shall be formally written according to your desires.'",
      "links": "",
      "comment": "Clarification of legal grants assures lasting peace and stable governance, emphasizing the virtue of just laws."
    },
    {
      "pk": 20010040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 40,
      "text": "'The sum of tribute not collected from these lands in former years is now released.'",
      "links": "",
      "comment": "Forgiveness of past debts is another sign of favor and liberation, a recurring biblical motif."
    },
    {
      "pk": 20010041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 41,
      "text": "'If any among you are found worthy, let them be enrolled as members of the king's court.'",
      "links": "",
      "comment": "Prestigious positions for God's people at the heart of royal administration demonstrate their high calling (cf. Dan 2:48)."
    },
    {
      "pk": 20010042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 42,
      "text": "'Let these policies be effective from this day forward.'",
      "links": "",
      "comment": "The formal establishment of these decrees makes them binding for the future generations."
    },
    {
      "pk": 20010043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 43,
      "text": "Jonathan replied to King Demetrius in accordance with all these terms and continued to serve him faithfully.",
      "links": "",
      "comment": "Jonathan fulfills covenant terms, reflecting the biblical standard of faithfulness to promises (Ps 15:4)."
    },
    {
      "pk": 20010044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 44,
      "text": "But King Demetrius broke his promises, changing his attitude toward him.",
      "links": "",
      "comment": "Earthly rulers can fail and betray trust, in contrast to God's unchanging faithfulness (cf. Mal 3:6)."
    },
    {
      "pk": 20010045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 45,
      "text": "He denied Jonathan any further support and withdrew his favor.",
      "links": "",
      "comment": "The instability of political promises highlights the necessity of seeking God's enduring kingdom (<a href='/AIV/40/6/33'>Matt 6:33</a>)."
    },
    {
      "pk": 20010046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 46,
      "text": "Afterward, Alexander sent messengers to Jonathan, urging him with repeated offers of further honor.",
      "links": "",
      "comment": "Alexander’s greater zeal further establishes the policy of honoring God’s chosen leader, a biblical mark of righteousness."
    },
    {
      "pk": 20010047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 47,
      "text": "So Jonathan changed sides and gave his allegiance to Alexander, receiving his support and becoming his close ally.",
      "links": "",
      "comment": "As the legitimate king, Alexander’s alliance with Jonathan brings further blessings. The wisdom of choosing alliance for the good of the nation is evident here."
    },
    {
      "pk": 20010048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 48,
      "text": "King Alexander then gathered a large army and encamped across from Demetrius.",
      "links": "",
      "comment": "The great battle anticipated here is part of the larger conflicts that affect God's plan for Israel."
    },
    {
      "pk": 20010049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 49,
      "text": "The two kings met in battle. Demetrius’ army was routed, Alexander pursued him, and overwhelmed his men.",
      "links": "",
      "comment": "Demetrius’ defeat demonstrates the victory of those who honor God’s people. God often delivers through faithful leaders (<a href='/AIV/7/7/22'>Judges 7:22</a>)."
    },
    {
      "pk": 20010050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 50,
      "text": "Demetrius fled and escaped. However, Alexander captured the strongholds and attacked fiercely.",
      "links": "",
      "comment": "Alexander’s control over the territory points to the shifting fortunes of human rulers. God’s ultimate sovereignty remains above all."
    },
    {
      "pk": 20010051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 51,
      "text": "Alexander sent ambassadors to Ptolemy, king of Egypt, with this message:",
      "links": "",
      "comment": "Alexander seeks even stronger alliances, drawing Egypt into the balance of power."
    },
    {
      "pk": 20010052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 52,
      "text": "'Since I have returned to my kingdom and taken my seat on the throne of my fathers, and established my rule, after defeating Demetrius and regaining the land—'",
      "links": "",
      "comment": "Alexander presents himself as the legitimate heir, having won the kingdom by providence. The invocation of ancestral right echoes Davidic succession."
    },
    {
      "pk": 20010053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 53,
      "text": "'Now I seek your friendship. Let us form an alliance. Give me your daughter as wife.'",
      "links": "",
      "comment": "Marrying into Egypt’s royal line would legitimize Alexander’s rule. Political marriages often had spiritual significance in the ancient world."
    },
    {
      "pk": 20010054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 54,
      "text": "'I will grant you and her gifts worthy of your honor.'",
      "links": "",
      "comment": "The exchange of gifts symbolizes mutual respect and royal generosity, reminiscent of Solomon’s era (<a href='/AIV/11/3/1-15'>1 Kings 3:1-15</a>)."
    },
    {
      "pk": 20010055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 55,
      "text": "Ptolemy replied, 'It is a happy day for the return of my kin to the kingdom of their fathers.'",
      "links": "",
      "comment": "Egypt and the Seleucid kingdom present themselves as sharing a noble ancestry. Family ties further sanctify peace and alliance."
    },
    {
      "pk": 20010056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 56,
      "text": "Ptolemy came from Egypt with his daughter Cleopatra, met Alexander, and gave her to him in marriage at Ptolemais with royal splendor, as all the kings did.",
      "links": "<a href='/AIV/11/3/1'>1 Kings 3:1</a>",
      "comment": "Royal marriages are public events, highlighting alliance and now cementing Alexander's claim to kingly legitimacy."
    },
    {
      "pk": 20010057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 57,
      "text": "There was much feasting, joy, and pomp, as befitted kings.",
      "links": "<a href='/AIV/17/2/18'>Esth 2:18</a>",
      "comment": "The joyful celebrations resemble biblical wedding feasts, echoing imagery that Jesus employs for the final union of God and His people (<a href='/AIV/40/22/2'>Matt 22:2</a>)."
    },
    {
      "pk": 20010058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 58,
      "text": "The kings likewise gathered their armies and encamped at places near them.",
      "links": "",
      "comment": "The power struggle continues even amid alliance and celebration, reflecting the tension of earthly rule."
    },
    {
      "pk": 20010059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 59,
      "text": "Demetrius sent representatives with letters to Jonathan, saluting him with praise for past faithfulness.",
      "links": "",
      "comment": "Demetrius attempts to regain favor with Jonathan, acknowledging his crucial political value."
    },
    {
      "pk": 20010060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 60,
      "text": "He said, 'You remain faithful to us and fulfill your obligations. Now let me make you my friend and ally.'",
      "links": "",
      "comment": "Attempts at conciliation continue, affirming the ongoing importance of faithfulness."
    },
    {
      "pk": 20010061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 61,
      "text": "He sent him gifts of gold and silver, and authorized him to levy taxes over four cities.",
      "links": "",
      "comment": "Such gifts and economic privileges are intended to buy political support, revealing the motives of human rulers."
    },
    {
      "pk": 20010062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 62,
      "text": "But Jonathan did not accept them, because Alexander was already his ally; all words of Demetrius seemed deceitful to him.",
      "links": "",
      "comment": "Jonathan discerns true alliances from false ones, preferring faithfulness over expedience, embodying a biblical preference for integrity."
    },
    {
      "pk": 20010063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 63,
      "text": "When Alexander heard of these things, he made Jonathan wear the purple robe and a gold brooch, and told him, 'You are to be known as one of the King’s Friends.'",
      "links": "",
      "comment": "Jonathan’s ceremonial honors highlight both his civil and sacred dignity. ‘King’s Friend’ was a title for close confidants, carrying both authority and responsibility."
    },
    {
      "pk": 20010064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 64,
      "text": "He appointed Jonathan governor of the district from Ekron to the border of Egypt.",
      "links": "",
      "comment": "Jonathan gains extended rule over strategic lands, furthering the sovereignty of Jerusalem."
    },
    {
      "pk": 20010065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 65,
      "text": "The Philistines from Ashdod plotted to ambush Jonathan.",
      "links": "",
      "comment": "The ancient hostility between Israel and the Philistines continues, echoing many Old Testament stories (cf. Judges 13–16)."
    },
    {
      "pk": 20010066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 66,
      "text": "But Jonathan, learning of their plot, marched against them with his army.",
      "links": "",
      "comment": "Jonathan’s readiness reflects vigilance and good leadership."
    },
    {
      "pk": 20010067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 67,
      "text": "He left his brother Simon in the country while he advanced toward Ashdod himself.",
      "links": "<a href='/AIV/20/11/59'>1Macc 11:59</a>",
      "comment": "Jonathan wisely delegates authority to Simon, showing order in leadership succession (Num 27:18-23)."
    },
    {
      "pk": 20010068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 68,
      "text": "The people of Ashdod came out to meet Jonathan in battle, but he defeated them and set their city on fire, as well as the surrounding strongholds.",
      "links": "",
      "comment": "Jonathan defends Israel through just war, purging threats to God’s people. The burning of strongholds echoes similar actions by Joshua and David."
    },
    {
      "pk": 20010069,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 69,
      "text": "The slain and the wounded among the Philistines numbered about eight thousand.",
      "links": "",
      "comment": "The scale of victory underlines the Lord’s support for Jonathan’s mission."
    },
    {
      "pk": 20010070,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 70,
      "text": "From there, Jonathan marched on to Askalon. The people came out to meet him with great honor.",
      "links": "",
      "comment": "Even among the Philistines, Jonathan receives honor thanks to God’s manifest protection."
    },
    {
      "pk": 20010071,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 71,
      "text": "He returned with his men to Jerusalem loaded with plunder.",
      "links": "<a href='/AIV/6/22/8'>Josh 22:8</a>",
      "comment": "The return with spoil is reminiscent of earlier victories, symbolizing God’s material blessing upon faithful leadership."
    },
    {
      "pk": 20010072,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 72,
      "text": "When King Alexander heard of these things, he bestowed further honors on Jonathan,",
      "links": "",
      "comment": "The cycle of reward for faithful service continues, paralleling God’s rewards for the righteous (cf. Prov 22:4)."
    },
    {
      "pk": 20010073,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 73,
      "text": "sending him a golden brooch, as commonly awarded to the King’s Kinsmen.",
      "links": "",
      "comment": "Official insignia emphasize Jonathan’s new status and recognition at the royal court, an image later echoed in Christ’s royal priesthood (1 Pet 2:9)."
    },
    {
      "pk": 20010074,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 74,
      "text": "He also gave him Ekron and all its environs as his possession.",
      "links": "",
      "comment": "The expansion of Jonathan’s territory echoes God’s continued blessing when the people are faithful."
    },
    {
      "pk": 20010075,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 75,
      "text": "At that time, the king of Egypt assembled a large army like the sand on the seashore, with many ships, to claim the kingdom by cunning.",
      "links": "<a href='/AIV/1/22/17'>Gen 22:17</a>",
      "comment": "Metaphorically, 'sand on the seashore' recalls God's promise to Abraham, but here shows the scale of human might."
    },
    {
      "pk": 20010076,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 76,
      "text": "He intended to gain Alexander’s kingdom by trickery.",
      "links": "",
      "comment": "Royal intrigue and deception contrast with Jonathan’s righteousness."
    },
    {
      "pk": 20010077,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 77,
      "text": "King Ptolemy entered Syria with peaceful words, and the cities opened up to him, welcoming him as Alexander ordered.",
      "links": "",
      "comment": "The account demonstrates cunning diplomacy and the importance of discernment among leaders."
    },
    {
      "pk": 20010078,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 78,
      "text": "Wherever Ptolemy went, he was well received, until he entered the cities of Ashdod and Gaza.",
      "links": "",
      "comment": "Ptolemy’s march faces resistance, foreshadowing further strife in the region."
    },
    {
      "pk": 20010079,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 79,
      "text": "The people of Ashdod and Gaza shut their gates to him, so he attacked and captured them by force.",
      "links": "",
      "comment": "Urban resistance and conquest were a repeated theme in Israel’s history."
    },
    {
      "pk": 20010080,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 80,
      "text": "He set fire to their markets and plundered the cities.",
      "links": "",
      "comment": "The destruction of worldly goods serves as a warning against excessive trust in earthly powers."
    },
    {
      "pk": 20010081,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 81,
      "text": "News of his actions reached Alexander, and he set out to defend his kingdom.",
      "links": "",
      "comment": "Imminent war underscores the fragile nature of human alliances."
    },
    {
      "pk": 20010082,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 82,
      "text": "Both kings met in battle; Ptolemy was victorious. Alexander fled into Arabia.",
      "links": "",
      "comment": "Despite apparent power, Alexander is defeated, reminding us that ultimate victory belongs to God alone (<a href='/AIV/20/2/61'>1Macc 2:61</a>)."
    },
    {
      "pk": 20010083,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 83,
      "text": "King Ptolemy triumphed, crowning himself king of the lands he conquered. King Antiochus, son of Demetrius, joined him for support.",
      "links": "",
      "comment": "A new ruler arises in the person of Antiochus (surnamed Theos), demonstrating the cycle of world empires."
    },
    {
      "pk": 20010084,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 84,
      "text": "Ptolemy received favours from all, especially after marrying Alexander’s daughter and seizing authority over those regions.",
      "links": "",
      "comment": "Marriage alliances solidify claims to rule. Such arrangements have shaped biblical history (cf. Solomon in 1 Kings 3:1)."
    },
    {
      "pk": 20010085,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 85,
      "text": "He killed Alexander and took possession of his kingdom.",
      "links": "",
      "comment": "Ptolemy’s violence marks the end of Alexander, showing the ceaseless strife among worldly rulers."
    },
    {
      "pk": 20010086,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 86,
      "text": "Ptolemy soon died, and the people of the coastal cities killed many Egyptian soldiers.",
      "links": "",
      "comment": "The fleeting glory of earthly kings and the instability of power contrast with the enduring kingdom promised to God’s people."
    },
    {
      "pk": 20010087,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 87,
      "text": "Thus, Antiochus, son of Demetrius, became king in the one hundred and sixty-seventh year.",
      "links": "",
      "comment": "A new era begins under Antiochus; these shifting rulers form the background for Israel’s ongoing quest for true kingship."
    },
    {
      "pk": 20010088,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 88,
      "text": "In the days of Antiochus, Jonathan kept defending his nation and became the chief leader and high priest of his people.",
      "links": "",
      "comment": "Jonathan’s faithfulness and leadership link priesthood and kingship—a theme ultimately perfected in Christ, our Eternal High Priest (<a href='/AIV/58/7/23-28'>Heb 7:23-28</a>)."
    },
    {
      "pk": 20010089,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 10,
      "verse": 89,
      "text": "He gained the friendship of many peoples and strengthened the bonds between them and Israel.",
      "links": "",
      "comment": "Jonathan’s success points to the importance of unity and faithful leadership. Ultimately, this foreshadows how Christ would draw all nations to Himself (cf. John 12:32), fulfilling the promise of a universal, holy Church, united under legitimate authority."
    }
  ],
  "translatedAt": "2025-12-24T05:23:08.408Z"
}