{
  "book": 32,
  "bookName": "Baruch",
  "bookAbbreviation": "Bar",
  "chapter": 5,
  "verses": [
    {
      "pk": 32005001,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 1,
      "text": "Put off the garment of your sorrow and affliction, O Jerusalem, and wear forever the splendor of the glory from God.",
      "links": "<a href='/AIV/23/52/1'>Isa. 52:1</a>; <a href='/AIV/60/5/10'>1 Pet. 5:10</a>",
      "comment": "This verse calls Jerusalem, representing God's people, to set aside mourning and to embrace the glory that God gives. The imagery of clothing signifies a transformation and renewal that comes from God alone, anticipating the restoration and righteousness granted by Him. This recalls the language of Isaiah 52, connecting exile with the promise of redemption."
    },
    {
      "pk": 32005002,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 2,
      "text": "Put on the robe of the righteousness from God, and place on your head the diadem of the glory of the Everlasting.",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/53/2/19'>2 Thess. 2:19</a>",
      "comment": "The robe and diadem are symbols of honor, righteousness, and participation in divine life. The underlying theme points to God's capacity to change mourning into rejoicing. The use of clothing metaphors anticipates how, in the New Testament, Christians are called to put on Christ (Romans 13:14), showing a profound transformation rooted in God's grace. The passage foreshadows the life of holiness and justification as a gift from God and hints at a visible change marked by God’s blessing."
    },
    {
      "pk": 32005003,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 3,
      "text": "For God will show your splendor to every nation under heaven.",
      "links": "<a href='/AIV/23/62/2'>Isa. 62:2</a>; <a href='/AIV/19/98/2'>Ps. 98:2</a>",
      "comment": "This statement extends God’s blessing beyond Jerusalem to all nations, implying a universal mission. The glory of God’s people will be visible to the entire world, which echoes the mission of the Church in carrying the witness of redemption to every nation. There is anticipation of fulfillment in Christ, where the light of salvation is revealed to the Gentiles (Luke 2:32)."
    },
    {
      "pk": 32005004,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 4,
      "text": "For ever will be named by God for your righteousness and for the glory of godliness.",
      "links": "<a href='/AIV/23/62/12'>Isa. 62:12</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "God Himself gives a new name associated with righteousness and holiness. This marks a divine initiative, reflecting how God's people are set apart and identified by His calling. In the New Testament, believers are called a royal priesthood and a holy people, indicating their identity derives from God's call and purpose (1 Peter 2:9)."
    },
    {
      "pk": 32005005,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 5,
      "text": "Arise, O Jerusalem, stand on the heights, and look toward the east, and see your children gathered from west to east by the word of the Holy One, rejoicing that God has remembered them.",
      "links": "<a href='/AIV/23/49/18'>Isa. 49:18</a>; <a href='/AIV/40/24/31'>Matt. 24:31</a>",
      "comment": "God commands His people to rise and witness the ingathering of the children from every direction. The imagery looks ahead to the ultimate gathering in Christ when God's people come together from all nations. The mention of the 'word of the Holy One' highlights the power of God’s command—an early glimpse at the authoritative, creative Word fulfilled in Jesus (John 1:1-3)."
    },
    {
      "pk": 32005006,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 6,
      "text": "For they went out from you on foot, led away by enemies; but God will bring them back to you, carried in glory, as on a royal throne.",
      "links": "<a href='/AIV/23/66/20'>Isa. 66:20</a>; <a href='/AIV/24/31/8'>Jer. 31:8</a>",
      "comment": "This verse contrasts the suffering of exile with the glorious restoration promised by God. The reversal from humiliation to honor marks the character of God’s salvation: He exalts the humble and lifts up His people. The carrying 'on a royal throne' serves as a powerful image not just of return, but also of exaltation and dignity, reflecting the honor God gives to the faithful."
    },
    {
      "pk": 32005007,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 7,
      "text": "For God has ordered that every high mountain and the everlasting hills be made low, and the valleys filled up, to make level ground, so that Israel may walk safely in the glory of God.",
      "links": "<a href='/AIV/23/40/4'>Isa. 40:4</a>; <a href='/AIV/42/3/5'>Luke 3:5</a>",
      "comment": "The language of mountains made low and valleys raised points to divine intervention in preparing the way for salvation, a theme echoed in Isaiah 40 and fulfilled in John the Baptist's ministry (Luke 3:5) who prepares the way for the Lord. This passage hints at God’s overcoming of every barrier for His people and prepares the reader for the ultimate coming of Christ."
    },
    {
      "pk": 32005008,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 8,
      "text": "The forests and every fragrant tree will shade Israel at God's command.",
      "links": "<a href='/AIV/19/104/16'>Ps. 104:16</a>; <a href='/AIV/23/41/19-20'>Isa. 41:19-20</a>",
      "comment": "Nature itself participates in God's plan, providing comfort and refreshment for His people. Like the paradise of Eden, God’s provision here is abundant and protective. This indicates fellowship with God is accompanied by tangible blessings and grace, reminiscent of the restoration of all creation with the coming of the Messiah (Romans 8:19-21)."
    },
    {
      "pk": 32005009,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 5,
      "verse": 9,
      "text": "For God will lead Israel with joy, in the light of His glory, with the mercy and righteousness that come from Him.",
      "links": "<a href='/AIV/23/60/19-20'>Isa. 60:19-20</a>; <a href='/AIV/19/89/15-16'>Ps. 89:15-16</a>",
      "comment": "This concluding verse holds themes of guidance, joy, light, mercy, and righteousness—all gifts from God. The passage contains spiritual meaning: God Himself leads and fills His people with joy, echoed in Jesus' own ministry as the Light of the world (John 8:12). Receiving mercy and righteousness from God indicates a grace that is not earned but given, pointing toward the fullness of redemption revealed in the Gospel."
    }
  ],
  "translatedAt": "2025-12-24T08:57:28.107Z"
}