{
  "book": 32,
  "bookName": "Baruch",
  "bookAbbreviation": "Bar",
  "chapter": 1,
  "verses": [
    {
      "pk": 32001001,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 1,
      "text": "These are the words of the book that Baruch the son of Neriah, son of Maaseiah, son of Zedekiah, son of Hasadiah, son of Hilkiah, wrote in Babylon,",
      "links": "<a href='/AIV/24/32/12'>Jer. 32:12</a>; <a href='/AIV/24/36/4'>Jer. 36:4</a>",
      "comment": "Baruch is identified as the scribe of Jeremiah (see Jeremiah 36:4), showing both the importance of tradition and the continuity of faithful record-keeping among the people of God."
    },
    {
      "pk": 32001002,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 2,
      "text": "in the fifth year, on the seventh day of the month, at the time when the Chaldeans took Jerusalem and burned it with fire.",
      "links": "<a href='/AIV/24/52/12-13'>Jer. 52:12-13</a>; <a href='/AIV/12/25/8-9'>2 Kings 25:8-9</a>",
      "comment": "The specific dating connects this event with the historical destruction of Jerusalem, emphasizing the reliability of the scriptural record."
    },
    {
      "pk": 32001003,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 3,
      "text": "Baruch read the words of this book to Jeconiah son of Jehoiakim, king of Judah, and to all the people who came to hear the reading:",
      "links": "<a href='/AIV/24/24/1'>Jer. 24:1</a>; <a href='/AIV/24/29/2'>Jer. 29:2</a>",
      "comment": "The public reading of the word highlights the value of shared worship and communal reception of scripture, similar to liturgical practice."
    },
    {
      "pk": 32001004,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 4,
      "text": "to the nobles, the royal descendants, the elders, and all the people from the least to the greatest—all who lived in Babylon by the river Sud.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/19/137/1'>Psalm 137:1</a>",
      "comment": "The passage’s inclusivity underscores the unity of God’s people, paralleling the later concept of the whole Church gathered in worship."
    },
    {
      "pk": 32001005,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 5,
      "text": "They wept, fasted, and prayed before the Lord.",
      "links": "<a href='/AIV/16/1/4'>Neh. 1:4</a>; <a href='/AIV/24/9/1'>Jer. 9:1</a>",
      "comment": "Repentance and penance shown here are important in the spiritual life (see Daniel 9:3; James 4:8-10), foreshadowing New Covenant practices of confession and contrition."
    },
    {
      "pk": 32001006,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 6,
      "text": "They collected money, each giving what he could:",
      "links": "<a href='/AIV/16/5/1-5'>Neh. 5:1-5</a>; <a href='/AIV/44/11/29'>Acts 11:29</a>",
      "comment": "Collections for the needs of the community reflect the importance of charity among the faithful, a hallmark of Christian life in both Old and New Testaments."
    },
    {
      "pk": 32001007,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 7,
      "text": "and they sent it to Jerusalem, to Jehoiakim the priest, son of Hilkiah, son of Shallum, and to the priests and all the people who were with him in Jerusalem.",
      "links": "<a href='/AIV/24/29/3'>Jer. 29:3</a>; <a href='/AIV/15/1/5'>Ezra 1:5</a>",
      "comment": "Support for the temple and priesthood echoes the later apostolic support for consecrated leaders and communal worship spaces."
    },
    {
      "pk": 32001008,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 8,
      "text": "This was at the same time Nebuchadnezzar, king of Babylon, carried away Jeconiah, the leaders, the prisoners, the nobles, and the common people from Jerusalem and brought them to Babylon.",
      "links": "<a href='/AIV/24/24/1'>Jer. 24:1</a>; <a href='/AIV/12/24/15'>2 Kings 24:15</a>",
      "comment": "The exile shows the consequences of collective sin, yet God preserves a remnant through whom salvation history continues."
    },
    {
      "pk": 32001009,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 9,
      "text": "And they said: 'Here we send you money, buy with it burnt offerings, sin offerings, and incense, and prepare grain offerings, and offer them on the altar of the Lord our God.'",
      "links": "<a href='/AIV/03/1/3-4'>Lev. 1:3-4</a>; <a href='/AIV/15/6/9-10'>Ezra 6:9-10</a>",
      "comment": "Offering sacrifices on behalf of all the people emphasizes priestly intercession and represents the need for mediation between God and His people."
    },
    {
      "pk": 32001010,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 10,
      "text": "'And pray for the life of Nebuchadnezzar, king of Babylon, and for Belshazzar his son, so that their days may be as the days of heaven upon the earth.'",
      "links": "<a href='/AIV/24/29/7'>Jer. 29:7</a>; <a href='/AIV/40/5/44'>Matt. 5:44</a>",
      "comment": "Intercession for rulers, even Gentile ones, anticipates the New Testament call to pray for those in authority (1 Tim. 2:2), reflecting the universality of God’s mercy."
    },
    {
      "pk": 32001011,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 11,
      "text": "'And the Lord will give us strength and enlighten our eyes, and we will live under the shadow of Nebuchadnezzar, king of Babylon, and his son Belshazzar, and we will serve them many days, and find favor before them.'",
      "links": "<a href='/AIV/27/1/2'>Dan. 1:2</a>",
      "comment": "This submission is depicted not as capitulation but surrendering to God’s providence, trusting He works through even foreign powers for the good of His people (Rom. 8:28)."
    },
    {
      "pk": 32001012,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 12,
      "text": "'Pray for us also to the Lord our God, for we have sinned against the Lord our God, and His anger is yet fierce against us.'",
      "links": "<a href='/AIV/27/9/4-19'>Dan. 9:4-19</a>; <a href='/AIV/19/79/5'>Psalm 79:5</a>",
      "comment": "Confession of sin at the community level reveals the need for both personal and corporate repentance and the importance of penitential prayer."
    },
    {
      "pk": 32001013,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 13,
      "text": "'And we have not yet turned from the sins of our fathers, so as to remove from our people the wrath of the Lord.'",
      "links": "<a href='/AIV/27/9/5-14'>Dan. 9:5-14</a>",
      "comment": "Here, the text interprets suffering as a continuation of ancestral disobedience, expressing the spiritual concept of generational consequences and the ongoing need for atonement."
    },
    {
      "pk": 32001014,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 14,
      "text": "'Read now this book that we have sent to you, so that it may be read in the house of the Lord on feast days and on other suitable occasions.'",
      "links": "<a href='/AIV/16/8/2-3'>Neh. 8:2-3</a>; <a href='/AIV/05/31/10-13'>Deut. 31:10-13</a>",
      "comment": "Liturgical reading of Scripture is established as a regular practice, prefiguring the New Testament tradition of public readings in church assemblies."
    },
    {
      "pk": 32001015,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 15,
      "text": "They said: 'To the Lord our God belongs righteousness, but to us there is shame on our faces as it is this day—men of Judah and inhabitants of Jerusalem,",
      "links": "<a href='/AIV/27/9/7-8'>Dan. 9:7-8</a>; <a href='/AIV/19/44/15'>Psalm 44:15</a>",
      "comment": "The distinction between God’s righteousness and human shame sets up the need for reconciliation, ultimately fulfilled in the New Covenant through Christ (2 Cor. 5:21)."
    },
    {
      "pk": 32001016,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 16,
      "text": "'all our kings, rulers, priests, prophets, and our fathers—",
      "links": "<a href='/AIV/16/9/32-34'>Neh. 9:32-34</a>",
      "comment": "Enumerating all leadership and people acknowledges the universality of sin and shared responsibility before God."
    },
    {
      "pk": 32001017,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 17,
      "text": "'because we have sinned before the Lord,",
      "links": "<a href='/AIV/19/51/4'>Psalm 51:4</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Sin is confessed as universally rooted in humanity, which sets the stage for the need for redemption through God’s saving work."
    },
    {
      "pk": 32001018,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 18,
      "text": "'and disobeyed Him. We have not listened to the voice of the Lord our God, to walk in the commandments which He gave us openly.'",
      "links": "<a href='/AIV/27/9/10-11'>Dan. 9:10-11</a>",
      "comment": "Hearing and obeying God’s law is a theme carried forward into the teaching of Jesus, who calls all to obey God’s word (Luke 11:28)."
    },
    {
      "pk": 32001019,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 19,
      "text": "'Since the day the Lord brought our fathers out of the land of Egypt until today, we have been disobedient to the Lord our God and have acted carelessly, disregarding His voice.'",
      "links": "<a href='/AIV/02/32/1-4'>Exod. 32:1-4</a>",
      "comment": "Recounting the Exodus connects the need for ongoing deliverance to foundational acts of God in salvation history, paralleling the deliverance in Christ."
    },
    {
      "pk": 32001020,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 20,
      "text": "'So, disasters clung to us, and the curse which the Lord foretold by Moses His servant overtook us, when He brought our fathers out of Egypt to give us a land flowing with milk and honey, as is the case today.'",
      "links": "<a href='/AIV/05/28/15-68'>Deut. 28:15-68</a>",
      "comment": "Appeal to the Mosaic Covenant shows that fidelity to God’s law carries temporal consequences, and suffering can be interpreted as discipline rather than mere punishment."
    },
    {
      "pk": 32001021,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 21,
      "text": "'But we did not listen to His voice, nor did we walk in the commandments of the Lord which He set before us.'",
      "links": "<a href='/AIV/05/28/1-2'>Deut. 28:1-2</a>",
      "comment": "Repetition of disobedience intensifies the need for a more perfect obedience, later fulfilled in Christ, the new Moses (Heb. 5:8-9)."
    },
    {
      "pk": 32001022,
      "translation": "AIV",
      "book": 32,
      "bookName": "Baruch",
      "bookAbbreviation": "Bar",
      "chapter": 1,
      "verse": 22,
      "text": "'Every one of us followed the devices of his own evil heart, serving other gods and doing what is evil in the sight of the Lord our God.'",
      "links": "<a href='/AIV/24/17/9'>Jer. 17:9</a>; <a href='/AIV/45/1/21-25'>Rom. 1:21-25</a>",
      "comment": "Idolatry and self-will are presented as the root of Israel’s downfall. True conversion must involve the heart, and authentic worship of the one true God."
    }
  ],
  "translatedAt": "2025-12-24T08:55:10.935Z"
}