{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 9,
  "verses": [
    {
      "pk": 12009001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 1,
      "text": "Elisha the prophet called one of the sons of the prophets and said to him, 'Prepare yourself, take this flask of oil in your hand, and go to Ramoth-gilead.'",
      "links": "<a href='/AIV/11/19/16'>1 Kings 19:16</a>",
      "comment": "Elisha continues the prophetic mission by sending a disciple, reminiscent of Elijah who anointed future leaders. Oil here signifies the special setting apart for leadership and God's Spirit upon the anointed."
    },
    {
      "pk": 12009002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 2,
      "text": "'When you arrive there, look for Jehu son of Jehoshaphat, son of Nimshi, and go in and make him rise up from among his companions, and take him to an inner room.'",
      "links": "<a href='/AIV/11/19/16'>1 Kings 19:16</a>; <a href='/AIV/12/9/14'>2 Kings 9:14</a>",
      "comment": "The secrecy highlights the dangerous political climate and the gravity of the divine commission to Jehu, signifying the direct action of God in history."
    },
    {
      "pk": 12009003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 3,
      "text": "'Take the flask of oil, pour it on his head, and say, \"Thus says the LORD: I anoint you king over Israel.\" Then open the door and flee. Do not linger.'",
      "links": "<a href='/AIV/11/19/16'>1 Kings 19:16</a>; <a href='/AIV/09/10/1'>1 Samuel 10:1</a>",
      "comment": "The act follows the biblical pattern of anointing kings, underscoring their divine selection. Anointing also prefigures Christ, the ultimate Anointed One (Messiah), chosen for God's purposes."
    },
    {
      "pk": 12009004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 4,
      "text": "So the young man, the servant of the prophet, went to Ramoth-gilead.",
      "links": "<a href='/AIV/12/8/28'>2 Kings 8:28</a>",
      "comment": "Obedience to the prophet's command illustrates the importance of submission to spiritual authority, a theme continually echoed in both Old and New Testaments."
    },
    {
      "pk": 12009005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 5,
      "text": "When he arrived, behold, the commanders of the army were sitting there. He said, 'Commander, I have a message for you.' Jehu asked, 'For which one of us?' He answered, 'For you, commander.'",
      "links": "<a href='/AIV/12/9/2'>2 Kings 9:2</a>",
      "comment": "The personal call to Jehu marks him out from among his peers, signifying God's election coming from His sovereignty even among ostensibly equal men."
    },
    {
      "pk": 12009006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 6,
      "text": "He rose and went into the house. The young man poured the oil on his head and said, 'Thus says the LORD, the God of Israel: I anoint you king over the people of the LORD, over Israel.'",
      "links": "<a href='/AIV/11/1/34'>1 Kings 1:34</a>; <a href='/AIV/11/19/16'>1 Kings 19:16</a>",
      "comment": "Jehu's public anointing by a prophet underscores the divine foundation for true leadership, reflecting God's continuing work through His appointed agents."
    },
    {
      "pk": 12009007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 7,
      "text": "'You shall strike down the house of Ahab your master, so that I may avenge the blood of My servants the prophets and the blood of all the servants of the LORD at the hand of Jezebel.'",
      "links": "<a href='/AIV/11/21/21-24'>1 Kings 21:21-24</a>; <a href='/AIV/12/9/36'>2 Kings 9:36</a>",
      "comment": "Divine retribution for injustices under Ahab, especially the murder of God's prophets. This points to God's justice and care for His faithful, as well as the seriousness of shedding innocent blood."
    },
    {
      "pk": 12009008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 8,
      "text": "'The whole house of Ahab shall perish. I will cut off from Ahab every male, both bond and free in Israel.'",
      "links": "<a href='/AIV/11/21/21'>1 Kings 21:21</a>; <a href='/AIV/09/3/13-14'>1 Samuel 3:13-14</a>",
      "comment": "God's judgment against evil dynasties is total and just, reminiscent of earlier punishments against those who repeatedly turned from God's ways."
    },
    {
      "pk": 12009009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 9,
      "text": "'I will make the house of Ahab like the house of Jeroboam son of Nebat and like the house of Baasha son of Ahijah.'",
      "links": "<a href='/AIV/11/15/29'>1 Kings 15:29</a>; <a href='/AIV/11/16/3'>1 Kings 16:3</a>",
      "comment": "The reference to Jeroboam and Baasha shows the cycle of unrighteous kings and the consequences of leading God's people astray."
    },
    {
      "pk": 12009010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 10,
      "text": "'The dogs shall eat Jezebel in the plot of land at Jezreel, and there shall be no one to bury her.' Then he opened the door and fled.",
      "links": "<a href='/AIV/11/21/23-24'>1 Kings 21:23-24</a>; <a href='/AIV/12/9/35-36'>2 Kings 9:35-36</a>",
      "comment": "This fulfills the prophetic judgment on Jezebel for her crimes. Dogs eating Jezebel symbolizes utter disgrace—a metaphor found in prophecies about God's judgment."
    },
    {
      "pk": 12009011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 11,
      "text": "Jehu went out to the servants of his master, and one said to him, 'Is everything all right? Why did this madman come to you?' He replied, 'You know the sort and their babble.'",
      "links": "<a href='/AIV/12/9/4'>2 Kings 9:4</a>",
      "comment": "Prophets were often viewed as eccentric or even mad, foreshadowing how true prophets and apostles later faced opposition and misunderstanding."
    },
    {
      "pk": 12009012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 12,
      "text": "They said, 'That is not true. Tell us.' So he answered, 'He spoke to me, saying, \"Thus says the LORD: I anoint you king over Israel.\"'",
      "links": "<a href='/AIV/12/9/3'>2 Kings 9:3</a>; <a href='/AIV/12/9/6'>2 Kings 9:6</a>",
      "comment": "The announcement of Jehu's anointing was held privately before being revealed, highlighting the hidden nature of God's call before it is manifest."
    },
    {
      "pk": 12009013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 13,
      "text": "Then they quickly each took their own cloak and laid it under him on the bare steps, and blew the trumpet and proclaimed, 'Jehu is king!'",
      "links": "<a href='/AIV/11/1/39'>1 Kings 1:39</a>; <a href='/AIV/40/21/7-9'>Matt. 21:7-9</a>",
      "comment": "The act of laying cloaks is a symbol of submission, similar to how the crowds welcomed Christ into Jerusalem, indicating recognition of divinely appointed authority."
    },
    {
      "pk": 12009014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 14,
      "text": "So Jehu son of Jehoshaphat, son of Nimshi, conspired against Joram. Now Joram had been defending Ramoth-gilead, he and all Israel, against Hazael king of Aram.",
      "links": "<a href='/AIV/12/8/28'>2 Kings 8:28</a>; <a href='/AIV/12/8/29'>2 Kings 8:29</a>",
      "comment": "The narrative clarifies the political situation, with Jehu's elevation arising within the context of war and unrest—a setting ripe for divine intervention."
    },
    {
      "pk": 12009015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 15,
      "text": "But King Joram had returned to Jezreel to recover from the wounds the Arameans had given him in battle with Hazael the king of Aram. Jehu said, 'If this is your purpose, let no one escape from the city to go tell it in Jezreel.'",
      "links": "<a href='/AIV/12/8/29'>2 Kings 8:29</a>",
      "comment": "Jehu's caution ensured secrecy in his coup, mirroring biblical patterns where God's chosen act with both courage and prudence."
    },
    {
      "pk": 12009016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 16,
      "text": "So Jehu rode in a chariot and went to Jezreel, for Joram lay there. Ahaziah king of Judah had come down to see Joram.",
      "links": "<a href='/AIV/12/8/29'>2 Kings 8:29</a>",
      "comment": "The gathering of these two kings in Jezreel sets the scene for the fulfillment of divine prophecy and the transition of power."
    },
    {
      "pk": 12009017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 17,
      "text": "Now a watchman was standing on the tower in Jezreel, and he saw the company of Jehu as he came, and said, 'I see a company.' Joram said, 'Have a rider go and ask, \"Is it peace?\"'",
      "links": "<a href='/AIV/12/9/22'>2 Kings 9:22</a>",
      "comment": "‘Is it peace?’ expresses the expectation of order following turmoil, but Jehu brings God's justice, not the peace Joram hopes for."
    },
    {
      "pk": 12009018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 18,
      "text": "A rider went to meet him and said, 'Thus says the king: \"Is it peace?\"' Jehu replied, 'What have you to do with peace? Turn and follow me.' So the watchman reported, 'The messenger went to them, but he is not coming back.'",
      "links": "<a href='/AIV/12/9/17'>2 Kings 9:17</a>",
      "comment": "Jehu’s response shows a shift from earthly peace to divine judgment. The messenger’s allegiance is shifted, symbolizing God drawing even neutral bystanders into His plan."
    },
    {
      "pk": 12009019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 19,
      "text": "Then the king sent out a second rider, and when he came to them he said, 'Thus says the king: \"Is it peace?\"' Jehu answered, 'What have you to do with peace? Turn and follow me.'",
      "links": "<a href='/AIV/12/9/18'>2 Kings 9:18</a>",
      "comment": "Repeated questioning reinforces the lack of true peace apart from God’s justice. Earthly peace is shown as insufficient when God intervenes."
    },
    {
      "pk": 12009020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 20,
      "text": "The watchman reported, 'He went up to them, and he is not coming back. The driving is like the driving of Jehu son of Nimshi, for he drives furiously.'",
      "links": "<a href='/AIV/12/9/16'>2 Kings 9:16</a>",
      "comment": "The description of Jehu’s furious driving signals urgency and zeal to accomplish God’s judgment—a quality later echoed in the fervor of apostles."
    },
    {
      "pk": 12009021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 21,
      "text": "Joram said, 'Get ready.' So his chariot was made ready, and Joram king of Israel and Ahaziah king of Judah each went out in his chariot to meet Jehu. They met him at the property of Naboth the Jezreelite.",
      "links": "<a href='/AIV/11/21/15'>1 Kings 21:15</a>; <a href='/AIV/11/21/18-19'>1 Kings 21:18-19</a>",
      "comment": "Mention of Naboth’s property points to the final reckoning for the injustice done by Ahab and Jezebel against Naboth, fulfilling prophesied judgment (1 Kings 21:18-19)."
    },
    {
      "pk": 12009022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 22,
      "text": "When Joram saw Jehu, he said, 'Is it peace, Jehu?' Jehu answered, 'What peace can there be, so long as your mother Jezebel’s whoredoms and witchcrafts are so many?'",
      "links": "<a href='/AIV/11/21/25'>1 Kings 21:25</a>; <a href='/AIV/12/9/30'>2 Kings 9:30</a>",
      "comment": "Jehu exposes the root of false peace—idolatry and immorality lead to judgment. Christ would later confront and expose hypocrisy, calling for deeper repentance."
    },
    {
      "pk": 12009023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 23,
      "text": "Then Joram turned his hands and fled, yelling to Ahaziah, 'Treachery, Ahaziah!'",
      "links": "<a href='/AIV/12/9/27'>2 Kings 9:27</a>",
      "comment": "Joram’s flight is indicative of the reaction to divine intervention—those opposed to God often flee when confronted with truth and justice."
    },
    {
      "pk": 12009024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 24,
      "text": "Jehu drew his bow with full strength and shot Joram between the shoulders. The arrow struck his heart, and he collapsed in his chariot.",
      "links": "<a href='/AIV/12/9/7'>2 Kings 9:7</a>",
      "comment": "This act fulfilled the judgment prophesied by Elijah. God’s justice in history is decisive, and its fulfillment is a mark of His sovereign will."
    },
    {
      "pk": 12009025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 25,
      "text": "Jehu said to Bidkar his aide, 'Take him up and throw him on the field of Naboth the Jezreelite. Remember, when you and I rode together behind his father Ahab, the LORD pronounced this judgment against him.'",
      "links": "<a href='/AIV/11/21/19'>1 Kings 21:19</a>",
      "comment": "Prophecy and history meet in this act; the innocent blood of Naboth finds retribution, reflecting God’s unwavering commitment to justice."
    },
    {
      "pk": 12009026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 26,
      "text": "'As surely as I saw yesterday the blood of Naboth and the blood of his sons, declares the LORD. I will repay you in this plot, declares the LORD.' So now, take him and throw him on this plot of land, in accordance with the word of the LORD.",
      "links": "<a href='/AIV/11/21/19'>1 Kings 21:19</a>; <a href='/AIV/12/9/25'>2 Kings 9:25</a>",
      "comment": "Retribution falls at the exact site of injustice, symbolizing that God’s justice is not arbitrary but measured and perfect in timing."
    },
    {
      "pk": 12009027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 27,
      "text": "When Ahaziah king of Judah saw this, he fled by the way of the garden house. Jehu pursued him and said, 'Shoot him, too!' So they shot him in his chariot at the ascent of Gur, near Ibleam. He fled to Megiddo and died there.",
      "links": "<a href='/AIV/12/10/13-14'>2 Kings 10:13-14</a>; <a href='/AIV/12/8/29'>2 Kings 8:29</a>",
      "comment": "Ahaziah’s death further emphasizes that neither alliance nor proximity protects from God’s justice when there’s guilt by association or action."
    },
    {
      "pk": 12009028,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 28,
      "text": "His servants carried him in a chariot to Jerusalem and buried him in his tomb with his fathers in the city of David.",
      "links": "<a href='/AIV/12/11/2'>2 Kings 11:2</a>; <a href='/AIV/14/22/9'>2 Chron. 22:9</a>",
      "comment": "Despite Ahaziah’s fate, burial in the city of David highlights respect for the Davidic dynasty, pointing to God’s ongoing covenant with David’s household—a theme with messianic significance."
    },
    {
      "pk": 12009029,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 29,
      "text": "In the eleventh year of Joram son of Ahab, Ahaziah began to reign over Judah.",
      "links": "<a href='/AIV/12/8/25'>2 Kings 8:25</a>",
      "comment": "Chronology links the reigns and emphasizes the historical reliability of the text. Scripture meticulously orders events, offering a trustworthy record for believers."
    },
    {
      "pk": 12009030,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 30,
      "text": "When Jehu arrived at Jezreel, Jezebel heard of it. She painted her eyes, adorned her head, and looked out of the window.",
      "links": "<a href='/AIV/11/21/23'>1 Kings 21:23</a>",
      "comment": "Jezebel’s adornment suggests pride and defiance; facing death, she clings to outward appearance, like those who rely on superficiality over repentance."
    },
    {
      "pk": 12009031,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 31,
      "text": "As Jehu entered the gate, she said, 'Is it peace, Zimri, slayer of your master?'",
      "links": "<a href='/AIV/11/16/9-12'>1 Kings 16:9-12</a>",
      "comment": "Jezebel’s taunt recalls Zimri, another usurper, attempting to undermine Jehu’s legitimacy. Her challenge replays cycles of rebellion and highlights the consequences of ungodly rule."
    },
    {
      "pk": 12009032,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 32,
      "text": "Jehu lifted up his face toward the window and said, 'Who is on my side? Who?' Two or three eunuchs looked out at him.",
      "links": "<a href='/AIV/12/9/7'>2 Kings 9:7</a>",
      "comment": "The question tests court loyalty. Eunuchs, often seen as servants rather than political actors, here facilitate God’s judgment, echoing that God can use unexpected agents to fulfill His will."
    },
    {
      "pk": 12009033,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 33,
      "text": "He said, 'Throw her down.' So they threw her down, and some of her blood splattered on the wall and on the horses, and they trampled her.",
      "links": "<a href='/AIV/12/9/10'>2 Kings 9:10</a>; <a href='/AIV/12/9/36'>2 Kings 9:36</a>",
      "comment": "The violent demise of Jezebel fulfills prophecy and serves as a warning against those who defy God’s authority. Judgment is final and unalterable."
    },
    {
      "pk": 12009034,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 34,
      "text": "Then Jehu went in, ate and drank, and said, 'Go, see to that accursed woman and bury her, for she is a king's daughter.'",
      "links": "<a href='/AIV/12/9/10'>2 Kings 9:10</a>",
      "comment": "Even in judgment, Jehu recognizes her royal status, allowing burial. The balance of justice and dignity resonates with the Church’s teaching on respect for human dignity even amidst judgment."
    },
    {
      "pk": 12009035,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 35,
      "text": "But when they went out to bury her, they found only her skull, feet, and the palms of her hands.",
      "links": "<a href='/AIV/12/9/10'>2 Kings 9:10</a>",
      "comment": "Only parts remain, a literal fulfillment of prophecy and symbolic of the utter destruction reserved for those who persistently oppose God."
    },
    {
      "pk": 12009036,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 36,
      "text": "So they returned and told Jehu, and he said, 'This is the word of the LORD, which He spoke by His servant Elijah the Tishbite: \"In the land at Jezreel, the dogs shall eat the flesh of Jezebel.\"'",
      "links": "<a href='/AIV/11/21/23'>1 Kings 21:23</a>",
      "comment": "Explicit connection to Elijah’s prophecy reveals that God’s word never fails, strengthening trust in the reliability of biblical promises and prophecies, as later realized in Christ."
    },
    {
      "pk": 12009037,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 9,
      "verse": 37,
      "text": "'And the corpse of Jezebel shall be as dung on the field in the plot at Jezreel, so that they shall not say, \"This is Jezebel.\"'",
      "links": "<a href='/AIV/11/21/23'>1 Kings 21:23</a>",
      "comment": "Final dishonor ensures Jezebel is never memorialized—her reign ends in utter humiliation, underscoring the biblical theme that pride and rebellion end in destruction."
    }
  ],
  "translatedAt": "2025-12-24T03:53:08.775Z"
}