{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 5,
  "verses": [
    {
      "pk": 12005001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 1,
      "text": "Now Naaman was the commander of the army of the king of Aram. He was a great man in the eyes of his master, highly esteemed, because through him the LORD had given victory to Aram. He was a mighty man of valor, but he had leprosy.",
      "links": "<a href='/AIV/42/4/27'>Luke 4:27</a>;<a href='/AIV/03/13/2-3'>Lev. 13:2-3</a>",
      "comment": "Naaman is recognized as a great leader, yet stricken with leprosy—a sign that earthly power does not make one immune from suffering. The mention that God gave victory to Aram shows God's sovereignty over all nations. Jesus refers to Naaman in Luke 4:27, illustrating God’s mercy beyond Israel."
    },
    {
      "pk": 12005002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 2,
      "text": "Now bands of Arameans had gone out and taken captive a young girl from the land of Israel, and she served Naaman’s wife.",
      "links": "<a href='/AIV/01/50/20'>Gen. 50:20</a>",
      "comment": "God uses unlikely people for His purposes—the servant girl becomes the source of hope. This reflects the theme of providence, as seen in Genesis 50:20."
    },
    {
      "pk": 12005003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 3,
      "text": "She said to her mistress, 'If only my master were with the prophet who is in Samaria! He could cure him of his leprosy.'",
      "links": "<a href='/AIV/42/4/27'>Luke 4:27</a>",
      "comment": "The faith of the servant girl introduces the hope of healing. Note the clear expectation of the prophet’s intercessory power and God’s willingness to heal."
    },
    {
      "pk": 12005004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 4,
      "text": "So Naaman went in and told his master, 'This is what the girl from the land of Israel said.'",
      "links": "",
      "comment": "The general’s willingness to listen to a foreign servant suggests humility and openness—dispositions favorable for receiving God’s grace."
    },
    {
      "pk": 12005005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 5,
      "text": "The king of Aram said, 'Go now, and I will send a letter to the king of Israel.' So Naaman left, taking with him ten talents of silver, six thousand shekels of gold, and ten changes of clothes.",
      "links": "<a href='/AIV/11/10/25'>1 Kgs 10:25</a>",
      "comment": "The substantial gifts illustrate the honor and expectation Naaman has. Gifts for favors from the divine recall ancient customs and prefigure later sacramental economies (see 1 Kgs 10:25 for royal exchanges)."
    },
    {
      "pk": 12005006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 6,
      "text": "And he brought the letter to the king of Israel, which read: 'Now when this letter reaches you, you will see that I have sent Naaman my servant to you, so that you may cure him of his leprosy.'",
      "links": "<a href='/AIV/40/8/8-9'>Matt. 8:8-9</a>",
      "comment": "The assumption that the king can heal shows the misunderstanding between human authority and God’s power—anticipating the distinction in Matt. 8:8-9 between unworthiness and the Lord’s word of healing."
    },
    {
      "pk": 12005007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 7,
      "text": "When the king of Israel read the letter, he tore his clothes and said, 'Am I God, to kill and to make alive, that this man sends word to me to cure a man of his leprosy? Only consider, and see how he is seeking a quarrel with me.'",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>",
      "comment": "The king realizes healing is solely in God's power, citing Divine prerogative as in Deut. 32:39. He suspects the request is a political provocation."
    },
    {
      "pk": 12005008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 8,
      "text": "But when Elisha, the man of God, heard that the king of Israel had torn his clothes, he sent word to the king, saying, 'Why have you torn your clothes? Let him come to me, and he will know that there is a prophet in Israel.'",
      "links": "<a href='/AIV/09/03/20'>1 Sam. 3:20</a>;<a href='/AIV/43/9/32-33'>John 9:32-33</a>",
      "comment": "Elisha establishes his prophetic authority—parallel to Moses and later Christ as mediators—pointing toward the need for a divinely established mediator on earth."
    },
    {
      "pk": 12005009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 9,
      "text": "So Naaman came with his horses and chariots and stood at the door of Elisha’s house.",
      "links": "",
      "comment": "Naaman’s impressive display contrasts with the humble location, showing God’s choice to work through the apparently insignificant."
    },
    {
      "pk": 12005010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 10,
      "text": "Elisha sent a messenger to him, saying, 'Go and wash in the Jordan seven times, and your flesh will be restored, and you will be clean.'",
      "links": "<a href='/AIV/03/14/7'>Lev. 14:7</a>;<a href='/AIV/40/3/6'>Matt. 3:6</a>;<a href='/AIV/43/9/7'>John 9:7</a>",
      "comment": "The act of cleansing in the Jordan prefigures Christian baptism—washing away impurity by simple obedience. Seven symbolizes completeness. See also John 9:7 for washing as a sign of cleansing."
    },
    {
      "pk": 12005011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 11,
      "text": "But Naaman became angry and went away, saying, 'I thought he would surely come out to me and stand, and call on the name of the LORD his God, and wave his hand over the place, and cure the leprosy.'",
      "links": "<a href='/AIV/06/6/16'>Josh. 6:16</a>",
      "comment": "Naaman expects healing through dramatic ritual, not simple obedience—akin to the pride that can expect God to act according to human plans. God's ways often go beyond what we expect."
    },
    {
      "pk": 12005012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 12,
      "text": "'Are not Abana and Pharpar, the rivers of Damascus, better than all the waters of Israel? Could I not wash in them and be clean?' So he turned and went away in a rage.",
      "links": "<a href='/AIV/47/10/4'>2 Cor. 10:4</a>",
      "comment": "Human wisdom is contrasted with divine command; the focus on a particular place and method points to the necessity of accepting God’s appointed means for grace."
    },
    {
      "pk": 12005013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 13,
      "text": "But his servants approached and spoke to him, saying, 'My father, if the prophet had told you to do something great, would you not have done it? How much more, then, when he says to you, ",
      "and be clean": "text you only, wash, and be clean?",
      "links": "",
      "comment": "Sometimes obedience to God’s simple instruction is more effective than grand actions. The role of community in encouraging faith is important."
    },
    {
      "pk": 12005014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 14,
      "text": "So he went down and dipped himself seven times in the Jordan, according to the word of the man of God. And his flesh was restored like the flesh of a young child, and he was clean.",
      "links": "<a href='/AIV/40/18/3'>Matt. 18:3</a>;<a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "The restoration of Naaman’s flesh 'like a young child' echoes the spiritual rebirth through water, a clear typology for the cleansing power of baptism (see John 3:5, Matt. 18:3). God’s healing is effective when received with humility."
    },
    {
      "pk": 12005015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 15,
      "text": "Then he returned to the man of God, he and all his attendants, and came and stood before him. And he said, 'Now I know that there is no God in all the earth except in Israel. Please accept a gift from your servant.'",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>;<a href='/AIV/09/10/27'>1 Sam. 10:27</a>",
      "comment": "Naaman publicly confesses faith in the one true God, paralleling Psalm 86:8. He offers a gift in gratitude—a foreshadow of offering firstfruits for divine blessings."
    },
    {
      "pk": 12005016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 16,
      "text": "But Elisha said, 'As the LORD lives, before whom I stand, I will accept nothing.' Naaman urged him to take it, but he refused.",
      "links": "<a href='/AIV/01/14/22-23'>Gen. 14:22-23</a>",
      "comment": "Elisha mirrors Abraham’s integrity, refusing material reward so God’s grace is not thought of as bought. True ministry is detached from self-interest."
    },
    {
      "pk": 12005017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 17,
      "text": "Then Naaman said, 'If not, please let your servant be given as much earth as a pair of mules can carry, for your servant will no longer offer burnt offering or sacrifice to other gods, but only to the LORD.'",
      "links": "<a href='/AIV/02/20/24'>Exod. 20:24</a>;<a href='/AIV/19/99/5'>Ps. 99:5</a>",
      "comment": "Taking earth from Israel may reflect a desire to worship God on holy ground, foreshadowing the sanctity of place and altar in worship (see Exod. 20:24)."
    },
    {
      "pk": 12005018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 18,
      "text": "But may the LORD pardon your servant in this: when my master enters the house of Rimmon to worship there, leaning on my arm, and I bow myself in the house of Rimmon—when I bow myself in the house of Rimmon, may the LORD pardon your servant in this matter.'",
      "links": "<a href='/AIV/09/16/7'>1 Sam. 16:7</a>",
      "comment": "Naaman requests pardon for necessary outward actions not reflecting his changed heart—a situation prompting reflection on the tension between obedience, conscience, and social duty."
    },
    {
      "pk": 12005019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 19,
      "text": "And he said to him, 'Go in peace.' So he went from him a little way.",
      "links": "<a href='/AIV/42/7/50'>Luke 7:50</a>",
      "comment": "Elisha’s blessing of peace echoes Christ’s later gift of peace after forgiveness (see Luke 7:50). Peace is the fruit of faith and reconciliation with God."
    },
    {
      "pk": 12005020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 20,
      "text": "But Gehazi, the servant of Elisha the man of God, said, 'Behold, my master has spared this Naaman the Aramean, by not accepting from his hand what he brought. As the LORD lives, I will run after him and take something from him.'",
      "links": "<a href='/AIV/06/7/21'>Josh. 7:21</a>",
      "comment": "Gehazi’s greed recalls Achan’s sin in Josh. 7:21. The temptation to profit from God’s gifts is condemned, highlighting the importance of upright motives in spiritual service."
    },
    {
      "pk": 12005021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 21,
      "text": "So Gehazi pursued Naaman. And when Naaman saw someone running after him, he got down from the chariot to meet him and said, 'Is all well?'",
      "links": "",
      "comment": "Naaman’s humility continues—he honors Gehazi by dismounting. This narrative’s focus moves to the consequences of deception."
    },
    {
      "pk": 12005022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 22,
      "text": "And he said, 'All is well. My master has sent me, saying, ",
      "'Behold, just now two young men of the sons of the prophets have come to me from the hill country of Ephraim. Please give them a talent of silver and two changes of clothes.'": "text you only, 'All is well. My master has sent me, saying, 'Behold, just now two young men of the sons of the prophets have come to me from the hill country of Ephraim. Please give them a talent of silver and two changes of clothes.''",
      "links": "",
      "comment": "Gehazi invents a story using the pretext of charity—a warning against twisting good causes for personal gain."
    },
    {
      "pk": 12005023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 23,
      "text": "Naaman said, 'Please, take two talents.' He urged him and bound two talents of silver in two bags, with two changes of clothes, and gave them to two of his servants, and they carried them before Gehazi.",
      "links": "",
      "comment": "Naaman gives generously, unwittingly participating in Gehazi's deceit. True generosity is contrasted with corrupt receipt."
    },
    {
      "pk": 12005024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 24,
      "text": "When he came to the hill, he took them from their hand, and put them away in the house, and sent the men away, and they departed.",
      "links": "",
      "comment": "Gehazi acts secretly, showing the concealed nature of sin. The narrative builds toward judgment for mishandling God’s gifts."
    },
    {
      "pk": 12005025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 25,
      "text": "He went in, and stood before his master. And Elisha said to him, 'Where have you been, Gehazi?' And he said, 'Your servant went nowhere.'",
      "links": "<a href='/AIV/01/03/9'>Gen. 3:9</a>",
      "comment": "Elisha’s question echoes God’s questions to Adam—sin leads to evasion and further dishonesty."
    },
    {
      "pk": 12005026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 26,
      "text": "But he said to him, 'Did not my heart go with you when the man turned from his chariot to meet you? Is it a time to receive money and clothes, olive groves and vineyards, sheep and oxen, male and female servants?'",
      "links": "<a href='/AIV/44/5/1-11'>Acts 5:1-11</a>",
      "comment": "The Spirit of God reveals hidden things to the prophet, as later with Peter and Ananias in Acts 5. Ministry should never be a means to personal enrichment."
    },
    {
      "pk": 12005027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 5,
      "verse": 27,
      "text": "Therefore the leprosy of Naaman shall cling to you and to your descendants forever.' And Gehazi went out from his presence a leper, as white as snow.",
      "links": "<a href='/AIV/04/12/10'>Num. 12:10</a>;<a href='/AIV/03/13/13'>Lev. 13:13</a>",
      "comment": "The punishment mirrors Miriam’s leprosy in Num. 12:10—a sobering warning for misusing spiritual trust. The Bible here affirms divine justice and the consequences of sacrilege. True stewardship demands both integrity and humility."
    }
  ],
  "translatedAt": "2025-12-24T03:48:10.647Z"
}