{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 8,
  "verses": [
    {
      "pk": 12008001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 1,
      "text": "Now Elisha said to the woman whose son he had restored to life, \"Arise and go with your household, and settle wherever you can, for the LORD has called for a famine, and it will come upon the land for seven years.\"",
      "links": "<a href='/AIV/12/4/35-37'>2 Kgs 4:35-37</a>; <a href='/AIV/01/12/10'>Gen 12:10</a>",
      "comment": "Elisha's prophecy reflects the continued protection and guidance God gives through his prophets. Seven years recall other biblical judgments (cf. Genesis 41:30), signaling completeness in divine discipline."
    },
    {
      "pk": 12008002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 2,
      "text": "So the woman arose and did according to the word of Elisha. She went with her household and resided in the land of the Philistines seven years.",
      "links": "<a href='/AIV/09/22/3'>1 Sam 22:3</a>",
      "comment": "Her obedience demonstrates trust in prophetic authority—God works through chosen mediators, pointing to the importance of apostolic teaching and tradition throughout salvation history."
    },
    {
      "pk": 12008003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 3,
      "text": "At the end of seven years, the woman returned from the land of the Philistines, and she came to appeal to the king for her house and her field.",
      "links": "<a href='/AIV/08/4/3-5'>Ruth 4:3-5</a>",
      "comment": "The return echoes Israel's exile and restoration. The woman's appeal signifies the importance of rightful inheritance and restoration, which can be seen as a figure of spiritual restoration."
    },
    {
      "pk": 12008004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 4,
      "text": "Now the king was talking with Gehazi, the servant of the man of God, saying, \"Tell me about all the great things Elisha has done.\"",
      "links": "<a href='/AIV/12/4/12-37'>2 Kgs 4:12-37</a>",
      "comment": "The king’s inquiry shows openness to the miracles and authority of the prophet, acknowledging continued need for godly leadership and witness, anticipating the role of witness and tradition in future generations."
    },
    {
      "pk": 12008005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 5,
      "text": "While he was telling the king how Elisha had restored the dead to life, the woman whose son he had brought back came in to appeal to the king for her house and for her land. Gehazi said, \"My lord king, here is the woman, and here is her son whom Elisha restored to life.\"",
      "links": "<a href='/AIV/12/4/35'>2 Kgs 4:35</a>",
      "comment": "The providential timing of her arrival highlights divine orchestration in answering petitions, and the value of public witness to miracles as faith-building elements within community."
    },
    {
      "pk": 12008006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 6,
      "text": "And when the king asked the woman, she told him her story. So the king appointed an official to her, saying, \"Restore all that was hers, and all the produce of the field from the day she left the land until now.\"",
      "links": "<a href='/AIV/03/25/23-28'>Lev 25:23-28</a>",
      "comment": "Restoration of property fulfills justice and mercy, echoing jubilee law and the concept of divine recompense, which prefigures the fullness of spiritual restitution promised to the faithful."
    },
    {
      "pk": 12008007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 7,
      "text": "Elisha went to Damascus. Ben-Hadad king of Aram was sick, and when he was told, \"The man of God has come here,\"",
      "links": "<a href='/AIV/11/20/1'>1 Kgs 20:1</a>",
      "comment": "Elisha’s journey to a foreign court reveals how God’s prophets are instruments for all nations, previewing the expansion of grace beyond ethnic Israel, and God’s sovereignty amongst Gentile powers."
    },
    {
      "pk": 12008008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 8,
      "text": "the king said to Hazael, \"Take a present in your hand, and go to meet the man of God. Inquire of the LORD through him, saying, 'Will I recover from this illness?' \"",
      "links": "<a href='/AIV/09/9/6'>1 Sam 9:6</a>",
      "comment": "Seeking the prophet indicates awareness of divine mediation between God and man, strongly affirming God's designated representatives as intercessors, a principle that continues in communal prayer and mediation."
    },
    {
      "pk": 12008009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 9,
      "text": "So Hazael went to meet him, taking with him as a gift forty camels’ loads of all the good things of Damascus. He came and stood before him and said, \"Your son Ben-Hadad king of Aram has sent me to you, asking, 'Will I recover from this illness?' \"",
      "links": "<a href='/AIV/11/10/1-2'>1 Kgs 10:1-2</a>",
      "comment": "The extravagant gift is reminiscent of homage to prophets and kings, underscoring the reverence due to those through whom God speaks, subtly suggesting the principle of honor to God’s representatives."
    },
    {
      "pk": 12008010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 10,
      "text": "And Elisha said to him, \"Go, say to him, 'You will surely recover.' Yet the LORD has shown me that he will certainly die.\"",
      "links": "<a href='/AIV/09/28/6-19'>1 Sam 28:6-19</a>",
      "comment": "Elisha’s answer exposes divine mystery—God’s sovereignty over life and death. There is a prophetic tension between natural recovery and divine decree, which calls for trust beyond mere appearances."
    },
    {
      "pk": 12008011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 11,
      "text": "He fixed his gaze and stared at Hazael until he was ashamed. Then the man of God wept.",
      "links": "<a href='/AIV/12/13/14'>2 Kgs 13:14</a>; <a href='/AIV/19/119/136'>Ps 119:136</a>",
      "comment": "Elisha's intense mourning reflects profound sorrow over the coming suffering—anticipating the compassionate mourning of Jesus over Jerusalem (cf. Luke 19:41). Prophetic grief hints at deep spiritual concern for the flock."
    },
    {
      "pk": 12008012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 12,
      "text": "Hazael said, \"Why does my lord weep?\" He answered, \"Because I know the evil you will do to the Israelites: you will set fire to their fortresses, slay their young men with the sword, dash their little ones, and rip open their pregnant women.\"",
      "links": "<a href='/AIV/23/13/16-18'>Isa 13:16-18</a>",
      "comment": "Elisha’s prophecy reveals bitter consequences of sin, emphasizing God’s foreknowledge and mercy through warning. Suffering in scripture continually invites repentance and deeper communion."
    },
    {
      "pk": 12008013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 13,
      "text": "Hazael said, \"But what is your servant, this dog, that he should do such a great thing?\" Elisha answered, \"The LORD has shown me that you shall be king of Aram.\"",
      "links": "<a href='/AIV/11/19/15-17'>1 Kgs 19:15-17</a>",
      "comment": "Despite his humility, Hazael is destined for power, signifying how divine providence can raise up instruments for God’s purposes, even through unlikely means."
    },
    {
      "pk": 12008014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 14,
      "text": "Then Hazael departed from Elisha and went to his master, who said to him, \"What did Elisha say to you?\" And he replied, \"He told me that you would surely recover.\"",
      "links": "<a href='/AIV/12/8/10'>2 Kgs 8:10</a>",
      "comment": "Hazael reports only part of Elisha’s message, a reminder of the danger of selective truth. The full revelation of God's word, as preserved by the apostolic office, is always necessary for spiritual well-being."
    },
    {
      "pk": 12008015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 15,
      "text": "But the next day, Hazael took a cloth, soaked it in water, and spread it over the king’s face, until he died. And Hazael became king in his place.",
      "links": "<a href='/AIV/11/19/15-17'>1 Kgs 19:15-17</a>",
      "comment": "Fulfillment of prophecy happens tragically but swiftly—God’s sovereignty is never thwarted by human actions, affirming providence governs even the rise and fall of rulers."
    },
    {
      "pk": 12008016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 16,
      "text": "In the fifth year of Joram son of Ahab king of Israel, Jehoram son of Jehoshaphat king of Judah began to reign.",
      "links": "<a href='/AIV/11/22/51'>1 Kgs 22:51</a>",
      "comment": "The interlocking reigns of Israel and Judah highlight the complexity of God’s providential governance—a reminder of the interconnectedness of God’s people and shared spiritual destiny."
    },
    {
      "pk": 12008017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 17,
      "text": "He was thirty-two years old when he became king, and he reigned eight years in Jerusalem.",
      "links": "<a href='/AIV/14/21/5'>2 Chron 21:5</a>",
      "comment": "The age and tenure of Jehoram recall the significance of dynastic continuity—a theme later understood as fulfilled in the everlasting kingship established by Christ, the true Son of David."
    },
    {
      "pk": 12008018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 18,
      "text": "He walked in the ways of the kings of Israel, as the house of Ahab had done, for Ahab’s daughter was his wife. He did evil in the sight of the LORD.",
      "links": "<a href='/AIV/11/21/25'>1 Kgs 21:25</a>",
      "comment": "Jehoram’s apostasy due to foreign influence underscores the danger of turning from true worship—a theme that encourages discernment regarding faithfulness to divinely established teaching."
    },
    {
      "pk": 12008019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 19,
      "text": "Yet the LORD was not willing to destroy Judah, for the sake of David his servant, as he had promised him to give a lamp to him and to his sons forever.",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam 7:12-16</a>; <a href='/AIV/19/132/17'>Ps 132:17</a>",
      "comment": "God's promise of a perpetual dynasty foreshadows the messianic fulfillment in Jesus Christ, the everlasting King, demonstrating the faithfulness of God’s covenant through all ages."
    },
    {
      "pk": 12008020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 20,
      "text": "In his days, Edom revolted from the rule of Judah and appointed their own king.",
      "links": "<a href='/AIV/01/27/40'>Gen 27:40</a>",
      "comment": "Edom’s revolt fulfills earlier prophecy regarding Israel’s enemies. It also shows the consequences of unfaithfulness, separating what God had once joined—a pattern repeatedly seen in scripture."
    },
    {
      "pk": 12008021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 21,
      "text": "Then Jehoram crossed over to Zair with all his chariots. He rose by night and struck down the Edomites who had surrounded him, and the commanders of the chariots, but his troops fled to their tents.",
      "links": "<a href='/AIV/14/21/9'>2 Chron 21:9</a>",
      "comment": "Despite initial success, Jehoram faces defeat and loss, illustrating the futility of human efforts apart from divine favor—a subtle call to reliance on grace, not mere human power."
    },
    {
      "pk": 12008022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 22,
      "text": "So Edom has been in revolt against the rule of Judah to this day. Then Libnah rebelled at the same time.",
      "links": "<a href='/AIV/06/10/29'>Josh 10:29</a>",
      "comment": "These revolts signal fragmentation among the chosen people, highlighting the necessity of faithful unity and adherence to the true worship handed down through covenant."
    },
    {
      "pk": 12008023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 23,
      "text": "Now the rest of the acts of Jehoram, and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/21/11'>2 Chron 21:11</a>",
      "comment": "The mention of other chronicles reveals the practice of preserving authoritative tradition and history—a principle of recording God’s works that becomes essential in apostolic succession."
    },
    {
      "pk": 12008024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 24,
      "text": "And Jehoram slept with his fathers and was buried with them in the city of David. And Ahaziah his son became king in his place.",
      "links": "<a href='/AIV/10/7/12'>2 Sam 7:12</a>",
      "comment": "Dynastic succession preserves the promise made to David, pointing ahead to the fullness of its realization in Jesus Christ, whose kingship is eternal and fulfills every prophecy."
    },
    {
      "pk": 12008025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 25,
      "text": "In the twelfth year of Joram son of Ahab king of Israel, Ahaziah son of Jehoram king of Judah began to reign.",
      "links": "<a href='/AIV/14/22/1'>2 Chron 22:1</a>",
      "comment": "The interconnection of reigns continues to show the close historical and spiritual bond between the northern and southern kingdoms, even amidst division."
    },
    {
      "pk": 12008026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 26,
      "text": "Ahaziah was twenty-two years old when he became king, and he reigned one year in Jerusalem. His mother’s name was Athaliah, granddaughter of Omri king of Israel.",
      "links": "<a href='/AIV/14/22/2'>2 Chron 22:2</a>",
      "comment": "Athaliah’s influence, as a daughter of the northern kingdom, signals recurring issues with faithfulness. The danger of syncretism is ever-present, making continual discernment and fidelity to the true teaching essential."
    },
    {
      "pk": 12008027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 27,
      "text": "He walked in the way of the house of Ahab and did evil in the sight of the LORD, like the house of Ahab, for he was related by marriage to Ahab’s family.",
      "links": "<a href='/AIV/11/21/25'>1 Kgs 21:25</a>",
      "comment": "Ahaziah’s downfall due to family ties reveals the powerful influence of relationships on faith, compelling all believers to seek fidelity to what has been handed down by the apostles."
    },
    {
      "pk": 12008028,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 28,
      "text": "He went with Joram son of Ahab to war against Hazael king of Aram at Ramoth-gilead. And the Arameans wounded Joram.",
      "links": "<a href='/AIV/12/9/14-15'>2 Kgs 9:14-15</a>",
      "comment": "Political and military alliances apart from God’s direction often lead to disaster, illustrating the need for continual dependence on divinely appointed leadership."
    },
    {
      "pk": 12008029,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 8,
      "verse": 29,
      "text": "King Joram returned to Jezreel to recover from the wounds the Arameans had inflicted at Ramah when he fought against Hazael king of Aram. Then Ahaziah son of Jehoram king of Judah went down to Jezreel to visit Joram son of Ahab.",
      "links": "<a href='/AIV/12/9/15-16'>2 Kgs 9:15-16</a>",
      "comment": "Jezreel foreshadows coming judgment. Visiting the wounded king also connects to coming events where divine justice and mercy are unveiled in the midst of human affairs."
    }
  ],
  "translatedAt": "2025-12-24T03:49:53.167Z"
}