{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 20,
  "verses": [
    {
      "pk": 12020001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 1,
      "text": "In those days Hezekiah became deathly ill, and Isaiah the prophet, son of Amoz, came to him and said, 'This is what the LORD says: Set your house in order, for you are going to die; you will not recover.'",
      "links": "<a href='/AIV/23/38/1'>Isa. 38:1</a>",
      "comment": "Isaiah gives Hezekiah a clear prophetic word regarding his imminent death. Divine judgment and mercy are themes here, as God communicates through prophetic authority. See spiritual leadership parallels in Hebrews 13:17."
    },
    {
      "pk": 12020002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 2,
      "text": "Hezekiah turned his face toward the wall and prayed to the LORD,",
      "links": "<a href='/AIV/23/38/2'>Isa. 38:2</a>; <a href='/AIV/19/102/3'>Ps. 102:3</a>",
      "comment": "Hezekiah's reaction is immediate prayer—a model for all believers in distress. Turning to God privately is emphasized (Matthew 6:6), highlighting both personal and liturgical prayer as necessary responses in crisis."
    },
    {
      "pk": 12020003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 3,
      "text": "'Please remember, LORD, how I have walked before You faithfully and wholeheartedly, and have done what is good in Your sight.' And Hezekiah wept bitterly.",
      "links": "<a href='/AIV/23/38/3'>Isa. 38:3</a>; <a href='/AIV/19/26/3'>Ps. 26:3</a>",
      "comment": "Hezekiah appeals to his faithfulness and works, showing the deep biblical connection between faith and works (James 2:17). His tears suggest repentance and humility, echoing the importance of penance and contrition."
    },
    {
      "pk": 12020004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 4,
      "text": "Before Isaiah had left the middle courtyard, the word of the LORD came to him:",
      "links": "<a href='/AIV/23/38/4'>Isa. 38:4</a>",
      "comment": "God responds to prayer with remarkable speed, teaching that the prayers of the righteous are effective (James 5:16). Prophetic mediation here reflects the enduring scriptural principle of spiritual authority."
    },
    {
      "pk": 12020005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 5,
      "text": "'Go back and tell Hezekiah, the leader of My people: This is what the LORD, the God of your father David, says: I have heard your prayer and seen your tears; I will heal you. On the third day you will go up to the house of the LORD.'",
      "links": "<a href='/AIV/23/38/5'>Isa. 38:5</a>; <a href='/AIV/19/56/8'>Ps. 56:8</a>",
      "comment": "God's response includes both healing and restoration to worship, linking physical and spiritual renewal. The reference to 'third day' points ahead to Christ's resurrection and victory over death (Luke 24:7; John 2:19)."
    },
    {
      "pk": 12020006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 6,
      "text": "'I will add fifteen years to your life. I will rescue you and this city from the hand of the king of Assyria. I will defend this city for My own sake and for the sake of My servant David.'",
      "links": "<a href='/AIV/23/38/6'>Isa. 38:6</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "God’s promise underscores His covenant faithfulness to David, illustrating enduring succession in leadership. Physical deliverance is inseparably connected to spiritual purpose and legacy."
    },
    {
      "pk": 12020007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 7,
      "text": "Then Isaiah said, 'Take a cake of figs.' So they took it and laid it on the boil, and Hezekiah recovered.",
      "links": "<a href='/AIV/23/38/21'>Isa. 38:21</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "Healing comes through both divine word and means—God works through creation. Using material elements anticipates the later use of visible signs in worship (John 9:6, James 5:14)."
    },
    {
      "pk": 12020008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 8,
      "text": "Hezekiah asked Isaiah, 'What will be the sign that the LORD will heal me and that I will go up to the house of the LORD on the third day?'",
      "links": "<a href='/AIV/23/38/22'>Isa. 38:22</a>; <a href='/AIV/2/4/8'>Ex. 4:8</a>",
      "comment": "Hezekiah requests assurance through a sign, a recurring biblical motif where God confirms His promises visibly (Judges 6:36-40)."
    },
    {
      "pk": 12020009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 9,
      "text": "Isaiah replied, 'This is the sign that the LORD will do what He has promised: Shall the shadow go forward ten steps or go back ten steps?'",
      "links": "<a href='/AIV/23/38/7-8'>Isa. 38:7-8</a>",
      "comment": "Miraculous signs not only authenticate prophet and promise but also reveal God’s mastery over time and creation—a foundation for theological trust in divine providence."
    },
    {
      "pk": 12020010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 10,
      "text": "Hezekiah answered, 'It is easy for the shadow to go forward ten steps. No—let it go back ten steps.'",
      "links": "<a href='/AIV/23/38/8'>Isa. 38:8</a>",
      "comment": "Hezekiah seeks a greater miracle, showing faith in God’s sovereignty while distinguishing between ordinary and extraordinary signs."
    },
    {
      "pk": 12020011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 11,
      "text": "Then the prophet Isaiah called upon the LORD, and He made the shadow go back ten steps on the staircase of Ahaz.",
      "links": "<a href='/AIV/23/38/8'>Isa. 38:8</a>; <a href='/AIV/6/10/12-14'>Josh. 10:12-14</a>",
      "comment": "God’s control over time and space is again demonstrated (see Joshua 10:13). The efficacy of intercessory prayer under prophetic leadership is reinforced."
    },
    {
      "pk": 12020012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 12,
      "text": "At that time, Merodach-baladan son of Baladan, king of Babylon, sent envoys with letters and a gift to Hezekiah, for he heard that Hezekiah had been sick.",
      "links": "<a href='/AIV/23/39/1'>Isa. 39:1</a>",
      "comment": "International recognition of Hezekiah’s healing highlights the witness of God’s work among the nations. There is an element of honor and attraction to holiness, foreshadowing worldwide admiration of righteous leadership (cf. Revelation 21:24)."
    },
    {
      "pk": 12020013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 13,
      "text": "Hezekiah welcomed them and showed them all his treasure—silver, gold, spices, fine oil, and his entire armory and everything found among his treasures. There was nothing in his palace or kingdom that Hezekiah did not show them.",
      "links": "<a href='/AIV/23/39/2'>Isa. 39:2</a>",
      "comment": "Hezekiah’s openness reveals vulnerability; earthly treasures are temporary and sharing them can invite future trouble. Compare Christ’s teaching on storing treasures in heaven (Matthew 6:19-21)."
    },
    {
      "pk": 12020014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 14,
      "text": "Then Isaiah the prophet came to King Hezekiah and asked, 'What did these men say, and where did they come from?' Hezekiah replied, 'They came from a distant country—from Babylon.'",
      "links": "<a href='/AIV/23/39/3'>Isa. 39:3</a>",
      "comment": "Isaiah questions Hezekiah, revealing the need for discernment and wisdom with outsiders. The future threat from Babylon is signaled."
    },
    {
      "pk": 12020015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 15,
      "text": "'What did they see in your house?' Isaiah asked. Hezekiah replied, 'They saw everything in my house. There is nothing among my treasures that I did not show them.'",
      "links": "<a href='/AIV/23/39/3'>Isa. 39:3</a>",
      "comment": "Complete openness here leads to later consequences. Sharing secrets of one’s stewardship is a lesson in prudence for spiritual leadership."
    },
    {
      "pk": 12020016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 16,
      "text": "Then Isaiah said to Hezekiah, 'Hear the word of the LORD:'",
      "links": "<a href='/AIV/23/39/5'>Isa. 39:5</a>",
      "comment": "Isaiah’s formal prophetic pronouncement is a solemn warning. God’s messengers relay judgment and instruction, maintaining the link between revelation, authority, and obedience."
    },
    {
      "pk": 12020017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 17,
      "text": "'The days are coming when everything in your palace and all that your predecessors have stored up until this day will be carried off to Babylon; nothing will be left, says the LORD.'",
      "links": "<a href='/AIV/23/39/6'>Isa. 39:6</a>; <a href='/AIV/24/20/5'>Jer. 20:5</a>",
      "comment": "The prophetic warning about Babylon’s future conquest ties to God’s overarching judgment and sovereignty over history. It anticipates the exile, underscoring both the importance of stewardship and trust in divine providence."
    },
    {
      "pk": 12020018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 18,
      "text": "'And some of your descendants, your own offspring, will be taken away and will become eunuchs in the palace of the king of Babylon.'",
      "links": "<a href='/AIV/23/39/7'>Isa. 39:7</a>; <a href='/AIV/27/1/3'>Dan. 1:3</a>",
      "comment": "Loss of line and service in a foreign court echoes the cost of unwise alliances and foreshadows the experience of Daniel and the remnant who serve faithfully despite exile."
    },
    {
      "pk": 12020019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 19,
      "text": "Hezekiah said to Isaiah, 'The word of the LORD that you have spoken is good.' For he thought, 'Will there not be peace and security in my days?'",
      "links": "<a href='/AIV/23/39/8'>Isa. 39:8</a>",
      "comment": "Hezekiah accepts the prophecy with humility, yet his inward focus on personal peace contrasts with long-term responsibility. Wisdom counsels intergenerational concern (Deuteronomy 5:9-10)."
    },
    {
      "pk": 12020020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 20,
      "text": "The rest of the acts of Hezekiah, his power, and how he built the pool and conduit and brought water into the city, are they not recorded in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/32/30'>2 Chr. 32:30</a>",
      "comment": "Hezekiah’s achievements include infrastructural improvements. Historical records affirm the importance of preserving tradition and heritage within community memory (Psalm 78:4-7)."
    },
    {
      "pk": 12020021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 20,
      "verse": 21,
      "text": "Hezekiah rested with his ancestors, and Manasseh his son became king in his place.",
      "links": "<a href='/AIV/14/33/1'>2 Chr. 33:1</a>",
      "comment": "The continuity of leadership through family succession points to the ancient pattern of succession and authority in the community of faith. See note on spiritual inheritance in 2 Timothy 1:5."
    }
  ],
  "translatedAt": "2025-12-24T03:59:23.751Z"
}