{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 2,
  "verses": [
    {
      "pk": 12002001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 1,
      "text": "When the LORD was about to take Elijah up to heaven by a whirlwind, Elijah and Elisha were on their way from Gilgal.",
      "links": "<a href='/AIV/01/05/24'>Gen. 5:24</a>; <a href='/AIV/11/19/16'>1 Kgs. 19:16</a>",
      "comment": "The miraculous departure of Elijah recalls Enoch (Gen. 5:24), showing God's unique work with certain prophets. Elijah's journey foreshadows Christ's Ascension (Lk. 24:51), indicating the continuation of prophetic ministry."
    },
    {
      "pk": 12002002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 2,
      "text": "Elijah said to Elisha, 'Please stay here, for the LORD has sent me as far as Bethel.' But Elisha replied, 'As the LORD lives, and as you yourself live, I will not leave you.' So they went down to Bethel.",
      "links": "<a href='/AIV/08/01/16-17'>Ruth 1:16-17</a>; <a href='/AIV/11/19/20-21'>1 Kgs. 19:20-21</a>",
      "comment": "Elisha’s loyalty reflects Ruth’s devotion (Ruth 1:16-17), an example of steadfast discipleship passed from master to disciple, prefiguring apostolic succession in the early church."
    },
    {
      "pk": 12002003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 3,
      "text": "The sons of the prophets who were in Bethel came out to Elisha and said to him, 'Do you know that today the LORD will take your master from over you?' He replied, 'Yes, I know it; keep silent.'",
      "links": "<a href='/AIV/11/18/4'>1 Kgs. 18:4</a>; <a href='/AIV/11/20/35'>1 Kgs. 20:35</a>",
      "comment": "These sons of the prophets formed communities that preserved sacred tradition, a pattern seen later in the early church, where the faith is passed on through spiritual fathers to their children."
    },
    {
      "pk": 12002004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 4,
      "text": "Elijah said to him, 'Elisha, please stay here, for the LORD has sent me to Jericho.' But he said, 'As the LORD lives, and as you yourself live, I will not leave you.' So they came to Jericho.",
      "links": "<a href='/AIV/06/02/1'>Josh. 2:1</a>",
      "comment": "The repeated testing of Elisha’s commitment reflects the enduring relationship between teacher and disciple, inviting reflection on fidelity to spiritual authority."
    },
    {
      "pk": 12002005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 5,
      "text": "The sons of the prophets who were in Jericho came near to Elisha and said, 'Do you know that today the LORD will take your master from over you?' He answered, 'Yes, I know it; keep silent.'",
      "links": "<a href='/AIV/11/20/35'>1 Kgs. 20:35</a>",
      "comment": "Elisha’s repeated request for silence shows reverence before God’s mysterious acts; this anticipates the reverent and contemplative spirit the apostolic church would foster in prayer and succession."
    },
    {
      "pk": 12002006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 6,
      "text": "Then Elijah said to him, 'Please stay here, for the LORD has sent me to the Jordan.' But he said, 'As the LORD lives, and as you yourself live, I will not leave you.' So the two of them went on.",
      "links": "<a href='/AIV/06/03/14-17'>Josh. 3:14-17</a>",
      "comment": "Crossing the Jordan again echoes Israel's earlier history (Josh. 3:14-17). The journey to the Jordan mirrors a spiritual pilgrimage, with Elijah as the spiritual father passing on his ministry."
    },
    {
      "pk": 12002007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 7,
      "text": "Fifty men of the sons of the prophets went and stood at some distance from them, as they both stood by the Jordan.",
      "links": "<a href='/AIV/06/03/4-17'>Josh. 3:4-17</a>",
      "comment": "The number fifty recalls Jubilee (Lev. 25:10), suggesting fulfillment and renewal. The prophets bear witness to the significant transfer of authority, echoing the communal witness of ordination."
    },
    {
      "pk": 12002008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 8,
      "text": "Then Elijah took his cloak, rolled it up, and struck the water. The water was divided to the one side and to the other, so the two of them crossed over on dry ground.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/06/03/14-17'>Josh. 3:14-17</a>",
      "comment": "Elijah's dividing of the waters mirrors Moses and Joshua, highlighting the prophetic office as a continuation of that authority. Significantly, it points to miracles as confirmation of spiritual leadership."
    },
    {
      "pk": 12002009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 9,
      "text": "When they had crossed, Elijah said to Elisha, 'Ask what I shall do for you, before I am taken from you.' Elisha said, 'Please let there be a double portion of your spirit upon me.'",
      "links": "<a href='/AIV/05/21/17'>Deut. 21:17</a>; <a href='/AIV/11/19/16'>1 Kgs. 19:16</a>",
      "comment": "Asking for a 'double portion' refers to the firstborn’s inheritance (Deut. 21:17)—Elisha claims the role of rightful heir, echoing the apostolic tradition’s emphasis on legitimate succession."
    },
    {
      "pk": 12002010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 10,
      "text": "He said, 'You have asked a hard thing. Yet, if you see me as I am taken from you, it shall be so for you; but if you do not see me, it shall not be so.'",
      "links": "<a href='/AIV/44/01/9-11'>Acts 1:9-11</a>",
      "comment": "Elijah’s promise is dependent on Elisha’s witness, much like the apostles were witnesses of Christ's Ascension (Acts 1:9-11). Leadership is passed on through personal encounter and visibility."
    },
    {
      "pk": 12002011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 11,
      "text": "As they went on and talked, behold, chariots of fire and horses of fire separated the two of them. Elijah went up by a whirlwind into heaven.",
      "links": "<a href='/AIV/06/05/15'>Josh. 5:15</a>; <a href='/AIV/11/18/38'>1 Kgs. 18:38</a>",
      "comment": "Elijah’s fiery ascent points toward Christ’s Ascension and the coming of the Holy Spirit at Pentecost as fire, reinforcing themes of continuity and spiritual empowerment."
    },
    {
      "pk": 12002012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 12,
      "text": "Elisha saw it and cried, 'My father, my father! The chariots of Israel and its horsemen!' Then he saw him no more. And he took hold of his own clothes and tore them in two pieces.",
      "links": "<a href='/AIV/13/12/18'>1 Chr. 12:18</a>; <a href='/AIV/44/07/55-56'>Acts 7:55-56</a>",
      "comment": "Elisha addresses Elijah as ‘father’, recognizing spiritual fatherhood and transmission. Tearing the clothes reflects mourning, but also the end of one era and the coming of another."
    },
    {
      "pk": 12002013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 13,
      "text": "He picked up the cloak of Elijah that had fallen from him and went back and stood on the bank of the Jordan.",
      "links": "<a href='/AIV/11/19/19'>1 Kgs. 19:19</a>",
      "comment": "The cloak symbolizes the passing of prophetic office—Elijah’s authority continues visibly in Elisha, much like liturgical symbols mark spiritual realities."
    },
    {
      "pk": 12002014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 14,
      "text": "Then he took the cloak of Elijah that had fallen from him, struck the water, and said, 'Where is the LORD, the God of Elijah?' And when he had struck the water, it was divided to the one side and to the other, and Elisha crossed over.",
      "links": "<a href='/AIV/02/14/21'>Ex. 14:21</a>; <a href='/AIV/06/03/14-17'>Josh. 3:14-17</a>",
      "comment": "This miracle confirms the Spirit’s empowerment and succession. Elisha does as Elijah did, signifying true continuity in God’s chosen leaders."
    },
    {
      "pk": 12002015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 15,
      "text": "Now when the sons of the prophets who were at Jericho saw him opposite them, they said, 'The spirit of Elijah rests on Elisha.' And they came to meet him and bowed to the ground before him.",
      "links": "<a href='/AIV/04/27/18-23'>Num. 27:18-23</a>; <a href='/AIV/05/34/9'>Deut. 34:9</a>",
      "comment": "The recognition by the prophetic community of Elisha’s authority formally affirms his succession. Such visible recognition mirrors the practice of public affirmation of spiritual authority."
    },
    {
      "pk": 12002016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 16,
      "text": "And they said to him, 'Behold now, there are with your servants fifty strong men. Please let them go and seek your master. Perhaps the Spirit of the LORD has taken him up and thrown him upon some mountain or into some valley.' But he said, 'You shall not send.'",
      "links": "<a href='/AIV/11/18/12'>1 Kgs. 18:12</a>",
      "comment": "Their uncertainty shows the mystery surrounding God’s actions; still, Elisha trusts God’s purpose, demonstrating faith in the promises given to him."
    },
    {
      "pk": 12002017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 17,
      "text": "But when they urged him until he was ashamed, he said, 'Send.' So they sent fifty men, and they searched for three days but did not find him.",
      "links": "<a href='/AIV/09/10/2'>1 Sam. 10:2</a>",
      "comment": "The fruitless search underscores the finality and uniqueness of Elijah’s translation, foreshadowing Christ’s own Resurrection, where the empty tomb testifies to God’s act."
    },
    {
      "pk": 12002018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 18,
      "text": "And they came back to him while he was staying at Jericho; and he said to them, 'Did I not say to you, Do not go?'",
      "links": "<a href='/AIV/09/10/14-16'>1 Sam. 10:14-16</a>",
      "comment": "Elisha’s prophetic insight is confirmed again, marking him as the true successor and spiritual authority for the community."
    },
    {
      "pk": 12002019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 19,
      "text": "Now the men of the city said to Elisha, 'Behold, the situation of this city is pleasant, as my lord sees, but the water is bad, and the land is unfruitful.'",
      "links": "<a href='/AIV/02/15/22-25'>Ex. 15:22-25</a>",
      "comment": "This request for healing the water recalls Moses purifying bitter water (Ex. 15:25). It symbolizes the role of God's chosen ones to mediate grace and blessing for the people."
    },
    {
      "pk": 12002020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 20,
      "text": "He said, 'Bring me a new bowl, and put salt in it.' So they brought it to him.",
      "links": "<a href='/AIV/03/02/13'>Lev. 2:13</a>; <a href='/AIV/40/05/13'>Matt. 5:13</a>",
      "comment": "Salt, a sign of preservation and covenant (Lev. 2:13), anticipates Jesus’ words calling his disciples the ‘salt of the earth’ (Matt. 5:13). Old Testament signs are fulfilled and deepened in Christ."
    },
    {
      "pk": 12002021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 21,
      "text": "Then he went to the spring of water and threw the salt in it and said, 'Thus says the LORD, I have healed this water; from now on neither death nor unfruitfulness shall come from it.'",
      "links": "<a href='/AIV/04/19/1-13'>Num. 19:1-13</a>",
      "comment": "The healing of the waters shows how God uses physical elements as instruments of grace, prefiguring later sacraments as visible means of invisible grace."
    },
    {
      "pk": 12002022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 22,
      "text": "So the water has been healed to this day, according to the word that Elisha spoke.",
      "links": "<a href='/AIV/02/15/25'>Ex. 15:25</a>; <a href='/AIV/06/06/26'>Josh. 6:26</a>",
      "comment": "The lasting effect of Elisha's word underlines the enduring power of God’s blessing when delivered through his appointed servants."
    },
    {
      "pk": 12002023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 23,
      "text": "From there he went up to Bethel. And as he was going up on the way, some small boys came out of the city and mocked him, saying, ‘Go up, you baldhead! Go up, you baldhead!’",
      "links": "<a href='/AIV/03/24/15-16'>Lev. 24:15-16</a>",
      "comment": "The disrespect shown to God’s prophet is met with swift judgment, illustrating the seriousness of dishonor toward God’s representatives. Such episodes warn that God protects his messengers and their authority."
    },
    {
      "pk": 12002024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 24,
      "text": "And he turned around, and when he saw them, he cursed them in the name of the LORD. Then two female bears came out of the forest and tore forty-two of the boys.",
      "links": "<a href='/AIV/03/26/21-22'>Lev. 26:21-22</a>",
      "comment": "Judgment on irreverence toward God’s ordained leaders reaffirms the sacredness of their office. This account cautions against disregarding divinely appointed spiritual authority."
    },
    {
      "pk": 12002025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 2,
      "verse": 25,
      "text": "From there he went on to Mount Carmel, and from there he returned to Samaria.",
      "links": "<a href='/AIV/11/18/19-20'>1 Kgs. 18:19-20</a>",
      "comment": "Mount Carmel, the site of Elijah’s triumph, is visited again by Elisha, showing the continuity of God’s mission through his appointed prophets. Samaria is both a mission field and a place of testing, underlining the ongoing call to faithfulness."
    }
  ],
  "translatedAt": "2025-12-24T03:43:18.377Z"
}