{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 15,
  "verses": [
    {
      "pk": 12015001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 1,
      "text": "In the twenty-seventh year of Jeroboam king of Israel, Azariah son of Amaziah, king of Judah, began to reign.",
      "links": "<a href='/AIV/14/26/1'>2 Chr. 26:1</a>",
      "comment": "Azariah is also known as Uzziah. This overlapping timeline with Jeroboam shows the divided nature of God's people at this time."
    },
    {
      "pk": 12015002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 2,
      "text": "He was sixteen years old when he became king, and he reigned fifty-two years in Jerusalem. His mother's name was Jecoliah of Jerusalem.",
      "links": "<a href='/AIV/13/3/12'>1 Chr. 3:12</a>; <a href='/AIV/14/26/3'>2 Chr. 26:3</a>",
      "comment": "Azariah’s long reign brought stability. The mention of his mother highlights the importance of maternal influence in the Davidic line."
    },
    {
      "pk": 12015003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 3,
      "text": "He did what was right in the eyes of the LORD, just as his father Amaziah had done.",
      "links": "<a href='/AIV/12/14/3'>2 Kgs. 14:3</a>",
      "comment": "Righteousness is measured by obedience to God. Despite failings, the seed of faithfulness continues in David’s house (cf. <a href='/AIV/10/7/16'>2 Sam. 7:16</a>)."
    },
    {
      "pk": 12015004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 4,
      "text": "However, the high places were not taken away; the people still sacrificed and burned incense on the high places.",
      "links": "<a href='/AIV/12/12/3'>2 Kgs. 12:3</a>; <a href='/AIV/12/14/4'>2 Kgs. 14:4</a>",
      "comment": "Worship away from the central temple was not fully reformed, showing the persistence of independent religious practices. Full unity of worship is an important biblical ideal."
    },
    {
      "pk": 12015005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 5,
      "text": "The LORD struck the king, and he became a leper until the day of his death. He lived in a separate house. Jotham the king's son had charge of the palace, judging the people of the land.",
      "links": "<a href='/AIV/14/26/19-21'>2 Chr. 26:19–21</a>; <a href='/AIV/3/13/46'>Lev. 13:46</a>",
      "comment": "God’s punishment reflects the seriousness of holiness, especially for a king. Lepers were excluded from community, emphasizing the need for purity in God’s presence."
    },
    {
      "pk": 12015006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 6,
      "text": "Now the rest of the acts of Azariah, and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/26/1-23'>2 Chr. 26:1–23</a>",
      "comment": "The biblical record refers to other historical accounts. The full story is elsewhere, showing the concise theological focus here."
    },
    {
      "pk": 12015007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 7,
      "text": "And Azariah slept with his fathers, and they buried him with his ancestors in the city of David. Jotham his son became king in his place.",
      "links": "<a href='/AIV/12/14/21'>2 Kgs. 14:21</a>; <a href='/AIV/14/27/1-2'>2 Chr. 27:1-2</a>",
      "comment": "The dynastic succession maintains the messianic hope tied to David’s line. See also <a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>."
    },
    {
      "pk": 12015008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 8,
      "text": "In the thirty-eighth year of Azariah king of Judah, Zechariah the son of Jeroboam became king over Israel in Samaria, and he reigned six months.",
      "links": "<a href='/AIV/12/14/29'>2 Kgs. 14:29</a>",
      "comment": "A short reign, reflecting instability in the northern kingdom and the consequences of departing from Davidic faithfulness."
    },
    {
      "pk": 12015009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 9,
      "text": "He did what was evil in the sight of the LORD, as his ancestors had done; he did not depart from the sins of Jeroboam the son of Nebat, which he made Israel to sin.",
      "links": "<a href='/AIV/12/3/3'>2 Kgs. 3:3</a>",
      "comment": "Idolatry and false worship continued to plague Israel. See <a href='/AIV/11/12/28-30'>1 Kgs. 12:28–30</a> for Jeroboam's apostasy."
    },
    {
      "pk": 12015010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 10,
      "text": "Shallum the son of Jabesh conspired against him and struck him down before the people and killed him, and reigned in his place.",
      "links": "<a href='/AIV/12/15/13'>2 Kgs. 15:13</a>",
      "comment": "The cycle of violence in Israel contrasts with the lasting promises to Judah through the faithfulness of the Davidic line."
    },
    {
      "pk": 12015011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 11,
      "text": "Now the rest of the acts of Zechariah, behold, they are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "",
      "comment": "The author again references external records, underscoring a pattern common to the annals of the kings."
    },
    {
      "pk": 12015012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 12,
      "text": "This was the word of the LORD that he spoke to Jehu: 'Your sons to the fourth generation shall sit on the throne of Israel.' And so it happened.",
      "links": "<a href='/AIV/12/10/30'>2 Kgs. 10:30</a>",
      "comment": "God’s word is fulfilled exactly, even when involving judgment. Compare prophetic fulfillment elsewhere: <a href='/AIV/6/21/45'>Josh. 21:45</a>."
    },
    {
      "pk": 12015013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 13,
      "text": "Shallum the son of Jabesh began to reign in the thirty-ninth year of Uzziah king of Judah, and he reigned one month in Samaria.",
      "links": "<a href='/AIV/14/26/1'>2 Chr. 26:1</a>",
      "comment": "An extremely short reign, showing instability and God’s judgment on the northern kingdom for their unfaithfulness."
    },
    {
      "pk": 12015014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 14,
      "text": "Menahem the son of Gadi went up from Tirzah and came to Samaria, and he struck down Shallum the son of Jabesh in Samaria and killed him and became king in his place.",
      "links": "",
      "comment": "Violent usurpation was a tragic theme in the northern kingdom's history, a reminder of the misery brought by forsaking God’s covenant."
    },
    {
      "pk": 12015015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 15,
      "text": "Now the rest of the acts of Shallum, and the conspiracy that he made, behold, they are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "",
      "comment": "Again, further details are found in other records—an acknowledgment of the complex political history of the time."
    },
    {
      "pk": 12015016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 16,
      "text": "Then Menahem struck Tiphsah and all who were in it, and its territory from Tirzah on, because they did not open to him. He sacked the city and ripped open all the pregnant women.",
      "links": "<a href='/AIV/11/4/24'>1 Kgs. 4:24</a>",
      "comment": "The destruction is shocking and highlights the brutality of men when removed from God’s law and moral order."
    },
    {
      "pk": 12015017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 17,
      "text": "In the thirty-ninth year of Azariah king of Judah, Menahem son of Gadi began to reign over Israel, and he reigned ten years in Samaria.",
      "links": "",
      "comment": "Menahem had a longer reign, but would prove himself no better in terms of godliness or justice."
    },
    {
      "pk": 12015018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 18,
      "text": "He did what was evil in the sight of the LORD. All his days he did not depart from the sins of Jeroboam son of Nebat, which he made Israel to sin.",
      "links": "<a href='/AIV/12/13/2'>2 Kgs. 13:2</a>",
      "comment": "Here again, we see persistent deviation from true worship. True worship must be united and pure, pointing ahead to Christ’s fulfillment of all worship."
    },
    {
      "pk": 12015019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 19,
      "text": "Pul the king of Assyria came against the land. Menahem gave Pul a thousand talents of silver, so that he might support him to secure the kingdom.",
      "links": "<a href='/AIV/13/5/26'>1 Chr. 5:26</a>",
      "comment": "The invasion by Assyria marks a turning point in Israel’s history, afflicting God’s people due to their unfaithfulness."
    },
    {
      "pk": 12015020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 20,
      "text": "Menahem exacted the silver from Israel, even from all the wealthy men, fifty shekels of silver from each man, to give to the king of Assyria. So the king of Assyria turned back and did not stay there in the land.",
      "links": "",
      "comment": "Heavy tribute was a sign of subjugation. God's people compromised their freedom when they followed false worship."
    },
    {
      "pk": 12015021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 21,
      "text": "Now the rest of the acts of Menahem, and all that he did, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "",
      "comment": "The chronicler’s summation again refers us to broader historical records for more."
    },
    {
      "pk": 12015022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 22,
      "text": "Menahem slept with his fathers, and Pekahiah his son reigned in his place.",
      "links": "",
      "comment": "Despite unfaithfulness, dynastic succession continued temporarily in the north, but without the security of a divine promise."
    },
    {
      "pk": 12015023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 23,
      "text": "In the fiftieth year of Azariah king of Judah, Pekahiah son of Menahem began to reign over Israel in Samaria, and he reigned two years.",
      "links": "",
      "comment": "The rapid turnover of kings is a further sign of instability and the consequences of rebellion from God’s law."
    },
    {
      "pk": 12015024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 24,
      "text": "He did what was evil in the eyes of the LORD. He did not turn away from the sins of Jeroboam son of Nebat, which he made Israel to sin.",
      "links": "<a href='/AIV/12/10/31'>2 Kgs. 10:31</a>",
      "comment": "Persistent false worship is noted generation after generation—a spiritual lesson of the consequence of abandoning the true faith."
    },
    {
      "pk": 12015025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 25,
      "text": "Pekah the son of Remaliah, his captain, conspired against him, attacked him in Samaria, in the citadel of the king's house, with Argob and Arieh, and with fifty men of the Gileadites, and killed him, and reigned in his place.",
      "links": "<a href='/AIV/12/15/27'>2 Kgs. 15:27</a>",
      "comment": "The continuing theme of violent coups shows the chaos that results from breaking God’s united order for his people."
    },
    {
      "pk": 12015026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 26,
      "text": "Now the rest of the acts of Pekahiah, and all that he did, behold, they are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "",
      "comment": "Repeated references to the chronicles underline the author’s desire to focus on theological evaluation over mere history."
    },
    {
      "pk": 12015027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 27,
      "text": "In the fifty-second year of Azariah king of Judah, Pekah the son of Remaliah began to reign over Israel in Samaria, and he reigned twenty years.",
      "links": "<a href='/AIV/12/15/32'>2 Kgs. 15:32</a>",
      "comment": "A relatively long reign amidst instability, but without covenant faithfulness or lasting heritage."
    },
    {
      "pk": 12015028,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 28,
      "text": "He did what was evil in the sight of the Lord. He did not turn away from the sins of Jeroboam son of Nebat, which he made Israel to sin.",
      "links": "<a href='/AIV/12/13/2'>2 Kgs. 13:2</a>",
      "comment": "A recurring spiritual diagnosis showing that, without faithfulness to true worship, even long reigns are ultimately fruitless."
    },
    {
      "pk": 12015029,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 29,
      "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, Galilee, all the land of Naphtali; and he took them captive to Assyria.",
      "links": "<a href='/AIV/13/5/26'>1 Chr. 5:26</a>; <a href='/AIV/23/9/1'>Isa. 9:1</a>",
      "comment": "Assyrian captivity fulfills warnings about exile for disobedience (<a href='/AIV/5/28/64'>Deut. 28:64</a>). Galilee would later be the land where Christ shines His light (<a href='/AIV/40/4/15-16'>Matt. 4:15-16</a>), connecting judgment, mercy, and redemption."
    },
    {
      "pk": 12015030,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 30,
      "text": "Then Hoshea son of Elah conspired against Pekah the son of Remaliah, struck him, killed him, and became king in his place in the twentieth year of Jotham the son of Uzziah.",
      "links": "<a href='/AIV/12/17/1'>2 Kgs. 17:1</a>",
      "comment": "Conspiracies and assassinations show the fruitlessness of a kingdom not under God's chosen leadership."
    },
    {
      "pk": 12015031,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 31,
      "text": "Now the rest of the acts of Pekah, and all that he did, behold, they are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "",
      "comment": "The refrain shows that what matters most in biblical theology is alignment with God’s covenant order, not mere political achievements."
    },
    {
      "pk": 12015032,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 32,
      "text": "In the second year of Pekah son of Remaliah, king of Israel, Jotham the son of Uzziah, king of Judah, began to reign.",
      "links": "",
      "comment": "Judah’s kingship remains more stable due to the promises given to David, a sign for future unity under the Messiah."
    },
    {
      "pk": 12015033,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 33,
      "text": "He was twenty-five years old when he became king, and reigned sixteen years in Jerusalem. His mother’s name was Jerusha the daughter of Zadok.",
      "links": "",
      "comment": "Mother's names in royal lineage signify the importance of spiritual heritage and honor within the faithful community."
    },
    {
      "pk": 12015034,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 34,
      "text": "He did what was right in the eyes of the LORD, according to all that his father Uzziah had done.",
      "links": "",
      "comment": "Jotham continues the tradition of faithfulness in Judah, setting the stage for hope that endures to the coming of the Messiah."
    },
    {
      "pk": 12015035,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 35,
      "text": "Nevertheless, the high places were not removed; the people still sacrificed and burned incense on the high places. He built the Upper Gate of the house of the LORD.",
      "links": "<a href='/AIV/14/27/3'>2 Chr. 27:3</a>",
      "comment": "Although Jotham did what was right, the centralization of worship was not perfectly enforced. Building at the temple points to true and visible worship centered at God's sanctuary, a foretaste of the perfect unity in Christ’s Church."
    },
    {
      "pk": 12015036,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 36,
      "text": "Now the rest of the acts of Jotham, and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "",
      "comment": "A historical closure to Jotham's reign; Judah's relative stability is highlighted in contrast to Israel."
    },
    {
      "pk": 12015037,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 37,
      "text": "In those days the LORD began to send Rezin king of Syria, and Pekah son of Remaliah, against Judah.",
      "links": "<a href='/AIV/23/7/1-2'>Isa. 7:1-2</a>",
      "comment": "Judah also faces external threats as discipline, but unlike Israel, retains hope because of God's promises to David's house and the coming Messiah."
    },
    {
      "pk": 12015038,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 15,
      "verse": 38,
      "text": "Jotham slept with his fathers and was buried with his fathers in the city of David his ancestor, and Ahaz his son reigned in his place.",
      "links": "<a href='/AIV/12/16/1'>2 Kgs. 16:1</a>",
      "comment": "The line of David continues unbroken, preparing the way for God’s promise to be fulfilled in the Messiah. Both the historical and spiritual succession has deep significance for understanding God's faithfulness (<a href='/AIV/40/1/1-17'>Matt. 1:1-17</a>)."
    }
  ],
  "translatedAt": "2025-12-24T03:56:32.298Z"
}