{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 13,
  "verses": [
    {
      "pk": 12013001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 1,
      "text": "In the twenty-third year of Joash son of Ahaziah, king of Judah, Jehoahaz son of Jehu became king over Israel in Samaria, and he reigned seventeen years.",
      "links": "<a href='/AIV/11/10/36'>1 Kings 10:36</a>; <a href='/AIV/12/10/32'>2 Kgs. 10:32</a>",
      "comment": "Chronological note introduces Jehoahaz's reign over the northern kingdom. The dual kingdoms highlight the division within God's people, foreshadowing the need for unity in faith."
    },
    {
      "pk": 12013002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 2,
      "text": "He did what was evil in the eyes of the LORD. He followed the sins of Jeroboam son of Nebat, which he caused Israel to commit, and did not turn away from them.",
      "links": "<a href='/AIV/11/12/28-33'>1 Kings 12:28-33</a>; <a href='/AIV/12/10/29'>2 Kgs. 10:29</a>",
      "comment": "Jehoahaz's unfaithfulness continues Israel's pattern of idolatry. The narrative repeatedly warns against departing from the true worship established by God."
    },
    {
      "pk": 12013003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 3,
      "text": "Then the anger of the LORD burned against Israel, and He handed them continually over to Hazael king of Aram, and to Ben-hadad son of Hazael.",
      "links": "<a href='/AIV/12/8/12'>2 Kgs. 8:12</a>; <a href='/AIV/23/9/11'>Isa. 9:11</a>",
      "comment": "Divine discipline permits foreign oppression, a sign of God's desire for His people to repent and return to Him. This mirrors a loving correction for the sake of restoration."
    },
    {
      "pk": 12013004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 4,
      "text": "Jehoahaz pleaded with the LORD, and the LORD listened to him, for He saw the oppression of Israel, how the king of Aram oppressed them.",
      "links": "<a href='/AIV/07/3/9-11'>Judges 3:9-11</a>; <a href='/AIV/19/106/44-45'>Ps. 106:44-45</a>",
      "comment": "Despite persistent sin, God hears true prayer and responds with mercy. The pattern of intercession points toward the power of mediation and the importance of seeking forgiveness."
    },
    {
      "pk": 12013005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 5,
      "text": "So the LORD gave Israel a savior, and they escaped from the power of Aram. And the Israelites lived in their homes as before.",
      "links": "<a href='/AIV/07/3/9'>Judges 3:9</a>; <a href='/AIV/12/14/27'>2 Kgs. 14:27</a>",
      "comment": "God repeatedly raises up deliverers for His people. Some interpret this 'savior' as a temporal leader, but ultimately such figures prefigure the perfect deliverance brought in Christ (see <a href='/AIV/42/2/11'>Luke 2:11</a>)."
    },
    {
      "pk": 12013006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 6,
      "text": "Yet they did not turn away from the sins of the house of Jeroboam, which he made Israel commit; they kept walking in them. Even the Asherah pole remained standing in Samaria.",
      "links": "<a href='/AIV/11/16/33'>1 Kings 16:33</a>; <a href='/AIV/12/17/9-12'>2 Kgs. 17:9-12</a>",
      "comment": "Persistent idolatry reveals the deep-rooted nature of sin. The continual presence of the Asherah pole (a symbol of false worship) shows the need for clear boundaries between true worship and compromise."
    },
    {
      "pk": 12013007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 7,
      "text": "Jehoahaz was left with only fifty horsemen, ten chariots, and ten thousand foot soldiers, for the king of Aram had destroyed them and made them like dust at threshing time.",
      "links": "<a href='/AIV/05/28/23-24'>Deut. 28:23-24</a>; <a href='/AIV/12/10/32'>2 Kgs. 10:32</a>",
      "comment": "The near annihilation fulfills covenant curses for disobedience (see Deuteronomy 28), showing the consequence of straying from God's commands."
    },
    {
      "pk": 12013008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 8,
      "text": "Now the rest of the acts of Jehoahaz, all that he did and his might, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/12/1/18'>2 Kgs. 1:18</a>; <a href='/AIV/13/9/1'>1 Chron. 9:1</a>",
      "comment": "A formulaic close to Jehoahaz's story, directing careful readers to further historical records, reflecting a tradition of maintaining both Scripture and sacred history."
    },
    {
      "pk": 12013009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 9,
      "text": "Jehoahaz rested with his fathers and was buried in Samaria. Then his son Joash became king in his place.",
      "links": "<a href='/AIV/12/10/35'>2 Kgs. 10:35</a>; <a href='/AIV/12/13/13'>2 Kgs. 13:13</a>",
      "comment": "Succession continues through dynastic lineage, signifying the importance of leadership continuity—an echo of apostolic succession in spiritual leadership."
    },
    {
      "pk": 12013010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 10,
      "text": "In the thirty-seventh year of Joash king of Judah, Jehoash son of Jehoahaz began to reign over Israel in Samaria, and he reigned sixteen years.",
      "links": "<a href='/AIV/12/13/9'>2 Kgs. 13:9</a>; <a href='/AIV/12/14/23'>2 Kgs. 14:23</a>",
      "comment": "Jehoash rises to lead a diminished Israel, signaling a turning point in the nation's history and God’s ongoing faithfulness despite unworthiness."
    },
    {
      "pk": 12013011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 11,
      "text": "He did what was evil in the eyes of the LORD. He did not turn away from all the sins of Jeroboam son of Nebat, which he made Israel commit; he continued in them.",
      "links": "<a href='/AIV/12/13/2'>2 Kgs. 13:2</a>; <a href='/AIV/11/16/19'>1 Kings 16:19</a>",
      "comment": "A lament for leaders who perpetuate sin rather than reform, inviting reflection on God's standards for leadership and the call to holiness."
    },
    {
      "pk": 12013012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 12,
      "text": "Now the rest of the acts of Joash—his deeds, and how he fought against Amaziah king of Judah—are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "<a href='/AIV/12/14/8-14'>2 Kgs. 14:8-14</a>; <a href='/AIV/13/20/1'>1 Chron. 20:1</a>",
      "comment": "Historical accounts supplement the biblical narrative, showing the fullness and richness of God’s work in history beyond the immediate details recorded here."
    },
    {
      "pk": 12013013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 13,
      "text": "Joash rested with his fathers, and Jeroboam sat on his throne. Joash was buried in Samaria with the kings of Israel.",
      "links": "<a href='/AIV/12/14/16'>2 Kgs. 14:16</a>; <a href='/AIV/12/13/9'>2 Kgs. 13:9</a>",
      "comment": "The seamless succession again points to the value of order and continuity in leadership among God’s people."
    },
    {
      "pk": 12013014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 14,
      "text": "Now Elisha was suffering from the illness from which he would die. King Joash of Israel came down to him, wept over him, and said, \"My father, my father! The chariots of Israel and their horsemen!\"",
      "links": "<a href='/AIV/12/2/12'>2 Kgs. 2:12</a>; <a href='/AIV/43/11/35'>John 11:35</a>",
      "comment": "Elisha is recognized as a spiritual father and true defender of Israel—more vital than military might—which foreshadows spiritual authority trumping earthly power."
    },
    {
      "pk": 12013015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 15,
      "text": "Elisha said to him, \"Take a bow and arrows.\" So Joash took a bow and arrows.",
      "links": "<a href='/AIV/19/18/34'>Ps. 18:34</a>; <a href='/AIV/19/144/1'>Ps. 144:1</a>",
      "comment": "The prophet instructs the king in a symbolic act, teaching that victory comes through obedience to God's Word delivered by His chosen servant."
    },
    {
      "pk": 12013016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 16,
      "text": "Then Elisha said to the king of Israel, \"Put your hand on the bow.\" And he put his hand on it. Elisha placed his hands on the king's hands.",
      "links": "<a href='/AIV/44/8/17'>Acts 8:17</a>; <a href='/AIV/12/4/34'>2 Kgs. 4:34</a>",
      "comment": "The laying on of hands symbolizes transmission of spiritual authority and blessing through prophetic mediation, paralleling traditions of spiritual impartation."
    },
    {
      "pk": 12013017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 17,
      "text": "He said, \"Open the east window.\" And he opened it. Then Elisha said, \"Shoot!\" And he shot. Elisha said, \"This is the LORD's arrow of victory, the arrow of victory over Aram! You shall strike the Arameans in Aphek until you have destroyed them.\"",
      "links": "<a href='/AIV/11/20/26'>1 Kings 20:26</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Elisha prophesies victory, but only through obedient action completed by the power of God, not by human strength. Prophetic directions reveal God's will."
    },
    {
      "pk": 12013018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 18,
      "text": "Then he said, \"Take the arrows.\" And he took them. Elisha said to the king of Israel, \"Strike the ground.\" He struck it three times and stopped.",
      "links": "<a href='/AIV/07/6/21'>Judges 6:21</a>",
      "comment": "A symbolic act measuring the extent of faith and zeal. The number of strikes would determine the measure of victory—active cooperation with God brings greater fruit."
    },
    {
      "pk": 12013019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 19,
      "text": "The man of God was angry with him and said, \"You should have struck five or six times! Then you would have struck Aram until you had wiped it out. But now you will strike Aram only three times.\"",
      "links": "<a href='/AIV/12/5/11-12'>2 Kgs. 5:11-12</a>",
      "comment": "A lesson in spiritual zeal. Limited fervor limits victory—a reminder that wholehearted response to God yields greater spiritual fruit."
    },
    {
      "pk": 12013020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 20,
      "text": "Elisha died and was buried. Now bands of Moabite raiders would invade the land every spring.",
      "links": "<a href='/AIV/12/2/12'>2 Kgs. 2:12</a>; <a href='/AIV/19/116/15'>Ps. 116:15</a>",
      "comment": "The death of the prophet brings further instability. However, this scene sets the stage for a remarkable posthumous miracle, illustrating enduring spiritual authority."
    },
    {
      "pk": 12013021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 21,
      "text": "As people were burying a man, suddenly they saw a raiding party, so they threw the man's body into Elisha's tomb. When the man touched Elisha's bones, he came to life and stood up on his feet.",
      "links": "<a href='/AIV/40/27/52-53'>Matt. 27:52-53</a>; <a href='/AIV/44/19/11-12'>Acts 19:11-12</a>",
      "comment": "Elisha's bones impart life—echoing the miraculous power associated with physical remains of holy people (see <a href='/AIV/44/19/11-12'>Acts 19:11-12</a>), and foreshadowing resurrection. This scene magnifies belief in the continuing effect of God's Spirit through His saints, with a hint that the sacred can operate through tangible means even after death."
    },
    {
      "pk": 12013022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 22,
      "text": "Hazael king of Aram had oppressed Israel all the days of Jehoahaz.",
      "links": "<a href='/AIV/12/8/12-13'>2 Kgs. 8:12-13</a>; <a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "Persistent foreign oppression is a sign of covenant discipline, inviting repentance and return to obedience."
    },
    {
      "pk": 12013023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 23,
      "text": "But the LORD was gracious to them, had compassion on them, and turned toward them because of His covenant with Abraham, Isaac, and Jacob, and would not destroy them or cast them from His presence to this time.",
      "links": "<a href='/AIV/01/26/24'>Gen. 26:24</a>; <a href='/AIV/03/26/44-45'>Lev. 26:44-45</a>",
      "comment": "God's mercy is grounded in covenant faithfulness, not in human merit, prefiguring the enduring nature of grace for His people. This echoes Christ's ultimate fulfillment of the promise (see <a href='/AIV/48/3/16'>Gal. 3:16</a>)."
    },
    {
      "pk": 12013024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 24,
      "text": "Hazael king of Aram died, and his son Ben-hadad became king in his place.",
      "links": "<a href='/AIV/12/8/15'>2 Kgs. 8:15</a>; <a href='/AIV/12/13/3'>2 Kgs. 13:3</a>",
      "comment": "Political changes are seen as under God's sovereignty; human history moves forward, but God’s care for His people remains constant."
    },
    {
      "pk": 12013025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 13,
      "verse": 25,
      "text": "Then Jehoash son of Jehoahaz took back from Ben-hadad son of Hazael the towns that Hazael had captured from Jehoahaz, his father, in war. Jehoash defeated Ben-hadad three times and recovered the cities of Israel.",
      "links": "<a href='/AIV/12/13/17-19'>2 Kgs. 13:17-19</a>; <a href='/AIV/12/14/25'>2 Kgs. 14:25</a>",
      "comment": "God's promise through Elisha is fulfilled as Israel's fortunes are restored. This continues the pattern of redemption after discipline, which finds its complete fulfillment in Christ’s restoration of spiritual inheritance."
    }
  ],
  "translatedAt": "2025-12-24T03:55:21.471Z"
}