{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 10,
  "verses": [
    {
      "pk": 12010001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 1,
      "text": "Now Ahab had seventy sons in Samaria. Jehu wrote letters and sent them to Samaria, to the rulers of Jezreel, the elders, and to the guardians of Ahab’s sons, saying,",
      "links": "<a href='/AIV/11/21/24'>1 Kings 21:24</a>; <a href='/AIV/28/1/4'>Hosea 1:4</a>",
      "comment": "Jehu strategically addresses those responsible for Ahab’s family in Samaria, positioning himself as a divinely sanctioned instrument to end the dynasty, as foreshadowed in 1 Kings 21:21-24."
    },
    {
      "pk": 12010002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 2,
      "text": "\"Now, as soon as this letter reaches you, since your master’s sons are with you, and you have chariots and horses, fortified cities also, and weapons,",
      "links": "",
      "comment": "Jehu’s letter highlights the guardians’ resources, subtly challenging their loyalty (see 2 Kings 9:6-10)."
    },
    {
      "pk": 12010003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 3,
      "text": "select the best and most upright of your master’s sons and set him on his father’s throne, and fight for your master’s house.\"",
      "links": "<a href='/AIV/09/08/5'>1 Samuel 8:5</a>",
      "comment": "Jehu gives them a choice, but the threat is clear—he is forcing their hand in choosing submission or rebellion, paralleling earlier tests of loyalty to God's chosen leaders."
    },
    {
      "pk": 12010004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 4,
      "text": "But they were exceedingly afraid and said, “Look, two kings could not stand against him; how then can we stand?”",
      "links": "<a href='/AIV/12/09/24'>2 Kings 9:24</a>; <a href='/AIV/12/09/27'>2 Kings 9:27</a>",
      "comment": "The recent defeat of King Joram and King Ahaziah shows Jehu’s power is divinely supported (see preceding chapter)."
    },
    {
      "pk": 12010005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 5,
      "text": "So the one who was in charge of the palace, the one in charge of the city, the elders, and the guardians sent word to Jehu, saying, “We are your servants; we will do all you command us. We will not make anyone king; do what seems good to you.”",
      "links": "",
      "comment": "A fearful submission to Jehu reflects a recognition of God's judgment and providence over earthly rulers."
    },
    {
      "pk": 12010006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 6,
      "text": "Then he wrote a second letter to them, saying, “If you are on my side and you will obey me, bring the heads of your master’s sons to me at Jezreel by this time tomorrow.” Now the king’s sons, seventy in all, were with the prominent men of the city, who were raising them.",
      "links": "<a href='/AIV/07/08/6-17'>Judges 8:6-17</a>",
      "comment": "Such a demand for the heads of Ahab’s sons is grim, yet it fulfills the judgment prophesied against Ahab (1 Kings 21:21)."
    },
    {
      "pk": 12010007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 7,
      "text": "When the letter came to them, they took the king’s sons and killed seventy persons, and put their heads in baskets and sent them to him at Jezreel.",
      "links": "<a href='/AIV/11/21/21'>1 Kings 21:21</a>; <a href='/AIV/28/1/4'>Hosea 1:4</a>",
      "comment": "The prophecy against Ahab is literally fulfilled. The method, though brutal, shows the seriousness of divine judgment against sin and unfaithfulness."
    },
    {
      "pk": 12010008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 8,
      "text": "A messenger came and told Jehu, “They have brought the heads of the king’s sons.” He said, “Lay them in two heaps at the entrance of the gate until morning.”",
      "links": "",
      "comment": "Leaving the heads at the gate is a public sign of the regime change and the end of Ahab’s line, reflecting a clear divine intervention in history."
    },
    {
      "pk": 12010009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 9,
      "text": "In the morning he went out and stood, and said to all the people, “You are innocent. I conspired against my master and killed him, but who struck down all these?",
      "links": "",
      "comment": "Jehu distances the responsibility for the mass killing from himself, highlighting the role of the people in fulfilling God's justice."
    },
    {
      "pk": 12010010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 10,
      "text": "Know then that nothing of the word of the LORD, which the LORD spoke against the house of Ahab, will fall to the ground, for the LORD has done what he spoke by his servant Elijah.”",
      "links": "<a href='/AIV/11/21/19-24'>1 Kings 21:19-24</a>; <a href='/AIV/11/21/29'>1 Kings 21:29</a>",
      "comment": "Emphasizes the total reliability of God's word through the prophets. Christ, the true prophet, also fulfills all prophecy (<a href='/AIV/40/05/17'>Matthew 5:17</a>)."
    },
    {
      "pk": 12010011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 11,
      "text": "So Jehu struck down all who remained of the house of Ahab in Jezreel, all his leading men, close friends, and priests, leaving him no survivor.",
      "links": "",
      "comment": "Total eradication of Ahab's supporters purifies Israel as a type of how the Messiah would cleanse God's people spiritually and establish a new order."
    },
    {
      "pk": 12010012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 12,
      "text": "Then Jehu set out and went on to Samaria. As he was at Beth Eked of the Shepherds on the way,",
      "links": "",
      "comment": "Beth Eked, a place for gathering flocks, marks a transition to Samaria, the next field for Jehu’s purge."
    },
    {
      "pk": 12010013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 13,
      "text": "Jehu met relatives of Ahaziah king of Judah, and asked, “Who are you?” They answered, “We are relatives of Ahaziah, and we have come down to greet the royal family and the children of the queen mother.”",
      "links": "<a href='/AIV/14/22/8-9'>2 Chronicles 22:8-9</a>",
      "comment": "The mention of the 'queen mother' hints at the important role women played as matriarchs and influencers in the royal courts."
    },
    {
      "pk": 12010014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 14,
      "text": "He said, “Take them alive.” So they took them alive and slaughtered them at the well of Beth Eked, forty-two men. He left none of them.",
      "links": "",
      "comment": "The relatives are also judged for their association with Ahab’s family, demonstrating the seriousness of God’s call to holiness and separation from corruption."
    },
    {
      "pk": 12010015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 15,
      "text": "When he left there, he met Jehonadab son of Rechab, coming to meet him. Jehu greeted him and said, “Is your heart right, as my heart is with your heart?” Jehonadab answered, “Yes, it is.” “If so,” Jehu said, “give me your hand.” He gave him his hand, and Jehu helped him up into the chariot.",
      "links": "<a href='/AIV/24/35/6-10'>Jeremiah 35:6-10</a>",
      "comment": "Jehonadab, founder of the Rechabites, symbolized purity and devotion. Their alliance reflects a call to unity in upholding true worship—a theme echoing communion and apostolic succession."
    },
    {
      "pk": 12010016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 16,
      "text": "Jehu said, “Come with me, and see my zeal for the LORD.” So he had him ride in his chariot.",
      "links": "<a href='/AIV/04/25/11-13'>Numbers 25:11-13</a>",
      "comment": "Jehu’s zeal is reminiscent of Phinehas’ (Num 25:11-13), reflecting the importance of zeal for true worship and faithfulness to the Lord."
    },
    {
      "pk": 12010017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 17,
      "text": "When Jehu came to Samaria, he struck down all who remained to Ahab in Samaria, until he had destroyed him, according to the word of the LORD spoken to Elijah.",
      "links": "<a href='/AIV/11/21/21'>1 Kings 21:21</a>",
      "comment": "The complete destruction fulfills prophecy. Faithfulness to God's commands, by both Jehu and Elijah, prefigures Christ's perfect obedience."
    },
    {
      "pk": 12010018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 18,
      "text": "Then Jehu gathered all the people and said to them, “Ahab served Baal a little; Jehu will serve him much more.",
      "links": "",
      "comment": "This statement is a ruse, as is revealed by the following verses. Sometimes God uses unexpected tactics to accomplish His purposes while guarding the faithful from deception."
    },
    {
      "pk": 12010019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 19,
      "text": "Now, summon to me all the prophets of Baal, all his servants, and all his priests. Let none be missing, for I have a great sacrifice for Baal. Whoever is missing shall not live.” But Jehu was acting deceitfully, in order to destroy the servants of Baal.",
      "links": "<a href='/AIV/11/18/40'>1 Kings 18:40</a>",
      "comment": "Jehu's tactic recalls Elijah’s defeat of Baal's prophets, setting up a final purge. Elsewhere, both righteous judgment and mercy dwell together in God’s plan."
    },
    {
      "pk": 12010020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 20,
      "text": "Jehu said, “Call a solemn assembly for Baal.” So they proclaimed it.",
      "links": "",
      "comment": "A deceiving proclamation—by gathering all Baal worshipers together, Jehu sets the stage for their destruction."
    },
    {
      "pk": 12010021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 21,
      "text": "Jehu sent throughout all Israel, and all the servants of Baal came, so that there was not a man left who did not come. They entered the house of Baal, and the house of Baal was filled from one end to the other.",
      "links": "",
      "comment": "All the false worshipers were gathered together, symbolizing a total rejection of idol worship in Israel through a dramatic public action."
    },
    {
      "pk": 12010022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 22,
      "text": "He said to the one in charge of the wardrobe, “Bring out garments for all the servants of Baal.” So he brought out garments for them.",
      "links": "",
      "comment": "The giving of special garments identifies the Baal worshipers, further ensuring none escape—echoing the separation of the righteous and wicked at final judgment (<a href='/AIV/40/13/24-30'>Matthew 13:24-30</a>)."
    },
    {
      "pk": 12010023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 23,
      "text": "Then Jehu went into the house of Baal with Jehonadab son of Rechab and said to the servants of Baal, “Search and see that none of the servants of the LORD are here with you, but only the servants of Baal.”",
      "links": "",
      "comment": "Jehu’s careful separation of true worshipers from idolaters prefigures the spiritual reality of God’s people being set apart."
    },
    {
      "pk": 12010024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 24,
      "text": "Then they went in to offer sacrifices and burnt offerings. Now Jehu had stationed eighty men outside and said, “If any of the men whom I deliver into your hands escapes, it will be life for life.”",
      "links": "",
      "comment": "The command for 'life for life' (see Exodus 21:23) reinforces the seriousness of divine justice."
    },
    {
      "pk": 12010025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 25,
      "text": "As soon as he had finished making the burnt offering, Jehu said to the guards and officers, “Go in and strike them down; let no one escape.” So they struck them down with the sword, and the guards and officers threw their bodies out and went into the inner sanctuary of the house of Baal.",
      "links": "",
      "comment": "The destruction of Baal’s worshipers and their sanctuary foreshadows God's ultimate victory over idolatry and evil."
    },
    {
      "pk": 12010026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 26,
      "text": "They brought out the sacred pillar of the house of Baal and burned it.",
      "links": "<a href='/AIV/05/07/5'>Deuteronomy 7:5</a>",
      "comment": "Burning the idol fulfills the commandment to destroy idols utterly (Deut 7:5), aligning Jehu’s actions with Mosaic law."
    },
    {
      "pk": 12010027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 27,
      "text": "They tore down the house of Baal, and made it a latrine, which it is to this day.",
      "links": "<a href='/AIV/13/14/3-4'>2 Chronicles 14:3-4</a>",
      "comment": "Turning the temple into a latrine shows the utter contempt for idolatry and sets a precedent for the sacred being set apart from the profane."
    },
    {
      "pk": 12010028,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 28,
      "text": "Thus Jehu eliminated Baal from Israel.",
      "links": "",
      "comment": "Jehu completes the work of reform by rooting out idolatry, which points forward to Christ’s perfect cleansing of His people from sin."
    },
    {
      "pk": 12010029,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 29,
      "text": "But Jehu did not turn away from the sins of Jeroboam son of Nebat, who made Israel to sin—that is, the golden calves that were in Bethel and Dan.",
      "links": "<a href='/AIV/11/12/28'>1 Kings 12:28</a>; <a href='/AIV/14/13/8'>2 Chronicles 13:8</a>",
      "comment": "Despite his zeal, Jehu preserves the alternative worship centers. Complete obedience is necessary for true reformation—a principle seen also in apostolic teaching."
    },
    {
      "pk": 12010030,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 30,
      "text": "And the LORD said to Jehu, “Because you have done well in carrying out what is right in my eyes and have done to the house of Ahab all that was in my heart, your sons shall sit on the throne of Israel to the fourth generation.”",
      "links": "<a href='/AIV/11/21/29'>1 Kings 21:29</a>",
      "comment": "Jehu is rewarded for partial fidelity, but his house does not continue forever. The true everlasting kingdom would only be established by the Divine King—Christ (see <a href='/AIV/42/01/32-33'>Luke 1:32-33</a>)."
    },
    {
      "pk": 12010031,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 31,
      "text": "But Jehu did not carefully follow the law of the LORD, the God of Israel, with all his heart. He did not turn away from the sins of Jeroboam, which he made Israel to commit.",
      "links": "",
      "comment": "Jehu's partial obedience demonstrates the danger of selective faithfulness—God desires that His people, and their leaders, fully embrace His law and worship."
    },
    {
      "pk": 12010032,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 32,
      "text": "In those days, the LORD began to reduce the size of Israel. Hazael conquered them throughout the territory of Israel:",
      "links": "<a href='/AIV/12/08/12'>2 Kings 8:12</a>",
      "comment": "Disobedience brings decline, showing that faithfulness, not merely outward reform, is necessary for God’s blessings to remain."
    },
    {
      "pk": 12010033,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 33,
      "text": "from the Jordan eastward, all the land of Gilead—the Gadites, the Reubenites, and the Manassites—from Aroer by the Arnon Valley, even Gilead and Bashan.",
      "links": "",
      "comment": "God’s chastisement occurs across the Transjordan, affecting key tribes and demonstrating that divine justice is impartial and far-reaching."
    },
    {
      "pk": 12010034,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 34,
      "text": "Now the rest of the acts of Jehu, all that he did, and all his mighty deeds, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "",
      "comment": "The common formula refers to other historical records, indicating a broader historical context for these events."
    },
    {
      "pk": 12010035,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 35,
      "text": "So Jehu slept with his fathers, and they buried him in Samaria. Jehoahaz his son became king in his place.",
      "links": "<a href='/AIV/12/13/1'>2 Kings 13:1</a>",
      "comment": "Jehu’s death ends a turbulent reformer's life. Notice how the royal line continues—an important motif for later messianic fulfillment."
    },
    {
      "pk": 12010036,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 10,
      "verse": 36,
      "text": "The time that Jehu reigned over Israel in Samaria was twenty-eight years.",
      "links": "",
      "comment": "A long reign is a temporal reward for Jehu’s actions, yet ultimate blessing is reserved for those who, through full-hearted fidelity, belong to the new and everlasting covenant established by the Messiah."
    }
  ],
  "translatedAt": "2025-12-24T03:53:53.332Z"
}