{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 11,
  "verses": [
    {
      "pk": 12011001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 1,
      "text": "When Athaliah, the mother of Ahaziah, saw that her son was dead, she rose up and destroyed all the royal family.",
      "links": "<a href='/AIV/14/22/10'>2 Chron. 22:10</a>; <a href='/AIV/11/21/3'>1 Kgs. 21:3</a>",
      "comment": "Athaliah's violent usurpation is a reminder of the Old Testament theme of surviving remnant. The lineage is threatened, but God preserves His promises through hidden means."
    },
    {
      "pk": 12011002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 2,
      "text": "But Jehosheba, daughter of King Joram, sister of Ahaziah, took Joash, son of Ahaziah, and stole him away from among the king's sons who were being killed. She put him and his nurse in a bedroom. Jehosheba hid him from Athaliah, so that he was not killed.",
      "links": "<a href='/AIV/14/22/11'>2 Chron. 22:11</a>",
      "comment": "The preservation of Joash, the rightful heir, recalls God's protection of the messianic line, hinting toward God's providence seen in Christ's protection as a child (see Matt. 2:13). Spiritual meaning: God's chosen ones are often hidden and protected in times of crisis."
    },
    {
      "pk": 12011003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 3,
      "text": "He was hidden with her in the house of the LORD for six years, while Athaliah reigned over the land.",
      "links": "<a href='/AIV/14/22/12'>2 Chron. 22:12</a>",
      "comment": "Joash grew up in the sanctuary, foreshadowing the importance of the temple and priesthood as places of refuge and instruction. This shows a continuity of God's saving work through sacred institutions."
    },
    {
      "pk": 12011004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 4,
      "text": "In the seventh year Jehoiada sent and summoned the captains of the hundreds, the Carites and the guards, and brought them into the house of the LORD. He made a covenant with them, took an oath from them in the house of the LORD, and showed them the king's son.",
      "links": "<a href='/AIV/14/23/1'>2 Chron. 23:1</a>",
      "comment": "Jehoiada, serving as high priest, orchestrates the revelation and restoration of the true king. The use of covenant language in the temple reveals the importance of sacred promises and hierarchy in God's plan."
    },
    {
      "pk": 12011005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 5,
      "text": "He commanded them, saying, 'This is what you shall do: One third of you, who come on duty on the Sabbath, shall guard the king's house;",
      "links": "<a href='/AIV/14/23/2'>2 Chron. 23:2</a>",
      "comment": "The division of the guards emphasizes ordered service and the protection of anointed leaders within the temple setting. The Sabbath reference links this action to sacred time and liturgical order."
    },
    {
      "pk": 12011006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 6,
      "text": "Another third shall be at the gate Sur, and another third at the gate behind the guards. You shall guard the palace as a barrier.",
      "links": "",
      "comment": "Clear assignment of duties reflects God’s order in worship and governance. The mention of gates links the city and temple as places of judgment and protection."
    },
    {
      "pk": 12011007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 7,
      "text": "The two divisions of you, all who go out on the Sabbath, shall guard the house of the LORD for the king.",
      "links": "",
      "comment": "The king is protected within the holy setting, reinforcing the unity between monarchy and temple leadership. This partnership models Christ as both king and priest."
    },
    {
      "pk": 12011008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 8,
      "text": "You shall surround the king, every man with his weapons in his hand. Whoever comes within the ranks must be put to death. Stay with the king during his coming in and going out.",
      "links": "",
      "comment": "Such strict protection shows the seriousness of defending God's anointed. Christologically, loyalty to the true king, even risking life, is a precursor to Christian devotion."
    },
    {
      "pk": 12011009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 9,
      "text": "The captains of the hundreds did as Jehoiada the priest commanded. Each took his men, those who came on duty on the Sabbath, with those going off duty, and came to Jehoiada the priest.",
      "links": "<a href='/AIV/14/23/8'>2 Chron. 23:8</a>",
      "comment": "Obedience to priestly authority presents a model for Christian service, hinting at the role hierarchy plays in the life of faith."
    },
    {
      "pk": 12011010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 10,
      "text": "Jehoiada the priest gave the captains spears and shields that had belonged to King David, which were in the house of the LORD.",
      "links": "",
      "comment": "The use of David’s weapons links Joash’s restoration to the Davidic covenant. The transmission of sacred objects symbolizes the continuity of God’s promises through generations (see 2 Sam. 7:16)."
    },
    {
      "pk": 12011011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 11,
      "text": "The guards stood with their weapons in hand, all around the king, from the south side to the north side of the temple, by the altar and the house, protecting the king.",
      "links": "",
      "comment": "Guarding the king at the altar connects kingly and priestly functions, hinting at future fulfillment in Christ, who is both priest and king."
    },
    {
      "pk": 12011012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 12,
      "text": "Jehoiada brought out the king’s son, put the crown on him, and gave him the testimony. They made him king and anointed him. They clapped their hands and said, 'Long live the king!'",
      "links": "<a href='/AIV/14/23/11'>2 Chron. 23:11</a>; <a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "The anointing of Joash echoes prophetic anointing and investiture—prefiguring Christ’s kingship and His reception of authority through both lineage and divine appointment."
    },
    {
      "pk": 12011013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 13,
      "text": "When Athaliah heard the sound of the guards and the people, she came to the people at the house of the LORD.",
      "links": "",
      "comment": "Athaliah's intrusion into the temple is a moment of crisis, setting up a confrontation between unlawful usurpation and God’s ordained sovereignty."
    },
    {
      "pk": 12011014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 14,
      "text": "She looked, and there was the king standing by the pillar, as was the tradition. The officials, the trumpeters, and all the people of the land were rejoicing and blowing trumpets. Athaliah tore her clothes and cried, 'Treason! Treason!'",
      "links": "<a href='/AIV/11/1/9'>1 Kgs. 1:9</a>",
      "comment": "Joash is enthroned with ritual dignity, symbolizing legitimate, liturgical celebration of true kingship—the king is revealed before altar and people, reminiscent of Christ’s rightful enthronement."
    },
    {
      "pk": 12011015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 15,
      "text": "Jehoiada the priest commanded the captains in charge of the army, 'Bring her out between the ranks, and whoever follows her is to be put to death with the sword.' For the priest had said, 'She must not be killed in the house of the LORD.'",
      "links": "",
      "comment": "Religious leaders uphold the sanctity of the temple, and order justice to be served outside, setting boundaries for sacred spaces and reverence for holy ground."
    },
    {
      "pk": 12011016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 16,
      "text": "So they seized her, and she went through the Horse Gate of the king’s house, and there she was put to death.",
      "links": "<a href='/AIV/14/23/15'>2 Chron. 23:15</a>",
      "comment": "Retribution executed outside the temple maintains the holiness of the worship place. The Horse Gate’s mention recalls places of judgment."
    },
    {
      "pk": 12011017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 17,
      "text": "Then Jehoiada made a covenant between the LORD, the king, and the people, that they would be the LORD's people. He also made a covenant between the king and the people.",
      "links": "<a href='/AIV/14/23/16'>2 Chron. 23:16</a>; <a href='/AIV/02/19/5-6'>Exod. 19:5-6</a>",
      "comment": "Renewal of covenant emphasizes unity between God, the leaders, and the people. This has parallels to Jesus mediating the new covenant uniting all believers with God."
    },
    {
      "pk": 12011018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 18,
      "text": "All the people of the land went to the house of Baal and tore it down. They smashed its altars and images into pieces and killed Mattan, the priest of Baal, before the altars. Then Jehoiada appointed guards for the house of the LORD.",
      "links": "<a href='/AIV/11/18/40'>1 Kgs. 18:40</a>",
      "comment": "Idolatry is purged, and true worship restored under priestly authority. The restoration of right worship echoes God’s command to love Him alone, and the role of religious authorities in protecting orthodox faith."
    },
    {
      "pk": 12011019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 19,
      "text": "Jehoiada, the captains, the Carites, the guards, and all the people of the land brought the king down from the house of the LORD, and they entered the king’s house by way of the gate of the guards. The king sat on the throne of the kings.",
      "links": "",
      "comment": "Joash’s enthronement signals restoration of Davidic monarchy. The procession out of the temple into the king’s house is symbolic of the union between spiritual and secular leadership under God’s plan."
    },
    {
      "pk": 12011020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 20,
      "text": "All the people of the land rejoiced, and the city was quiet after Athaliah had been put to death by the sword at the king’s house.",
      "links": "",
      "comment": "Peace and rejoicing in the land follow restoration of the rightful ruler—prefiguring the greater peace and joy brought by Jesus, the true King and restorer."
    },
    {
      "pk": 12011021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 11,
      "verse": 21,
      "text": "Joash was seven years old when he became king.",
      "links": "<a href='/AIV/14/24/1'>2 Chron. 24:1</a>",
      "comment": "The youthful age of Joash stresses a divinely appointed order, where God's strength is made known in human weakness—an idea fulfilled supremely in Christ."
    }
  ],
  "translatedAt": "2025-12-24T03:54:15.577Z"
}