{
  "book": 12,
  "bookName": "2 Kings",
  "bookAbbreviation": "2Kgs",
  "chapter": 18,
  "verses": [
    {
      "pk": 12018001,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 1,
      "text": "In the third year of Hoshea son of Elah, king of Israel, Hezekiah son of Ahaz, king of Judah, began to reign.",
      "links": "<a href='/AIV/12/17/1'>2Kgs 17:1</a>; <a href='/AIV/14/29/1'>2Chr 29:1</a>",
      "comment": "Hezekiah's ascension marks a key point of renewal and reform in Judah. Notice the pattern of new beginnings in biblical history, often in parallel to moments of restoration like with Josiah (2Kgs 22:1)."
    },
    {
      "pk": 12018002,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 2,
      "text": "He was twenty-five years old when he began to reign, and he reigned twenty-nine years in Jerusalem. His mother’s name was Abijah, daughter of Zechariah.",
      "links": "<a href='/AIV/14/29/1'>2Chr 29:1</a>",
      "comment": "Hezekiah’s age and length of rule highlight stability in Judah. The maternal lineage, often noted in biblical records, emphasizes the importance of heritage. Compare to Jesus’ genealogy in Matthew 1—a focus on descent and fulfillment."
    },
    {
      "pk": 12018003,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 3,
      "text": "He did what was right in the eyes of the LORD, just as David his father had done.",
      "links": "<a href='/AIV/09/13/14'>1Sam 13:14</a>; <a href='/AIV/11/15/11'>1Kgs 15:11</a>; <a href='/AIV/19/78/72'>Ps 78:72</a>",
      "comment": "Hezekiah is compared to David, the ideal king—pointing to a recurring type of righteous leadership. Such typology is often fulfilled in Christ, the Son of David (Matt 1:1; Luke 1:32)."
    },
    {
      "pk": 12018004,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 4,
      "text": "He removed the high places, broke down the sacred pillars, cut down the Asherah, and shattered the bronze serpent that Moses had made; for until those days the people of Israel had burned incense to it. It was called Nehushtan.",
      "links": "<a href='/AIV/04/21/8-9'>Num 21:8–9</a>; <a href='/AIV/05/16/21-22'>Deut 16:21–22</a>",
      "comment": "Hezekiah’s zeal for purity aligns with God’s command to eliminate idolatry. The bronze serpent, originally a symbol of healing (Num 21), had become an object of misplaced worship—reminding Christians to focus on true worship rather than relics. Spiritually, the destruction of idols prefigures Christ’s purifying work (John 3:14)."
    },
    {
      "pk": 12018005,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 5,
      "text": "He trusted in the LORD, the God of Israel, so that after him there was none like him among all the kings of Judah, nor among those before him.",
      "links": "<a href='/AIV/19/37/3-5'>Ps 37:3–5</a>; <a href='/AIV/12/23/25'>2Kgs 23:25</a>",
      "comment": "Hezekiah’s faith sets him apart as an exemplary leader. Confidence in God alone echoes themes found throughout Psalms and is a precursor to the New Covenant—where trust in Christ is the foundation of salvation."
    },
    {
      "pk": 12018006,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 6,
      "text": "For he held fast to the LORD; he did not turn away from following Him, but kept the commandments which the LORD commanded Moses.",
      "links": "<a href='/AIV/05/6/17'>Deut 6:17</a>; <a href='/AIV/19/119/31'>Ps 119:31</a>",
      "comment": "Obedience and fidelity remain at the heart of biblical righteousness. Notice the continuity between Old Testament law and New Testament call to discipleship (John 14:15)."
    },
    {
      "pk": 12018007,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 7,
      "text": "And the LORD was with him; wherever he went, he prospered. He rebelled against the king of Assyria and did not serve him.",
      "links": "<a href='/AIV/09/18/14'>1Sam 18:14</a>; <a href='/AIV/14/32/7-8'>2Chr 32:7–8</a>",
      "comment": "Divine favor and success are linked with obedience. Hezekiah’s resistance to foreign domination foreshadows spiritual freedom found in the Messiah (John 8:36)."
    },
    {
      "pk": 12018008,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 8,
      "text": "He defeated the Philistines as far as Gaza and its territory, from watchtower to fortified city.",
      "links": "<a href='/AIV/07/13/3'>Judg 13:3</a>; <a href='/AIV/06/10/41'>Josh 10:41</a>",
      "comment": "Conquest over the Philistines echoes a restoration of past victories (see David in 1Sam 17). It points to the need for continual spiritual warfare against sin."
    },
    {
      "pk": 12018009,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 9,
      "text": "In the fourth year of King Hezekiah, which was the seventh year of Hoshea son of Elah, king of Israel, Shalmaneser king of Assyria came up against Samaria and besieged it.",
      "links": "<a href='/AIV/12/17/5'>2Kgs 17:5</a>",
      "comment": "Assyrian aggression sets the stage for Israel’s exile. The link between sin and judgment remains clear in biblical history (2Kgs 17:7-23)."
    },
    {
      "pk": 12018010,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 10,
      "text": "After three years they took it; Samaria was captured in the sixth year of Hezekiah, which was the ninth year of Hoshea king of Israel.",
      "links": "<a href='/AIV/12/17/6'>2Kgs 17:6</a>",
      "comment": "Samaria’s fall marks the end of the northern kingdom. Historical accuracy with synchronised dates underscores the reliability of the biblical record."
    },
    {
      "pk": 12018011,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 11,
      "text": "The king of Assyria deported Israel to Assyria, and settled them in Halah, and on the Habor, the river of Gozan, and in the cities of the Medes.",
      "links": "<a href='/AIV/12/17/6'>2Kgs 17:6</a>; <a href='/AIV/13/5/26'>1Chr 5:26</a>",
      "comment": "Exile for covenant violation prefigures the New Testament teaching on judgment for persistent sin and calls for faithfulness and repentance."
    },
    {
      "pk": 12018012,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 12,
      "text": "This happened because they did not obey the voice of the LORD their God, but transgressed His covenant—all that Moses the servant of the LORD had commanded. They would neither hear nor do them.",
      "links": "<a href='/AIV/05/28/15'>Deut 28:15</a>; <a href='/AIV/12/17/7-23'>2Kgs 17:7–23</a>",
      "comment": "Covenant faithfulness is central. Failure leads to exile—echoing the consequence of spiritual disobedience (Heb 3:7–19)."
    },
    {
      "pk": 12018013,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 13,
      "text": "In the fourteenth year of King Hezekiah, Sennacherib king of Assyria came up against all the fortified cities of Judah and captured them.",
      "links": "<a href='/AIV/14/32/1'>2Chr 32:1</a>; <a href='/AIV/23/36/1'>Isa 36:1</a>",
      "comment": "Sennacherib’s campaign illustrates a test of faith. The drama unfolds with an impending threat, foreshadowing trials faced by the Church throughout history."
    },
    {
      "pk": 12018014,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 14,
      "text": "Hezekiah king of Judah sent a message to the king of Assyria at Lachish, saying, 'I have done wrong; leave me, and whatever you impose I will bear.' So the king of Assyria required Hezekiah king of Judah to pay three hundred talents of silver and thirty talents of gold.",
      "links": "<a href='/AIV/23/36/2'>Isa 36:2</a>; <a href='/AIV/14/32/2'>2Chr 32:2</a>",
      "comment": "Hezekiah’s repentance and submission are striking. His humility is reminiscent of biblical calls to contrition and laying down pride (Ps 51:17; Matt 23:12)."
    },
    {
      "pk": 12018015,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 15,
      "text": "So Hezekiah gave him all the silver that was found in the LORD’s house and in the treasuries of the king’s palace.",
      "links": "<a href='/AIV/12/16/8'>2Kgs 16:8</a>; <a href='/AIV/14/32/3'>2Chr 32:3</a>",
      "comment": "The stripping of the temple’s treasury demonstrates the cost of sin and negotiating with earthly powers. It prefigures the sacrificial giving for restoration seen throughout salvation history."
    },
    {
      "pk": 12018016,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 16,
      "text": "At that time Hezekiah cut off the gold from the doors of the LORD’s temple, and from the doorposts which he himself had plated, and gave it to the king of Assyria.",
      "links": "<a href='/AIV/11/6/31'>1Kgs 6:31</a>; <a href='/AIV/14/29/3'>2Chr 29:3</a>",
      "comment": "Even the sacred is surrendered in crisis, illustrating both the gravity of Hezekiah’s predicament and how material loss contrasts with spiritual priorities (see Phil 3:8)."
    },
    {
      "pk": 12018017,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 17,
      "text": "Then the king of Assyria sent the Tartan, the Rab-saris, and the Rab-shakeh from Lachish with a strong force to King Hezekiah in Jerusalem. They came and stood by the aqueduct of the upper pool on the road to the Launderer’s Field.",
      "links": "<a href='/AIV/23/36/2'>Isa 36:2</a>",
      "comment": "The location referenced is near where Isaiah spoke to King Ahaz earlier (Isa 7:3), symbolising the prophetic intersection of faith and crisis."
    },
    {
      "pk": 12018018,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 18,
      "text": "They called for the king, and Eliakim son of Hilkiah, the palace administrator, Shebna the secretary, and Joah son of Asaph, the recorder, went out to them.",
      "links": "<a href='/AIV/23/36/3'>Isa 36:3</a>",
      "comment": "The representatives’ names surface later in key reforms and decisions, showing the importance of leadership in both political and religious spheres."
    },
    {
      "pk": 12018019,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 19,
      "text": "The Rab-shakeh said to them, 'Speak to Hezekiah, thus says the great king, the king of Assyria: “What is your basis of confidence?”'",
      "links": "<a href='/AIV/23/36/4'>Isa 36:4</a>",
      "comment": "Assyria’s rhetorical intimidation highlights the crucial theme of trusting in God rather than mere human strength (see Ps 20:7)."
    },
    {
      "pk": 12018020,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 20,
      "text": "You say, ‘But only words of lips—counsel and strength for war!’ On whom do you trust, that you rebel against me?",
      "links": "<a href='/AIV/23/36/5'>Isa 36:5</a>",
      "comment": "The challenge exposes the futility of earthly alliances if not grounded in the Lord. Compare Jesus’ teaching on building on rock vs. sand (Matthew 7:24-27)."
    },
    {
      "pk": 12018021,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 21,
      "text": "Now, are you trusting in Egypt, that broken reed, which will pierce the hand of anyone who leans on it? Such is Pharaoh king of Egypt to all who trust in him.",
      "links": "<a href='/AIV/23/36/6'>Isa 36:6</a>; <a href='/AIV/23/30/1-7'>Isa 30:1-7</a>",
      "comment": "False hope in Egypt underscores the pattern of failed worldly support. The imagery recalls spiritual danger of trusting anything other than God’s promise (see Jer 17:5)."
    },
    {
      "pk": 12018022,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 22,
      "text": "But if you say to me, ‘We trust in the LORD our God,’ is it not He whose high places and altars Hezekiah has removed, saying to Judah and Jerusalem, ‘You must worship before this altar in Jerusalem’?",
      "links": "<a href='/AIV/14/30/14'>2Chr 30:14</a>; <a href='/AIV/05/12/11-14'>Deut 12:11–14</a>",
      "comment": "The Rab-shakeh misunderstands true worship. God commanded centralised worship in Jerusalem. Spiritual unity in worship is a thread carried into apostolic teachings (see John 4:21-24; Acts 2:42)."
    },
    {
      "pk": 12018023,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 23,
      "text": "Now make a bargain with my master, the king of Assyria. I will give you two thousand horses, if you can put riders on them.",
      "links": "<a href='/AIV/23/36/8'>Isa 36:8</a>",
      "comment": "Assyria’s sarcasm underscores Judah’s helplessness and dependence on God alone. Salvation, in both literal and spiritual sense, is a gift—not earned by military power."
    },
    {
      "pk": 12018024,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 24,
      "text": "How then can you repulse even one officer of the least of my master’s servants, when you trust in Egypt for chariots and horsemen?",
      "links": "<a href='/AIV/23/31/1'>Isa 31:1</a>",
      "comment": "Again, the futility of human help is highlighted. This theme is developed in the Psalms (Ps 147:10–11), accentuating total reliance upon God."
    },
    {
      "pk": 12018025,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 25,
      "text": "Moreover, is it without the LORD that I have come up against this place to destroy it? The LORD said to me, ‘Go up against this land and destroy it.’",
      "links": "<a href='/AIV/12/24/2-3'>2Kgs 24:2-3</a>; <a href='/AIV/23/10/5-7'>Isa 10:5-7</a>",
      "comment": "Assyria claims divine mandate, misapplying the concept of God’s sovereignty. Note God's use of foreign nations as instruments of discipline (Isa 10:5–7), but sovereignty always works according to God’s greater justice."
    },
    {
      "pk": 12018026,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 26,
      "text": "Then Eliakim son of Hilkiah, Shebna, and Joah said to the Rab-shakeh, 'Please speak to your servants in Aramaic, for we understand it. Do not speak with us in the language of Judah within earshot of the people on the wall.'",
      "links": "<a href='/AIV/23/36/11'>Isa 36:11</a>",
      "comment": "They request privacy to prevent panic. Leadership’s concern for the people hints at the shepherd’s role, which Christ fulfills perfectly (John 10:11–15)."
    },
    {
      "pk": 12018027,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 27,
      "text": "But the Rab-shakeh replied, 'Has my master sent me only to your master and you, and not to those sitting on the wall—who, like you, will eat their own dung and drink their own urine with you?'",
      "links": "<a href='/AIV/23/36/12'>Isa 36:12</a>",
      "comment": "A brutal prophecy of siege conditions. Physical deprivation often parallels spiritual famine, reinforcing the necessity of spiritual nourishment through Word and sacrament."
    },
    {
      "pk": 12018028,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 28,
      "text": "Then the Rab-shakeh stood and called out in a loud voice in the language of Judah: 'Hear the word of the great king, the king of Assyria!'",
      "links": "<a href='/AIV/23/36/13'>Isa 36:13</a>",
      "comment": "Assyria’s propaganda attacks morale. The shift from secret conversation to public challenge recalls the battle for minds and hearts in every age—truth versus lies."
    },
    {
      "pk": 12018029,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 29,
      "text": "'Do not let Hezekiah deceive you; he cannot deliver you from my hand.'",
      "links": "<a href='/AIV/23/36/14-15'>Isa 36:14–15</a>",
      "comment": "A direct challenge to faith in leadership. This scenario prefigures temptations to doubt God’s appointed leaders, a warning echoed elsewhere (Num 16; John 21:15–17)."
    },
    {
      "pk": 12018030,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 30,
      "text": "'Do not let Hezekiah make you trust in the LORD, saying, “The LORD will surely deliver us, and this city will not be given into the hand of the king of Assyria.”'",
      "links": "<a href='/AIV/23/36/15'>Isa 36:15</a>",
      "comment": "The enemy’s challenge to trust in God recalls Satan’s temptation in the wilderness (Matt 4:1-11). Steadfast faith brings God’s deliverance."
    },
    {
      "pk": 12018031,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 31,
      "text": "'Do not listen to Hezekiah, for thus says the king of Assyria: “Make peace with me and come out to me. Then each of you will eat from his own vine and fig tree, and drink water from his own cistern,”'",
      "links": "<a href='/AIV/14/32/11'>2Chr 32:11</a>; <a href='/AIV/11/4/25'>1Kgs 4:25</a>",
      "comment": "Assyria offers false peace and security, echoing deceptive substitutes for God’s promises. The vine and fig tree motif connects with Messianic prophecies of safety (Mic 4:4; Zech 3:10)."
    },
    {
      "pk": 12018032,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 32,
      "text": "'until I come and take you away to a land like your own land, a land of grain and new wine, a land of bread and vineyards, olive trees and honey—so that you may live and not die. Do not listen to Hezekiah, for he misleads you by saying, “The LORD will deliver us.”'",
      "links": "<a href='/AIV/05/8/7-9'>Deut 8:7–9</a>",
      "comment": "Assyrian promises mimic both the language of promised land and satanic counterfeits. Only God grants true abundance and security—ultimately fulfilled in the Kingdom brought by Christ."
    },
    {
      "pk": 12018033,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 33,
      "text": "'Has any of the gods of the nations delivered his land from the hand of the king of Assyria?'",
      "links": "<a href='/AIV/19/115/3-8'>Ps 115:3–8</a>; <a href='/AIV/23/37/18-20'>Isa 37:18–20</a>",
      "comment": "This statement builds up for God’s vindication. He alone is true God. Contrasting the impotence of idols with God’s power is a recurring theme (see Exod 15:11)."
    },
    {
      "pk": 12018034,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 34,
      "text": "'Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim, Hena, and Ivvah? Have they delivered Samaria from my hand?'",
      "links": "<a href='/AIV/23/37/13'>Isa 37:13</a>; <a href='/AIV/12/17/31'>2Kgs 17:31</a>",
      "comment": "A listing of conquered people highlights worldly power. Yet the scene sets up a demonstration of supernatural intervention—a biblical pattern common in salvation history."
    },
    {
      "pk": 12018035,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 35,
      "text": "'Who among all the gods of the lands has rescued their land from my hand, that the LORD should rescue Jerusalem from my hand?'",
      "links": "<a href='/AIV/23/37/20'>Isa 37:20</a>; <a href='/AIV/19/135/5-18'>Ps 135:5–18</a>",
      "comment": "A climactic challenge going unanswered by false gods, pointing ahead to God’s dramatic deliverance; a type for Christ’s triumph over death and all evil."
    },
    {
      "pk": 12018036,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 36,
      "text": "But the people were silent and answered him not a word, for the king’s command was, 'Do not answer him.'",
      "links": "<a href='/AIV/23/36/21'>Isa 36:21</a>",
      "comment": "Obedience in silence shows discipline and unity, foreshadowing Christ’s silent endurance before accusers (Isa 53:7; Matt 27:12–14)."
    },
    {
      "pk": 12018037,
      "translation": "AIV",
      "book": 12,
      "bookName": "2 Kings",
      "bookAbbreviation": "2Kgs",
      "chapter": 18,
      "verse": 37,
      "text": "Then Eliakim son of Hilkiah, the palace administrator, Shebna the secretary, and Joah son of Asaph, the recorder, came to Hezekiah with their clothes torn, and reported to him the words of the Rab-shakeh.",
      "links": "<a href='/AIV/23/36/22'>Isa 36:22</a>; <a href='/AIV/01/37/29'>Gen 37:29</a>",
      "comment": "Rending of clothes is a sign of grief and humility, common throughout the Bible. Repentance, especially in leadership, often precedes divine intervention. This pattern foreshadows moments in Acts and Revelation when the saints overcome through faith, worship, and perseverance."
    }
  ],
  "translatedAt": "2025-12-24T03:58:22.822Z"
}