{
  "book": 8,
  "bookName": "Ruth",
  "bookAbbreviation": "Ruth",
  "chapter": 3,
  "verses": [
    {
      "pk": 8003001,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 1,
      "text": "Then Naomi, Ruth’s mother-in-law, said to her, 'My daughter, should I not seek a place of rest for you, so that it will go well with you?'",
      "links": "<a href='/AIV/8/1/9'>Ruth 1:9</a>",
      "comment": "Naomi expresses her duty and affection toward Ruth, wanting to secure her a husband and home. This mirrors the spiritual rest found in God's providence."
    },
    {
      "pk": 8003002,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 2,
      "text": "'And now, is not Boaz our relative, with whose maidens you were working? He is winnowing barley tonight at the threshing floor.'",
      "links": "<a href='/AIV/8/2/3'>Ruth 2:3</a>; <a href='/AIV/8/2/20'>Ruth 2:20</a>",
      "comment": "Naomi identifies Boaz as a kinsman-redeemer, a concept pointing toward Christ as the ultimate Redeemer (see Isaiah 59:20). The threshing floor scene links to the idea of judgment and sorting in Scripture."
    },
    {
      "pk": 8003003,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 3,
      "text": "'So wash yourself, anoint yourself, and put on your cloak. Then go down to the threshing floor. Do not make yourself known to the man until he has finished eating and drinking.'",
      "links": "<a href='/AIV/2/19/3'>Ex. 19:3-14</a>; <a href='/AIV/26/16/9'>Ezek. 16:9</a>",
      "comment": "The act of washing and anointing resembles ritual purity and preparation for meeting one set apart, pointing to sacraments and spiritual preparation in the faith (see James 4:8)."
    },
    {
      "pk": 8003004,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 4,
      "text": "'When he lies down, watch the place where he lies. Then go in, uncover his feet, and lie down; he will tell you what to do.'",
      "links": "<a href='/AIV/1/24/2'>Gen. 24:2-9</a>",
      "comment": "Uncovering Boaz's feet is a sign of submission and request for protection. This foreshadows how one humbly seeks mercy and covering from our Redeemer (see Psalm 91:1-2)."
    },
    {
      "pk": 8003005,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 5,
      "text": "Ruth replied to her, 'All that you say I will do.'",
      "links": "<a href='/AIV/1/22/2'>Gen. 22:2</a>; <a href='/AIV/42/1/38'>Luke 1:38</a>",
      "comment": "Ruth's obedience mirrors the submissive faith found throughout Scripture, particularly Mary's fiat (Luke 1:38), showing total trust in God's plan."
    },
    {
      "pk": 8003006,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 6,
      "text": "So she went down to the threshing floor and did everything that her mother-in-law had instructed her.",
      "links": "<a href='/AIV/8/3/5'>Ruth 3:5</a>",
      "comment": "Ruth’s actions display faithful obedience and trust, which is foundational for spiritual journey and relationship with God."
    },
    {
      "pk": 8003007,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 7,
      "text": "When Boaz had eaten and drunk and his heart was cheerful, he went to lie down at the end of the grain pile. Then Ruth came quietly, uncovered his feet, and lay down.",
      "links": "<a href='/AIV/8/3/4'>Ruth 3:4</a>",
      "comment": "Boaz's rest after feasting signifies peace and security. Ruth’s humble positioning is essential for understanding submission before God."
    },
    {
      "pk": 8003008,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 8,
      "text": "At midnight, the man was startled and turned over; and there was a woman lying at his feet.",
      "links": "<a href='/AIV/8/3/14'>Ruth 3:14</a>; <a href='/AIV/19/119/62'>Ps. 119:62</a>",
      "comment": "Boaz awakes in the night, a symbol often used for spiritual awakening or revelation in the Scriptures (Ps. 119:62)."
    },
    {
      "pk": 8003009,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 9,
      "text": "He said, 'Who are you?' And she answered, 'I am Ruth, your servant. Spread your cloak over your servant, for you are a redeemer.'",
      "links": "<a href='/AIV/8/2/10'>Ruth 2:10</a>; <a href='/AIV/26/16/8'>Ezek. 16:8</a>",
      "comment": "Ruth asks Boaz to spread his cloak over her, symbolizing protection and marriage—both literal and spiritual meanings tied to God's covering (cf. Ezekiel 16:8)."
    },
    {
      "pk": 8003010,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 10,
      "text": "Then he said, 'May you be blessed by the LORD, my daughter! You have shown even greater kindness at the end than at the beginning, because you have not gone after young men, whether rich or poor.'",
      "links": "<a href='/AIV/8/1/8'>Ruth 1:8</a>; <a href='/AIV/19/41/1'>Ps. 41:1</a>",
      "comment": "Boaz recognizes Ruth's selfless loyalty and virtue, which highlights the biblical ideal of sacrificial love."
    },
    {
      "pk": 8003011,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 11,
      "text": "'And now, my daughter, do not fear. I will do for you all that you ask, because everyone in my town knows that you are a woman of noble character.'",
      "links": "<a href='/AIV/20/31/10'>Prov. 31:10</a>",
      "comment": "Ruth is esteemed for her virtue, reminiscent of the 'woman of valor' praised in Proverbs 31."
    },
    {
      "pk": 8003012,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 12,
      "text": "'Yet, though it is true that I am a redeemer, there is a redeemer closer than I.'",
      "links": "<a href='/AIV/8/4/1'>Ruth 4:1</a>; <a href='/AIV/42/24/21'>Luke 24:21</a>",
      "comment": "Boaz notes the legal order for redemption, reflecting the law’s structure—significant in both Old and New Testament contexts."
    },
    {
      "pk": 8003013,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 13,
      "text": "'Stay here tonight, and in the morning, if he will redeem you, good; let him do it. But if he is not willing to redeem you, then, as the LORD lives, I will redeem you. Lie down until the morning.'",
      "links": "<a href='/AIV/8/4/4'>Ruth 4:4</a>; <a href='/AIV/1/28/15'>Gen. 28:15</a>",
      "comment": "Boaz’s oath echoes God’s covenant faithfulness. The principle of redemption here ultimately resembles Christ’s work as the true Redeemer, fulfilling both law and mercy."
    },
    {
      "pk": 8003014,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 14,
      "text": "So she lay at his feet until morning, but rose before one could recognize another. He said, 'Let it not be known that the woman came to the threshing floor.'",
      "links": "<a href='/AIV/8/3/8'>Ruth 3:8</a>",
      "comment": "Boaz protects Ruth’s reputation, displaying prudent, chaste care. This prefigures the dignity and confidentiality in proper spiritual relationships."
    },
    {
      "pk": 8003015,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 15,
      "text": "He also said, 'Bring the cloak you are wearing and hold it out.' So she held it and he measured out six measures of barley, and laid them on her. Then she went back into the city.",
      "links": "<a href='/AIV/8/2/17'>Ruth 2:17</a>",
      "comment": "Boaz’s generous gift signifies both material provision and the promise of future security, reminiscent of God’s providential blessings."
    },
    {
      "pk": 8003016,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 16,
      "text": "When Ruth came to her mother-in-law, she said, 'How did it go, my daughter?' Then Ruth told her all that the man had done for her.",
      "links": "<a href='/AIV/8/2/19'>Ruth 2:19</a>",
      "comment": "Ruth's sharing reflects transparency and relationship, a model of Christian community and spiritual family."
    },
    {
      "pk": 8003017,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 17,
      "text": "And she said, 'He gave me these six measures of barley, for he said, ‘Do not go back to your mother-in-law empty-handed.’'",
      "links": "<a href='/AIV/8/1/21'>Ruth 1:21</a>",
      "comment": "Boaz’s generosity contrasts the emptiness Naomi felt earlier, spiritually implying the fullness God brings to the faithful (see John 10:10)."
    },
    {
      "pk": 8003018,
      "translation": "AIV",
      "book": 8,
      "bookName": "Ruth",
      "bookAbbreviation": "Ruth",
      "chapter": 3,
      "verse": 18,
      "text": "Then she said, 'Wait, my daughter, until you know how the matter turns out, for the man will not rest but will settle the matter today.'",
      "links": "<a href='/AIV/19/37/7'>Ps. 37:7</a>; <a href='/AIV/8/4/1'>Ruth 4:1</a>",
      "comment": "Naomi counsels patient trust in Boaz—trust that God’s providence is at work, and His chosen instruments are faithful. This patience is echoed in Psalm 37:7 and points to hope fulfilled in the story’s conclusion."
    }
  ],
  "translatedAt": "2025-12-24T02:44:32.743Z"
}