{
  "book": 44,
  "bookName": "Haggai",
  "bookAbbreviation": "Hag",
  "chapter": 2,
  "verses": [
    {
      "pk": 44002001,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 1,
      "text": "On the twenty-first day of the seventh month, the word of the Lord came through Haggai the prophet, saying:",
      "links": "<a href='/AIV/39/1/1'>Mal. 1:1</a>; <a href='/AIV/15/5/1'>Ezra 5:1</a>",
      "comment": "This verse sets the date for the prophecy during the Feast of Tabernacles, emphasizing the importance of God's appointed times for revelation. It reflects a recurring biblical theme of God speaking through His prophets at moments of liturgical significance."
    },
    {
      "pk": 44002002,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 2,
      "text": "\"Speak now to Zerubbabel son of Shealtiel, governor of Judah, and to Joshua son of Jehozadak, the high priest, and to all the remnant of the people, and say,\"",
      "links": "<a href='/AIV/16/7/65'>Neh. 7:65</a>; <a href='/AIV/37/1/1'>Hag. 1:1</a>",
      "comment": "God addresses both civil and religious leaders, highlighting the unity of spiritual and temporal authority in guiding God's people. The mention of the 'remnant' points to God's faithful preservation across generations, anticipating New Testament concepts of the 'faithful flock'."
    },
    {
      "pk": 44002003,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 3,
      "text": "\"Who among you remains who saw this house in its former glory? And how do you see it now? Does it not seem like nothing in your eyes?\"",
      "links": "<a href='/AIV/15/3/12'>Ezra 3:12</a>; <a href='/AIV/26/7/24'>Ezek. 7:24</a>",
      "comment": "God recalls the splendor of Solomon’s temple, contrasting past glories with the current humble state. This tension between visible externals and promised spiritual realities points Forward to the future glory brought by Christ, who establishes a new and greater temple <a href='/AIV/43/2/19-21'>John 2:19-21</a>."
    },
    {
      "pk": 44002004,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 4,
      "text": "\"Yet now be strong, Zerubbabel, says the Lord; and be strong, Joshua son of Jehozadak, high priest; and be strong, all the people of the land, says the Lord. Work, for I am with you, says the Lord of hosts.\"",
      "links": "<a href='/AIV/06/1/6'>Josh. 1:6</a>; <a href='/AIV/24/1/8'>Jer. 1:8</a>",
      "comment": "God repeatedly encourages strength and perseverance, echoing His commands to Joshua when entering the land. Here, God's enduring presence assures the people, resembling Christ’s promise to remain with His Church <a href='/AIV/40/28/20'>Matt. 28:20</a>."
    },
    {
      "pk": 44002005,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 5,
      "text": "\"According to the covenant I made with you when you came out of Egypt, My Spirit remains among you. Do not fear.\"",
      "links": "<a href='/AIV/02/29/45'>Ex. 29:45</a>; <a href='/AIV/04/11/25'>Num. 11:25</a>",
      "comment": "God’s faithfulness to His covenant is shown by the continual dwelling of His Spirit with His people, prefiguring the new covenant’s outpouring of the Spirit <a href='/AIV/44/2/4'>Acts 2:4</a>. This promises lasting divine guidance and presence in the community of believers."
    },
    {
      "pk": 44002006,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 6,
      "text": "\"For thus says the Lord of hosts: Once more, in a little while, I will shake the heavens and the earth, the sea and the dry land.\"",
      "links": "<a href='/AIV/58/12/26'>Heb. 12:26</a>; <a href='/AIV/23/13/13'>Isa. 13:13</a>",
      "comment": "The coming cosmic upheaval points to future eschatological events fulfilled in Christ’s mission and second coming. Hebrews interprets this as the establishment of an unshakable kingdom, anticipating both a historic fulfillment and a spiritual transformation."
    },
    {
      "pk": 44002007,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 7,
      "text": "\"I will shake all nations, and the Desired of all Nations shall come, and I will fill this house with glory, says the Lord of hosts.\"",
      "links": "<a href='/AIV/19/72/17'>Ps. 72:17</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "The 'Desired of all Nations' is widely interpreted as a Messianic figure, prefiguring Christ, whose coming fills the true spiritual temple with glory. Spiritual readings see this as the global longing for salvation embodied in Jesus."
    },
    {
      "pk": 44002008,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 8,
      "text": "\"The silver is Mine, and the gold is Mine, declares the Lord of hosts.\"",
      "links": "<a href='/AIV/24/9/23'>Jer. 9:23</a>",
      "comment": "All material resources ultimately belong to God, reminding believers that physical wealth cannot replace the spiritual glory of God in His house. This doctrine encourages trust in Divine Providence."
    },
    {
      "pk": 44002009,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 9,
      "text": "\"The latter glory of this house shall be greater than the former, says the Lord of hosts. And in this place I will grant peace, declares the Lord of hosts.\"",
      "links": "<a href='/AIV/43/14/27'>John 14:27</a>; <a href='/AIV/60/2/5'>1 Pet. 2:5</a>",
      "comment": "While the rebuilt temple seems less splendid, God promises its future spiritual greatness. This prophecy anticipates both Christ’s presence in the temple and the peace He brings, fulfilled in His Church, a spiritual living temple."
    },
    {
      "pk": 44002010,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 10,
      "text": "On the twenty-fourth day of the ninth month, in the second year of Darius, the word of the Lord came to Haggai the prophet:",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/15/4/5'>Ezra 4:5</a>",
      "comment": "The prophet receives another direct revelation, with careful dating to stress historical accuracy and the ongoing nature of divine instruction."
    },
    {
      "pk": 44002011,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 11,
      "text": "\"Thus says the Lord of hosts: Ask now the priests about the law,\"",
      "links": "<a href='/AIV/03/10/10'>Lev. 10:10</a>; <a href='/AIV/10/15/24'>2 Sam. 15:24</a>",
      "comment": "Priests are charged with interpreting the law, demonstrating the structured ministerial leadership God provides for His people—a pattern continued in consistent spiritual service and magisterial teaching authority."
    },
    {
      "pk": 44002012,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 12,
      "text": "\"If someone carries holy meat in the fold of his garment and touches bread, stew, wine, oil, or any kind of food with the fold, does it become holy?\" The priests answered, \"No.\"",
      "links": "<a href='/AIV/03/6/27'>Lev. 6:27</a>",
      "comment": "Haggai asks about the transmission of holiness, illustrating that holiness is not automatically transferred by mere contact. This distinction is central to understanding sacramental theology, where grace is imparted by God's initiative, not by mechanical or ritualistic means."
    },
    {
      "pk": 44002013,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 13,
      "text": "Then Haggai said, \"If someone who is unclean by touching a dead body touches any of these, does it become unclean?\" The priests answered, \"It does become unclean.\"",
      "links": "<a href='/AIV/03/22/4'>Lev. 22:4</a>; <a href='/AIV/04/19/22'>Num. 19:22</a>",
      "comment": "Impurity is much more easily transmitted than holiness, indicating humanity's fallen condition after original sin. Spiritual readings see this as a reminder of the need for cleansing before approaching God, fulfilled through Christ’s redemptive work."
    },
    {
      "pk": 44002014,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 14,
      "text": "So Haggai answered, \"So it is with this people and with this nation before Me, declares the Lord. And so with every work of their hands; what they offer here is unclean.\"",
      "links": "<a href='/AIV/23/64/6'>Isa. 64:6</a>",
      "comment": "God recognizes the impurity of external religious observance without interior conversion. This foreshadows Christ’s teaching that true worship must be in spirit and truth <a href='/AIV/43/4/23-24'>John 4:23-24</a>."
    },
    {
      "pk": 44002015,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 15,
      "text": "\"Now, consider from this day onward, before stone was placed upon stone in the temple of the Lord,\"",
      "links": "<a href='/AIV/16/4/17'>Neh. 4:17</a>; <a href='/AIV/37/1/14'>Hag. 1:14</a>",
      "comment": "God calls for reflection on the consequences before the rebuilding of the temple. This underscores the principle that God's blessing is intimately connected to faithfulness in worship."
    },
    {
      "pk": 44002016,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 16,
      "text": "\"since those days, when anyone came to a heap of twenty measures, there were only ten; when one came to the wine vat to draw fifty measures, there were only twenty.\"",
      "links": "<a href='/AIV/05/28/22'>Deut. 28:22</a>",
      "comment": "The lack of abundance is a direct result of neglecting God’s house, reflecting the biblical theme that obedience and worship lead to blessing."
    },
    {
      "pk": 44002017,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 17,
      "text": "\"I struck you with blight and mildew and hail in all the works of your hands, yet you did not turn to Me, declares the Lord.\"",
      "links": "<a href='/AIV/05/28/22'>Deut. 28:22</a>; <a href='/AIV/30/4/6-10'>Amos 4:6-10</a>",
      "comment": "Divine chastisement is not arbitrary but a call to repentance. The verse highlights God’s fatherly discipline leading to a deeper conversion and renewal."
    },
    {
      "pk": 44002018,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 18,
      "text": "\"Consider now from this day onward, from the twenty-fourth day of the ninth month, since the day the foundation of the Lord’s temple was laid, consider:\"",
      "links": "<a href='/AIV/37/1/14'>Hag. 1:14</a>; <a href='/AIV/15/3/10'>Ezra 3:10</a>",
      "comment": "God instructs the people to mark a turning point tied to the temple foundation, signifying the importance of sacred space and right worship."
    },
    {
      "pk": 44002019,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 19,
      "text": "\"Is the seed still in the barn? Even now, neither the vine nor the fig tree nor the pomegranate nor the olive tree has yielded fruit. But from this day I will bless you.\"",
      "links": "<a href='/AIV/05/28/4'>Deut. 28:4</a>",
      "comment": "Fruitfulness follows commitment to God’s worship, echoing the theme that spiritual and material blessings are tied to fidelity. This anticipates the abundance promised by Christ <a href='/AIV/43/10/10'>John 10:10</a>."
    },
    {
      "pk": 44002020,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 20,
      "text": "The word of the Lord came a second time to Haggai on the twenty-fourth day of the month:",
      "links": "<a href='/AIV/37/2/1'>Hag. 2:1</a>",
      "comment": "God’s direct, continued communication to Haggai reveals a pattern of active divine leadership and ongoing prophetic ministry."
    },
    {
      "pk": 44002021,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 21,
      "text": "\"Speak to Zerubbabel, governor of Judah, saying, 'I am about to shake the heavens and the earth.'\"",
      "links": "<a href='/AIV/58/12/26'>Heb. 12:26</a>; <a href='/AIV/23/13/13'>Isa. 13:13</a>",
      "comment": "Repeating the earlier prophecy, this affirms Zerubbabel’s special role as leader and the coming renewal that echoes both natural and spiritual upheaval ushered in by Christ’s kingdom."
    },
    {
      "pk": 44002022,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 22,
      "text": "\"I will overturn the throne of kingdoms. I will destroy the strength of the kingdoms of the nations, and I will overthrow the chariots and their riders; horses and their riders shall fall, each by the sword of his brother.\"",
      "links": "<a href='/AIV/26/21/27'>Ezek. 21:27</a>; <a href='/AIV/38/9/13'>Zech. 9:13</a>",
      "comment": "God’s sovereignty over earthly powers is affirmed, recalling His historic interventions and pointing to Christ’s universal kingship established through the Church."
    },
    {
      "pk": 44002023,
      "translation": "AIV",
      "book": 44,
      "bookName": "Haggai",
      "bookAbbreviation": "Hag",
      "chapter": 2,
      "verse": 23,
      "text": "\"On that day, declares the Lord of hosts, I will take you, O Zerubbabel son of Shealtiel, My servant, declares the Lord, and make you like a signet ring—for I have chosen you, declares the Lord of hosts.\"",
      "links": "<a href='/AIV/10/7/14'>2 Sam. 7:14</a>; <a href='/AIV/40/1/12'>Matt. 1:12</a>",
      "comment": "Zerubbabel, as a signet ring, symbolizes legitimate dynastic authority and continuity of God's promises to David, ultimately fulfilled in Christ (see <a href='/AIV/40/1/12'>Matthew 1:12</a>). This verse prefigures the selection and commissioning of spiritual leaders in the new covenant community."
    }
  ],
  "translatedAt": "2025-12-24T09:54:25.980Z"
}