{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 16,
  "verses": [
    {
      "pk": 3016101,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 1,
      "text": "Then Judith sang this song of praise: Begin a song to my God with tambourines, sing to the Lord with cymbals; raise for Him a new psalm, exalt and call on His name.",
      "links": "<a href='/AIV/19/144/9'>Ps. 144:9</a>; <a href='/AIV/19/33/2-3'>Ps. 33:2-3</a>",
      "comment": "Judith begins with a call for liturgical worship, using musical instruments as seen in Psalms. This sets the tone for communal praise and structured worship."
    },
    {
      "pk": 3016102,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 2,
      "text": "For the Lord is a God who crushes wars; He has delivered me from my enemies.",
      "links": "<a href='/AIV/19/18/48'>Ps. 18:48</a>; <a href='/AIV/19/46/9'>Ps. 46:9</a>",
      "comment": "Judith affirms God's power over human conflict and credits Him with personal deliverance, echoing David’s confessions in the Psalms."
    },
    {
      "pk": 3016103,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 3,
      "text": "He brought my camp out from the midst of my persecutors, and the children of my enemy did not overcome me.",
      "links": "<a href='/AIV/19/7/6'>Ps. 7:6</a>; <a href='/AIV/19/118/10'>Ps. 118:10</a>",
      "comment": "God’s protection is personal and communal. There is emphasis on perseverance and victory, a theme later seen in the victorious church."
    },
    {
      "pk": 3016104,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 4,
      "text": "The Lord has cast down those who rose up against my people, the Lord has shattered my enemy by His own hand.",
      "links": "<a href='/AIV/02/14/27'>Ex. 14:27</a>; <a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "Divine action is direct and personal—God Himself fights for His people, a foreshadowing of Christ’s victory over sin."
    },
    {
      "pk": 3016105,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 5,
      "text": "The mighty one came down with his army; their multitude overwhelmed the mountains, their cavalry invaded the valleys.",
      "links": "<a href='/AIV/23/14/7-8'>Isa. 14:7-8</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Physical might is contrasted with God’s greater authority. Trust is placed in the Lord, not human armies."
    },
    {
      "pk": 3016106,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 6,
      "text": "He boasted in his shield and spear, he trusted in his armor and sword—but he did not know the Lord decides the outcome of battles.",
      "links": "<a href='/AIV/09/17/47'>1 Sam. 17:47</a>; <a href='/AIV/19/33/16'>Ps. 33:16</a>",
      "comment": "An echo of David vs. Goliath: Reliance on God over weapons is key. This also hints at the spiritual battle and God's providence."
    },
    {
      "pk": 3016107,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 7,
      "text": "I struck him down by the beauty of my face, but it was the Lord who redeemed me by my diligence.",
      "links": "<a href='/AIV/07/4/21'>Judg. 4:21</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Judith’s unique role is celebrated, yet she emphasizes it is God’s deliverance and her cooperation, together, that wins the day—showing the mysterious union of divine grace and human willingness."
    },
    {
      "pk": 3016108,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 8,
      "text": "Their children were pierced by the enemy, and their warriors were overthrown by my Lord.",
      "links": "<a href='/AIV/19/18/39'>Ps. 18:39</a>",
      "comment": "God’s justice is shown in the defeat of those opposing His people, anticipating eschatological judgment."
    },
    {
      "pk": 3016109,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 9,
      "text": "Let the people celebrate my God’s salvation, let all His chosen ones gather and sing to Him.",
      "links": "<a href='/AIV/19/106/47'>Ps. 106:47</a>; <a href='/AIV/19/149/1'>Ps. 149:1</a>",
      "comment": "The communal aspect of worship and chosen-ness is affirmed, pointing toward the gathered worshipping community."
    },
    {
      "pk": 3016110,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 10,
      "text": "Call out with all your hearts, praise Him with your voices, and glorify Him with your lips and music.",
      "links": "<a href='/AIV/19/30/12'>Ps. 30:12</a>; <a href='/AIV/19/105/1'>Ps. 105:1</a>",
      "comment": "True worship involves the entire person, hinting at the importance of both communal and liturgical praise."
    },
    {
      "pk": 3016111,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 11,
      "text": "For He is a God who overturns all enemies and brings to naught all deceivers with His strength.",
      "links": "<a href='/AIV/19/31/18'>Ps. 31:18</a>; <a href='/AIV/19/21/11'>Ps. 21:11</a>",
      "comment": "God’s sovereignty ensures that injustice and falsehood will not stand—a repeated theme in salvation history."
    },
    {
      "pk": 3016112,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 12,
      "text": "The work of all who exalt themselves will not last, their boasting will vanish into dust.",
      "links": "<a href='/AIV/19/39/5'>Ps. 39:5</a>; <a href='/AIV/19/49/12'>Ps. 49:12</a>",
      "comment": "Mortal pride is fleeting; only what is done in union with God's will endures."
    },
    {
      "pk": 3016113,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 13,
      "text": "O Lord, I will sing a new song to You; You are great and glorious, wonderful in strength, invincible.",
      "links": "<a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/19/145/3'>Ps. 145:3</a>",
      "comment": "The 'new song' echoes Psalm themes of renewal and creative worship, prefiguring the hymns sung by the church in heaven (<a href='/AIV/66/5/9'>Rev. 5:9</a>)."
    },
    {
      "pk": 3016114,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 14,
      "text": "Let all Your creation serve You, for You spoke and they were made; You sent Your breath, and they were formed. No one can resist Your voice.",
      "links": "<a href='/AIV/01/1/1-2'>Gen. 1:1-2</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/43/1/3'>John 1:3</a>",
      "comment": "This verse affirms that creation came from the word and breath of God—important for understanding the Word's creative work referenced in John 1. The breath/spirit motif is a foreshadowing of the Spirit's work."
    },
    {
      "pk": 3016115,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 15,
      "text": "For the mountains will be shaken to their foundations with the waters, the rocks will melt like wax before Your presence, yet Your mercy remains for those who fear You.",
      "links": "<a href='/AIV/19/97/5'>Ps. 97:5</a>; <a href='/AIV/19/103/17'>Ps. 103:17</a>",
      "comment": "Nature responds to God’s majesty, but His mercy remains constant. Mercy for the 'god-fearing' provides hope of lasting covenant."
    },
    {
      "pk": 3016116,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 16,
      "text": "But to all who despise You, You will punish them; before You their pride will be shattered, and they shall be consumed like straw by fire.",
      "links": "<a href='/AIV/19/37/20'>Ps. 37:20</a>; <a href='/AIV/23/5/24'>Isa. 5:24</a>",
      "comment": "Judgment comes on the proud, using imagery of consuming fire, often a sign of divine judgement in the Bible."
    },
    {
      "pk": 3016117,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 17,
      "text": "The Lord will exact vengeance upon them to the end; He will give them up to weeping and lamentation, and they shall disappear from the face of the earth.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>; <a href='/AIV/19/34/16'>Ps. 34:16</a>",
      "comment": "Final judgment and separation from God is underscored, prefiguring the eschatological reckoning."
    },
    {
      "pk": 3016118,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 18,
      "text": "But for those who serve Him, it is not in abundance or by might that they please the Lord, but by steadfast reverence.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/19/147/10-11'>Ps. 147:10-11</a>",
      "comment": "God is pleased not by material offerings, but by deep reverence—a theme connecting Old Testament worship with the interior devotion echoed in New Testament spirituality."
    },
    {
      "pk": 3016119,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 19,
      "text": "So Judith and all the people prayed to God in thanksgiving, and the city kept festival for three months.",
      "links": "<a href='/AIV/03/23/39'>Lev. 23:39</a>; <a href='/AIV/19/81/1-3'>Ps. 81:1-3</a>",
      "comment": "The aftermath is a long, structured festival and public thanksgiving, prefiguring sustained liturgical worship and feasts."
    },
    {
      "pk": 3016120,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 20,
      "text": "Judith remained famous among all the people, throughout her lifetime and even after, as her goodness was remembered.",
      "links": "<a href='/AIV/20/10/7'>Prov. 10:7</a>; <a href='/AIV/19/112/6'>Ps. 112:6</a>",
      "comment": "Judith is honored for her virtue—a link with the tradition of remembering righteous figures, foreshadowing the honor given to exemplary believers through all generations."
    },
    {
      "pk": 3016121,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 21,
      "text": "No one ever harmed her all the days of her life after this victory, and great fear of her remained upon the people.",
      "links": "<a href='/AIV/18/1/10'>Job 1:10</a>",
      "comment": "God’s protection of Judith parallels divine protection promised to those who are faithful in adversity."
    },
    {
      "pk": 3016122,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 22,
      "text": "Judith lived in Bethulia, respected and honored among all, and after many years, she grew old and died.",
      "links": "<a href='/AIV/01/25/8'>Gen. 25:8</a>; <a href='/AIV/20/16/31'>Prov. 16:31</a>",
      "comment": "Honor in old age is seen as a blessing and reward for righteousness, in line with wisdom literature."
    },
    {
      "pk": 3016123,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 23,
      "text": "She freed her maid, and all her property was given to her husband’s family and her own.",
      "links": "<a href='/AIV/20/31/20-21'>Prov. 31:20-21</a>; <a href='/AIV/42/12/33'>Luke 12:33</a>",
      "comment": "Judith’s generosity foreshadows the self-giving found in Christ and the early Christian community."
    },
    {
      "pk": 3016124,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 24,
      "text": "No one else in Israel rose up or troubled them during Judith's lifetime, or for a long time afterwards.",
      "links": "<a href='/AIV/07/3/11'>Judg. 3:11</a>; <a href='/AIV/19/85/8'>Ps. 85:8</a>",
      "comment": "The land enjoyed peace—a common biblical sign of God's favor following faithfulness to His ways."
    },
    {
      "pk": 3016125,
      "translation": "AIV",
      "book": 17,
      "chapter": 16,
      "verse": 25,
      "text": "Judith died at the age of one hundred and five. Her maid buried her in Bethulia, and all Israel mourned for her seven days.",
      "links": "<a href='/AIV/01/50/10'>Gen. 50:10</a>; <a href='/AIV/14/35/24'>2 Chr. 35:24</a>",
      "comment": "The long mourning reflects the depth of respect given to Judith, reminiscent of the honor shown to patriarchs, and sets an example for the commemoration of the faithful. The seven days of mourning parallels Old Testament patterns for honoring righteous leaders."
    }
  ],
  "translatedAt": "2025-12-23T09:18:48.543Z"
}