{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 16,
  "verses": [
    {
      "pk": 18016001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 1,
      "text": "Then Judith sang this song to the Lord: 'Begin a song to my God with tambourines, sing to the Lord with cymbals. Make melody to Him with psalms of praise. Exalt and call upon His name.'",
      "links": "<a href='/AIV/02/15/20'>Ex. 15:20</a>; <a href='/AIV/19/150/4'>Ps. 150:4</a>",
      "comment": "Judith's song mimics the songs of Moses and Miriam in Exodus (Ex. 15), highlighting the tradition of celebrating God's deliverance through music. This echoes the liturgical use of hymns and instruments in worship found throughout Scripture."
    },
    {
      "pk": 18016002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 2,
      "text": "'For the Lord is a God who crushes wars; He has delivered me from the hands of my pursuers.'",
      "links": "<a href='/AIV/02/15/3'>Ex. 15:3</a>; <a href='/AIV/19/18/47'>Ps. 18:47</a>",
      "comment": "Judith attributes the victory to God alone. The theme that God is the one who fights for His people is frequent (see Ex. 15:3, 'The Lord is a man of war'). This reflects the trust in divine intervention characteristic of biblical faith."
    },
    {
      "pk": 18016003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 3,
      "text": "'He brought enemy armies from the mountains of the north. He threw them into confusion, causing them to become the prey of my people.'",
      "links": "<a href='/AIV/07/7/22'>Judg. 7:22</a>; <a href='/AIV/09/14/11'>2 Chr. 14:11</a>",
      "comment": "God's action in confusing and defeating the enemy recalls other Old Testament victories, like Gideon (Judg. 7), showing His sovereignty over nations."
    },
    {
      "pk": 18016004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 4,
      "text": "'The Assyrian came down from the mountains with his thousands; his countless forces blocked the valleys and filled the hills.'",
      "links": "<a href='/AIV/23/10/8-14'>Isa. 10:8-14</a>",
      "comment": "The overwhelming power of the enemy seems daunting, which amplifies the miraculous character of Israel's victory, achieved not by military strength but by God's intervention."
    },
    {
      "pk": 18016005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 5,
      "text": "'He boasted that he would set my people ablaze, and kill my young men with the sword and dash my children to pieces and seize my infants as plunder.'",
      "links": "<a href='/AIV/19/137/8-9'>Ps. 137:8–9</a>; <a href='/AIV/23/10/13'>Isa. 10:13</a>",
      "comment": "This verse illustrates the brutality and pride of Israel's enemies—a common motif. The defeat of such evil by God upholds divine justice."
    },
    {
      "pk": 18016006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 6,
      "text": "'But the Lord Almighty thwarted them by the hand of a woman.'",
      "links": "<a href='/AIV/07/4/9'>Judg. 4:9</a>; <a href='/AIV/11/17/15'>1 Sam. 17:15</a>",
      "comment": "God delivers Israel through a woman, echoing the role of Deborah and Jael (Judg. 4). Such instances highlight God's tendency to choose the lowly to shame the strong (1 Cor. 1:27). In a spiritual sense, this prefigures the role of Mary, the humble handmaid, in God's plan of salvation."
    },
    {
      "pk": 18016007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 7,
      "text": "'The enemy fell, not by young men's might, nor did mighty ones strike him; it was not tall giants who attacked him, but Judith, the daughter of Merari, undid him with the beauty of her face.'",
      "links": "<a href='/AIV/07/4/21'>Judg. 4:21</a>; <a href='/AIV/09/17/49'>1 Sam. 17:49</a>",
      "comment": "Emphasizing that deliverance came through unexpected weakness, not human power, this points to the theme of God's glory manifest in humble instruments—a foreshadowing of the Gospel paradox."
    },
    {
      "pk": 18016008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 8,
      "text": "'She took off her widow’s clothing and put on a linen garment to exalt the oppressed in Israel. She anointed her face with perfume.'",
      "links": "<a href='/AIV/08/3/3'>Ruth 3:3</a>; <a href='/AIV/19/45/7-8'>Ps. 45:7–8</a>",
      "comment": "The change of garment resembles other biblical figures (such as Ruth) preparing for a decisive act. The reference to anointing may allude both to beauty and to spiritual consecration."
    },
    {
      "pk": 18016009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 9,
      "text": "'Her sandals caught his eyes, her beauty captured his heart, and the sword cut through his neck.'",
      "links": "<a href='/AIV/07/5/25-27'>Judg. 5:25–27</a>",
      "comment": "The seduction and downfall of the enemy by a woman’s beauty recalls stories such as Jael and Sisera (Judg. 5). God's providence uses even external things to accomplish His plan."
    },
    {
      "pk": 18016010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 10,
      "text": "'The Persians trembled at her boldness, and the Medes were amazed at her daring.'",
      "links": "<a href='/AIV/06/2/9-11'>Josh. 2:9–11</a>",
      "comment": "The victory’s fame spread among neighboring nations, paralleling how news of Israelite victories often caused fear among their enemies (Josh. 2)."
    },
    {
      "pk": 18016011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 11,
      "text": "'Then my lowly people shouted, the weak cried out, and they were terrified. They lifted their voices and the enemy fled.'",
      "links": "<a href='/AIV/02/14/24-25'>Ex. 14:24–25</a>; <a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "The theme of the 'lowly' being exalted, and God honoring the poor in spirit, anticipates the Beatitudes (Matt. 5:3). God answers the humble cries of His people."
    },
    {
      "pk": 18016012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 12,
      "text": "'Sons of slave-girls thrust them down, pierced them through, and destroyed them. They perished in shame, for they had defied my Lord.'",
      "links": "<a href='/AIV/07/4/21-22'>Judg. 4:21–22</a>",
      "comment": "Even the lowest social classes are empowered by God to bring about victory, highlighting both His justice and His power to exalt the humble."
    },
    {
      "pk": 18016013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 13,
      "text": "'I will sing a new song to my God. O Lord, You are great and glorious, wonderful in strength, invincible.'",
      "links": "<a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "A 'new song' (cf. Ps. 96:1; 98:1) is sung in response to God’s new acts of salvation, which foreshadows the new covenant fulfilled in Christ."
    },
    {
      "pk": 18016014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 14,
      "text": "'Let all Your creation serve You! For You spoke, and they were made; You sent forth Your Spirit and it formed them; no one can resist Your voice.'",
      "links": "<a href='/AIV/01/1/3'>Gen. 1:3</a>; <a href='/AIV/19/33/6'>Ps. 33:6</a>; <a href='/AIV/43/1/1-3'>John 1:1–3</a>",
      "comment": "This verse speaks of creation by the Word and Spirit—key themes in Genesis and John 1. The mention of God's Spirit foreshadows the New Testament’s fuller revelation of the Trinity."
    },
    {
      "pk": 18016015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 15,
      "text": "'For the mountains will be shaken to their foundations with the waters, the rocks will melt like wax before Your face, but for those who fear You, You will always show mercy.'",
      "links": "<a href='/AIV/02/19/18'>Ex. 19:18</a>; <a href='/AIV/19/97/5'>Ps. 97:5</a>",
      "comment": "The imagery evokes God’s power in creation and judgment but also His mercy to those who fear Him. This sets up the concept of divine mercy found throughout Scripture."
    },
    {
      "pk": 18016016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 16,
      "text": "'For every sacrifice offered as a sweet aroma is little in Your sight, and all the fat is too small for a whole burnt offering to You. But the one who fears the Lord is always great.'",
      "links": "<a href='/AIV/19/51/16-17'>Ps. 51:16–17</a>; <a href='/AIV/24/7/22-23'>Jer. 7:22–23</a>",
      "comment": "God values the fear and love of Him above ritual sacrifices, echoing the prophets and Psalmists (Ps. 51:16-17; Hos. 6:6)—a truth fulfilled in the offering of Christ which surpasses all others."
    },
    {
      "pk": 18016017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 17,
      "text": "'Woe to the nations who rise up against my people! The Lord Almighty will punish them on the day of judgment. He will turn their flesh into fire and worms. They will weep in pain forever.'",
      "links": "<a href='/AIV/23/66/24'>Isa. 66:24</a>; <a href='/AIV/41/9/48'>Mark 9:48</a>",
      "comment": "Here, judgment and eternal punishment are described in similar terms to Isaiah 66 and Jesus' words (Mark 9:48). This reflects the biblical teaching on final judgment and the reality of hell."
    },
    {
      "pk": 18016018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 18,
      "text": "Now when they arrived at Jerusalem, they worshipped God. When all the people were purified, they offered their burnt offerings, freewill offerings, and gifts.",
      "links": "<a href='/AIV/03/16/30'>Lev. 16:30</a>",
      "comment": "Worship and ritual purity are emphasized before sacrificial offerings, indicating the link between inner disposition and external worship, which echoes themes later found in the teaching on true worship (John 4:23)."
    },
    {
      "pk": 18016019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 19,
      "text": "Judith dedicated to God all the belongings of Holofernes that the people gave to her, and the canopy that she had taken for herself from his bedroom she offered as a gift of consecration to the Lord.",
      "links": "<a href='/AIV/11/21/23'>1 Sam. 21:9</a>",
      "comment": "Judith’s act of dedicating the spoils to God points to the principle of firstfruits and the sanctification of victory spoils, reinforcing the habit of consecrating victories and gifts to the Lord (cf. 1 Sam. 21:9)."
    },
    {
      "pk": 18016020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 20,
      "text": "All the people rejoiced together with the women for thirty days in Jerusalem, and Judith remained with them, sharing in their joy.",
      "links": "<a href='/AIV/03/23/33-34'>Lev. 23:33–34</a>",
      "comment": "The length of the celebration (thirty days) recalls the great festivals of Israel. The close participation of women, especially Judith, affirms their honorable role in spiritual life."
    },
    {
      "pk": 18016021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 21,
      "text": "She went back to Bethulia and remained on her estate. All her days she was greatly honored throughout the whole land.",
      "links": "<a href='/AIV/10/8/15'>2 Sam. 8:15</a>",
      "comment": "Judith’s return and continued honor reflect the reward for those who faithfully serve God and His people, exemplifying that earthly and heavenly rewards await those who are righteous."
    },
    {
      "pk": 18016022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 22,
      "text": "Before her death, no one ever made advances toward her again, after all the days she lived, from the time when her husband Manasseh died and was gathered to his people.",
      "links": "<a href='/AIV/01/25/8'>Gen. 25:8</a>",
      "comment": "Judith’s lifelong fidelity and her unique status among her people points to the dignity of consecrated life, remaining faithful to God through widowhood—a theme later highlighted by early Christian saints."
    },
    {
      "pk": 18016023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 23,
      "text": "Judith lived one hundred and five years. She set her maidservant free, and she died in Bethulia. She was buried in the cave of her husband Manasseh, and the house of Israel mourned for her seven days.",
      "links": "<a href='/AIV/01/50/10'>Gen. 50:10</a>",
      "comment": "Judith’s freeing of her servant and her honorable burial demonstrate virtue and concern for justice. The seven days of mourning mirror patriarchal customs (Gen. 50:10), expressing her revered status."
    },
    {
      "pk": 18016024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 24,
      "text": "During her lifetime and for many years after her death, no one in Israel ever again spread terror like the days of Judith.",
      "links": "<a href='/AIV/02/1/8'>Ex. 1:8</a>",
      "comment": "Judith’s time is marked as a golden era of security, signifying the blessing that comes through faithfulness to God and His providence."
    },
    {
      "pk": 18016025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 16,
      "verse": 25,
      "text": "But the festival of this victory was kept by the Israelites in all generations.",
      "links": "<a href='/AIV/08/4/7-17'>Ruth 4:7–17</a>",
      "comment": "The enduring commemoration of Judith’s deliverance mirrors the importance of sacred remembrance and tradition. Such celebrations keep alive the memory of God’s deeds and point to the unbroken continuity of faith down through generations, just as the Church continues to celebrate God’s saving works in liturgical life."
    }
  ],
  "translatedAt": "2025-12-24T05:07:54.127Z"
}